{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-18T14:43:36.601935",
    "items": [
        {
            "title": "Quality Power files draft papers with Sebi to raise funds via IPO",
            "link": "https://www.business-standard.com/markets/ipo/quality-power-files-draft-papers-with-sebi-to-raise-funds-via-ipo-124091800880_1.html",
            "description": "Quality Power Electrical Equipments, an energy transmission equipment and power technologies company, has filed preliminary papers with capital market regulator Sebi to raise funds through a initial public offering.\r\nThe initial public offering (IPO) comprises a fresh issue of equity shares aggregating up to Rs 225 crore and an offer for sale (OFS) of up to 1.2 crore equity shares, according to the draft red herring prospectus filed on Monday.\r\nAs part of the OFS, promoter Chitra Pandyan will offload the shares of the IPO-bound company.\r\nThe Pandyan family holds 100 per cent stake in Sangli-based Quality Power.\r\nProceeds from the fresh issue are proposed to be utilised for the acquisition of Mehru Electrical and Mechanical Engineers Pvt Ltd, funding capital expenditure requirements for purchasing plant and machinery.\r\nBesides, the company will also use the funds for inorganic growth through unidentified acquisitions and other strategic initiatives and general corporate purposes.\r\nQuali",
            "pubDate": "2024-09-18T12:40:38.553585"
        },
        {
            "title": "Oswal Pumps files IPO papers with Sebi to raise Rs 1k cr via fresh issue",
            "link": "https://www.business-standard.com/markets/ipo/oswal-pumps-files-ipo-papers-with-sebi-to-raise-rs-1k-cr-via-fresh-issue-124091801178_1.html",
            "description": "Haryana-based Oswal Pumps has filed preliminary papers with capital markets regulator Sebi to raise funds through an initial public offering (IPO).\r\nThe IPO is a combination of fresh issue of equity shares worth Rs 1,000 crore and an offer-for-sale (OFS) of up to 1.13 crore equity shares by promoter Vivek Gupta, according to the draft red herring prospectus (DRHP) filed on Tuesday.\r\nThe company may consider raising up to Rs 200 crore in a pre-IPO placement. If such placement is completed, the fresh issue size will be reduced.\r\nProceeds from the fresh issue will be used for funding certain capital expenditures of the company; investment in wholly-owned subsidiary, Oswal Solar in the form of debt or equity, setting up new manufacturing units at Karnal, Haryana, payment of debt, and for general corporate purposes.\r\nOswal Pumps commenced its operations in 2003 by manufacturing low-speed monoblock pumps and over the years, it expanded its operations to manufacture grid-connected high-speed",
            "pubDate": "2024-09-18T14:43:35.489330"
        }
    ]
}