{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-03T12:37:30.848782",
    "items": [
        {
            "title": "Stock Market Today: Iran-Israel war, Sebi F&O rules, KRN Heat IPO listing",
            "link": "https://www.business-standard.com/markets/news/stock-market-today-iran-israel-war-sebi-f-o-rules-krn-heat-ipo-listing-124100300077_1.html",
            "description": "GIFT Nifty signals a gap-down opening for benchmark indices Sensex and Nifty50 on Thursday, hinting a weak start for the markets.",
            "pubDate": "2024-10-03T02:06:32.915356"
        },
        {
            "title": "Hyundai Motor India likely to launch Rs 25,000 crore IPO on Oct 14",
            "link": "https://www.business-standard.com/markets/ipo/hyundai-motor-india-likely-to-launch-rs-25-000-crore-ipo-on-oct-14-124100300858_1.html",
            "description": "Hyundai Motor India Ltd, the Indian arm of South Korean automaker Hyundai, is expected to launch its much-awaited Rs 25,000-crore initial share-sale for public subscription on October 14, people familiar with the development said on Thursday.\r\nThis would be the largest initial public offering (IPO) in India after LIC's initial share sale of Rs 21,000 crore.\r\nAccording to the Draft Red Herring Prospectus (DRHP) filed in June, Hyundai Motor India's proposed IPO is entirely an Offer-for-Sale (OFS) of 142,194,700 equity shares by promoter Hyundai Motor Company, with no fresh issue component.\r\nSources had previously stated that the South Korean automaker is looking to raise at least USD 3 billion (about Rs 25,000 crore) through an initial share sale.\r\nThis development marks a significant milestone for the Indian industry, as it is the first automaker's initial share sale in over two decades, following Japanese automaker Maruti Suzuki's listing in 2003.\r\nThe South Korean parent is diluting s",
            "pubDate": "2024-10-03T12:37:29.778080"
        },
        {
            "title": "Crack the IPO code: 5 tips to boost your chances of IPO allotment",
            "link": "https://www.business-standard.com/video-gallery/general/crack-the-ipo-code-5-tips-to-boost-your-chances-of-ipo-allotment-176329.htm",
            "description": "",
            "pubDate": "2024-10-03T12:37:29.778190"
        }
    ]
}