{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-27T13:55:46.619596",
    "items": [
        {
            "title": "KRN Heat Exchanger IPO closes today: Should you invest amid 124% GMP surge?",
            "link": "https://www.business-standard.com/markets/news/krn-heat-exchanger-ipo-closes-today-should-you-invest-amid-124-gmp-surge-124092700118_1.html",
            "description": "KRN Heat Exchanger IPO has so far garnered a solid response from investors, receiving bids for 63,91,84,780 shares against 1,09,93,000 shares offered, resulting in an oversubscription of 58.14 times",
            "pubDate": "2024-09-27T03:40:28.441991"
        },
        {
            "title": "SME IPO bet, aerial arts: Top personal finance stories of the week",
            "link": "https://www.business-standard.com/finance/personal-finance/sme-ipo-bet-aerial-arts-top-personal-finance-stories-of-the-week-124092700105_1.html",
            "description": "What risks investors face when they back small and medium enterprises and how aerial art is becoming a popular fitness culture",
            "pubDate": "2024-09-27T03:40:28.442082"
        },
        {
            "title": "Diffusion Engineers IPO Day 2: GMP up 54%; Should you invest or wait?",
            "link": "https://www.business-standard.com/markets/news/diffusion-engineers-ipo-day-2-gmp-up-54-should-you-invest-or-wait-124092700168_1.html",
            "description": "The unlisted shares of Diffusion Engineers were commanding a premium of Rs 90, which translates to a GMP of 53.57 per cent against the upper end of the IPO price of Rs 168",
            "pubDate": "2024-09-27T04:34:42.437760"
        },
        {
            "title": "Akme Fintrade inks pact with MAS Financial for MSME co-lending; stock up 3%",
            "link": "https://www.business-standard.com/markets/news/akme-fintrade-inks-pact-with-mas-financial-for-msme-co-lending-stock-up-3-124092700352_1.html",
            "description": "The rise in Akme Fintrade share price came after the company said that it has partnered with MAS Financial Services for co-lending in the MSME sector.",
            "pubDate": "2024-09-27T06:18:57.808257"
        },
        {
            "title": "822 IPOs globally aimed to raise $65bn till August; India tops APAC tally",
            "link": "https://www.business-standard.com/markets/news/822-ipos-globally-aimed-to-raise-65bn-till-august-india-tops-apac-tally-124092700380_1.html",
            "description": "Investors, the report suggests, are shifting towards larger, more valuable IPOs at the global level despite the reduced number of listings thus far in 2024",
            "pubDate": "2024-09-27T06:41:48.204257"
        },
        {
            "title": "Zomato share price falls 4% after Swiggy files IPO DRHP with Sebi",
            "link": "https://www.business-standard.com/markets/news/zomato-share-price-falls-4-after-swiggy-files-ipo-drhp-with-sebi-124092700581_1.html",
            "description": "Swiggy's IPO move had investors buzzing about the competitive landscape in the food delivery market as Zomato's scrip slipped up to 3.64 per cent to an intraday low of Rs 273.50 per share.",
            "pubDate": "2024-09-27T08:54:17.839696"
        },
        {
            "title": "Swiggy's recipe for success: DRHP reveals key ingredients ahead of IPO",
            "link": "https://www.business-standard.com/markets/news/swiggy-s-recipe-for-success-drhp-reveals-key-ingredients-ahead-of-ipo-124092700633_1.html",
            "description": "As investors await further details for this buzzing IPO, here are some of the key details related to Swiggy, as outlined in the DRHP papers",
            "pubDate": "2024-09-27T09:39:13.022285"
        },
        {
            "title": "Investors subscribe KRN Heat's IPO 213.26 times offer size on closing day",
            "link": "https://www.business-standard.com/markets/ipo/investors-subscribe-krn-heat-s-ipo-213-26-times-offer-size-on-closing-day-124092700990_1.html",
            "description": "The initial share sale of KRN Heat Exchanger and Refrigeration Ltd garnered 213.26 times subscription on the closing day of bidding on Friday, helped by overwhelming participation from institutional investors.\r\nThe Initial Public Offer (IPO) got bids for 2,34,43,38,230 shares against 1,09,93,000 shares on offer, according to NSE data.\r\nNon-Institutional Investors subscribed 430.39 times the offer, while Qualified Institutional Buyers (QIBs) received 253.04 times subscription. The portion for Retail Individual Investors (RIIs) got subscribed 96.50 times.\r\nThe IPO of KRN Heat Exchanger and Refrigeration Ltd was fully subscribed within minutes of opening for share sale on Wednesday and finally ended with 23.73 times subscription.\r\nKRN Heat Exchanger and Refrigeration Ltd on Tuesday said it has raised Rs 100 crore from anchor investors.\r\nThe Rs 342-crore IPO is available for public subscription in the price range of Rs 209-220 per share.\r\nKRN Heat Exchanger's IPO involves a fresh issue of",
            "pubDate": "2024-09-27T13:55:45.872368"
        }
    ]
}