{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-26T17:28:31.609838",
    "items": [
        {
            "title": "Stock Market Today: Nifty expiry, Israel conflict & Kalana Ispat IPO debut",
            "link": "https://www.business-standard.com/markets/news/stock-market-today-nifty-expiry-israel-conflict-kalana-ispat-ipo-debut-124092600083_1.html",
            "description": "The uptrend was signalled by GIFT Nifty futures that were trading about 50 points higher than Nifty futures' last close, at 26,047.50, around 7:30 AM.",
            "pubDate": "2024-09-26T02:40:26.272841"
        },
        {
            "title": "Manba Finance IPO allotment today: Check status, GMP, likely listing price",
            "link": "https://www.business-standard.com/markets/news/manba-finance-ipo-allotment-today-check-status-gmp-likely-listing-price-124092600135_1.html",
            "description": "Once the allotment is finalized, investors can check the allotment status of the Manba Finance IPO by visiting the official websites of either BSE, NSE, or Link Intime",
            "pubDate": "2024-09-26T03:51:43.448063"
        },
        {
            "title": "Diffusion Engineers IPO opens today: GMP up 48%; is it worth your money?",
            "link": "https://www.business-standard.com/markets/news/diffusion-engineers-ipo-opens-today-gmp-up-48-is-it-worth-your-money-124092600231_1.html",
            "description": "The unlisted shares of Diffusion Engineers were trading at a premium of Rs 80, or 48 per cent against the upper end of the IPO price, reflecting positive market sentiments for the public issue",
            "pubDate": "2024-09-26T05:13:20.644673"
        },
        {
            "title": "Icon Facilitators plans to raise funds via IPO; eyes Rs 100 cr revenue",
            "link": "https://www.business-standard.com/markets/ipo/icon-facilitators-plans-to-raise-funds-via-ipo-eyes-rs-100-cr-revenue-124092600629_1.html",
            "description": "Technical facilities management services provider Icon Facilitators on Thursday announced its plan to launch the initial public offer to raise money for expanding operations and is targeting Rs 100 crore revenue by FY27.\r\nKhambatta Securities Limited has been appointed as the book-running lead manager to oversee the IPO process, a company statement said.\r\nAccording to the statement, the company aims to achieve a remarkable milestone of Rs 100 crore in revenue by the financial year 2027. It reported Rs 49.84 crore revenue from operations in FY24 against Rs 42.96 crore in FY23.\r\nTo support this ambitious growth trajectory, it stated that Icon Facilitators Ltd (IFL) is actively exploring an initial public offering (IPO).\r\nThe IPO will provide the company with the necessary capital to expand its client base, strengthen its geographic presence across India, and invest in cutting-edge technologies to enhance its service offerings, it said.\r\nIFL Managing Director Dinesh Makhija said, \"We are",
            "pubDate": "2024-09-26T10:15:18.326303"
        },
        {
            "title": "IT solution provider Mouri Tech files IPO papers to raise Rs 1,500 crore",
            "link": "https://www.business-standard.com/markets/ipo/it-solution-provider-mouri-tech-files-ipo-papers-to-raise-rs-1-500-crore-124092601265_1.html",
            "description": "IT solution provider Mouri Tech has filed preliminary papers with markets regulator Sebi to raise Rs 1,500 crore through an initial public offering (IPO).\r\nThe Hyderabad-based company's proposed IPO comprises a fresh issue of equity shares worth Rs 440 crore, and an offer-for-sale (OFS) of shares worth Rs 1,060 crore by promoters and an existing shareholder, according to the draft red herring prospectus (DRHP).\r\nThe offer includes a reservation for subscription by eligible employees,\r\nUnder the OFS, promoters Sujai Paturu, and Anil Reddy Yerramreddy will be selling shares worth Rs 615 crore, and Rs 316 crore, respectively. Further, existing shareholder Srinivasu Rao Sandaka intends to offload equity shares valued Rs 129 crore.\r\nThe company may consider raising Rs 88 crore in a Pre-IPO Placement round.  If such placement is completed, the fresh issue size will be reduced.\r\nProceeds from the fresh issue to the tune of Rs 165 crore will be used for debt payment of its subsidiary MT USA an",
            "pubDate": "2024-09-26T17:28:30.577168"
        }
    ]
}