{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-10T14:20:53.862460",
    "items": [
        {
            "title": "Shree Tirupati Balajee IPO allotment today: check status, GMP & more",
            "link": "https://www.business-standard.com/markets/news/shree-tirupati-balajee-ipo-allotment-today-check-status-gmp-more-124091000124_1.html",
            "description": "Once the allotment of Shree Tirupati Balajee IPO is finalised, investors can check the allotment status by visiting the official websites of BSE, NSE, or Link Intime India, the registrar for the issue",
            "pubDate": "2024-09-10T03:54:52.764973"
        },
        {
            "title": "Gala Precision Engineering shares soar nearly 49% in market debut",
            "link": "https://www.business-standard.com/markets/ipo/gala-precision-engineering-shares-soar-nearly-49-in-market-debut-124090900816_1.html",
            "description": "Shares of Gala Precision Engineering Ltd ended with a premium of nearly 49 per cent against the issue price of Rs 529 on Monday.\r\nThe stock made its debut at Rs 750, a jump of 41.77 per cent from the issue price on the BSE. During the day, it soared 48.85 per cent to Rs 787.45. Shares of the firm ended at Rs 787.05, up 48.78 per cent.\r\nOn the NSE, it listed at Rs 721.10, surging 36.31 per cent. The stock ended at Rs 757.15, reflecting a jump of 43.12 per cent.\r\nThe company's market valuation stood at Rs 997.19 crore.\r\nIn terms of volume, 3.97 lakh shares of the firm were traded on the BSE and 7.89 lakh shares on the NSE during the day.\r\nThe initial public offer of Gala Precision Engineering garnered 201.44 times subscriptions on the closing day of bidding on Wednesday.\r\nThe initial share sale had a price band of Rs 503-529 per share.\r\nThe Rs 168-crore IPO had a combination of a fresh issue of 25.58 lakh equity shares worth Rs 135.34 crore and an Offer For Sale (OFS) of 6.16 lakh equity",
            "pubDate": "2024-09-10T03:54:52.765065"
        },
        {
            "title": "Bajaj Housing Finance IPO Day 2: GMP soars 92%; should you subscribe?",
            "link": "https://www.business-standard.com/markets/news/bajaj-housing-finance-ipo-day-2-gmp-soars-92-should-you-subscribe-124091000166_1.html",
            "description": "Shares of Bajaj Housing Finance were quoted trading at a premium of Rs 64 or 91.43 per cent in the grey market, indicating a positive market sentiment for the IPO",
            "pubDate": "2024-09-10T04:35:31.848364"
        },
        {
            "title": "Opens Today! PN Gadgil Jewellers IPO GMP zooms 50%. Should you bid?",
            "link": "https://www.business-standard.com/markets/news/opens-today-pn-gadgil-jewellers-ipo-gmp-zooms-50-should-you-bid-124091000297_1.html",
            "description": "P N Gadgil Jewellers IPO opened for public subscription today. Should you bid for the public issue or not? Check the brokerage call and other key details here",
            "pubDate": "2024-09-10T05:19:44.783755"
        },
        {
            "title": "Kross IPO Day 2: GMP holds at 20%; should you park your money here?",
            "link": "https://www.business-standard.com/markets/news/kross-ipo-day-2-gmp-holds-at-20-should-you-park-your-money-here-124091000430_1.html",
            "description": "Kross IPO subscription status: Retail Individual Investors have placed the highest bid of 2.16 times, followed by Non-Institutional Investors at 1.01 times",
            "pubDate": "2024-09-10T06:26:55.687614"
        },
        {
            "title": "Upcoming IPO alert! Influx Healthtech files DRHP with NSE Emerge; details",
            "link": "https://www.business-standard.com/markets/news/upcoming-ipo-alert-influx-healthtech-files-drhp-with-nse-emerge-details-124091000613_1.html",
            "description": "The Influx Healthtech IPO comprises a fresh issuance of 46,32,000 equity shares, and an offer for sale of up to 13,68,000 equity shares, each with a face value of Rs 10",
            "pubDate": "2024-09-10T08:46:26.721067"
        },
        {
            "title": "Investors subscribe PN Gadgil's IPO two times offer size on day 1",
            "link": "https://www.business-standard.com/markets/ipo/investors-subscribe-pn-gadgil-s-ipo-two-times-offer-size-on-day-1-124091001043_1.html",
            "description": "The initial public offer of jewellery retail chain PN Gadgil Jewellers Ltd got fully subscribed within a few hours of opening for bidding on Tuesday and ended the day with a two-time subscription.\r\nThe Rs 1,100 crore initial share sale received bids for 3,38,86,720 shares against 1,68,85,964 shares on offer, translating into 2.01 times subscription, according to the NSE data.\r\nThe portion for non-institutional investors got booked 3.26 times and the quota for Retail Individual Investors (RIIs) received 2.61 times subscription. The Qualified Institutional Buyers (QIBs) part got subscribed 1 per cent.\r\nPN Gadgil Jewellers Ltd on Monday said it has raised Rs 330 crore from anchor investors.\r\nThe initial public offering (IPO) will conclude on September 12. The price band for the offer has been fixed at Rs 456-480 per share.\r\nThe Maharashtra-based company's IPO is a combination of a fresh issue of equity shares worth up to Rs 850 crore and an offer for sale (OFS) of equity shares to the tun",
            "pubDate": "2024-09-10T13:21:41.134436"
        },
        {
            "title": "Ventive Hospitality files papers with Sebi to raise Rs 2,000 cr through IPO",
            "link": "https://www.business-standard.com/markets/ipo/ventive-hospitality-files-papers-with-sebi-to-raise-rs-2-000-cr-through-ipo-124091001008_1.html",
            "description": "The Pune-based company's IPO is completely a fresh issue of equity shares with no offer-for-sale (OFS) component, according to the draft red herring prospectus (DRHP)",
            "pubDate": "2024-09-10T13:21:41.134523"
        },
        {
            "title": "Kross IPO receives 2.56 times subscription on second day of offer",
            "link": "https://www.business-standard.com/markets/ipo/kross-ipo-receives-2-56-times-subscription-on-second-day-of-offer-124091001079_1.html",
            "description": "The initial share sale of auto parts manufacturer Kross Ltd received 2.56 times subscription on the second day of bidding on Tuesday.\r\nThe initial public offer got bids for 3,92,75,140 shares against 1,53,50,877 shares on offer, as per NSE data.\r\nThe quota for Retail Individual Investors (RIIs) garnered 3.87 times subscription while the category for non-institutional investors got subscribed 2.87 times. The Qualified Institutional Buyers (QIBs) part received 2 per cent subscription.\r\nKross Ltd on Friday said it has mobilised Rs 150 crore from anchor investors.\r\nThe Jamshedpur-based company's IPO is a combination of a fresh issue of equity shares worth Rs 250 crore and an Offer-for-Sale (OFS) aggregating up to Rs 250 crore by the promoters.\r\nThe OFS portion consists of equity shares to the tune of up to Rs 168 crore by Sudhir Rai and Rs 82 crore by Anita Rai.\r\nThe issue, with a price band of Rs 228-240 per share, will conclude on September 11.\r\nKross proposes to utilise the net proceeds",
            "pubDate": "2024-09-10T13:47:09.951696"
        },
        {
            "title": "P S Raj Steels plans to raise capital through IPO to fund growth plans",
            "link": "https://www.business-standard.com/markets/ipo/p-s-raj-steels-plans-to-raise-capital-through-ipo-to-fund-growth-plans-124091000982_1.html",
            "description": "Stainless-steel pipes and tubes manufacturers and suppliers P S Raj Steels Ltd (PSSR) on Tuesday said it planning to raise funds through an initial public offering (IPO) very soon to fund its growth plans.\r\n\"Looking to expand its business beyond the existing markets in India, the Hisar-headquartered company has set its sights on an IPO,\" PSSR said in a statement.\r\nThe company also announced plans to achieve Rs 500 crore in revenue by FY27.\r\nThe company has appointed Khambatta Securities Ltd as the book running lead manager to the offer.\r\nThe company operates a manufacturing plant with an installation capacity of 13,460 metric tonnes per annum, which is spread over an area of three acres in Hisar, Haryana.\r\nIt supplies finished goods under the brand name 'PSSR' in 19 states across India, including Uttar Pradesh, Haryana, Punjab, Madhya Pradesh, Delhi, and Rajasthan.\r\n\"In pursuit of expanding our business across India and strengthening it in the existing markets, we are planning to raise",
            "pubDate": "2024-09-10T14:20:52.236276"
        },
        {
            "title": "Data center operator Switch weighs IPO at about $40 bn valuation: Report",
            "link": "https://www.business-standard.com/markets/ipo/data-center-operator-switch-weighs-ipo-at-about-40-bn-valuation-report-124091001181_1.html",
            "description": "The investment firms that own Switch have in recent weeks held preliminary talks with investment bankers on the potential stock market flotation that could happen as early as 2025",
            "pubDate": "2024-09-10T14:20:52.236368"
        }
    ]
}