{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-11T10:50:12.674828",
    "items": [
        {
            "title": "Market Today: TCS Q2 nos, NSE weekly options changes, Oil gains, Israel war",
            "link": "https://www.business-standard.com/markets/news/market-today-tcs-q2-nos-nse-weekly-options-changes-oil-gains-israel-war-124101100067_1.html",
            "description": "At 6:30 AM, GIFT Nifty Futures were trading 39 points lower at 25,079 levels, indicating a weak start for the Indian bourses.",
            "pubDate": "2024-10-11T02:06:43.769049"
        },
        {
            "title": "IPO-bound Oyo rejigs its top leadership team with five elevations",
            "link": "https://www.business-standard.com/companies/start-ups/ipo-bound-oyo-rejigs-its-top-leadership-team-with-five-elevations-124101100593_1.html",
            "description": "Sonal Sinha, who joined Oyo in 2015, will be responsible for overseeing Oyo's international business operations, revenue, and spearheading strategic initiatives across the US",
            "pubDate": "2024-10-11T10:30:29.962754"
        },
        {
            "title": "IPO aimed to further Indianise operations: Hyundai Motor India COO",
            "link": "https://www.business-standard.com/markets/ipo/ipo-aimed-to-further-indianise-operations-hyundai-motor-india-coo-124101100615_1.html",
            "description": "The upcoming Rs 27,870 crore initial public  offering of the Indian arm of South Korean automaker Hyundai, the first such instance of the company listing its subsidiary in an overseas market, is aimed to further Indianise operations, a senior company official said on Friday.\r\nHyundai Motor India Ltd's initial public offering (IPO), the largest in the country's history, will open for public subscription on October 15 and conclude on October 17. Anchor investors will bid on October 14.\r\n\"We have been in India now for more than 26 years.  We have a very high market share. We are at number two position in India in the passenger vehicle space. We have got so much love and affection from the people of India. So we believe this is the right time to take one step forward and even further Indianise our operations,\" Hyundai Motor India Ltd (HMIL) COO Tarun Garg told PTI.\r\nHe further said,\" The whole aim is to really become the most trusted brand of India.\"\r\nGarg was responding to a query behind",
            "pubDate": "2024-10-11T10:50:12.189871"
        }
    ]
}