{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-10T16:57:51.850100",
    "items": [
        {
            "title": "Garuda Construction IPO ends today: GMP falls flat; should you bid?",
            "link": "https://www.business-standard.com/markets/news/garuda-construction-ipo-ends-today-gmp-falls-flat-should-you-bid-124101000185_1.html",
            "description": "The three-day subscription window to bid for the Garuda Construction IPO, which has been oversubscribed 4.10 times, concludes today",
            "pubDate": "2024-10-10T04:32:11.848548"
        },
        {
            "title": "It has been stock picker's market since quite some time now: Rajesh Bhatia",
            "link": "https://www.business-standard.com/markets/news/it-has-been-a-stock-picker-s-market-since-quite-some-time-now-rajesh-bhatia-124101000213_1.html",
            "description": "Our emphasis is on careful stock selection within sectors, rather than making significant overweight or underweight sector bets, Bhatia said",
            "pubDate": "2024-10-10T04:51:51.327301"
        },
        {
            "title": "Hyundai Motor India's mega IPO: Will this be a Diwali bonanza for Seoul?",
            "link": "https://www.business-standard.com/markets/news/hyundai-motor-india-s-mega-ipo-will-this-be-a-diwali-bonanza-for-seoul-124101000387_1.html",
            "description": "Despite contributing only 6.5 per cent of global revenues and 8 per cent of profitability, Hyundai's India unit will be valued at 42 per cent of the parent company's market capitalisation upon listing",
            "pubDate": "2024-10-10T06:43:54.262178"
        },
        {
            "title": "Why Samir Arora thinks investing in Auto industry is a 'Ridiculous Trade'?",
            "link": "https://www.business-standard.com/markets/news/why-samir-arora-thinks-investing-in-auto-industry-is-a-ridiculous-trade-124101000552_1.html",
            "description": "Ahead of the opening of the much-awaited Hyundai Motor India IPO, Samir Arora of Helios Capital has shared his outlook on the auto industry. Here's what the market expert thinks",
            "pubDate": "2024-10-10T08:43:42.207714"
        },
        {
            "title": "Garuda Construction IPO gets subscribed 7.55 times on final day of offer",
            "link": "https://www.business-standard.com/markets/ipo/garuda-construction-ipo-gets-subscribed-7-55-times-on-final-day-of-offer-124101001280_1.html",
            "description": "The initial public offering (IPO) of Garuda Construction and Engineering has received 7.55 times on the final day of the share sale on Thursday.\r\nThe initial share sale received bids for 15,03,44,299 shares against 1,99,04,862 shares on offer, according to data available with the NSE.\r\nThe category meant for Retail Individual Investors (RIIs) got subscribed 10.81 times while the quota for non-institutional investors received 9.03 times subscription.\r\nThe portion for Qualified Institutional Buyers (QIBs) garnered 1.24 times subscription.\r\nGaruda Construction and Engineering on Monday said it has raised Rs 75 crore from anchor investors.\r\nIt has fixed a price band of Rs 92-95 per share for its IPO.\r\nThe IPO is a mix of fresh issue of 1.83 crore equity shares and an offer of sale (OFS) of 95 lakh equity shares by promoter PKH Ventures.\r\nThe IPO size has been pegged at Rs 264 crore at the upper end of the price band.\r\nProceeds from its fresh issuance to the extent of Rs 100 crore will be u",
            "pubDate": "2024-10-10T16:57:51.323771"
        }
    ]
}