{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-01T07:07:58.100595",
    "items": [
        {
            "title": "Baazar Style Retail IPO receives 72% subscription on day 1 of offer",
            "link": "https://www.business-standard.com/markets/ipo/baazar-style-retail-ipo-receives-72-subscription-on-day-1-of-offer-124083001061_1.html",
            "description": "The initial public offer of Rekha Jhunjhunwala-backed value fashion retailer Baazar Style Retail received 72 per cent subscription on the first day of bidding on Friday.\r\nThe initial share sale got bids for 1,08,18,182 shares against 1,50,30,116 shares on offer, as per NSE data.\r\nThe quota for Retail Individual Investors (RIIs) fetched 82 per cent subscription while the category for Qualified Institutional Buyers (QIBs) got subscribed 70 per cent. The portion for non-institutional investors garnered 47 per cent subscription.\r\nBaazar Style Retail Ltd on Thursday said it has collected Rs 250 crore from anchor investors.\r\nThe Rs 835-crore initial public offering (IPO) will conclude on September 3. The price band has been fixed at Rs 370-389 per share.\r\nThe IPO is a combination of a fresh issue of equity shares worth Rs 148 crore and an offer for sale (OFS) of up to 1.76 crore valued at Rs 687 crore (at the upper end of the price band) by promoter group entities and other selling ...",
            "pubDate": "2024-09-01T07:07:58.099950"
        },
        {
            "title": "ECOS Mobility IPO ends today: should you bid? Check GMP & other details",
            "link": "https://www.business-standard.com/markets/news/ecos-mobility-ipo-ends-today-should-you-bid-check-gmp-other-details-124083000418_1.html",
            "description": "The three-day subscription window to bid for the ECOS Mobility IPO, which is offered at a price band of Rs 318-334 and a lot size of 44 shares, ends today",
            "pubDate": "2024-09-01T07:07:58.099993"
        },
        {
            "title": "Wait Over! Premier Energies IPO allotment today; check status, GMP & more",
            "link": "https://www.business-standard.com/markets/news/wait-over-premier-energies-ipo-allotment-today-check-status-gmp-more-124083000267_1.html",
            "description": "Premier Energies shares are commanding a GMP (Grey Market Premium) of nearly Rs 421, or 93.56 per cent over the upper end of the IPO price, indicating solid listing gains for investors",
            "pubDate": "2024-09-01T07:07:58.100022"
        },
        {
            "title": "GMP zooms 33%! Should you bid for Baazar Style Retail IPO on opening day?",
            "link": "https://www.business-standard.com/markets/news/gmp-zooms-33-should-you-bid-for-baazar-style-retail-ipo-on-opening-day-124083000179_1.html",
            "description": "Several brokerages, including Geojit, Deven Choksey Research, and Swastika Investmart, have reviewed the Bazaar Style Retail IPO, and shared their outlook for investors",
            "pubDate": "2024-09-01T07:07:58.100049"
        },
        {
            "title": "Market buoyancy significantly boosts success rate of firms launching IPOs",
            "link": "https://www.business-standard.com/markets/ipo/market-buoyancy-significantly-boosts-success-rate-of-firms-launching-ipos-124082701176_1.html",
            "description": "The IPO filing-to-approval lapsing ratio this year is the best in three years, underscoring the improvement in the IPO market's buoyancy",
            "pubDate": "2024-09-01T07:07:58.100076"
        },
        {
            "title": "Ecos Mobility IPO gets subscribed 9.55 times on second day of offer",
            "link": "https://www.business-standard.com/markets/ipo/ecos-mobility-ipo-gets-subscribed-9-55-times-on-second-day-of-offer-124082901006_1.html",
            "description": "The initial public offer of chauffeur-driven mobility provider Ecos (India) Mobility & Hospitality received 9.55 times subscription on the second day of bidding on Thursday.\r\nThe Rs 601 crore initial share sale received bids for 12,03,58,964 shares against 1,26,00,000 shares on offer, as per NSE data.\r\nThe portion for non-institutional investors garnered 23.47 times subscription while the quota for Retail Individual Investors (RIIs) got subscribed 8.99 times. The category for Qualified Institutional Buyers (QIBs) received 10 per cent subscription.\r\nThe Initial Public Offer (IPO) of Ecos (India) Mobility & Hospitality got fully subscribed on the first day of bidding on Wednesday.\r\nThe initial share sale is entirely an Offer For Sale (OFS) of up to 1,80,00,000 equity shares.\r\nThe IPO has a price range of Rs 318-334 a share.\r\nEcos (India) Mobility & Hospitality Ltd on Tuesday said it has raised Rs 180.36 crore from anchor investors.\r\nSince the public issue is entirely an OFS, the ...",
            "pubDate": "2024-09-01T07:07:58.100104"
        },
        {
            "title": "ECOS Mobility IPO day 2: NIIs subscription surges; Check latest GMP & more",
            "link": "https://www.business-standard.com/markets/news/ecos-mobility-ipo-day-2-niis-subscription-surges-check-latest-gmp-more-124082900400_1.html",
            "description": "Public issue has received the highest bids from Non-Institutional Investors (NIIs) at 11.74 times, followed by Retail Investors at 5.85 times, and Qualified Institutional Buyers (QIBs) at 0.05 times",
            "pubDate": "2024-09-01T07:07:58.100133"
        },
        {
            "title": "Final Hours! Premier Energies IPO ends today; GMP up 88%; Should you bid?",
            "link": "https://www.business-standard.com/markets/news/final-hours-premier-energies-ipo-ends-today-gmp-up-88-should-you-bid-124082900188_1.html",
            "description": "The public issue of Premier Energies has received a positive response from investors, with getting subscribed 6.61 times by the end of the second day of bidding",
            "pubDate": "2024-09-01T07:07:58.100160"
        },
        {
            "title": "Regional Rural Banks evince interest in going public at meet with FM",
            "link": "https://www.business-standard.com/industry/banking/regional-rural-banks-evince-interest-in-going-public-at-meet-with-fm-124082801159_1.html",
            "description": "\"Through the IPO, we aim to enhance our credibility as a prestigious organization to be part of and worth investing in,\" said a senior executive of an RRB",
            "pubDate": "2024-09-01T07:07:58.100186"
        },
        {
            "title": "Orient Tech shares hit 5% upper circuit on BSE; up 48% from IPO price",
            "link": "https://www.business-standard.com/markets/news/orient-tech-shares-make-bumper-debut-list-at-40-premium-on-bse-nse-124082800204_1.html",
            "description": "Orient Technologies shares listed at  Rs 290 on the BSE, reflecting a 40.77 per cent premium over the upper end of its issue price of  Rs 206",
            "pubDate": "2024-09-01T07:07:58.100212"
        },
        {
            "title": "ECOS Mobility IPO hits high gear: GMP jumps 58%; should you bid?",
            "link": "https://www.business-standard.com/markets/news/ecos-mobility-ipo-hits-high-gear-gmp-jumps-58-should-you-bid-124082800169_1.html",
            "description": "ECOS Mobility IPO, which is entirely an offer for sale of 18,000,000 shares with a face value of Rs 2, is available at a price band of Rs 318-334 per share, with a lot size of 44 shares",
            "pubDate": "2024-09-01T07:07:58.100237"
        },
        {
            "title": "CDSL pays Rs 1.3 cr to settle allegations of violation of Sebi directives",
            "link": "https://www.business-standard.com/markets/news/cdsl-pays-rs-1-3-cr-to-settle-allegations-of-violation-of-sebi-directives-124082701413_1.html",
            "description": "Stock broker Groww on Tuesday announced safeguards and measures to protect F&O traders from potential losses, making it one of the firsts to implement curbs at broker level",
            "pubDate": "2024-09-01T07:07:58.100262"
        },
        {
            "title": "National Infrastructure Trust to raise Rs 1,600 crore through IPO",
            "link": "https://www.business-standard.com/markets/ipo/national-infrastructure-trust-to-raise-rs-1-600-crore-through-ipo-124082700865_1.html",
            "description": "In accordance with SEBI Infrastructure Investment Trust (InvIT) regulations and the SEBI guidelines, 75 per cent of offer will be available for a proportionate allocation to institutional investors",
            "pubDate": "2024-09-01T07:07:58.100288"
        },
        {
            "title": "Five most overbought SME IPOs of 2024 see 1100x demand amid frenzy",
            "link": "https://www.business-standard.com/markets/ipo/five-most-overbought-sme-ipos-of-2024-see-1100x-demand-amid-frenzy-124082701114_1.html",
            "description": "Bets exceed Rs 65,000 crore even as these firms looked to raise a cumulative Rs 60 crore",
            "pubDate": "2024-09-01T07:07:58.100313"
        },
        {
            "title": "Ahead of IPO, Ecos India Mobility raises Rs 180.3 cr from anchor investors",
            "link": "https://www.business-standard.com/markets/ipo/ahead-of-ipo-ecos-india-mobility-raises-rs-180-3-cr-from-anchor-investors-124082701352_1.html",
            "description": "Chauffeur-driven mobility provider Ecos (India) Mobility & Hospitality Ltd on Tuesday said it has raised Rs 180.36 crore from anchor investors a day before its initial share sale opening for public subscription.\r\nWhiteOak Capital Mutual Fund (MF), ICICI Prudential MF, Aditya Birla Sun Life MF, Nippon India MF, Troo Capital, Acacia Banyan Partners, Invesco Indio MF, Motilal Oswal MF, Bandhan MF, Edelweiss MF, and Tata MF were the anchor investors, according to a circular uploaded on the BSE website.\r\nFranklin Templeton India MF, OptiMix Global Emerging Markets Share Trust and Nomura India also participated in the anchor round.\r\nThe company has allocated 54 lakh shares to 19 entities at Rs 334 apiece, aggregating the transaction size to Rs 180.36 crore, it showed.\r\nThe Rs 601-crore initial initial public offering (IPO) will open for public subscription on Wednesday and will conclude on Friday. The price band has been set at Rs 318-334 a share.\r\nThe company's maiden public issue is ...",
            "pubDate": "2024-09-01T07:07:58.100342"
        },
        {
            "title": "NSE files for Sebi NOC to gain approval for long-awaited IPO listing",
            "link": "https://www.business-standard.com/markets/ipo/nse-to-file-for-fresh-sebi-no-objection-certificate-for-ipo-approval-124082701163_1.html",
            "description": "In its annual general meeting held on Tuesday, the exchange informed shareholders that the board had given approval to file for a fresh NOC with the market regulator",
            "pubDate": "2024-09-01T07:07:58.100368"
        },
        {
            "title": "Resourceful Automobile's Rs 12 cr IPO oversubscribed by 419 times",
            "link": "https://www.business-standard.com/markets/ipo/resourceful-automobile-s-rs-12-cr-ipo-oversubscribed-by-419-times-124082700776_1.html",
            "description": "The recent Rs 12 crore initial public offering of Resourceful Automobile, a Delhi-based company with just two outlets and a workforce of eight, has taken the market by storm with the issue receiving bids worth close to Rs 4,800 crore.\r\nFounded in 2018, Resourceful Automobile operates under the brand name Sawhney Automobile, dealing in Yamaha two-wheelers. It specialises in the sales and servicing of motorcycles and scooters.\r\nThe company's IPO, which was open for subscription from August 22 to 26, saw an overwhelming response, with bids for 40.76 crore shares against the 9.76 lakh shares on offer translating into a subscription of 419 times on the third day of the bidding process, data showed.\r\nThe SME IPO was subscribed 10.35 times on Day 1 and 74.13 times on Day 2.\r\nOverall, the non-institutional investor category subscribed 315.61 times, while retail investors showed even greater enthusiasm, subscribing 496.22 times.\r\nVK Vijayakumar, Chief Investment Strategist at Geojit Financial .",
            "pubDate": "2024-09-01T07:07:58.100394"
        },
        {
            "title": "Orient Technologies IPO: GMP hints double digit listing gains for investors",
            "link": "https://www.business-standard.com/markets/news/orient-technologies-ipo-gmp-hints-double-digit-listing-gains-for-investors-124082700491_1.html",
            "description": "As investors await the listing of Orient Technologies' shares on the bourses tomorrow, Wednesday, August 28, 2024, the grey market premium hints at a favourable debut for the company's shares",
            "pubDate": "2024-09-01T07:07:58.100419"
        },
        {
            "title": "Rekha Jhunjhunwala set to pocket Rs 106 cr from Baazar Style Retail IPO",
            "link": "https://www.business-standard.com/markets/news/rekha-jhunjhunwala-set-to-pocket-rs-106-cr-from-baazar-style-retail-ipo-124082700356_1.html",
            "description": "Among those investors selling shares is Rekha Rakesh Jhunjhunwala, who owns 5,446,240 shares, representing a 7.69  per cent stake in the company",
            "pubDate": "2024-09-01T07:07:58.100446"
        },
        {
            "title": "Brokerages bet BIG on Premier Energies IPO; should you bid? Details inside",
            "link": "https://www.business-standard.com/markets/news/brokerages-bet-big-on-premier-energies-ipo-should-you-bid-details-inside-124082700178_1.html",
            "description": "The latest grey market premium (GMP) of Premier Energies IPO, which opens for subscription today, was quoted around Rs 358, or 80 per cent, at the upper end of the issue price",
            "pubDate": "2024-09-01T07:07:58.100471"
        }
    ]
}