{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-13T16:37:06.717163",
    "items": [
        {
            "title": "PN Gadgil Jewellers IPO: Will you strike gold? Check allotment status & GMP",
            "link": "https://www.business-standard.com/markets/news/pn-gadgil-jewellers-ipo-will-you-strike-gold-check-allotment-status-gmp-124091300161_1.html",
            "description": "Once the allotment is finalised, investors can check the allotment status of PN Gadgil Jewellers IPO by visiting the official websites of BSE, NSE, or  Bigshare Services",
            "pubDate": "2024-09-13T04:15:59.593290"
        },
        {
            "title": "Western Carriers IPO opens today: Should you bid? Check brokerages calls",
            "link": "https://www.business-standard.com/markets/news/western-carriers-ipo-opens-today-should-you-bid-check-brokerages-calls-124091300248_1.html",
            "description": "Western Carriers (India) IPO has also garnered mostly favourable reviews from several brokerage firms, including Canara Bank Securities, K R Choksey, BP Equities, and Swastika Investmart",
            "pubDate": "2024-09-13T05:18:20.896390"
        },
        {
            "title": "Bajaj Housing Finance IPO GMP zooms over 100%: Investors eye windfall gains",
            "link": "https://www.business-standard.com/markets/news/bajaj-housing-finance-ipo-gmp-zooms-over-100-investors-eye-windfall-gains-124091300581_1.html",
            "description": "The unlisted shares of Bajaj Housing Finance are currently trading at a premium of approximately Rs 75, representing a 107 per cent gain over the IPO issue price",
            "pubDate": "2024-09-13T07:16:05.370857"
        },
        {
            "title": "IPOs next week: Bajaj Housing among 14 listings; 5 new offers on radar",
            "link": "https://www.business-standard.com/markets/news/ipos-next-week-bajaj-housing-among-14-listings-5-new-offers-on-radar-124091300746_1.html",
            "description": "The upcoming week is packed with opportunities for investors, starting with the initial public offerings of Arkade Developers, and Northern Arc Capital",
            "pubDate": "2024-09-13T09:20:01.879625"
        },
        {
            "title": "Arkade Developers raises Rs 122 cr from anchor investors ahead of IPO",
            "link": "https://www.business-standard.com/markets/ipo/arkade-developers-raises-rs-122-cr-from-anchor-investors-ahead-of-ipo-124091301284_1.html",
            "description": "Realty firm Arkade Developers Ltd has raised Rs 122.40 crore from anchor investors ahead of its initial public offering.\r\nOn Tuesday, the company had fixed a price band of Rs 121-128 per share for its Rs 410-crore initial public offering.\r\nThe initial share sale will open for public subscription on September 16 and conclude on September 19.\r\nAccording to a regulatory filing, the company has issued 95,62,500 shares to anchor investors at Rs 128 per share, aggregating to Rs 122.40 crore.\r\nThese investors include BNP Paribas Financial Markets -- ODI, Societe Generale-ODI and Saint Capital Fund.\r\nThe IPO is entirely a fresh issue of equity shares worth Rs 410 crore with no offer-for-sale (OFS) component.\r\nProceeds from the issue will be used for development of the company's ongoing as well as upcoming projects, funding acquisition of future real estate projects and general corporate purposes.\r\nArkade Developers is a fast-growing real estate development company with a significant presence i",
            "pubDate": "2024-09-13T16:37:05.369040"
        },
        {
            "title": "Investors subscribe Western Carriers' IPO 79% times offer size on first day",
            "link": "https://www.business-standard.com/markets/ipo/investors-subscribe-western-carriers-ipo-79-times-offer-size-on-first-day-124091301228_1.html",
            "description": "The Kolkata-based company's initial public offering (IPO) is available for subscription in the price range of Rs 163 to Rs 172 per share",
            "pubDate": "2024-09-13T16:37:05.369128"
        }
    ]
}