{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-09T16:28:04.350574",
    "items": [
        {
            "title": "Brokerages upbeat on Bajaj Housing Finance IPO; GMP up 81%; should you bid?",
            "link": "https://www.business-standard.com/markets/news/brokerages-upbeat-on-bajaj-housing-finance-ipo-gmp-up-81-should-you-bid-124090900097_1.html",
            "description": "Adding to the buzz, the shares of Bajaj Housing Finance are commanding a strong premium in the grey market on the first day of its opening",
            "pubDate": "2024-09-09T03:55:30.061546"
        },
        {
            "title": "IPO Alert: Kross opens today with a 20% GMP surge; should you subscribe?",
            "link": "https://www.business-standard.com/markets/news/ipo-alert-kross-opens-today-with-a-20-gmp-surge-should-you-subscribe-124090900306_1.html",
            "description": "The unlisted shares of Kross were commanding a grey market premium (GMP) of Rs 48 or 20 per cent at the upper end of the IPO price on Monday",
            "pubDate": "2024-09-09T06:34:43.176292"
        },
        {
            "title": "Final Hours! Shree Tirupati Balajee IPO ends today; GMP up 72%; bid now?",
            "link": "https://www.business-standard.com/markets/news/final-hours-shree-tirupati-balajee-ipo-ends-today-gmp-up-88-bid-now-124090900388_1.html",
            "description": "The three-day subscription window to bid for the Shree Tirupati Balajee IPO, which opened on Thursday, September 5, 2024, ends today",
            "pubDate": "2024-09-09T07:21:30.565902"
        },
        {
            "title": "SME IPO surge: These 4 firms invite bids today; price, lot size and more",
            "link": "https://www.business-standard.com/markets/news/sme-ipo-surge-these-4-firms-invite-bids-today-price-lot-size-and-more-124090900369_1.html",
            "description": "A total four small and medium enterprises (SME) initial public offerings (IPO) are inviting bids for their respective issues starting from Monday, 9, September, 2024",
            "pubDate": "2024-09-09T07:21:30.565996"
        },
        {
            "title": "With 19 IPO filings in August, India Inc 'seizing the moment' to go public",
            "link": "https://www.business-standard.com/markets/ipo/with-19-ipo-filings-in-august-india-inc-seizing-the-moment-to-go-public-124090900838_1.html",
            "description": "Amid market buoyancy,  19 IPO filings in August, most  in three years high",
            "pubDate": "2024-09-09T13:33:21.120753"
        },
        {
            "title": "Autoparts maker Kross' IPO receives 88% subscription on first day of offer",
            "link": "https://www.business-standard.com/markets/ipo/autoparts-maker-kross-ipo-receives-88-subscription-on-first-day-of-offer-124090900854_1.html",
            "description": "The initial public offer of auto parts manufacturer Kross Ltd received 88 per cent subscription on the first day of bidding on Monday.\r\nThe initial share sale received bids for 1,34,95,044 shares against 1,53,50,877 shares on offer, according to NSE data.\r\nThe category for Retail Individual Investors (RIIs) received 1.50 times subscription while the portion for non-institutional investors got subscribed 61 per cent.\r\nKross Ltd on Friday said it has mobilised Rs 150 crore from anchor investors.\r\nThe Jamshedpur-based company's IPO is a combination of a fresh issue of equity shares worth Rs 250 crore and an Offer for Sale (OFS) aggregating up to Rs 250 crore by the promoters.\r\nThe OFS portion consists of equity shares to the tune of up to Rs 168 crore by Sudhir Rai and Rs 82 crore by Anita Rai.\r\nThe issue, with a price band of Rs 228-240 per share, will conclude on September 11.\r\nKross proposes to utilise the net proceeds of the fresh issue for the purchase of machinery and equipment, pay",
            "pubDate": "2024-09-09T13:43:49.796837"
        },
        {
            "title": "Ola Electric Mobility rival Ather Energy files for Rs 3,100 crore IPO",
            "link": "https://www.business-standard.com/companies/news/ola-electric-mobility-rival-ather-energy-files-for-rs-3-100-crore-ipo-124090901124_1.html",
            "description": "Part of the IPO proceeds will also be allocated to research and development, marketing initiatives, infrastructure, production activities, and other general corporate purposes",
            "pubDate": "2024-09-09T16:28:03.603148"
        }
    ]
}