{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-02T13:03:54.546161",
    "items": [
        {
            "title": "Brokerages BULLISH on Gala Precision IPO; GMP jumps 45%; Should You Bid?",
            "link": "https://www.business-standard.com/markets/news/brokerages-bullish-on-gala-precision-ipo-gmp-jumps-45-should-you-bid-124090200185_1.html",
            "description": "Several brokerages, including Deven Choksi Research, Anand Rathi, Swastika Investmart, and Choice, have shared their outlook on the Gala Precision Engineering IPO for the investors",
            "pubDate": "2024-09-02T04:52:14.100248"
        },
        {
            "title": "ECOS Mobility IPO allotment today; check status, GMP, likely listing gains",
            "link": "https://www.business-standard.com/markets/news/ecos-mobility-ipo-allotment-today-check-status-gmp-likely-listing-gains-124090200342_1.html",
            "description": "Once the allotment is finalised, investors can check their allotment status on the BSE, NSE, or via Link Intime India, the issue's registrar. Here are the direct links to check the allotment status",
            "pubDate": "2024-09-02T06:27:09.855897"
        },
        {
            "title": "Bazaar Style IPO: Subscription soars on Day 2, GMP up 20%; should you bid?",
            "link": "https://www.business-standard.com/markets/news/bazaar-style-ipo-subscription-soars-on-day-2-gmp-up-20-should-you-bid-124090200401_1.html",
            "description": "The three-day subscription window to bid for the Bazaar Style Retail IPO, available at a price band of Rs 370-389 and a lot size of 38 shares, closes tomorrow",
            "pubDate": "2024-09-02T07:16:44.038544"
        },
        {
            "title": "Lights, Camera, IPO: VFX firm Identical Brains Studios files DRHP; details",
            "link": "https://www.business-standard.com/markets/news/lights-camera-ipo-vfx-firm-identical-brains-studios-files-drhp-details-124090200465_1.html",
            "description": "The company will offer a fresh issuance of up to 36,94,000 equity shares with a face value of Rs 10 apiece through the book-building route",
            "pubDate": "2024-09-02T07:50:05.134171"
        },
        {
            "title": "Premier Energy IPO listing prediction: Will strong GMP fuel 100% returns?",
            "link": "https://www.business-standard.com/markets/news/premier-energy-ipo-listing-prediction-will-strong-gmp-fuel-100-returns-124090200636_1.html",
            "description": "As investors anticipate the company's listing on the BSE and NSE, the strong GMP suggests a positive market reception",
            "pubDate": "2024-09-02T09:58:15.572936"
        },
        {
            "title": "VFX company Identical Brains files draft IPO papers with NSE Emerge",
            "link": "https://www.business-standard.com/markets/ipo/vfx-company-identical-brains-files-draft-ipo-papers-with-nse-emerge-124090200695_1.html",
            "description": "VFX company Identical Brains Studios on Monday said it has filed preliminary IPO papers with NSE Emerge to raise funds through an initial public offering (IPO).\r\nThe Mumbai-headquartered company's initial public offering comprises a fresh issuance of up to 36.94 lakh equity shares with a face value of Rs 10, through the book-building route, according to the draft red herring prospectus (DRHP).\r\nThe firm plans to utilise the proceeds to fund the renovation of the existing office and studio in Andheri; establish Colour Grading Digital Intermediate and Sound Studio set-up at a new branch office in Andheri; establishment of the new branch office in Lucknow; purchase of computers, storage systems and software; further strengthen the existing facilities the company; support the company's incremental working capital requirements and for general corporate purposes.\r\nIdentical Brains Studios offers a comprehensive suite of VFX services in a diverse range of projects such as films, web series, T",
            "pubDate": "2024-09-02T11:07:03.594721"
        },
        {
            "title": "Gala Precision Engineering IPO fully subscribed within minutes of opening",
            "link": "https://www.business-standard.com/markets/news/gala-precision-engineering-ipo-fully-subscribed-within-minutes-of-opening-124090200355_1.html",
            "description": "The initial public offer of Gala Precision Engineering got fully subscribed within minutes of opening for bidding on Monday.\r\nThe initial share sale received bids for 47,77,444 shares against 22,23,830 shares on offer, reflecting 2.15 times subscription, as per NSE data till 11:21 hours.\r\nThe portion for Retail Individual Investors (RIIs) garnered 3.15 times subscription while the quota for non institutional investors got subscribed 2.54 times.\r\nThe initial share sale will conclude on September 4.\r\nGala Precision Engineering Ltd has fixed a price band of Rs 503-529 per share for its Rs 168-crore initial public offering (IPO).\r\nThe IPO is a combination of a fresh issue of 25.58 lakh equity shares worth Rs 135.34 crore and an offer for sale (OFS) of 6.16 lakh equity shares valued at Rs 32.58 crore by promoter group entities and individual shareholders. This aggregates the transaction size to Rs 168 crore at the upper end of the price band of Rs 529.\r\nProceeds from the fresh issue will be",
            "pubDate": "2024-09-02T11:22:26.937360"
        },
        {
            "title": "Market regulator Sebi advises exchanges to be more discerning on SME IPOs",
            "link": "https://www.business-standard.com/markets/news/market-regulator-sebi-advises-exchanges-to-be-more-discerning-on-sme-ipos-124090200837_1.html",
            "description": "Urges SMEs to go for alternative funds before exploring listing option",
            "pubDate": "2024-09-02T12:42:08.169601"
        },
        {
            "title": "54% IPO shares allotted to investors sold within a week, shows Sebi study",
            "link": "https://www.business-standard.com/markets/news/54-ipo-shares-allotted-to-investors-sold-within-a-week-shows-sebi-study-124090200856_1.html",
            "description": "A study by markets regulator Sebi highlighted flipping behaviour among investors in the initial share-sale market with investors (excluding anchor) selling 54 per cent of IPO shares allotted to them by value within a week.\r\nThe study found a strong disposition effect (tendency to prematurely sell assets that have made financial gains) with investors showing a greater propensity to sell IPO shares that posted positive listing gains, compared to those that listed at a loss.\r\nIn light of the increasing participation of retail investors and the heightened oversubscription in recent IPOs, the Securities and Exchange Board of India (Sebi) conducted an in-depth study to analyze investor behaviour in main-board IPOs. The study encompasses data from 144 IPOs listed between April 2021 and December 2023.\r\nDuring the study period, 144 IPOs collectively raised a total of Rs 2.13 lakh crore. Notably, 65 per cent of the total issue size was Offer for Sale (OFS), through which the pre-existing ...",
            "pubDate": "2024-09-02T12:42:08.169692"
        },
        {
            "title": "Markets regulator Sebi places JSW Cement's Rs 4,000 cr IPO on hold",
            "link": "https://www.business-standard.com/markets/ipo/markets-regulator-sebi-places-jsw-cement-s-rs-4-000-cr-ipo-on-hold-124090200966_1.html",
            "description": "Without specifying reasons, Sebi stated that the \"issuance of observations (has been) kept in abeyance,\" according to an update on its website on Monday",
            "pubDate": "2024-09-02T13:03:53.932808"
        }
    ]
}