{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-07T11:42:10.248167",
    "items": [
        {
            "title": "Garuda Construction IPO: 23% GMP, Rs 1,400-cr order book; should you bid?",
            "link": "https://www.business-standard.com/markets/news/garuda-construction-ipo-23-gmp-rs-1-400-cr-order-book-should-you-bid-124100700242_1.html",
            "description": "The public issue comprises a fresh issue of 18,300,000 shares and an offer for sale of 9,500,000 shares with a face value of Rs 5 each",
            "pubDate": "2024-10-07T06:25:59.872215"
        },
        {
            "title": "Hero Motors withdraws DRHP documents for raising Rs 900 crore through IPO",
            "link": "https://www.business-standard.com/markets/ipo/hero-motors-withdraws-drhp-documents-for-raising-rs-900-crore-through-ipo-124100700753_1.html",
            "description": "Hero Motors Ltd, the auto-components firm of the Hero Motors Company (HMC) Group, has withdrawn its documents for an initial public offering (IPO) worth Rs 900 crore, an update with markets regulator Sebi showed on Monday.\r\nIn its draft papers, the company had proposed to raise Rs 500 crore through a fresh issuance of equity shares and an offer for sale (OFS) of shares valued at Rs 400 crore by promoters.\r\nUnder the OFS, O P Munjal Holdings was offloading shares valued at Rs 250 crore while Bhagyoday Investments and Hero Cycles were selling shares to the tune of Rs 75 crore each.\r\nIt had filed its draft red herring prospectus (DRHP) in August with Sebi to seek the regulator's nod to float IPO.\r\nWithout disclosing the reason, the company said its \"DRHP (was) withdrawn on  October 5, 2024\".\r\nGoing by the draft papers, proceeds from the fresh issue was proposed to be used for debt payment and purchase of equipment required for expansion in the capacity of the company's facility in Gautam",
            "pubDate": "2024-10-07T11:42:09.630311"
        }
    ]
}