{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-09T15:22:04.586211",
    "items": [
        {
            "title": "Hyundai Motor India IPO: Key details out; Check timeline, price, GMP & more",
            "link": "https://www.business-standard.com/markets/news/hyundai-motor-india-ipo-key-details-out-check-timeline-price-gmp-more-124100900239_1.html",
            "description": "Hyundai Motor India IPO: Size, price band, lot size, key dates, GMP, objectives, and more - Everything you need to know about India's largest initial public offering",
            "pubDate": "2024-10-09T05:20:28.641256"
        },
        {
            "title": "Garuda Construction IPO Day 2: GMP shows slight uptick; Should you invest?",
            "link": "https://www.business-standard.com/markets/news/garuda-construction-ipo-day-2-gmp-shows-slight-uptick-should-you-invest-124100900313_1.html",
            "description": "The three-day subscription window to bid for the Garuda Construction IPO will conclude on Thursday, October 10, 2024",
            "pubDate": "2024-10-09T06:00:07.047160"
        },
        {
            "title": "IPO lock-in exit wave: Bharti Hexacom, Bajaj Housing, DOMS, among others",
            "link": "https://www.business-standard.com/markets/news/ipo-lock-in-exit-wave-bharti-hexacom-bajaj-housing-indegene-and-others-124100900434_1.html",
            "description": "Here is the list of the companies that will see the end of the lock-in period in the upcoming days, along with their key details",
            "pubDate": "2024-10-09T07:42:34.385366"
        },
        {
            "title": "Hyundai to invest $3 bn IPO proceeds to enhance R&D, new car development",
            "link": "https://www.business-standard.com/markets/ipo/hyundai-to-use-3-billion-record-india-ipo-proceeds-to-develop-new-cars-r-d-124100900627_1.html",
            "description": "The IPO, which will be India's biggest ever, opens to investors next week and will involve the South Korean parent company selling up to a 17.5 per cent stake in its Indian division",
            "pubDate": "2024-10-09T10:35:03.791040"
        },
        {
            "title": "Demat account tally tops 175 mn; rises by 4.4 mn in September 2024",
            "link": "https://www.business-standard.com/markets/news/demat-account-tally-tops-175-mn-rises-by-4-4-mn-in-september-2024-124100900973_1.html",
            "description": "Market experts view the steady pace of demat additions as a positive sign for market stability",
            "pubDate": "2024-10-09T13:52:37.506270"
        },
        {
            "title": "Garuda Construction IPO gets subscribed 4.1 times on 2nd day of offer",
            "link": "https://www.business-standard.com/markets/ipo/garuda-construction-ipo-gets-subscribed-4-1-times-on-2nd-day-of-offer-124100901040_1.html",
            "description": "The initial public offer of Garuda Construction and Engineering got subscribed 4.10 times on the second day of share sale on Wednesday.\r\nThe initial share sale received bids for 8,16,77,366 shares against 1,99,04,862 shares on offer, according to data available with the NSE.\r\nThe portion meant for Retail Individual Investors (RIIs) got subscribed 6.73 times while the quota for non-institutional investors received 2.58 times subscription.\r\nThe category for Qualified Institutional Buyers (QIBs) fetched 91 per cent subscription.\r\nGaruda Construction and Engineering on Monday said it has raised Rs 75 crore from anchor investors.\r\nThe company has fixed a price band of Rs 92-95 per share for its Rs 264-crore initial public offering.\r\nThe initial share sale will conclude on Thursday.\r\nThe IPO is a mix of fresh issue of 1.83 crore equity shares and an offer of sale (OFS) of 95 lakh equity shares by promoter PKH Ventures.\r\nThe IPO size has been pegged at Rs 264 crore at the upper end of the pri",
            "pubDate": "2024-10-09T14:19:47.057351"
        },
        {
            "title": "'If we see demand for EVs in any of our export mkts, we are open to export'",
            "link": "https://www.business-standard.com/companies/interviews/will-decide-our-new-dividend-policy-post-ipo-says-hyundai-motor-india-124100900967_1.html",
            "description": "Unsoo Kim, president, CEO and MD, Wangdo Hur, executive director and CFO, and Tarun Garg, whole time director and COO of Hyundai Motor India outline their plans",
            "pubDate": "2024-10-09T15:22:04.032203"
        }
    ]
}