{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-20T16:34:31.322058",
    "items": [
        {
            "title": "Northern Arc Capital IPO allotment: Check status, GMP, likely listing gains",
            "link": "https://www.business-standard.com/markets/news/northern-arc-capital-ipo-allotment-check-status-gmp-likely-listing-gains-124092000125_1.html",
            "description": "Once the allotment is finalised, investors can check the allotment status of Northern Arc Capital IPO by visiting the official websites of BSE, NSE, or Kfin Technologies, the registrar for the issue",
            "pubDate": "2024-09-20T03:23:01.357147"
        },
        {
            "title": "Three IPOs receive bids over Rs 1.05 trillion; demand outstrips supply",
            "link": "https://www.business-standard.com/markets/ipo/three-ipos-receive-bids-over-rs-1-05-trillion-demand-outstrips-supply-124091901208_1.html",
            "description": "The strong demand from investors is on the back of high grey market premiums. All three will make their debut next week",
            "pubDate": "2024-09-20T03:23:01.357241"
        },
        {
            "title": "IPO allotment today: Check status for Arkade Developers, Western Carriers",
            "link": "https://www.business-standard.com/markets/news/ipo-allotment-today-check-status-for-arkade-developers-western-carriers-124092000193_1.html",
            "description": "Allotment of initial public offerings (IPOs) of Arkade Developers and Western Carriers (India) is likely to be finalised today. Here's how you can check the allotment status of these IPOs online",
            "pubDate": "2024-09-20T04:42:55.530752"
        },
        {
            "title": "SECI plans to launch IPO in 1 or 2 yrs to expand renewable energy capacity",
            "link": "https://www.business-standard.com/industry/news/seci-plans-to-launch-ipo-in-1-or-2-yrs-to-expand-renewable-energy-capacity-124092000845_1.html",
            "description": "State-owned Solar Energy Corporation of India (SECI) will go public to raise funds in next one or two year in order to expand renewable energy capacity in the country, said a top company official.\r\nThe remark comes at a time when India aims to have 500 GW of renewable energy capacity by 2030.\r\nThe 500 GW target is in the pipeline and it will be done, said SECI Chairman and Managing Director R P Gupta.\r\n\"But we have to think beyond 2030. The power demand will be 2,000 GW by 2047,\" he said at a press conference here.\r\nIndia has 207 GW of renewable energy capacity and still needs to add at least 50 GW per annum every year till 2030 to achieve 500 GW target.\r\n\"We would like to go public in next one or two years,\" Gupta said.\r\nThe country's peak power demand has touched an all-time high of around 250 GW in May this year.\r\nSECI's listing on bourses is also important because it is the nodal agency of the Ministry of New & Renewable Energy for tendering renewable energy projects.\r\nGupta said t",
            "pubDate": "2024-09-20T11:53:47.510749"
        },
        {
            "title": "Leela hotels owner Schloss files IPO papers to raise for $599 million",
            "link": "https://www.business-standard.com/markets/ipo/leela-hotels-owner-schloss-files-ipo-papers-to-raise-for-599-million-124092001297_1.html",
            "description": "The company has 12 operational hotels across ten cities in India and is planning to add eight new hotels through 2028, Schloss said in its IPO prospectus",
            "pubDate": "2024-09-20T16:34:29.781318"
        },
        {
            "title": "HDFC Bank's subsidiary HDB Financial Services board clears IPO plans",
            "link": "https://www.business-standard.com/companies/news/hdfc-bank-s-subsidiary-hdb-financial-services-board-clears-ipo-plans-124092000988_1.html",
            "description": "Fresh equity offering upto Rs 2,500 cr plus offer for sale",
            "pubDate": "2024-09-20T16:34:29.781413"
        }
    ]
}