{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-10T03:54:54.187094",
    "items": [
        {
            "title": "Shree Tirupati Balajee IPO allotment today: check status, GMP & more",
            "link": "https://www.business-standard.com/markets/news/shree-tirupati-balajee-ipo-allotment-today-check-status-gmp-more-124091000124_1.html",
            "description": "Once the allotment of Shree Tirupati Balajee IPO is finalised, investors can check the allotment status by visiting the official websites of BSE, NSE, or Link Intime India, the registrar for the issue",
            "pubDate": "2024-09-10T03:54:52.764973"
        },
        {
            "title": "Gala Precision Engineering shares soar nearly 49% in market debut",
            "link": "https://www.business-standard.com/markets/ipo/gala-precision-engineering-shares-soar-nearly-49-in-market-debut-124090900816_1.html",
            "description": "Shares of Gala Precision Engineering Ltd ended with a premium of nearly 49 per cent against the issue price of Rs 529 on Monday.\r\nThe stock made its debut at Rs 750, a jump of 41.77 per cent from the issue price on the BSE. During the day, it soared 48.85 per cent to Rs 787.45. Shares of the firm ended at Rs 787.05, up 48.78 per cent.\r\nOn the NSE, it listed at Rs 721.10, surging 36.31 per cent. The stock ended at Rs 757.15, reflecting a jump of 43.12 per cent.\r\nThe company's market valuation stood at Rs 997.19 crore.\r\nIn terms of volume, 3.97 lakh shares of the firm were traded on the BSE and 7.89 lakh shares on the NSE during the day.\r\nThe initial public offer of Gala Precision Engineering garnered 201.44 times subscriptions on the closing day of bidding on Wednesday.\r\nThe initial share sale had a price band of Rs 503-529 per share.\r\nThe Rs 168-crore IPO had a combination of a fresh issue of 25.58 lakh equity shares worth Rs 135.34 crore and an Offer For Sale (OFS) of 6.16 lakh equity",
            "pubDate": "2024-09-10T03:54:52.765065"
        }
    ]
}