{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-04T18:42:43.604863",
    "items": [
        {
            "title": "ECOS Mobility revs up in weak market, lists at 17% premium on BSE, NSE",
            "link": "https://www.business-standard.com/markets/news/ecos-mobility-revs-up-in-weak-market-lists-at-17-premium-on-bse-nse-124090400171_1.html",
            "description": "Ahead of their debut on the bourses, the shares of Ecos (India) Mobility & Hospitality were quoted at a strong grey market premium of Rs 126 or 37.37 per cent, indicating a favourable market debut",
            "pubDate": "2024-09-04T04:41:38.941637"
        },
        {
            "title": "Baazar Style Retail IPO allotment today; check status, GMP, listing date",
            "link": "https://www.business-standard.com/markets/news/baazar-style-retail-ipo-allotment-today-check-status-gmp-listing-date-124090400278_1.html",
            "description": "Once the allotment is finalised, investors can check their status on the official websites of BSE, NSE, or Link Intime India, the registrar for the issue",
            "pubDate": "2024-09-04T05:42:40.448959"
        },
        {
            "title": "Exicom Tele-Systems drops 5% after Rare Enterprise sells 1.5 mn shares",
            "link": "https://www.business-standard.com/markets/news/exicom-tele-systems-drops-5-after-rare-enterprise-sells-1-5-mn-shares-124090400266_1.html",
            "description": "The fall in the Exicom Telecoms share price came after Late Rakesh Jhunjhunwla-backed entity Rare Enterprises offloaded 15,85,000 shares of Exicom Telecoms at Rs 348.60 per share.",
            "pubDate": "2024-09-04T05:42:40.449053"
        },
        {
            "title": "Gala Precision IPO GMP soars on last bidding day; should you apply today?",
            "link": "https://www.business-standard.com/markets/news/gala-precision-ipo-gmp-soars-on-last-bidding-day-should-you-apply-today-124090400369_1.html",
            "description": "The three-day subscription window to bid for the Gala Precision Engineering IPO, which opened on Monday, September 2, 2024, is set to conclude today",
            "pubDate": "2024-09-04T06:50:37.692935"
        },
        {
            "title": "Upcoming IPO alert: DAM Capital Advisors files DRHP with Sebi; details",
            "link": "https://www.business-standard.com/markets/news/upcoming-ipo-alert-dam-capital-advisors-files-drhp-with-sebi-details-124090400451_1.html",
            "description": "DAM Capital Advisors has revealed that its initial public offering comprises an offer for sale of up to 3.206 crore shares of the company",
            "pubDate": "2024-09-04T07:58:11.915544"
        },
        {
            "title": "Gala Precision IPO subscribed 201.44 times on last day of bidding",
            "link": "https://www.business-standard.com/markets/ipo/gala-precision-ipo-subscribed-201-44-times-on-last-day-of-bidding-124090401103_1.html",
            "description": "The initial public offer of Gala Precision Engineering garnered 201.44 times subscription on the closing day of bidding on Wednesday.\r\nThe initial share sale received bids for 44,79,68,752 shares against 22,23,830 shares on offer, as per NSE data.\r\nThe portion meant for non-institutional investors got subscribed a whopping 414.65 times while the category for Qualified Institutional Buyers (QIBs) received 232.54 times subscription. The Retail Individual Investors (RIIs) part garnered 91.99 times subscription.\r\nThe initial public offering of Gala Precision Engineering was fully subscribed within minutes of opening for bidding on Monday and ended the day with a 10.83 times subscription.\r\nGala Precision Engineering Ltd has fixed a price band of Rs 503-529 per share for its Rs 168-crore initial public offering (IPO).\r\nThe IPO is a combination of a fresh issue of 25.58 lakh equity shares worth Rs 135.34 crore and an offer-for-sale (OFS) of 6.16 lakh equity shares valued at Rs 32.58 crore by",
            "pubDate": "2024-09-04T18:42:42.996035"
        }
    ]
}