{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-15T17:42:16.670620",
    "items": [
        {
            "title": "Hyundai Motor India IPO opens: GMP shows slight uptick; Should you apply?",
            "link": "https://www.business-standard.com/markets/news/hyundai-motor-india-ipo-opens-gmp-shows-slight-uptick-should-you-apply-124101500090_1.html",
            "description": "Hyundai Motor India IPO opens for public subscription from October 15, 2024, to October 17, 2024. Check here for key details: Price Band, Lot Size, GMP, Allotment Date, Listing Date, and more",
            "pubDate": "2024-10-15T03:40:25.909805"
        },
        {
            "title": "Waaree Energies IPO: 5 key things to know from RHP before bidding starts",
            "link": "https://www.business-standard.com/markets/news/waaree-energies-ipo-5-key-things-to-know-from-rhp-before-bidding-starts-124101500373_1.html",
            "description": "Having secured 'in-principle' approvals from the BSE, and National Stock Exchange (NSE) for the listing of its equity shares, Waaree Energies is all set for its market debut",
            "pubDate": "2024-10-15T07:22:41.247465"
        },
        {
            "title": "Hyundai Motor India IPO Off to slow start: 0.11x subscription, GMP falls 1%",
            "link": "https://www.business-standard.com/markets/news/hyundai-motor-india-ipo-off-to-slow-start-0-11x-subscription-gmp-falls-1-124101500432_1.html",
            "description": "Notably, Hyundai Motor India's IPO marks the first time in two decades that a carmaker has gone public in India, following Maruti Suzuki's listing in 2003",
            "pubDate": "2024-10-15T07:41:57.102020"
        },
        {
            "title": "Gautam Solar plans Rs 1,000 crore IPO to expand manufacturing capacity",
            "link": "https://www.business-standard.com/markets/ipo/gautam-solar-plans-rs-1-000-crore-ipo-to-expand-manufacturing-capacity-124101500684_1.html",
            "description": "Gautam Solar on Tuesday said it plans to raise Rs 1,000 crore through Initial Public Offerings (IPO) in next 12 to 18 months in order to fund its 2 GW solar cell manufacturing project.\r\nThe proposed solar cell line is part of the company's plan to expand its solar module manufacturing capacity to 5 GW by 2025, Gautam Solar said in a statement.\r\n\"Rs 1,000 crore solar cell expansion plan will be funded through an IPO to be launched in the next 12-18 months, supporting further development and innovation,\" it said.\r\nThis expansion will occur in three phases, with the first phase set for completion in November 2024, followed by the second and third phases in January and April 2025, respectively.\r\nAccording to the company, the IPO will drive the company's growth by setting up a 2 gigawatt (GW) solar cell manufacturing plant to bolster solar module production and achieve the 5 GW target within the stipulated time.\r\n\"As India targets achieving 500 GW of renewable energy by 2030, our expansion",
            "pubDate": "2024-10-15T11:41:08.622337"
        },
        {
            "title": "Hyundai India's record $3.3 bn IPO subscribed 18% on first day of bidding",
            "link": "https://www.business-standard.com/markets/ipo/hyundai-india-s-record-3-3-bn-ipo-subscribed-18-on-first-day-of-bidding-124101500920_1.html",
            "description": "Over 260 companies in India have raised more than $9 billion through IPOs so far this year, according to LSEG data. That's already higher than the $7.42 billion raised during the same period last year",
            "pubDate": "2024-10-15T13:49:26.690487"
        },
        {
            "title": "Hyundai's Rs 27,870 cr IPO highlights how mega listings affect markets",
            "link": "https://www.business-standard.com/markets/ipo/big-ipos-weigh-on-market-performance-124101500874_1.html",
            "description": "Experts attribute this phenom­enon to large IPOs absorbing market liquidity, subsequently weighing on the overall market performance",
            "pubDate": "2024-10-15T17:42:15.940179"
        }
    ]
}