{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-12T21:42:15.966321",
    "items": [
        {
            "title": "Neither largecaps, nor smallcaps! India Inc’s Q4 result season belongs to the middle order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/neither-largecaps-nor-smallcaps-india-incs-q4-result-season-belongs-to-the-middle-order/articleshow/121637627.cms",
            "description": "Mid-cap companies have surprisingly outperformed large and small-cap firms in Q4, showcasing robust profit growth across sectors like metals, public sector banks, and EMS. While valuations are stretched, experts suggest that continued earnings momentum and stock-picking discipline can keep mid-caps attractive, especially for investors with a longer-term horizon.",
            "pubDate": "2025-06-12T21:41:55.204943"
        },
        {
            "title": "Can rising EPS estimates restore investors confidence despite tariff uncertainties?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-rising-eps-estimates-restore-investor-confidence-despite-tariff-uncertainties/articleshow/121608862.cms",
            "description": "Analysts are raising earnings per share (EPS) estimates for many large companies after Q4, reversing previous downgrades. This positive shift is attributed to increased government spending and a rise in consumer demand. The Nifty's EPS is projected to grow significantly, driven by accommodative monetary policy and continued government investment, boosting investor confidence.",
            "pubDate": "2025-06-12T21:41:55.205065"
        },
        {
            "title": "Double cheer continues for India Inc in Q4 profit growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/double-cheer-continues-for-india-inc-in-q4-profit-growth/articleshow/121558525.cms",
            "description": "Corporate India's net profit surged in the March quarter, driven by reduced non-operating costs, while revenue growth remained moderate. Excluding banking and finance, profit growth improved significantly, with metals and pharmaceuticals outperforming. Analysts anticipate stronger earnings in FY26, fueled by tax incentives and lower interest rates, despite global uncertainties.",
            "pubDate": "2025-06-12T21:41:55.205179"
        },
        {
            "title": "Salasar Techno Engineering Q4 net profit grows 30 pc to Rs 20 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/salasar-techno-engineering-q4-net-profit-grows-30-pc-to-rs-20-cr/articleshow/121534653.cms",
            "description": "Salasar Techno Engineering has announced a significant increase in its net profit. The steel structure maker saw a 30 per cent rise in consolidated net profit. It reached Rs 19.31 crore in the March 2025 quarter. This growth is attributed to higher revenues. The company's total income also increased by 32 per cent during the same period.",
            "pubDate": "2025-06-12T21:41:55.205282"
        },
        {
            "title": "Titagarh Rail Systems Q4 results: Net profit declines 18% YoY, revenue down by 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titagarh-rail-systems-q4-results-net-profit-declines-18-yoy-revenue-down-by-4/articleshow/121534284.cms",
            "description": "Titagarh Rail Systems reported a consolidated net profit of Rs 64.45 crore for Q4FY25, an 18.6% YoY decrease, with revenue from operations declining by 4.45% to Rs 1,005.57 crore. Despite reduced total expenses YoY, the company's board recommended a dividend of Re 1 per share.",
            "pubDate": "2025-06-12T21:41:55.205377"
        },
        {
            "title": "Spandana Sphoorty suffers net loss, auditor flags concerns over frauds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spandana-sphoorty-suffers-net-loss-auditor-flags-concerns-over-frauds/articleshow/121520744.cms",
            "description": "Spandana Sphoorty Financial announced a net loss of Rs 434 crore for the fourth quarter, alongside troubling findings from independent auditors who have flagged issues of potential fraud and weaknesses in internal controls. The company's asset quality has taken a hit, evident by the rise in gross non-performing assets.",
            "pubDate": "2025-06-12T21:41:55.205471"
        },
        {
            "title": "Puravankara posts Rs 1,282 crore pre-sales, FY25 loss narrows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/puravankara-posts-rs-1282-crore-pre-sales-fy25-loss-narrows/articleshow/121520660.cms",
            "description": "Puravankara Limited achieved a historic milestone with pre-sales hitting an impressive Rs 5,006 crore. The company sold 5.67 million sq. ft., marking a 10% increase in average realization compared to last year. With total revenue climbing to Rupees 2,093 crore and customer collections reaching Rupees 3,937 crore, the company’s financial health is thriving.",
            "pubDate": "2025-06-12T21:41:55.205564"
        },
        {
            "title": "Coffee Day Enterprises Q4 Results: Company narrows loss to Rs 114 crore, revenue up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/coffee-day-enterprises-q4-results-company-narrows-loss-to-rs-114-crore-revenue-up-7/articleshow/121518661.cms",
            "description": "Coffee Day Enterprises Ltd. significantly reduced its consolidated net loss to Rs 114.16 crore in Q4 FY25, compared to Rs 296.40 crore in the previous year. Revenue saw a 7% increase, reaching Rs 268.03 crore. For the entire fiscal year, the company also narrowed its net loss to Rs 143.20 crore, with total consolidated income marginally up to Rs 1,125.",
            "pubDate": "2025-06-12T21:41:55.205683"
        },
        {
            "title": "Apollo Hospitals Q4 Results: Cons PAT jumps 53% to Rs 390 crore; Rs 10/share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-q4-results-cons-pat-jumps-53-to-rs-390-crore-rs-10/share-dividend-announced/articleshow/121517873.cms",
            "description": "Apollo Hospitals Q4 Results: Apollo Hospitals Enterprise on Friday announced its Q4FY25 earnings where the company reported a net profit growth of 53.5% to Rs 390 crore versus Rs 254 crore in the year ago period. The profit is attributable to the owners of the company and has beaten Street's estimates of Rs 374 crore.",
            "pubDate": "2025-06-12T21:41:55.205780"
        },
        {
            "title": "Prestige Estates Q4 Results: Profit slumps 82% to Rs 25 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/prestige-estates-q4-results-profit-slumps-82-to-rs-25-crore/articleshow/121516545.cms",
            "description": "Prestige Estates Projects Ltd experienced a significant decline in financial performance, with net profit dropping 82% in the March quarter and sharply falling for fiscal year 2024-25. Despite the downturn, the company is expanding its portfolio through a partnership with Valor Group to develop a Rs 4,500 crore office complex in Mumbai.",
            "pubDate": "2025-06-12T21:41:55.205877"
        },
        {
            "title": "Nykaa Q4 Results: Cons PAT skyrockets 193% YoY to Rs 20 crore, revenue up 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-q4-results-cons-pat-skyrockets-193-yoy-to-rs-20-crore-revenue-up-24/articleshow/121515554.cms",
            "description": "Nykaa Q4 Results: FSN E-Commerce, which operates Nykaa brand announced its Q4FY25 earnings on Friday where the company reported a net profit growth of 193% to Rs 20 crore versus Rs 7 crore in the year ago period.",
            "pubDate": "2025-06-12T21:41:55.205974"
        },
        {
            "title": "Ola Electric reports revenue decline and widening losses in March quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ola-electric-reports-revenue-decline-and-widening-losses-in-march-quarter/articleshow/121501237.cms",
            "description": "Ola Electric's March quarter saw a significant revenue drop and widened losses, impacted by registration process issues and declining market share. Despite a decrease in vehicle deliveries, gross margins inched up slightly. The company is delaying the integration of in-house battery cells to prioritize commercial operations and aims to improve cell production yields.",
            "pubDate": "2025-06-12T21:41:55.206067"
        },
        {
            "title": "EIL Q4 Results: Profit rises two-and-half times to Rs 243 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eil-q4-results-profit-rises-two-and-half-times-to-rs-243-crore/articleshow/121495052.cms",
            "description": "Engineers India Ltd reported a 2.5x jump in Q4FY25 profit to ₹243 crore, driven by operational efficiencies and a write-back of ₹82 crore. Annual profit rose 30% to ₹465 crore, despite a 6% decline in revenue.",
            "pubDate": "2025-06-12T21:41:55.206161"
        },
        {
            "title": "Mazagon Dock Q4 Results: Cons PAT falls 51% YoY to Rs 325 crore; Rs 2.71 per share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mazagon-dock-q4-results-cons-pat-falls-51-yoy-to-rs-325-crore-rs-2-71-per-share-dividend-announced/articleshow/121493944.cms",
            "description": "Mazagon Dock Shipbuilders reported a 51% year-on-year decline in its Q4FY25 consolidated net profit at Rs 325 crore versus Rs 663 crore posted in the year ago period.",
            "pubDate": "2025-06-12T21:41:55.206253"
        },
        {
            "title": "Sobha Q4 Results: Profit jumps nearly 6-fold to Rs 41 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sobha-q4-results-profit-jumps-nearly-6-fold-to-rs-41-crore/articleshow/121493016.cms",
            "description": "Realty firm Sobha Ltd on Thursday reported a nearly six times jump in its consolidated net profit to Rs 40.85 crore in the March quarter on higher revenue.",
            "pubDate": "2025-06-12T21:41:55.206350"
        },
        {
            "title": "Bajaj Auto Q4 Results: Cons PAT falls 10% YoY to Rs 1,802 crore; Rs 210 per share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q4-results-cons-pat-falls-10-yoy-to-rs-1802-crore-rs-210-per-share-dividend-announced/articleshow/121492050.cms",
            "description": "Bajaj Auto Q4 Results: Bajaj Auto reported a 10% year-on-year growth in its Q4FY25 consolidated net profit at Rs 1,802 crore versus Rs 2,011 crore in the year ago period. The profit is attributable to the owners of the company. The profit is attributable to owners of the company.",
            "pubDate": "2025-06-12T21:41:55.206440"
        }
    ]
}