{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-17T13:03:58.317117",
    "items": [
        {
            "title": "These 9 midcap stocks hit a 52-week high and rallied up to 25 in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-midcap-stocks-hit-a-52-week-high-and-rallied-up-to-25-in-a-month/slideshow/113429717.cms",
            "description": "On Tuesday, India’s benchmark index, the Sensex, increased by about 91 points, ending the day at 83,080. Despite this gain, nine stocks in the BSE midcap index hit their highest prices in the past year. Reaching a 52-week high is significant because it shows the highest price a stock has achieved over the last 12 months, providing important information for traders and investors. This milestone is key for evaluating a stock's current worth and predicting future price movements.",
            "pubDate": "2024-09-17T13:03:36.420180"
        },
        {
            "title": "SpiceJet's Rs 3,000 crore issue commences; floor price set at Rs 64.79 per share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejets-rs-3000-crore-issue-commences-floor-price-set-at-rs-64-79-per-share/articleshow/113428707.cms",
            "description": "SpiceJet has set a floor price of Rs 64.79 per share for the sale of securities to qualified institutional buyers through which the budget carrier aims to raise up to Rs 3,000 crore. Last week, shareholders approved a proposal to raise up to Rs 3,000 crore.",
            "pubDate": "2024-09-17T13:03:36.420299"
        },
        {
            "title": "Tech view: Nifty faces hesitation at all-time high levels ahead of Fed rate move. Here's how to trade on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-faces-hesitation-at-all-time-high-levels-ahead-of-fed-rate-move-heres-how-to-trade-on-wednesday/articleshow/113427174.cms",
            "description": "Nifty formed a Doji candle near its all-time high, indicating short-term hesitation ahead of the US Fed meeting. A breakout of the 25292-25442 band could lead to a sharper move. OI data shows highest call and put open interest at 25,400 and 25,300 strike prices, respectively.",
            "pubDate": "2024-09-17T13:03:36.420400"
        },
        {
            "title": "Nifty, Sensex scale new peaks but end flat ahead of Fed decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-sensex-scale-new-peaks-but-end-flat-ahead-of-fed-decision/articleshow/113425731.cms",
            "description": "The majority of Nifty stocks saw declines today, with 29 stocks falling and only 21 advancing. The top performing stocks included Hero MotoCorp, Bajaj Auto, Bharti Airtel, NTPC, and Mahindra & Mahindra, while the biggest losers were Tata Motors, Eicher Motors, Tata Steel, Coal India, and JSW Steel.",
            "pubDate": "2024-09-17T13:03:36.420503"
        },
        {
            "title": "Motilal Oswal Foundation pledges Rs 130 crore to IIT Bombay for financial markets program",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-foundation-pledges-rs-130-crore-to-iit-bombay-for-financial-markets-program/articleshow/113424508.cms",
            "description": "Motilal Oswal Foundation has pledged Rs 130 crore to IIT Bombay for establishing a world-class academic infrastructure and developing a financial markets program. This marks one of the largest corporate philanthropic contributions to an Indian educational institution. The Motilal Oswal Knowledge Centre will be set up on IIT Bombay's campus, and the Motilal Oswal Centre for Capital Markets will focus on building high-end capabilities in the financial sector",
            "pubDate": "2024-09-17T13:03:36.420599"
        },
        {
            "title": "Sebi’s proposed merchant banking regulations: Will it make the big bigger?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-proposed-merchant-banking-regulations-will-it-make-the-big-bigger/articleshow/113424284.cms",
            "description": "The capital markets have transformed substantially over the last three decades. Therefore, it's crucial to re-evaluate the existing regulatory framework to align with the current market realities. SEBI's consultation paper on the proposed MB Regulations, released on August 28, 2024, is a positive step in this direction, offering several insightful suggestions. However, a few of the proposed changes warrant further deliberation.",
            "pubDate": "2024-09-17T13:03:36.420690"
        },
        {
            "title": "100 days of Modi 3.0 Government: 18 smallcap stocks deliver up to 220% multibagger returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/100-days-of-modi-3-0-government-18-smallcap-stocks-deliver-up-to-220-multibagger-returns/slideshow/113423781.cms",
            "description": "Despite a roller-coaster Union Budget and ongoing controversies surrounding Sebi chief Madhabi Puri Buch, Indian equity markets have shown positive investor sentiment, continuing their upward trend over the past 100 days of the Modi 3.0 government.In the past 100 days, BSE Sensex has surged nearly 6,300 points, or 8.2%. Meanwhile, at least 18 smallcap stocks have delivered multibagger returns, data from ACE Equity reveals.Here is a list of 18 smallcap stocks that delivered multibagger returns from June 7 to September 16:",
            "pubDate": "2024-09-17T13:03:36.420782"
        },
        {
            "title": "European shares at two-week high in lead-up to Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-at-two-week-high-in-lead-up-to-fed-rate-decision/articleshow/113422515.cms",
            "description": "Investors will be squarely focused on Fed's decision on Wednesday, with markets now pricing in a 67% chance that the U.S. central bank could ease rates by 50 basis points",
            "pubDate": "2024-09-17T13:03:36.420872"
        },
        {
            "title": "These 9 stocks added by over 15 MFs in August rally up to 80% in FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-stocks-added-by-over-15-mfs-in-august-rally-up-to-80-in-fy25/slideshow/113422511.cms",
            "description": "In August, mutual funds showed confidence in Indian equities, evident from their net investments totaling about Rs 31,685 crore. ETMarkets analysis revealed that approximately 15 stocks were included in the portfolios of over 15 MF schemes in August, compared to July. We highlighted the top 9 stocks that have achieved double-digit gains in the current fiscal year FY25 so far. (Data Source: ACE MF | ACE Equity)",
            "pubDate": "2024-09-17T13:03:36.420969"
        },
        {
            "title": "TML Securities Trust sells 1.14 crore new ordinary shares of Tata Motors under DVR scheme",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tml-securities-trust-sells-1-14-crore-new-ordinary-shares-of-tata-motors-under-dvr-scheme/articleshow/113420300.cms",
            "description": "The company has recently canceled its DVR (Differential Voting Rights) shares and is replacing them with ordinary shares. According to the new scheme, shareholders will receive 7 ordinary shares for every 10 DVR shares they previously held. Axis Trustee Services, acting as an Independent Trustee, will now manage the distribution of the sale proceeds.",
            "pubDate": "2024-09-17T13:03:36.421071"
        },
        {
            "title": "Adani Green shares may rise up to 30%, says Investec while initiating coverage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-shares-may-rise-up-to-30-says-investec-while-initiating-coverage/articleshow/113420181.cms",
            "description": "Investec predicts that using advanced tech in ideal locations will boost energy production significantly. Combined with a greater focus on selling directly to customers, this should result in a 60% annual profit growth over the next six years.",
            "pubDate": "2024-09-17T13:03:36.421167"
        },
        {
            "title": "For risk takers with medium term perspective: 5 mid cap stocks from different sectors with potential upside of up to 46%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-risk-takers-with-medium-term-perspective-5-mid-cap-stocks-from-different-sectors-with-potential-upside-of-up-to-46/articleshow/113419646.cms",
            "description": "The problem with looking at an index and feeling bullish or bearish is the fact that the index is a collection of stocks which in all probability has little correlation with a stock you have in your portfolio. If you are feeling bullish because the nifty is touching and checking what has happened to the value of the portfolio, there is a high probability that you may get disappointed.  The reason to be bullish has to be growth of the economy and the reason for selecting a stock has to be good business, management and growth of the company. Don't be afraid to be bullish but do a bit of simple work and enjoy the fruits of growth of the Indian economy.",
            "pubDate": "2024-09-17T13:03:36.421254"
        },
        {
            "title": "Will investors make money as the US Fed is all set to cut the rates?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-investors-make-money-as-the-us-fed-is-all-set-to-cut-the-rates/articleshow/113420049.cms",
            "description": "Lower interest rates mean higher bond prices, benefiting bond investors. While the US Federal Reserve raised rates significantly, India's central bank took a more moderate approach. We expect a smaller rate cut from India's central bank this year.",
            "pubDate": "2024-09-17T13:03:36.421339"
        },
        {
            "title": "These largecaps have ‘strong buy’ & ‘buy’ recos and upside potential of more than 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-largecaps-have-strong-buy-buy-recos-and-upside-potential-of-more-than-25/articleshow/113416922.cms",
            "description": "The way things have panned in the last couple of weeks, it is clear that bulls are not in any mood to leave the street anytime. At the same time, aided by international events, bears are also making small attempts to come back. With every session it is becoming clear that bears will not be able to make much of a dent on NIfty, so they better roam in the mid-cap segment. How long they will be able to roam if broader market indices are doing well is something which is still to be seen. But one thing is for sure  as corrections and consolidation are part of every bull market we will continue to see them at regular levels.  ET screener powered by Refinitiv’s Stock Report Plus lists down quality stocks with high upside potential over the next 12 months, having an average recommendation rating of “buy” or \"strong buy\". The screener applies different algorithms for all BSE and NSE stocks.",
            "pubDate": "2024-09-17T13:03:36.421425"
        },
        {
            "title": "Japan's Nikkei slides on strong yen worries before Fed decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slides-on-strong-yen-worries-before-fed-decision/articleshow/113416607.cms",
            "description": "Japan's Nikkei share average dropped by 1% on Tuesday, impacted by concerns over a stronger yen and anticipation of a significant interest rate cut from the U.S. Federal Reserve. Technology giants and banks were among the biggest losers, with major companies like Tokyo Electron and SoftBank Group seeing notable declines.",
            "pubDate": "2024-09-17T13:03:36.421513"
        },
        {
            "title": "AIF Tracker: Majority of category II debt funds deliver over 10% returns for ultra-rich investors in Aug",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aif-tracker-majority-of-category-ii-debt-funds-deliver-over-10-returns-for-ultra-rich-investors-in-aug/articleshow/113416462.cms",
            "description": "In August 2024, category II debt funds outperformed equity investments for ultra-rich investors, with four out of six funds delivering returns over 10%. Over 70% of Alternative Investment Funds (AIFs) surpassed the Nifty50 index's 1.1% gain. These funds primarily invest in unlisted companies, real estate, and private equity.",
            "pubDate": "2024-09-17T13:03:36.421602"
        }
    ]
}