{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-26T04:34:11.605885",
    "items": [
        {
            "title": "Infosys’ Rs 18,000-crore share buyback: Don’t ignore this important tax implication",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-rs-18000-crore-share-buyback-dont-ignore-this-important-tax-implication/articleshow/125579485.cms",
            "description": "Infosys' Rs 18,000 crore share buyback closes today, with investor focus shifting to the new tax regime. Under the revised rules, buyback proceeds are taxed as 'deemed dividend' at individual income-tax slab rates, replacing the old company-level tax.",
            "pubDate": "2025-11-26T04:33:51.559485"
        },
        {
            "title": "Bessent signals Christmas timeline for new Fed Chief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bessent-signals-christmas-timeline-for-new-fed-chief/slideshow/125579414.cms",
            "description": "U.S. Treasury Secretary Scott Bessent said he is wrapping up the second round of interviews for the next Federal Reserve Chair. He added that there is a strong possibility President Donald Trump will reveal his choice before Christmas. (Source: Reuters)",
            "pubDate": "2025-11-26T04:33:51.559615"
        },
        {
            "title": "Sensex jumps over 600 pts, Nifty above 26,000 as metal, PSU bank stocks shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-200-pts-nifty-nears-26000-as-metal-psu-bank-stocks-shine/articleshow/125579031.cms",
            "description": "In a thrilling turnaround, the Indian stock markets, Nifty and Sensex, experienced a notable upswing on November 26. Leading the recovery were metal and PSU bank stocks, successfully reversing a three-day downward trend. The positive energy stemmed from encouraging signals across global markets, particularly from Wall Street and Asia.",
            "pubDate": "2025-11-26T04:33:51.559720"
        },
        {
            "title": "Federal Bank among 4 stocks that witnessed 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-among-4-stocks-that-witnessed-5-year-swing-high-breakout/slideshow/125578951.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, four stocks witnessed a 5-year swing high at the close on November 25, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-11-26T04:33:51.559824"
        },
        {
            "title": "Zydus Lifesciences shares in focus after USFDA nod for Verapamil Hydrochloride ER Tablets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-after-usfda-nod-for-verapamil-hydrochloride-er-tablets/articleshow/125578909.cms",
            "description": "Zydus Lifesciences will be in focus on Wednesday after receiving final USFDA approval for its Verapamil Hydrochloride Extended-Release Tablets in 120 mg, 180 mg, and 240 mg strengths. The drug, a generic version of Calan SR, is used to treat high blood pressure. The approval strengthens Zydus’ US portfolio and supports its ongoing expansion in the regulated markets.",
            "pubDate": "2025-11-26T04:33:51.559923"
        },
        {
            "title": "HCLTech shares in focus on strategic collaboration agreement with AWS",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcltech-shares-in-focus-on-strategic-collaboration-agreement-with-aws/articleshow/125578881.cms",
            "description": "HCLTech shares will be watched after the company announced a strategic collaboration with AWS to accelerate digital transformation in the financial services sector. The partnership aims to modernise legacy systems, enhance customer experiences, and deploy AI-driven, industry-compliant solutions across banking, wealth, and insurance, strengthening long-standing ties between both companies.",
            "pubDate": "2025-11-26T04:33:51.560024"
        },
        {
            "title": "India's stock market facade: 576 stocks down over 30% as Sensex, Nifty near record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-stock-market-facade-576-stocks-down-over-30-as-sensex-nifty-near-record-high/articleshow/125578860.cms",
            "description": "Indian stock market presents a dual reality. While Sensex and Nifty approach record highs, a significant number of BSE-listed stocks have seen sharp declines. Over 576 stocks are down by at least 30% from their peaks. This divergence is attributed to valuation excesses and concentrated investment flows into select large-cap companies.",
            "pubDate": "2025-11-26T04:33:51.560120"
        },
        {
            "title": "Godrej Consumer Products among 6 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-products-among-6-stocks-that-closed-above-vwap/slideshow/125578838.cms",
            "description": "On November 25, six stocks in the Nifty500 pack closed significantly above their VWAP, based on StockEdge.com data. A closing price above the VWAP suggests stronger buying interest in the session and the possibility of a short-term bullish trend forming.",
            "pubDate": "2025-11-26T04:33:51.560212"
        },
        {
            "title": "Vedanta among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-among-4-stocks-showing-bullish-rsi-upswing/slideshow/125578793.cms",
            "description": "On November 25, in the NSE large-cap segment, four stocks appeared in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal is generated when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) is rising, suggesting strengthening momentum in the stock’s price. This may signal potential upward movement and can help traders identify buying opportunities.",
            "pubDate": "2025-11-26T04:33:51.560303"
        },
        {
            "title": "Orient Electric, Carraro India among 7 stocks flashing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/orient-electric-carraro-india-among-7-stocks-flashing-bullish-signals/slideshow/125578745.cms",
            "description": "On November 25, 20 stocks appeared in the bullish ‘White Marubozu’ scanner on the NSE list of stocks with a market cap above Rs 1,000 crore, according to technical scan data from StockEdge.com. Of these, we highlighted seven stocks that gained over 5%.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for the period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and little to no lower shadow, it indicates strong buying pressure throughout the session. Traders view this as a signal that buyers dominated from open to close, often using such patterns to make informed decisions about future price movements.",
            "pubDate": "2025-11-26T04:33:51.560419"
        },
        {
            "title": "For impatient investors with the ability to be patient for 3 years: 5 small-caps from 4 different growth sectors that fit the bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-impatient-investors-with-the-ability-to-be-patient-for-3-years-5-small-caps-from-4-different-growth-sectors-that-fit-the-bill/articleshow/125578387.cms",
            "description": "In an emerging economy, how to define a growth sector? It is an industry whose real value added grows persistently above the national GDP growth rate, attracts rising private and foreign investment, demonstrates productivity gains, and generates strong employment and linkage effects – thereby contributing disproportionately to structural transformation. The next question is: Which sectors are currently undergoing transformation and attracting significant private equity investment? Finally, which are the small-cap firms within these high-growth sectors that merit closer attention?",
            "pubDate": "2025-11-26T04:33:51.560508"
        },
        {
            "title": "Apollo Micro Systems shares in focus on MoU with IIT-Chennai, Indian Navy to fast-track defence tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-micro-systems-shares-in-focus-on-mou-with-iit-chennai-indian-navy-to-fast-track-defence-tech/articleshow/125578434.cms",
            "description": "Apollo Micro Systems is set for active trade following a significant collaboration. The company, along with IIT-Chennai and the Indian Navy, will focus on developing advanced homegrown defence technologies. This partnership aims to meet the operational needs of the Armed Forces through indigenous research and development.",
            "pubDate": "2025-11-26T04:33:51.560606"
        },
        {
            "title": "HDFC AMC shares in focus as stock turns ex-bonus for 1:1 issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-shares-in-focus-as-stock-turns-ex-bonus-for-11-issue/articleshow/125578386.cms",
            "description": "HDFC Asset Management Company shares are trading ex-bonus today, November 26, following a 1:1 bonus share issue. Investors who held shares by the end of trading on November 25 are eligible for one bonus share for every share owned. The record date for this bonus issuance was November 26, 2025.",
            "pubDate": "2025-11-26T04:33:51.560697"
        },
        {
            "title": "Sunil Mittal family likely sells Bharti Airtel shares worth Rs 7,400 crore in block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-shares-in-focus-as-promoter-icil-likely-to-offload-rs-7195-crore-worth-stake-via-block-deal/articleshow/125578345.cms",
            "description": "Bharti Airtel shares saw a dip in early trade. This followed a large block deal where a promoter entity sold shares. The transaction fetched a significant amount. This move comes after the company reported strong quarterly results. Analysts maintain a positive outlook on the telecom major's future performance.",
            "pubDate": "2025-11-26T04:33:51.560789"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Star Cement, Vishnu Chemicals among 5 stocks that could give 15-40% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-star-cement-vishnu-chemicals-among-5-stocks-that-could-give-15-40-return/slideshow/125577890.cms",
            "description": "Brokerages remain upbeat on select stocks across chemicals, pharmaceuticals, metals, and cement, highlighting strong upside potential despite broader market volatility.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-26T04:33:51.560878"
        },
        {
            "title": "Last day to buy Sikko Industries shares ahead of 10:1 stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-sikko-industries-shares-to-be-eligible-for-101-stock-split/articleshow/125577788.cms",
            "description": "Sikko Industries shares are in focus today, the last chance for investors to buy before a 10:1 stock split. Those holding shares by market close will benefit from the split, which adjusts face value from Rs 10 to Rs 1. The ex-split trading begins November 27, 2025, impacting holdings proportionally without altering total investment value.",
            "pubDate": "2025-11-26T04:33:51.560969"
        }
    ]
}