{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-05T04:31:31.450528",
    "items": [
        {
            "title": "Q3 results today: Swiggy, Info Edge among 124 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-swiggy-info-edge-among-124-companies-to-announce-earnings-on-wednesday/articleshow/117931923.cms",
            "description": "Swiggy's third-quarter revenue is expected to see a sequential improvement, but losses are projected to expand to around Rs 700 crore. Revenues are estimated to rise to Rs 4,035 crore, driven by growth in food delivery and quick commerce segments, despite competitive pressures and aggressive expansion.",
            "pubDate": "2025-02-05T04:31:13.954740"
        },
        {
            "title": "Alphabet plans massive capex hike, reports cloud revenue growth slowed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/alphabet-plans-massive-capex-hike-reports-cloud-revenue-growth-slowed/articleshow/117931803.cms",
            "description": "Alphabet plans to spend $75 billion on AI buildout in 2025, significantly surpassing Wall Street's expectations. This substantial investment includes building servers and data centers. Meanwhile, the company's cloud revenue growth has slowed, raising investor concerns over profitability and capital spending efficiency.",
            "pubDate": "2025-02-05T04:31:13.954861"
        },
        {
            "title": "Asian Paints flags weak urban demand as Q3 earnings fade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/asian-paints-flags-weak-urban-demand-as-q3-earnings-fade/articleshow/117930899.cms",
            "description": "Raw material costs stood at 57.7% of the consolidated revenues-higher than the year-ago level of 56.5%. Other expenses, too, climbed to make up 16.2% of the revenues-much higher than the y-o-y level of 14.8%. These increased expenses, and a less favourable product mix, dented profitability.",
            "pubDate": "2025-02-05T04:31:13.954969"
        },
        {
            "title": "JB Pharma Q3 net profit jumps 22% to Rs 162 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jb-pharma-q3-net-profit-jumps-22-to-rs-162-crore/articleshow/117922390.cms",
            "description": "JB Pharma on Tuesday reported a 22% year-on-year (Y-o-Y) jump in net profit to Rs 162 crore for the quarter ended December 31 led by strong growth in domestic formulation business.",
            "pubDate": "2025-02-05T04:31:13.955068"
        },
        {
            "title": "Metropolis Q3 net profit rises 15.3% to Rs 31 crore, revenue up 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/metropolis-q3-net-profit-rises-15-3-to-rs-31-crore-revenue-up-11/articleshow/117922185.cms",
            "description": "Metropolis Healthcare on Tuesday reported a 15.3% year-on-year (YoY) rise in net profit to Rs 31 crore in Q3FY25 let my volume increase and better patient realisations.",
            "pubDate": "2025-02-05T04:31:13.955174"
        },
        {
            "title": "Medanta Q3 Results: Profit jumps 15% to Rs 143 crore, revenue rises 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/medanta-q3-results-profit-jumps-15-to-rs-143-crore-revenue-rises-12/articleshow/117922095.cms",
            "description": "Global Health (Medanta) reported a 15.6% year-on-year (YoY) jump in net profit to Rs. 143 crore in Q3FY25 due to increase in revenue growth from new hospitals, along with higher patient volumes.",
            "pubDate": "2025-02-05T04:31:13.955293"
        },
        {
            "title": "Dhanlaxmi Bank Q3 Results: Profit soars 6.5x YoY to Rs 19 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dhanlaxmi-bank-q3-results-profit-soars-6-5x-yoy-to-rs-19-crore/articleshow/117920563.cms",
            "description": "Dhanlaxmi Bank Q3 Results: Dhanlaxmi Bank Q3 Profit: Dhanlaxmi Bank's Q3 net profit surged 6.5 times to ₹19.85 crore, driven by higher income and lower provisions. Asset quality improved, and the bank approved a ₹298 crore rights issue to strengthen capital.",
            "pubDate": "2025-02-05T04:31:13.955393"
        },
        {
            "title": "PayPal Q4 Results: Margin contraction eclipses upbeat 2025 profit forecast",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/paypal-q4-results-margin-contraction-eclipses-upbeat-2025-profit-forecast/articleshow/117918957.cms",
            "description": "PayPal shares fell 5% in premarket trading on Tuesday after the digital payments giant's operating margin shrank in the fourth quarter, raising concerns over the possibility of a sluggish recovery and overshadowing a strong profit forecast for 2025.",
            "pubDate": "2025-02-05T04:31:13.955486"
        },
        {
            "title": "Titan Q3 Results: Cons PAT falls marginally to Rs 1,047 cr, revenue rises 25% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titan-q3-results-cons-pat-falls-marginally-to-rs-1047-cr-revenue-rises-25-yoy/articleshow/117917078.cms",
            "description": "Titan Q3 Results: The company reported a flat profit before tax of Rs 1,396 crore for the quarter, impacted by the reduction in gold customs duty. The company stated that inventory losses from the duty change were fully realized, affecting profitability. Consolidated EBIT rose 5% YoY to Rs 1,627 crore, though EBIT margins contracted by 177 basis points to 9.2%.",
            "pubDate": "2025-02-05T04:31:13.955580"
        },
        {
            "title": "Tata Power Q3 Results: Net profit up 10% at Rs 1,187 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-power-q3-results-net-profit-up-10-at-rs-1187-crore/articleshow/117917016.cms",
            "description": "Tata Power reported a 10% rise in Q3 FY25 net profit at ₹1,187 crore, driven by strong performance in generation, transmission, distribution, and renewables. Revenue grew 5% to ₹15,391 crore, while EBITDA surged 39% with improved margins.",
            "pubDate": "2025-02-05T04:31:13.955681"
        },
        {
            "title": "NSE Q3 Results: Sebi's F&O jolt, market correction leads to a revenue slump even as PAT grows 22% QoQ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nse-q3-results-sebis-fo-jolt-market-correction-leads-to-a-revenue-slump-even-as-pat-grows-22-qoq/articleshow/117914830.cms",
            "description": "NSE Q3 Results: India's NSE reported strong YoY growth in its third-quarter numbers with a 94% surge in consolidated PAT to Rs 3,834 crore. However, sequential growth saw a hit due to reduced trading volumes and stricter Sebi norms in the futures and options segment.",
            "pubDate": "2025-02-05T04:31:13.955772"
        },
        {
            "title": "Tata Power Q3 Results: Cons PAT rises 8% to Rs 1,031 crore, revenue up 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-power-q3-results-cons-pat-jumps-8-to-rs-1031-crore-revenue-up-5/articleshow/117914275.cms",
            "description": "Tata Power Company on Tuesday reported an 8% growth in its December quarter consolidated net profit at Rs 1,031 crore versus Rs 953 crore reported in the year ago period. The Q3FY25 revenue from operations stood at Rs 15,391 crore, up 5% over Rs 14,651 crore reported in the corresponding quarter of the last financial year.",
            "pubDate": "2025-02-05T04:31:13.955863"
        },
        {
            "title": "Bajaj Electricals Q3 Results: Profit falls 10.7% to Rs 33.36 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-electricals-q3-results-profit-falls-10-7-to-rs-33-36-cr/articleshow/117910251.cms",
            "description": "Bajaj Electricals Ltd on Tuesday reported a decline of 10.7 per cent in consolidated net profit at Rs 33.36 crore for the third quarter ended on December 31, 2024.",
            "pubDate": "2025-02-05T04:31:13.956046"
        },
        {
            "title": "Godrej Properties Q3 Results: PAT soars 161% YoY to Rs 163 crore; stock rises over 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/godrej-properties-q3-results-pat-soars-161-yoy-to-rs-163-crore-stock-rises-over-4/articleshow/117909817.cms",
            "description": "Godrej Properties Q3 Results: Godrej Properties (GPL) on Tuesday announced its third-quarter results for the fiscal year 2025, reporting an impressive 161% year-on-year (YoY) increase in its profit after tax (PAT), which reached Rs 163 crore for the quarter.",
            "pubDate": "2025-02-05T04:31:13.956140"
        },
        {
            "title": "Asian Paints Q3 Results: Cons PAT falls 23% YoY to Rs 1,110 crore, misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/asian-paints-q3-results-cons-pat-falls-23-yoy-to-rs-1110-crore-misses-estimates/articleshow/117909595.cms",
            "description": "Asian Paints Share Price: Asian Paints reported a 23% fall in its consolidated net profit for Q3FY25 to Rs 1,110 crore, with revenue down 6% from the previous year. Weaker festive demand impacted standalone revenues, while industrial business and international growth showed positivity.",
            "pubDate": "2025-02-05T04:31:13.956233"
        }
    ]
}