{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-14T07:57:14.805720",
    "items": [
        {
            "title": "RBL Bank shares gain over 3% as Emirates NBD readies majority stake purchase. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-gain-over-3-as-emirates-nbd-readies-majority-stake-purchase-check-details/articleshow/124544061.cms",
            "description": "RBL Bank shares surged over 3% following news that Emirates NBD is negotiating a ₹15,000 crore investment, potentially becoming the majority shareholder with a 51% stake. The infusion will recapitalise the bank. Despite a 46% year-on-year profit drop in Q1 FY26, shares have rallied 87% year-to-date amid strong market optimism.",
            "pubDate": "2025-10-14T05:37:21.852634"
        },
        {
            "title": "Trump-Xi summit in South Korea on track amid trade tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-xi-summit-in-south-korea-on-track-amid-trade-tensions/slideshow/124544033.cms",
            "description": "US President Donald Trump is on track to meet Chinese leader Xi Jinping in South Korea in late October. The meeting, planned during the Asia-Pacific Economic Cooperation (APEC) summit, aims to ease tensions between the two countries over tariffs and export controls. (Source: Reuters)",
            "pubDate": "2025-10-14T05:37:21.852762"
        },
        {
            "title": "When quality meets pricing! How LG Electronics India listing set a record among India's Rs 10,000-crore IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/when-quality-meets-pricing-how-lg-electronics-india-listing-set-a-record-among-indias-rs-10000-crore-ipos/articleshow/124543938.cms",
            "description": "LG Electronics India made a strong debut on Dalal Street, listing at a 50% premium over its Rs 1,140 issue price. The IPO’s success, rare among India’s Rs 10,000-crore-plus issues, is attributed to reasonable valuations, dominant market positioning, and robust earnings visibility. With a diversified portfolio across home appliances, TVs, and ACs, LG continues to outpace peers in margins and growth.",
            "pubDate": "2025-10-14T05:37:21.852876"
        },
        {
            "title": "Did Tata Motors shares really crash 40%? What the demerger plunge actually means",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/did-tata-motors-shares-really-crash-40-what-the-demerger-plunge-actually-means/articleshow/124543657.cms",
            "description": "Tata Motors Demerger: Tata Motors share price experienced a notional 40% drop as its commercial vehicles business demerged into a new entity, TMLCV. The parent company, renamed TMPV, will now focus on passenger vehicles, EVs, and JLR. Brokerages anticipate clearer valuations and value unlocking from the split.",
            "pubDate": "2025-10-14T05:37:21.852977"
        },
        {
            "title": "US federal workers face mass furloughs as shutdown enters second week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-federal-workers-face-mass-furloughs-as-shutdown-enters-second-week/slideshow/124543884.cms",
            "description": "Republican Speaker Mike Johnson warned the federal government shutdown could become historic. He said he “won’t negotiate” with Democrats until they pause healthcare demands and reopen the government. (Source: Reuters)",
            "pubDate": "2025-10-14T05:37:21.853081"
        },
        {
            "title": "Tracking Ashish Kacholia? Latest updates show 2 fresh buys, 1 renewed bet and 2 partial exits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tracking-ashish-kacholia-latest-updates-show-2-fresh-buys-1-renewed-bet-and-2-partial-exits/slideshow/124543748.cms",
            "description": "Ace investor Ashish Kacholia, often called the \"Big Whale\" of mid- and small-cap stocks, has reshuffled his portfolio this quarter. The latest shareholding data for September 2025 reveals two new additions and a few trimmed positions. Here’s a quick breakdown of the key changes in his portfolio.",
            "pubDate": "2025-10-14T05:37:21.853183"
        },
        {
            "title": "LG share price target at Rs 2,050? Korean giant sparks record frenzy with 8 buy calls on Day 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-share-price-target-at-rs-2050-korean-giant-sparks-record-frenzy-with-8-buy-calls-on-day-1/articleshow/124543577.cms",
            "description": "LG Electronics India’s ₹11,600 crore IPO saw a blockbuster debut, with shares surging 50% above the ₹1,140 issue price to ₹1,710 on NSE and ₹1,715 on BSE. The IPO quickly earned at least seven buy ratings, reflecting strong analyst confidence and marking a rare success in India’s consumer durables sector.",
            "pubDate": "2025-10-14T05:37:21.853282"
        },
        {
            "title": "Fed policy focus: Balancing employment and price stability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-policy-focus-balancing-employment-and-price-stability/slideshow/124543639.cms",
            "description": "In her first speech as head of the Philadelphia Fed, Anna Paulson highlighted that rising risks to the job market could call for additional interest rate cuts. She also noted that trade tariffs are now less likely to push inflation higher than previously expected. Monetary policy, according to Paulson, should focus on balancing risks to employment and price stability. (Source: Reuters)",
            "pubDate": "2025-10-14T05:37:21.853380"
        },
        {
            "title": "Need a smallcap juggernaut this Diwali? 15 broader market stocks to buy for up to 120% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/need-a-smallcap-juggernaut-this-diwali-15-broader-market-stocks-to-buy-for-up-to-120-upside/slideshow/124543414.cms",
            "description": "As the festival of lights nears, leading brokerages have unveiled their Diwali 2025 smallcap picks, featuring 15 stocks that could shine in the year ahead. With improving domestic demand, policy push for manufacturing, and easing rate outlook, analysts expect select smallcaps to deliver strong returns -- some offering as much as 120% potential upside from current levels.",
            "pubDate": "2025-10-14T05:37:21.853484"
        },
        {
            "title": "LG Electronics India shares soar 50% on debut! Co sets record for mega issues on D-St",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-electronics-india-shares-soar-50-on-debut-co-sets-record-for-mega-issues-on-d-st/articleshow/124543193.cms",
            "description": "LG Electronics India shares: LG Electronics India's IPO debuted with a significant 50.4% premium, marking a strong start. This listing follows a trend of mixed performances for large Indian IPOs. Despite some past mega IPOs struggling, LG's debut highlights investor confidence. The company's brand strength and financial performance are key drivers. Analysts see continued growth potential for LG Electronics India.",
            "pubDate": "2025-10-14T05:37:21.853602"
        },
        {
            "title": "October IPO crash: 8 of 12 newly-listed cos trade below issue price. What should you do now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/october-ipo-crash-8-of-12-newly-listed-cos-trade-below-issue-price-what-should-you-do-now/articleshow/124543323.cms",
            "description": "October's IPO market saw a significant downturn, with eight out of twelve mainboard listings trading below their issue price. Aggressive pricing and reduced retail participation are cited as key reasons for this trend. While some companies like LG Electronics and Tata Capital performed well, many others experienced post-listing declines, prompting a more discerning investor approach.",
            "pubDate": "2025-10-14T05:37:21.853705"
        },
        {
            "title": "8 stocks to buy this Diwali: Ventura sees up to 120% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-stocks-to-buy-this-diwali-ventura-sees-up-to-120-upside/slideshow/124543284.cms",
            "description": "As Indian equities trade near record highs ahead of Diwali, optimism is being fuelled by robust earnings, moderating inflation, and strong domestic inflows. In this backdrop, Ventura Securities has identified eight stocks poised to outperform, offering potential gains of up to 120% over the next two years.",
            "pubDate": "2025-10-14T05:37:21.853812"
        },
        {
            "title": "Tata Capital shares in focus after steady debut; brokerages see up to 10% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-capital-shares-in-focus-after-steady-debut-brokerages-see-up-to-10-upside/articleshow/124542978.cms",
            "description": "Tata Capital shares: Tata Capital made a modest market debut, listing 1.23% above its issue price and closing 1.4% higher. Despite the subdued start, analysts at Emkay Global and JM Financial initiated coverage with ‘buy’ ratings and a target price of ₹360, suggesting a 10% upside. Brokerages highlighted the company’s strong Tata Group backing, solid credit profile, and improving financial metrics as major strengths.",
            "pubDate": "2025-10-14T05:37:21.853909"
        },
        {
            "title": "Q2 spoiler alert: Over 50 companies staring at double-digit profit slump could hit your portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-spoiler-alert-over-50-companies-staring-at-double-digit-profit-slump-could-hit-your-portfolio/articleshow/124542938.cms",
            "description": "India Inc's Q2 earnings season is set for a mixed outcome, with over 50 companies anticipating double-digit profit slumps, particularly in auto, metals, and banking. Despite these individual declines, overall market earnings are expected to remain stable, driven by strong performance in sectors like oil & gas, NBFC-lending, and telecom.",
            "pubDate": "2025-10-14T05:37:21.854005"
        },
        {
            "title": "HCL Tech shares gain 3% despite muted Q2. Should you buy, sell, or hold the stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-tech-shares-gain-3-despite-muted-q2-should-you-buy-sell-or-hold-the-stock/articleshow/124542884.cms",
            "description": "HCL Technologies' shares rallied despite reporting flat Q2 net profit. Revenue from operations saw an 11% year-on-year increase. Analysts offer mixed views, with targets ranging from Rs 1,600 to Rs 1,800, citing deal wins and AI growth as key drivers.",
            "pubDate": "2025-10-14T05:37:21.854103"
        },
        {
            "title": "Tata Investment Corp shares crash 90% in just one day! Is that true?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corp-shares-crash-90-in-just-one-day-is-that-true/articleshow/124542868.cms",
            "description": "Shares of Tata Investment Corporation fell sharply on October 21, hitting a low of Rs 1,015 on the NSE, following a 1:10 stock split. The apparent drop is purely optical, as the company’s market capitalisation and investor holdings remain unchanged. Post-split, the stock opened around Rs 1,056, making shares more affordable and improving liquidity.",
            "pubDate": "2025-10-14T05:37:21.854194"
        },
        {
            "title": "For investors with ability to take ‘logical risks’: 6 mid-cap stocks from different sectors with an upside potential up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-ability-to-take-logical-risks-6-mid-cap-stocks-from-different-sectors-with-an-upside-potential-up-to-40/articleshow/124546472.cms",
            "description": "Mid-caps are risky. They suffer heavily in any downturn. A large majority of the stocks have underperformed in the past year of correction. Also, why even look at mid-caps when good large-caps are available at reasonable valuations? All this is true. Yet, there is another undeniable fact: If you take a long-term perspective, mid-caps have given the best returns. Even in the best of bull runs, your returns would be just about okay if you did not own them. So, time to take a look at them? Especially now?",
            "pubDate": "2025-10-14T07:22:02.422140"
        },
        {
            "title": "MCX India shares jump 6% to hit fresh 52-Week high;  HDFC Securities maintains “Buy”",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-india-shares-jump-6-to-hit-fresh-52-week-high-hdfc-securities-maintains-buy/articleshow/124546318.cms",
            "description": "MCX India shares surged to a 52-week high, driven by robust gold and silver trading. HDFC Securities maintains a “Buy” rating with a Rs 10,000 target, citing strong options volumes, product launches, and steady revenue growth through FY25-28.",
            "pubDate": "2025-10-14T07:22:02.422265"
        },
        {
            "title": "Jammu and Kashmir sees ten-fold rise in investor base on NSE in last decade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jammu-and-kashmir-sees-ten-fold-rise-in-investor-base-on-nse-in-last-decade/articleshow/124545503.cms",
            "description": "Jammu and Kashmir has witnessed a remarkable ten-fold surge in its National Stock Exchange investor base over the past decade, growing from 65,000 in 2015 to 6.51 lakh in 2025. This significant increase, outpacing the national average, highlights growing financial awareness and trust in formal systems, with women's participation also exceeding the national average.",
            "pubDate": "2025-10-14T07:22:02.422485"
        },
        {
            "title": "LG Electronics India gets listed on NSE, soars 50% on debut after $1.3 bn IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-electronics-india-gets-listed-on-nse-soars-50-on-debut-after-1-3-bn-ipo/videoshow/124547088.cms",
            "description": "Shares in LG Electronics India soared 50 percent on their market debut on Tuesday, after raising more than $1 billion in the country's third-biggest initial public offering of the year. The offer, which involved the sale of a little more than 71 million shares, received bids for more 3.8 billion shares --  making it the most-subscribed big Indian IPO in nearly two decades.",
            "pubDate": "2025-10-14T07:57:13.219430"
        },
        {
            "title": "Nomura values Tata Motors passenger and commercial arms nearly equal, flags near-term volatility post demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-values-tata-motors-passenger-and-commercial-arms-nearly-equal-flags-near-term-volatility-post-demerger/articleshow/124546768.cms",
            "description": "Nomura maintains a neutral stance on Tata Motors post-demerger, valuing PV and CV units almost equally, highlighting improving PV momentum, steady CV prospects, but cautioning technical risks and short-term volatility.",
            "pubDate": "2025-10-14T07:57:13.219561"
        }
    ]
}