{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-19T15:48:11.891526",
    "items": [
        {
            "title": "Asian stocks join Wall Street rally, brace for BOJ hike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-join-wall-street-rally-brace-for-boj-hike/articleshow/126067388.cms",
            "description": "Asian markets rebounded, mirroring Wall Street's tech surge, as investors anticipate a Bank of Japan rate hike. U.S. inflation slowed to 2.7%, though analysts caution about data distortions. Central banks in Europe and Britain signaled a more cautious approach to future rate cuts, impacting currency and bond markets.",
            "pubDate": "2025-12-19T01:48:15.406015"
        },
        {
            "title": "Are Anupam Rasayan shares poised for long-term gains on Jayhawk deal?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-anupam-rasayan-shares-poised-for-long-term-gains-on-jayhawk-deal/articleshow/126067320.cms",
            "description": "Anupam Rasayan's stock surged following its $150 million acquisition of US-based Jayhawk Fine Chemicals. This strategic move grants Anupam a US manufacturing presence, enhancing its global CDMO capabilities and polymer portfolio. The deal, funded through internal accruals and structured equity, is expected to be EPS accretive from day one and significantly boost US export share.",
            "pubDate": "2025-12-19T01:48:15.406135"
        },
        {
            "title": "Stocks in news: ICICI Prudential AMC, Meesho, Ola Electric, Bharti Airtel, Vodafone Idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-icici-prudential-amc-meesho-ola-electric-bharti-airtel-vodafone-idea/articleshow/126060941.cms",
            "description": "Markets traded cautiously, ending flat as consolidation continues, influenced by global cues and currency concerns. Key stocks like Ola Electric, ICICI Prudential AMC, and Bharti Airtel are in focus due to promoter stake sales, IPO debut, and CFO appointment respectively. NTPC plans significant capacity expansion, while Vodafone Idea raised funds for network investment.",
            "pubDate": "2025-12-19T01:48:15.406335"
        },
        {
            "title": "GIFT Nifty up 70 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126061024.cms",
            "description": "Nifty consolidated with a weak bias on Thursday, closing marginally lower. Analysts suggest the short-term trend remains choppy, with the 25,700 level appearing vulnerable. Foreign portfolio investors and domestic institutional investors showed net buying activity.",
            "pubDate": "2025-12-19T01:48:15.406441"
        },
        {
            "title": "Meesho m-cap tops Rs 1 lakh cr in seven sessions after its listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-m-cap-tops-rs-1-lakh-cr-in-seven-sessions-after-its-listing/articleshow/126067207.cms",
            "description": "E-commerce platform Meesho's market capitalization surged past ₹1 lakh crore within seven sessions of its listing, closing Thursday at ₹234 per share. This significant growth, up 37% since its December 10th debut, is attributed to its focus on Tier 2 and 3 city consumers and a robust, asset-light business model generating positive cash flows.",
            "pubDate": "2025-12-19T01:48:15.406559"
        },
        {
            "title": "Sebi strikes a 'balance' in fee change; AMCs, brokers rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-strikes-a-balance-in-fee-change-amcs-brokers-rally/articleshow/126067189.cms",
            "description": "Asset management and broking stocks surged on Thursday following Sebi's revised mutual fund fee structure and broking fee caps. The regulator's less severe overhaul, with reduced expense ratio cuts and lower brokerage fee limits, led to a relief rally, with several AMC and brokerage firms seeing significant gains.",
            "pubDate": "2025-12-19T01:48:15.406657"
        },
        {
            "title": "Japan’s MUFG to invest $4.45 billion on Shriram Finance in biggest FDI in Indian financial services",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-mufg-to-invest-4-45-billion-on-shriram-finance-in-biggest-fdi-in-indian-financial-services/articleshow/126067351.cms",
            "description": "Mitsubishi UFJ Financial Group is set to invest $4.45 billion for a 20% stake in Shriram Finance, marking the largest FDI in India's financial services sector. This strategic move paves the way for an eventual acquisition, with MUFG aiming to increase its holding and gain majority control over time.",
            "pubDate": "2025-12-19T01:48:15.406755"
        },
        {
            "title": "ECB holds interest rates at 2% for a fourth time",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecb-holds-interest-rates-at-2-for-a-fourth-time/articleshow/126067147.cms",
            "description": "The European Central Bank has held interest rates steady for the fourth time. Inflation is near the bank's target. The euro zone economy is showing resilience. New forecasts suggest economic growth will strengthen. Inflation is expected to return to the 2% target in 2028. Other central banks like the Bank of England and Federal Reserve have cut rates.",
            "pubDate": "2025-12-19T01:48:15.406848"
        },
        {
            "title": "ICICI Pru AMC could gain up to 10-20% on debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-pru-amc-could-gain-up-to-10-20-on-debut/articleshow/126067089.cms",
            "description": "ICICI Prudential Asset Management's IPO saw a strong subscription, indicating a likely firm market debut with potential listing gains of 10-20%. Analysts suggest the stock could list above ₹2,500, with some assigning a 'Buy' rating and a price target of ₹3,000. The company's strong fundamentals and industry tailwinds support long-term growth prospects.",
            "pubDate": "2025-12-19T01:48:15.406941"
        },
        {
            "title": "Airtel rings in rights issue, shuffles senior leadership",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/airtel-rings-in-rights-issue-shuffles-senior-leadership/articleshow/126067357.cms",
            "description": "Bharti Airtel's board has approved calling the remaining ₹15,740 crore from a rights issue. This move aims to cut debt and strengthen the company's balance sheet. The board also approved a top management rejig. Shashwat Sharma will become the new CEO from January 1. Gopal Vittal will transition to executive vice chairman. Akhil Garg is the new CFO.",
            "pubDate": "2025-12-19T01:48:15.407126"
        },
        {
            "title": "HDFC, BoB raise $1.5 billion from overseas loan market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bob-raise-1-5-billion-from-overseas-loan-market/articleshow/126067272.cms",
            "description": "HDFC Bank and Bank of Baroda have collectively secured $1.5 billion in overseas loans, bolstering their liquidity amidst stabilizing interest rates. HDFC Bank raised $1 billion through a three-and-a-half-year loan, while BoB secured $500 million via a five-year pact, with MUFG and HSBC involved in the transactions.",
            "pubDate": "2025-12-19T01:48:15.407217"
        },
        {
            "title": "At Rs 1.5 lakh crore, promoter selling breaks all records in 2025. Should stock market investors worry?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-rs-1-5-lakh-crore-promoter-selling-breaks-all-records-in-2025-should-stock-market-investors-worry/articleshow/126069088.cms",
            "description": "Promoter selling has reached a record Rs 1.5 lakh crore in 2025. This significant selloff has led to a decline in private promoter shareholding to an eight-year low. Prominent business houses like Bharti Airtel and IndiGo have seen substantial promoter sales. While some view this as a sign of expensive valuations, experts suggest varied motivations behind these sales.",
            "pubDate": "2025-12-19T04:05:25.646366"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama maintains reduce rating on Voltas; Morgan Stanley maintains equal weight on HCL Technologies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-maintains-reduce-rating-on-voltas-morgan-stanley-maintains-equal-weight-on-hcl-technologies/articleshow/126069048.cms",
            "description": "Brokerages offer selective advice on large-cap stocks. Analysts weigh current challenges against future growth in sectors like pharma and IT. Nuvama suggests a 'Reduce' on Voltas due to margin pressures. Citi is positive on Divi's Laboratories, seeing a 43% upside. Morgan Stanley rates HCL Technologies 'Equal Weight' following a new acquisition. These insights guide investors on potential stock movements.",
            "pubDate": "2025-12-19T04:05:25.646488"
        },
        {
            "title": "Positive Breakout: These 10 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-cross-above-their-200-dmas/slideshow/126067808.cms",
            "description": "As of December 18, 2025, 15 NSE-listed stocks with a market capitalisation of over Rs 1,000 crore closed above their 200-day moving average (DMA). Of these, we have highlighted the top 10 that posted gains of more than 2%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-12-19T04:05:25.646596"
        },
        {
            "title": "TCS, Infosys, other IT stocks in focus as Accenture reports 6% revenue growth in Q1, strong FY26 guidance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-infosys-other-it-stocks-in-focus-as-accenture-reports-6-revenue-growth-in-q1-strong-fy26-guidance/articleshow/126068864.cms",
            "description": "IT stocks such as Infosys, TCS and HCL Tech will be in focus after Accenture posted a strong Q1 FY26, reporting 6% dollar revenue growth, higher bookings and upbeat full-year guidance, boosting sentiment for the IT services sector.",
            "pubDate": "2025-12-19T04:05:25.646698"
        },
        {
            "title": "Shriram Finance shares in focus ahead of board meet on MUFG’s $4.45 billion investment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-shares-in-focus-ahead-of-board-meet-on-mufgs-4-45-billion-investment/articleshow/126068807.cms",
            "description": "Shriram Finance shares are in focus ahead of a board meeting to approve a proposed Rs 40,000 crore strategic investment by MUFG for a 20% stake. The deal, set to be India’s largest FDI in financial services, could strengthen capital access and support future growth.",
            "pubDate": "2025-12-19T04:05:25.646798"
        },
        {
            "title": "Ola Electric shares in focus as promoter Bhavish Aggarwal sells Rs 2.83 crore stake, marking 3rd consecutive day of sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-as-promoter-bhavish-aggarwal-sells-rs-2-83-crore-stake-marking-3rd-consecutive-day-of-sale/articleshow/126068792.cms",
            "description": "Ola Electric shares will be in focus after promoter Bhavish Aggarwal sold shares worth Rs 324 crore over three days through bulk deals to repay a promoter-level loan. The move removes all share pledges, reduces overhang concerns and does not alter promoter control or the company’s long-term strategy.",
            "pubDate": "2025-12-19T04:05:25.646894"
        },
        {
            "title": "Bank of Japan raises interest rates to 30-year high, signals more hikes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-japan-raises-interest-rates-to-0-75-highest-in-30-years/articleshow/126068748.cms",
            "description": "The Bank of Japan has taken a significant step by raising interest rates. This marks a major shift after decades of extensive monetary support and very low borrowing costs. The central bank's decision to increase short-term rates to 0.75% was unanimous. Governor Kazuo Ueda will provide further details at a press conference.",
            "pubDate": "2025-12-19T04:05:25.647009"
        },
        {
            "title": "RIL shares in focus as consumer arm acquires majority stake in this nutrition brand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-as-consumer-arm-acquires-majority-stake-in-this-nutrition-brand/articleshow/126068777.cms",
            "description": "Reliance Consumer Products has acquired a majority stake in Udhaiyams Agro Foods. This move strengthens Reliance's branded staples portfolio. Udhaiyam brings over three decades of experience in staples and packaged pulses. The promoters will continue to support growth. Morgan Stanley anticipates rating upgrades for Reliance Industries in 2026. The retail segment shows rapid scaling and quick commerce growth via JioMart.",
            "pubDate": "2025-12-19T04:05:25.647109"
        },
        {
            "title": "HCL Tech shares in focus after $160 million HPE telco unit buy; Morgan Stanley bullish",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-tech-shares-in-focus-after-160-million-hpe-telco-unit-buy-morgan-stanley-bullish/articleshow/126068779.cms",
            "description": "HCL Technologies has announced the acquisition of Hewlett Packard Enterprise’s Telco Solutions Business in an all-cash deal valued at up to $160 million, including performance-linked incentives. The move is aimed at strengthening HCLTech’s engineering- and AI-led telecom offerings, with brokerages expecting the impact on earnings to be limited.",
            "pubDate": "2025-12-19T04:05:25.647201"
        },
        {
            "title": "Meesho shares in focus after 110% surge since listing; short squeeze triggers auction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-in-focus-after-110-surge-since-listing-short-squeeze-triggers-auction/articleshow/126068776.cms",
            "description": "Meesho shares are in focus after surging nearly 110% in seven sessions post listing, triggering a short squeeze and exchange auctions due to low free-float. Strong demand, limited supply and positive brokerage commentary have driven sharp gains, highlighting volatility risks in recently listed stocks.",
            "pubDate": "2025-12-19T04:05:25.647295"
        },
        {
            "title": "Vodafone Idea shares in focus after Rs 3,300 crore fundraise plan via NCDs by subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-after-rs-3300-crore-fundraise-plan-via-ncds-by-subsidiary/articleshow/126068756.cms",
            "description": "Vodafone Idea shares will be in focus after the company raised Rs 3,300 crore through NCDs issued by its subsidiary VITIL. The fundraise saw strong investor demand and is aimed at supporting capex and growth plans, reinforcing confidence in the telecom operator’s long-term strategy.",
            "pubDate": "2025-12-19T04:05:25.647393"
        },
        {
            "title": "GPT Infra shares in focus on Rs 1,804-crore contract from Mumbai Municipal Corp",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gpt-infra-shares-in-focus-on-rs-1804-crore-contract-from-mumbai-municipal-corp/articleshow/126068561.cms",
            "description": "GPT Infraprojects secured a significant Rs 1,804 crore contract from the Municipal Corp of Greater Mumbai for a flyover project. This follows a recent Rs 54 crore order from South Eastern Railways. The company's robust order book and strong Q2 performance indicate positive future growth prospects.",
            "pubDate": "2025-12-19T04:05:25.647488"
        },
        {
            "title": "Vegetable seller Stanbik Agro shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vegetable-seller-stanbik-agro-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126067948.cms",
            "description": "Stanbik Agro, a vegetable and fruit seller, is set to list on the BSE SME platform on December 19. The Rs 12 crore IPO, which closed on December 16, saw modest subscription. Grey market indicators suggest a flat opening, with shares likely to trade near the IPO price of Rs 30.",
            "pubDate": "2025-12-19T04:05:25.647582"
        },
        {
            "title": "Ashwini Container shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashwini-container-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126067902.cms",
            "description": "Ashwini Container Movers is set for its NSE SME debut on December 19, with grey market signals suggesting a modest listing around Rs 147-148. The Rs 71 crore IPO saw decent subscription, particularly from non-institutional investors.",
            "pubDate": "2025-12-19T04:05:25.647672"
        },
        {
            "title": "Exim Routes shares to debut today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/exim-routes-shares-to-debut-today-heres-what-gmp-indicates/articleshow/126067881.cms",
            "description": "Exim Routes is poised for a robust debut on the NSE SME platform on December 19, with grey market premiums indicating significant investor interest. The company's technology-driven platform for cross-border trade in recyclable materials has attracted strong demand, evidenced by its oversubscribed IPO. Proceeds will fuel platform development and working capital.",
            "pubDate": "2025-12-19T04:05:25.647761"
        },
        {
            "title": "Ashish Kacholia-backed multibagger stock to turn ex-split on Dec 22; last day to qualify for eligibility. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-multibagger-stock-to-turn-ex-split-on-dec-22-last-day-to-qualify-for-eligibility-do-you-own/articleshow/126067819.cms",
            "description": "Knowledge Marine & Engineering Works stock will trade ex-split on December 22, 2025. Investors must buy shares by December 19 to benefit from the stock split. The company is subdividing its shares in a 1:2 ratio. Each Rs 10 share will become two Rs 5 shares. Ace investor Ashish Kacholia holds a significant stake in the company.",
            "pubDate": "2025-12-19T04:05:25.647849"
        },
        {
            "title": "Dhurandhar stocks to buy for 2026: Swiggy, ICICI Bank among 75 stock bets by 6 brokerages",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dhurandhar-stocks-to-buy-for-2026-swiggy-icici-bank-among-75-stock-bets-by-6-brokerages/slideshow/126069777.cms",
            "description": "Six brokerages - Morgan Stanley, HSBC, BofA Securities, Nomura, Jefferies and ICICI Direct- have said Indian equities are entering 2026 with improving macro tailwinds after a bruising period of underperformance. They cite easing financial conditions, a recovery in earnings, light foreign positioning and a shift in market leadership, with Sensex targets clustered around the mid-90,000s and Nifty levels near 29,000-30,000. Financials, consumption and industrials dominate their preferences, alongside selective autos, telecom and real estate names. Here are the 75 stock bets by the six brokerages.",
            "pubDate": "2025-12-19T04:59:36.940690"
        },
        {
            "title": "ICICI Prudential AMC shares list at 20% premium after strong IPO response",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-amc-shares-list-at-20-premium-after-strong-ipo-response/articleshow/126069243.cms",
            "description": "ICICI Prudential Asset Management debuted on the stock market with a 20% gain, opening at Rs 2,606.20 on the BSE and Rs 2,600 on the NSE. The IPO saw strong subscription, particularly from institutional buyers, and the company raised Rs 3,022 crore from anchor investors prior to listing.",
            "pubDate": "2025-12-19T04:59:36.940805"
        },
        {
            "title": "Japan's Nikkei rallies, JGB yields hit 2006 high as BOJ hikes rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rallies-jgb-yields-hit-2006-high-as-boj-hikes-rates/articleshow/126069453.cms",
            "description": "Japan's Nikkei surged over 1% as the Bank of Japan raised interest rates to a three-decade high of 0.75%, signaling further tightening. The 10-year government bond yields consequently hit a 19-year peak of 2%, a level previously acting as a ceiling against deflation. Equity investors were also buoyed by a positive overnight session on Wall Street.",
            "pubDate": "2025-12-19T04:59:36.940899"
        },
        {
            "title": "Explained: Why are short-sellers getting trapped after the listing of startup IPOs?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-are-short-sellers-getting-trapped-after-the-listing-of-startup-ipos/articleshow/126069435.cms",
            "description": "Short-sellers are getting trapped in recent Indian startup IPOs. Stocks like Meesho and Groww have seen sharp rallies after listing. This is driven by strong demand and very limited shares available for trading. When short-sellers cannot deliver shares on settlement day, they face forced losses. The exchange's auction mechanism forces them to buy shares at higher prices, increasing their pain.",
            "pubDate": "2025-12-19T04:59:36.940993"
        },
        {
            "title": "Why is the stock market rising? Sensex jumps over 500 points, Nifty above 25,950; key factors behind the rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-the-stock-market-rising-sensex-jumps-over-500-points-nifty-above-25950-key-factors-behind-the-rally/articleshow/126069055.cms",
            "description": "Indian stock markets surged on Friday. The Sensex and Nifty saw significant gains, reversing recent declines. This rally was fueled by encouraging U.S. inflation data. Lower inflation in America boosted global investor confidence. Expectations for Federal Reserve interest rate cuts in the coming year also increased. Asian markets mirrored this positive trend.",
            "pubDate": "2025-12-19T04:59:36.941102"
        },
        {
            "title": "RBL Bank, MCX, Laurus Labs among 10 stocks that rallied up to 120% in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-mcx-laurus-labs-among-10-stocks-that-rallied-up-to-120-in-2025/slideshow/126069353.cms",
            "description": "As 2025 draws to close, market leadership within the BSE 500 has been far from uniform with over 300 companies out of 500 still trading in the red for the year. While volatility, sectoral churn and shifting investor preferences kept many stocks under pressure, a select set of companies consistently outperformed the broader market with some even doubling investor money. Here are top 10 BSE 500 stocks that emerged as best bets of the year.",
            "pubDate": "2025-12-19T04:59:36.941200"
        },
        {
            "title": "More zeros than multibaggers! India's SME IPO returns in 2025 crushed under heavy scrutiny",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/more-zeros-than-multibaggers-indias-sme-ipo-returns-in-2025-crushed-under-heavy-scrutiny/articleshow/126069232.cms",
            "description": "India's SME IPO market experienced a significant downturn in 2025, with listing gains plummeting to 12.6% and over half of new listings trading below their IPO price. Tighter regulations, including price caps, and weak smallcap sentiment have curbed speculative trading, forcing a reset in investor expectations for quick profits.",
            "pubDate": "2025-12-19T04:59:36.941296"
        },
        {
            "title": "Trump’s Fed Contenders: Divergent paths to a common goal of lower rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-fed-contenders-divergent-paths-to-a-common-goal-of-lower-rates/articleshow/126069203.cms",
            "description": "As Donald Trump weighs successors to Fed Chair Jerome Powell, Kevin Hassett, Christopher Waller and Kevin Warsh emerge as leading contenders with differing views on rates, reforms and the Fed’s role.",
            "pubDate": "2025-12-19T04:59:36.941386"
        },
        {
            "title": "Lenskart shares rise 4% as Macquarie initiates with Outperform. Check target, upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-rise-4-as-macquarie-initiates-with-outperform-check-target-upside-potential/articleshow/126069155.cms",
            "description": "Lenskart Solutions shares surged nearly 4% to Rs 427 after Macquarie initiated coverage with an Outperform rating and a Rs 530 target price, citing robust growth and a strong integrated supply chain. The company also reported a 20% year-on-year rise in consolidated profit after tax to Rs 102.22 crore in its first earnings post-IPO.",
            "pubDate": "2025-12-19T04:59:36.941480"
        },
        {
            "title": "Growth or Value? Decoding the Winning Strategy Across Indian and Global Markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/growth-or-value-decoding-the-winning-strategy-across-indian-and-global-markets/articleshow/126069179.cms",
            "description": "The growth-versus-value debate plays out differently across India, the US and global markets, shaped by valuations, cycles and monetary policy, making balance and timing key for HNIs.",
            "pubDate": "2025-12-19T04:59:36.941569"
        },
        {
            "title": "HDFC AMC eyes 4 regulatory tailwinds after Sebi tweaks expense ratio rule, brokerages see upside intact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-eyes-4-regulatory-tailwinds-after-sebi-tweaks-expense-ratio-rule-brokerages-see-upside-intact/articleshow/126070165.cms",
            "description": "HDFC AMC anticipates positive regulatory changes following Sebi's revised mutual fund expense rules. Brokerages believe these adjustments will boost earnings and valuations. The new framework, effective April 2026, is less punitive than initially feared. This clarity allows focus to shift back to HDFC AMC's growth potential and market share.",
            "pubDate": "2025-12-19T05:26:46.651417"
        },
        {
            "title": "IRFC leads railway route in 2025 as sector sees Rs 1.32 lakh cr wealth erosion. Why 2026 comeback looks tricky?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irfc-leads-railway-route-in-2025-as-sector-sees-rs-1-32-lakh-cr-wealth-erosion-why-2026-comeback-looks-tricky/articleshow/126070115.cms",
            "description": "Indian railway stocks have suffered a sharp valuation reset in 2025, erasing Rs 1.32 lakh crore in investor wealth, led by steep losses in IRFC and other PSU players. Analysts cite stretched valuations, muted capex growth and execution challenges as key hurdles, making a broad-based recovery in 2026 uncertain despite long-term structural support.",
            "pubDate": "2025-12-19T05:26:46.651547"
        },
        {
            "title": "Dr Lal PathLabs shares tank 51% today, but here’s why investors shouldn’t panic",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-lal-pathlabs-shares-tank-51-today-but-heres-why-investors-shouldnt-panic/articleshow/126070051.cms",
            "description": "Dr Lal PathLabs shares plunged over 50% in early trade after the stock turned ex-bonus following a 1:1 bonus issue. The sharp fall is purely technical, reflecting price adjustment for additional shares, and does not impact investors’ overall holding value or ownership in the company.",
            "pubDate": "2025-12-19T05:26:46.651758"
        },
        {
            "title": "Smart Money’s Shield: How HNIs Use Stop-Losses Across Global Markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smart-moneys-shield-how-hnis-use-stop-losses-across-global-markets/articleshow/126069862.cms",
            "description": "Stop-loss orders have become a vital risk-management tool across Indian and global markets, helping investors preserve capital and maintain discipline amid volatility.",
            "pubDate": "2025-12-19T05:26:46.651856"
        },
        {
            "title": "ICICI Prudential ACM shares list at 20% premium over IPO price. What should investors do now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-acm-shares-list-at-20-premium-over-ipo-price-what-should-investors-do-now/articleshow/126070627.cms",
            "description": "ICICI Prudential AMC debuted at a 20% premium after a heavily subscribed IPO. Brokerages see meaningful upside, citing its strong equity AUM share, robust SIP franchise, and expanding PMS and AIF businesses. While long-term prospects remain positive, experts suggest profit-booking for short-term traders and holding for long-term investors.",
            "pubDate": "2025-12-19T05:53:47.902327"
        },
        {
            "title": "Stocks to buy for 2026: Adani Power, VRL Logistics among 5 stocks that could give 10-30% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-adani-power-vrl-logistics-among-5-stocks-that-could-give-10-30-return-in-1-year/slideshow/126070790.cms",
            "description": "Brokerages are upbeat on a diverse set of stocks across real estate, FMCG, logistics, power, and defence electronics, highlighting strong growth visibility and attractive risk–reward profiles.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-19T06:16:51.992329"
        },
        {
            "title": "HDFC AMC shares fall over 3% on profit booking post 7% rally after SEBI rule change",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-shares-fall-over-3-on-profit-booking-post-7-rally-after-sebi-rule-change/articleshow/126071519.cms",
            "description": "HDFC AMC shares declined 3.5% after a profit booking session, following a 7% rally the previous day triggered by SEBI’s overhaul of mutual fund expense regulations. The new framework introduces the Base Expense Ratio (BER) and separates statutory and regulatory levies, providing greater transparency but raising questions about long-term profitability for asset managers.",
            "pubDate": "2025-12-19T06:48:48.592618"
        },
        {
            "title": "Groww shares rally 13% as Jefferies sees a Robinhood playbook at work, initiates coverage with Buy call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/has-rupee-bottomed-out-against-the-dollar-jefferies-chris-wood-decodes-the-forex-math/articleshow/126071463.cms",
            "description": "Billionbrains Garage Ventures saw its stock soar after Jefferies introduced a buy rating, suggesting promising growth in earnings. Meanwhile, the Indian rupee has experienced a notable drop, but the underlying economic conditions in India remain solid. Stakeholders should keep an eye on shifts in trade policies and the flow of foreign investments.",
            "pubDate": "2025-12-19T06:48:48.592730"
        },
        {
            "title": "Groww shares rally 13% as Jefferies sees a Robinhood playbook at work, initiates coverage with Buy call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-sees-a-robinhood-playbook-at-work-as-it-initiates-coverage-on-groww-parent-with-buy-call/articleshow/126071355.cms",
            "description": "Jefferies has initiated coverage on Groww’s parent Billionbrains Garage Ventures with a Buy rating, citing strong client growth, rapid product expansion and margin potential. The brokerage expects robust earnings growth driven by new offerings, operating leverage and a strategy similar to Robinhood’s scalable, product-led model.",
            "pubDate": "2025-12-19T06:48:48.592923"
        },
        {
            "title": "From 55,000% run-up to weekly trades, RRP Semiconductors shares under investor radar amid red flags",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-55000-run-up-to-weekly-trades-rrp-semiconductors-shares-under-investor-radar-amid-red-flags/articleshow/126071279.cms",
            "description": "RRP Semiconductors, a star of India’s AI-driven stock rally after a 55,000% surge in 20 months, is now under regulatory scrutiny, with trading restrictions imposed and investors cautioned as the stock slides from its peak despite a still-hefty market cap.",
            "pubDate": "2025-12-19T06:48:48.593016"
        },
        {
            "title": "BLS International shares rally 7% after Delhi High Court overturns MEA tender ban",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bls-international-shares-rally-7-after-delhi-high-court-overturns-mea-tender-ban/articleshow/126071888.cms",
            "description": "Shares of BLS International rose sharply after the Delhi High Court overturned a two-year ban imposed by the Ministry of External Affairs, allowing the company to participate in future tenders. The ruling removes restrictions that had affected tender participation, while existing contracts and financial outlook remain largely unaffected.",
            "pubDate": "2025-12-19T07:00:40.566130"
        },
        {
            "title": "Shriram Finance, Titan, 5 other stocks hit new 52-week high amid mkt resilience",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-titan-5-other-stocks-hit-new-52-week-high-amid-mkt-resilience/slideshow/126073693.cms",
            "description": "Indian equities traded sharply higher on Friday, with the Sensex and Nifty rebounding after four consecutive sessions of decline. The rally came on the back of a cooler-than-expected U.S. inflation reading, which revived global risk appetite and boosted hopes for interest rate cuts by the Federal Reserve in the year ahead.This optimism was further fuelled by gains in Asian markets and other supportive cues, helping domestic indices recover ground. Against this backdrop, several stocks scaled fresh 52-week highs. Here is a look at seven such stocks that surged to new peaks amid this resilient market environment.",
            "pubDate": "2025-12-19T08:52:12.597763"
        },
        {
            "title": "ICICI Prudential AMC delivers second best listing among Rs 10,000 crore-plus IPOs this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-amc-delivers-second-best-listing-among-rs-10000-crore-plus-ipos-this-year/articleshow/126073283.cms",
            "description": "ICICI Prudential AMC debuted strongly with a nearly 20% listing gain, ranking as the second-best performer among Rs 10,000 crore-plus IPOs in 2025, driven by overwhelming institutional demand and reinforcing investor appetite for quality financial services despite a cautious market.",
            "pubDate": "2025-12-19T08:52:12.597913"
        },
        {
            "title": "European shares muted as bank gains offset broader losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-muted-as-bank-gains-offset-broader-losses/articleshow/126074238.cms",
            "description": "European shares were muted on Friday, as losses in tech and consumer stocks were limited by gains in heavyweight banks, but ‌were set ‌to end a week of economic data releases and central bank decisions ‌with robust gains.",
            "pubDate": "2025-12-19T09:36:02.276998"
        },
        {
            "title": "Volume shockers: ITI Ltd, Tata Elxsi among top 5 stocks to trade with high volumes today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/volume-shockers-iti-ltd-tata-elxsi-among-top-5-stocks-to-trade-with-high-volumes-today/slideshow/126074207.cms",
            "description": "While broader markets rebounded on the back of global cues, trading activity in select counters shot through the roof, indicating pockets of intense investor interest. These weren’t necessarily top gainers—but the volume build-up in them was hard to miss.From telecom to auto and IT, multiple sectors saw a spike in traded quantities, some clocking over 100x their average daily volume. The following slides showcase the top 5 volume shockers of the day, as highlighted by StockEdge, that stood out with unusually high activity on the bourses.",
            "pubDate": "2025-12-19T09:36:02.277128"
        },
        {
            "title": "Ola Electric, Aditya Birla Fashion among worst BSE 500 performers, stocks sink up to 70% in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-aditya-birla-fashion-among-worst-bse-500-performers-stocks-sink-up-to-70-in-2025/articleshow/126074675.cms",
            "description": "More than 300 BSE 500 stocks ended 2025 in deep losses, with names like Ola Electric, FirstCry and Aditya Birla Fashion plunging as much as 70% amid volatility and sectoral churn.",
            "pubDate": "2025-12-19T09:49:46.982729"
        },
        {
            "title": "Tata Power raises Rs 2,000 cr via issuance of NCDs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-power-raises-rs-2000-cr-via-issuance-of-ncds/articleshow/126074584.cms",
            "description": "Tata Power on Friday said it has raised Rs 2,000 crore through non-convertible debentures (NCDs) on private placement basis.",
            "pubDate": "2025-12-19T09:49:46.982871"
        },
        {
            "title": "Ather Energy shares rally 8% in today’s session. What’s behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ather-energy-shares-rally-8-in-todays-session-whats-behind-the-surge/articleshow/126075128.cms",
            "description": "Ather Energy is launching its own auto insurance services. This move aims to simplify the ownership experience for its electric two-wheeler customers. The company will partner with multiple insurers to offer policies nationwide. This strategy is part of Ather's plan to build a complete ecosystem around its vehicles.",
            "pubDate": "2025-12-19T10:21:49.085568"
        },
        {
            "title": "Ola Electric, Aditya Birla Fashion among worst BSE 500 performers, stocks sink up to 70% in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-aditya-birla-fashion-among-worst-bse-500-performers-stocks-sink-up-to-70-in-2025/slideshow/126075542.cms",
            "description": "As 2025 draws to a close, more than 300 stocks in the BSE 500 continue to trade deep in the red, with several names plunging up to 70% during the year. Persistent market volatility, sharp sectoral churn, and shifting investor preferences have kept many stocks under sustained pressure. Here are the 10 worst-performing stocks in the BSE 500 that emerged as the year’s biggest laggards.",
            "pubDate": "2025-12-19T10:54:26.549316"
        },
        {
            "title": "MNC stocks: Time to look at them with a different lens; 6 stocks which may fit the bill for medium- to long-term investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mnc-stocks-time-to-look-at-them-with-a-different-lens-6-stocks-which-may-fit-the-bill-for-medium-to-long-term-investors/articleshow/126076518.cms",
            "description": "Earlier this year, when Apple announced it would increase production in India, US President Trump said he told the Apple CEO not to do so. He wanted production brought back to the US. We can only guess what Apple will finally do (or has done). But, the incident underlines two trends that emerged four years back. One, global companies looking for an alternative to China for their manufacturing facilities; and two, seeking the alternative as close to home as possible, if not the home country itself. Four years down the line, there are some companies where things have moved. At others, plans are still on the drawing board.",
            "pubDate": "2025-12-19T11:41:01.493537"
        },
        {
            "title": "Stock Radar: Bharti Airtel stock takes support above 50-DMA after hitting highs in November 2025; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-bharti-airtel-stock-takes-support-above-50-dma-after-hitting-highs-in-november-2025-what-should-investors-do/articleshow/126061712.cms",
            "description": "Bharti Airtel shares have rebounded after holding above the 50-DMA, signalling strength despite recent profit-taking. Experts suggest buying on dips for a potential upside towards Rs 2,200–2,250 over the next 1–2 months, citing an overall uptrend, improving momentum indicators and a strong higher highs–higher lows price structure.",
            "pubDate": "2025-12-19T11:41:01.493653"
        },
        {
            "title": "Gainers & Losers: ICICI Pru AMC, Ola among 6 stocks that stole limelight on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-icici-pru-amc-ola-among-6-stocks-that-stole-limelight-on-friday/slideshow/126076582.cms",
            "description": "",
            "pubDate": "2025-12-19T11:41:01.493743"
        },
        {
            "title": "Nithin Kamath's warning to traders: Why poor position sizing can wipe you out",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nithin-kamaths-warning-to-traders-why-poor-position-sizing-can-wipe-you-out/articleshow/126077214.cms",
            "description": "Zerodha founder Nithin Kamath has warned traders that poor position sizing is one of the biggest causes of market losses. He said even traders who are right most of the time can be wiped out by a single oversized bet, stressing that risk management is critical for long-term survival.",
            "pubDate": "2025-12-19T12:35:37.721598"
        },
        {
            "title": "Uday Kotak lauds MUFG stake buy in Shriram Finance but flags big question on next move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uday-kotak-lauds-mufg-stake-buy-in-shriram-finance-but-flags-big-question-on-next-move/articleshow/126078656.cms",
            "description": "Uday Kotak welcomed MUFG Bank’s Rs 39,618 crore investment in Shriram Finance, questioning whether it should remain an NBFC or eventually seek a banking licence amid regulatory trade-offs and growth opportunities.",
            "pubDate": "2025-12-19T13:46:47.772270"
        },
        {
            "title": "Buy defence shipbuilders Mazagon Dock, GRSE, Cochin Shipyard for up to 45% upside. Prabhudas explains why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-defence-shipbuilders-mazagon-dock-grse-cochin-shipyard-for-up-to-45-upside-prabhudas-explains-why/slideshow/126078297.cms",
            "description": "India’s defence shipbuilding sector is at the cusp of a multi-decade transformation, evolving from a fragmented, policy-driven space into a strategic manufacturing and defence pillar, Prabhudas Lilladher said in a note. Against this backdrop, the brokerage has picked Mazagon Dock Shipbuilders, Cochin Shipyard and Garden Reach Shipbuilders (GRSE) as stocks to buy, seeing up to 45% upside, even as the trio has corrected nearly 28% over the past six months. Here’s why.",
            "pubDate": "2025-12-19T13:46:47.772440"
        },
        {
            "title": "Infosys ADR trading halted on NYSE after 40% surge: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-adr-trading-halted-on-nyse-after-40-surge-report/articleshow/126080146.cms",
            "description": "The New York Stock Exchange (NYSE) has stopped halted the trading of Infosys' American Depository Receipts (ADRs) after it surged 40% to $26.62 on Friday, according to a CNBC-TV18 report.",
            "pubDate": "2025-12-19T15:48:07.925321"
        },
        {
            "title": "Avadhut Sathe, academy get temporary SAT relief to start operations, access funds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/avadhut-sathe-academy-get-temporary-sat-relief-to-start-operations-access-funds/articleshow/126080076.cms",
            "description": "The Securities Appellate Tribunal granted interim relief to Avadhut Sathe Training Academy, allowing operations to continue and permitting limited fund access, while staying Sebi’s ex-parte order until the next hearing in January 2026.",
            "pubDate": "2025-12-19T15:48:07.925450"
        },
        {
            "title": "US Fed's John Williams says there is no urgent need to cut rates again",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-feds-john-williams-says-there-is-no-urgent-need-to-cut-rates-again/articleshow/126079838.cms",
            "description": "Federal Reserve President John Williams told CNBC on Friday he does ⁠not see an imminent need to follow last week's interest rate cut with another reduction in borrowing costs, adding that new inflation data is being buffeted by distortions.",
            "pubDate": "2025-12-19T15:48:07.925651"
        },
        {
            "title": "Nike's China conundrum deepens as turnaround stagnates, shares slump 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nikes-china-conundrum-deepens-as-turnaround-stagnates-shares-slump-13/articleshow/126079767.cms",
            "description": "Nike is running out of time to prove its China playbook works as its sixth straight quarterly decline in sales in the country underscores how a market once seen as a growth engine has become the biggest pressure point for the U.S. sportswear giant.",
            "pubDate": "2025-12-19T15:48:07.925760"
        },
        {
            "title": "US stocks climb as markets hope for 'Santa Claus rally'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-on-rebound-in-tech-stocks/articleshow/126079512.cms",
            "description": "Wall ‍Street's ​main indexes ⁠opened higher on Friday, as technology stocks ‌extended ‌their rebound from ‌an early-week selloff, while Nike tumbled after weak China sales ​weighed ​on its quarterly ‌results.",
            "pubDate": "2025-12-19T15:48:07.925865"
        }
    ]
}