{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-20T05:32:45.576656",
    "items": [
        {
            "title": "Q1 results this week: Infosys, Bajaj Finance, Nestle, Eternal, Paytm, Kotak Mahindra Bank among 95 companies to announce earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q1-results-this-week-infosys-bajaj-finance-nestle-eternal-paytm-kotak-mahindra-bank-among-95-companies-to-announce-earnings/articleshow/122793687.cms",
            "description": "India Inc's Q1 FY26 earnings season intensifies, with 95 companies set to report results this week. Key players on the radar include Infosys, Zomato, UltraTech Cement, Paytm, Bajaj twins, Nestle India, and Kotak Mahindra Bank. The action kicks off July 21 with firms like CRISIL, Havells, and UltraTech. Market sentiment may hinge on these earnings.",
            "pubDate": "2025-07-20T05:32:43.485766"
        },
        {
            "title": "Market Trading Guide: Bajaj Finance, SAIL among 8 key stocks to buy on Monday. Up to 13% upside potential seen in near term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-bajaj-finance-sail-among-8-key-stocks-to-buy-on-monday-up-to-13-upside-potential-seen-in-near-term/slideshow/122793653.cms",
            "description": "India’s headline indices ended in the red on Friday recording their second successive fall amid selling pressure in the banks, auto and pharma stocks. Nifty remained under selling pressure, falling towards 24,900 where it found initial support.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said that the index stayed above the 50-day moving average (50 DMA) and appeared poised for a short-term pullback after a sharp correction. “However, it remains a ‘sell on rise’ as long as it trades below 25,260. On the downside, selling may intensify if it breaks below 24,900,” he said.Here are 8 stock recommendations for Monday:",
            "pubDate": "2025-07-20T05:32:43.485893"
        },
        {
            "title": "Q1 earnings, FII action among 8 factors that’ll steer D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q1-earnings-fii-action-among-8-factors-thatll-steer-d-street-this-week/articleshow/122793340.cms",
            "description": "Indian equities ended the week lower, with the Nifty slipping 0.7%. On Friday, it declined 143 points to close at 24,968. Despite holding above its 50-EMA, the index remained under pressure. Analysts flagged 24,900 as a key support; a breach could trigger further downside. Market direction this week hinges on crucial domestic and global cues.",
            "pubDate": "2025-07-20T05:32:43.486000"
        }
    ]
}