{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-17T06:57:51.153417",
    "items": [
        {
            "title": "Godrej Properties acquires 50 acres of land in Raipur; to sell housing plots",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-properties-acquires-50-acres-of-land-in-raipur-to-sell-housing-plots/articleshow/122619770.cms",
            "description": "Godrej Properties Ltd. has expanded its footprint into Raipur with the acquisition of 50 acres of land. The company plans to develop premium plotted residential units on the acquired land, projecting a saleable area of approximately 9.5 lakh square feet. This acquisition signifies Godrej Properties' strategic move to strengthen its presence in emerging real estate markets across India.",
            "pubDate": "2025-07-17T06:57:32.405928"
        },
        {
            "title": "Salman Khan sells 1,318 sq ft flat in Mumbai for Rs 5.35 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/salman-khan-sells-1318-sq-ft-flat-in-mumbai-for-rs-5-35-cr/articleshow/122619621.cms",
            "description": "Bollywood superstar Salman Khan has recently sold his 1,318 square feet apartment in Bandra (West), Mumbai, for a substantial Rs 5.35 crore. According to real estate consultant Square Yards, the transaction, registered this month, involves an apartment located in Shiv Asthan Heights.",
            "pubDate": "2025-07-17T06:57:32.406101"
        },
        {
            "title": "Stocks to Buy | Sector Spotlight: Capital goods, real estate, and EMS in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-sector-spotlight-capital-goods-real-estate-and-ems-in-focus/slideshow/122617249.cms",
            "description": "Sanjay H Parekh in an interview to ET Now said that overall market valuations are currently fair but not cheap. The pace at which markets have moved suggests a need for caution. He expects both time and price corrections ahead. While Q4 earnings were weak, Q1 is likely to remain soft, and even Q2 may not bring a clear recovery. He emphasises that earnings momentum might only pick up meaningfully from Q3 onwards.",
            "pubDate": "2025-07-17T06:57:32.406220"
        },
        {
            "title": "Mahindra Logistics shares jump 5% after board approves Rs 750 crore rights issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahindra-logistics-shares-jump-5-after-board-approves-rs-750-crore-rights-issue/articleshow/122618559.cms",
            "description": "Mahindra Logistics shares: The board has approved the issuance of 2.7 crore fully paid-up equity shares at ₹277 each, which includes a premium of ₹267 per share. The full amount is payable upon application.",
            "pubDate": "2025-07-17T06:57:32.406341"
        },
        {
            "title": "Nifty Private Bank Index Fund: Growth backed by interesting return profile",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-private-bank-index-fund-growth-backed-by-interesting-return-profile/articleshow/122618322.cms",
            "description": "India's private banks are driving economic growth, outperforming the broader market with superior efficiency and strong balance sheets. The Nifty Private Bank Index, comprising ten leading private banks, has delivered impressive returns, boasting a 20-year CAGR of over 18.6%.",
            "pubDate": "2025-07-17T06:57:32.406439"
        },
        {
            "title": "Mukul Agrawal picks 1.14% stake in smallcap stock in Q1FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-picks-1-14-stake-in-smallcap-stock-in-q1fy26/articleshow/122617931.cms",
            "description": "Ace investor Mukul Mahavir Agrawal acquired a 1.14% stake in Yatharth Hospital & Trauma Care Services in the June 2025 quarter, purchasing 11 lakh shares worth around Rs 68.1 crore. Following the update, the stock rose 3% in Thursday’s trade on the BSE and has rallied 40% over the last six months.",
            "pubDate": "2025-07-17T06:57:32.406541"
        },
        {
            "title": "India slips to 4th spot among favourite Asian stock market, shows BofA survey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-slips-to-4th-spot-among-favourite-asian-stock-market-shows-bofa-survey/articleshow/122617575.cms",
            "description": "India’s slide in regional market preference comes amid a shift in foreign fund flows toward semiconductor-led rallies in Japan, Taiwan, and South Korea. Indian equities continue to grapple with persistent IT sector weakness and a dearth of fresh catalysts.",
            "pubDate": "2025-07-17T06:57:32.406638"
        },
        {
            "title": "Trump: India trade deal 'very close', EU could follow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-india-trade-deal-very-close-eu-could-follow/slideshow/122617042.cms",
            "description": "President Donald Trump stated that the United States is very close to finalising a trade agreement with India. A high-level Indian trade delegation arrived in Washington earlier this week to continue discussions. The Trump administration is pushing to close multiple deals before the August 1 deadline, when tariffs on most U.S. imports are set to rise again. (Source: Reuters)",
            "pubDate": "2025-07-17T06:57:32.406732"
        },
        {
            "title": "Waaree Renewable shares rally 30% in 3 days ahead of Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-shares-rally-30-in-3-days-ahead-of-q1-results/articleshow/122616122.cms",
            "description": "Waaree Renewable's share price has rallied nearly 30% in three days ahead of its Q1FY26 results, surging past Rs 1,200 for the first time in months. The surge is supported by improving sentiment in the renewable energy sector ahead of the company's Q1 earnings.",
            "pubDate": "2025-07-17T06:57:32.406830"
        },
        {
            "title": "Dollar’s slide set to boost U.S. multinationals' earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dollars-slide-set-to-boost-u-s-multinationals-earnings/slideshow/122616030.cms",
            "description": "Recent months have seen the U.S. Dollar Index fall nearly 10%—with half that drop occurring since early April. This sharp decline is expected to benefit American multinational companies, which previously suffered from a strong dollar that reduced the value of foreign revenues. (Source: Reuters)",
            "pubDate": "2025-07-17T06:57:32.406924"
        },
        {
            "title": "AWL Agri Business shares surge over 6% on record Q1 revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/awl-agri-business-shares-surge-over-6-on-record-q1-revenue/articleshow/122615647.cms",
            "description": "AWL Agri Business reported its highest-ever Q1 revenue at Rs 17,059 crore, driven by strong edible oil performance. Despite a 24% YoY profit decline, robust top-line growth and retail expansion boosted investor sentiment in Thursday’s trade.",
            "pubDate": "2025-07-17T06:57:32.407018"
        },
        {
            "title": "Ixigo shares jumps 14%, hits 52-week high after strong Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ixigo-shares-jumps-12-hits-52-week-high-after-strong-q1-results/articleshow/122615567.cms",
            "description": "Ixigo Share Price: Ixigo's shares soared after reporting strong Q1FY26 results, with revenue up 73% YoY to Rs 314.5 crore and net profit increasing 27% YoY to Rs 19 crore. Growth was fueled by significant increases in flight, bus, and train GTV. The company is focusing on AI-driven efficiencies and customer-centric approaches, leading to record revenue and profits across key verticals.",
            "pubDate": "2025-07-17T06:57:32.407111"
        },
        {
            "title": "PNC Infratech shares rise 5% after emerging as lowest Bidder for NHPC solar power project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnc-infratech-shares-rise-5-after-emerging-as-lowest-bidder-for-nhpc-solar-power-project/articleshow/122615439.cms",
            "description": "PNC Infratech shares: PNC Infratech has secured a 300 MW solar project and a 150 MW / 600 MWh energy storage system under ISTS norms, as part of a recent tender. The contract was awarded through an online reverse auction conducted on July 15, 2025.",
            "pubDate": "2025-07-17T06:57:32.407202"
        },
        {
            "title": "ITC Hotels shares hit record high, rise over 3% after Q1 profit jumps 54% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-shares-hit-record-high-rise-over-3-after-q1-profit-jumps-54-yoy/articleshow/122614763.cms",
            "description": "ITC Hotels shares: The company reported a 54% YoY increase in net profit for Q1FY26, reaching ₹133 crore, up from ₹87 crore a year ago. Revenue from operations rose 15.5% to ₹816 crore, compared to ₹706 crore in the same quarter last year.",
            "pubDate": "2025-07-17T06:57:32.407344"
        },
        {
            "title": "How to trade Eternal shares after a 34% rally? Check key levels & strategies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-trade-eternal-shares-after-a-34-rally-check-key-levels-strategies/articleshow/122613700.cms",
            "description": "Eternal shares have surged 34% since April, fueled by investor optimism, but analysts suggest caution. Profit booking is advised near Rs 260 due to potential momentum loss, while others see buying opportunities above Rs 278 or near the Rs 240-Rs 235 support zone. Long-term investors should hold, adding on dips above Rs 245.",
            "pubDate": "2025-07-17T06:57:32.407441"
        },
        {
            "title": "$26 billion worth of shares to hit the market as lock-ins end for 60 firms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/26-billion-worth-of-shares-to-hit-the-market-as-lock-ins-end-for-60-firms/articleshow/122612781.cms",
            "description": "Over $26 billion worth of shares across 60 companies are set to become tradable over the next four months as pre-listing lock-ins expire, according to Nuvama. Key expiries include Hexaware, Ather Energy, and HDB Financial. While some unlocks may pressure liquidity, many shares remain with promoters, limiting immediate offloading and offering selective cues for investors to track.",
            "pubDate": "2025-07-17T06:57:32.407533"
        }
    ]
}