{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-09T07:29:54.123891",
    "items": [
        {
            "title": "Bajaj Finserv completes acquisition of Allianz stake in insurance JVs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-completes-acquisition-of-allianz-stake-in-insurance-jvs/articleshow/126425104.cms",
            "description": "Bajaj Finserv and its promoter group have acquired a combined 97% stake in Bajaj Allianz General Insurance and Bajaj Allianz Life Insurance from Allianz SE, concluding a 20-year partnership.  The transactions, finalized through share purchase agreements, significantly increased Bajaj Finserv's direct holdings to 75.01% in both entities.",
            "pubDate": "2026-01-09T00:46:37.071409"
        },
        {
            "title": "FPI Registration: Sebi allows digital signatures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpi-registration-sebi-allows-digital-signatures/articleshow/126425067.cms",
            "description": "The Securities and Exchange Board of India (Sebi) has simplified the foreign portfolio investor (FPI) registration process by introducing digital signatures. This new functionality, integrated into the common application form (CAF) portal, allows applicants to apply for DSC directly while submitting their registration, creating a unified and streamlined onboarding experience.",
            "pubDate": "2026-01-09T00:46:37.071537"
        },
        {
            "title": "Electronics stocks need a spark of profit for D-St vibe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/electronics-stocks-need-a-spark-of-profit-for-d-st-vibe/articleshow/126425019.cms",
            "description": "JP Morgan anticipates 2026 will be a crucial year for India's electronics manufacturing services (EMS) sector, with stocks facing a significant test after underperforming in 2025. A sustained recovery for these shares will depend on companies demonstrating improved profitability, with key triggers including the extension of the mobile PLI scheme and the rollout of ISM 2.0.",
            "pubDate": "2026-01-09T00:46:37.071639"
        },
        {
            "title": "Exporters shares slump on US warning of higher tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/exporters-shares-slump-on-us-warning-of-higher-tariffs/articleshow/126424941.cms",
            "description": "Indian exporter shares fell sharply. Donald Trump's support for a bill proposing 500% tariffs on Indian imports caused panic. This could significantly increase existing tariffs. Textile, apparel, seafood, and drug makers saw their shares drop. Experts advise caution and focusing on domestic companies. Clarity on the tariffs is awaited.",
            "pubDate": "2026-01-09T00:46:37.071738"
        },
        {
            "title": "Credit costs rise for Shapoorji Pallonji Group firm as refinancing timeline slips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-costs-rise-for-shapoorji-pallonji-group-firm-as-refinancing-timeline-slips/articleshow/126425083.cms",
            "description": "The step-up was triggered after Goswami Infratech, a borrower linked to the structure, did not complete a refinancing by December end, said the people cited above. Although not a covenant breach, the delay requires existing borrowings to be repriced if fresh debt was raised at a higher cost.",
            "pubDate": "2026-01-09T00:46:37.071953"
        },
        {
            "title": "Premium gain, margin strain likely for insurers in December quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premium-gain-margin-strain-likely-for-insurers-in-december-quarter/articleshow/126425080.cms",
            "description": "Most large life insurers, including LIC, HDFC Life, Axis Max and SBI Life, are set to post double-digit APE growth in Oct–Dec 2025, aided by GST tailwinds and a favourable base after new surrender value norms.",
            "pubDate": "2026-01-09T00:46:37.072054"
        },
        {
            "title": "IndusInd Bank plans bigger board for better governance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-plans-bigger-board-for-better-governance/articleshow/126425087.cms",
            "description": "The bank is considering increasing its board strength to around a dozen members from the current nine with the aim of strengthening oversight and aligning with evolving regulatory expectations. Currently, managing director and CEO Rajiv Anand is the only executive on the board. Others are non-executive and independent directors.",
            "pubDate": "2026-01-09T00:46:37.072148"
        },
        {
            "title": "Banks narrow NBFCs’ lead as India’s gold loan market turns nearly 50-50",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-narrow-nbfcs-lead-as-indias-gold-loan-market-turns-nearly-50-50/articleshow/126425072.cms",
            "description": "NBFCs' share of aggregate gold loans fell by nearly 20 percentage points over the past five years to 50.3% as of March 2025, from 69.4% in 2020. In the same period, banks increased their share to 49.7% from 30.6%, data showed.",
            "pubDate": "2026-01-09T00:46:37.072248"
        },
        {
            "title": "Stocks to buy in 2026: Titan, Waaree Energies among 5 stocks that could give double digit returns in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-titan-waaree-energies-among-5-stocks-that-could-give-double-digit-returns-in-long-term/slideshow/126425683.cms",
            "description": "Brokerage houses continue to stay bullish on select stocks across consumption, renewable energy, and financial services, highlighting strong growth visibility and attractive upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-09T02:49:20.439551"
        },
        {
            "title": "Negative Breakout: These 11 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-11-stocks-cross-below-their-200-dmas/slideshow/126425646.cms",
            "description": "In the Nifty200 pack, the closing prices of 16 stocks fell below their 200-day moving averages on January 8, according to StockEdge.com's technical scan data. Of these, we highlighted 11 stocks that slipped more than 2.5%. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2026-01-09T02:49:20.439674"
        },
        {
            "title": "GIFT Nifty up 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126425267.cms",
            "description": "Indian stock markets saw a sharp decline on Thursday. The Nifty dropped significantly as investors worried about potential US tariffs. Foreign institutional investors continued to sell shares. Global markets also showed weakness. Analysts expect the market to remain under pressure in the near term. The India VIX, a measure of market fear, surged. The rupee weakened against the US dollar.",
            "pubDate": "2026-01-09T02:49:20.439779"
        },
        {
            "title": "Stocks in news: RIL, BHEL, NTPC, Bharat Forge, Ashok Leyland",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-bhel-ntpc-bharat-forge-ashok-leyland/articleshow/126425250.cms",
            "description": "Markets closed lower on Thursday due to weak global cues, with the Nifty breaching a key support level. Several companies are in focus today: Bharat Forge partnered with Agile Robots for AI automation, BHEL secured a coal gasification order, RIL may consider buying Venezuelan oil, NTPC plans nuclear power projects, and Ashok Leyland inaugurates its new EV plant.",
            "pubDate": "2026-01-09T02:49:20.439879"
        },
        {
            "title": "Asian stocks edge up before US jobs data, tariff ruling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-up-before-us-jobs-data-tariff-ruling/articleshow/126425212.cms",
            "description": "Asian equities saw a modest rise after a two-day decline, as investors awaited US payrolls data and a potential Supreme Court ruling on President Trump's tariffs.  Money has shifted from tech giants to smaller companies, with the Russell 2000 outperforming the Nasdaq 100.  US jobs data will offer clues on the Federal Reserve's interest rate path.",
            "pubDate": "2026-01-09T02:49:20.439983"
        },
        {
            "title": "Will proposed US tariffs trigger further Indian market decline? Experts weigh in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-proposed-us-tariffs-trigger-further-indian-market-decline-experts-weigh-in/articleshow/126425157.cms",
            "description": "Indian stock markets experienced a significant drop on Thursday, with major indices falling around 1 percent. This decline, the steepest since August, was triggered by news of proposed steep tariffs on Russian oil imports. Investors are now closely watching the US Supreme Court's decision on the legality of these tariffs.",
            "pubDate": "2026-01-09T02:49:20.440082"
        },
        {
            "title": "RBI plans cooling-off for UCB directors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-plans-cooling-off-for-ucb-directors/articleshow/126425124.cms",
            "description": "The Reserve Bank of India is proposing new guidelines for co-operative banking, mandating a three-year cooling-off period for urban co-operative bank directors after a decade of continuous service. During this time, directors can only be members or customers, though they may serve on other bank boards.",
            "pubDate": "2026-01-09T02:49:20.440178"
        },
        {
            "title": "CVC Capital Partners leads race to buy ValueLabs at $1–1.2 billion valuation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cvc-capital-partners-leads-race-to-buy-valuelabs-at-11-2-billion-valuation/articleshow/126425342.cms",
            "description": "CVC has an exclusivity agreement with ValueLabs, founded in 1997 by Arjun Rao Donakanti (87% owner). Promoters may retain 15–20% and management will continue running the firm.",
            "pubDate": "2026-01-09T02:49:20.440386"
        },
        {
            "title": "Bajaj Holdings, Swiggy among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-holdings-swiggy-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126426621.cms",
            "description": "On January 8, futures open interest rose sharply across five F&O stocks, contributing to an overall increase of more than 10% compared with the previous session. A rise in open interest indicates an expansion in active futures contracts, pointing to fresh positioning or scaling up of existing positions by traders.",
            "pubDate": "2026-01-09T03:54:53.216097"
        },
        {
            "title": "Transformers & Rectifiers among 4 stocks that closed crossing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/transformers-rectifiers-among-4-stocks-that-closed-crossing-below-vwap/slideshow/126426574.cms",
            "description": "On January 8, the closing prices of four stocks from the Nifty500 fell more than 2.5% below their respective VWAPs (Volume Weighted Average Price), indicating potential bearish momentum, according to StockEdge’s technical scan data.When a stock closes below its VWAP, it means the closing price is lower than the average price at which the stock traded during the session, with the average weighted by trading volume. This is often interpreted as a sign of increased selling pressure.",
            "pubDate": "2026-01-09T03:54:53.216234"
        },
        {
            "title": "Thangamayil Jewellery among 5 stocks witnessing 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thangamayil-jewellery-among-5-stocks-witnessing-5-year-swing-high-breakouts/slideshow/126426537.cms",
            "description": "In the NSE list of stocks with a market capitalisation of over Rs 1,000 crore, five stocks recorded a 5-year swing high at the close on January 8, indicating bullish momentum in these counters, according to StockEdge’s technical scan data.A 5-year swing high refers to the highest price a stock has achieved over the past five years. This level typically acts as a significant resistance zone where prices have historically struggled to move higher. Hitting this level may be viewed as a bullish signal, suggesting the potential for further upside. However, this is distinct from a 5-year breakout, which occurs when a stock decisively surpasses a resistance level that has remained intact for five years or more.",
            "pubDate": "2026-01-09T03:54:53.216344"
        },
        {
            "title": "RVNL shares in focus after Rs 201 crore East Coast Railway order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-after-rs-201-crore-east-coast-railway-order/articleshow/126426495.cms",
            "description": "Rail Vikas Nigam shares are in focus after the company secured a Rs 201.23 crore order from East Coast Railway to set up a wagon Periodical Overhauling workshop in Odisha. The 18-month domestic project is expected to bolster RVNL’s order book even as the stock ended lower in the previous session.",
            "pubDate": "2026-01-09T03:54:53.216447"
        },
        {
            "title": "BEL shares in focus after securing Rs 569 crore worth of defence orders since last disclosure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-after-securing-rs-569-crore-worth-of-defence-orders-since-last-disclosure/articleshow/126426369.cms",
            "description": "Defence major Bharat Electronics announced securing additional orders worth Rs 569 crore, including drone detection and jamming systems, bolstering its order book. This follows a similar order win on January 1, reaffirming BEL's crucial role in India's defence manufacturing. The company also reported an 18% year-on-year rise in standalone profit after tax for the July-September quarter of FY26.",
            "pubDate": "2026-01-09T03:54:53.216550"
        },
        {
            "title": "Bansal Wire shares in focus as 20% equity becomes eligible for trading after lock-in expiry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bansal-wire-shares-in-focus-as-20-equity-becomes-eligible-for-trading-after-lock-in-expiry/articleshow/126426113.cms",
            "description": "Bansal Wire Industries shares are poised for attention as a significant lock-in period expires on January 9, freeing up nearly 20% of its outstanding equity for trading. This development follows the company's recent announcement of record sales volumes for the December quarter, indicating strong operational performance. Market participants will be closely monitoring any potential trading activity.",
            "pubDate": "2026-01-09T03:54:53.216653"
        },
        {
            "title": "BHEL shares in focus after Rs 5,400 crore order win from JV firm with CIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-shares-in-focus-after-rs-5400-crore-order-win-from-jv-firm-with-cil/articleshow/126426080.cms",
            "description": "Bharat Heavy Electricals Limited is set for a busy Friday. The company secured a major Rs 5,400 crore order for a coal gasification project in Odisha.  Additionally, BHEL has begun supplying traction converters for the new Vande Bharat Sleeper trains. This marks BHEL's entry into the semi-high-speed propulsion market.  Other train components are also in production.",
            "pubDate": "2026-01-09T03:54:53.216752"
        },
        {
            "title": "IEX shares in focus ahead of APTEL hearing on market coupling case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-in-focus-ahead-of-aptel-hearing-on-market-coupling-case/articleshow/126426054.cms",
            "description": "Indian Energy Exchange shares are under scrutiny today. The Electricity Appellate Tribunal hears arguments in the market coupling case. This case could change how electricity prices are discovered. The Central Electricity Regulatory Commission is willing to take directions from the tribunal. Investor sentiment has improved following recent developments. The outcome will shape the future of power exchanges.",
            "pubDate": "2026-01-09T03:54:53.216853"
        },
        {
            "title": "China factor explained: Jefferies and JM Financial analysts decode the upside and risks for BHEL shares after 10% crash",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-factor-explained-analysts-decode-the-upside-and-risks-for-bhel-shares/articleshow/126427297.cms",
            "description": "Brokerages are divided on how a potential easing of India’s restrictions on Chinese firms bidding for government contracts could affect Bharat Heavy Electricals Ltd. While Jefferies flags competitive risks if curbs are lifted, JM Financial argues that any relaxation, especially at the component level, would lower costs, improve execution and leave BHEL’s market position largely intact, underpinning its positive long-term outlook on the stock.",
            "pubDate": "2026-01-09T04:59:51.766465"
        },
        {
            "title": "Export-heavy stocks slide up to 11% as Trump threatens 500% tariff; Avanti Feeds, Kitex Garments lead losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/export-heavy-stocks-slide-up-to-11-as-trump-threatens-500-tariff-avanti-feeds-kitex-garments-lead-losses/articleshow/126427354.cms",
            "description": "Export-oriented stocks, including Kitex Garments and Avanti Feeds, declined for a second day as US political signals raised fears of higher trade barriers. A bipartisan Russia sanctions bill, potentially impacting India's trade with Russia, intensified selling pressure. Seafood and textile exporters faced significant drops amid concerns of disrupted shipments and weaker US demand.",
            "pubDate": "2026-01-09T04:59:51.766573"
        },
        {
            "title": "ITC, Eternal among 15 stocks in CLSA’s 2026 focus portfolio. Check full list & targets here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-eternal-among-15-stocks-in-clsas-2026-focus-portfolio-check-full-list-targets-here/slideshow/126426910.cms",
            "description": "Indian equities head into 2026 with a challenging but more balanced setup after the Nifty’s record underperformance in 2025 narrowed India’s valuation premium versus peers, according to CLSA. While absolute index upside may be capped given elevated valuations, CLSA expects improving earnings visibility and compressed stock-level valuations to create bottom-up opportunities. The brokerage prefers large caps with a tilt toward consumption, rate-sensitives, IT and select value plays in 2026, it said. Here are the 15 stocks in the brokerage's 2026 focus portfolio:",
            "pubDate": "2026-01-09T04:59:51.766687"
        },
        {
            "title": "Eternal shares jump 3% after Goldman dismisses bear theories",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-dismisses-bear-concerns-on-eternal-says-stock-can-rally-33/articleshow/126427094.cms",
            "description": "After a 17% correction in Eternal shares, Goldman Sachs said it disagrees with the level of bearishness priced into the stock and sees potential upside of 33% to Rs 390. The recent decline has been driven by concerns over a near-term slowdown in quick-commerce growth, rising competition, and the possible impact on Blinkit’s margins.",
            "pubDate": "2026-01-09T04:59:51.766786"
        },
        {
            "title": "Midcap multibagger stock tumbles 13% as Q3 net profit drops 33% to Rs 72 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcap-multibagger-stock-tumbles-13-as-q3-net-profit-drops-33-to-rs-72-crore/articleshow/126426894.cms",
            "description": "Elecon Engineering Company's shares plunged 13.2% after reporting a 33% drop in Q3 FY26 net profit to Rs 72 crore, despite a marginal 4.3% revenue increase. The company cited order inflow delays and increased employee costs impacting EBITDA margins. However, management expressed confidence in future recovery due to healthy open orders and steady demand from key domestic and overseas industries.",
            "pubDate": "2026-01-09T04:59:51.766886"
        },
        {
            "title": "Sensex, Nifty turn red after early gains as US tariffs keep investors on toes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-turn-red-after-early-gains-as-us-tariffs-keep-investors-on-toes/articleshow/126426859.cms",
            "description": "Indian equities opened higher on Friday but quickly turned lower as investors adopted a cautious stance. The Sensex and Nifty experienced marginal declines within minutes of trading. This cautious sentiment stems from anticipation of a U.S. Supreme Court ruling on the legality of U.S. tariffs, which have recently impacted market performance.",
            "pubDate": "2026-01-09T04:59:51.766981"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs maintain buy on PTC Industries & Eternal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-maintain-buy-on-ptc-industries-eternal/articleshow/126426760.cms",
            "description": "Brokerage firms remain bullish on Navin Fluorine, PTC Industries, and Eternal, citing strong execution, capacity expansion, and long-term growth visibility. Goldman Sachs and HDFC Securities see meaningful upside potential despite near-term volatility across chemicals, aerospace manufacturing, and quick commerce segments.",
            "pubDate": "2026-01-09T04:59:51.767074"
        },
        {
            "title": "Vodafone Idea shares zoom 8% after telco confirms AGR relief, unveils repayment plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-zoom-8-after-relief-granted-in-agr-dues-repayment-case/articleshow/126426714.cms",
            "description": "Vodafone Idea share price: Vodafone Idea shares saw a significant jump on Friday. The company announced a repayment plan for its telecom dues to the Department of Telecommunications. This includes adjusted gross revenue liabilities. The dues will be frozen as of December 2025 and repaid over 15 years. This offers crucial cash flow relief to the company.",
            "pubDate": "2026-01-09T04:59:51.767167"
        },
        {
            "title": "RIL shares in spotlight as firm evaluates Venezuelan crude purchases",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-spotlight-as-firm-evaluates-venezuelan-crude-purchases/articleshow/126426660.cms",
            "description": "Reliance Industries shares are expected to gain attention. The company may buy Venezuelan crude oil. This depends on US regulations. India's refiners could import Venezuelan oil again. This oil might be cheaper. It could also be a safer alternative to Russian oil. Reliance has paused Russian oil deliveries.",
            "pubDate": "2026-01-09T04:59:51.767260"
        },
        {
            "title": "BHEL shares rally 5% after hitting lower circuit on China concerns. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-shares-rally-5-after-hitting-lower-circuit-on-china-concerns-should-you-buy-sell-or-hold/articleshow/126427695.cms",
            "description": "BHEL shares rebounded after a sharp selloff triggered by concerns that India may ease restrictions on Chinese firms bidding for government contracts. Brokerages remain divided, with JM Financial seeing limited long-term impact and Jefferies flagging potential risks pending policy clarity.",
            "pubDate": "2026-01-09T05:30:29.712874"
        },
        {
            "title": "JM Financial initiates Meesho coverage with ‘reduce’ rating, flags limited upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-initiates-meesho-coverage-with-reduce-rating-flags-limited-upside/articleshow/126428005.cms",
            "description": "JM Financial has started coverage on Meesho with a ‘Reduce’ rating and a Rs 170 target for March 2027, citing limited upside after the stock’s sharp post-listing rally. Meesho, which debuted at Rs 161.20 in December, surged 58% to Rs 254.65 but has since corrected nearly 36% and is now trading at Rs 164.",
            "pubDate": "2026-01-09T05:50:08.784385"
        },
        {
            "title": "US Supreme Court verdict on Trump tariff tonight: How Sensex, Nifty may get impacted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-supreme-court-verdict-on-trump-tariff-tonight-how-sensex-nifty-may-get-impacted/articleshow/126429337.cms",
            "description": "The US Supreme Court ruling on Trump-era tariffs could spark sharp gains or deepen volatility in Sensex and Nifty. India faces double exposure with 50% tariffs and a potential 500% levy on Russian oil imports, affecting trade and corporate profits.",
            "pubDate": "2026-01-09T06:59:53.396276"
        },
        {
            "title": "HDFC Bank shares tank 6% in 5 straight sessions. Should investors buy this dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-tank-6-in-5-straight-sessions-should-investors-buy-this-dip/articleshow/126429277.cms",
            "description": "HDFC Bank shares have fallen for five consecutive sessions, dropping 6% ahead of its Q3 earnings announcement. Technical indicators suggest a bearish structure, with prices below key EMAs. Analysts anticipate a mixed near-term outlook on margins despite steady balance-sheet expansion and supportive asset quality.",
            "pubDate": "2026-01-09T06:59:53.396420"
        },
        {
            "title": "Ashish Kacholia-backed Indo SMC IPO to open on January 13. Check GMP, price band, other key details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-indo-smc-ipo-to-open-on-january-13-check-gmp-price-band-other-key-details/articleshow/126429145.cms",
            "description": "Indo SMC’s Rs 91.95 crore SME IPO, backed by Ashish Kacholia, opens January 13. The issue has a strong grey market premium and healthy order book, with proceeds aimed at plant expansion, working capital, and corporate purposes.",
            "pubDate": "2026-01-09T06:59:53.396653"
        },
        {
            "title": "F&O Radar | Deploy Bear Put Spread in Nifty to gain from bearish bias in index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bear-put-spread-in-nifty-to-gain-from-bearish-bias-in-index/articleshow/126428915.cms",
            "description": "Nifty breached key support levels near 25,980 and 25,878, signalling a shift from bullish to bearish sentiment. Traders are advised to use a Bear Put Spread strategy to capitalise on the downward bias, with resistance at 26,100–26,200 and support at 25,750–25,700.",
            "pubDate": "2026-01-09T06:59:53.396769"
        },
        {
            "title": "Bharat Forge stock in focus after signing MoU with Germany’s Agile Robots",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-forge-stock-in-focus-after-signing-mou-with-germanys-agile-robots/articleshow/126428486.cms",
            "description": "Bharat Forge has signed an agreement with Germany's Agile Robots. This collaboration will focus on AI-driven robotics and intelligent automation. The aim is to deploy advanced technologies in sectors like automotive and healthcare. The partnership will develop customized solutions for India and Southeast Asia. This move signals Bharat Forge's commitment to advanced manufacturing.",
            "pubDate": "2026-01-09T06:59:53.396882"
        },
        {
            "title": "Sensex sheds over 2,180 points in 5 days, Nifty down 2.5%. Here are the key factors rattling stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-today-sensex-sheds-over-2180-points-in-5-days-nifty-down-2-5-5-key-factors-behind-the-sharp-drop/articleshow/126430040.cms",
            "description": "Indian equities extended losses for a fifth straight session, as global trade tensions and uncertainty over U.S. tariffs kept investors cautious. Markets are focused on the U.S. Supreme Court verdict on Trump’s tariffs, which could have a major impact on India–U.S. trade relations and domestic market sentiment.",
            "pubDate": "2026-01-09T07:29:53.502257"
        }
    ]
}