{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-05T15:13:37.703956",
    "items": [
        {
            "title": "Bandhan Bank Q3 loans and advances surge 15% YoY, deposits up 20%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bandhan-bank-q3-loans-and-advances-surge-15-yoy-deposits-up-20/articleshow/116942481.cms",
            "description": "Bandhan Bank's total deposits grew 20.1% YoY to Rs 140,999 crore, but saw a slight QoQ decline of 1.1%. CASA deposits rose 5.5% YoY to Rs 44,735 crore but fell 5.4% QoQ. The CASA ratio is now 31.7%, down from 36.1% a year ago.",
            "pubDate": "2025-01-05T15:13:30.208279"
        },
        {
            "title": "Adani Wilmar Q3 Update: Revenue jumps 33% YoY aided by volume growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-wilmar-q3-update-revenue-jumps-33-yoy-aided-by-volume-growth/articleshow/116935382.cms",
            "description": "The edible oils segment of Adani Wilmar saw consumer downtrading, but the company retained its market share through a diverse brand portfolio across price points. In the foods category, key packaged products like wheat flour, rice, nuggets, pulses, poha, and sugar achieved strong double-digit growth, according to the update.",
            "pubDate": "2025-01-05T15:13:30.208424"
        },
        {
            "title": "Bajaj Finance Q3 update: New loans jump 22%YoY to 12.06 million, AUM surges 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finance-q3-update-new-loans-jump-22yoy-to-12-06-million-aum-surges-28/articleshow/116934474.cms",
            "description": "In Q3 FY25, Bajaj Finance’s AUM grew by Rs 24,100 crore, driven by strong demand across lending segments. New loans booked during the quarter hit a record 12.06 million, marking a 22% YoY increase from 9.86 million in the same period last year, showcasing robust growth momentum.",
            "pubDate": "2025-01-05T15:13:30.208537"
        },
        {
            "title": "Vedanta Q3 Update: Aluminium production jumps 3% YoY to 614 kt, Zinc India down 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-q3-update-aluminium-production-jumps-3-yoy-to-614kt-zinc-india-down-2/articleshow/116934208.cms",
            "description": "Vedanta posted a Rs 5,603 crore profit in Q2 FY24, rebounding from a Rs 915 crore loss last year, despite a 4% YoY decline in revenue to Rs 37,171 crore, reflecting improved operational performance and recovery.",
            "pubDate": "2025-01-05T15:13:30.208639"
        },
        {
            "title": "Bank of Baroda Q3 update: Global business jumps 12% YoY to Rs 25.64 lakh crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-baroda-q3-update-global-business-jumps-12-yoy-to-rs-25-64-lakh-crore/articleshow/116918478.cms",
            "description": "Bank of Baroda’s global advances grew 11.65% YoY to Rs 11.72 lakh crore in Q3FY25, up from Rs 10.49 lakh crore in Q3FY24. Meanwhile, global deposits rose 11.82% YoY to Rs 13.92 lakh crore, compared to Rs 12.45 lakh crore in the same quarter last year, showcasing consistent growth in the bank’s core metrics.",
            "pubDate": "2025-01-05T15:13:30.208741"
        },
        {
            "title": "IDFC First Bank Q3 Update: Lender reports 25% YoY growth in total business to Rs 4,58,213 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idfc-first-bank-q3-update-lender-reports-25-yoy-growth-in-total-business-to-rs-458213-crore/articleshow/116915098.cms",
            "description": "IDFC First Bank's CASA deposits rose 32.3% YoY to Rs 1,13,091 crore as of December 2024. The CASA ratio improved to 47.8% from 46.8% a year ago but was slightly lower than the 48.9% recorded in September 2024, reflecting consistent growth in its deposit base despite minor fluctuations.",
            "pubDate": "2025-01-05T15:13:30.208849"
        },
        {
            "title": "DMart Q3 Update: Standalone revenue jumps 17% to Rs 15,565 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dmart-q3-update-standalone-q3-revenue-jumps-17-to-rs-15565-crore/articleshow/116888309.cms",
            "description": "Avenue Supermarts, which operates retail chain DMart on Thursday reported a 17% year-on-year jump in its standalone revenue for the quarter ended December 31, 2024 at Rs 15,565.23 crore. The company had reported a topline of Rs 13,247.33 crore in the year ago period.",
            "pubDate": "2025-01-05T15:13:30.208954"
        }
    ]
}