{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-10T05:20:17.775940",
    "items": [
        {
            "title": "BOJ eyes interest rate hike as wage momentum strengthens",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-eyes-interest-rate-hike-as-wage-momentum-strengthens/slideshow/125215222.cms",
            "description": "Bank of Japan policymakers see a growing case to raise interest rates in the near term. Several members highlighted the need to ensure that companies’ wage-hike momentum continues, which is crucial for sustainable inflation. Out of 13 opinions from the nine-member board, eight suggested either raising rates soon or setting conditions for a near-term hike. (Source: Reuters)",
            "pubDate": "2025-11-10T05:19:58.521618"
        },
        {
            "title": "Japan unveils new stimulus package to boost growth and stability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-unveils-new-stimulus-package-to-boost-growth-and-stability/slideshow/125215134.cms",
            "description": "The Japanese government has revealed a draft outline of its upcoming economic stimulus package, aimed at promoting growth, ensuring price stability, and making strategic investments. The draft was seen by Reuters on Monday. (Source: Reuters)",
            "pubDate": "2025-11-10T05:19:58.521752"
        },
        {
            "title": "A victim of its own hype! 3 reasons why Lenskart’s supposed blockbuster IPO turned into a listing dud",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-victim-of-its-own-hype-3-reasons-why-lenskarts-supposed-blockbuster-ipo-turned-into-a-listing-dud/articleshow/125214634.cms",
            "description": "Lenskart's much-anticipated IPO saw shares list at a discount, a stark contrast to pre-listing hype. Lofty valuations, questionable profit figures boosted by one-time gains, and a cautious market sentiment contributed to the disappointing debut. Investors now await sustained profitability and global expansion to gauge the company's true potential.",
            "pubDate": "2025-11-10T05:19:58.521860"
        },
        {
            "title": "PhysicsWallah IPO opens tomorrow: GMP among 10 things to know before investing in this pureplay edtech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallah-ipo-opens-tomorrow-gmp-among-10-things-to-know-before-investing-in-this-pureplay-edtech/slideshow/125214845.cms",
            "description": "India’s homegrown edtech unicorn PhysicsWallah is set to open its Rs 3,480 crore IPO for subscription on November 11. The company, founded by YouTuber-turned-entrepreneur Alakh Pandey, will become the first major pureplay edtech firm to go public in India. Here are 10 key things investors should know before applying.",
            "pubDate": "2025-11-10T05:19:58.521959"
        },
        {
            "title": "Lenskart shares make muted D-St debut, list at 3% discount to IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-make-muted-d-st-debut-list-at-3-discount-below-ipo-price/articleshow/125214047.cms",
            "description": "Lenskart Solutions made a subdued market debut, listing at ₹390 on the BSE and ₹395 on the NSE — about 3% below its ₹402 issue price. The weak listing followed a sharp drop in its grey market premium from ₹108 to zero, reflecting caution despite strong investor demand. The ₹7,278 crore IPO was subscribed 28 times, led by QIBs at 45 times.",
            "pubDate": "2025-11-10T05:19:58.522058"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/125213714.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-11-10T05:19:58.522156"
        },
        {
            "title": "Top 10 high dividend-yield stocks in 2025, offering returns of up to 10%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-10-high-dividend-yield-stocks-in-2025-offering-returns-of-up-to-10-do-you-own-any/slideshow/125214331.cms",
            "description": "Domestic brokerage firm SBI Securities’ latest Dividend Yield Monitor highlights companies that have consistently rewarded shareholders with strong payouts over the past three years. A dividend yield is a financial ratio that shows how much a company pays out in dividends each year relative to its stock price. It is a key metric for investors, particularly those focused on income generation, as it indicates the return on investment from dividends alone.",
            "pubDate": "2025-11-10T05:19:58.522253"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama raises target price on Cummins India; recommends buy on Lupin post Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-raises-target-price-on-cummins-india-recommends-buy-on-lupin-post-q2-results/articleshow/125214071.cms",
            "description": "Brokerages maintained a bullish stance on Cummins India, Lupin, and Amara Raja Energy & Mobility, citing strong earnings, margin expansion, and growth visibility. Nuvama raised targets across all three stocks after Q2FY26 results, highlighting resilience in demand, product expansion, and operational efficiency despite near-term cost pressures and selective market moderation.",
            "pubDate": "2025-11-10T05:19:58.522365"
        },
        {
            "title": "4 IPOs opening for subscription on Tuesday & all GMPs hint at positive listing gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/4-ipos-opening-for-subscription-on-tuesday-all-gmps-hint-at-positive-listing-gains/slideshow/125214032.cms",
            "description": "The primary market is gearing up for a busy week, with four IPOs opening for subscription on November 11 (Tuesday). These include PhysicsWallah, Emmvee Photovoltaic Power, Workmates Core2Cloud, and Mahamaya Lifesciences. Early trends in the grey market suggest that all four could see a positive debut.",
            "pubDate": "2025-11-10T05:19:58.522460"
        },
        {
            "title": "Neuland Labs shares soar 10%, hit 52-week high after Q2 PAT spikes 201% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/neuland-labs-shares-soar-10-hit-52-week-high-after-q2-pat-spikes-201-yoy/articleshow/125213849.cms",
            "description": "Neuland Laboratories’ shares hit a 52-week high after the company posted stellar Q2FY26 results. PAT surged 201.6% YoY to ₹96.5 crore, revenue rose 63.7% to ₹516.1 crore, and EBITDA jumped 138.8% to ₹156.9 crore, with margins expanding 960 bps to 30.4%, driven by strong operational performance and profitability.",
            "pubDate": "2025-11-10T05:19:58.522560"
        },
        {
            "title": "Sensex rises over 250 pts, Nifty reclaims 25,550 as global mood lifts on U.S. reopening hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-160-pts-nifty-reclaims-25500-as-global-mood-lifts-on-u-s-reopening-hopes/articleshow/125213706.cms",
            "description": "Indian stocks opened higher on Monday, with the Sensex and Nifty tracking gains across Asian peers. Investors are anticipating a resolution to the U.S. government shutdown and a robust corporate earnings season. This rebound follows last week's losses amid global market volatility.",
            "pubDate": "2025-11-10T05:19:58.522651"
        },
        {
            "title": "Will a pullback in $25 trillion global AI trade help Sensex shed its worst-performing tag?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-a-pullback-in-25-trillion-global-ai-trade-help-sensex-shed-its-worst-performing-tag/articleshow/125213804.cms",
            "description": "Global AI stock fatigue may shift investor focus to India. As AI valuations are questioned, capital could flow into markets like India, which have been left out of the recent tech rally. This could help Indian equities shed their worst-performing tag. Strong domestic fundamentals and expected earnings growth offer a compelling alternative for investors seeking diversification and balanced growth.",
            "pubDate": "2025-11-10T05:19:58.522744"
        },
        {
            "title": "Shipping Corporation of India shares plunge 7% as Q2 net profit tumbles 39% to Rs 176 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shipping-corporation-shares-in-focus-as-q2-net-profit-tumbles-39-to-rs-176-crore/articleshow/125213734.cms",
            "description": "Shipping Corporation of India  share price: Shipping Corporation of  India reported a 39% year-on-year drop in Q2 net profit to Rs 176 crore, with revenue slipping 8% to Rs 1,339 crore. The PSU declared a Rs 3 per share interim dividend for FY26 and fixed November 19 as the record date.",
            "pubDate": "2025-11-10T05:19:58.522839"
        },
        {
            "title": "Ola Electric shares slide 3% even as company rebuts ‘misleading’ report on battery tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-as-company-rebuts-misleading-report-on-battery-tech/articleshow/125213704.cms",
            "description": "Ola Electric's stock took a hit on Monday amidst swirling rumors. The company swiftly dismissed a report from South Korean media alleging improper acquisition of foreign battery technology. Ola firmly stated it has no desire for obsolete technology and highlighted that its cutting-edge battery production is already underway, with recent certification attained for its battery packs.",
            "pubDate": "2025-11-10T05:19:58.522927"
        },
        {
            "title": "Anant Raj shares surge nearly 4% as Q2 PAT jumps 31% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anant-raj-shares-in-focus-as-q2-pat-jumps-31-yoy/articleshow/125213646.cms",
            "description": "Anant Raj shares: The company posted strong Q2FY26 results with PAT up 30.8% YoY to ₹138 crore and revenue rising 23% to ₹631 crore. Operating performance improved sharply, as EBITDA jumped 49.7% YoY to ₹168.4 crore.",
            "pubDate": "2025-11-10T05:19:58.523014"
        },
        {
            "title": "LIC ditches private banks, chooses SBI and Yes Bank. What’s driving this portfolio shift?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-ditches-private-banks-chooses-sbi-and-yes-bank-whats-driving-this-portfolio-shift/articleshow/125213623.cms",
            "description": "LIC significantly rebalanced its portfolio, divesting from major private banks like HDFC Bank and ICICI Bank to aggressively invest in State Bank of India and Yes Bank. This strategic shift highlights a growing confidence in the PSU banking sector's valuation and future prospects, even as foreign investors flock to private lenders.",
            "pubDate": "2025-11-10T05:19:58.523109"
        }
    ]
}