{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-22T15:59:46.531850",
    "items": [
        {
            "title": "Q3 results today: IndiGo, Adani Green among 57 companies to report earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-indigo-adani-green-among-57-companies-to-report-earnings-on-thursday/articleshow/127083634.cms",
            "description": "Many companies will announce their December quarter results today. IndiGo's earnings are expected to be mixed. Revenue is predicted to grow, but profits may fall. This is due to higher costs and lower ticket prices. Other key companies like Adani Green and DLF will also share their financial performance. Investors are watching these announcements closely for market direction.",
            "pubDate": "2026-01-22T02:07:47.631186"
        },
        {
            "title": "UTI AMC's Q3 PAT flat at Rs 138 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/uti-amcs-q3-pat-flat-at-rs-138-crore/articleshow/127074733.cms",
            "description": "UTI Asset Management reported a profit after tax of ₹138 crore for the December 2025 quarter. This figure remained largely stable compared to the previous year. Sequentially, profits saw a significant increase of 29%. Revenue from operations also grew by 24% to ₹517 crore. However, UTI AMC shares experienced a decline of 6.62%.",
            "pubDate": "2026-01-22T02:07:47.631297"
        },
        {
            "title": "FMCG firms seen posting mid-to-double digit Q3 growth as volumes recover",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/fmcg-firms-seen-posting-mid-to-double-digit-q3-growth-as-volumes-recover/articleshow/127073249.cms",
            "description": "FMCG companies anticipate mid-single to low-double-digit revenue growth in the December quarter, fueled by volume increases, easing GST disruptions, and stable pricing. Resilient rural demand and portfolio premiumization are key drivers, with ITC and HUL expected to show healthy improvements. Nestle India is poised for double-digit revenue growth as post-GST normalization continues.",
            "pubDate": "2026-01-22T02:07:47.631389"
        },
        {
            "title": "Adani Energy Solutions Q3 Results: Profit falls 2% YoY to Rs 552 crore, but revenue rises 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-energy-solutions-q3-results/articleshow/127139438.cms",
            "description": "Adani Energy Solutions Q3 Results: Adani Energy Solutions reported a slight dip in net profit but saw a 15% revenue jump, fueled by strong operational performance and higher capital expenditure. Record EBITDA was achieved, driven by transmission and smart metering growth. The company is expanding its transmission project pipeline and smart meter installations, anticipating robust future growth.",
            "pubDate": "2026-01-22T10:28:13.010617"
        },
        {
            "title": "Radico Khaitan Q3 Results: Profit surges 62% YoY on demand for premium liquor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/radico-khaitan-q3-results-profit-surges-62-yoy-on-demand-for-premium-liquor/articleshow/127135193.cms",
            "description": "India's Radico Khaitan reported a jump in quarterly ‍profit on Thursday, aided ​by sustained demand for its pricier liquor, ⁠sending its shares up 4%.",
            "pubDate": "2026-01-22T10:28:13.010735"
        },
        {
            "title": "Zee Ent Q3 Results: Cons profit falls 5% YoY to Rs 155 crore, revenue jumps 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zee-ent-q3-results-cons-profit-falls-5-yoy-to-rs-155-crore-revenue-jumps-15/articleshow/127126080.cms",
            "description": "Zee Entertainment Enterprises (ZEEL) reported a 5% year-on-year decline in its December quarter consolidated net profit, reaching Rs 155 crore. Despite this, the company saw a significant 15% rise in revenue from operations, which stood at Rs 2,149 crore for the quarter.",
            "pubDate": "2026-01-22T10:28:13.010835"
        },
        {
            "title": "Orient Electric Q3 Results: Profit down 4.4% to Rs 26 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/orient-electric-q3-results-profit-down-4-4-to-rs-26-crore/articleshow/127143126.cms",
            "description": "Orient Electric Ltd on Thursday reported a decline of 4.37 per cent at Rs 25.98 crore for the December quarter of FY26.",
            "pubDate": "2026-01-22T11:15:01.331508"
        },
        {
            "title": "InterGlobe Aviation Q3 Results: IndiGo parent's cons PAT plummets 78% YoY to Rs 550 crore, revenue up 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/interglobe-aviation-q3-results-indigo-parents-cons-pat-falls-78-yoy-to-rs-550-crore-revenue-up-6/articleshow/127142781.cms",
            "description": "IndiGo Q3 Results: IndiGo's net profit plummeted 78% year-on-year to Rs 550 crore in the December quarter, despite a 6% rise in revenue to Rs 23,472 crore. Excluding exceptional items, the profit stood at Rs 3,131 crore, with a significant dip in PAT margin to 2.3%.",
            "pubDate": "2026-01-22T11:15:01.331638"
        },
        {
            "title": "Ujjivan Small Finance Bank  delivers record Rs 1,000 cr NII in Q3,  profit zooms 71% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ujjivan-small-finance-bank-delivers-record-rs-1000-cr-nii-in-q3-profit-zooms-71-yoy/articleshow/127148087.cms",
            "description": "Ujjivan Small Finance Bank posted a strong Q3 performance, reporting its highest-ever net interest income of Rs 1,000 crore and a 71% jump in profit to Rs 186 crore. Improved collection efficiency and easing microfinance stress reduced provisioning needs, while a rising share of secured loans bolstered asset quality and profitability.",
            "pubDate": "2026-01-22T11:58:10.886256"
        },
        {
            "title": "Adani Energy Solutions Q3 Results: Profit falls 2% YoY to Rs 552 cr, revenue up 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-energy-solutions-q3-results-profit-falls-2-yoy-to-rs-552-cr-revenue-up-15/videoshow/127155584.cms",
            "description": "Adani Energy Solutions on Thursday reported a 2% year-on-year (YoY) decline in its consolidated net profit at Rs 552 crore, while revenue from operations rose 15% YoY to Rs 6,730 crore.The revenue growth was driven by better operating performance and SCA (Service Concession Arrangement) income due to higher capex.EBITDA during the quarter hit a record high of Rs 2,210 crore, up 21% year-on-year, driven by robust growth in the transmission and smart metering segments and steady performance in the distribution segment.Adani Energy said comparable PAT has been adjusted for a one-time positive deferred tax impact of Rs 185 crore in Q3FY25 to enable a like-for-like comparison. On an adjusted basis, Q3 PAT stood at Rs 574 crore, marking a 30% year-on-year increase.\"Despite the challenges, our core strengths of strong on-ground execution, focused O&M and capital management have helped to drive consistent progress on the project development side,\" said Kandarp Patel, CEO, Adani Energy.",
            "pubDate": "2026-01-22T13:36:48.655627"
        },
        {
            "title": "Mphasis meets third-quarter revenue estimates as banks resume tech spending",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indias-mphasis-meets-third-quarter-revenue-estimates-as-banks-resume-tech-spending/articleshow/127154144.cms",
            "description": "Indian information technology company Mphasis reported third-quarter ‍revenue in line with ​estimates on Thursday, with banking and financial ⁠services clients resuming spending on technology amid better macroeconomic and policy clarity.",
            "pubDate": "2026-01-22T13:36:48.655758"
        },
        {
            "title": "Ixigo Q3 Results: Profit soars 54% to Rs 24 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/travel-booking-platform-ixigos-q3-profit-up-54-pc-at-rs-24-cr/articleshow/127152900.cms",
            "description": "ixigo (Le Travenues Technology Limited) on Thursday reported 54.11 per cent rise in consolidated net profit for December quarter at Rs 23.95 crore, driven by higher revenue from operations including flight, train, and bus ticketing services.",
            "pubDate": "2026-01-22T13:36:48.655871"
        },
        {
            "title": "IndiGo takes Rs 577 crore revenue hit in Q3 due to December flight chaos",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-takes-rs-577-crore-revenue-hit-in-q3-due-to-december-flight-chaos/articleshow/127152736.cms",
            "description": "IndiGo’s December-quarter profit plunged 75% after cancelling thousands of flights, taking a Rs 577 crore exceptional hit. Operational lapses, refunds and labour code costs hurt earnings, though ticket and ancillary revenues still grew amid regulatory scrutiny and market volatility concerns.",
            "pubDate": "2026-01-22T13:36:48.655972"
        },
        {
            "title": "Bandhan Bank Q3 results: PAT falls 52% YoY to Rs 206 crore, NII down 4.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bandhan-bank-q3-results-pat-falls-52-yoy-to-rs-206-crore-nii-down-4-5/articleshow/127160971.cms",
            "description": "Bandhan Bank’s Q3 net profit fell 52% YoY to Rs 206 crore, but sequential PAT rose 84%. Strong deposit and advance growth, stable asset quality, and digital initiatives indicate improving fundamentals and future growth potential.",
            "pubDate": "2026-01-22T14:04:16.752007"
        },
        {
            "title": "Adani Total Gas posts first profit rise in five quarters as CNG sales grow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-total-gas-posts-first-profit-rise-in-five-quarters-as-cng-sales-grow/articleshow/127162603.cms",
            "description": "India's Adani Total Gas on Thursday ‍reported its first ​quarterly profit increase in five quarters, ⁠as higher compressed natural gas (CNG) sales helped offset elevated gas procurement costs.",
            "pubDate": "2026-01-22T14:42:18.011062"
        },
        {
            "title": "IndusInd Bank Q3 Preview: PAT may see sharp erosion up to 99%, NII to likely fall up to 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-q3-preview-pat-may-see-sharp-erosion-up-to-99-nii-to-likely-fall-up-to-18/articleshow/127162116.cms",
            "description": "IndusInd Bank is set for a steep Q3FY26 profit decline, with brokerages forecasting 78–99% YoY fall due to weak loan growth, margin pressure, and higher credit costs, though provisions may ease sequentially. NII and PPoP are also under pressure.",
            "pubDate": "2026-01-22T14:42:18.011191"
        },
        {
            "title": "Cyient Q3 Results: Profit declines 25% to Rs 92 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cyient-q3-profit-declines-25-pc-to-rs-92-crore/articleshow/127171394.cms",
            "description": "Engineering services company Cyient on Thursday reported a 24.9 per cent decline in consolidated net profit to Rs 91.8 crore for December quarter FY26, primarily due to a one-time provision on the back of new Labour Codes.",
            "pubDate": "2026-01-22T15:59:45.089801"
        },
        {
            "title": "Bandhan Bank Q3 profit plunges 52% as one-time income fades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bandhan-bank-q3-profit-plunges-52-as-one-time-income-fades/articleshow/127170020.cms",
            "description": "Bandhan Bank’s third quarter profit fell 52% to Rs 206 crore, hurt by lower core and other income and absence of one-time gains. Asset quality improved as bad loan sales cut NPAs, easing provisions, while advances and deposits grew steadily.",
            "pubDate": "2026-01-22T15:59:45.089926"
        }
    ]
}