{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-04T14:46:34.025873",
    "items": [
        {
            "title": "Dow, S&P 500 manage record closing highs; Nasdaq falls in volatile session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-sp-500-manage-record-closing-highs-nasdaq-falls-in-volatile-session/articleshow/124301234.cms",
            "description": "The S&P 500 and Dow achieved record closing highs Friday, navigating a volatile session amid an ongoing government shutdown. Interest rate-cut expectations strengthened, driven by weak economic data, including contracting services employment. Traders now anticipate a Fed rate cut in October as almost certain, with another probable in December, despite concerns about a prolonged shutdown's impact.",
            "pubDate": "2025-10-04T03:49:37.194583"
        },
        {
            "title": "M-cap share of defensives hits lowest level since 2011: ICICI Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/m-cap-share-of-defensives-hits-lowest-level-since-2011-icici-securities/articleshow/124301089.cms",
            "description": "ICICI Securities reports that defensive sectors like FMCG, IT, and healthcare have seen their market-cap share drop to a 20% low since 2011, from 30% in 2020. Their profit pool share also plummeted to 16%, while valuations remain high at 32 times P/E. Meanwhile, cyclicals' P/B ratios have surged significantly from 2020 bottoms.",
            "pubDate": "2025-10-04T03:49:37.194693"
        },
        {
            "title": "Will stock-specific trading continue to drive market gains?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-stock-specific-trading-continue-to-drive-market-gains/articleshow/124300938.cms",
            "description": "Indian equity indices closed higher on Friday, recovering from early losses as stock-specific trading dominated after the RBI's dovish stance fizzled out. Midcap, smallcap, metal, and PSU bank sectors saw significant gains, with experts suggesting buying opportunities on dips towards 24,400-24,600 for Nifty.",
            "pubDate": "2025-10-04T03:49:37.194794"
        },
        {
            "title": "GST 2.0: Insurers cut payouts to distributors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-2-0-insurers-cut-payouts-to-distributors/articleshow/124300931.cms",
            "description": "Life insurers face a similar squeeze. The industry paid about ?24,000 crore in GST in FY24, offset by ? 14,000 crore of ITC. With credits no longer available, the new two-rate system leaves them facing a ?15,000 crore sector-wide hit, part of which will show up in company profit and loss accounts and embedded values. Despite the exemption, customers may not see a meaningful drop in premiums as insurers adjust pricing to recoup lost credits, analysts said.",
            "pubDate": "2025-10-04T03:49:37.194892"
        },
        {
            "title": "Growth Uncapped: NBFCs can tap a billion dollars or more in ECBs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/growth-uncapped-nbfcs-can-tap-a-billion-dollars-or-more-in-ecbs/articleshow/124300922.cms",
            "description": "Financial regulators - the Reserve Bank of India, Securities and Exchange Board of India, Insurance Regulatory and Development Authority of India and Pension Fund Regulatory and Development Authority -would not enforce ceilings on the amounts that can be borrowed by Indian companies from overseas markets. The RBI has also allowed borrowers that is under a debt restructuring scheme or corporate insolvency resolution process to raise ECB only if specifically permitted under the restructuring or resolution plan.",
            "pubDate": "2025-10-04T03:49:37.194985"
        },
        {
            "title": "India anchor of stability in volatile world: RBI governor Sanjay Malhotra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-anchor-of-stability-in-volatile-world-rbi-governor-sanjay-malhotra/articleshow/124301152.cms",
            "description": "RBI Governor Sanjay Malhotra affirmed India as an \"anchor of stability\" due to resilient growth, robust macroeconomic fundamentals, and continuous reforms. He cautioned against global stock market complacency and rising public debt, noting gold prices now reflect global uncertainties. Malhotra also highlighted India's unique central bank autonomy framework.",
            "pubDate": "2025-10-04T03:49:37.195077"
        },
        {
            "title": "RBI tweaks related party lending rules, unveils 'unified' framework",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-proposes-revised-framework-for-lending-to-related-parties/articleshow/124301028.cms",
            "description": "The move is aimed at tightening governance and reducing conflicts of interest in lending practices by commercial banks. The revised norms, effective from April 1, 2026, consolidate and replace over a dozen legacy circulars, creating a unified regulatory framework. RBI also introduced scale-based thresholds beyond which banks and non-banking financial companies (NBFCs) will need board approval for lending to related parties.",
            "pubDate": "2025-10-04T03:49:37.195278"
        },
        {
            "title": "HDFC Bank Q2 update: Average deposits grow 15% YoY, 9% rise in advances",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-q2-update-average-deposits-grow-15-yoy-9-rise-in-advances/articleshow/124302695.cms",
            "description": "HDFC Bank announced robust Q2FY26 business updates, with average deposits surging 15.1% year-on-year to Rs 27.15 lakh crore. Average advances also grew by 9% to Rs 27.95 lakh crore. The bank reported significant increases in both CASA and time deposits, reflecting strong financial performance for the quarter.",
            "pubDate": "2025-10-04T05:31:00.509417"
        },
        {
            "title": "Sebi says no plans to regulate family offices after reports spark speculation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-says-no-plans-to-regulate-family-offices-after-reports-spark-speculation/articleshow/124302440.cms",
            "description": "Family offices are investment firms set up by wealthy families to manage their assets. Over the past two decades, they have become a significant force in India’s markets—investing in startups, private equity, and initial public offerings.",
            "pubDate": "2025-10-04T05:31:00.509559"
        },
        {
            "title": "How hedge funds performed in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-hedge-funds-performed-in-september/articleshow/124301854.cms",
            "description": "The JPMorgan note, which tracks hedge fund trading, said positioning in U.S. stocks was only \"somewhat bullish,\" indicating an expectation for equities to rise.",
            "pubDate": "2025-10-04T05:31:00.509677"
        },
        {
            "title": "David Solomon of Goldman Sachs sees market drawdown ahead, says AI frenzy may set stage for equity shakeout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/david-solomon-of-goldman-sachs-sees-market-drawdown-ahead-says-ai-frenzy-may-set-stage-for-equity-shakeout/articleshow/124304723.cms",
            "description": "David Solomon, Goldman Sachs CEO, warns of a stock market drawdown within 12 to 24 months. He notes AI enthusiasm drives current market cycles. Solomon indicates capital deployed into AI ventures may not deliver returns. He draws parallels to the dotcom era. Investor excitement leads to risk-taking. A market reset will happen. Other leaders also express concerns about market speculation.",
            "pubDate": "2025-10-04T08:46:21.231723"
        },
        {
            "title": "How RBI’s nod puts banks at the centre of corporate deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-rbis-nod-puts-banks-at-the-centre-of-corporate-deals/articleshow/124304470.cms",
            "description": "The Reserve Bank of India now permits banks to finance domestic company mergers and acquisitions. This reform updates capital market exposure guidelines. It aligns Indian banking with global standards. This opens new credit opportunities for banks. They can reclaim market share from non-bank lenders. Banks must develop specialized M&A advisory and underwriting skills. This policy change supports India's corporate growth.",
            "pubDate": "2025-10-04T08:46:21.231865"
        },
        {
            "title": "Double Dip: 14 Nifty500 stocks slide in both quarters of FY26, slip up to 45%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/double-dip-14-nifty500-stocks-slide-in-both-quarters-of-fy26-slip-up-to-45/slideshow/124304218.cms",
            "description": "Riding the market wave hasn’t been easy for all—despite strong index gains, several Nifty500 stocks are still stuck in the red so far this fiscal year. While the Nifty500 has climbed 8% and the benchmark Nifty is up 6% so far in FY26, not all constituents have kept pace. Data shows that 44 stocks from the Nifty500 have slipped over 10% during this period, highlighting pockets of underperformance amid a broadly buoyant market.",
            "pubDate": "2025-10-04T08:46:21.231974"
        },
        {
            "title": "DMart Q2 update: Revenue from operations jumps over 15% YoY to Rs 16,219 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dmart-q2-update-revenue-from-operations-jumps-over-15-yoy-to-rs-16219-crore/articleshow/124304442.cms",
            "description": "Avenue Supermarts reported strong revenue growth for Q2 FY26. DMart's standalone revenue increased by 15.4 percent year-on-year. It reached 16,218.79 crore rupees for the quarter ending September 30, 2025. This marks the highest Q2 revenue in four years. The company now operates 432 DMart stores. The board will meet on October 11 to approve financial results.",
            "pubDate": "2025-10-04T08:46:21.232077"
        },
        {
            "title": "Platinum: The elder cousin of gold & silver is poised for a comeback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/platinum-the-elder-cousin-of-gold-silver-is-poised-for-a-comeback/articleshow/124303697.cms",
            "description": "Platinum, trading at historic discounts to gold and silver, presents a compelling investment opportunity. Technical and fundamental indicators suggest a major reversal is underway, driven by tight supply and growing industrial demand from green technologies. This undervalued precious metal offers significant upside potential.",
            "pubDate": "2025-10-04T08:46:21.232178"
        },
        {
            "title": "Mukul Agrawal portfolio: 5 stocks jumped up to 80% in the last six months. Own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-portfolio-5-stocks-jumped-up-to-80-in-the-last-six-months-own-any/slideshow/124303375.cms",
            "description": "Ace investor Mukul Agrawal, with a portfolio worth around Rs 7,700 crore, continues to back a mix of established businesses and emerging names. His bets span real estate, food, fertilizers, engineering, and specialty companies. Many of his holdings have delivered strong returns in the past six months, highlighting his knack for spotting growth opportunities across diverse sectors. Here’s a snapshot of five key stocks from his portfolio and how they have performed recently.",
            "pubDate": "2025-10-04T08:46:21.232280"
        },
        {
            "title": "BofA Global Research moves Fed rate cut forecast to October from December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bofa-global-research-moves-fed-rate-cut-forecast-to-october-from-december/articleshow/124302803.cms",
            "description": "Bank of America Global Research has advanced its forecast for the Federal Reserve's next interest rate cut to October from December, citing a softening labor market. While BofA expects only one cut this year, other major firms anticipate two.",
            "pubDate": "2025-10-04T08:46:21.232375"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/124302772.cms",
            "description": "US government shutdown occurs. Stocks reach new record highs. Investors expect future rate cuts. The dollar may weaken against major currencies. Pharmaceutical shares see a boost from new agreements. Oil prices remain low due to global oversupply. New Zealand's central bank prepares for a rate reduction next week. Economic visibility is currently limited.",
            "pubDate": "2025-10-04T08:46:21.232469"
        },
        {
            "title": "Wall Street Week Ahead-Wall Street eyes Washington standoff with stocks near records",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-wall-st-eyes-washington-standoff-with-stocks-near-records/articleshow/124302725.cms",
            "description": "The U.S. government shutdown will capture investor focus next week. Markets hold near record highs, preparing for the earnings season. Few expect the Washington situation to derail the current rally. A data drought could impact Federal Reserve policy decisions. The fourth quarter is historically strong for stocks. Investors anticipate results from Levi Strauss and Delta Air Lines.",
            "pubDate": "2025-10-04T08:46:21.232563"
        },
        {
            "title": "Kotak Mahindra Bank Q2 update: Avg deposits up 14% YoY, avg net advances rise 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-q2-update-avg-deposits-up-14-yoy-avg-net-advances-rise-15/articleshow/124305960.cms",
            "description": "Kotak Mahindra Bank announced strong provisional financial results for the second quarter ending September 30. The bank reported a 14.4% year-on-year growth in average total deposits, reaching Rs 5,10,138 crore, and a 14.6% increase in average net advances. Period-end net advances rose 15.8%, while CASA balances grew 11.2%. Following the announcement, the bank's shares closed 1.8% higher.",
            "pubDate": "2025-10-04T10:31:07.664664"
        },
        {
            "title": "FII outflows from Indian markets touch Rs 1.98 lakh cr in 2025; total selling hits Rs 3.19 lakh crore over 21 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-outflows-from-indian-markets-touch-rs-1-98-lakh-cr-in-2025-total-selling-hits-rs-3-19-lakh-crore-over-21-months/articleshow/124305486.cms",
            "description": "Foreign Institutional Investors have pulled out Rs 1,98,103 crore from Indian equities in 2025. September alone saw Rs 27,163 crore exit. This selling trend has continued for nearly two years, totaling Rs 3,19,313 crore over 21 months. Analysts point to valuation concerns and global allocation shifts. Outflows may slow as valuations stabilize and corporate earnings improve.",
            "pubDate": "2025-10-04T10:31:07.664794"
        },
        {
            "title": "Concurrent Gainers: 9 small-cap stocks that gained for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-9-small-cap-stocks-that-gained-for-5-days-in-a-row/slideshow/124305749.cms",
            "description": "During the last five trading sessions leading up to October 3, the Sensex stayed mostly flat with a mild upward tilt, inching up by just 47 points to close at 81,207. The benchmark index finished in the green on only two of those five sessions (from September 25 to October 3). Despite the broader market's lackluster and somewhat volatile performance, nine small-cap stocks managed to post gains across all five sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-10-04T10:31:07.664906"
        },
        {
            "title": "Wework India to Infinity Infoway: 5 IPOs that could offer up to 33% return next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wework-india-to-infinity-infoway-5-ipos-that-could-offer-up-to-33-return-next-week/slideshow/124305426.cms",
            "description": "The IPO market continues to stay busy with a mix of mainboard and SME issues drawing investor attention ahead of their listings. Grey Market Premiums (GMPs) offer a quick snapshot of sentiment, though they are unofficial and not always an indicator of listing-day performance. Here are five upcoming IPOs and the GMP trend around them.",
            "pubDate": "2025-10-04T10:31:07.665011"
        },
        {
            "title": "SIFs explained: Understanding Specialized Investment Funds for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sifs-explained-understanding-specialized-investment-funds-for-investors/slideshow/124305336.cms",
            "description": "Specialized Investment Funds (SIFs) are a new-age investment option for high-ticket investors, sitting between regular mutual funds and PMS. Anand Rathi's Chirag Muni decodes what they are, how they work, and who they’re for.",
            "pubDate": "2025-10-04T10:31:07.665112"
        },
        {
            "title": "CreditAccess, Fusion Finance: Motilal Oswal bet on recovery-led growth in microfinance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/creditaccess-fusion-finance-motilal-oswal-bet-on-recovery-led-growth-in-microfinance/articleshow/124305115.cms",
            "description": "The microfinance industry is gradually recovering from a turbulent phase, driven by operational reforms, digital adoption, and product diversification. Despite a significant GLP contraction and cautious lending, improved collection efficiencies and an easing funding environment signal a stronger future. Profitability is expected to rebound from 2HFY26, fostering sustainable growth.",
            "pubDate": "2025-10-04T10:31:07.665234"
        },
        {
            "title": "Vedanta Q2 Update: Record aluminum, alumina production; Zinc India delivers best-ever mined metal output",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-q2-update-record-aluminum-alumina-production-zinc-india-delivers-best-ever-mined-metal-output/articleshow/124306776.cms",
            "description": "Vedanta Ltd achieved record production highs in Q2 FY26, including its highest-ever quarterly aluminum output at 617 kt and alumina production at 653 kt, a 31% YoY jump. Zinc India and Zinc International also reported best-ever mined metal figures. Pig iron output surged 26%.",
            "pubDate": "2025-10-04T14:46:32.278131"
        },
        {
            "title": "NSE cuts Nifty derivatives lot size to 65, revises contract sizes for other key indices from Dec 30",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-cuts-nifty-derivatives-lot-size-to-65-revises-contract-sizes-for-other-key-indices-from-dec-30/articleshow/124306482.cms",
            "description": "The National Stock Exchange will reduce Nifty 50 futures and options lot size from 75 to 65, effective December 30, 2025, for contracts expiring thereafter. This revision, also impacting Bank Nifty and other indices, aims to balance contract values. Traders will need to adjust position sizes and margin requirements, while retail investors may find contracts more accessible.",
            "pubDate": "2025-10-04T14:46:32.278260"
        },
        {
            "title": "Bajaj Finance Q2 update: AUM grows 24% YoY, deposit book surges over 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-q2-update-aum-grows-24-yoy-deposit-book-surges-over-5/articleshow/124306347.cms",
            "description": "Bajaj Finance delivered a robust operational performance in Q2 FY26, with Assets Under Management surging 24% year-on-year to Rs 4,62,250 crore. The company expanded its customer base to 110.64 million, adding over 4 million new customers, while new loan bookings jumped 26%. This strong growth follows a 22% profit increase in Q1, underscoring consistent financial strength and retail traction.",
            "pubDate": "2025-10-04T14:46:32.278478"
        }
    ]
}