{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-21T05:15:34.293273",
    "items": [
        {
            "title": "Godrej Properties shares in focus after winning Hyderabad land parcel bid with Rs 3,800 crore revenue potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-properties-shares-in-focus-after-winning-hyderabad-land-parcel-bid-with-rs-3800-crore-revenue-potential/articleshow/123422070.cms",
            "description": "Godrej Properties has emerged as the highest bidder for a 7.825-acre land parcel in Kukatpally, Hyderabad, with a revenue potential of approximately Rs 3,800 crore. Securing the parcel for Rs 547.75 crore in an e-auction by the Telangana Housing Board, this acquisition strengthens Godrej's presence in Hyderabad, building on recent successful launches.",
            "pubDate": "2025-08-21T03:31:16.517953"
        },
        {
            "title": "IndusInd Bank shares in focus after legacy issue resolutions, new leadership appointment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-after-legacy-issue-resolutions-new-leadership-appointment/articleshow/123421925.cms",
            "description": "IndusInd Bank's share price is likely to remain in focus as the lender resolves legacy issues in its treasury and microfinance businesses. The board has also cleared the appointment of veteran banker Rajiv Anand as MD & CEO.",
            "pubDate": "2025-08-21T03:31:16.518077"
        },
        {
            "title": "NTPC, Info Edge, Infosys among 10 stocks showing RSI Trending Up on August 20",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-info-edge-infosys-among-10-stocks-showing-rsi-trending-up-on-august-20/slideshow/123421779.cms",
            "description": "Ten stocks from the NSE large cap segment were highlighted in the RSI Trending Up scan on August 20, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-08-21T03:31:16.518188"
        },
        {
            "title": "Insurance stocks in focus as GoM proposes to exempt GST on premiums",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-life-hdfc-life-insurance-and-other-insurance-stocks-in-focus-as-gom-proposes-to-exempt-gst-on-insurance-premiums/articleshow/123421858.cms",
            "description": "Insurance stocks like SBI Life and HDFC Life will be in focus after a GoM proposed exempting GST on individual health and life insurance premiums. The move, part of GST 2.0 reforms, could ease costs for policyholders and improve sector outlook, pending council approval.",
            "pubDate": "2025-08-21T03:31:16.518289"
        },
        {
            "title": "PG Electroplast, Aurobindo Pharma, HAL among 9 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pg-electroplast-aurobindo-pharma-hal-among-9-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123421605.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack as of August 20, contributing to a total increase in open interest of over 6% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-08-21T03:31:16.518395"
        },
        {
            "title": "Positive Breakout: These 8 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/123421500.cms",
            "description": "In the Nifty200 pack, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on August 20, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-08-21T03:31:16.518502"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Global Health, Piramal Pharma among 5 stocks that could give 15-52% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-global-health-piramal-pharma-among-5-stocks-that-could-give-15-52-return/slideshow/123421403.cms",
            "description": "Brokerages remain optimistic on select stocks across sectors, highlighting healthy upside potential in the near to medium term.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-21T03:31:16.518599"
        },
        {
            "title": "Dividend record date: Last chance to buy shares of Godfrey Phillips, IRCTC, other 50 companies for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-record-date-last-chance-to-buy-shares-of-godfrey-phillips-irctc-other-50-companies-for-eligibility/articleshow/123421308.cms",
            "description": "Indian investors seeking dividends have a final chance to buy shares. Friday is the record date for eligibility. Godfrey Phillips India leads with a Rs 60 per share dividend. IRCTC, LIC Housing Finance, and Lodha Developers also announced payouts. Numerous other companies across sectors declared dividends. This includes ABM Knowledgeware, AGI Greenpac, and Jindal Stainless.",
            "pubDate": "2025-08-21T03:31:16.518724"
        },
        {
            "title": "Multibagger stock with nearly 1700% returns in a year goes ex-bonus, ex-split tomorrow. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-stock-with-nearly-1700-returns-in-a-year-goes-ex-bonus-ex-split-tomorrow-check-details/articleshow/123421263.cms",
            "description": "Bemco Hydraulics, known for its impressive 1672% returns, is set to reward investors with a 1:1 bonus issue and a 10:1 stock split. August 22 is the record date, requiring investors to purchase shares today to qualify. This dual action significantly increases the number of shares held, enhancing liquidity and making the stock more accessible to retail investors.",
            "pubDate": "2025-08-21T03:31:16.518822"
        },
        {
            "title": "Australian shares hit fresh high on mining and banks boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-hit-fresh-high-on-mining-and-banks-boost/articleshow/123421145.cms",
            "description": "Australian shares reached a record high, propelled by gains in the mining and banking sectors. Investors are keenly awaiting U.S. Federal Reserve Chair Jerome Powell's speech for insights into future interest rate decisions. Meanwhile, James Hardie and Whitehaven Coal experienced significant declines due to bleak outlooks and profit drops, respectively.",
            "pubDate": "2025-08-21T03:31:16.518918"
        },
        {
            "title": "Nasdaq, S&P 500 end lower as investors sell tech, buy less pricey sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-sp-500-end-lower-as-investors-sell-tech-buy-less-pricey-sectors/articleshow/123421006.cms",
            "description": "On Wednesday, the Nasdaq and S&P 500 experienced declines as investors shifted away from tech stocks towards sectors with lower valuations, awaiting insights from Federal Reserve officials at the Jackson Hole symposium. Tech stocks faced pressure due to concerns about AI valuations and potential government intervention. Meanwhile, investors are closely monitoring upcoming economic data and earnings reports from major retailers.",
            "pubDate": "2025-08-21T03:31:16.519017"
        },
        {
            "title": "Asian stocks mixed, bonds climb ahead of Powell speech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-bonds-climb-ahead-of-powell-speech/articleshow/123420500.cms",
            "description": "Asian equities are poised for a mixed open as Wall Street favored bonds ahead of the Federal Reserve's Jackson Hole gathering. Fed officials highlighted inflation risks, fueling debate within the central bank. Technology stocks declined, with the 'Magnificent Seven' experiencing their longest losing streak since April, raising concerns about a potential market correction.",
            "pubDate": "2025-08-21T03:31:16.519115"
        },
        {
            "title": "Nazara shares tank 15% on real money gaming ban",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-shares-tank-15-on-real-money-gaming-ban/articleshow/123420431.cms",
            "description": "Nazara Technologies' shares plummeted after the Lok Sabha passed a bill banning real money gaming. The company clarified its indirect exposure through a stake in PokerBaazi, which reported losses. Analysts suggest Nazara's investment in PokerBaazi is now at risk, while Delta Corp is unlikely to be affected due to a prior divestment.",
            "pubDate": "2025-08-21T03:31:16.519213"
        },
        {
            "title": "GIFT Nifty up 5 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123414928.cms",
            "description": "Nifty marked its fifth consecutive session gain, propelled by IT stocks, with analysts predicting a positive near-term outlook due to government support and increased consumption. Technically, Nifty is a 'buy on dips' above 24,800, targeting 25,250 and potentially 25,500. The rupee strengthened, while FIIs were net sellers and DIIs were net buyers.",
            "pubDate": "2025-08-21T03:31:16.519305"
        },
        {
            "title": "Stocks in news: IndusInd Bank, India Cements, Godrej Properties, Clean Sciences, Exide Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indusind-bank-india-cements-godrej-properties-clean-sciences-exide-industries/articleshow/123414804.cms",
            "description": "Indian market continues its upward trend. IndusInd Bank addresses past issues. Godrej Properties acquires stake in Godrej Skyline Developers. Promoters may sell stake in Clean Sciences. Exide Industries invests in Exide Energy Solutions. Vedanta informs about corporate guarantee. Jupiter Wagons receives order for Vande Bharat train wheelsets. UltraTech board approves stake sale in India Cements.",
            "pubDate": "2025-08-21T03:31:16.519397"
        },
        {
            "title": "Aditya Birla ARC delivers 40% IRR amidst stressed asset recovery",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-arc-delivers-40-irr-amidst-stressed-asset-recovery/articleshow/123420317.cms",
            "description": "Aditya Birla ARC, a joint venture, provided a 40% return to its investors. This is the highest among Indian asset reconstruction companies. The ARC invested ₹6,000 crore in stressed assets. It generated substantial profits from investments like KSK Mahanadi Power and Rattan India Power. However, the company plans to surrender its ARC license.",
            "pubDate": "2025-08-21T03:31:16.519490"
        },
        {
            "title": "Ola Electric shares skid 7% after 2-day rally as VAHAN data cools sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-skid-7-after-2-day-rally-as-vahan-data-cools-sentiment/articleshow/123424125.cms",
            "description": "Ola's share price tumbled after VAHAN data showed the EV maker lagging rival Ather Energy in August sales, with 9,522 registrations versus Ather’s 10,248 as of August 20. If the momentum continues, Ola’s market share could fall below that of its competitor.",
            "pubDate": "2025-08-21T05:15:15.499959"
        },
        {
            "title": "ARC Insulation & Insulators IPO opens today, 3 others SME issues on Friday. Here's what GMP suggests",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/arc-insulation-insulators-ipo-opens-today-3-others-sme-issues-on-friday-heres-what-gmp-suggests/slideshow/123423833.cms",
            "description": "SME IPO ARC Insulation opens for subscription today. The company plans to raise Rs 41.19 crore through this book building issue. Three more SME issues will open on Friday viz. Anondita Medicare, Classic Electrodes and Shivashrit Foods. Here's what their grey market premiums (GMPs) suggest about the expected listings:",
            "pubDate": "2025-08-21T05:15:15.500080"
        },
        {
            "title": "Nazara shares in freefall, down 23% in 2 days as PokerBaazi game haunts investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-shares-in-freefall-down-23-in-2-days-as-pokerbaazi-game-haunts-investors/articleshow/123423431.cms",
            "description": "Nazara shares: The Lok Sabha passed the Online Gaming Bill, 2025, which bans all money-based online games and related transactions. Nazara is exposed to the sector through its stake in Moonshine Technology (PokerBaazi).",
            "pubDate": "2025-08-21T05:15:15.500186"
        },
        {
            "title": "Japanese stocks log 1.16 trillion yen FPI inflows, biggest in over 4 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japanese-stocks-log-biggest-weekly-foreign-inflows-in-over-four-months/articleshow/123423329.cms",
            "description": "Japanese stocks experienced a surge in foreign investment, reaching a high of 1.16 trillion yen, fueled by expectations of a U.S. rate cut and strong domestic economic data. The Nikkei 225 Index hit a record high, although technology stocks later declined.",
            "pubDate": "2025-08-21T05:15:15.502280"
        },
        {
            "title": "JSW Steel, Bajaj Auto, Ethos among 7 top recommendations by brokerages. Up to 48% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-steel-bajaj-auto-ethos-among-7-top-recommendations-by-brokerages-up-to-48-upside-seen/slideshow/123423300.cms",
            "description": "Brokerages have rolled out eight fresh recommendations across sectors, projecting sharp upsides in select stocks while recommending a 'Sell' in one PSU stock. The stock picks are recommended by SBI, Securities, Choice Broking, Axis Securities and ElaraCapital. Here's what they suggest:",
            "pubDate": "2025-08-21T05:15:15.502403"
        },
        {
            "title": "Q1 earnings shocker: 51 profitable companies just turned loss-makers. Is your portfolio at risk?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q1-earnings-shocker-51-profitable-companies-just-turned-loss-makers-is-your-portfolio-at-risk/articleshow/123423127.cms",
            "description": "The Q1 earnings season revealed a concerning trend as 51 previously profitable companies, including Tejas Networks and Ideaforge, slipped into losses. This downturn, impacting various sectors, reflects a broader market slowdown with single-digit growth. While analysts anticipate a recovery in the second half of FY26, downgrades outnumbered upgrades, prompting caution among investors.",
            "pubDate": "2025-08-21T05:15:15.502558"
        },
        {
            "title": "India Cements shares jump 3% as UltraTech Cement's OFS to sell 6.5% stake opens today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-cements-shares-jump-3-on-ultratech-cements-plan-to-offload-stake-via-ofs/articleshow/123423083.cms",
            "description": "India Cements' shares surged following UltraTech Cement's announcement of selling up to 6.49% stake through an offer for sale (OFS) to comply with SEBI's minimum public shareholding norms. UltraTech, the majority shareholder after acquiring India Cements in December 2024, aims to reduce its holding from 81.49%. The OFS will occur over two days, with non-retail investors bidding first.",
            "pubDate": "2025-08-21T05:15:15.502684"
        },
        {
            "title": "RailTel shares jump 4% after fresh Rs 50 crore contract wins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railtel-shares-jump-4-after-fresh-rs-50-crore-contract-wins/articleshow/123423059.cms",
            "description": "RailTel shares: The PSU bagged contracts worth nearly ₹50 crore. The deals include a ₹34.99 crore project from Kerala’s IT Mission for data centre operations and a ₹15.42 crore contract from Odisha’s Higher Education Department to develop bilingual college websites.",
            "pubDate": "2025-08-21T05:15:15.502779"
        },
        {
            "title": "Bajaj Finserv shares rise 2%. Why Jefferies initiated coverage on Nifty stock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-shares-rise-2-why-jefferies-initiated-coverage-on-nifty-stock/articleshow/123423026.cms",
            "description": "Shares of Bajaj Finserv rose 2% after Jefferies initiated coverage with a ‘buy’ rating and a target price of Rs 2,420, citing limited impact from Jio Financial’s entry. The brokerage sees 22% core earnings CAGR over FY25–28, driven by strong growth at Bajaj Finance, improving profitability in BAGIC and BALIC, and upside from new ventures in mutual funds, healthcare, and tech.",
            "pubDate": "2025-08-21T05:15:15.502870"
        },
        {
            "title": "RIL, bank stocks drive Sensex 300 pts higher, Nifty above 25,100",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-bank-stocks-drive-sensex-150-pts-higher-nifty-above-25000/articleshow/123422537.cms",
            "description": "Indian equity markets traded higher, fueled by gains in Reliance Industries and financial stocks, continuing a five-day rally amid GST cut optimism. The Sensex and Nifty both saw increases, while investors awaited insights from the Federal Reserve's symposium regarding interest rates. Market experts advise vigilance regarding valuations, particularly within the small-cap sector, despite overall positive momentum.",
            "pubDate": "2025-08-21T05:15:15.502967"
        },
        {
            "title": "Vedanta shares in focus as NCLT defers demerger hearing, SC dismisses plea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-as-nclt-defers-demerger-hearing-sc-dismisses-plea/articleshow/123422825.cms",
            "description": "Vedanta shares: The NCLT deferred its hearing on the company’s five-way demerger to September 17 following government objections over alleged concealment of information and inflated revenues, while the Supreme Court rejected Vedanta’s compensation plea in a separate case. The stock fell nearly 3% on Wednesday after the developments.",
            "pubDate": "2025-08-21T05:15:15.503058"
        },
        {
            "title": "Vibhor Steel Tubes, Borana Weaves shares in focus as shareholder lock-in ends today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vibhor-steel-tubes-borana-weaves-shares-in-focus-as-shareholder-lock-in-ends-today/articleshow/123422790.cms",
            "description": "Shares of Vibhor Steel Tubes and Borana Weaves will come into focus on Thursday as their shareholder lock-in periods end. About 38 lakh shares (20% equity) of Vibhor Steel and 15 lakh shares (6% equity) of Borana Weaves will become tradeable.",
            "pubDate": "2025-08-21T05:15:15.503153"
        },
        {
            "title": "Waaree Energies, Inox India among 6 stocks that rose above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-inox-india-among-6-stocks-that-rose-above-vwap/slideshow/123422732.cms",
            "description": "On August 20, the closing prices of six stocks in the Nifty500 pack rallied over 1.5% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it indicates that the closing price is higher than the average price at which the stock was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-21T05:15:15.503243"
        },
        {
            "title": "Clean Science shares dive 9% as promoters likely offload 20% equity stake via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/clean-science-shares-in-focus-as-promoters-plan-24-stake-sale-worth-rs-2626-crore/articleshow/123422571.cms",
            "description": "Clean Science and Technology's share price plunged 8.9% after promoters Ashok Boob and Krishnakumar Boob reportedly sold a 20% equity stake through a block deal. The transaction involved 2.08 crore shares, executed at a floor price of Rs 1,030 per share, a 12.8% discount. Following the sale, the promoter group's holding is expected to decrease significantly from 74.97%.",
            "pubDate": "2025-08-21T05:15:15.503330"
        },
        {
            "title": "Bullish Signals: Infosys, Phoenix Mills and 5 other stocks form White Marubozu candles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-signals-infosys-phoenix-mills-and-5-other-stocks-form-white-marubozu-candles/slideshow/123422511.cms",
            "description": "On August 20, seven stocks in the Nifty200 universe appeared on the bullish scanner for the “White Marubozu” pattern, according to StockEdge.com’s technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis, occurring when the opening price is the lowest of the period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers controlled the market from the opening to the closing, often using such patterns to make informed decisions about future price movements.Stocks that formed White Marubozu on August 20:",
            "pubDate": "2025-08-21T05:15:15.503428"
        },
        {
            "title": "JK Cement, Nesco, Fortis Healthcare among 10 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jk-cement-nesco-fortis-healthcare-among-10-stocks-witness-5-year-swing-high-breakout/slideshow/123422375.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, 10 stocks witnessed a 5-year swing high at the close on August 20, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-08-21T05:15:15.503541"
        }
    ]
}