{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-23T08:52:15.819991",
    "items": [
        {
            "title": "IndiGo Q3 profit plunges 75% amid pilot shortage, compensation costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-q3-profit-plunges-75-amid-pilot-shortage-compensation-costs/articleshow/127216011.cms",
            "description": "IndiGo's profit plummeted 75% to ₹549 crore in Q3 due to ₹1,546.5 crore in one-time costs for customer compensation and new labor rule implementation. The airline faced disruptions from pilot shortages and a DGCA investigation found management failures in planning and implementing new rest rules, impacting its growth forecast.",
            "pubDate": "2026-01-23T01:28:02.000202"
        },
        {
            "title": "Softer domestic prices, rising input costs to weigh on steelmakers’ Q3 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/softer-domestic-prices-rising-input-costs-to-weigh-on-steelmakers-q3-earnings/articleshow/127212583.cms",
            "description": "Steel companies anticipate lower profits this quarter. Softening domestic prices and higher input costs are impacting earnings. However, non-ferrous metal producers are set for better results. Strong rebounds in aluminium, zinc, and copper prices are driving this improvement. A new safeguard duty on steel imports is expected to boost prices in the coming months.",
            "pubDate": "2026-01-23T01:28:02.000329"
        },
        {
            "title": "Shriram Finance Q3 Results: PAT falls 29% YoY to Rs 2,522 crore, NII rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shriram-finance-q3-results-pat-falls-29-yoy-to-rs-2522-crore-nii-rises-16/articleshow/127256516.cms",
            "description": "Shriram Finance Q3 results:  Shriram Finance reported a 29% YoY fall in its December quarter standalone net profit at Rs 2,522 crore compared to Rs 3,570 crore reported in the year ago period.",
            "pubDate": "2026-01-23T08:52:15.020240"
        }
    ]
}