{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-12T10:53:58.667944",
    "items": [
        {
            "title": "Oil marketers may gain, producers may drain in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oil-marketers-may-gain-producers-may-drain-in-q3/articleshow/126473299.cms",
            "description": "Oil marketing companies are poised for strong earnings growth in the December quarter, driven by robust refining margins and improved fuel price spreads. Upstream producers, however, face pressure from lower crude oil prices, while city gas distributors are expected to report healthy volumes and expanding margins despite some headwinds.",
            "pubDate": "2026-01-12T00:49:51.481939"
        },
        {
            "title": "TCS to log a steady Q3 amid AI pivot, IT spending trend in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-to-log-a-steady-q3-amid-ai-pivot-it-spending-trend-in-focus/articleshow/126473269.cms",
            "description": "Tata Consultancy Services and HCL Technologies will announce their December quarter results. Both companies are expected to show modest revenue increases. Analysts are watching for management insights on IT budgets for 2026 and the impact of artificial intelligence. Client spending and order pipelines will be crucial indicators for future growth.",
            "pubDate": "2026-01-12T00:49:51.482045"
        },
        {
            "title": "TCS, HCL Tech kick off IT earnings today: Why AI matters more than numbers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-hcl-tech-kick-off-it-earnings-today-why-ai-matters-more-than-numbers/articleshow/126474972.cms",
            "description": "As TCS and HCL Tech report Q3 results, investor focus shifts from numbers to AI's impact. While traditional IT services face headwinds, AI adoption is expected to drive significant growth and business-accretive deals, potentially revitalizing the sector's trajectory through 2026 and beyond.",
            "pubDate": "2026-01-12T04:58:38.715890"
        },
        {
            "title": "TCS Q3 Results: Cons PAT falls 14% YoY to Rs 10,657 crore, but revenue rises 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q3-results-cons-pat-falls-14-yoy-to-rs-10657-crore-but-revenue-rises-5/articleshow/126482009.cms",
            "description": "TCS Q3 Results: Revenue from operations in Q3FY26 rose 5% year-on-year to Rs 67,087 crore, up from Rs 63,973 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2026-01-12T10:53:57.522774"
        }
    ]
}