{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-17T04:55:56.989849",
    "items": [
        {
            "title": "Reliance Industries profit flattens in Q3 on gas output, retail pressures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-profit-flattens-in-q3-on-gas-output-retail-pressures/articleshow/126601775.cms",
            "description": "In the latest quarter, Reliance Industries reported a notable increase in profits, driven primarily by robust performances in their telecom and refining sectors. However, challenges in retail and upstream oil and gas segments put pressure on margins. On a positive note, Jio experienced remarkable growth in its digital services and home broadband offerings.",
            "pubDate": "2026-01-17T04:55:55.182273"
        },
        {
            "title": "Reliance FMCG goes places, retail keeps selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-fmcg-goes-places-retail-keeps-selling/articleshow/126590467.cms",
            "description": "Reliance Consumer Products has secured global rights for four international beauty brands. These include Brylcreem, Toni & Guy, Badedas, and Matey. The company plans to expand these brands globally, including in India. Reliance's FMCG business saw significant growth in sales during the October-December quarter. The company is also expanding its manufacturing network and allocating land for food parks.",
            "pubDate": "2026-01-17T04:55:55.182400"
        },
        {
            "title": "Jio net profit zooms as 5G, broadband link well",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-net-profit-zooms-as-5g-broadband-link-well/articleshow/126589975.cms",
            "description": "Jio Platforms has experienced a remarkable 11.2% surge in profits year-over-year, now totaling ₹7,629 crore. This impressive growth stems from their relentless expansion in 5G services and home broadband solutions. Notably, JioAirFiber has made headlines as the fastest broadband service globally to hit the milestone of 10 million subscribers.",
            "pubDate": "2026-01-17T04:55:55.182506"
        }
    ]
}