{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-18T14:38:15.094126",
    "items": [
        {
            "title": "FIIs pull out over $1 billion from Dalal Street in 5 days of non-stop selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-pull-out-over-1-billion-from-dalal-street-in-5-days-of-non-stop-selling/articleshow/122762597.cms",
            "description": "FIIs have pulled out over Rs 10,000 crore from Indian equities in five days, reversing their three-month buying streak. DIIs remain net buyers. July shows renewed bearishness, with Citi downgrading India to 'neutral' due to high valuations and weaker earnings forecasts. Global concerns continue to pressure Indian markets.",
            "pubDate": "2025-07-18T10:12:01.261205"
        },
        {
            "title": "GMDC shares surge 14% to hit fresh 52-week high. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-shares-surge-14-to-hit-fresh-52-week-high-heres-why/articleshow/122762472.cms",
            "description": "Gujarat Mineral Development Corporation (GMDC) shares soared over 14% to a 52-week high following news of a PMO meeting to address the rare-earth magnet crisis. Concerns over China's export restrictions and potential disruptions to the EV industry have fueled the surge. Despite India's large rare earth reserves, domestic processing is limited, making GMDC's role increasingly significant.",
            "pubDate": "2025-07-18T10:12:01.261330"
        },
        {
            "title": "Mutual Funds boost stakes; 10 stocks rally over 50% in just over 3 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-boost-stakes-10-stocks-rally-over-50-in-just-over-3-months/slideshow/122760791.cms",
            "description": "In the June quarter of FY26, mutual funds significantly increased their stakes in about 179 stocks, each with a market capitalisation above Rs 1,000 crore, according to recent shareholding data. Since mutual funds conduct thorough research before investing, their stock picks often boost investor confidence and attract greater interest from both retail and institutional players.What’s even more noteworthy is that 121 of these stocks have already delivered double-digit returns in just over three months of FY26, showcasing the strong stock-picking abilities of mutual funds. Among them, 10 stocks have surged over 50%, emerging as key winners to watch in FY26. (Data Source: ACE Equity)",
            "pubDate": "2025-07-18T10:12:01.261440"
        },
        {
            "title": "Vedanta-owned Hindustan Zinc Q1 Results: Net profit falls 5% YoY to Rs 2,234 crore; revenue down 4.4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-owned-hindustan-zinc-q1-results-net-profit-falls-5-yoy-to-rs-2234-crore-revenue-down-4-4/articleshow/122759660.cms",
            "description": "Hindustan Zinc's Q1 profit witnessed a dip. The net profit stood at Rs 2,234 crore. This reflects a 4.7% year-on-year decrease. Revenue also saw a fall of 4.4%. Lower volumes and commodity prices impacted the earnings. However, the company maintained a strong EBITDA margin. Expenses were also reduced during the quarter.",
            "pubDate": "2025-07-18T10:12:01.261560"
        },
        {
            "title": "HAL, BDL, Data Patterns shares drop up to 5% as profit booking hits defence stocks for third straight day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-bdl-data-patterns-shares-drop-up-to-5-as-profit-booking-hits-defence-stocks-for-third-straight-day/articleshow/122757373.cms",
            "description": "Indian defence stocks, including HAL and BDL, experienced a downturn on Friday, with shares tumbling up to 5% as investors booked profits after a sustained rally. The Nifty India Defence index declined for the third consecutive session, reflecting a shift in sentiment from optimism to caution.",
            "pubDate": "2025-07-18T10:12:01.261665"
        },
        {
            "title": "CRC Group to invest Rs 1,500 cr to develop ultra-luxury housing project in Greater Noida",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/crc-group-to-invest-rs-1500-cr-to-develop-ultra-luxury-housing-project-in-greater-noida/articleshow/122757279.cms",
            "description": "Realty firm CRC Group will invest around Rs 1,500 crore to develop an ultra-luxury housing project in Greater Noida as part of its expansion plan.",
            "pubDate": "2025-07-18T10:12:01.261765"
        },
        {
            "title": "Godrej Properties buys 48-acre land parcel in Bengaluru, to sell housing plots",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-properties-buys-48-acre-land-parcel-in-bengaluru-to-sell-housing-plots/articleshow/122756654.cms",
            "description": "Realty firm Godrej Properties Ltd has acquired a 48-acre land parcel in Bengaluru and will sell housing plots in this upcoming project.",
            "pubDate": "2025-07-18T10:12:01.261867"
        },
        {
            "title": "Explained: Motherson Sumi, Samvardhana Motherson didn’t crash 32%. Bonus issue explains sharp price drop",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-motherson-sumi-samvardhana-motherson-didnt-crash-32-bonus-issue-explains-sharp-price-drop/articleshow/122753685.cms",
            "description": "Shares of Samvardhana Motherson and Motherson Sumi Wiring appeared to plunge over 30% on July 18, but the sharp fall was due to a 1:2 bonus issue adjustment. The price drop was technical, with no impact on the overall investment value of shareholders.",
            "pubDate": "2025-07-18T10:12:01.261963"
        },
        {
            "title": "Stocks to Buy | Navigating a tough market: Precision over breadth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-navigating-a-tough-market-precision-over-breadth/slideshow/122745512.cms",
            "description": "Siddharth Bothra, in an interview with ET Now, said that the earnings growth over the next two years will be in the early double digits, which is relatively modest. At the same time, valuations across all segments—largecaps, midcaps, and smallcaps—are above their long-term averages. Given this backdrop, the return outlook appears muted. Since the market has already enjoyed a few very strong years, the future will likely be driven more by stock selection and quality-focused investing, rather than broad market gains.",
            "pubDate": "2025-07-18T10:12:01.262153"
        },
        {
            "title": "Newgen Software shares fall over 11% in two days after weak Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/newgen-software-shares-fall-over-11-in-two-days-after-weak-q1-results/articleshow/122744379.cms",
            "description": "Newgen Software's shares faced a decline following unsatisfactory Q1FY26 results. The company's net profit saw a slight increase year-on-year, but a significant drop sequentially. Revenue growth was minimal, impacting operating performance. Key markets like Europe experienced revenue declines. Despite this, analysts predict a potential upside for the stock based on average target price.",
            "pubDate": "2025-07-18T10:12:01.262247"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to gain from overall bullish trend in market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-gain-from-overall-bullish-trend-in-market/articleshow/122744196.cms",
            "description": "Nifty’s pullback to the key 25,000 level has opened a favourable risk-reward window for traders. Analysts suggest deploying a Bull Call Spread strategy to capitalise on the potential upside while keeping risks defined amid broader market strength and global volatility.",
            "pubDate": "2025-07-18T10:12:01.262336"
        },
        {
            "title": "Headwinds, yes, but long-term story intact. 7 stocks from the engineering sector with upside potential from 21 to 42%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/headwinds-yes-but-long-term-story-intact-7-stocks-from-the-engineering-sector-with-upside-potential-from-21-to-42/articleshow/122743434.cms",
            "description": "Many sectors have made some sort of a comeback in the last six years. In the last few quarters, some of them have been facing short-term headwinds. This is not unusual. Why? Because that is how sectoral cycles play out. In such a situation, while it is important to understand the reasons for the headwinds, don’t ignore the fact that some of these sectors have changed structurally, and for good. So, as investors, it is probably time to get these stocks on a watchlist. The reason: Structural improvements are far more important in long-term investing than market sentiment and short-term headwinds. Take the case of engineering and capital goods companies. They faced some issues because of a slowdown in government spending in 2024, and may do so for some more time. A window of opportunity?",
            "pubDate": "2025-07-18T10:12:01.262424"
        },
        {
            "title": "Can YES Bank reclaim Rs 27? Or is a drop below Rs 17 more likely?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-yes-bank-reclaim-rs-27-or-is-a-drop-below-rs-17-more-likely/articleshow/122743767.cms",
            "description": "YES Bank shares: YES Bank’s stock continues to trade within a narrow range, as conflicting technical and fundamental indicators create uncertainty. Its movement—either a breakout above ₹27 or a dip below ₹17—will likely hinge on market sentiment, institutional activity, and the RBI’s decision on SMBC’s pending application.",
            "pubDate": "2025-07-18T10:12:01.262541"
        },
        {
            "title": "Japan's Nikkei ends lower, off 2-week high amid election outcome worries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-off-2-week-high-amid-election-outcome-worries/articleshow/122742076.cms",
            "description": "Japan's Nikkei experienced a slight dip, closing lower at 39,819.11, as investors cautiously awaited the outcome of the upper house election. The decline followed a rise to a two-week high, spurred by Wall Street's strong performance. Advantest and Disco dragged down the index, while SoftBank Group provided support. Strategists are now closely monitoring potential policy shifts following the election results.",
            "pubDate": "2025-07-18T10:12:01.262637"
        },
        {
            "title": "Stocks to Buy | Cautious Optimism: Shibani Sircar Kurian on what will drive market re-rating in FY26?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-cautious-optimism-shibani-sircar-kurian-on-what-will-drive-market-re-rating-in-fy26/slideshow/122741639.cms",
            "description": "Shibani Sircar Kurian in an interview to ET Now said that Indian markets have remained fairly resilient over the past year despite global uncertainties, including trade tariffs and geopolitical tensions. However, she highlights that on a year-to-date basis, India has slightly underperformed compared to other emerging markets. Domestically, macroeconomic and policy indicators have been supportive. In particular, she points to signs of improvement in rural consumption, backed by rising incomes and government measures.",
            "pubDate": "2025-07-18T10:12:01.262730"
        },
        {
            "title": "Talen Energy shares surge 17% on $3.5 billion gas-fired power plant deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/talen-energy-shares-surge-17-on-3-5-billion-gas-fired-power-plant-deals/articleshow/122767426.cms",
            "description": "Shares of Talen Energy jumped more than 15% on Friday in premarket trading, a day after the power producer announced deals worth $3.5 billion to buy two gas-fired plants.",
            "pubDate": "2025-07-18T14:38:08.086939"
        },
        {
            "title": "US stocks open higher as investors weigh data, earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-investors-weigh-data-earnings/articleshow/122767186.cms",
            "description": "Wall Street opened higher on Friday, with investors weighing a week of mixed economic signals and earnings reports, while Netflix's blockbuster profit failed to spark much excitement.",
            "pubDate": "2025-07-18T14:38:08.087061"
        },
        {
            "title": "Gainers & Losers: Axis Bank, GMDC among top 7 stocks that moved D-St on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-axis-bank-gmdc-among-top-7-stocks-that-moved-d-st-on-friday/slideshow/122765142.cms",
            "description": "",
            "pubDate": "2025-07-18T14:38:08.087167"
        },
        {
            "title": "High margin requirements will discourage undue speculation in electricity futures: Sebi Chief Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-margin-requirements-will-discourage-undue-speculation-in-electricity-futures-sebi-chief-pandey/articleshow/122766411.cms",
            "description": "A high initial-margin requirement will discourage \"undue speculation\" in the newly-launched electricity futures segment, Sebi chief Tuhin Kanta Pandey said on Friday.",
            "pubDate": "2025-07-18T14:38:08.087295"
        },
        {
            "title": "Sebi launches Securities Market Hackathon",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-launches-securities-market-hackathon/articleshow/122765876.cms",
            "description": "Markets regulator Sebi in collaboration with BSE, CDSL, NSDL and KFintech has launched a Securities Market Hackathon at Global Fintech Fest 2025.",
            "pubDate": "2025-07-18T14:38:08.087403"
        },
        {
            "title": "Stock Radar: SRF hits record highs in July 2025! Time to book profits or buy the recent dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-srf-hits-record-highs-in-july-2025-time-to-book-profits-or-buy-the-recent-dip/articleshow/122637636.cms",
            "description": "SRF Ltd, after hitting a record high in early July 2025, experienced a slight dip. Technical analysis suggests a potential rebound, as the stock trades within an upward channel and has found support near its lower band. Experts recommend a buy for short-term traders, targeting Rs 3,458 within 1-2 months, citing positive momentum and supportive technical indicators.",
            "pubDate": "2025-07-18T14:38:08.087508"
        },
        {
            "title": "RBI may go for another 25 bps rate cut in August, repo rate to come down at 5.25%: ICICI Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-go-for-another-25-bps-rate-cut-in-august-repo-rate-to-come-down-at-5-25-icici-bank/articleshow/122764891.cms",
            "description": "Reserve Bank of India's Monetary Policy Committee may cut rates in August. ICICI Bank reports a possible 25 bps cut, bringing the rate to 5.25 percent. Rural demand is strong, but urban demand is weak. Inflation is lower than expected. Global economic outlook is uncertain. The U.S. Federal Reserve may cut rates later this year.",
            "pubDate": "2025-07-18T14:38:08.087608"
        }
    ]
}