{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-08T02:41:14.782063",
    "items": [
        {
            "title": "Chiraharit IPO: Moderate GMP signals cautious optimism ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chiraharit-ipo-moderate-gmp-signals-cautious-optimism-ahead-of-listing/articleshow/124374975.cms",
            "description": "Chiraharit's SME IPO closed with decent subscription, driven by retail investors, and will list on October 8. The company, which provides EPC solutions for water and renewable energy, aims to expand its manufacturing capabilities. Analysts anticipate modest listing gains of 5-10% due to a cautious market and small issue size.",
            "pubDate": "2025-10-08T02:40:56.333802"
        },
        {
            "title": "Zelio E-Mobility shares to list today. GMP hints at flattish debut ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zelio-e-mobility-shares-to-list-today-gmp-hints-at-flattish-debut-ahead/articleshow/124374944.cms",
            "description": "Zelio E-Mobility's initial public offering is set for its BSE SME debut on October 8. The IPO closed with moderate investor interest and no grey market premium. The company manufactures electric two and three-wheelers. Its revenue and profit have shown significant growth. The debut is anticipated to be cautious due to subscription levels.",
            "pubDate": "2025-10-08T02:40:56.333913"
        },
        {
            "title": "Positive Breakout: These 11 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-close-cross-above-their-200-dmas/slideshow/124374788.cms",
            "description": "In the Nifty500 pack, 11 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 7, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-08T02:40:56.334021"
        },
        {
            "title": "Sheel Biotech IPO: Healthy GMP and decent subscription signal a steady listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sheel-biotech-ipo-healthy-gmp-and-decent-subscription-signal-a-steady-listing/articleshow/124374905.cms",
            "description": "Sheel Biotech, a leader in agri-biotech solutions, is set for its NSE SME debut on October 8 with a Rs 34 crore IPO. The company, boasting over three decades of experience in tissue culture and organic farming, saw strong investor demand, with its issue subscribed nearly 16 times. Financials show steady growth, and IPO proceeds will fuel expansion.",
            "pubDate": "2025-10-08T02:40:56.334116"
        },
        {
            "title": "Sunsky Logistics IPO: Muted response and GMP hint at flat debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sunsky-logistics-ipo-muted-response-and-gmp-hint-at-flat-debut/articleshow/124374885.cms",
            "description": "Sunsky Logistics is set for its BSE SME debut on October 8 following a modest IPO subscription of 1.46 times, with retail investors showing under-subscription. The grey market shows no premium, indicating muted sentiment. The company, offering multimodal logistics services, raised Rs 16.84 crore and reported sharp financial growth on a small base.",
            "pubDate": "2025-10-08T02:40:56.334219"
        },
        {
            "title": "Infinity Infoway IPO: Massive subscription and GMP driving strong listing buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infinity-infoway-ipo-massive-subscription-and-gmp-driving-strong-listing-buzz/articleshow/124374867.cms",
            "description": "Infinity Infoway's initial public offering is poised for a strong market debut on October 8. The company's Rs 24.42 crore IPO saw overwhelming investor interest, with a subscription rate of 277.24 times. A healthy grey market premium of Rs 45 per share suggests a potential listing price between Rs 195 and Rs 200.",
            "pubDate": "2025-10-08T02:40:56.334314"
        },
        {
            "title": "Munish Forge IPO listing today. GMP suggests cautious debut ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/munish-forge-ipo-listing-today-gmp-suggests-cautious-debut-ahead/articleshow/124374833.cms",
            "description": "Munish Forge's Rs 73.92 crore IPO closed subscribed 3.53 times, with strong participation from QIBs and non-institutional investors. Despite healthy demand, the stock shows no grey market premium, suggesting a flat listing. The company, a key supplier to defence and auto sectors, reported significant profit growth in FY25.",
            "pubDate": "2025-10-08T02:40:56.334405"
        },
        {
            "title": "Wall Street retreats from record closing highs as economic worries mount",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-retreats-from-record-closing-highs-as-economic-worries-mount/articleshow/124374641.cms",
            "description": "Indian markets mirrored global trends as US stocks ended lower on Tuesday. Investors sought clues from secondary data and Federal Reserve officials due to a government shutdown. Consumer sentiment surveys showed declining future expectations and rising inflation projections. Economically sensitive sectors underperformed. Tesla shares dropped, while AMD and IBM saw gains. Bitcoin-related stocks reversed recent advances.",
            "pubDate": "2025-10-08T02:40:56.334519"
        },
        {
            "title": "L&T set for momentum breakout, says Ruchit Jain of Motilal Oswal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-set-for-momentum-breakout-says-ruchit-jain-of-motilal-oswal/videoshow/124363185.cms",
            "description": "“L&T stock is on the verge of a breakout from this consolidation, and recent price volume action has turned bullish as the volumes have been increasing gradually. Traders can buy for a target above 4000 in the next few weeks,” Ruchit Jayantilal Jain, VP, Head – Equity Technical Research at Motilal Oswal Financial Services Limited, said.",
            "pubDate": "2025-10-08T02:40:56.334616"
        },
        {
            "title": "Asian stocks slip at open, gold close to $4,000",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-slip-at-open-gold-close-to-4000/articleshow/124374440.cms",
            "description": "Asian equities experienced a modest decline, mirroring Wall Street's retreat from record highs due to concerns about an overheated market. Technology shares were among the decliners, with a US-listed Chinese shares index falling significantly. The yen also weakened against the dollar, influenced by a leadership change in Japan's ruling party.",
            "pubDate": "2025-10-08T02:40:56.334707"
        },
        {
            "title": "Banks to seek competing bid for Rs 729-cr Sahara Star Hotel debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-to-seek-competing-bid-for-rs-729-cr-sahara-star-hotel-debt/articleshow/124374373.cms",
            "description": "Banks are seeking higher offers for the Sahara Star Hotel's debt. Union Bank of India leads the process. JC Flowers ARC had previously offered ₹279 crore for the ₹729 crore debt. Banks aim for a minimum bid of ₹293 crore. The hotel is a valuable property with full security for the loans. An auction is expected soon.",
            "pubDate": "2025-10-08T02:40:56.334802"
        },
        {
            "title": "RBI in no hurry to launch digital currency: T Rabi Shankar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-in-no-hurry-to-launch-digital-currency-t-rabi-shankar/articleshow/124374358.cms",
            "description": "The Reserve Bank of India has no immediate plans for a nationwide CBDC launch, prioritizing cross-border arrangements and pilot projects for specific use cases like subsidy schemes. Deputy Governor T Rabi Shankar indicated that progress has slowed compared to previous years, emphasizing the need for international coordination.",
            "pubDate": "2025-10-08T02:40:56.334892"
        },
        {
            "title": "'Deposit tokenisation' pilot to be set in motion on October 8",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/deposit-tokenisation-pilot-to-be-set-in-motion-on-october-8/articleshow/124374307.cms",
            "description": "The Reserve Bank of India will start a deposit tokenisation pilot on October 8. This initiative will create digital representations of assets like deposits. The pilot will use the wholesale segment of its central bank digital currency. Several banks are collaborating on this project. Tokenisation aims to make transactions faster, cheaper, and safer.",
            "pubDate": "2025-10-08T02:40:56.334980"
        },
        {
            "title": "Ex-IndusInd banker traded on Kesoram-UltraTech deal info",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ex-indusind-banker-traded-on-kesoram-ultratech-deal-info/articleshow/124374285.cms",
            "description": "A former IndusInd Bank official's wife traded Kesoram Industries shares after learning of acquisition talks. She profited significantly. The official also traded other company shares through family members, earning over ₹32 crore. He shared this information with colleagues. The bank is investigating and cooperating with SEBI. This comes after previous accounting irregularities at IndusInd Bank.",
            "pubDate": "2025-10-08T02:40:56.335078"
        },
        {
            "title": "GIFT Nifty down 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124367744.cms",
            "description": "Nifty closed slightly higher on Tuesday as markets reacted to pre-quarterly business updates ahead of the Q2FY26 results season. Analysts anticipate Indian equities to trade within a range, with stock-specific movements driven by sectoral developments and upcoming earnings. The India VIX saw a slight decrease, indicating reduced market fear.",
            "pubDate": "2025-10-08T02:40:56.335171"
        },
        {
            "title": "Dotcom fears rise with tech stocks seeing $100-billion swings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dotcom-fears-rise-with-tech-stocks-seeing-100-billion-swings/articleshow/124374248.cms",
            "description": "Wall Street professionals are increasingly concerned about the rapid, massive gains in tech stocks, fueled by OpenAI's expansion and deals with companies like AMD and Oracle. These dramatic market value increases, reminiscent of the dot-com era, are raising fears of an unhealthy bubble and a potential market crash.",
            "pubDate": "2025-10-08T02:40:56.335260"
        }
    ]
}