{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-14T19:52:39.301469",
    "items": [
        {
            "title": "Ashok Leyland Q1 Results: Net profit jumps 13% to Rs 594 crore; revenue up 1.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ashok-leyland-q1-results-net-profit-jumps-13-to-rs-594-crore-revenue-up-1-5/articleshow/123299953.cms",
            "description": "Ashok Leyland posted a standalone net profit of Rs 593.73 crore for Q1 FY26, up 13% YoY, on revenue of Rs 8,724.51 crore, a 1.5% rise. Consolidated net profit attributable to owners rose 20% YoY to Rs 611.07 crore. The company saw record Q1 commercial vehicle volumes, improved margins, and strong contributions from core and export businesses.",
            "pubDate": "2025-08-14T09:11:00.032308"
        },
        {
            "title": "Vodafone Idea Q1 Results: Cons loss widens YoY to Rs 6,608 crore, revenue up 5%; ARPU at Rs 177",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vodafone-idea-q1-results-cons-loss-widens-yoy-to-rs-6608-crore-revenue-up-5-arpu-at-rs-177/articleshow/123305727.cms",
            "description": "Vodafone Idea Q1 Results: Vodafone Idea widened its net losses to Rs 6,608 crore in the June ended quarter versus Rs 6,432 crore reported in the year ago period. The revenue from operations increased 5% to Rs 11,023 crore in Q1FY25 compared to Rs 10,508 crore reported in the corresponding quarter if the last financial year.",
            "pubDate": "2025-08-14T14:23:05.535391"
        },
        {
            "title": "Nuvama Wealth Q1 Results: Profit grows 19% to Rs 264 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nuvama-wealth-q1-results-profit-grows-19-to-rs-264-crore/articleshow/123305539.cms",
            "description": "Nuvama Wealth Management on Thursday said its consolidated profit after tax (PAT) rose 19 per cent to Rs 264 crore in the April-June period of the current fiscal.",
            "pubDate": "2025-08-14T14:23:05.535520"
        },
        {
            "title": "Inox Wind Q1 Results: Profit more than doubles to Rs 97 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/inox-wind-q1-results-profit-more-than-doubles-to-rs-97-crore/articleshow/123305097.cms",
            "description": "Inox Wind's consolidated net profit more than doubled to Rs 97.34 crore in the June quarter compared to the year-ago period, mainly due to higher revenues.",
            "pubDate": "2025-08-14T14:23:05.535629"
        },
        {
            "title": "Spandana Sphoorty posts Rs 360 crore Q1 loss on bad loan impact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spandana-sphoorty-posts-rs-360-crore-q1-loss-on-bad-loan-impact/articleshow/123308469.cms",
            "description": "Microfinance company Spandana Sphoorty Financial suffered a consolidated net loss of Rs 360 crore in the first quarter of the fiscal, making it the fourth consecutive quarterly loss, on account of high asset quality stress and drop in business volume as well as income.",
            "pubDate": "2025-08-14T19:52:37.755907"
        },
        {
            "title": "Indian Oil's Q1 profit more than doubles to Rs 5,689 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-oils-q1-profit-more-than-doubles-to-rs-5689-crore/articleshow/123308428.cms",
            "description": "Indian Oil reported doubling of net profit to Rs 5,689 crore in the June quarter from Rs 2,643 crore a year earlier buoyed by robust marketing margins.",
            "pubDate": "2025-08-14T19:52:37.756031"
        },
        {
            "title": "Hindustan Copper consolidated net profit rises 18% to Rs 134.28 crore in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindustan-copper-consolidated-net-profit-rises-18-to-rs-134-28-crore-in-q1/articleshow/123308217.cms",
            "description": "Hindustan Copper Limited (HCL) has reported an 18% y-o-y rise in consolidated net profit to Rs 134.28 crore for the first quarter of the current financial year. Consolidated total income rose 5% to Rs 526.65 crore. The higher profit is on account of expenses remaining flat at Rs 347.29 crore.",
            "pubDate": "2025-08-14T19:52:37.756132"
        }
    ]
}