{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-28T13:37:09.496878",
    "items": [
        {
            "title": "Asian stocks mixed; dollar weakens before Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-dollar-weakens-before-fed-rate-decision/articleshow/127665577.cms",
            "description": "Asian currencies strengthened as the dollar weakened to a four-year low, driven by investor caution over unpredictable US policymaking. The dollar's decline accelerated after President Trump expressed indifference to its fall, fueling speculation about coordinated intervention. This backdrop precedes the Fed's interest-rate decision and a crucial week for megacap tech earnings.",
            "pubDate": "2026-01-28T01:41:25.422244"
        },
        {
            "title": "Stocks in news: Vodafone Idea, Hindustan Zinc, Vedanta, Marico, Vishal Mega Mart, Maruti and L&T",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vodafone-idea-hindustan-zinc-vedanta-marico-vishal-mega-mart-maruti-and-lt/articleshow/127638166.cms",
            "description": "Indian benchmark indices closed mixed on Tuesday, with the Nifty gaining on financial, IT, and metal stocks while the Sensex saw pressure from auto and FMCG. Several companies like Vodafone Idea, Vedanta, Marico, and Maruti Suzuki are in focus today due to their recent financial results and corporate actions.",
            "pubDate": "2026-01-28T01:41:25.422351"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127638401.cms",
            "description": "Indian stock indices Nifty and Sensex closed higher on Tuesday, driven by gains in financials, IT, and metals, despite selling in auto and FMCG sectors. The Nifty experienced a 300-point swing during the monthly expiry session. Analysts suggest a 'sell-on-rise' strategy until Nifty decisively breaks above 25,500.",
            "pubDate": "2026-01-28T01:41:25.422538"
        },
        {
            "title": "Auto companies fall on fear of more EU imports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-companies-fall-on-fear-of-more-eu-imports/articleshow/127663821.cms",
            "description": "Indian auto stocks experienced a decline following reports of potential tariff reductions on EU-imported vehicles as part of a free trade agreement. While some manufacturers like Mahindra & Mahindra and Hyundai saw sharper drops due to their presence in higher-priced segments, analysts believe the near-term impact will be limited, with the luxury segment being the primary area affected.",
            "pubDate": "2026-01-28T01:41:25.422633"
        },
        {
            "title": "RBI, European body ink MoU to end clearing house standoff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-european-body-ink-mou-to-end-clearing-house-standoff/articleshow/127663698.cms",
            "description": "The Reserve Bank of India and the European Securities and Markets Authority have signed a memorandum of understanding, resolving a two-year dispute over supervisory oversight of India's central clearing agencies. This agreement facilitates cooperation and information exchange, paving the way for European recognition of Indian clearing houses and potentially enhancing European access to India's financial markets.",
            "pubDate": "2026-01-28T01:41:25.422729"
        },
        {
            "title": "Shapoorji Pallonji Group looks to raise up to $2.5 billion to refinance debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shapoorji-pallonji-group-looks-to-raise-up-to-2-5-billion-to-refinance-debt/articleshow/127664250.cms",
            "description": "The proposed fundraise will be used to refinance a dollar bond backed by shares of Tata Sons, held through group entity Goswami Infratech, due to mature in April. The new transaction is expected to mirror the structure of the earlier deal, with Tata Sons shares continuing as collateral.",
            "pubDate": "2026-01-28T01:41:25.422936"
        },
        {
            "title": "RBI's 'core company' tag puts many promoter entities in a quandary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbis-core-company-tag-puts-many-promoter-entities-in-a-quandary/articleshow/127664159.cms",
            "description": "Corporate entities are navigating a fresh mandate from the Reserve Bank of India, which has reclassified holding and strategic investment firms as Core Investment Companies. This new label comes with a wave of rigorous regulations that many corporations are eager to sidestep, arguing that their revenue streams stem from non-financial sectors rather than financial endeavors.",
            "pubDate": "2026-01-28T01:41:25.423026"
        },
        {
            "title": "PSBs shun low yields, high costs to protect margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psbs-shun-low-yields-high-costs-to-protect-margins/articleshow/127664103.cms",
            "description": "Seven out of eight public sector banks that released quarterly results so far held on to or improved margins from the previous three months, helping them maintain profitability despite a challenging macro environment.",
            "pubDate": "2026-01-28T01:41:25.423118"
        },
        {
            "title": "RBI dividend may rise to Rs 3L-cr in FY27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-dividend-may-rise-to-rs-3l-cr-in-fy27/articleshow/127664025.cms",
            "description": "Estimates broadly peg the dividend to be around ₹3 lakh crore, compared with ₹2.7 lakh crore last year. RBI dividends have provided a significant boost to the government's non-tax revenues in recent years.",
            "pubDate": "2026-01-28T01:41:25.423301"
        },
        {
            "title": "Credit card spends bounce back in Dec, numbers also rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-card-spends-bounce-back-in-dec-numbers-also-rise/articleshow/127663073.cms",
            "description": "Credit card usage in Mumbai saw an 8% rebound last month, reaching ₹2.05 lakh crore due to seasonal demand and year-end spending. Net new card additions hit a three-month high of over 900,000, boosting the total active cards to 115.7 million. Analysts anticipate steady spending momentum, supported by ongoing consumption trends and festive demand.",
            "pubDate": "2026-01-28T01:41:25.423481"
        },
        {
            "title": "South Korea's KOSPI posts sharpest rise in 3 weeks as investors buy the Trump tariff dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-koreas-kospi-posts-sharpest-rise-in-3-weeks-as-investors-buy-the-trump-tariff-dip/articleshow/127672149.cms",
            "description": "South Korean stocks saw a significant jump on Tuesday. This surge was powered by a strong rally in technology shares, boosted by global demand for artificial intelligence. The market shrugged off a threat from US President Donald Trump to increase tariffs on Korean goods. Chipmakers Samsung Electronics and SK Hynix led the gains. Automakers also recovered from initial dips.",
            "pubDate": "2026-01-28T03:24:15.928011"
        },
        {
            "title": "Indonesian stocks tumble 7% after MSCI applies interim freeze on investability risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indonesian-stocks-tumble-7-after-msci-applies-interim-freeze-on-investability-risks/articleshow/127671983.cms",
            "description": "Indonesia's stock market experienced a sharp 7% drop early Wednesday after MSCI announced a freeze on certain index changes. This decision stems from investor concerns regarding free float data transparency. Indonesian authorities are actively engaged in discussions with MSCI to resolve these issues, aiming to restore market confidence.",
            "pubDate": "2026-01-28T03:24:15.928169"
        },
        {
            "title": "Axis Bank among 4 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-among-4-nifty-stocks-showing-bullish-rsi-upswing/slideshow/127671815.cms",
            "description": "On January 27, in the Nifty50 pack, four stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI has crossed 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2026-01-28T03:24:15.928283"
        },
        {
            "title": "Vedanta, Hindustan Zinc shares in focus after OFS announcement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-hindustan-zinc-shares-in-focus-after-ofs-announcement/articleshow/127671964.cms",
            "description": "Vedanta and Hindustan Zinc are in focus after Vedanta approved an Offer for Sale of up to 1.59% stake in Hindustan Zinc at a floor price of Rs 685 per share. Elevated RSI levels suggest strong momentum but raise near-term caution amid potential consolidation.",
            "pubDate": "2026-01-28T03:24:15.928380"
        },
        {
            "title": "India’s $360 billion stock rout raises stakes for Modi’s Budget",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-360-billion-stock-rout-raises-stakes-for-modis-budget/articleshow/127669894.cms",
            "description": "Indian stocks face their worst year start in a decade. Investors await the upcoming budget for economic growth catalysts. The government may boost defense spending and speed up state-run company share sales. Attention is on measures to stimulate consumption and domestic manufacturing. Specific sectors like defense, roads, and railways are expected to see increased allocations.",
            "pubDate": "2026-01-28T03:24:15.928483"
        },
        {
            "title": "Stocks to buy in 2026 for long term: Radico Khaitan, Axis Bank among 5 stocks that could give 10-40% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-for-long-term-radico-khaitan-axis-bank-among-5-stocks-that-could-give-10-40-return/slideshow/127669727.cms",
            "description": "Brokerage firms remain positive on a mix of consumption, banking and energy stocks, highlighting selective opportunities across sectorsWe have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-28T03:24:15.928603"
        },
        {
            "title": "Zensar Technologies, IIFL Finance among 7 stocks going ex-dividend. Last day to buy today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zensar-technologies-iifl-finance-among-7-stocks-going-ex-dividend-last-day-to-buy-today/articleshow/127669468.cms",
            "description": "Investors have a final chance today, January 28, 2026, to buy shares of Zensar Technologies and IIFL Finance to be eligible for their declared interim dividends. Zensar Technologies offers Rs 2.4 per share, while IIFL Finance provides Rs 4 per share. Several other companies also have ex-dividend dates on January 29, 2026.",
            "pubDate": "2026-01-28T03:24:15.928700"
        },
        {
            "title": "Positive Breakout: These 13 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-13-stocks-cross-above-their-200-dmas/slideshow/127668774.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1000 crore, 13 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on January 27, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2026-01-28T03:24:15.928791"
        },
        {
            "title": "Hindustan Copper shares rally 15% in 2 days. What's behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-rally-15-in-2-days-whats-behind-the-surge/articleshow/127679391.cms",
            "description": "Hindustan Copper shares surged nearly 15% in two sessions after the state-owned miner emerged as the preferred bidder for a new copper block in Madhya Pradesh, reinforcing investor optimism amid a strong global metals rally and bullish technical signals.",
            "pubDate": "2026-01-28T05:35:11.575864"
        },
        {
            "title": "Tata Consumer Products shares tumble 5% after Q3. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-consumer-products-shares-tumble-5-after-q3-what-should-investors-do/articleshow/127677338.cms",
            "description": "Tata Consumer Products shares dropped significantly on Wednesday. This occurred even as the company reported a 38% year-on-year profit jump and 15% revenue increase for the December quarter. Analysts from Morgan Stanley, Motilal Oswal, and JM Financial provided their views on the stock. Their recommendations range from Overweight to Buy and ADD, with varying price targets.",
            "pubDate": "2026-01-28T05:35:11.575982"
        },
        {
            "title": "Jefferies picks 10 stocks that could benefit from possible Budget 2026 announcements. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-picks-10-stocks-that-could-benefit-from-possible-budget-2026-announcements-do-you-own-any/slideshow/127675120.cms",
            "description": "Budget expectations from the upcoming FY27 Union Budget remain “low”, with Jefferies noting that Finance Minister Nirmala Sitharaman is likely to adhere to the fiscal consolidation roadmap while focusing on defence-led capital expenditure and selective measures to support consumption. The brokerage expects the Centre to set the FY27 fiscal deficit at around 4.2% of GDP, which would imply a slower pace of consolidation of roughly 15–20 basis points annually over FY27–FY31. Alternatively, Jefferies said the government could choose to keep the deficit closer to 4.4% of GDP, signalling a push to support near-term growth. Such a stance would be positive for growth and equities but could lead to firmer bond yields. Here are few stocks that could benefit from the upcoming Budget.",
            "pubDate": "2026-01-28T05:35:11.576108"
        },
        {
            "title": "ITC Q3 results preview: Revenue to grow up to 8.4% YoY on cigarette volume growth. 6 things to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-q3-results-preview-revenue-to-grow-up-to-8-4-yoy-on-cigarette-volume-growth-6-things-to-watch/articleshow/127676779.cms",
            "description": "ITC is expected to report moderate revenue and profit growth in Q3, supported by cigarette volume recovery and margin expansion. However, brokerages remain divided on profit estimates amid concerns over pricing pressures and potential cigarette tax hikes.",
            "pubDate": "2026-01-28T05:35:11.576214"
        },
        {
            "title": "Budget & the Stock Market: The ‘policy risk’ number in the budget that the market tends to ignore – but should not",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-the-stock-market-the-policy-risk-number-in-the-budget-that-the-market-tends-to-ignore-but-should-not/articleshow/127675892.cms",
            "description": "This is the number in the Union Budget that the market does not often focus on, but one which influences fiscal outcomes, inflation outcomes, and, therefore, market discount rates. For investors, it is important to remember that this number reveals “policy risk” much before it shows up later through the Revised Estimates, supplementary demands, or re-prioritisation within the revenue account.",
            "pubDate": "2026-01-28T05:35:11.576316"
        },
        {
            "title": "Reliance's EU exports in limbo as Russian crude rules sow confusion: Nomura",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliances-eu-exports-in-limbo-as-russian-crude-rules-sow-confusion-nomura/articleshow/127675917.cms",
            "description": "Reliance’s refined product exports to Europe face rising uncertainty as EU rules on Russian crude create compliance confusion. Tanker diversions and inconsistent enforcement across member states add pressure, while limited Venezuelan crude supplies complicate India’s shift away from Russian oil. RIL shares have fallen amid these concerns.",
            "pubDate": "2026-01-28T05:35:11.576420"
        },
        {
            "title": "MCX shares soar 14% in 2 sessions. What's triggering the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-soar-14-in-2-sessions-whats-triggering-the-rally/articleshow/127675068.cms",
            "description": "Multi Commodity Exchange of India (MCX) shares surged 7.5% after reporting a massive 151% year-on-year jump in consolidated net profit to Rs 401 crore for Q3FY26. Revenue from operations also saw a robust 121% YoY increase to Rs 666 crore, driven by significant growth in trading activity and new product launches.",
            "pubDate": "2026-01-28T05:35:11.576514"
        },
        {
            "title": "Rs 3 lakh crore added! Sensex rises over 600 pts, Nifty tops 25,350; India-EU trade pact among key factors behind today's rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-rising-today-rs-3-lakh-crore-added-sensex-jumps-over-600-pts-nifty-tops-25350-india-eu-trade-pact-among-key-factors-behind-todays-rally/articleshow/127674297.cms",
            "description": "Indian equities surged to record highs on Wednesday, driven by a landmark trade agreement between India and the European Union. The pact, which significantly lowers tariffs on most goods, boosted investor confidence and amplified gains from a supportive global backdrop. This optimism added Rs 2.9 lakh crore to investor wealth.",
            "pubDate": "2026-01-28T05:35:11.576607"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains bullish on CG Power; Goldman Sachs upgrades earnings outlook for Tata Consumer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-bullish-on-cg-power-goldman-sachs-upgrades-earnings-outlook-for-tata-consumer/articleshow/127674730.cms",
            "description": "Leading brokerages have turned bullish on select industrial and consumer stocks. Morgan Stanley remains positive on CG Power, Goldman Sachs upgrades Tata Consumer earnings outlook, while Motilal Oswal sees a strong recovery at Raymond Lifestyle driven by improving fundamentals.",
            "pubDate": "2026-01-28T05:35:11.576704"
        },
        {
            "title": "Is Budget day overrated? What 15 years of Nifty data reveals about post-Budget trades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-budget-day-overrated-what-15-years-of-nifty-data-reveals-about-post-budget-trades/articleshow/127673815.cms",
            "description": "Historical Nifty data reveals that investors often miss opportunities by focusing on Budget Day theatrics. The average Budget Day move is minimal, with significant returns typically observed in the week following the event, suggesting patience and waiting for policy clarity is a more profitable strategy.",
            "pubDate": "2026-01-28T05:35:11.576794"
        },
        {
            "title": "Asian Paints shares tank nearly 7% after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-shares-in-focus-as-q3-profit-slips-nearly-5-yoy-should-buy-sell-or-hold/articleshow/127673655.cms",
            "description": "Asian Paints shares dropped significantly after reporting a nearly 5% year-on-year profit decline for the December quarter. While sales saw a modest rise, analysts remain divided. Citi reiterates a 'Sell' rating, citing weak demand, while Morgan Stanley maintains 'Underweight' due to growth misses. Nomura, however, holds a 'Buy' rating, believing competitive pressures are easing.",
            "pubDate": "2026-01-28T05:35:11.576888"
        },
        {
            "title": "A $1.7 trillion rally pushes Korea’s market cap above Germany’s",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-1-7-trillion-rally-pushes-koreas-market-cap-above-germanys/articleshow/127673536.cms",
            "description": "South Korea has overtaken Germany in stock market capitalisation, fuelled by a powerful rally in technology stocks tied to the global AI and robotics boom. Market value has surged to $3.25 trillion after adding $1.7 trillion since early 2025, lifting Korea to the world’s 10th-largest equity market, supported by reforms and strong index performance.",
            "pubDate": "2026-01-28T05:35:11.576980"
        },
        {
            "title": "Data Patterns among 5 stocks that closed above VWAP, signalling bullish shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/data-patterns-among-5-stocks-that-closed-above-vwap-signalling-bullish-shift/slideshow/127673327.cms",
            "description": "On January 27, the closing prices of five stocks in the Nifty500 pack rallied over 2.5% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2026-01-28T05:35:11.577097"
        },
        {
            "title": "Aegis Vopak Terminals among three stocks flashing bullish signals; possible uptrend ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aegis-vopak-terminals-among-three-stocks-flashing-bullish-signals-possible-uptrend-ahead/slideshow/127673200.cms",
            "description": "On January 27, three stocks from the Nifty 500 pack appeared on the bullish “White Marubozu” scanner, according to StockEdge’s technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis that forms when the opening price is the lowest and the closing price is the highest for a given session.Represented by a long white (or green) candlestick with no upper shadow and a small or negligible lower shadow, the pattern signals strong buying pressure throughout the session. Traders often interpret it as an indication that buyers remained in control from open to close, using it to gauge potential future price movements.",
            "pubDate": "2026-01-28T05:35:11.577193"
        },
        {
            "title": "Vodafone Idea shares gain over 1% as Q3FY26 losses narrow, ARPU improves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-as-q3-losses-narrow-arpu-improves/articleshow/127673054.cms",
            "description": "Vodafone Idea shares rose after the telecom operator reported a sharper-than-last-year reduction in consolidated losses for the December quarter (Q3FY26). The company also saw a steady improvement in operating metrics, with ARPU rising 7.3% year-on-year, driven by customer upgrades.",
            "pubDate": "2026-01-28T05:35:11.577285"
        },
        {
            "title": "Shadowfax Technologies shares list at 9% discount to IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shadowfax-technologies-shares-to-list-today-gmp-signals-lukewarm-debut/articleshow/127672953.cms",
            "description": "Shadowfax Technologies shares began trading on Dalal Street at a discount. The company's IPO saw subdued demand, with grey market premiums turning negative. Institutional investors showed more interest than retail and non-institutional investors. Proceeds will fund expansion and operational scaling. The company operates in e-commerce and hyperlocal delivery.",
            "pubDate": "2026-01-28T05:35:11.577377"
        },
        {
            "title": "Oil India shares jump nearly 10%, extend gains for second session. What’s behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-india-shares-jump-nearly-10-extend-gains-for-second-session-whats-behind-the-surge/articleshow/127681076.cms",
            "description": "Oil India shares saw a significant jump on Wednesday. This rise followed a sharp increase in global crude oil prices, reaching a four-month peak. Geopolitical tensions, including concerns over US-Iran and Russia-Ukraine conflicts, along with supply disruptions, fueled the market sentiment. Analysts suggest a positive technical outlook for the stock.",
            "pubDate": "2026-01-28T06:23:48.848385"
        },
        {
            "title": "ONGC shares jump 6% after JV signs shipbuilding deal with Samsung Heavy Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-shares-jump-6-after-jv-signs-shipbuilding-deal-with-samsung-heavy-industries/articleshow/127680771.cms",
            "description": "ONGC shares rose nearly 6% after its joint venture with Mitsui O.S.K. Lines signed shipbuilding contracts with Samsung Heavy Industries for two ethane carriers, strengthening energy logistics for OPaL and reinforcing bullish valuation and technical indicators.",
            "pubDate": "2026-01-28T06:23:48.848492"
        },
        {
            "title": "Suzlon Energy shares rally over 3% after securing 248.85 MW wind order from ArcelorMittal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-shares-rally-over-3-after-securing-248-85-mw-wind-order-from-arcelormittal/articleshow/127680664.cms",
            "description": "Suzlon Energy shares climbed over 3% after the company secured a 248.85 MW wind power order from ArcelorMittal. The deal strengthens Suzlon’s green steel portfolio and reinforces its leadership in Gujarat’s wind energy market.",
            "pubDate": "2026-01-28T06:23:48.848713"
        },
        {
            "title": "CarTrade Tech shares slide 11% as investors look past Q3 revenue growth,  margin expansion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cartrade-tech-shares-slide-11-as-investors-look-past-q3-revenue-growth-margin-expansion/articleshow/127684831.cms",
            "description": "CarTrade Tech shares slid sharply after the company reported strong December-quarter profit growth and a significant expansion in margins, with investors focusing instead on a slowdown in revenue growth compared with the prior quarter.",
            "pubDate": "2026-01-28T06:57:12.797362"
        },
        {
            "title": "Shadowfax Technologies shares gain 6% after weak debut at 9% discount. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shadowfax-technologies-shares-gain-6-after-weak-debut-at-9-discount-should-you-buy-sell-or-hold/articleshow/127683218.cms",
            "description": "Shadowfax Technologies shares rebounded 6% to Rs 119.5 after a discounted listing at Rs 124. The IPO saw a 2.8x subscription, with institutional investors driving demand. Analysts advise caution for fresh investors, recommending a hold for allottees with strict stop losses due to valuation concerns.",
            "pubDate": "2026-01-28T06:57:12.797509"
        },
        {
            "title": "BEL, HAL, GRSE, other defence stocks rally up to 11% ahead of Union Budget 2026. Brokerages weigh in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-hal-grse-other-defence-stocks-rally-up-to-11-ahead-of-union-budget-2026-brokerages-weigh-in/articleshow/127687573.cms",
            "description": "Brokerage commentary suggests that while the overall fiscal stance is likely to remain disciplined, the composition of government spending could shift meaningfully. Jefferies expects total government capital expenditure to grow by about 12% in FY27 to Rs 12.5 lakh crore, but flags that defence capex may grow much faster—by as much as 25%.",
            "pubDate": "2026-01-28T08:24:22.777681"
        },
        {
            "title": "Shriram Finance shares nearly double in a year. Will the stock sustain its strong momentum?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-shares-nearly-double-in-a-year-will-the-stock-sustain-its-strong-momentum/articleshow/127687326.cms",
            "description": "Shriram Finance shares have nearly doubled in a year, driven by strong AUM growth, improving margins and MUFG’s strategic investment. Analysts remain positive on fundamentals but warn of near-term consolidation as momentum indicators signal overbought levels.",
            "pubDate": "2026-01-28T08:24:22.777817"
        },
        {
            "title": "BEL shares rally 10%, hit 52-week high as Q3 net profit rises 21% to Rs 1,580 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-rally-10-hit-52-week-high-as-q3-net-profit-rises-21-to-rs-1580-crore/articleshow/127694571.cms",
            "description": "Bharat Electronics Ltd. shares surged to a 52-week high following robust December quarter results. The defence major reported a 21% year-on-year jump in net profit to Rs 1,580 crore and a 24% revenue increase to Rs 7,154 crore. This strong performance, driven by defence indigenisation and a growing order book, signals continued momentum for BEL.",
            "pubDate": "2026-01-28T09:54:52.760268"
        },
        {
            "title": "Adani Electricity Mumbai secures sovereign-grade rating after years of deleveraging",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-electricity-mumbai-secures-sovereign-grade-rating-after-years-of-deleveraging/articleshow/127693933.cms",
            "description": "Adani Electricity Mumbai has secured a AAA credit rating from India Ratings, placing the private utility on par with India’s sovereign credit profile. The upgrade reflects regulatory support, declining leverage and improved operating performance following a turnaround since its acquisition in 2018.",
            "pubDate": "2026-01-28T09:54:52.760375"
        },
        {
            "title": "European shares pause after two-day rally; ASML bucks weakness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-pause-after-two-day-rally-asml-bucks-weakness/articleshow/127693587.cms",
            "description": "European shares took a breather on Wednesday after two consecutive days of gains ‌as ‌investors parsed through a string of earnings updates and executive commentary, ‌while ASML hit a record high.",
            "pubDate": "2026-01-28T09:54:52.760471"
        },
        {
            "title": "Japan's Nikkei escapes losses as tech share gains offset drag from strong yen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-escapes-losses-as-tech-share-gains-offset-drag-from-strong-yen/articleshow/127693449.cms",
            "description": "Japan's Nikkei ‍share average ended slightly ​higher on Wednesday, buoyed in the final half-hour ⁠of trade by stronger-than-expected orders at Dutch chip equipment maker ASML.",
            "pubDate": "2026-01-28T09:54:52.760569"
        },
        {
            "title": "APL Apollo Tubes stock breaks out from rounding bottom pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apl-apollo-tubes-stock-breaks-out-from-rounding-bottom-pattern-time-to-buy/articleshow/127615145.cms",
            "description": "APL Apollo Tubes stock has surged to new record highs after breaking out of a rounding bottom pattern. Experts recommend buying the stock for potential gains in the coming weeks. The company's stock has shown strong performance, trading above key moving averages. This technical breakout signals a positive medium-term outlook for the iron and steel product company.",
            "pubDate": "2026-01-28T11:57:30.208894"
        },
        {
            "title": "MFs trim stakes in 11 smallcap stocks over two quarters; shares tumble up to 55%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mfs-trim-stakes-in-11-smallcap-stocks-over-two-quarters-shares-tumble-up-to-55/slideshow/127703087.cms",
            "description": "Mutual funds (MFs) have reduced their exposure to nearly 148 smallcap stocks across two consecutive quarters, September 2025 and December 2025. Of these, 100 stocks have declined by more than 10% over the past six months, with 11 notable laggards witnessing steep price erosion of 40% to 55% during the same period. (Data source: ACE Equity)",
            "pubDate": "2026-01-28T11:57:30.209016"
        },
        {
            "title": "ET Prime Special Series: Multibagger or IBC - Part 44: This auto ancillary is testing the EV space, will it be able to make it?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-prime-special-series-multibagger-or-ibc-part-44-this-auto-ancillary-is-testing-the-ev-space-will-it-be-able-to-make-it/articleshow/127698751.cms",
            "description": "This company’s evolution reflects a long, incremental build rather than a sharp strategic pivot. Today, the revenues are largely generated within India from a few concentrated customers. Alongside, the company has initiated its entry into electric mobility through a subsidiary. This includes the launch of electric two-wheeler products aimed at the domestic market. These EV efforts sit outside the main manufacturing engine and are not yet material to earnings. Taken together, it suggests a company focused on protecting its core while building for an industry that is changing gradually rather than abruptly.",
            "pubDate": "2026-01-28T11:57:30.209118"
        },
        {
            "title": "Hindustan Zinc OFS sees strong demand, non-retail portion subscribed 1.42 times on Day 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-ofs-sees-strong-demand-non-retail-portion-subscribed-1-42-times-on-day-1/articleshow/127707420.cms",
            "description": "Hindustan Zinc’s OFS drew strong institutional interest, with the non-retail portion subscribed 142%. Vedanta’s discounted stake sale reassured markets, lifted stock prices, and reinforced confidence in Hindustan Zinc’s cash flows, scale, dividends, and long-term investment appeal.",
            "pubDate": "2026-01-28T13:37:01.040395"
        },
        {
            "title": "S&P Global upgrades Biocon Biologics ratings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-global-upgrades-biocon-biologics-ratings/articleshow/127706881.cms",
            "description": "S&P Global Ratings on Wednesday upgraded Biocon Biologics ratings with a stable outlook.",
            "pubDate": "2026-01-28T13:37:01.040534"
        },
        {
            "title": "8 midcapcap stocks post 50%+ EBITDA growth in December quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-midcapcap-stocks-post-50-ebitda-growth-in-december-quarter/slideshow/127706767.cms",
            "description": "Quarterly EBITDA growth indicates higher earnings before interest, taxes, depreciation, and amortisation, reflecting improved profitability and operational efficiency. Within the NSE mid-cap segment, eight stocks have reported EBITDA growth of over 50% in the December ’25 quarter (based on Q3 results announced so far), compared with the same period last year, according to StockEdge profitability data. This growth may indicate stronger demand, effective cost management, and overall business vitality, which is positive news for investors and stakeholders.",
            "pubDate": "2026-01-28T13:37:01.040643"
        },
        {
            "title": "MCX India among 5 financial services stocks that hit 52-week high; rally up to 17% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-india-among-5-financial-services-stocks-that-hit-52-week-high-rally-up-to-17-in-a-month/slideshow/127705668.cms",
            "description": "Benchmark Sensex climbed about 487 points to end at 82,344 on Wednesday. Riding the broader market upswing, five BSE financial services stocks scaled their 52-week highs, hitting their strongest levels in a year. Market participants widely see such breakouts as bullish indicators, reflecting solid momentum and the potential for further gains.Multi Commodity Exchange Of IndiaNew 52-week high: Rs 2,604.95| CMP: Rs 2,594.5. In the last one month stock has gained about 17%.",
            "pubDate": "2026-01-28T13:37:01.040745"
        },
        {
            "title": "FII exposure in Nifty stocks retreats from peak after Rs 1.6 lakh crore exodus in 2025. Where’s money flowing?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-exposure-in-nifty-stocks-retreats-from-peak-after-rs-1-6-lakh-crore-exodus-in-2025-wheres-money-flowing/articleshow/127705083.cms",
            "description": "Foreign institutional investors have reduced exposure to Nifty 50 stocks, with holdings dropping to 25.5% by December 2025 amid global risk aversion. However, FIIs are selectively increasing positions in mid and smallcaps. Meanwhile, rising DII ownership continues to reshape market structure, offsetting promoter dilution and adding stability to Indian equities.",
            "pubDate": "2026-01-28T13:37:01.040845"
        },
        {
            "title": "Gainers & Losers: BEL and Vedanta among 7 stocks in focus on Wednesday. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-bel-and-vedanta-among-7-stocks-in-focus-on-wednesday-heres-why/slideshow/127703946.cms",
            "description": "Indian headline indices recorded their second successive gains on Wednesday, aided by buying action in the financials, metal and energy sectors. While the Nifty ended the day at 25,342.75, up 167.35 points or 0.66%, the BSE Sensex closed at 82,344.68, gaining 487.20 points or 0.60%. Here are seven stocks that saw action today:",
            "pubDate": "2026-01-28T13:37:01.040940"
        },
        {
            "title": "CSB Bank shares plunge 14% on flat Q3 PAT, deterioration in asset quality. Here's what management said",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/csb-bank-shares-plunge-14-on-flat-q3-pat-deterioration-in-asset-quality-heres-what-management-said/articleshow/127703710.cms",
            "description": "CSB Bank shares tumbled 14% on Wednesday after the lender reported a flat Q3 profit and a sequential rise in gross and net NPAs. While NII and operating profit saw strong double-digit growth, asset-quality pressures weighed on sentiment. Management said overall business momentum remains strong, with improvements expected in the current quarter.",
            "pubDate": "2026-01-28T13:37:01.041036"
        }
    ]
}