{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-02T04:22:27.890724",
    "items": [
        {
            "title": "Samsung, SK Hynix shares leap after OpenAI chip deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-hit-record-as-chipmakers-surge-on-openai-deal/articleshow/124268756.cms",
            "description": "South Korean shares soared to a record high on Thursday, driven by a significant surge in chipmakers Samsung Electronics and SK Hynix. Both companies secured a major deal to supply memory chips for OpenAI's data centres, propelling the benchmark KOSPI over 3%.",
            "pubDate": "2025-10-02T04:22:19.012407"
        },
        {
            "title": "Japan's Nikkei rises after 4 days of losses as chip-related shares jump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-after-4-days-of-losses-as-chip-related-shares-jump/articleshow/124268732.cms",
            "description": "Japan's Nikkei share average posted a slight gain on Thursday, ending a four-session losing streak, primarily boosted by chip-related stocks tracking U.S. peers. However, the broader Topix index declined, with analysts suggesting the Nikkei's recovery might be brief due to cautious retail investors and overall negative market sentiment.",
            "pubDate": "2025-10-02T04:22:19.012540"
        },
        {
            "title": "Wall Street closes higher, boosted by healthcare as investors shrug off jobs data, US shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-higher-boosted-by-healthcare-as-investors-shrug-off-jobs-data-us-shutdown/articleshow/124268479.cms",
            "description": "Wall Street indexes closed higher Wednesday, primarily boosted by the healthcare sector following Pfizer's drug price agreement with President Trump. Investors largely overlooked weaker private payrolls data and the ongoing U.S. government shutdown, demonstrating historical market resilience. Technology stocks also contributed to gains, while the materials sector declined.",
            "pubDate": "2025-10-02T04:22:19.012655"
        },
        {
            "title": "Miners, gold stocks power Australian shares higher; Wall Street gains add lift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/miners-gold-stocks-power-australian-shares-higher-wall-street-gains-add-lift/articleshow/124268442.cms",
            "description": "Australian shares surged Thursday, driven by strong performances from miners and gold stocks, buoyed by positive Wall Street sentiment. The S&P/ASX 200 index climbed 0.7%, reaching 8,906.30 points. Miners advanced 1.9% on rising copper prices, while gold stocks hit a record high, up 2.5%, amid safe-haven demand. Banks and healthcare also contributed to the broad-based gains.",
            "pubDate": "2025-10-02T04:22:19.012762"
        },
        {
            "title": "Goldman Sachs' Rs 10,000 crore India portfolio: 4 stocks rally 50-155% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-rs-10000-crore-india-portfolio-4-stocks-rally-50-155-in-1-year/articleshow/124268424.cms",
            "description": "Goldman Sachs has secured significant gains, ranging from 50% to 155%, from its India portfolio companies over the past year. This impressive performance occurred despite Indian equities posting muted returns and facing FII selling. The global investment giant successfully identified high-performing stocks amidst market turbulence.",
            "pubDate": "2025-10-02T04:22:19.012877"
        },
        {
            "title": "Tech leads Asia share rally, gold near record high on Fed rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-leads-asia-share-rally-gold-near-record-high-on-fed-rate-cut-bets/articleshow/124268372.cms",
            "description": "Asian tech shares rallied Thursday. Gold reached a new record high. The dollar lost ground. A weak US labor report bolstered bets for Federal Reserve rate cuts. This market sentiment lifted indexes despite a US government shutdown. Oil prices also gained. Traders expect easier policy ahead, influencing global finance.",
            "pubDate": "2025-10-02T04:22:19.012982"
        },
        {
            "title": "FPIs continue selling equities in September, but at a slower pace",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-continue-selling-equities-in-september-but-at-a-slower-pace/articleshow/124268317.cms",
            "description": "Foreign portfolio investors continued as net sellers in Indian equities for September 2025, marking six out of nine months of outflows this year. A significant concern is their reduced primary market investment, totaling $5 billion despite heightened IPO activity. This contrasts sharply with last year's net purchases, though domestic funds provided strong support.",
            "pubDate": "2025-10-02T04:22:19.013085"
        },
        {
            "title": "Stock Market Holiday: Are BSE, NSE open or closed today for Dussehra and Gandhi Jayanti?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-are-bse-nse-open-or-closed-today-for-dussehra-and-gandhi-jayanti/articleshow/124262058.cms",
            "description": "Indian stock exchanges will remain shut on October 2 for Dussehra and Gandhi Jayanti, offering traders a break after recent volatility. The market has four more holidays this year, including a special afternoon Muhurat Trading session on October 21. Following a strong rebound, analysts anticipate sustained positive momentum for equities.",
            "pubDate": "2025-10-02T04:22:19.013211"
        }
    ]
}