{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-26T21:52:34.263245",
    "items": [
        {
            "title": "ASK Automotive shares tumble 5% as Rs 516 crore OFS opens for non-retail investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ask-automotive-shares-tumble-5-as-rs-516-crore-ofs-opens-for-non-retail-investors/articleshow/113688583.cms",
            "description": "ASK Automotive shares fell 5.4% to ₹442.05 amid a ₹516.4 crore offer for sale, with promoter Kuldeep Singh Rathee offloading a 6% stake.",
            "pubDate": "2024-09-26T05:50:23.002339"
        },
        {
            "title": "Reliance Power shares rally 5%, now up 41% in 7 days. What's cooking?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-rally-5-now-up-41-in-7-days-whats-cooking/articleshow/113688512.cms",
            "description": "Shares of Anil Ambani's Reliance Power rallied another 5% on Thursday, reaching a fresh 52-week high of Rs 44.15 on the NSE. Today marked the seventh consecutive day that the small-cap stock, a favorite among retail investors, hit the 5% upper circuit limit.",
            "pubDate": "2024-09-26T05:50:23.002474"
        },
        {
            "title": "Rs 55,000 crore in play! Hyundai, Swiggy, NSE among 6 major IPOs to track in next 6 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-55000-crore-in-play-hyundai-swiggy-nse-among-6-major-ipos-to-track-in-next-6-months/slideshow/113687739.cms",
            "description": "The Indian IPO market is raging on with companies raising over Rs 70,000 crore through the primary market so far this year. The momentum is only set to intensify in the coming months, with several major companies gearing up to go public. Here's a look at the most highly anticipated IPOs in the next six months.",
            "pubDate": "2024-09-26T05:50:23.002580"
        },
        {
            "title": "IDFC First Bank and IDFC shares rally upto 2% on NCLT nod for amalgamation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idfc-first-bank-and-idfc-shares-rally-upto-2-on-nclt-nod-for-amalgamation/articleshow/113688448.cms",
            "description": "The bank is in the process of applying for availing certified true copy of the NCLT Order and completion of requisite statutory/ regulatory formalities, in order to make the scheme effective, according to a release.",
            "pubDate": "2024-09-26T05:50:23.002687"
        },
        {
            "title": "Can multibaggers KFin Tech & CAMS ride on MF tailwinds or will valuations play spoilsport?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-multibaggers-kfin-tech-cams-ride-on-mf-tailwinds-or-will-valuations-play-spoilsport/articleshow/113688368.cms",
            "description": "KFin Technologies and CAMS are well-positioned in the mutual fund industry despite their high valuations. With significant stock rallies over the past year, both companies benefit from a duopolistic market with high entry barriers. Analysts predict potential upsides of up to 26% for KFin Tech and 42% for CAMS.",
            "pubDate": "2024-09-26T05:50:23.002789"
        },
        {
            "title": "After doubling in 6 months, Trent shares rally another 4%. Here are 2 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-doubling-in-6-months-trent-shares-rally-another-4-here-are-2-reasons-why/articleshow/113688282.cms",
            "description": "The global brokerage firm in its note stated that Trent is outpacing its peers, which is driving the Street upgrades as the company adds organic growth engines.",
            "pubDate": "2024-09-26T05:50:23.002883"
        },
        {
            "title": "F&O Radar: Deploy Bull Call Spread in Nifty to make potential gains from bullish momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-make-potential-gains-from-bullish-momentum/articleshow/113688146.cms",
            "description": "Nifty closed positively after consolidation, supported at 25,800 with a target of 26,200. Options data suggests a bullish trend; consider a Bull Call Spread for potential gains.",
            "pubDate": "2024-09-26T05:50:23.002975"
        },
        {
            "title": "High Return on Capital Employed : 7 stocks with over 50% RoCE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-return-on-capital-employed-7-stocks-with-over-50-roce/slideshow/113687215.cms",
            "description": "",
            "pubDate": "2024-09-26T05:50:23.003066"
        },
        {
            "title": "Stock Radar: Escorts Kubota breaks out of a falling trendline; could hit fresh record highs above Rs 4,900",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-escorts-kubota-breaks-out-of-a-falling-trendline-could-hit-fresh-record-highs-above-rs-4900/articleshow/113664723.cms",
            "description": "Escorts Kubota Ltd has broken out from a falling trendline resistance on the weekly charts, indicating potential for the stock to reach Rs 4,900 levels in the next 3-4 months. The stock has shown strong momentum and is trading above crucial moving averages, suggesting further upside potential.",
            "pubDate": "2024-09-26T05:50:23.003204"
        },
        {
            "title": "Trent among 7 stocks on which brokerages initiated coverage can rally up to 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-among-7-stocks-on-which-brokerages-initiated-coverage-can-rally-up-to-27/slideshow/113686845.cms",
            "description": "Several global and domestic brokerage firms have initiated coverage on various stocks, expressing bullish sentiment on companies such as Trent, Tata Power, Power Grid, and JSW Energy, with a potential upside of up to 27%. Here’s a list of seven stocks on which brokerages have initiated coverage:",
            "pubDate": "2024-09-26T05:50:23.003310"
        },
        {
            "title": "Sensex up 850 times in 45 years! Will it hit the 1,00,000 milestone in FY25?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-850-times-in-45-years-will-it-hit-the-100000-milestone-in-fy25/articleshow/113686550.cms",
            "description": "Sensex has grown 850 times in 45 years, with an average CAGR of 16%. Now nearing the 1 lakh mark, it may achieve this milestone by FY25. Experts believe strong liquidity and FII flows could drive this growth, though risks from declining inflows exist.",
            "pubDate": "2024-09-26T05:50:23.003414"
        },
        {
            "title": "Sensex rises above 85,300 for the first time, Nifty hits fresh peak; IT, bank stocks shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-above-85300-for-the-first-time-nifty-hits-fresh-peak-it-bank-stocks-shine/articleshow/113686119.cms",
            "description": "Sensex and Nifty opened at record highs for the sixth session, fueled by IT and auto stock gains and optimism over foreign inflows.",
            "pubDate": "2024-09-26T05:50:23.003507"
        },
        {
            "title": "Saregama India and 3 other stocks closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saregama-india-and-3-other-stocks-closed-above-vwap/slideshow/113686377.cms",
            "description": "",
            "pubDate": "2024-09-26T05:50:23.003594"
        },
        {
            "title": "At multi-year highs: These 11 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-11-stocks-witness-5-year-swing-high-breakout/slideshow/113686098.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 10,000 crore, we have collated a list of five stocks that witnessed a 5-year swing high at the close on September 25, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2024-09-26T05:50:23.003684"
        },
        {
            "title": "Hot Stocks: Brokerages on Trent, Hero MotoCorp, HDFC Bank and M&M Finance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerages-on-trent-hero-motocorp-hdfc-bank-and-mm-finance/articleshow/113685757.cms",
            "description": "Citi has initiated coverage on Trent with a buy rating and a target price of Rs 9,250. The company is outperforming its peers, leading to upgrades from analysts as it adds new organic growth engines. Citi projects impressive revenue, EBITDA, and PAT CAGRs of 41%, 44%, and 56%, respectively, for FY24-27. Trent is effectively leveraging its supply chain and insights from its Westside and Zudio brands. Recognized as a standout performer, Trent has significant potential to scale up its pilot projects.",
            "pubDate": "2024-09-26T05:50:23.003780"
        },
        {
            "title": "Golden Crossovers: These 3 stocks signal further bullishness on September 26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/golden-crossovers-these-3-stocks-signal-further-bullishness-on-september-26/slideshow/113685577.cms",
            "description": "In the NSE list of stocks, three stocks with a market cap of over Rs 1000 crore have been witnessing Golden Crossovers, according to stockedge.com's technical scan data.Golden Cross is an important technical indicator of bullishness. It occurs when the short-term moving average crosses over the major long-term moving average on the upside. These stocks' 50-day simple moving averages (SMA) crossed their 200-day SMAs on September 25.",
            "pubDate": "2024-09-26T05:50:23.003882"
        },
        {
            "title": "HDFC Bank picks Rs 1 crore worth of stake in SME IPO with 64% GMP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-picks-rs-1-crore-worth-of-stake-in-sme-ipo-with-64-gmp/articleshow/113689238.cms",
            "description": "HDFC Bank has acquired a stake worth Rs 1 crore in the SME IPO of Sahasra Electronics Solutions, representing 35,600 equity shares in the company ahead of its public offering. Sahasra Electronics Solutions, which specializes in electronics solutions for system design and manufacturing, raised approximately Rs 53 crore in the anchor round prior to the IPO launch.",
            "pubDate": "2024-09-26T05:58:02.587591"
        },
        {
            "title": "Sebi likely to introduce MF- Lite regulations for passive funds: Madhabi Puri Buch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-likely-to-introduce-mf-lite-regulations-for-passive-funds-madhabi-puri-buch/articleshow/113712838.cms",
            "description": "“We had a very detailed consultation on that and if as a part of that you feel that there needs to be relaxation in terms of how to do distribution of those kind of passive funds. We are open to any kind of suggestions so that we can facilitate growth of these funds across the country,” Buch said at an industry event.",
            "pubDate": "2024-09-26T21:52:12.845073"
        },
        {
            "title": "Sebi chief Buch hopes corp bond mkt grows as rapidly as equities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-chief-buch-hopes-corp-bond-mkt-grows-as-rapdily-as-equities/articleshow/113710356.cms",
            "description": "Sebi chairperson Madhabi Puri Buch expressed optimism about the growth of the corporate bond market, driven by technology and transparency. She highlighted healthy primary market activity but noted a lack of secondary market engagement. Buch also addressed recent allegations against her and discussed upcoming regulations and initiatives at an Amfi event in Mumbai.",
            "pubDate": "2024-09-26T21:52:12.845197"
        },
        {
            "title": "Market Trading Guide: Tata Motors, Hindalco among 5 stock recommendations for Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-tata-motors-hindalco-among-5-stock-recommendations-for-friday/slideshow/113707209.cms",
            "description": "Benchmark Sensex rallied 666 points to close at a fresh record high on Thursday following buying in auto and banking shares amid gains in global markets. The BSE Sensex jumped 0.78 per cent to settle at 85,836.12 amid monthly expiry in the derivatives segment. Rallying for the sixth day in a row, the NSE Nifty climbed 211.90 points or 0.81 per cent to close at a record high of 26,216.05. \"The underlying trend of Nifty remains positive. Having reached upside target of 26,250 levels (1.618% Fibonacci Extension) on Thursday, the Nifty could now move up towards another upside levels of 26,900 (1.786% Fibonacci Extension) by the next couple of weeks. Immediate support is at 26000,\" said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.Here are 5 stock recommendations for Friday:",
            "pubDate": "2024-09-26T21:52:12.845305"
        },
        {
            "title": "Trent, BEL to enter Nifty on Monday, total $800 million inflow expected in 2 stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-bel-to-enter-nifty-on-monday-total-800-million-inflow-expected-in-2-stocks/articleshow/113709387.cms",
            "description": "Tata Group's retailer Trent and PSU defense major Bharat Electronics Ltd (BEL) will join the Nifty50 index on Monday, attracting a cumulative inflow of about $830 million. As part of its semi-annual review, the NSE will remove Divi's Lab and LTIMindtree from the index, with changes effective after market close tomorrow.",
            "pubDate": "2024-09-26T21:52:12.845416"
        },
        {
            "title": "Five Star Business Finance block deal: TPG sells shares worth Rs 1,606 crore, Nomura buyer at Rs 752 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/five-star-business-finance-block-deal-tpg-sells-shares-worth-rs-1606-crore-nomura-buyer-at-rs-752-crore/articleshow/113709319.cms",
            "description": "Nomura invested in Five Star Business Finance through its India Investment Fund and Ireland Equity Fund. Max New York Life Insurance and Max Life Insurance Company were also buyers, collectively acquiring over 34 lakh shares worth Rs 275 crore.",
            "pubDate": "2024-09-26T21:52:12.845536"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-friday/articleshow/113709081.cms",
            "description": "A long bullish candle appeared on the Nifty daily chart, signaling a decisive breakout above the 26,000 level after a period of consolidation. The daily chart shows positive patterns, including higher highs and lows, indicating strong upward momentum with minimal downward corrections.",
            "pubDate": "2024-09-26T21:52:12.845648"
        },
        {
            "title": "Rudrabhishek Enterprises receives Sebi nod for SM REIT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rudrabhishek-enterprises-receives-sebi-nod-for-sm-reit/articleshow/113707910.cms",
            "description": "This registration is expected to help REPL expand its presence in the real estate investment sector, utilizing its expertise and industry partnerships to drive the growth of ImpactR SM REIT.",
            "pubDate": "2024-09-26T21:52:12.845750"
        },
        {
            "title": "Charting Global Course: Linc inks dual JVs with Mitsubishi and SILKA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/charting-global-course-linc-inks-dual-jvs-with-mitsubishi-and-silka/articleshow/113707509.cms",
            "description": "Deepak Jalan, Managing Director of Linc, stated that the Mitsubishi joint venture will allow the company to provide advanced Japanese technology at more affordable prices. The partnership plans to leverage Mitsubishi’s technology while manufacturing products locally in India and sourcing some raw materials domestically to further reduce costs.",
            "pubDate": "2024-09-26T21:52:12.845849"
        },
        {
            "title": "IMF's $7 billion bailout sends Pakistan stocks to new peak of 82,905.73",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imfs-7-billion-bailout-sends-pakistan-stocks-to-new-peak-of-82905-73/articleshow/113707261.cms",
            "description": "Pakistan's benchmark share index hit a life-time high in opening trade on Thursday, hours after the International Monetary Fund's board approved a long-awaited $7 billion bailout deal for the struggling economy.",
            "pubDate": "2024-09-26T21:52:12.845943"
        },
        {
            "title": "Micron rises 19% on AI-driven forecast, fuels chip stock rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/micron-rises-19-on-ai-driven-forecast-fuels-chip-stock-rally/articleshow/113706558.cms",
            "description": "Micron Technology surged close to 19% on Thursday, leading a rally in chip stocks after its strong revenue forecast signaled robust demand for the hardware used to power generative AI technology.",
            "pubDate": "2024-09-26T21:52:12.846041"
        },
        {
            "title": "NIM pressure eases, more banks see improvement in Q1 FY24",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nim-pressure-eases-more-banks-see-improvement-in-q1-fy24/articleshow/113706417.cms",
            "description": "The year-on-year growth in credit offtake rose sharply to over 16% by the end of March 2024, up from below 6% in March 2021, excluding the impact of the HDFC and HDFC Bank merger. Meanwhile, deposit growth increased modestly to around 13% from 11% during the same period. To attract deposits, banks raised deposit rates faster than the interest rates on loans, which has exerted pressure on net interest margins.",
            "pubDate": "2024-09-26T21:52:12.846140"
        },
        {
            "title": "These 5 midcap stocks hit fresh 52-week highs and rallied up to 15% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-midcap-stocks-hit-fresh-52-week-highs-and-rallied-up-to-15-in-a-month/slideshow/113706361.cms",
            "description": "On Thursday, India’s benchmark index Sensex jumped by around 666 points, closing at 85,836. During this rally, five stocks from the BSE midcap segment hit their highest prices in the past year. Reaching a 52-week high is significant as it reflects the highest price a stock has attained in the last 12 months, providing valuable insights for traders and investors. This milestone is essential for evaluating a stock's current value and predicting future price trends.",
            "pubDate": "2024-09-26T21:52:12.846232"
        },
        {
            "title": "S&P hits record high, Nasdaq jumps over 1% on AI euphoria after Micron's upbeat forecast",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-on-ai-euphoria-after-microns-upbeat-forecast/articleshow/113705676.cms",
            "description": "Wall Street's main indexes rose on Thursday, with the S&P 500 hitting a record high. Micron Technology's positive forecast boosted AI-related stocks, while a softer-than-expected jobless claims report eased labor market concerns. Investors also reacted to better employment numbers and GDP growth, influencing expectations of future Fed rate cuts.",
            "pubDate": "2024-09-26T21:52:12.846321"
        },
        {
            "title": "Tech view: Nifty gives decisive breakout, aiming for 26,900 level. How to trade tomorrow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-gives-decisive-breakout-aiming-for-26900-level-how-to-trade-tomorrow/articleshow/113705201.cms",
            "description": "Call options saw the highest open interest at strike prices of 26,250 and 26,300, whereas put options had the highest open interest at 26,200 followed by 26,100.",
            "pubDate": "2024-09-26T21:52:12.846410"
        },
        {
            "title": "Technical Breakout Stocks: How to trade ITC, Blue Star, Bikaji Foods & Tata Power on Friday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-breakout-stocks-how-to-trade-itc-blue-star-bikaji-foods-tata-power-on-friday/slideshow/113705141.cms",
            "description": "Indian market hit fresh record highs on Thursday, tracking positive global cues. The S&P BSE Sensex rose over 600 points while Nifty50 closed above 26,200 levels for the first time.The S&P BSE Sensex hit a high of 85,930 while the Nifty50 hit a high of 26,250 in intraday on Thursday.",
            "pubDate": "2024-09-26T21:52:12.846523"
        },
        {
            "title": "Sebi amends rules; introduces fixed price process for voluntary delisting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-amends-rules-introduces-fixed-price-process-for-voluntary-delisting/articleshow/113704761.cms",
            "description": "Sebi has introduced new delisting rules allowing companies to delist shares through a fixed price mechanism as an alternative to the reverse book building process. The fixed price must be at least 15% above the floor price. Additional modifications include changes to the counter-offer mechanism and adjusted book value for determining floor prices.",
            "pubDate": "2024-09-26T21:52:12.846618"
        }
    ]
}