{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-28T11:16:18.460791",
    "items": [
        {
            "title": "Japan set to boost shipbuilding, energy and defence ties with the US",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-set-to-boost-shipbuilding-energy-and-defence-ties-with-the-us/slideshow/124864920.cms",
            "description": "U.S. President Donald Trump and Japan’s Prime Minister Sanae Takaichi are holding high-stakes talks in Tokyo on security and trade, marking Trump’s first visit to Japan since 2019. The agenda for the meeting covers a wide range of areas including shipbuilding, power infrastructure, automobile trade, soybeans, natural gas, rare earths, and defence spending. (Source: Reuters)",
            "pubDate": "2025-10-28T05:39:06.907196"
        },
        {
            "title": "Valuation stretch to ED scrutiny: 5 risks to be mindful of before investing in Lenskart IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuation-stretch-to-ed-scrutiny-5-risks-to-be-mindful-of-before-investing-in-lenskart-ipo/slideshow/124864680.cms",
            "description": "India’s eyewear giant Lenskart Solutions is one of the most anticipated IPOs of 2025. But even as investor enthusiasm builds, the company’s filings reveal several key risks worth noting. Here are five factors prospective investors should watch before subscribing.",
            "pubDate": "2025-10-28T05:39:06.907325"
        },
        {
            "title": "SRF among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/srf-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124864522.cms",
            "description": "As of October 27, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-28T05:39:06.907440"
        },
        {
            "title": "Lenskart IPO set to soar with GMP up 27% ahead of listing. Check key details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-ipo-set-to-soar-with-gmp-up-27-ahead-of-listing-check-key-details/articleshow/124864276.cms",
            "description": "Lenskart’s ₹7,278 crore IPO opens on October 31, with strong investor demand reflected in a 27% grey market premium and backed by global investors like SoftBank and Temasek. The eyewear major plans to use fresh funds for expansion and technology upgrades. Analysts foresee strong listing gains and sustained growth momentum.",
            "pubDate": "2025-10-28T05:39:06.907543"
        },
        {
            "title": "Investors brace for Trump–Xi trade talks amid familiar optimism and caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-brace-for-trumpxi-trade-talks-amid-familiar-optimism-and-caution/slideshow/124864520.cms",
            "description": "Investors are stepping into this week’s trade talks between the United States and China with a familiar mix of excitement and caution. There’s optimism around the possibility of a truce, but also an awareness that the final deal might not live up to the headlines.",
            "pubDate": "2025-10-28T05:39:06.907645"
        },
        {
            "title": "Azim Premji-backed PI Opportunities Fund to pocket Rs 350 crore, set for a 1,565% windfall in Lenskart IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/azim-premji-backed-pi-opportunities-fund-to-pocket-rs-350-crore-set-for-a-1565-windfall-in-lenskart-ipo/articleshow/124863793.cms",
            "description": "Azim Premji-backed PI Opportunities Fund is set for a massive payday from Lenskart's upcoming IPO. The fund's initial Rs 21 crore investment is projected to yield Rs 350 crore, a staggering 1,565% return. Founder Peyush Bansal and other early investors are also poised for significant gains as the eyewear giant prepares for its Dalal Street debut.",
            "pubDate": "2025-10-28T05:39:06.907762"
        },
        {
            "title": "Liquidity crunch eases hopes for Fed to end quantitative tightening",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/liquidity-crunch-eases-hopes-for-fed-to-end-quantitative-tightening/slideshow/124863906.cms",
            "description": "A massive trade in U.S. rate futures is drawing market attention as investors prepare for the Federal Reserve’s expected move to end its balance sheet reduction programme, known as quantitative tightening. The trade reflects shifting expectations for liquidity conditions and short-term rates. (Source: Reuters)",
            "pubDate": "2025-10-28T05:39:06.907861"
        },
        {
            "title": "Buy, Sell or Hold: Citi reduces target price on Bata India; JM Financial recommends buy on Supreme Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-reduces-target-price-on-bata-india-jm-financial-recommends-buy-on-supreme-industries/articleshow/124863483.cms",
            "description": "Brokerages issued mixed calls as Citi downgraded Bata India on weak Q2 results, stayed bullish on Sona BLW, while JM Financial reaffirmed a ‘Buy’ on Supreme Industries despite trimmed estimates.",
            "pubDate": "2025-10-28T05:39:06.907962"
        },
        {
            "title": "JK Tyre shares surge 7% after Q2 profit jumps 62% YoY on strong volumes, softer input costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jk-tyre-shares-in-focus-after-q2-profit-jumps-62-on-strong-volumes-softer-input-costs/articleshow/124863556.cms",
            "description": "JK Tyre reported a 62.3% jump in Q2 consolidated net profit to ₹226.86 crore, driven by strong domestic demand, higher exports, and improved margins. Revenue rose 10.8% to ₹4,011 crore from ₹3,622 crore a year ago.",
            "pubDate": "2025-10-28T05:39:06.908057"
        },
        {
            "title": "Rekha Jhunjhunwala purchased 2.3 crore shares in this multibagger midcap bank before Blackstone’s entry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-purchased-2-3-crore-shares-in-this-multibagger-midcap-bank-before-blackstones-entry/articleshow/124863512.cms",
            "description": "Ace investor Rekha Jhunjhunwala has significantly increased her stake in Federal Bank, acquiring an additional 2.3 crore shares in Q2 FY26. This move precedes Blackstone's substantial $705 million investment, positioning the US private equity firm as the bank's largest shareholder. Brokerages are bullish on Federal Bank following these developments.",
            "pubDate": "2025-10-28T05:39:06.908156"
        },
        {
            "title": "Sensex jumps 200 pts, Nifty tops 26,000 amid trade optimism, strong earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-trade-on-choppy-note-as-traders-weigh-easing-us-china-tensions/articleshow/124863484.cms",
            "description": "Indian stocks remained largely flat on Tuesday, with the Sensex and Nifty showing minimal movement. This stability was driven by positive sentiment surrounding eased U.S.-China trade tensions and strong domestic corporate earnings, which counteracted some profit-taking after recent market advances. The benchmarks are currently trading approximately 1% below their September 2024 all-time highs.",
            "pubDate": "2025-10-28T05:39:06.908259"
        },
        {
            "title": "Jana Small Finance Bank shares in focus as RBI returns Universal Bank application",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jana-small-finance-bank-shares-in-focus-as-rbi-returns-universal-bank-application/articleshow/124863476.cms",
            "description": "Shares of Jana Small Finance Bank may stay in focus after the RBI returned its application to transition into a universal bank, citing eligibility shortfalls. The lender, which recently approved a Rs 250 crore NCD issue, reported a 40% YoY drop in Q1 profit to Rs 102 crore due to higher expenses, though revenue rose 12%.",
            "pubDate": "2025-10-28T05:39:06.908361"
        },
        {
            "title": "FIIs load up on 292 smallcap stocks, 131 already multibaggers as smart money turns risk-on",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-load-up-on-292-smallcap-stocks-131-already-multibaggers-as-smart-money-turns-risk-on/articleshow/124863418.cms",
            "description": "Foreign investors are actively buying Indian smallcap stocks. This is happening even as these companies have already seen significant price jumps. This trend suggests a strong belief in India's growth potential. Experts believe this segment offers opportunities despite recent market underperformance. Investors are advised to focus on specific companies with strong management.",
            "pubDate": "2025-10-28T05:39:06.908457"
        },
        {
            "title": "Tata Steel shares in focus as Motilal Oswal upgrades to Buy; 19% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-in-focus-as-motilal-oswal-upgrades-to-buy-19-upside-seen/articleshow/124863330.cms",
            "description": "Tata Steel shares: Motilal Oswal upgraded the stock to ‘Buy’ from ‘Neutral’, citing growth prospects ahead, and set a ₹210 target, implying a 19% upside from ₹177.",
            "pubDate": "2025-10-28T05:39:06.908554"
        },
        {
            "title": "Sona BLW shares in focus as Q2 PAT rises 20% YoY. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sona-blw-shares-in-focus-as-q2-pat-rises-20-yoy-should-you-invest/articleshow/124863137.cms",
            "description": "Shares of Sona BLW Precision Forgings (Sona Comstar) are likely to be in focus after the company reported a 20% YoY rise in Q2FY26 profit to Rs 173 crore — its highest-ever quarterly profit. Revenue grew 24% YoY to Rs 1,144 crore, driven by robust demand across electrified and non-electrified powertrain segments, with BEV revenue share at 32%.",
            "pubDate": "2025-10-28T05:39:06.908647"
        },
        {
            "title": "Mazagon Dock shares jump nearly 3% as Q2 PAT jumps 28% YoY, revenue rises 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mazagon-dock-shares-in-focus-as-q2-pat-jumps-28-yoy-revenue-rises-6/articleshow/124863103.cms",
            "description": "Mazagon Dock Shipbuilders shares surged on Tuesday after the company announced a significant 28% year-on-year increase in its profit after tax for the quarter ended September 2025. Revenue also saw a healthy rise. The company's strong financial performance reflects its robust order book, which includes major defense projects. This positive development has boosted investor confidence.",
            "pubDate": "2025-10-28T05:39:06.908762"
        },
        {
            "title": "CarTrade Tech Q2 profit more than doubles, stock surges 13% to all-time high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cartrade-tech-q2-profit-more-than-doubles-stock-surges-13-to-all-time-high/articleshow/124868065.cms",
            "description": "CarTrade Tech shares jumped 13% to a 52-week high of ₹3,008.95 after the company’s Q2 net profit more than doubled to ₹64.1 crore, up 109% YoY and 36% QoQ, driven by strong revenue growth and improved margins.",
            "pubDate": "2025-10-28T07:58:18.443932"
        },
        {
            "title": "Saurabh Mukherjea's Global Compounders Fund delivers 27% CAGR in 3 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saurabh-mukherjeas-global-compounders-fund-delivers-27-cagr-in-3-years/articleshow/124867976.cms",
            "description": "Marcellus Investment Managers’ Global Compounders Portfolio, launched from its GIFT City hub three years ago, has crossed Rs 300 crore in AUM across its PMS, AIF, and advisory platforms. The fund, which invests in top global companies across North America, Europe, and Asia, has delivered 27.3% annualised returns since inception, reflecting growing investor appetite for offshore diversification.",
            "pubDate": "2025-10-28T07:58:18.444057"
        },
        {
            "title": "MFs stick with these 10 stocks for 3 quarters, 2 turn multibaggers. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mfs-stick-with-these-10-stocks-for-3-quarters-2-turn-multibaggers-do-you-own-any/slideshow/124867436.cms",
            "description": "Over the past three quarters, Mutual Funds (MFs) have steadily increased their holdings in about 221 BSE-listed companies, using December 2024 as the base point. This study focuses only on companies with a market capitalisation above Rs 2,000 crore. Retail investors often track the moves of big institutional players like MFs, whose decisions are backed by thorough research. About 47 stocks, in which MFs consistently raised their stakes, gained more than 25% over the past year. Notably, 10 of these stocks surged between 65% and 190%, with 2 becoming multibaggers: more than doubling in value within 12 months and delivering substantial gains to investors. (Data Source: ACE Equity).",
            "pubDate": "2025-10-28T07:58:18.444166"
        },
        {
            "title": "Japan's Nikkei slips from record high on profit taking, stronger yen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slips-from-record-high-on-profit-taking-stronger-yen/articleshow/124867777.cms",
            "description": "Japan's Nikkei share average slipped from a record high on Tuesday, as investors locked in profits after a fast-paced rally, with a stronger yen weighing on sentiment.",
            "pubDate": "2025-10-28T07:58:18.444265"
        },
        {
            "title": "Dream11 eyes stock broking for next innings after gaming ban cripples core business: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dream11-eyes-stock-broking-for-next-innings-after-gaming-ban-cripples-core-business-report/articleshow/124867632.cms",
            "description": "Dream11 Group, hit by the government’s ban on online money games, is planning a pivot into stock broking to diversify its business. The Tencent-, TPG-, and Tiger Global-backed firm has applied for a broking licence and aims to leverage its 260 million users to tap India’s growing retail investment market.",
            "pubDate": "2025-10-28T07:58:18.444375"
        },
        {
            "title": "MCX shares fall 2% after technical issue halts trading once again",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-fall-2-after-technical-issue-halts-trading-once-again/articleshow/124867140.cms",
            "description": "MCX shares fell 2.2% to ₹9,105 after the exchange halted trading due to technical issues. The start time was revised multiple times, from 9:30 am to 10:30 am, but trading hadn’t resumed as of 11:53 am, according to company updates.",
            "pubDate": "2025-10-28T07:58:18.444477"
        },
        {
            "title": "Five forces behind the 5-day rally in metal stocks. Is this a short-term rush or dawn of a metal supercycle?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/five-forces-behind-the-5-day-rally-in-metal-stocks-is-this-a-short-term-rush-or-dawn-of-a-metal-supercycle/articleshow/124867030.cms",
            "description": "Metal stocks extended their rally, lifting the Nifty Metal Index for a fifth consecutive session amid strong global prices, renewed foreign inflows, and bullish technical signals. Analysts cite resilient domestic demand, policy support, and company-specific upgrades as key drivers, though some caution that overbought conditions could prompt short-term profit-taking.",
            "pubDate": "2025-10-28T07:58:18.444576"
        },
        {
            "title": "Can Vodafone Idea stage a comeback? Supreme Court opens door to relief, analysts see revival but with risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-vodafone-idea-stage-a-comeback-supreme-court-opens-door-to-relief-analysts-see-revival-but-with-risks/articleshow/124866491.cms",
            "description": "Vodafone Idea gained fresh hope after the Supreme Court allowed a review of its AGR dues, sparking optimism over government relief, though analysts warn high debt and execution risks remain.",
            "pubDate": "2025-10-28T07:58:18.444673"
        },
        {
            "title": "Hindalco, Vedanta shares jump up to 2% on strong volumes; metal index advances over 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindalco-vedanta-shares-jump-up-to-2-on-strong-volumes-metal-index-advances-over-1/articleshow/124865602.cms",
            "description": "Hindalco and Vedanta shares rose up to 2% on Tuesday as metal stocks rallied. The Nifty Metal Index gained 1.1% to 10,582, driven by strong volumes and positive sentiment in the steel sector.",
            "pubDate": "2025-10-28T07:58:18.444774"
        },
        {
            "title": "Canara Robeco AMC shares crash 11% as Q2 net profit slips 20% to Rs 49 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canara-robeco-amc-shares-crash-11-as-q2-net-profit-slips-20-to-rs-49-crore/articleshow/124865555.cms",
            "description": "Newly listed Canara Robeco AMC shares fell 11.3% to ₹311 after posting muted Q2 results. Net profit dipped 2% to ₹49 crore, while revenue rose 3% to ₹107.7 crore year-on-year.",
            "pubDate": "2025-10-28T07:58:18.444887"
        },
        {
            "title": "The end of easy growth: Why earnings persistence is a myth in Indian equities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-end-of-easy-growth-why-earnings-persistence-is-a-myth-in-indian-equities/articleshow/124865350.cms",
            "description": "Indian companies rarely show consistent profit growth. Research over three decades reveals that sustained earnings growth is a statistical rarity, not a common occurrence. Analysts and investors often overestimate the durability of growth narratives. This overconfidence in persistence has historically led to disappointment. The market may now reward prudence over projection as growth normalizes.",
            "pubDate": "2025-10-28T07:58:18.444996"
        },
        {
            "title": "Studds Accessories IPO to open on October 30; GMP nears 10%. Here's all you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/studds-accessories-ipo-to-open-on-october-30-gmp-nears-10-heres-all-you-need-to-know/articleshow/124865193.cms",
            "description": "Studds Accessories IPO: Studds Accessories’ ₹455.49 crore IPO opens on October 30 with a price band of ₹557–585. The issue enjoys a ₹55 GMP, hinting at a listing price near ₹640 and an expected 9.4% gain for investors.",
            "pubDate": "2025-10-28T07:58:18.445094"
        },
        {
            "title": "SBI, other PSU banks stocks rise up to 3% on reports of government move to raise FDI limit to 49%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-other-psu-banks-stocks-rise-up-to-3-on-reports-of-government-move-to-raise-fdi-limit-to-49/articleshow/124865151.cms",
            "description": "PSU bank stocks rose up to 3.3% after reports said the government may raise foreign investment limits to 49% in state-run banks, more than double current caps. The finance ministry and RBI are in talks, aiming to align rules with private banks, where foreign ownership is allowed up to 74%.",
            "pubDate": "2025-10-28T07:58:18.445191"
        },
        {
            "title": "PSU banks to see up to $4 billion inflows if FII limit gets hiked: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-banks-to-see-up-to-4-billion-inflows-if-fii-limit-gets-hiked-report/articleshow/124871601.cms",
            "description": "India’s PSU banks may receive up to $4 billion in passive inflows if the government raises the foreign institutional investment limit to 49%, according to Nuvama Institutional Equities. The move could drive strong rallies in key lenders like SBI, PNB, and Indian Bank, with expectations already boosting valuations.",
            "pubDate": "2025-10-28T11:16:15.335477"
        },
        {
            "title": "Market Wrap: Sensex sheds 150 points, Nifty below 25,950 as profit-taking offsets gains in metals, PSU banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-sheds-150-points-nifty-below-25950-as-profit-taking-offsets-gains-in-metals-psu-banks/articleshow/124871149.cms",
            "description": "Indian stocks closed lower on Tuesday as profit-taking across sectors, particularly consumer and IT shares, weighed on the market. This decline was partially offset by gains in metal stocks, fueled by trade deal optimism, and public-sector banks, which saw an advance on potential FII ceiling hikes.",
            "pubDate": "2025-10-28T11:16:15.335613"
        },
        {
            "title": "Retail, HNI investors eye these 10 midcaps in Q2FY26. Are you missing out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-hni-investors-eye-these-10-midcaps-in-q2fy26-are-you-missing-out/slideshow/124870143.cms",
            "description": "\"Increase in Retail Shareholding” refers to a rise in the percentage of a company's shares owned by individual investors. Here, retail investors—also referred to as non-institutions—comprising individual investors, HNIs (High Net-Worth Individuals), and other non-corporate entities. In the NSE midcap segment, we highlight the top 10 stocks with the highest increase in retail shareholding during the September '25 quarter, compared to the previous June '25 quarter, according to the StockEdge shareholding scan. This trend suggests that more retail investors are purchasing and holding these stocks, potentially indicating growing public interest or confidence in the companies.",
            "pubDate": "2025-10-28T11:16:15.335733"
        },
        {
            "title": "European shares retreat from record rally; earnings, US-China trade on tap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-retreat-from-record-rally-earnings-us-china-trade-on-tap/articleshow/124871016.cms",
            "description": "European shares retreated on Tuesday, pausing after a third consecutive record-high close on signs of easing Sino-U.S. trade tensions, as investors assessed a slew of corporate earnings.",
            "pubDate": "2025-10-28T11:16:15.335841"
        },
        {
            "title": "European shares retreat from record rally; earnings, US-China trade on tap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-retreat-from-record-rally-earnings-us-china-trade-on-tap/articleshow/124868856.cms",
            "description": "European shares retreated on Tuesday, pausing after a third consecutive record-high close on signs of easing Sino-U.S. trade tensions, as investors assessed a slew of corporate earnings.",
            "pubDate": "2025-10-28T11:16:15.335949"
        }
    ]
}