{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-30T04:23:28.621418",
    "items": [
        {
            "title": "Wall Street Week Ahead: US jobs data poses hurdle for rate-cut hopes, stocks rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-jobs-data-poses-hurdle-for-rate-cut-hopes-stocks-rally/articleshow/123595282.cms",
            "description": "Investors are keenly awaiting the upcoming U.S. labor market report to gauge economic health and the likelihood of imminent interest rate cuts. A weak report could signal a slowing economy but might also encourage expectations for more aggressive rate cuts by the Federal Reserve. Equities have recently shown resilience, but September historically poses challenges for the S&P 500.",
            "pubDate": "2025-08-30T03:58:47.784428"
        },
        {
            "title": "After plumbing lows, Ola gets a full charge on D-Street; stock jumps 31% in August",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-plumbing-lows-ola-gets-a-full-charge-on-d-street-stock-jumps-31-in-august/articleshow/123595636.cms",
            "description": "Ola Electric shares surged nearly 31% in August, marking their best monthly performance since listing, fueled by optimism surrounding government production-linked incentives and renewed institutional investor interest. The company's PLI certification for its Gen-3 scooters is expected to boost profitability, reviving investor confidence.",
            "pubDate": "2025-08-30T04:23:27.499438"
        },
        {
            "title": "Fallout of US’ 50% tariff on India: Cowboy moves lasso Indian bulls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fallout-of-us-50-tariff-on-india-cowboy-moves-lasso-indian-bulls/articleshow/123595443.cms",
            "description": "Indian stock markets faced a downturn due to Donald Trump's tariffs and concerns over additional tariffs on Indian goods, leading to losses in key indices. Investors are hopeful that the upcoming GST Council meeting and potential tax slab reforms will boost domestic consumption and revive market sentiment.",
            "pubDate": "2025-08-30T04:23:27.499561"
        }
    ]
}