{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-21T20:21:08.574462",
    "items": [
        {
            "title": "Asian stocks follow Wall Street losses, bonds rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-follow-wall-street-losses-bonds-rise/articleshow/125474907.cms",
            "description": "Asian stocks fell mirroring Wall Street's sharp reversal, as a brief Nvidia-led rally faded amid concerns over stretched valuations and AI investment profitability. Lingering uncertainty about the Federal Reserve's interest rate path also contributed to investor caution, prompting a pullback from riskier assets.",
            "pubDate": "2025-11-21T01:20:05.073385"
        },
        {
            "title": "Stocks in news: TCS, Groww, RIL, PVR Inox, JSW Energy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-groww-ril-pvr-inox-jsw-energy/articleshow/125468190.cms",
            "description": "Markets resumed their upward trend, gaining nearly half a percent as rotational buying supported major heavyweights. Analysts anticipate the Nifty to soon attempt a fresh record high and move towards 26,500. Several companies like TCS, Groww, RIL, PVR Inox, and JSW Energy are in focus due to significant news developments.",
            "pubDate": "2025-11-21T01:20:05.073511"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125468271.cms",
            "description": "Indian equities are nearing a record high, with Nifty just 85 points below its September 2024 peak. Analysts anticipate continued upward momentum driven by domestic factors, global data, FII inflows, and a potential India-US trade agreement. The market shows strengthening momentum, with a bullish MACD crossover suggesting a move towards 26,400-26,500.",
            "pubDate": "2025-11-21T01:20:05.073620"
        },
        {
            "title": "TCS joins AI, data centre rush with $2 billion TPG alliance, draws gigawatt-scale plans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-joins-ai-data-centre-rush-with-2-billion-tpg-alliance-draws-gigawatt-scale-plans/articleshow/125474838.cms",
            "description": "HyperVault a 51:49 JV, will raise $4-4.5 b debt as well. Company plans to offer services to hyperscalers, Indian enterprises and government entities, along with Tata companies. 1st time Tata Group flagship is tying up with a PE fund as well as raise debt",
            "pubDate": "2025-11-21T01:20:05.073718"
        },
        {
            "title": "NHAI appoints manager for Raajmarg InvIT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nhai-appoints-manager-for-raajmarg-invit/articleshow/125474720.cms",
            "description": "The National Highways Authority of India has appointed Raajmarg Infra Investment Managers as the investment manager for the upcoming Raajmarg Infra Investment Trust.  Retail and public investors can expect the first unit issuance in February 2026.  Over the next three to five years, approximately 1,500 kilometers of operational national highways will be introduced into the trust, creating significant investment opportunities.",
            "pubDate": "2025-11-21T01:20:05.073814"
        },
        {
            "title": "High-risk investors can bet on Nifty IT index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-risk-investors-can-bet-on-nifty-it-index/articleshow/125474684.cms",
            "description": "Investors seeking high-risk opportunities can consider the Nifty IT index fund. The sector has faced headwinds, leading to underperformance and attractive valuations. Fund managers see this as a good entry point. Indian IT companies are navigating AI's impact, presenting both challenges and opportunities. Global corporations will continue to depend on IT service partners for AI initiatives.",
            "pubDate": "2025-11-21T01:20:05.073911"
        },
        {
            "title": "Nvidia's upbeat forecast soothes fears of AI stock market bubble",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nvidias-upbeat-forecast-soothes-fears-of-ai-stock-market-bubble/articleshow/125474613.cms",
            "description": "Nvidia projected strong revenue exceeding analyst expectations, countering AI bubble concerns. The company anticipates a significant revenue surge in upcoming quarters, signaling sustained demand for its AI chips. This positive outlook boosted Nvidia's stock and related tech companies, indicating robust momentum in the AI industry.",
            "pubDate": "2025-11-21T01:20:05.074025"
        },
        {
            "title": "IndusInd Bank mulls QIP route to raise ‘confidence capital’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-mulls-qip-route-to-raise-confidence-capital/articleshow/125474861.cms",
            "description": "IndusInd Bank has begun early discussions to gauge investor interest for a potential qualified institutional placement, according to people aware of the matter. Senior management has been meeting investors after recent discrepancies in forex derivatives triggered senior-level exits.",
            "pubDate": "2025-11-21T01:20:05.074128"
        },
        {
            "title": "Nifty eyes record levels amid progress on US trade deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-eyes-record-levels-amid-progress-on-us-trade-deal/articleshow/125474598.cms",
            "description": "Indian stock markets surged on Thursday, approaching record highs. Investor confidence grew as the government signaled progress on a trade pact with the US. The Nifty index briefly surpassed its all-time closing high. Key companies like Eicher Motors and Reliance Industries saw significant gains. Foreign and domestic investors showed strong buying interest. Asian markets also experienced mixed movements.",
            "pubDate": "2025-11-21T01:20:05.074223"
        },
        {
            "title": "Stock Radar: This Sensex stock hits fresh record highs in November; will the rally continue or time to book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-this-sensex-stock-hits-fresh-record-highs-in-november-will-the-rally-continue-or-time-to-book-profits/articleshow/125459284.cms",
            "description": "Titan Company stock is showing strong upward momentum. The shares have broken out on weekly charts and reached a new record high. Experts recommend buying Titan Company shares for a target of Rs 4,300 in the coming months. Traders can consider a stop loss below Rs 3,780. The stock is trading above key moving averages, indicating a bullish trend.",
            "pubDate": "2025-11-21T01:20:05.074325"
        },
        {
            "title": "RBI intends to not let banking system go dry: Bankers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-intends-to-not-let-banking-system-go-dry-bankers/articleshow/125474780.cms",
            "description": "The Reserve Bank of India will ensure banking system liquidity stays above 1% of NDTL. The central bank reassured bankers about its strategy. Recent interventions in the currency spot market and festive season demand caused liquidity to briefly turn negative. The RBI plans to use measures like variable rate reverse repo auctions to maintain liquidity.",
            "pubDate": "2025-11-21T01:20:05.074510"
        },
        {
            "title": "CBDT updates Capital Gains scheme, expands SEZ benefits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capital-gains-accounts-scheme-tweak-for-taxpayer-comfort/articleshow/125474698.cms",
            "description": "The CBDT has updated the Capital Gains Accounts Scheme to make it more convenient and digitally accessible. The amendment, effective November 19, extends the scheme to capital gains from shifting industrial units to SEZs under Section 54GA, encouraging such relocations by enabling tax exemptions.",
            "pubDate": "2025-11-21T01:20:05.074602"
        },
        {
            "title": "Hindalco shares fall 3% after US unit Novelis reports second fire in two months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindalco-shares-fall-3-after-us-unit-novelis-reports-second-fire-in-two-months/articleshow/125477803.cms",
            "description": "Hindalco Industries shares fell after a fire at its US subsidiary Novelis' Oswego plant. This is the second fire at the plant in two months. The company expects to restart its hot mill by December 2025. Despite this, Hindalco reported strong Q2 net profit growth driven by its India business and operational efficiencies.",
            "pubDate": "2025-11-21T05:40:01.987501"
        },
        {
            "title": "Quiet listing, loud returns: Ather's multibagger post-IPO rally brings windfall gains for promoters as returns swell to 3,220%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/quiet-listing-loud-returns-athers-multibagger-post-ipo-rally-brings-windfall-gains-for-promoters-as-returns-swell-to-3220/articleshow/125477663.cms",
            "description": "Ather Energy's quiet listing has delivered impressive returns. Promoters Tarun Sanjay Mehta and Swapnil Babanlal Jain have seen their wealth skyrocket by 3,220%. The stock has surged 116% over its issue price, outperforming many other IPOs in buzz. Analysts are optimistic about Ather's future market share growth and profitability improvements.",
            "pubDate": "2025-11-21T05:40:01.987633"
        },
        {
            "title": "Eicher Motors among 5 stocks witnessing 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eicher-motors-among-5-stocks-witnessing-5-year-swing-high-breakouts/slideshow/125477336.cms",
            "description": "In the Nifty500 pack, five stocks hit a 5-year swing high at the close on November 20, indicating bullish momentum, according to technical scan data from stockedge.com.A 5-year swing high represents the highest price a stock has reached within a five-year period.This level often acts as a significant resistance zone where the price has historically struggled to break through. While this can be seen as a bullish signal—suggesting potential for further upside—it differs from a 5-year breakout, which occurs when the stock decisively surpasses a major resistance level held for five years or more.",
            "pubDate": "2025-11-21T05:40:01.987747"
        },
        {
            "title": "Dalal Street's new-age tech bets take wings in 2025: 6 mainboard IPOs deliver solid gains, some more than doubling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-streets-new-age-tech-bets-take-wings-in-2025-6-mainboard-ipos-deliver-solid-gains-some-more-than-doubling/articleshow/125477546.cms",
            "description": "New-age tech IPOs on Dalal Street in 2025, including Urban Company and Ather Energy, have delivered significant gains, with some more than doubling. Despite initial rallies, recent pullbacks are attributed to profit booking and reassessment of valuations amid macro headwinds. Investors are now focusing on fundamentals like profitability and sustainable growth.",
            "pubDate": "2025-11-21T05:40:01.987847"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains overweight on M&M; retain underweight on Urban Company",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-overweight-on-mm-retain-underweight-on-urban-company/articleshow/125477371.cms",
            "description": "Morgan Stanley has released fresh insights on key Indian stocks, maintaining an 'Overweight' rating on Mahindra & Mahindra with an 18% upside target and InterGlobe Aviation with a 15% upside target. The brokerage, however, has an 'Underweight' rating on Urban Company, citing its target price of Rs 119.",
            "pubDate": "2025-11-21T05:40:01.987948"
        },
        {
            "title": "Infosys' Rs 18,000 crore share buyback: Can retail investors make double-digit returns?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-rs-18000-crore-share-buyback-can-retail-investors-make-double-digit-returns/articleshow/125477281.cms",
            "description": "Infosys’ Rs 18,000-crore buyback offers small shareholders potential short-term gains and a psychological price floor as the IT major navigates weak demand. Analysts see limited operational impact but expect improved sentiment, stronger shareholder returns and support for valuations as the company leverages strong fundamentals, steady cash flows and long-term technology spending trends.",
            "pubDate": "2025-11-21T05:40:01.988046"
        },
        {
            "title": "Sensex, Nifty bulls roar back! 5 reasons global brokerages are betting big on India once again",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-bulls-roar-back-5-reasons-global-brokerages-are-betting-big-on-india-once-again/articleshow/125477233.cms",
            "description": "Indian stocks are showing strong recovery, nearing all-time highs. Global brokerages like Goldman Sachs, Morgan Stanley, and HSBC are issuing bullish reports, forecasting substantial growth for Sensex and Nifty by 2026. This optimism stems from policy shifts, improving earnings, foreign investor re-entry, justified valuations, and domestic market strength. India is seen as a compelling investment opportunity.",
            "pubDate": "2025-11-21T05:40:01.988135"
        },
        {
            "title": "Capillary Technologies shares make tepid start, list at 3% discount to IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capillary-technologies-shares-make-tepid-start-list-at-3-discount-to-ipo-price/articleshow/125476988.cms",
            "description": "Capillary Technologies India shares debuted on Friday with a slight discount to their IPO price. The company's initial public offering saw robust demand from institutional and retail investors. Capillary Technologies is a prominent SaaS firm specializing in customer loyalty and CRM solutions. The company has recently achieved profitability after a period of losses.",
            "pubDate": "2025-11-21T05:40:01.988232"
        },
        {
            "title": "Groww shares rebound 6% ahead of Q2 results; here’s what analysts expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-rise-6-after-17-fall-in-2-sessions-what-are-analysts-saying/articleshow/125476806.cms",
            "description": "Groww shares: Groww shares saw a strong rebound on Friday, rising 6% ahead of its Q2 earnings announcement. This offers relief after a recent slump. The brokerage sector faces pressure due to lower trading activity and regulatory changes. Despite this, Groww is expected to show stable revenue growth. Its strong user base and efficient operations support its performance.",
            "pubDate": "2025-11-21T05:40:01.988323"
        },
        {
            "title": "Adani Enterprises sells remaining 7% stake in AWL via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-sells-remaining-7-stake-in-awl-via-block-deal/articleshow/125476710.cms",
            "description": "Adani Group has fully exited Adani Wilmar Ltd. The conglomerate sold its final stake in a block deal. Domestic and international institutional investors bought the shares. Wilmar International is now the sole promoter of Adani Wilmar. This move removes uncertainty and concentrates ownership. The company now enters a new phase as an MNC-controlled entity.",
            "pubDate": "2025-11-21T05:40:01.988431"
        },
        {
            "title": "Sensex slips over 100 pts, Nifty below 26,150 as global selloff & soft US jobs data hit sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-100-pts-nifty-below-26150-as-global-selloff-soft-us-jobs-data-hit-sentiment/articleshow/125476679.cms",
            "description": "Indian stock markets opened lower on Friday. The Sensex and Nifty paused their recent gains. This comes after a global market downturn. Investors are reacting to U.S. jobs data. The data has created uncertainty about future interest rates. Despite this dip, Indian benchmarks are still close to record highs.",
            "pubDate": "2025-11-21T05:40:01.988528"
        },
        {
            "title": "Reliance Industries shares rise as Jamnagar SEZ halts Russian crude ahead of EU sanctions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-as-jamnagar-sez-halts-russian-crude-ahead-of-eu-sanctions/articleshow/125476419.cms",
            "description": "RIL share price: RIL shares are in focus after the company halted Russian crude at its Jamnagar SEZ refinery ahead of EU sanctions. The transition to non-Russian crude for all exports starting December 1 was completed ahead of schedule. RIL, India’s largest buyer of Russian oil, continues to honor pre-committed cargoes, while its stock remains in a bullish trend despite an overbought technical signal.",
            "pubDate": "2025-11-21T05:40:01.988620"
        },
        {
            "title": "Excelsoft Technologies IPO Day 3: GMP trends, brokerage views and other key highlights",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/excelsoft-technologies-ipo-day-3-gmp-trends-brokerage-views-and-other-key-highlights/articleshow/125476319.cms",
            "description": "Excelsoft Technologies’ Rs 500-crore IPO has entered its final bidding day with strong traction, recording 6.89 times subscription by Day 2. Investors bid for 21.14 crore shares against 3.07 crore on offer. The GMP has eased to 11.7%, implying a potential listing near Rs 134. The issue includes a Rs 180-crore fresh issue and a Rs 320-crore OFS.",
            "pubDate": "2025-11-21T05:40:01.988708"
        },
        {
            "title": "Kotak Mahindra Bank to announce stock split today: What investors need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-to-announce-stock-split-today-what-investors-need-to-know/articleshow/125476030.cms",
            "description": "Kotak Mahindra Bank’s board meets today to consider a stock split, a move aimed at boosting liquidity and making shares more affordable. The lender has a history of stock splits and bonus issuances, including a previous split in 2010 and a 1:1 bonus in 2015.",
            "pubDate": "2025-11-21T05:40:01.988798"
        },
        {
            "title": "M&M shares rise over 1% after robust guidance on investor day. Should you buy, sell or hold the stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-shares-in-focus-on-investor-day-should-you-buy-sell-or-hold-the-stock/articleshow/125476122.cms",
            "description": "Mahindra & Mahindra (M&M) shares traded in the green following robust investor day guidance. The company targets 15-40% organic revenue CAGR between FY26-FY30, with a strong focus on exports and a new SUV lineup. Analysts remain optimistic, reiterating Buy and Overweight ratings with significant upside potential projected.",
            "pubDate": "2025-11-21T05:40:01.988899"
        },
        {
            "title": "Bajaj Auto among 6 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-auto-among-6-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125475991.cms",
            "description": "On November 20, in the Nifty50 pack, seven stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" indicates that the Relative Strength Index (RSI) values are increasing, suggesting a strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-21T05:40:01.988995"
        },
        {
            "title": "India's Axis Bank to raise up to $559 million via private placement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-axis-bank-to-raise-up-to-559-million-via-private-placement/articleshow/125483986.cms",
            "description": "The company is looking to raise 20 billion rupees through debentures, with an additional 30 billion rupees available through a green shoe option",
            "pubDate": "2025-11-21T10:47:33.451698"
        },
        {
            "title": "Market Wrap: Sensex slides 401 pts, Nifty slips below 26,100 as profit-taking kicks in near record levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slides-401-pts-nifty-slips-below-26100-as-profit-taking-kicks-in-near-record-levels/articleshow/125483627.cms",
            "description": "Indian stocks experienced a downturn on Friday, with the Sensex and Nifty retreating from near-record highs due to profit-taking. Banking giants ICICI Bank and HDFC Bank were among the decliners. This decline mirrored a global selloff, influenced by uncertain U.S. jobs data that cast a shadow over future interest rate expectations.",
            "pubDate": "2025-11-21T10:47:33.451809"
        },
        {
            "title": "10 stocks showing consistent 20%+ profit growth and 6 have turned multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-stocks-showing-consistent-20-profit-growth-and-6-have-turned-multibaggers/slideshow/125481317.cms",
            "description": "In a market environment where consistent earnings growth is becoming increasingly rare, nearly 100 listed companies have managed to deliver over 20% year-on-year profit growth in each of the last four quarters. To narrow the universe, the screening excluded firms with quarterly sales below Rs 100 crore and only considered companies with a market capitalisation above Rs 2,500 crore, filtering the list down to fundamentally solid mid- and largecap names.",
            "pubDate": "2025-11-21T10:47:33.451897"
        },
        {
            "title": "Kotak Mahindra Bank approves 1:5 stock split. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-announces-15-stock-split-check-details/articleshow/125483359.cms",
            "description": "Kotak Mahindra Bank's board has greenlit a 1:5 stock split, dividing each existing share into five. This move aims to make shares more accessible and boost trading, particularly for retail investors. The bank, celebrating its 40th foundation day, will announce the record date for this significant corporate action soon, enhancing market participation.",
            "pubDate": "2025-11-21T10:47:33.451981"
        },
        {
            "title": "European shares fall on tech rout, Fed policy jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-fall-on-tech-rout-fed-policy-jitters/articleshow/125482208.cms",
            "description": "The STOXX is on track for weekly losses of nearly 3%, its biggest weekly drop since the unveiling of U.S. tariffs sent global markets into a tailspin between late March and early April. Among individual stocks, French water and waste management group Veolia VIE.PA lost 1% after agreeing to buy U.S.-based hazardous waste company Clean Earth from Enviri for $3 billion.",
            "pubDate": "2025-11-21T10:47:33.452062"
        },
        {
            "title": "As headwinds slow & managements become realistic, time for a relook: 5 mid-cap pharma stocks with upside potential of up to 44%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-headwinds-slow-managements-become-realistic-time-for-a-relook-5-mid-cap-pharma-stocks-with-upside-potential-of-up-to-44/articleshow/125481010.cms",
            "description": "Every sector goes through a phase when managements become over-optimistic, taking decisions that should have been avoided. But then, with time, either due to macro factors or some other reason, the rosy projections and assumptions are put to test and reality dawns on many. Indian pharma firms, especially the mid-caps, have gone through a similar cycle. A number of them have more realistic managements now. Capital allocation has become better and, in some cases, the capex done in the last few years is close to showing impact.",
            "pubDate": "2025-11-21T10:47:33.452154"
        },
        {
            "title": "Capillary Technologies shares rocket up to 13% after tepid debut. Should you buy, sell or hold the stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capillary-technologies-shares-rocket-up-to-13-after-tepid-debut-should-you-buy-sell-or-hold-the-stock/articleshow/125480018.cms",
            "description": "Capillary Technologies rebounded sharply after a weak stock market debut, with shares jumping up to 13% intraday despite listing at a discount to the IPO price. Strong buying interest offset initial caution and a missed grey market premium. Market experts advise IPO allottees to hold the stock for the medium to long term, with a strict stop-loss at around Rs 520.",
            "pubDate": "2025-11-21T10:47:33.452238"
        },
        {
            "title": "SEBI weighing REITs’ inclusion in indices, to widen MF pool for REITs and InvITs: Tuhin Kanta Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-weighing-reits-inclusion-in-indices-to-widen-mf-pool-for-reits-and-invits-tuhin-kanta-pandey/articleshow/125479963.cms",
            "description": "SEBI Chairman Tuhin Kanta Pandey announced a calibrated approach to including REITs in indices and expanding liquid mutual funds to include REITs and InvITs. He emphasized that governance and investor protection are paramount as the market grows, highlighting India's yield advantage as a compelling investment opportunity.",
            "pubDate": "2025-11-21T10:47:33.452318"
        },
        {
            "title": "Japan's Nikkei extends weekly slide as tech shares track Wall Street declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-extends-weekly-slide-as-tech-shares-track-wall-street-declines/articleshow/125479898.cms",
            "description": "Tokyo's Nikkei index plummeted Friday, mirroring Wall Street's tech stock decline amid AI valuation worries after Nvidia's results.  Japanese investors also eyed a looming holiday and government stimulus, sparking fiscal concerns.  The yen weakened, and bond yields neared highs.  Advantest and SoftBank Group saw significant drops, while M3 and Obayashi gained.",
            "pubDate": "2025-11-21T10:47:33.452394"
        },
        {
            "title": "Groww joins capital market rally; six stocks soar up to 86%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-6-other-capital-markets-index-stocks-surge-up-to-86-in-fy26-do-you-own-any/articleshow/125478808.cms",
            "description": "India's capital markets are experiencing a significant boom. The Nifty Capital Markets Index has surged by nearly 40% in FY26. This growth is fueled by strong performances from brokerages, asset managers, and exchanges. New digital platforms like Groww are also making a notable impact. This transformation highlights a deepening financial sector and increasing investor confidence in India's evolving financial landscape.",
            "pubDate": "2025-11-21T10:47:33.452474"
        },
        {
            "title": "Insurers, foreign funds pull back, deepening turmoil in Japan’s debt market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurers-foreign-funds-pull-back-deepening-turmoil-in-japans-debt-market/slideshow/125478839.cms",
            "description": "Investor flight from the yen and Japanese government bonds has pushed long-term borrowing costs to unprecedented levels. The sell-off, triggered by expectations of a massive new stimulus package, is stretching markets and challenging policymakers trying to stabilise the economy. (Source: Reuters)",
            "pubDate": "2025-11-21T10:47:33.452553"
        },
        {
            "title": "Morgan Stanley scraps December rate-cut call after strong jobs report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/morgan-stanley-scraps-december-rate-cut-call-after-strong-jobs-report/slideshow/125478690.cms",
            "description": "Morgan Stanley withdrew its call for a December rate cut after U.S. payroll numbers showed unexpected strength. September’s job growth signalled that the economy remains resilient despite recent concerns. (Source: Reuters)",
            "pubDate": "2025-11-21T10:47:33.452630"
        },
        {
            "title": "Goolsbee flags risks of over-accelerating rate cuts amid sticky inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goolsbee-flags-risks-of-over-accelerating-rate-cuts-amid-sticky-inflation/slideshow/125478465.cms",
            "description": "Chicago Fed President Austan Goolsbee voiced discomfort with continuing aggressive rate cuts, noting that inflation remains too high and is either steady or worsening. His remarks signal hesitation towards supporting a third consecutive reduction in borrowing costs. (Source: Reuters)",
            "pubDate": "2025-11-21T10:47:33.452708"
        },
        {
            "title": "EM Stocks Set for Worst Week Since April as AI Concerns Spread",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/em-stocks-set-for-worst-week-since-april-as-ai-concerns-spread/articleshow/125478274.cms",
            "description": "Emerging Asian stock markets suffered sharp declines, heading for their worst week since April, as concerns over high valuations in the artificial intelligence sector triggered a sell-off in tech-heavy indices.",
            "pubDate": "2025-11-21T10:47:33.452784"
        },
        {
            "title": "Explosive Growth: 9 midcap stocks with stellar YoY Sales gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explosive-growth-9-midcap-stocks-with-stellar-yoy-sales-gains/slideshow/125485746.cms",
            "description": "A significant rise in quarterly sales on a year-on-year (YoY) basis indicates strong business growth and increased demand. Among the NSE midcap segment (excluding banking and financial stocks), the top eight companies recorded over 50% sales growth in the September 2025 quarter compared to the same period in 2024, according to turnover scan data from StockEdge.com.",
            "pubDate": "2025-11-21T11:58:59.944352"
        },
        {
            "title": "Stock Radar: Garden Reach Shipbuilders break out from ascending triangle pattern; time to buy after 20% fall from highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-garden-reach-shipbuilders-break-out-from-ascending-triangle-pattern-time-to-buy-after-20-fall-from-highs/articleshow/125461469.cms",
            "description": "Garden Reach Shipbuilders & Engineering Ltd stock has experienced a bullish breakout from an ascending triangle pattern on daily charts. Experts suggest medium-term investors with a high-risk profile consider buying for a potential target of Rs 3,500 in 3-5 months, with a stop loss at Rs 2,550.",
            "pubDate": "2025-11-21T11:58:59.944486"
        },
        {
            "title": "AI bubble, boom or both? Ray Dalio calls its a bubble but says it's too soon to sell",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-bubble-boom-or-both-ray-dalio-calls-its-a-bubble-but-says-its-too-soon-to-sell/articleshow/125484035.cms",
            "description": "Ray Dalio warns that the AI-driven market surge has entered bubble territory, even as Nvidia’s strong earnings reignite global tech optimism. Dalio says it’s too early to sell, noting bubbles need a catalyst to burst. With volatility rising and India watching global swings closely, investors face a tug-of-war between AI exuberance and valuation fears",
            "pubDate": "2025-11-21T11:58:59.944592"
        },
        {
            "title": "Adani Enterprises sells stake worth $279 million in AWL Agri Business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-sells-stake-worth-279-million-in-awl-agri-business/articleshow/125489785.cms",
            "description": "Data from NSE showed that Adani Commodities, a subsidiary of Adani Enterprises, sold 39.5 million shares in AWL Agri for 275.09 rupees apiece, while data from BSE showed that it sold 51.5 million shares for 275 rupees apiece",
            "pubDate": "2025-11-21T15:52:52.822485"
        },
        {
            "title": "Eli Lilly becomes first drugmaker to hit trillion-dollar m-cap on weight-loss demand boom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eli-lilly-becomes-first-drugmaker-to-hit-trillion-dollar-m-cap-on-weight-loss-demand-boom/articleshow/125489542.cms",
            "description": "Wall Street estimates the weight-loss drug market to be worth $150 billion by 2030, with Lilly and Novo together controlling the majority of projected global sales",
            "pubDate": "2025-11-21T15:52:52.822606"
        },
        {
            "title": "Gainers & Losers:Hindalco, IndusInd Bank among 6 big movers on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losershindalco-indusind-bank-among-6-big-movers-on-friday/slideshow/125486122.cms",
            "description": "",
            "pubDate": "2025-11-21T15:52:52.822707"
        },
        {
            "title": "US Fed's Lorie Logan calls for holding rates steady 'for a time'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-feds-lorie-logan-calls-for-holding-rates-steady-for-a-time/articleshow/125489458.cms",
            "description": "Elevated asset valuations and historically compressed credit spreads, she said, are not just indications \"that policy most likely isn't very restrictive. They're also indications that the fed funds rate needs to offset tailwinds from financial conditions,\" Logan said",
            "pubDate": "2025-11-21T15:52:52.822799"
        },
        {
            "title": "US stocks bounce back on renewed rate cut optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-december-rate-cut-bets-strengthen/articleshow/125488927.cms",
            "description": "Wall Street's main indexes opened higher on Friday as traders raised bets on an interest rate cut by the Federal Reserve in December following commentary from policymakers, with tech stocks stabilizing after last session's rout.",
            "pubDate": "2025-11-21T15:52:52.822896"
        },
        {
            "title": "US Fed's Philip Jefferson: AI-related stock gains unlikely to be dot-com boom replay",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-feds-philip-jefferson-ai-related-stock-gains-unlikely-to-be-dot-com-boom-replay/articleshow/125488227.cms",
            "description": "A recent Fed report showed some 30% of respondents felt a turn in sentiment against AI is a salient risk to the U.S. financial system and the global economy.",
            "pubDate": "2025-11-21T15:52:52.822985"
        },
        {
            "title": "US Fed's John Williams says rates can still be cut in the \"near term\"",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-feds-john-williams-says-rates-can-still-be-cut-in-the-near-term/articleshow/125487561.cms",
            "description": "Progress on inflation has \"temporarily stalled,\" Williams acknowledged in comments prepared for delivery at a Central Bank of Chile event, and added it was \"imperative to restore inflation to our 2% longer-run goal on a sustained basis,\" from a current level that he estimates",
            "pubDate": "2025-11-21T15:52:52.823072"
        },
        {
            "title": "Sebi to discuss mutual fund and stock broking regulations at December board meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-discuss-mutual-fund-and-stock-broking-regulations-at-december-board-meeting/articleshow/125485999.cms",
            "description": "Sebi is planning to overhaul mutual fund and stock broking rules at its December board meeting, according to sources close to the development. The market regulator aims to cut regulations by half and separate TER from statutory levies. Further, it will also revisit short-selling and SLB norms.",
            "pubDate": "2025-11-21T15:52:52.823159"
        },
        {
            "title": "Reliance Industries, GMR Airports 6 stocks that hit 52-week highs; gains up to 15% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-gmr-airports-6-stocks-that-hit-52-week-highs-gains-up-to-15-in-a-month/slideshow/125485916.cms",
            "description": "On Friday, the benchmark Sensex fell by 400 points, closing at 85,231. However, despite the broader market decline, six stocks in the BSE 200 index hit their 52-week highs, reaching their strongest levels in a year. Such breakouts are often seen by traders and investors as bullish signals, suggesting strong upward momentum and the potential for further short-term gains.",
            "pubDate": "2025-11-21T15:52:52.823248"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of more than 23% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-more-than-23-in-1-year/articleshow/125491244.cms",
            "description": "Given that the market is sitting with gains, it will see profit-booking at regular intervals. So, if you are into watching the Nifty and Sensex and thinking that they represent the market, better think again. As a basic principle, look at changes in the fundamentals of a sector or company. Are things going to be better? If yes, all else is secondary and will be taken care of. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-11-21T20:21:07.502078"
        }
    ]
}