{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-17T05:24:16.935769",
    "items": [
        {
            "title": "Wall Street ends lower as investors turn cautious ahead of Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-as-investors-turn-cautious-ahead-of-fed-rate-decision/articleshow/123933246.cms",
            "description": "Wall Street witnessed a decline in its main stock indexes on Tuesday. This happened amid anticipation of a possible interest rate cut by the Federal Reserve. Investors are expecting a 25 basis-point cut. Retail sales data showed an increase in August. Webtoon Entertainment saw a surge after a deal with Disney.",
            "pubDate": "2025-09-17T02:16:39.365285"
        },
        {
            "title": "Religare Broking: Aurobindo Pharma poised for next leg of rally after consolidation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/religare-broking-aurobindo-pharma-poised-for-next-leg-of-rally-after-consolidation/videoshow/123920768.cms",
            "description": "“We are seeing a mixed trend within the pharma space, and Auropharma is currently sitting on the sidelines while hovering in a consolidation base. Traders can buy for a target of Rs 1300 in the next 1-2 months,” Ajit Mishra – SVP, Research, Religare Broking Ltd, said.",
            "pubDate": "2025-09-17T02:16:39.365417"
        },
        {
            "title": "Asian stocks slip as investors await Fed decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-slip-as-investors-await-fed-decision/articleshow/123933029.cms",
            "description": "Asian stock markets saw a slight dip as investors are cautious. Everyone is waiting for the United States Federal Reserve's interest-rate decision. Shares in Japan and South Korea decreased. Gold prices are holding steady. Attention is also on a Japanese government bond auction. Investors are keen to understand the future direction of interest rates.",
            "pubDate": "2025-09-17T02:16:39.365627"
        },
        {
            "title": "Stocks in news: Apollo Tyres, Akzo Nobel, Dr Reddy's, Mahindra Lifespace, Coal India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-apollo-tyres-akzo-nobel-dr-reddys-mahindra-lifespace-coal-india/articleshow/123933003.cms",
            "description": "Indian markets saw gains, with Apollo Tyres becoming the Indian cricket team's jersey sponsor. JSW Paints will acquire a stake in Akzo Nobel India, while Dr. Reddy's launched a new molecule for gastrointestinal issues. Mahindra Lifespace is set to redevelop housing societies, and Coal India has been named the preferred bidder for a rare earth element exploration block.",
            "pubDate": "2025-09-17T02:16:39.365728"
        },
        {
            "title": "Hexaware Tech rises on likely US rate cut, weak rupee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hexaware-tech-rises-on-likely-us-rate-cut-weak-rupee/articleshow/123932909.cms",
            "description": "Hexaware Technologies' stock has recently seen gains, driven by a weaker rupee and anticipated US interest rate cuts potentially boosting IT spending. Despite a modest revenue growth in the June quarter due to client spending reductions, the company is improving profitability through increased offshore revenue and employee utilization.",
            "pubDate": "2025-09-17T02:16:39.365827"
        },
        {
            "title": "GIFT Nifty up 55 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123926132.cms",
            "description": "Indian equity markets saw gains on Tuesday. Investors are optimistic before the US Federal Reserve decision. Analysts foresee a gradual market rise. Trade developments and the Fed rate cut are key. Immediate support is at 25,050. India VIX fell. FIIs were net buyers. The Rupee strengthened against the US dollar. FIIs reduced their net short positions in the futures market.",
            "pubDate": "2025-09-17T02:16:39.365930"
        },
        {
            "title": "ESAF SFB plans Rs 300-500 crore capital infusion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/esaf-sfb-plans-rs-300-500-crore-capital-infusion/articleshow/123932894.cms",
            "description": "ESAF Small Finance Bank is set to raise ₹300-500 crore in tier-1 capital, anticipating a business turnaround from the third quarter. The bank aims to bolster its capital adequacy ratio and fund expansion plans. A board meeting is scheduled for September 20 to finalize the fundraising details, including the instrument and modalities.",
            "pubDate": "2025-09-17T02:16:39.366062"
        },
        {
            "title": "Is the rally in small-cap solvent extraction stocks sustainable?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-rally-in-small-cap-solvent-extraction-stocks-sustainable/articleshow/123932839.cms",
            "description": "Small-cap solvent extraction companies have seen significant gains due to high edible oil demand, ethanol blending, and supportive policies. However, analysts now advise caution, noting that valuations may be exceeding fundamentals. Risks like raw material price volatility and supply challenges could lead to corrections, suggesting investors consider booking profits or waiting for better entry points.",
            "pubDate": "2025-09-17T02:16:39.366158"
        },
        {
            "title": "India Inc turns to non-bank routes for nearly half of FY25 funding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-turns-to-non-bank-routes-for-nearly-half-of-fy25-funding/articleshow/123932789.cms",
            "description": "Corporate India is increasingly diversifying its funding sources, with nearly half of the resources raised in FY25 coming from non-banking channels like equity markets and NBFC loans. While the total financial resources to the corporate sector saw a modest increase, bank credit demand declined, influenced by strong equity market performance and cautious lending.",
            "pubDate": "2025-09-17T02:16:39.368168"
        },
        {
            "title": "India's VIX slips to lifetime lows, traders see limited near-term risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-vix-slips-to-lifetime-lows-traders-see-limited-near-term-risks/articleshow/123932747.cms",
            "description": "India's VIX index has plummeted to record lows, indicating reduced market volatility and increased investor confidence ahead of the US Federal Reserve's policy meeting. While this suggests a period of market stability, analysts caution against potential complacency, as low VIX readings can mask underlying risks and unexpected market corrections. Institutional investors are positioning for limited near-term movement.",
            "pubDate": "2025-09-17T02:16:39.368270"
        },
        {
            "title": "Adani to invest Rs 30,000 crore more in ports business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-to-invest-rs-30000-crore-more-in-ports-business/articleshow/123932871.cms",
            "description": "Adani Ports plans a ₹30,000 crore expansion over two years, primarily targeting Mundra, Dhamra, and Vizhinjam ports to achieve a one billion tonne cargo handling target by 2030. The investment spans ports, logistics, renewables, and marine services, with a focus on berth and terminal expansion.",
            "pubDate": "2025-09-17T02:16:39.368461"
        },
        {
            "title": "Redington among 7 stocks that closed above VWAP on Sept 16",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-among-7-stocks-that-closed-above-vwap-on-sept-16/slideshow/123934660.cms",
            "description": "On September 16, the closing prices of seven Nifty500 stocks ended more than 1% above their VWAP (Volume Weighted Average Price), indicating a potential bullish trend, according to technical scan data from stockedge.com.A close above VWAP means the stock ended the day higher than its average volume-weighted trading price, often interpreted by traders as a bullish signal reflecting positive market sentiment.",
            "pubDate": "2025-09-17T03:55:16.706075"
        },
        {
            "title": "Blue Dart Express shares in focus after Rs 420 crore GST demand notice to subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blue-dart-express-shares-in-focus-after-rs-420-crore-gst-demand-notice-to-subsidiary/articleshow/123934548.cms",
            "description": "Blue Dart share price: Blue Dart Express’ subsidiary, Blue Dart Aviation, received a GST demand notice of around Rs 420 crore for alleged misclassification of taxes and ineligible Input Tax Credit for FY21-22 and FY22-23. The company has been asked to respond within 30 days",
            "pubDate": "2025-09-17T03:55:16.706208"
        },
        {
            "title": "BEL shares in focus after bagging fresh orders worth Rs 712 crore in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-after-bagging-fresh-orders-worth-rs-712-crore-in-september/articleshow/123934497.cms",
            "description": "Bharat Electronics Limited (BEL) has secured fresh orders worth Rs 712 crore since September 1, 2025, spanning IT infrastructure, cybersecurity, ESM systems, blockchain solutions, and communication equipment. The Navratna PSU said the inflow adds to its robust project pipeline. BEL shares have surged over 38% in the past year, closing at Rs 402.80 on Tuesday.",
            "pubDate": "2025-09-17T03:55:16.706317"
        },
        {
            "title": "Suzlon Energy, NCC and 5 other F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-ncc-and-5-other-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123934452.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack as of September 16, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-17T03:55:16.706423"
        },
        {
            "title": "Akzo Nobel shares in focus after CCI clears JSW Paints’ 75% stake acquisition proposal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/akzo-nobel-shares-in-focus-after-cci-clears-jsw-paints-75-stake-acquisition-proposal/articleshow/123934328.cms",
            "description": "Akzo Nobel I share price: The Competition Commission of India has approved JSW Paints’ Rs 12,915 crore deal to acquire up to 75% stake in Akzo Nobel India, maker of Dulux paints. The acquisition will position JSW Paints as the fourth-largest player in India’s decorative paints market.",
            "pubDate": "2025-09-17T03:55:16.706527"
        },
        {
            "title": "Coal India shares rise 2% after emerging as preferred bidder for REE block in Andhra Pradesh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-shares-in-focus-after-emerging-as-preferred-bidder-for-ree-block-in-andhra-pradesh/articleshow/123934120.cms",
            "description": "Coal India share price: Coal India was declared the preferred bidder for the Ontillu-Chandragiri Rare Earth Element (REE) Exploration Block by the Ministry of Mines. The move marks the PSU's strategic entry into rare earth exploration, crucial for electronics, defence, and renewable energy sectors.",
            "pubDate": "2025-09-17T03:55:16.706629"
        },
        {
            "title": "Kotak Mahindra Bank, NTPC among 5 stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-ntpc-among-5-stocks-showing-rsi-trending-up/slideshow/123934074.cms",
            "description": "Five stocks from the Nifty50 were highlighted in the RSI Trending Up scan on September 16, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-17T03:55:16.706733"
        },
        {
            "title": "Amber Enterprises, Maruti Suzuki among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amber-enterprises-maruti-suzuki-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/123933947.cms",
            "description": "In the Nifty500 segment, six stocks witnessed a 5-year swing high at the close on September 16, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-17T03:55:16.706859"
        },
        {
            "title": "Hindustan Copper, Shakti Pumps among 40 dividend plays approach record date tomorrow. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shakti-pumps-among-40-dividend-plays-approach-record-date-tomorrow-last-day-to-buy/articleshow/123933838.cms",
            "description": "Investors eyeing dividend payouts should act today, September 17th, to buy shares of Hindustan Copper, SJVN, and Shakti Pumps (India). These companies have set September 18, 2025, as the record date for dividend eligibility.",
            "pubDate": "2025-09-17T03:55:16.706959"
        },
        {
            "title": "Last day to buy shares of Kesar Enterprises, Zydus Wellness ahead of stock split record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-kesar-enterprises-zydus-wellness-ahead-of-stock-split-record-date/articleshow/123933789.cms",
            "description": "Attention investors, today is the last day to buy shares of Kesar Enterprises and Zydus Wellness to qualify for their stock splits. The record date is September 18, 2025. Kesar Enterprises will split its shares from Rupees 10 to Rupees 1. Zydus Wellness will split its shares from Rupees 10 to Rupees 2.",
            "pubDate": "2025-09-17T03:55:16.707058"
        },
        {
            "title": "Stocks to buy in 2025 for long term: ICICI Bank, SBI among 5 stocks that could give 18-38% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-icici-bank-sbi-among-5-stocks-that-could-give-18-38-return/slideshow/123933656.cms",
            "description": "Brokerages remain optimistic on select frontline banks, metals, and real estate stocks, rolling out fresh Buy calls with meaningful upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-17T03:55:16.707152"
        },
        {
            "title": "Galaxy Medicare IPO: Subdued GMP, moderate subscription ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/galaxy-medicare-ipo-subdued-gmp-moderate-subscription-ahead-of-listing/articleshow/123933493.cms",
            "description": "Bhubaneswar-based Galaxy Medicare, a medical device manufacturer, is set to debut on the NSE SME platform on September 17, following its Rs 22 crore IPO. Subscribed 1.83 times overall, the IPO saw strong retail participation. Galaxy Medicare, known for its wide range of medical products, reported revenues of Rs 40.27 crore in FY25.",
            "pubDate": "2025-09-17T03:55:16.707246"
        },
        {
            "title": "Jay Ambe Supermarkets IPO listing today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jay-ambe-supermarkets-ipo-listing-today-heres-what-gmp-indicates/articleshow/123933475.cms",
            "description": "Gujarat-based Jay Ambe Supermarkets is debuting in the market today after a successful IPO, oversubscribed 64.13 times. Retail interest was particularly strong. Despite a modest GMP, a listing around Rs 85–86 is anticipated. Founded in 2020, the company operates 17 stores under the “City Square Mart” brand. IPO funds will fuel expansion, including purchasing a store and funding new locations.",
            "pubDate": "2025-09-17T03:55:16.707339"
        },
        {
            "title": "Positive Breakout: These 7 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-7-stocks-close-cross-above-their-200-dmas/slideshow/123933463.cms",
            "description": "The closing prices of 16 stocks from the Nifty500 pack crossed above their 200 DMA (Daily Moving Averages) on September 16. Among these, we have highlighted the top 7 that recorded gains exceeding 1.5%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-17T03:55:16.707440"
        },
        {
            "title": "Urban Company shares zoom over 8% after robust listing gains. What should investors do now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-zoom-over-8-after-robust-listing-gains-what-should-investors-do-now/articleshow/123935378.cms",
            "description": "Urban Company had a strong stock market debut. Shares listed at a premium and continued to rise. The IPO was oversubscribed, showing investor confidence. The company offers various home services and plans to expand. Revenue increased significantly in FY25. Experts advise caution due to high valuations. Some suggest booking partial profits and holding the rest.",
            "pubDate": "2025-09-17T05:01:02.748725"
        },
        {
            "title": "​Implications of semi-annual reporting for US capital markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/implications-of-semi-annual-reporting-for-us-capital-markets/slideshow/123935638.cms",
            "description": "Donald Trump has called for U.S. companies to move away from quarterly reporting and adopt six-monthly updates instead. This proposal has received cautious support from international investors, who see an opportunity to encourage businesses to focus more on long-term sustainability issues. (Source: Reuters)",
            "pubDate": "2025-09-17T05:01:02.748853"
        },
        {
            "title": "Shringar House of Mangalsutra shares list at 14% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shringar-house-of-mangalsutra-shares-list-at-14-premium-over-ipo-price/articleshow/123935369.cms",
            "description": "Shringar House of Mangalsutra made a strong debut on the stock exchanges. Shares listed at a premium after its IPO. The IPO saw huge investor demand. It was subscribed over 60 times. The company is a leading Mangalsutra designer and manufacturer. It serves big clients like Titan and Reliance Retail. Shringar House has a wide range of products.",
            "pubDate": "2025-09-17T05:01:02.748958"
        },
        {
            "title": "Dev Accelerator shares list flat at IPO price of Rs 61 on NSE, BSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dev-accelerator-shares-list-flat-at-ipo-price-of-rs-61-on-bse-nse/articleshow/123935122.cms",
            "description": "Dev Accelerator, a flex space operator, had a muted market debut with shares listing around the IPO price of Rs 61. Despite healthy investor interest and strong revenue growth, concerns remain about profitability and client concentration. The company aims to capitalize on the expanding flex workspace market in India, but faces execution and leverage risks as it expands.",
            "pubDate": "2025-09-17T05:01:02.749075"
        },
        {
            "title": "Urban Company shares make a stellar debut, list at 58% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-make-a-stellar-debut-list-at-58-premium-over-ipo-price/articleshow/123934833.cms",
            "description": "Urban Company share price: Urban Company's IPO made a strong debut, listing at a significant premium due to high demand from institutional and retail investors. The company plans to use the IPO proceeds to enhance technology, expand services, and grow geographically. Analysts suggest holding the stock for long-term gains, citing Urban Company's strong market position and growth potential in the tech-enabled home services sector.",
            "pubDate": "2025-09-17T05:01:02.749179"
        },
        {
            "title": "US Fed set to cut rates by 25 bps today, Nifty bulls await FII U-turn",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-set-to-cut-rates-by-25-bps-today-nifty-bulls-await-fii-u-turn/articleshow/123935102.cms",
            "description": "The US Federal Reserve is expected to cut rates. Markets anticipate this move. Investors are watching for clues about the US central bank's approach to a slowing labor market and inflation. Foreign institutional investor flows in India may depend on the policy signal from Washington. Nifty 50 closed positively.",
            "pubDate": "2025-09-17T05:01:02.749276"
        },
        {
            "title": "HCL Technologies shares in focus after India launch of AI-first MarTech platform Unica+",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-technologies-shares-in-focus-after-india-launch-of-ai-first-martech-platform-unica/articleshow/123934974.cms",
            "description": "HCL Technologies’ software arm has launched HCL Unica+ in India, an AI-first MarTech platform designed for the Intelligence Economy. Aimed at tackling the challenges of India’s diverse, multi-lingual market, the platform enables brands to engage with over 800 million internet users. It focuses on delivering hyper-personalized interactions to build trust in an attention-scarce digital landscape.",
            "pubDate": "2025-09-17T05:01:02.749377"
        },
        {
            "title": "GMR Airports, Cyient among 8 stocks showing bullish White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmr-airports-cyient-among-8-stocks-showing-bullish-white-marubozu-pattern/slideshow/123934949.cms",
            "description": "On September 16, eight Nifty500 stocks triggered the bullish “White Marubozu” scanner, according to stockedge.com’s technical scan data.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest and the closing price is the highest for the given period.Depicted by a long white (or green) candlestick with no upper shadow and a small or absent lower shadow, it reflects strong buying pressure throughout the session. Traders view it as a signal that buyers dominated from open to close, often using the pattern to guide future trading decisions.",
            "pubDate": "2025-09-17T05:01:02.749485"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama initiates coverage on Eureka Forbes; Religare Broking positive on REC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-initiates-coverage-on-eureka-forbes-religare-broking-positive-on-rec/articleshow/123934845.cms",
            "description": "Brokerages stay bullish: Nuvama starts Eureka Forbes with Buy (20% upside), Motilal Oswal reaffirms Biocon Buy (13% upside), Religare Broking positive on REC Ltd (22% upside) citing strong growth drivers.",
            "pubDate": "2025-09-17T05:01:02.749582"
        },
        {
            "title": "Sensex climbs 300 pts, Nifty tops 25,300 on US trade talk progress, Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-climbs-150-pts-nifty-tops-25300-on-us-trade-talk-progress-fed-rate-cut-hopes/articleshow/123934615.cms",
            "description": "Indian benchmark indices Sensex and Nifty began positively on Wednesday, fueled by financial and automotive sectors. This surge followed the government's optimistic remarks on trade discussions with the US and anticipation of a Federal Reserve interest rate cut. The S&P BSE Sensex climbed by 0.21%, while the NSE Nifty increased by 0.24% at the opening.",
            "pubDate": "2025-09-17T05:01:02.749709"
        },
        {
            "title": "Mobikwik shares drop 2% after Rs 40 crore fraud, probe underway",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mobikwik-shares-in-focus-after-rs-40-crore-fraud-probe-underway/articleshow/123934753.cms",
            "description": "Mobikwik shares: The digital payments company lost about ₹40 crore in a suspected fraud caused by a system glitch that allowed nearly 5 lakh UPI transactions to bypass balance checks and PIN verification over two days.",
            "pubDate": "2025-09-17T05:01:02.749810"
        },
        {
            "title": "DreamFolks shares hit 5% lower circuit after exiting domestic lounge business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dreamfolks-services-shares-in-focus-on-domestic-lounge-aggregation-business-exit/articleshow/123934721.cms",
            "description": "DreamFolks Services shares: The company has immediately exited the domestic airport lounges business, calling the impact material, but will continue other services and global lounges while working on alternate offerings for clients.",
            "pubDate": "2025-09-17T05:01:02.749905"
        },
        {
            "title": "Eureka Forbes shares up 2% as Nuvama Institutional Equities initiates coverage with Buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eureka-forbes-shares-up-2-as-nuvama-institutional-equities-initiates-coverage-with-buy-rating/articleshow/123935826.cms",
            "description": "Eureka Forbes shares experienced a surge following Nuvama Institutional Equities initiating coverage with a 'Buy' rating, projecting a 20% upside. The brokerage highlights the company's dominant market share in water purifiers and vacuum cleaners, alongside a strong after-sales service network.",
            "pubDate": "2025-09-17T05:24:15.171781"
        },
        {
            "title": "Redington shares surge 5%, up nearly 25% in just 2 sessions. What’s fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-shares-surge-5-up-nearly-25-in-just-2-sessions-whats-fuelling-the-rally/articleshow/123935776.cms",
            "description": "Redington Limited's shares are up because of the upcoming iPhone 17 sales. Pre-orders are happening now, and sales start on September 19. The stock has increased significantly in two days. Redington handles the supply chain for Apple products. The company reported profit and revenue growth in the first quarter. However, technical indicators suggest a possible near-term pullback.",
            "pubDate": "2025-09-17T05:24:15.171902"
        },
        {
            "title": "Euro Pratik Sales IPO Day 2: GMP at 2.5%, subscribed 47%. Should You Bid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/euro-pratik-sales-ipo-day-2-gmp-at-2-5-subscribed-47-should-you-bid/articleshow/123935717.cms",
            "description": "Euro Pratik Sales IPO witnessed 47% subscription on its second day, driven by strong NII interest at 91%. The grey market premium saw a slight uptick to 2.5%. The IPO, a complete offer for sale, is priced between Rs 235-247. The company, a leading wall panel brand with robust financials and international presence, aims to list on September 23, 2025.",
            "pubDate": "2025-09-17T05:24:15.172103"
        }
    ]
}