{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-16T12:00:40.238467",
    "items": [
        {
            "title": "Sebi launches Rs 18 crore recovery proceedings against ‘Baap of Charts’ finfluencer, others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-launches-rs-18-crore-recovery-proceedings-against-baap-of-charts-finfluencer-others/articleshow/125994841.cms",
            "description": "Market regulator Sebi has initiated recovery proceedings against finfluencer 'Baap of Charts' (Mohammad Nasiruddin Ansari), Rahul Rao Padamati, and Golden Syndicate Ventures Pvt. Ltd. for failing to pay dues totaling around Rs 18 crore. Sebi previously banned Ansari for acting as an unregistered investment adviser, luring investors with promises of profit.",
            "pubDate": "2025-12-16T04:20:24.489663"
        },
        {
            "title": "Sensex falls over 400 pts, Nifty below 25,950 as US trade deal uncertainty drags",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-over-300-pts-nifty-below-26000-as-us-trade-deal-uncertainty-drags/articleshow/125994720.cms",
            "description": "Indian stock markets opened lower today. The Sensex and Nifty declined, continuing yesterday's trend. Foreign investors are selling shares. The Indian rupee weakened against the dollar. Uncertainty surrounds a trade deal with the United States. Broader markets also faced pressure. Investors await new developments and clarity on the trade agreement.",
            "pubDate": "2025-12-16T04:20:24.489788"
        },
        {
            "title": "Kaynes Technology among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125994752.cms",
            "description": "As of December 15, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% compared with the previous trade. A significant rise in futures open interest indicates growth in the number of active, unexpired futures contracts, reflecting traders initiating fresh positions or expanding existing ones.",
            "pubDate": "2025-12-16T04:20:24.489890"
        },
        {
            "title": "Nifty to trounce S&P 500 in 2026 comeback, predicts BofA's Amish Shah but 4 major threats loom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-to-trounce-sp-500-in-2026-comeback-predicts-bofas-amish-shah-but-4-major-threats-loom/articleshow/125994804.cms",
            "description": "BofA predicts Nifty will trounce the S&P 500 in 2026 with an 11-12% surge, reversing a tough 2025. This optimism is fueled by improving earnings visibility and expected foreign investor inflows. However, currency fluctuations, crude oil prices, a delayed India-US trade deal, and a potential US AI bubble pose significant risks.",
            "pubDate": "2025-12-16T04:20:24.489987"
        },
        {
            "title": "Citi picks Infosys and HCL Tech over other large-cap IT stocks as recovery remains slow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citi-picks-infosys-and-hcl-tech-over-other-large-cap-it-stocks-as-recovery-remains-slow/articleshow/125994536.cms",
            "description": "Citi has maintained a cautious view on the IT services sector, citing a slow and uncertain recovery in demand. Within Indian IT, the brokerage prefers Infosys and HCL Technologies over other large-cap peers, even as it keeps a guarded stance on the sector and says a macro-led rebound has yet to materialise.",
            "pubDate": "2025-12-16T04:20:24.490093"
        },
        {
            "title": "Inox Wind shares in focus on second order win in 2 days. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-shares-in-focus-on-second-order-win-in-2-days-check-details/articleshow/125994511.cms",
            "description": "Inox Wind's shares are expected to see activity following a new 100-MW order from Jakson Green. This follows a recent 102.3-MW order from ABREL EPC. These orders could significantly boost the company's order book. Inox Wind recently reported its strongest second-quarter results, showing improved execution and profitability. The company is well-positioned for future growth.",
            "pubDate": "2025-12-16T04:20:24.490196"
        },
        {
            "title": "NBCC, GMDC and 4 other stocks that flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-gmdc-and-4-other-stocks-that-flash-bullish-signals-indicating-possible-uptrend/slideshow/125994565.cms",
            "description": "On December 15, six stocks in the Nifty200 pack appeared on the bullish scanner of \"White Marubozu,\" according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.\"",
            "pubDate": "2025-12-16T04:20:24.490300"
        },
        {
            "title": "HDFC Life, SBI Life, among other insurance stocks in focus as govt set to table insurance bill to hike FDI limit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-life-sbi-life-among-other-insurance-stocks-in-focus-as-govt-set-to-table-insurance-bill-to-hike-fdi-limit/articleshow/125994408.cms",
            "description": "Insurance stocks may remain in focus as the government moves to introduce the Sabka Bima Sabki Raksha Bill in Parliament. The proposal to allow 100% FDI, alongside governance safeguards, is expected to improve sector transparency, ease of doing business and long-term insurance penetration in India.",
            "pubDate": "2025-12-16T04:20:24.490400"
        },
        {
            "title": "Texmaco Rail shares in focus on winning Rs 132 crore wagon supply order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/texmaco-rail-shares-in-focus-on-winning-rs-132-crore-wagon-supply-order/articleshow/125994361.cms",
            "description": "Texmaco Rail shares: The company's JV, Touax Texmaco Railcar Leasing, bagged a ₹132 crore domestic order to supply a rake of BLSS and BVCM wagons.",
            "pubDate": "2025-12-16T04:20:24.490493"
        },
        {
            "title": "Japan's Nikkei falls 1% as AI stocks slip ahead of US jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-1-as-ai-stocks-slip-ahead-of-us-jobs-data/articleshow/125994287.cms",
            "description": "Japan's Nikkei index fell over 1 percent on Tuesday. This decline was driven by losses in chip and AI-related stocks. Investors are adopting a cautious approach. They await key US employment data today and the Bank of Japan's policy decision on Friday. Many stocks on the Nikkei saw drops, with only airlines and agriculture sectors trading higher.",
            "pubDate": "2025-12-16T04:20:24.490619"
        },
        {
            "title": "Delhivery shares in focus after launching on-demand delivery in Mumbai, Hyderabad",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/delhivery-shares-in-focus-after-launching-on-demand-delivery-in-mumbai-hyderabad/articleshow/125994261.cms",
            "description": "Delhivery is launching its on-demand intracity shipping service, Delhivery Direct, in Mumbai and Hyderabad, offering rapid pickups for small businesses and individuals. This expansion follows a Q2 where the company reported record shipment volumes despite a net loss. The service aims to cater to the growing demand for local logistics across India.",
            "pubDate": "2025-12-16T04:20:24.490729"
        },
        {
            "title": "Biocon among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-among-5-stocks-showing-bullish-rsi-upswing/slideshow/125994268.cms",
            "description": "On December 15, five Nifty200 stocks featured in the RSI Trending Up scan on StockEdge. An RSI crossing above 50 from lower levels signals strengthening momentum and is often viewed as an early uptrend indicator, highlighting potential buying opportunities as price strength begins to emerge.",
            "pubDate": "2025-12-16T04:20:24.490823"
        },
        {
            "title": "RBL Bank shares in focus as CFO Buvanesh Tharashankar resigns with immediate effect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-as-cfo-buvanesh-tharashankar-resigns-with-immediate-effect/articleshow/125993707.cms",
            "description": "RBL Bank shares will be in focus following the immediate resignation of its Chief Financial Officer, Buvanesh Tharashankar. Tharashankar stepped down to pursue opportunities outside the organization. The bank has already identified an interim successor as part of its succession plan. His resignation was accepted on December 15, with his duties ceasing that day.",
            "pubDate": "2025-12-16T04:20:24.490917"
        },
        {
            "title": "HDFC Bank shares in focus as RBI approves up to 9.5% stake acquisition in IndusInd Bank by group entities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-in-focus-as-rbi-approves-up-to-9-5-stake-acquisition-in-indusind-bank-by-group-entities/articleshow/125993596.cms",
            "description": "HDFC Bank's group entities have received RBI approval to acquire up to 9.50% in IndusInd Bank. The approval, valid until December 14, 2026, covers entities like HDFC Mutual Fund and HDFC Life Insurance. This precautionary measure was taken due to potential aggregate shareholding exceeding regulatory thresholds.",
            "pubDate": "2025-12-16T04:20:24.491010"
        },
        {
            "title": "Tata Power shares in focus as co targets Rs 25,000 crore annual capex through FY30",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-power-shares-in-focus-as-co-targets-rs-25000-crore-annual-capex-through-fy30/articleshow/125993584.cms",
            "description": "Tata Power plans a substantial Rs 25,000 crore investment this fiscal year.  A significant portion will fund clean energy projects.  The company aims to double its renewable capacity and expand its customer base.  New licenses are being sought in various states.  This strategic move signals a major growth phase for Tata Power.",
            "pubDate": "2025-12-16T04:20:24.491108"
        },
        {
            "title": "Stocks to buy for 2026: Adani Ports, JSW Infrastructure among top 5 stocks that could deliver 10-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-adani-ports-jsw-infrastructure-among-top-5-stocks-that-could-deliver-10-30-return/slideshow/125993569.cms",
            "description": "Brokerage houses continue to flag selective opportunities across infrastructure, aviation and manufacturing stocks, citing a combination of sector tailwinds, improving earnings visibility and favourable valuations.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-16T04:20:24.491203"
        },
        {
            "title": "Fertilizer stocks Rashtriya Chemicals, Paradeep Phosphates, others soar up to 7%. What’s fuelling the surge today?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fertilizer-stocks-rashtriya-chemicals-paradeep-phosphates-others-soar-up-to-7-whats-fuelling-the-surge-today/articleshow/125995730.cms",
            "description": "Fertiliser stocks surged as Finance Minister Nirmala Sitharaman assured no shortage of urea for the current rabi season. The government has ramped up urea imports and increased subsidies to ensure farmers receive adequate nutrients at affordable prices.  India's urea imports more than doubled during April-October to meet domestic demand.",
            "pubDate": "2025-12-16T05:11:21.598167"
        },
        {
            "title": "Despite up to 35% fall, FII ownership rises most in 10 IT stocks including Hexaware, Tata Technologies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-up-to-35-fall-fii-ownership-rises-most-in-10-it-stocks-including-hexaware-tata-technologies/slideshow/125995902.cms",
            "description": "The IT sector has emerged as one of the worst-performing sectors over the past year, weighed down by heavy selling from foreign institutional investors (FIIs). An analysis of the BSE Information Technology index shows that overseas investors have pared their holdings in 49 stocks, or about 64% of the constituents, since the December quarter of CY24. However, FIIs have continued to back select names, raising their stakes in 27 stocks (36%) over the period ended September 30, 2025. Here’s a look at the top 10 stocks that saw the highest FII buying during this phase:",
            "pubDate": "2025-12-16T05:11:21.598275"
        },
        {
            "title": "Buy, Sell or Hold: Citi maintains buy on ICICI Bank; Motilal Oswal remains neutral on Bajaj Auto",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-buy-on-icici-bank-motilal-oswal-remains-neutral-on-bajaj-auto/articleshow/125995557.cms",
            "description": "Brokerage calls remain stock-specific in a mixed market. Citi has reiterated its Buy rating on ICICI Bank, citing diversified loan growth and steady earnings visibility, while Motilal Oswal has maintained a Neutral view on Bajaj Auto, balancing strong exports and EV ambitions against execution and market-share recovery risks.",
            "pubDate": "2025-12-16T05:11:21.598376"
        },
        {
            "title": "Adani Power shares can rally 30%, says Antique after initiating coverage with 'Buy' rating. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-can-rally-30-says-antique-after-initiating-coverage-with-buy-rating-heres-why/articleshow/125995320.cms",
            "description": "Adani Power shares could rally up to 30%, says Antique Stock Broking, which has initiated coverage with a Buy rating. The brokerage cites a strong earnings upcycle driven by aggressive capacity expansion, rising baseload power demand, and improved cash-flow visibility from long-term PPAs.",
            "pubDate": "2025-12-16T05:11:21.598471"
        },
        {
            "title": "Risk-off 2025 brings largecaps back on top after two-year hiatus; what does 2026 hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/risk-off-2025-brings-largecaps-back-on-top-after-two-year-hiatus-what-does-2026-hold/articleshow/125995265.cms",
            "description": "Large-cap stocks are poised to finish 2025 as top performers, outshining mid and small-cap peers and reaffirming their safe-haven status. This year has seen big companies reclaim their defensive edge, a shift from the broader market's dominance in previous years. Despite a volatile first half, largecaps have shown resilience, with many delivering positive returns.",
            "pubDate": "2025-12-16T05:11:21.598568"
        },
        {
            "title": "Wealth creation surges in India as global HNIs embrace new investment themes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-creation-surges-in-india-as-global-hnis-embrace-new-investment-themes/articleshow/125996022.cms",
            "description": "2025 marked a transformative year for global wealth, driven by next-gen investors, expanding family offices, and rising alternative assets. India emerged as a fast-growing HNI market, while US HNIs rebalanced portfolios toward private and thematic investments. Luxury and sustainable assets gained prominence, reshaping global wealth management strategies for the future.",
            "pubDate": "2025-12-16T05:36:30.168217"
        },
        {
            "title": "Meesho shares zoom 13% to fresh peak; market cap tops Rs 85,000 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-zoom-13-to-fresh-peak-market-cap-tops-rs-85000-crore/articleshow/125995983.cms",
            "description": "Newly listed Meesho shares rose sharply to a fresh high, pushing the company's market capitalisation past Rs 85,000 crore despite weak broader markets. Strong trading volumes and a bullish initiation by Choice Institutional Equities, citing a faster path to profitability, reinforced investor confidence in the stock’s post-listing rally.",
            "pubDate": "2025-12-16T05:36:30.168328"
        },
        {
            "title": "Elon Musk’s fortune breaks the $600 billion mark as new SpaceX valuation ignites wealth surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musks-fortune-breaks-the-600-billion-mark-as-new-spacex-valuation-ignites-wealth-surge/articleshow/125996474.cms",
            "description": "Elon Musk has reached a new financial milestone. His net worth has crossed $600 billion for the first time. This surge is thanks to a fresh valuation of his company, SpaceX. The private rocket maker is now valued at $800 billion. This makes SpaceX the world's most valuable private firm. Musk's stake in SpaceX is worth over $317 billion.",
            "pubDate": "2025-12-16T05:50:27.661161"
        },
        {
            "title": "Meesho founder Vidit Aatrey joins the billionaire club as stock rockets 74% from issue price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-founder-vidit-aatrey-joins-the-billionaire-club-as-stock-rockets-74-from-issue-price/articleshow/125996583.cms",
            "description": "Meesho Ltd’s shares surged more than 74% from their issue price days after listing, lifting co-founder Vidit Aatrey into the billionaire club as investor enthusiasm builds around the e-commerce firm’s post-IPO momentum.",
            "pubDate": "2025-12-16T05:58:07.046845"
        },
        {
            "title": "India market regulator panel to recommend easing rules for commodity derivatives, sources say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-market-regulator-panel-to-recommend-easing-rules-for-commodity-derivatives-sources-say/articleshow/125996567.cms",
            "description": "India's market regulator SEBI's panel will soon suggest easing curbs on commodity derivatives. The report will propose making these markets more attractive to institutional investors. Bans on derivatives trading for seven agricultural commodities may be lifted. The panel also recommends changes to tax laws and allowing trading firms to colocate on exchange premises.",
            "pubDate": "2025-12-16T05:58:07.046983"
        },
        {
            "title": "From a long-term investing perspective: 5 mid-caps from different sectors with strong brands, and upside potential of up to 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-a-long-term-investing-perspective-5-mid-caps-from-different-sectors-with-strong-brands-and-upside-potential-of-up-to-27/articleshow/125996740.cms",
            "description": "Tata, Birla, Ambani, Adani. These are not just names, they are also brands… brands that have even seeped into popular culture. But do all widely recognizable brands belong to large-cap companies? While most do, there are several mid-cap companies that have also built brands that have huge recall value. When they do that, it gives them an edge that many of their competitors lack. This edge is not easy to build as it not only requires capital, but foresight on part of the promoters. As also a system in process in the company which owns that brand. So, what does owning a strong brand mean in the end? The ability to price, to endure a slowdown much better. And also brand extension.",
            "pubDate": "2025-12-16T06:34:39.012109"
        },
        {
            "title": "Shakti Pumps shares gain 40% in just 4 days. What's fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shakti-pumps-shares-gain-40-in-just-4-days-whats-fuelling-the-rally/articleshow/125997049.cms",
            "description": "Shakti Pumps’ shares surged for the fourth consecutive day, driven by multiple large solar pump orders across Maharashtra, Jharkhand, and Madhya Pradesh. The strong order inflow underscores its leadership in solar-powered irrigation solutions, boosting market confidence. Technical indicators show healthy momentum, supporting continued investor interest amid positive sectoral trends.",
            "pubDate": "2025-12-16T06:34:39.012243"
        },
        {
            "title": "Axis Bank shares slide 4% as management pushes back NIM recovery by two quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-shares-tumble-4-as-citi-research-sees-no-upside-reiterates-neutral-stance/articleshow/125996940.cms",
            "description": "Axis Bank shares dropped 4% after management delayed its NIM recovery outlook, now expecting margins to bottom out in Q4 or early Q1. While fee income remains constrained and profitability has softened, easing stress in retail portfolios and improving corporate demand offer some support. The stock is still up 16% year to date.",
            "pubDate": "2025-12-16T06:34:39.012447"
        },
        {
            "title": "F&O Radar| Deploy Batman strategy in Nifty for potential gains from a sideways index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-batman-strategy-in-nifty-for-potential-gains-from-a-sideways-index/articleshow/125998699.cms",
            "description": "Nifty’s recent consolidation has opened up tactical opportunities for options traders. With FIIs building short positions and volatility staying muted, ICICI Securities’ Jay Thakkar suggests deploying a Batman strategy to benefit from sideways movement, while clearly defining profit zones and stop-loss levels.",
            "pubDate": "2025-12-16T07:57:29.104742"
        },
        {
            "title": "PVR Inox shares may gain another 15% on Dhurandhar buzz, upcoming releases, says MOFSL analyst",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pvr-inox-shares-may-gain-another-15-on-dhurandhar-box-office-success-upcoming-releases-says-mofsl-analyst/articleshow/125998542.cms",
            "description": "PVR Inox shares rose on Tuesday as strong box-office collections from Dhurandhar lifted optimism around the cinema chain stock. Motilal Oswal's Nandish Shah sees up to 15% upside, citing a robust film pipeline and improving occupancy, while cautioning that earnings remain sensitive to content quality and footfalls.",
            "pubDate": "2025-12-16T07:57:29.104854"
        },
        {
            "title": "Bengaluru gives India another billionaire. Who is IIT engineer & Meesho cofounder Vidit Aatrey?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bengaluru-gives-india-another-billionaire-who-is-iit-engineer-meesho-cofounder-vidit-aatrey/articleshow/125998435.cms",
            "description": "Meesho co-founder and CEO Vidit Aatrey has joined India’s billionaire club after the newly listed e-commerce firm’s shares surged 13% to a fresh high. The rally lifted Meesho’s market value past Rs 85,000 crore, boosting Aatrey’s 11.1% stake beyond $1 billion.",
            "pubDate": "2025-12-16T07:57:29.105068"
        },
        {
            "title": "Rs 32,000 crore surge in 6 days! Silver’s record rally powers 15% jump in Hindustan Zinc stock. What’s next for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-32000-crore-surge-in-6-days-silvers-record-rally-powers-15-jump-in-hindustan-zinc-stock-whats-next-for-investors/articleshow/125998326.cms",
            "description": "Hindustan Zinc shares have surged on a record rally in silver prices, rising 15% in six sessions and adding ₹32,000 crore in market value, as silver crossed ₹2 lakh on MCX and hit about $65 globally. Supported by low-cost zinc operations, the stock is up over 28% in 2025, with investors now weighing whether the momentum can extend into 2026.",
            "pubDate": "2025-12-16T07:57:29.105166"
        },
        {
            "title": "SEPC shares zoom 8% on Rs 270 crore railway order win from North Western Railway",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sepc-shares-zoom-8-on-rs-270-crore-railway-order-win-from-north-western-railway/articleshow/125998224.cms",
            "description": "C jumped after the company won a ₹269.69 crore railway infrastructure contract for the Ajmer–Chanderiya Doubling Project under North Western Railway.",
            "pubDate": "2025-12-16T07:57:29.105265"
        },
        {
            "title": "PB Fintech shares decline 6% amid reports of regulatory push to cap insurance agent commissions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pb-fintech-shares-decline-6-amid-reports-of-regulatory-push-to-cap-insurance-agent-commissions/articleshow/125999687.cms",
            "description": "PB Fintech shares fell amid concerns that the proposed Insurance Bill 2025 could allow IRDAI to cap insurance agent commissions, raising regulatory risks for digital insurance marketplaces and intermediaries.",
            "pubDate": "2025-12-16T08:54:51.181766"
        },
        {
            "title": "These 9 stocks added by over 15 MFs in November ’25 surge up to 115% in FY26. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-stocks-added-by-over-15-mfs-in-november-25-surge-up-to-115-in-fy26-do-you-own-any/slideshow/126000470.cms",
            "description": "In November 2025, mutual funds (MFs) continued to show strong conviction in Indian equities, recording net investments of around Rs 43,465 crore during the month. An ETMarkets analysis revealed that nine stocks were added to the portfolios of 15 or more mutual fund schemes in November, marking an increase compared to October 2025. Notably, all nine stocks have generated double-digit returns so far in FY26, with Ather Energy surging over 100% from its issue price. (Data Source: ACE MF | ACE Equity)",
            "pubDate": "2025-12-16T09:18:38.116830"
        },
        {
            "title": "Japan's Nikkei slumps as AI stocks tumble ahead of US jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slumps-as-ai-stocks-tumble-ahead-of-us-jobs-data/articleshow/126000170.cms",
            "description": "Japan's Nikkei share average dropped more than 1% on Tuesday, weighed down by declines in chip and other artificial intelligence-linked stocks ahead of crucial U.S. employment data later in the day.",
            "pubDate": "2025-12-16T09:18:38.116941"
        },
        {
            "title": "European shares edge lower ahead of crucial US jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-lower-ahead-of-crucial-us-jobs-data/articleshow/126000114.cms",
            "description": "European shares drifted lower on Tuesday, pulling back after robust gains in the previous session, while investor caution ahead of crucial U.S. jobs data added to the dour mood.",
            "pubDate": "2025-12-16T09:18:38.117035"
        },
        {
            "title": "Gujarat Kidney and Super Speciality IPO: Company sets price band at Rs 108 – Rs 114 per share. Check GMP, other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-kidney-and-super-speciality-ipo-company-sets-price-band-at-rs-108-rs-114-per-share-check-gmp-other-details/articleshow/126000641.cms",
            "description": "Gujarat Kidney and Super Speciality has set a price band of ₹108–114 for its ₹251 crore IPO, which will open for subscription from December 22 to 24, 2025. The issue is a fresh offer of up to 2.2 crore shares, with allocations of 75% for QIBs, 15% for NIIs and 10% for retail investors.",
            "pubDate": "2025-12-16T09:43:09.411919"
        },
        {
            "title": "Vedanta shares jump 3% on reports of NCLT approval to demerger plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nclt-approves-vedantas-demerger-plan-stock-jumps-3/articleshow/126000529.cms",
            "description": "Vedanta  Demerger: The demerger will lead to the creation of five separate entities - aluminium, oil & gas, ferrous, power and steel.​",
            "pubDate": "2025-12-16T09:43:09.412052"
        },
        {
            "title": "Elon Musk now 4 times richer than Warren Buffett, after making more in 1 day than Oracle of Omaha’s entire fortune",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musk-now-4-times-richer-than-warren-buffett-after-making-more-in-1-day-than-oracle-of-omahas-entire-fortune/articleshow/126000533.cms",
            "description": "Elon Musk’s net worth surged past $600 billion after a sharp one-day jump, driven by a major revaluation of SpaceX. The rise has widened the gap between Musk and other global billionaires, highlighting SpaceX’s growing role in his wealth and fuelling speculation about a future trillionaire milestone.",
            "pubDate": "2025-12-16T09:43:09.412285"
        },
        {
            "title": "Market Wrap: Sensex slides 533 pts, Nifty below 25,900 as foreign outflows, weak rupee pressure markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slides-533-pts-nifty-below-25900-as-foreign-outflows-weak-rupee-pressure-markets/articleshow/126001624.cms",
            "description": "Indian equities extended their decline for a second consecutive session on Tuesday, with both the Sensex and Nifty closing lower. Persistent foreign portfolio outflows and a weakening rupee contributed to investor caution, further amplified by uncertainty surrounding a potential U.S. trade deal.",
            "pubDate": "2025-12-16T10:44:36.810598"
        },
        {
            "title": "Stock Radar: Delhivery down from November 2025 highs; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-delhivery-down-from-november-2025-highs-what-should-investors-do/articleshow/125978205.cms",
            "description": "Delhivery Ltd has failed to sustain its record highs, with chart patterns indicating a potential continuation of weakness. Experts suggest short-to-medium term traders consider selling the stock now or on a minor bounce, targeting Rs 370-380 in the next 1-2 months. The stock is currently in a short-term downtrend, trading below key moving averages.",
            "pubDate": "2025-12-16T11:33:28.025740"
        },
        {
            "title": "Wall Street banks prepare for round-the-clock stock trading, reluctantly",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-banks-prepare-for-round-the-clock-stock-trading-reluctantly/articleshow/126002919.cms",
            "description": "Round-the-clock trading is fast approaching U.S. stock markets, but not all of Wall Street is embracing the move. Several of the largest U.S. banks are reluctant to push aggressively into enabling round-the-clock stock trading, even as equity markets are marching toward a broad rollout of nearly nonstop trading later next year and exchanges are preparing for action.",
            "pubDate": "2025-12-16T11:45:13.857352"
        },
        {
            "title": "Gainers & Losers: Vedanta, Axis Bank among 7 stocks under the spotlight on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-vedanta-axis-bank-among-7-stocks-under-the-spotlight-on-tuesday/slideshow/126003241.cms",
            "description": "",
            "pubDate": "2025-12-16T11:53:00.045260"
        },
        {
            "title": "Nasdaq is planning for 24-hour trading. What does it mean for Indian stock markets?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-is-planning-for-24-hour-trading-what-does-it-mean-for-indian-stock-markets/articleshow/126003549.cms",
            "description": "Nasdaq’s plan for 24x7 trading could change how Indian markets absorb global cues, with price discovery becoming continuous rather than overnight. Experts say this may increase opening gaps and short-term volatility in globally sensitive sectors, even as India’s long-term market drivers remain largely domestic.",
            "pubDate": "2025-12-16T12:00:39.552166"
        }
    ]
}