{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-14T15:18:12.631312",
    "items": [
        {
            "title": "LIC-backed Paisalo Digital in focus as promoter raises 0.5% stake in smallcap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-backed-paisalo-digital-in-focus-as-promoter-raises-0-5-stake-in-smallcap/articleshow/123878530.cms",
            "description": "Paisalo Digital gained attention after promoter Equilibrated Venture Cflow raised its stake to 18.17% by acquiring 45 lakh shares. Despite underperforming with a 37% yearly decline, the NBFC reported Q1 profit of Rs 47 crore, strong AUM of Rs 5,203 crore, and remains supported by LIC’s holding.",
            "pubDate": "2025-09-14T05:14:45.312335"
        },
        {
            "title": "Market outlook & stock picks: Anand James’ guide for the week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-outlook-stock-picks-anand-james-guide-for-the-week/articleshow/123878447.cms",
            "description": "Nifty’s uptrend continues with limited upside amid low volatility, while IT faces resistance at key levels. Expiry shifts boost volumes, Sebi’s weekly expiry debate heats up. Anand James recommends Datamatics and Graphite as bullish stock opportunities with favourable technical setups.",
            "pubDate": "2025-09-14T05:14:45.312457"
        },
        {
            "title": "Tata Chemicals features in Motilal Oswal’s top 3 trading bets. Check other names",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-chemicals-features-in-motilal-oswals-top-3-trading-bets-check-other-names/slideshow/123878304.cms",
            "description": "The Nifty is on the cusp of a potential breakout from a Symmetrical Triangle pattern on the daily charts — a formation that typically signals a strong directional move. The index continues to trade above both its short-term and long-term moving averages, which have begun to slope upward, offering a bullish undertone to the market’s technical setup.With momentum indicators also turning constructive, domestic brokerage firm Motilal Oswal has highlighted its top three picks, based on the technical outlook, that traders can keep on their radar.",
            "pubDate": "2025-09-14T05:14:45.312568"
        },
        {
            "title": "Nifty's stealth 8-day rally: Are bulls loading up for an explosive breakout Monday onwards?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niftys-stealth-8-day-rally-are-bulls-loading-up-for-an-explosive-breakout-monday-onwards/articleshow/123878428.cms",
            "description": "The Nifty has logged eight straight gains, quietly rising 500 points. Technicals suggest a breakout from a Symmetrical Triangle, with RSI momentum strengthening. Broad-based participation, supportive macros, and hopes of Fed rate cuts fuel optimism, though Trump’s tariff threats remain the wild card.",
            "pubDate": "2025-09-14T05:14:45.312670"
        },
        {
            "title": "OFFS shares witness a roller coaster week. Rs 10,000 target emerges as volatility eases",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/offs-shares-witness-a-roller-coaster-week-rs-10000-target-emerges-as-volatility-eases/articleshow/123878137.cms",
            "description": "OFSS shares experienced volatility, influenced by Oracle Corp's rally. After initial profit-taking, renewed buying interest emerged, reclaiming key technical levels. Analysts note improving technical structure and rising volumes, suggesting a potential rally towards Rs 10,000 if the stock sustains above critical support levels, particularly Rs 8,600.",
            "pubDate": "2025-09-14T05:14:45.312773"
        },
        {
            "title": "Market Outlook: Fed meet, FII action among 8 factors to impact Sensex, Nifty this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-outlook-fed-meet-fii-action-among-8-factors-to-impact-sensex-nifty-this-week/articleshow/123878125.cms",
            "description": "Indian benchmark indices closed higher, fueled by auto, bank, and pharma stocks, while investors await the Fed's policy decision amid expectations of a rate cut. Corporate actions, including dividends and stock splits, are lined up, and several IPOs are set to hit the market. FII/DII activity, technical factors, rupee movement, and crude oil prices will also influence market direction.",
            "pubDate": "2025-09-14T05:14:45.312876"
        },
        {
            "title": "For long-term investors with ability to ignore short-term volatility: 5 small-cap stocks with an upside potential of up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-long-term-investors-with-ability-to-ignore-short-term-volatility-5-small-cap-stocks-with-an-upside-potential-of-up-to-40/articleshow/123877446.cms",
            "description": "It is well known that small-cap stocks have a higher element of risk. In fact, this is clearly evident in the way they have moved in the past year. Most have underperformed and are quoting at levels lower than a year back. But here’s another way to look at this: Compare their levels five years ago with today. They are higher today, even after taking into account the corrections of the past year. The bottom line: If you are careful, you can ensure that you get that extra return for the extra risk taken. Now, why are we talking about this at this juncture? After many months of correction, the last three weeks have seen the bulls make a comeback. As market breadth is also better, the probability of things turning better for the mid-cap segment is higher.",
            "pubDate": "2025-09-14T05:14:45.312987"
        },
        {
            "title": "GST 2.0 and ripple effect on luxury, investments, and wealth planning",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-2-0-and-ripple-effect-on-luxury-investments-and-wealth-planning/articleshow/123878639.cms",
            "description": "GST 2.0 simplifies India’s indirect tax regime with two core rates of 5% and 18%, plus a 40% de-merit slab. Insurance premiums become GST-exempt, renewables gain from lower costs, and consumer electronics see relief. The reform aims to boost compliance, influence spending patterns, and realign sectoral margins.",
            "pubDate": "2025-09-14T05:29:52.015262"
        },
        {
            "title": "Mcap of eight of top-10 most valued firms jumps by Rs 1.69 lakh cr; Bajaj Finance biggest gainer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-eight-of-top-10-most-valued-firms-jumps-by-rs-1-69-lakh-cr-bajaj-finance-biggest-gainer/articleshow/123878593.cms",
            "description": "The combined market valuation of eight of the top-10 most valued firms jumped by Rs 1,69,506.83 crore last week in tandem with an optimistic trend at the Dalal Street, where Bajaj Finance emerged as the biggest gainer.",
            "pubDate": "2025-09-14T05:29:52.015387"
        },
        {
            "title": "Market Trading Guide: Buy RailTel, Bajaj Finance, and 3 more stocks on Monday; gains seen up to 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-railtel-bajaj-finance-and-3-more-stocks-on-monday-gains-seen-up-to-9/slideshow/123878590.cms",
            "description": "Indian benchmark indices maintained their winning streak on Friday with Nifty closing the session positive for the eighth successive time. The index managed to stay in the green as PUT writers provided support around the 25,000 mark.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities, said that Nifty appears to be consolidating its recent gains, gradually forming a base. \"As long as it sustains above 24,850, the undertone remains constructive. A decisive move beyond 25,150 may set the stage for a rally towards 25,500 in the near term,\" De said.Here are 5 stock recommendations for Monday:",
            "pubDate": "2025-09-14T05:29:52.015492"
        },
        {
            "title": "Defence stocks explode Rs 43,000 crore in single day: Is this the dawn of a super rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-explode-rs-43000-crore-in-single-day-is-this-the-dawn-of-a-super-rally/articleshow/123880026.cms",
            "description": "Defence stocks surged Rs 43,000 crore on Friday, lifting the Nifty Defence index to an eight-week high. Gains were driven by new submarine orders, a 15-year MoD modernisation roadmap, and strong order books. Analysts see long-term potential but caution that near-term upside may be limited by valuations and execution capacity.",
            "pubDate": "2025-09-14T07:56:29.571982"
        },
        {
            "title": "Nifty rises for 2nd week; Sept 18–19 flagged as crucial dates for traders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-rises-for-2nd-week-sept-1819-flagged-as-crucial-dates-for-traders/articleshow/123879468.cms",
            "description": "The Indian equity market gained 1.5% for the week ended September 12, 2025, despite FII selling of Rs 11,169 crore. Nifty validated a high-momentum projection, with key time clusters for Sept 15–19 highlighting potential reversals. Traders are advised to manage risk and watch support-resistance levels.",
            "pubDate": "2025-09-14T07:56:29.572110"
        },
        {
            "title": "PSU stocks shine in FY26: 11 gain over 25%, one turns multibagger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-stocks-shine-in-fy26-11-gain-over-25-one-turns-multibagger/slideshow/123879432.cms",
            "description": "The majority of PSU stocks are trading positive so far in FY26, signaling renewed investor confidence. The BSE PSU Index has posted an impressive 6.1% gain, slightly outpacing the benchmark Sensex, which rose 5.8% during the same period.Out of 62 listed PSU stocks on the BSE, 47 have delivered positive returns so far this fiscal. Notably, 31 of these winners have clocked in double-digit gains, signaling strong investor interest in the government-backed sector. Topping the charts are 11 PSU stocks that have surged over 25%, with one turning multibagger, and another close to doubling investors' money. These standout performers reflect renewed market confidence in the PSU space, often seen as a barometer of the broader economy.However, it hasn't been a smooth ride for all. On the flip side, five PSU stocks have seen a sharp decline of over 10%, including names like General Insurance Corporation of India, REC, Central Bank of India, UCO Bank, and Punjab & Sind Bank. Despite these laggards, the overall sentiment around PSUs remains upbeat, buoyed by ongoing government reforms and sectoral tailwinds (Data Source: ACE Equity).",
            "pubDate": "2025-09-14T07:56:29.572214"
        },
        {
            "title": "Adani Power shares up 8% in 2 weeks. Should you buy before the stock split clock runs out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-up-8-in-2-weeks-should-you-buy-before-the-stock-split-clock-runs-out/articleshow/123879130.cms",
            "description": "Adani Power shares have gained 23% this year, driven by new project wins, regulatory approvals, and an upcoming stock split on September 22. Analysts see strong momentum with upside toward Rs 700–730, supported by technical patterns and enhanced retail participation, while investors weigh near-term opportunities versus potential volatility.",
            "pubDate": "2025-09-14T07:56:29.572313"
        },
        {
            "title": "​9 penny stocks jumped up to 50% in two weeks. Did you catch the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-penny-stocks-jumped-up-to-50-in-two-weeks-did-you-catch-the-rally/slideshow/123879080.cms",
            "description": "Over the past 2 weeks, eight penny stocks have delivered strong gains, rising between 25% and 52%. These top performers were identified through a targeted screening that focused on companies with a market capitalization below Rs 1,000 crore, a share price under Rs 20, and a recent trading volume of at least 5 lakh shares. The strategy highlights low-priced, actively traded small-cap stocks showing robust upward momentum. (Data Source: ACE Equity)",
            "pubDate": "2025-09-14T07:56:29.572411"
        },
        {
            "title": "Rs 32,000 crore festive IPO boom? LG Electronics, Tata Capital to test investor appetite this Diwali",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-32000-crore-festive-ipo-boom-lg-electronics-tata-capital-to-test-investor-appetite-this-diwali/articleshow/123878702.cms",
            "description": "India’s IPO market gears up for October with Tata Capital’s Rs 17,000-crore issue and LG Electronics’ Rs 15,000-crore debut, together worth Rs 32,000 crore. These mega offerings, amid a record fundraising year, will test investor appetite during the festive season.",
            "pubDate": "2025-09-14T07:56:29.572510"
        },
        {
            "title": "Ola Electric vs Ather Energy shares: Which EV bet looks stronger for your portfolio right now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-vs-ather-energy-shares-which-ev-bet-looks-stronger-for-your-portfolio-right-now/articleshow/123880380.cms",
            "description": "Ather Energy shares have surged 66% post-IPO, while Ola Electric has lost 22.5% since debut. Analysts highlight Ather’s strong revenue growth and momentum, versus Ola’s larger scale and policy advantages, leaving investors to weigh high-risk, high-growth EV bets carefully for portfolio inclusion.",
            "pubDate": "2025-09-14T08:44:30.731306"
        },
        {
            "title": "Why buybacks look good for companies but hurt investors, Deepak Shenoy breaks down",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-buybacks-look-good-for-companies-but-hurt-investors-deepak-shenoy-breaks-down/articleshow/123880611.cms",
            "description": "Share buybacks boost earnings per share and make companies look leaner, but high taxes often reduce gains for Indian retail investors. Experts advise evaluating post-tax returns carefully, as selling shares in the market may offer better after-tax outcomes.",
            "pubDate": "2025-09-14T10:50:55.632597"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/123880488.cms",
            "description": "Indian markets closed higher on Friday, with Nifty 50 rising for an eighth consecutive session, supported by softer U.S. labor data, potential Fed rate cuts, and progress in U.S.-India trade talks. Domestic buying interest was seen in JBM Auto, Hindustan Copper, and Gujarat Mineral Development, while global markets showed mixed trends.",
            "pubDate": "2025-09-14T10:50:55.632720"
        },
        {
            "title": "5 hot stock ideas for this week: Cochin Shipyard, Railtel, Datamatics & more",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-hot-stock-ideas-for-this-week-cochin-shipyard-railtel-datamatics-amp-more/slideshow/123881506.cms",
            "description": "Indian equities enter the new week on a cautious but resilient note, with analysts having identified select stocks that show technical strength and potential near-term upside. The picks include Datamatics, Graphite India, Railtel, Cochin Shipyard, and Bajaj Finance. Here’s how each stock lines up, with analyst views and target prices.",
            "pubDate": "2025-09-14T11:30:11.638527"
        },
        {
            "title": "Warren Buffett’s cautionary tale: Why investors still chase ‘oil in hell’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffetts-cautionary-tale-why-investors-still-chase-oil-in-hell/articleshow/123881912.cms",
            "description": "Warren Buffett often recalls Benjamin Graham’s parable of “oil discovered in hell” to illustrate herd-driven investing. The tale highlights how fear of missing out and crowd psychology can overpower rational analysis, reminding investors to resist speculation and focus on intrinsic value.",
            "pubDate": "2025-09-14T12:13:49.091178"
        },
        {
            "title": "Auto stocks: GST cut & EV transition. Will pessimists be proven wrong?  Relook, but without bias; 11 auto stocks from different segments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-stocks-gst-cut-ev-transition-will-pessimists-be-proven-wrong-relook-but-without-bias-11-auto-stocks-from-different-segments/articleshow/123881856.cms",
            "description": "Surprised by the rally in auto stocks? Look up a concept called “price elasticity of demand”. It will help you understand why one of the biggest winners of any tax rationalisation is always the auto sector. In 2008-09, when there was a board-based cut in excise duty and CENVAT, the impact was felt first by the auto sector, especially the entry-level segment. Why? Because autos are classic durable goods, sensitive to both price cuts and perceived income gains. The bottom line: Tax savings, when large enough, can accelerate pent-up aspirational purchases. Now, it is not only about the festive season. We are also getting closer to the point where EVs are becoming common and the winner of the EV segment will soon be decided. So, it is time to be selective when it comes to the auto sector.",
            "pubDate": "2025-09-14T12:13:49.091298"
        },
        {
            "title": "Two Trades for Today: A large-cap pharma stock for a 5.5% upmove, a mid-cap ship-building stock for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-large-cap-pharma-stock-for-a-5-5-upmove-a-mid-cap-ship-building-stock-for-almost-7-rise/articleshow/123883059.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-14T15:18:11.599509"
        }
    ]
}