{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-20T19:42:27.020100",
    "items": [
        {
            "title": "Two Trades for Today: A large-cap pharma company for an almost 7% gain, another for a 6% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-large-cap-pharma-company-for-an-almost-7-gain-another-for-a-6-upmove/articleshow/119264499.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Picks by the technical charts today.",
            "pubDate": "2025-03-20T19:42:11.597838"
        },
        {
            "title": "Market Trading Guide: SBI Card among stock recommendations for Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-sbi-card-among-stock-recommendations-for-friday/slideshow/119263190.cms",
            "description": "Indian frontline indices ended with strong gains on Thursday, witnessing their fourth successive positive closing amid buying action in auto, FMCG and IT stocks. The BSE Sensex jumped 899.01 points or 1.19% to 76,348.06, while the Nifty climbed 283.05 points or 1.24% to end the day at 23,190.65.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities pointed out Nifty's falling trendline breakout on the daily chart, suggesting a bullish trend reversal. \"Additionally, it has been sustaining above the 21EMA for the past three days, confirming a short-term uptrend. The RSI has risen above the previous swing high, further strengthening the positive sentiment. Overall, the outlook remains optimistic, with the potential for a further rally in the short term. On the higher end, Nifty could move towards 23,400 and beyond, while on the lower end, support is placed at 23,000,\" De said.Here are 2 stock recommendations for Friday:",
            "pubDate": "2025-03-20T19:42:11.597967"
        },
        {
            "title": "Sebi tweaks disclosure requirements for shareholding patterns to improve clarity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-tweaks-disclosure-requirements-for-shareholding-patterns-to-improve-clarity/articleshow/119264804.cms",
            "description": "Markets regulator Sebi on Thursday introduced modifications to the disclosure requirements for shareholding patterns in a bid to improve the clarity.",
            "pubDate": "2025-03-20T19:42:11.598068"
        },
        {
            "title": "Infosys, Wipro ADRs fall by 3% after Accenture raises full-year revenue forecast",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-adrs-fall-by-over-3-after-accenture-raises-full-year-revenue-forecast/articleshow/119263657.cms",
            "description": "Infosys and Wipro ADRs fell after Accenture raised the lower end of its annual revenue forecast, reflecting strong demand for AI and cloud migration services. Accenture’s results indicate broader IT sector trends ahead of India’s earnings season in April.",
            "pubDate": "2025-03-20T19:42:11.598166"
        },
        {
            "title": "Sebi mulls mandatory e-book mechanism for pvt debt securities above Rs 20 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-mulls-mandatory-e-book-mechanism-for-pvt-debt-securities-above-rs-20-cr/articleshow/119263434.cms",
            "description": "Markets regulator Sebi on Thursday proposed making electronic book mechanism mandatory for all private placement debt issues exceeding Rs 20 crore and is looking to expand the platform's scope to include REITs and InvITs.",
            "pubDate": "2025-03-20T19:42:11.598258"
        },
        {
            "title": "Bain Capital to acquire 18% stake in Manappuram Finance for Rs 4,385 crore via affiliates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bain-capital-to-buy-18-stake-in-indias-manappuram-finance-for-rs-4385-crore/articleshow/119262937.cms",
            "description": "Bain Capital has agreed to acquire joint control in Manappuram Finance by investing Rs 4,385 crore for an 18% stake. The transaction will trigger an open offer for an additional 26% stake. Existing promoters will maintain a 28.9% stake. Manappuram Finance aims to fuel growth and expand with Bain Capital's support.",
            "pubDate": "2025-03-20T19:42:11.598352"
        },
        {
            "title": "Sebi slaps Rs 40 lakh fine on 8 entities for indulging in non-genuine trades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-slaps-rs-40-lakh-fine-on-8-entities-for-indulging-in-non-genuine-trades/articleshow/119262068.cms",
            "description": "Capital markets regulator Sebi has imposed a total fine of Rs 40 lakh on eight entities for indulging in non-genuine trades in the illiquid stock options segment on the BSE.",
            "pubDate": "2025-03-20T19:42:11.598442"
        },
        {
            "title": "Two Sharp with ET: Markets rally on US Fed's dovish stance & Adani shakes up Wires & Cables market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-markets-rally-on-us-feds-dovish-stance-adani-shakes-up-wires-cables-market/videoshow/119261450.cms",
            "description": "In this episode of Two Sharp with ET, Nisha Poddar breaks down two key business stories you need to know today: the market rally driven by IT stocks and Adani's entry into the wires and cables sector. The Nifty IT index, which had fallen by 16.4% in 2025, rebounded with a 1.2% gain, leading to a broader market rally. Companies such as HCL Tech, TCS, Wipro, and Infosys experienced strong buying interest, contributing nearly 200 points to the rise of the Sensex. This surge comes amid optimism surrounding the US Federal Reserve's dovish stance and positive investor sentiment toward Indian IT stocks. Additionally, Adani Enterprises has announced a new joint venture, Praneetha Ecocables Ltd (PEL), which is set to disrupt the wires and cables industry. This development has caused stock prices of leading competitors Polycab India and RR Kabel to tumble. It follows just months after the Aditya Birla Group made a significant ₹1,800 crore investment in the sector. Will this mark the beginning of Adani versus Birla Round 2, similar to what we saw in the cement industry?",
            "pubDate": "2025-03-20T19:42:11.598536"
        },
        {
            "title": "US stocks rise in choppy trading, Fed's comments provide tailwind",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-slip-as-fed-boost-proves-short-lived/articleshow/119260932.cms",
            "description": "U.S. stock indexes recovered some losses on Thursday as investors considered the Federal Reserve's interest rate outlook amid tariff concerns. The Fed maintained rates and projected two rate cuts by year-end, while traders built on previous gains after recent market volatility.",
            "pubDate": "2025-03-20T19:42:11.598629"
        },
        {
            "title": "Top 5 stocks see decreased insurance shareholding in December quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-5-stocks-see-decreased-insurance-shareholding-in-december-quarter/slideshow/119260551.cms",
            "description": "",
            "pubDate": "2025-03-20T19:42:11.598771"
        },
        {
            "title": "Indostar stock gains momentum on improving asset quality, growing business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indostar-stock-gains-momentum-on-improving-asset-quality-growing-business/articleshow/119260343.cms",
            "description": "Indostar Capital Finance surged 15% in a month, outperforming the BSE Financial Services index. The NBFC improved asset quality, expanded its vehicle loan portfolio, and reduced credit costs. With falling funding costs and growing AUM, profitability is expected to improve.",
            "pubDate": "2025-03-20T19:42:11.598895"
        },
        {
            "title": "Noida businessman duped of over Rs 1 crore in online stock market scam",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/noida-businessman-duped-of-over-rs-1-crore-in-online-stock-market-scam/articleshow/119259135.cms",
            "description": "A Noida businessman lost Rs 1.15 crore in an online scam after a fraudster posing as a financial analyst lured him with fake stock market gains. He invested Rs 65 lakh and paid Rs 50.2 lakh in taxes and fees before realizing the fraud. Police are investigating.",
            "pubDate": "2025-03-20T19:42:11.599011"
        },
        {
            "title": "These 7 stocks hit 52-week highs, rallied up to 23% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-stocks-hit-52-week-highs-rallied-up-to-23-in-a-month/slideshow/119258603.cms",
            "description": "",
            "pubDate": "2025-03-20T19:42:11.599108"
        },
        {
            "title": "Bank of England keeps rates on hold, warns against assumptions for cuts in face of uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-england-keeps-rates-on-hold-warns-against-assumptions-for-cuts-in-face-of-uncertainty/articleshow/119257971.cms",
            "description": "The Bank of England held interest rates at 4.5% and warned against assumptions that they would be cut over its next few meetings as it grappled with deep uncertainty hanging over the British and world economies.",
            "pubDate": "2025-03-20T19:42:11.599201"
        },
        {
            "title": "Aditya Birla Capital shares on track to double in 3 years, says Macquarie",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-capital-shares-on-track-to-double-in-3-years-says-macquarie/articleshow/119257644.cms",
            "description": "Aditya Birla Capital: Macquarie Equity Research expects Aditya Birla Capital shares to double in three years, citing improving margins, unsecured loan growth, and lower credit costs. Despite recent underperformance, the brokerage sees this as a strong buying opportunity, maintaining an \"outperform\" rating.",
            "pubDate": "2025-03-20T19:42:11.599294"
        }
    ]
}