{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-22T01:20:40.014358",
    "items": [
        {
            "title": "Asian stocks gain as hopes for year-end rally grow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-gain-as-hopes-for-year-end-rally-grow/articleshow/126112207.cms",
            "description": "Asian equities opened higher, mirroring gains in US stocks and fueling hopes for a year-end rally. Investors are closely watching China's loan prime rates and upcoming economic data from the UK, US, and Japan for clues on central bank policy. Meanwhile, oil prices climbed amid US actions in Venezuela, and Bitcoin and silver saw modest gains.",
            "pubDate": "2025-12-22T01:20:32.598832"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126106876.cms",
            "description": "Indian markets closed last week with small losses. Mixed economic data, a weaker rupee, and uncertainty about a trade deal with the US kept investors cautious. The upcoming week is shortened by the Christmas holiday. Trading volumes may be low. A Santa rally is possible, potentially pushing the Nifty higher. Foreign investors bought shares.",
            "pubDate": "2025-12-22T01:20:32.598953"
        },
        {
            "title": "Stocks in news: Infosys, Fortis Healthcare, Kotak Bank, SBI, Maruti Suzuki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-fortis-healthcare-kotak-bank-sbi-maruti-suzuki/articleshow/126106840.cms",
            "description": "Markets rebounded on Friday, tracking global cues, with Nifty reclaiming its 20-DEMA. Analysts advise a stock-specific approach, favoring banking, IT, auto, and metals. Key stocks in focus include Infosys, Fortis Healthcare, Kotak Bank, SBI, and Maruti Suzuki due to various developments.",
            "pubDate": "2025-12-22T01:20:32.599160"
        },
        {
            "title": "Will weddings, travel drive India's hotel sector to new heights in H2 FY26?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-weddings-travel-drive-indias-hotel-sector-to-new-heights-in-h2-fy26/articleshow/126112153.cms",
            "description": "India's hotel sector anticipates a strong rebound in the latter half of the fiscal year. Average room rates are expected to drive growth, with revenue per available room projected to increase. Key hotel stocks like Chalet Hotels, Indian Hotels, and Lemon Tree Hotels show promising upside. Major events and conferences will boost demand, particularly in cities like Mumbai.",
            "pubDate": "2025-12-22T01:20:32.599263"
        },
        {
            "title": "1Point1 Solutions to acquire Costa Rica BPM firm Netcom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/1point1-solutions-to-acquire-costa-rica-bpm-firm-netcom/articleshow/126112133.cms",
            "description": "1Point1 Solutions is set to acquire Costa Rica-based Netcom Business Contact Center for approximately ₹300 crore by March 2026. This strategic move aims to nearly double 1Point1's FY27 revenue, expand its AI-driven BPM services into the Americas, and enhance its domain expertise in financial services.",
            "pubDate": "2025-12-22T01:20:32.599366"
        },
        {
            "title": "Nifty to get support from rupee strength, FII inflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-to-get-support-from-rupee-strength-fii-inflows/articleshow/126112106.cms",
            "description": "Nifty's near-term outlook is cautiously positive. Improving technical signals, a stronger rupee, and renewed foreign investor buying are supporting the market. While resistance at 26,000 is a key level, a breakout could lead to further gains. Traders can consider buying Nifty around the current price with a stop loss below 25,700 for potential upside.",
            "pubDate": "2025-12-22T01:20:32.599468"
        },
        {
            "title": "Budget 2026: Private capex likely to gather steam next year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-private-capex-likely-to-gather-steam-next-year/articleshow/126112170.cms",
            "description": "Private investment is projected to surge in 2026, fueled by robust domestic consumption, reduced GST, government reforms, and favorable economic conditions like soft inflation and low interest rates. Continued government capital expenditure is expected to further stimulate private sector growth, particularly in consumer-focused segments.",
            "pubDate": "2025-12-22T01:20:32.599564"
        },
        {
            "title": "Credit weighs less on cards with RBI tightening norms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-weighs-less-on-cards-with-rbi-tightening-norms/articleshow/126112122.cms",
            "description": "Credit card outstandings, despite fewer delinquencies, fell to 4.7% of total retail loans in October 2025, from 5% a year earlier, Reserve Bank of India (RBI) data showed. Growth in outstanding credit card balances within total retail loans slowed sharply to 7.7% in October 2025, from 16.9% a year earlier.",
            "pubDate": "2025-12-22T01:20:32.599782"
        }
    ]
}