{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-05T23:53:25.323207",
    "items": [
        {
            "title": "Stocks to buy in 2025 for long term: ACC, Ambuja Cement among 5 stocks that could give 12-24% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-acc-ambuja-cement-among-5-stocks-that-could-give-12-24-return/slideshow/124316054.cms",
            "description": "Brokerages remain upbeat on select cement, steel tubes, and battery stocks, recommending them as attractive investment opportunities with double-digit upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-05T04:42:08.256689"
        },
        {
            "title": "From Q2 earnings to FII movements: 8 key drivers likely to impact D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-q2-earnings-to-fii-movements-8-key-drivers-likely-to-impact-d-street-this-week/articleshow/124315966.cms",
            "description": "D-Street anticipates a pivotal week driven by Q2 earnings, major IPOs, and crucial macroeconomic data releases. Global cues, including US updates and FII movements, alongside crude oil prices and currency fluctuations, are set to influence market sentiment. Technical levels will also be key factors for investors to monitor.",
            "pubDate": "2025-10-05T04:42:08.256839"
        },
        {
            "title": "Axis Securities names Bank of Baroda among top 3 technical picks with upside potential up to 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-names-bank-of-baroda-among-top-3-technical-picks-with-upside-potential-up-to-18/slideshow/124316289.cms",
            "description": "The Indian equity benchmarks ended the week on a strong note, with the Nifty 50 closing at 24,894—up 240 points—after a late recovery fueled by the RBI’s policy decision, softening crude oil prices, and renewed optimism across sectors. While the Nifty started the week on a positive note, it briefly extended the previous week’s selling pressure before staging a strong rebound post the central bank’s announcement.Bank Nifty displayed firm strength throughout the week, starting with an upward gap and maintaining positive momentum to close at 55,589, marking a 1,200-point gain. For the coming week, the Nifty is expected to trade within the 25,500–24,300 range with a mixed bias, while the Bank Nifty is likely to move in the 56,500–54,000 zone with a positive bias.With this, let’s look at the top technical picks recommended by Axis Securities for a holding period of 3–4 weeks with up to 18% upside potential:",
            "pubDate": "2025-10-05T05:47:02.386490"
        },
        {
            "title": "Multibaggers: 9 penny stocks soar up to 400% in 6 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibaggers-9-penny-stocks-soar-up-to-400-in-6-months/slideshow/124316241.cms",
            "description": "Since the start of FY26, 11 penny stocks have posted extraordinary gains, rising between 75% and an impressive 400% in just six months. Notably, 9 of these stocks have more than doubled investors’ wealth in this short span. These standout performers were selected based on specific criteria: a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares. This strategy focuses on identifying low-priced, actively traded small-cap stocks demonstrating strong upward momentum. (Data Source: ACE Equity).Penny stocks often attract attention due to their low entry price and the potential for explosive growth. But while the rewards can be impressive, the risks are equally high. These stocks typically carry low liquidity, high volatility, and limited financial transparency. Investors should proceed with caution —success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2025-10-05T05:47:02.386630"
        },
        {
            "title": "Market Trading Guide: Buy Coal India, multibagger GE Vernova and 2 smallcaps on Monday for up to 18% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-coal-india-multibagger-ge-vernova-and-2-smallcaps-on-monday-for-up-to-18-gains/slideshow/124318901.cms",
            "description": "India’s benchmark indices, the Nifty and Sensex, closed higher on Friday, marking their second straight day of gains as investors bought into banks, consumer, and metal stocks. Nifty index extended its strength in Friday’s session after a confident closing above its short-term resistance. Commenting on the day’s action, Vatsal Bhuva, Technical Analyst at LKP Securities said the index took crucial support near its 100-day EMA at 24,750 and ended with a strong close around the 50-day EMA. \"On the derivatives front, heavy put writing at 24,800 signals a support base, while the highest OI concentration at 25,000 highlights a strong resistance zone, also validated on technical charts. Overall, Nifty is expected to trade in a mildly bullish range of 24,750–25,100, with support at 24,750 and resistance at 25,000–25,100,\" Bhuva said.Here are 4 stock recommendations for Monday:",
            "pubDate": "2025-10-05T11:30:14.655172"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/124318805.cms",
            "description": "Indian benchmark indices, Nifty and Sensex, closed higher for the second consecutive day on Friday, buoyed by banks, consumer, and metal stocks. Analysts noted Nifty's recovery above its 50-DMA, signaling bullish sentiment and potential for further gains towards 25,200 and 25,500, supported by a drop in India VIX.",
            "pubDate": "2025-10-05T11:30:14.655295"
        },
        {
            "title": "Flipkart to offload entire stake in Aditya Birla Lifestyle via Rs 950 crore block deal: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/flipkart-to-offload-entire-stake-in-aditya-birla-lifestyle-via-rs-950-crore-block-deal-report/articleshow/124318326.cms",
            "description": "Flipkart Investments plans to exit its entire 6% stake in Aditya Birla Lifestyle Brands via a Rs 950 crore block deal, highlighting strong institutional interest in India’s premium apparel sector.",
            "pubDate": "2025-10-05T11:30:14.655407"
        },
        {
            "title": "Crucial week for traders: Oct 6, 7 & 9 seen as high-volatility days, Harshubh Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/crucial-week-for-traders-oct-6-7-9-seen-as-high-volatility-days-harshubh-shah/articleshow/124318250.cms",
            "description": "Indian equity markets rebounded 1% last week, fueled by the RBI's decision to maintain the repo rate at 5.5%, which improved market sentiment. With Q2FY26 earnings season commencing, investors will track corporate results. Key trading dates for potential momentum and sharp movements are October 6, 7, and 9, alongside crucial Nifty support and resistance levels.",
            "pubDate": "2025-10-05T11:30:14.655513"
        },
        {
            "title": "Stallion India, Orient Tech among 10 smallcaps that rallied up to 40% last week. Own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stallion-india-orient-tech-among-10-smallcaps-that-rallied-up-to-40-last-week-own-any/slideshow/124317878.cms",
            "description": "Smallcap stocks had strong momentum last week, with several names delivering double-digit gains despite broader market volatility. Here are the top 10 smallcap gainers that rallied between 18% and 42% over the past week.",
            "pubDate": "2025-10-05T11:30:14.655615"
        },
        {
            "title": "LG India to Tata Capital: GMPs suggest listing gains up to 20% for 5 IPOs this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-india-to-tata-capital-gmps-suggest-listing-gains-up-to-20-for-5-ipos-this-week/slideshow/124317712.cms",
            "description": "Investors are gearing up for a packed week in the primary market as five IPOs — including Tata Capital, LG Electronics India, and Rubicon Research — hit Dalal Street. Together, these issues will raise over Rs 28,000 crore across mainboard and SME segments. Analysts expect strong demand for quality names like Tata Capital and LG Electronics, while others may see selective interest depending on valuations and GMP trends. Here’s a quick look at the key issues opening for subscription next week.",
            "pubDate": "2025-10-05T11:30:14.655715"
        },
        {
            "title": "From a long-term perspective: This ratio increases the probability of being right in the quest for wealth creation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-a-long-term-perspective-this-ratio-increases-the-probability-of-being-right-in-the-quest-for-wealth-creation/articleshow/124317535.cms",
            "description": "There is something about the simplicity of the PE ratio that attracts investors to it. It is straightforward to understand: If the PE is high, it means the stock is over-valued. So, low PE stocks are the ones to target. However, following the PE formula has its pitfalls. In many cases, it may lead to lost opportunities in terms of wealth creation. It is also flawed when it comes to valuing stocks in certain sectors. What, then, is the alternative?",
            "pubDate": "2025-10-05T11:30:14.655813"
        },
        {
            "title": "7 Midcap stocks with explosive upside potential — up to 40% returns in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-midcap-stocks-with-explosive-upside-potential-up-to-40-returns-in-1-year/slideshow/124317270.cms",
            "description": "Analyst forecasts go beyond mere numbers—they offer a forward-looking lens into market potential. For investors hunting the next breakout opportunities, a fresh look at BSE Mid-Cap stocks reveals some compelling prospects.Based on market analysts' consensus estimates, Trendlyne data indicates that several mid-cap stocks are projected to deliver the highest returns over the next 12 months. This projected \"upside\" represents the average anticipated gain during this period, providing a research-backed guide for investors exploring promising mid-cap opportunities. We spotlight seven standout mid-cap stocks with estimated upside potential ranging between 30% and 40% over the coming 12 months.",
            "pubDate": "2025-10-05T11:30:14.655909"
        },
        {
            "title": "Two Trades for Today: A metal sector major for a 5.3% rise, a  large-cap steel-maker for almost 6% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-metal-sector-major-for-a-5-3-rise-a-large-cap-steel-maker-for-almost-6-rise/articleshow/124322938.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-05T17:45:34.144967"
        },
        {
            "title": "Tata Capital, LG Electronics India to launch IPOs worth over Rs 27,000 crore next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-capital-lg-electronics-india-to-launch-ipos-worth-over-rs-27000-crore-next-week/articleshow/124320050.cms",
            "description": "The primary market is set for a busy week as two major companies, Tata Capital Ltd and LG Electronics India Ltd, gear up to launch their initial public offerings (IPOs), collectively worth more than Rs 27,000 crore.",
            "pubDate": "2025-10-05T17:45:34.145086"
        },
        {
            "title": "FPIs offload equities worth Rs 23,885 cr in Sep; total outflow reaches Rs 1.6 lakh cr in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-offload-equities-worth-rs-23885-cr-in-sep-total-outflow-reaches-rs-1-6-lakh-cr-in-2025/articleshow/124320017.cms",
            "description": "Foreign portfolio investors (FPIs) remained net sellers of Indian equities in September, withdrawing Rs 23,885 crore (around USD 2.7 billion) and taking year-to-date outflow to Rs 1.58 lakh crore (USD 17.6 billion).",
            "pubDate": "2025-10-05T17:45:34.145313"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms climbs Rs 74,573 cr; HDFC Bank biggest gainer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-climbs-rs-74573-cr-hdfc-bank-biggest-gainer/articleshow/124319983.cms",
            "description": "The combined market valuation of seven of the top-10 most valued firms climbed Rs 74,573.63 crore in a holiday-shortened last week, with HDFC Bank emerging as the biggest gainer in line with a positive trend in equities.",
            "pubDate": "2025-10-05T17:45:34.145420"
        },
        {
            "title": "Stock Radar: Poonawalla Fincorp hit fresh record highs; check target & stop loss for this NBFC stock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-poonawalla-fincorp-hit-fresh-record-highs-check-target-stop-loss-for-this-nbfc-stock/articleshow/124288489.cms",
            "description": "Poonawalla Fincorp has broken out of a 20-month consolidation and a bullish Pennant pattern, hitting a new record high of Rs 521. Experts recommend buying the NBFC stock for a target of Rs 530 in the next 2-3 weeks, citing strong technical indicators and consistent uptrend structure. The company's tech-enabled lending also enhances efficiency.",
            "pubDate": "2025-10-05T23:53:24.649082"
        }
    ]
}