{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-24T12:00:24.774423",
    "items": [
        {
            "title": "Tata Sons Chairman N Chandrasekaran's salary package jumps 15% to Rs 156 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-sons-chairman-n-chandrasekarans-salary-package-jumps-15-to-rs-156-crore/articleshow/122881945.cms",
            "description": "N Chandrasekaran earned ₹155.81 crore in FY25, up 15% YoY, cementing his spot as India's highest-paid executive. Despite a 24.3% profit drop at Tata Sons, his compensation included ₹140.7 crore in commission and ₹15.1 crore in salary and benefits.",
            "pubDate": "2025-07-24T12:00:06.166199"
        },
        {
            "title": "Stock Radar: Balkrishna Industries stock breaks out from 1-year falling channel; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-balkrishna-industries-stock-breaks-out-from-1-year-falling-channel-what-should-investors-do/articleshow/122862062.cms",
            "description": "Balkrishna Industries stock shows positive signs. It broke out from a falling channel pattern. Experts suggest a potential target above Rs 3,000. The stock rebounded after testing its 200-week exponential moving average. Bhavik Patel of Tradebulls Securities notes channel and trend line breakouts. The stock closed above its 38.2% Fibonacci retracement level.",
            "pubDate": "2025-07-24T12:00:06.166321"
        },
        {
            "title": "Stocks to Buy | Alpha Hunting: Prateek Agrawal’s high-growth sector picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-alpha-hunting-prateek-agrawals-high-growth-sector-picks/slideshow/122878583.cms",
            "description": "Prateek Agrawal in an interview to ET Now said that India’s large banks, including SBI, HDFC Bank, ICICI Bank, and Axis Bank, are beginning to resemble each other in terms of growth patterns and book composition. He points out that SBI’s recent QIP represents a significant shift in PSU banking behavior—adopting the proactive capital-raising approach once exclusive to private banks. According to him, this move positions SBI and other PSUs more competitively for future growth.",
            "pubDate": "2025-07-24T12:00:06.166429"
        },
        {
            "title": "MCX issues clarification on trading disruption triggered by technical glitch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-issues-clarification-on-trading-disruption-triggered-by-technical-glitch/articleshow/122881735.cms",
            "description": "MCX attributed Wednesday's trading halt to repetitive database issues delaying overnight clearing processes. Trading resumed after over an hour. The exchange assured corrective action and enhanced monitoring. This follows earlier tech disruptions linked to its platform migration to TCS. MCX reaffirmed its commitment to robust systems and investor trust.",
            "pubDate": "2025-07-24T12:00:06.166533"
        },
        {
            "title": "Thyrocare Technologies shares jump 13% after Q1 PAT surges 60% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thyrocare-technologies-shares-jump-13-after-q1-pat-surges-60-yoy/articleshow/122881149.cms",
            "description": "Shares of Thyrocare Technologies surged 13% to hit the day's high of Rs 1,357.85 on the NSE on Thursday following the company's Q1 earnings where it reported a 60% year-on-year jump in its net profit at Rs 38 crore versus Rs 24 crore in the year-ago period.",
            "pubDate": "2025-07-24T12:00:06.166632"
        },
        {
            "title": "For investors with patience & cash: 6 large-caps with strong balance sheets & big TAM; and an upside potential of more than 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-patience-cash-6-large-caps-with-strong-balance-sheets-big-tam-and-an-upside-potential-of-more-than-24/articleshow/122879442.cms",
            "description": "At this point of time, the street is dealing with confusion more than anything else. Why confusion? Because valuations are not cheap, although the macro fundamentals are all fine. Earnings, however, are not improving at a pace at which the market would have liked. One way to deal with this confusion is to think long term and look at companies with strong balance sheets and large markets that will give them a certain amount of growth even in a downturn. Remember: All industries periodically face rough weather. But strong companies with good managements have the ability to weather the storm. And when the street is not looking at them, it is a good time for you to look at them.",
            "pubDate": "2025-07-24T12:00:06.166731"
        },
        {
            "title": "Nifty Bank lot size increases to 35 with effect from July 31 for monthly expiries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-bank-lot-size-increases-to-35-with-effect-from-july-31-for-monthly-expiries/articleshow/122878826.cms",
            "description": "NSE has revised lot sizes for derivative contracts on Bank Nifty (from 30 to 35) and Nifty Midcap Select (from 120 to 140), effective July 2025 expiry. Changes follow SEBI’s review guidelines to align notional contract values with market levels.",
            "pubDate": "2025-07-24T12:00:06.166824"
        },
        {
            "title": "IEX suffers worst single-day loss since listing, down 26%. Should you buy the dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-suffers-worst-single-day-loss-since-listing-down-26-should-you-buy-the-dip/articleshow/122877877.cms",
            "description": "Shares of Indian Energy Exchange (IEX) tanked 26% on Thursday, logging their worst intraday single-day performance since listing in 2017. The stock is on track for its seventh consecutive session of losses, extending the declines to 33% in this period.",
            "pubDate": "2025-07-24T12:00:06.166924"
        },
        {
            "title": "European shares hit 6-week high on US trade deal optimism, earnings boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-hit-6-week-high-on-us-trade-deal-optimism-earnings-boost/articleshow/122877701.cms",
            "description": "European shares rose to a six-week high on Thursday, buoyed by optimism over a potential EU-U.S. trade agreement and upbeat corporate results, as investors awaited the European Central Bank's rate decision later in the day.",
            "pubDate": "2025-07-24T12:00:06.167018"
        },
        {
            "title": "10 microcap stocks that soared up to 5,500% since September. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-microcap-stocks-that-soared-up-to-5500-since-september-do-you-own-any/slideshow/122877507.cms",
            "description": "While benchmark indices struggled to maintain momentum since September 2024, a clutch of microcap stocks delivered jaw-dropping returns. Led by RRP Semiconductor with a staggering 5,500% gain, these 10 stocks defied the broader market mood and turned into multi-baggers. From semiconductors to obscure industrials, here’s a closer look at the top performers.",
            "pubDate": "2025-07-24T12:00:06.167113"
        },
        {
            "title": "The Rise of Tokenisation: Stablecoins, big banks & the road ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-rise-of-tokenisation-stablecoins-big-banks-amp-the-road-ahead/slideshow/122877632.cms",
            "description": "Tokenisation has been a buzzword among crypto enthusiasts for years, promising to transform financial markets by moving assets like stocks, bonds, and real estate onto the blockchain. While regulatory support is growing, progress has been slower than expected. (Source: Reuters)",
            "pubDate": "2025-07-24T12:00:06.167230"
        },
        {
            "title": "IEX shares plunge 26% to 52-week low as market coupling gets go-ahead. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-plunge-26-to-52-week-low-as-market-coupling-gets-go-ahead-what-should-investors-do/articleshow/122876529.cms",
            "description": "Shares of IEX plunged 26% after CERC approved market coupling in the day-ahead segment, threatening its monopoly in price discovery. Analysts advise caution amid oversold signals, regulatory uncertainty, and weak technicals. Key support lies at Rs 120–150. A wait-and-watch approach is recommended for fresh investors.",
            "pubDate": "2025-07-24T12:00:06.167332"
        },
        {
            "title": "Why stock market fell today: Sensex falls 542 pts, Nifty below 25,100; 3 reasons behind the slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-falling-today-sensex-falls-over-650-pts-nifty-slips-below-25050-3-reasons-behind-the-slump/articleshow/122876302.cms",
            "description": "Stock Market Crash: Indian benchmark indices closed lower on Thursday, dragged down by IT stocks due to weak earnings and cautious global cues. The Sensex fell by 542 points, and the Nifty50 declined by 158 points. Market sentiment was also affected by Trump's surprise Fed visit and uncertainty around a U.S.-India trade deal, contributing to the overall market decline.",
            "pubDate": "2025-07-24T12:00:06.167424"
        },
        {
            "title": "Stocks to Buy | Shiv Chanani’s guide to building a long-term winning portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-shiv-chananis-guide-to-building-a-long-term-winning-portfolio/slideshow/122876268.cms",
            "description": "Shiv Chanani in an interview to ET Now said that the excitement around midcaps, smallcaps, and the consumption theme isn't just a short-term trend for the second half of the financial year. Instead, he views these as structural stories with the potential to play out strongly over the next five to ten years. India’s demographic strength and its status as a high-growth economy provide all the necessary and sufficient conditions for these themes to deliver handsome returns to long-term investors.",
            "pubDate": "2025-07-24T12:00:06.167515"
        },
        {
            "title": "Nestle India shares slide 5% after Q1 profit dips as cost pressures bite",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nestle-india-shares-slide-5-after-q1-profit-dips-as-cost-pressures-bite/articleshow/122875615.cms",
            "description": "Nestle India's shares plummeted following a 13.4% YoY drop in profit after tax for Q1FY26, reaching Rs 647 crore. Elevated commodity prices and rising operational costs impacted profitability. Despite this, revenue from operations increased by 6% to Rs 5,096 crore, with domestic sales climbing 5.5%.",
            "pubDate": "2025-07-24T12:00:06.167607"
        },
        {
            "title": "Tata Motors shares rally 5% in 2 days on U.S. trade deal hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-rally-5-in-2-days-on-u-s-trade-deal-hopes/articleshow/122875487.cms",
            "description": "Tata Motors' shares experienced a surge, driven by optimism surrounding potential global trade deals that could lower automobile export tariffs. The US-Japan agreement, reducing tariffs on Japanese car exports, fueled speculation of similar pacts with the EU.",
            "pubDate": "2025-07-24T12:00:06.167697"
        }
    ]
}