{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-06T20:46:38.644630",
    "items": [
        {
            "title": "Trump Media reports $19 mln loss in third quarter on TV streaming costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trump-media-reports-19-mln-loss-in-third-quarter-on-tv-streaming-costs/articleshow/114998215.cms",
            "description": "Trump Media & Technology Group faced a loss of $19.2 million in the third quarter. The company attributed this to legal fees and costs associated with its TV streaming deal. The company spent $12.1 million on legal fees related to acquiring TV streaming technology and its SPAC deal. Despite the loss, shares of the company rose slightly.",
            "pubDate": "2024-11-06T02:52:15.476523"
        },
        {
            "title": "Q2 results today: Tata Steel, Apollo Hospitals among 98 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-tata-steel-apollo-hospitals-among-98-companies-to-announce-earnings-on-wednesday/articleshow/114998164.cms",
            "description": "Get ready for a busy day in the Indian stock market. 63 companies will reveal their July-September earnings today.  Keep an eye on major players like Power Grid and Tata Steel.  Apollo Hospitals is expected to report strong numbers. Tata Steel might face challenges due to declining realizations.  Stay tuned for the detailed financial results and expert analysis.",
            "pubDate": "2024-11-06T02:52:15.476640"
        },
        {
            "title": "JK Tyres Q2 net falls 42% on weak demand, high natural rubber prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jk-tyres-q2-net-falls-42-on-weak-demand-high-natural-rubber-prices/articleshow/114997978.cms",
            "description": "JK Tyre & Industries' consolidated net profit plummeted by 42% in the September quarter, primarily due to a downturn in the commercial vehicle sector and a surge in natural rubber prices. Despite implementing price hikes, the company experienced a decline in revenue and margins.",
            "pubDate": "2024-11-06T02:52:15.476743"
        },
        {
            "title": "Raymond Lifestyle Q2 Results: Profit slides 70% YoY to Rs 42 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/raymond-lifestyle-q2-results-profit-slides-70-yoy-to-rs-42-crore/articleshow/115004234.cms",
            "description": "Raymond Lifestyle witnessed a significant 69.72% drop in its consolidated net profit for Q2 FY'25, reaching Rs 42.18 crore. This decline is attributed to subdued demand and inflationary pressures. Despite this, the company remains optimistic about the future, citing recent positive trends in the festive and wedding season and plans for retail expansion and new product launches.",
            "pubDate": "2024-11-06T07:52:09.517989"
        },
        {
            "title": "Apollo Hospitals Q2 Results: PAT soars 63% YoY to Rs 379 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-q2-results-pat-soars-63-yoy-to-rs-379-crore-beats-estimates/articleshow/115015723.cms",
            "description": "Apollo Hospitals Q2 Results: Revenue from operations rose 15% year-on-year to Rs 5,589 crore in the July-September 2024 period, surpassing ET Now’s poll estimate of Rs 5,485 crore. EBITDA for the second quarter reached Rs 816 crore, marking a 30% year-on-year increase.",
            "pubDate": "2024-11-06T12:12:44.860024"
        },
        {
            "title": "Kansai Nerolac Paints Q2 Results: PAT drops 27% to Rs 130 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kansai-nerolac-paints-q2-results-pat-drops-27-to-rs-130-crore/articleshow/115024974.cms",
            "description": "In terms of half-yearly accounts, Kansai Nerolac booked net revenues to the tune of Rs 3,914 crore, near similar to what it booked in the corresponding period of the previous year.",
            "pubDate": "2024-11-06T20:46:25.781792"
        },
        {
            "title": "Tata Steel Q2 Results: Co back in black as against loss in year-ago period",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steel-q2-results-co-back-in-black-as-against-loss-in-year-ago-period/articleshow/115024882.cms",
            "description": "The steel-maker’s consolidated net profit for Jul-Sep stood at Rs 759 crore as against a loss of Rs 6,511 crore a year ago. Consolidated turnover, though, fell to Rs 53,905 crore from Rs 55,682 crore a year ago.",
            "pubDate": "2024-11-06T20:46:25.781913"
        },
        {
            "title": "Apollo Hospitals Q2 Results: Net profit rises 63% to Rs 379 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-q2-results-net-profit-rises-63-to-rs-379-crore/articleshow/115024791.cms",
            "description": "The company reported net profit of Rs 233 crore in the corresponding quarter of the previous year.Revenue grew 15% YoY to Rs.5,589 crore in Q2FY25.",
            "pubDate": "2024-11-06T20:46:25.782018"
        },
        {
            "title": "Jindal Steel Q2 Results: Profit slumps 38% to Rs 860 crore on lower volumes, steel prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jindal-steel-q2-results-profit-slumps-38-to-rs-860-crore-on-lower-volumes-steel-prices/articleshow/115024130.cms",
            "description": "Jindal Steel and Power’s profit dropped 38% in the September quarter to Rs 860 crore, impacted by lower steel prices and reduced sales volume. Consolidated revenue also fell 8% to Rs 13,205 crore, with an 8% decline in sales volume.",
            "pubDate": "2024-11-06T20:46:25.782119"
        },
        {
            "title": "Gulf Oil Lubricants Q2 Results: PAT grows 15% to Rs 84.44 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gulf-oil-lubricants-q2-results-pat-grows-15-to-rs-84-44-crore/articleshow/115023261.cms",
            "description": "Lubes maker Gulf Oil Lubricants India on Wednesday reported a 15 per cent growth in profit after tax (PAT) at Rs 84.44 crore for the three months to September 2024. The Hinduja Group firm had delivered a PAT of Rs 73.66 crore in the second quarter of FY 2023-24.",
            "pubDate": "2024-11-06T20:46:25.782646"
        },
        {
            "title": "TeamLease Services Q2 Results: Net profit falls 10% to Rs 24.85 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/teamlease-services-q2-results-net-profit-falls-10-to-rs-24-85-crore/articleshow/115022661.cms",
            "description": "Staffing company TeamLease Services on Wednesday reported a 10.12 per cent decline in consolidated net profit to Rs 24.85 crore for the quarter ending September 2024. The company's net profit stood at Rs 27.65 crore during the corresponding period of the previous financial year, TeamLease Services said in a regulatory filing.",
            "pubDate": "2024-11-06T20:46:25.782774"
        },
        {
            "title": "Max Healthcare Q2 Results: Profit up nearly 2% to Rs 282 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/max-healthcare-q2-results-profit-up-nearly-2-to-rs-282-crore/articleshow/115022067.cms",
            "description": "Max Healthcare Institute has posted 1.9 per cent rise in consolidated net profit at Rs 281.81 crore for September quarter FY25, on higher revenue from operations. Profit stood at Rs 276.68 crore in the year-ago period, according to a regulatory filing.",
            "pubDate": "2024-11-06T20:46:25.782877"
        },
        {
            "title": "Trent Q2 Results Preview: Revenue may grow up to 56% on store additions. Watch for commentary on demand outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trent-q2-results-preview-revenue-may-grow-up-to-56-on-store-additions-watch-for-commentary-on-demand-outlook/articleshow/115021321.cms",
            "description": "Estimates from Kotak Institutional Equities, Nuvama Institutional Equities, and Axis Securities reveal differing outlooks: Nuvama is most conservative on revenue and PAT, Kotak is bullish on revenue, while Axis is the most optimistic on Trent’s net profit.",
            "pubDate": "2024-11-06T20:46:25.782971"
        },
        {
            "title": "Aadhar Housing Finance Q2 Results: Profit rises 15% to Rs 228 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/aadhar-housing-finance-q2-results-profit-rises-15-to-rs-228-crore/articleshow/115021236.cms",
            "description": "Aadhar Housing Finance reported a 15% YoY rise in net profit to Rs 228 crore in Q2FY25. Total income rose 21.5% to Rs 764 crore. Assets under management expanded 21% to Rs 22,817 crore at the end of September.",
            "pubDate": "2024-11-06T20:46:25.783088"
        },
        {
            "title": "Jindal Steel and Power Q2 Results: Profit falls 38% to Rs 860 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jindal-steel-and-power-q2-results-profit-falls-38-to-rs-860-crore/articleshow/115021112.cms",
            "description": "Jindal Steel and Power Ltd (JSPL) on Wednesday reported 38 per cent fall in consolidated net profit at Rs 860 crore for September quarter, on account of lower revenue. It had posted a net profit of Rs 1,390 crore for the period ended September 2023, the company said in a statement.",
            "pubDate": "2024-11-06T20:46:25.783198"
        },
        {
            "title": "Power Grid Q2 Results: Net profit flat YoY at Rs 3,793 crore; Rs 4.50 per share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/power-grid-q2-results-net-profit-flat-yoy-at-rs-3793-crore-rs-4-50-per-share-dividend-announced/articleshow/115020581.cms",
            "description": "Power Grid reported a flat net profit of Rs 3,793 crore in Q2FY25. Revenue from operations was also flat at Rs 11,278 crore. The board approved an interim dividend of Rs 4.50 per share. The company has also approved the sale of a 26% stake in four associate companies to PowerGrid Infrastructure Investment Trust (PGInvIT).",
            "pubDate": "2024-11-06T20:46:25.783288"
        },
        {
            "title": "Tata Steel Q2 Results: Company reports profit of Rs 833 crore vs Rs 6,196 crore loss a year ago",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steel-q2-results-company-reports-profit-of-rs-833-crore-vs-rs-6196-crore-loss-a-year-ago/articleshow/115019168.cms",
            "description": "Tata Steel Q2 Results: Tata Steel Ltd on Wednesday reported a net profit of Rs 833 crore in the quarter ended September 2024, compared with a loss of Rs 6196 crore in the last year quarter.",
            "pubDate": "2024-11-06T20:46:25.783375"
        }
    ]
}