{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-30T15:49:31.477666",
    "items": [
        {
            "title": "Hindustan Copper among 4 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-among-4-stocks-witness-5-year-swing-high-breakout/slideshow/126243108.cms",
            "description": "In the NSE list of stocks with a market capitalisation above Rs 1,000 crore, four counters witnessed a 5-year swing high at the close on December 29, indicating bullishness, according to technical scan data from StockEdge.A 5-year swing high represents the highest price a stock has reached over five years and acts as a key resistance level. While such moves are considered bullish, they are distinct from a 5-year breakout, which requires a decisive move beyond long-standing resistance.",
            "pubDate": "2025-12-30T03:18:15.496316"
        },
        {
            "title": "Lupin shares in focus after licensing pact with China’s Gan & Lee for GLP-1 drug",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lupin-shares-in-focus-after-licensing-pact-with-chinas-gan-lee-for-glp-1-drug/articleshow/126243069.cms",
            "description": "Lupin Ltd has secured exclusive rights in India for Bofanglutide, a novel fortnightly GLP-1 receptor agonist, through a licensing agreement with China's Gan & Lee Pharmaceuticals. This strategic move bolsters Lupin's diabetes and obesity treatment portfolio, offering a convenient and effective option for patients amidst a growing metabolic health challenge in India.",
            "pubDate": "2025-12-30T03:18:15.496440"
        },
        {
            "title": "RVNL shares in focus after emerging as L1 bidder for Rs 201 crore wagon workshop project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-after-emerging-as-l1-bidder-for-rs-201-crore-wagon-workshop-project/articleshow/126243057.cms",
            "description": "Rail Vikas Nigam Limited shares will be in focus after the company emerged as the lowest bidder for an East Coast Railway project worth Rs 201.23 crore. The order involves setting up a wagon POH workshop and strengthens RVNL’s domestic railway infrastructure order book.",
            "pubDate": "2025-12-30T03:18:15.496543"
        },
        {
            "title": "Shriram Finance shares in focus as CARE upgrades credit rating to AAA following MUFG deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-shares-in-focus-as-care-upgrades-credit-rating-to-aaa-following-mufg-deal/articleshow/126242795.cms",
            "description": "Shriram Finance shares could see action in trade today after a credit rating upgrade. This follows a significant deal with Japan's MUFG. The upgrade reflects strong performance and the strategic investment. Analysts are positive, raising target prices. The deal strengthens Shriram Finance's capital and future growth prospects. This development boosts confidence in India's lending sector.",
            "pubDate": "2025-12-30T03:18:15.496649"
        },
        {
            "title": "Kotak Mahindra Bank fixes January 14 as record date for upcoming stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-fixes-january-14-as-record-date-for-upcoming-stock-split/articleshow/126242758.cms",
            "description": "Kotak Mahindra Bank has fixed January 14, 2026, as the record date for its stock split, involving subdivision of equity shares from face value of Rs 5 to Rs 1. The move aims to improve liquidity and enhance retail investor participation in the stock.",
            "pubDate": "2025-12-30T03:18:15.496752"
        },
        {
            "title": "Honasa Consumer among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-among-4-stocks-showing-bullish-rsi-upswing/slideshow/126242731.cms",
            "description": "On December 29, four stocks in the Nifty 500 that gained over 3% were highlighted in the RSI Trending Up scan, based on data from StockEdge. It is considered an uptrend signal when the RSI crosses above 50 from lower levels, indicating strengthening momentum and potential upward price movement.",
            "pubDate": "2025-12-30T03:18:15.496859"
        },
        {
            "title": "BEL shares in focus after securing Rs 569 crore worth of defence orders since last disclosure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-after-securing-rs-569-crore-worth-of-defence-orders-since-last-disclosure/articleshow/126242581.cms",
            "description": "Bharat Electronics Limited (BEL) shares are set to gain attention following the announcement of new defence orders worth Rs 569 crore. These significant orders, spanning various strategic products like radars and communication equipment, bolster BEL's position in India's defence manufacturing. This comes as the Defence Acquisition Council also approved proposals worth Rs 79,000 crore, boosting the sector's outlook.",
            "pubDate": "2025-12-30T03:18:15.496973"
        },
        {
            "title": "Honasa Consumer shares in focus as promoter Varun Alagh raises stake via bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-shares-in-focus-as-promoter-varun-alagh-raises-stake-via-bulk-deal/articleshow/126242566.cms",
            "description": "Honasa Consumer, Mamaearth's parent, is in focus as promoter Varun Alagh boosted his stake by acquiring shares from Fireside Ventures for Rs 50 crore. This move comes as the company shows improved profitability and revenue growth, despite its stock trading below its IPO price. The beauty and personal care firm operates popular brands like Mamaearth and The Derma Co.",
            "pubDate": "2025-12-30T03:18:15.497068"
        },
        {
            "title": "Sundrex Oil shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sundrex-oil-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126242484.cms",
            "description": "Sundrex Oil Company's IPO debuts on NSE SME with zero grey market premium, indicating subdued listing expectations despite steady fundamentals. The Rs 32.25 crore issue, entirely a fresh issue, saw moderate overall subscription, with retail investors driving demand.",
            "pubDate": "2025-12-30T03:18:15.497161"
        },
        {
            "title": "Shyam Dhani Industries IPO: Shares boast 97% GMP going into listing today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shyam-dhani-industries-ipo-shares-boast-97-gmp-going-into-listing-today/articleshow/126242467.cms",
            "description": "Shyam Dhani Industries IPO is set to list on the NSE SME platform today, with a strong grey market premium of around 97% indicating a potential listing price of Rs 110-112. The issue saw an overwhelming subscription of 988.29 times, driven by significant demand from all investor categories.",
            "pubDate": "2025-12-30T03:18:15.497256"
        },
        {
            "title": "Dachepalli Publishers IPO listing today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dachepalli-publishers-ipo-listing-today-heres-what-gmp-indicates/articleshow/126242453.cms",
            "description": "Dachepalli Publishers is set for a subdued debut on BSE SME, with grey market premiums indicating a listing near its issue price of Rs 102. The educational content provider, which raised Rs 40.39 crore, saw strong subscription from non-institutional investors. Investors will now focus on the company's execution and scaling capabilities in the competitive educational publishing market.",
            "pubDate": "2025-12-30T03:18:15.497348"
        },
        {
            "title": "Negative Breakout: These 14 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-14-stocks-cross-below-their-200-dmas/slideshow/126242439.cms",
            "description": "In the Nifty 500 segment, the closing prices of 14 stocks fell below their 200-day DMA (Daily Moving Average) on December 29, according to StockEdge’s technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-12-30T03:18:15.497442"
        },
        {
            "title": "EPW India IPO heads to listing with a 3% GMP. All you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/epw-india-ipo-heads-to-listing-with-a-3-gmp-all-you-need-to-know/articleshow/126242356.cms",
            "description": "EPW India's stock market debut is expected to be subdued. The grey market premium is low, indicating a cautious opening. The company raised funds for working capital and debt repayment. Its business involves refurbished IT hardware. Financials show strong growth. Future performance will depend on execution and financial management.",
            "pubDate": "2025-12-30T03:18:15.497538"
        },
        {
            "title": "GIFT Nifty down 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126242137.cms",
            "description": "Indian equity markets closed lower in a subdued session, impacted by consistent foreign institutional investor outflows and year-end caution. Analysts anticipate a narrow trading range for Indian equities in the near term, influenced by macro indicators and institutional flows. The India VIX saw a 6% rise, indicating increased market fear.",
            "pubDate": "2025-12-30T03:18:15.497631"
        },
        {
            "title": "Stocks in news: RIL, Waaree Energies, Arvind Fashions, Honasa Consumer, Mangalam Drugs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-waaree-energies-arvind-fashions-honasa-consumer-mangalam-drugs/articleshow/126242112.cms",
            "description": "Indian markets saw a slight dip on Monday, extending Friday's decline, with analysts anticipating consolidation ahead of the monthly expiry. Key stocks like RIL, Waaree Energies, Arvind Fashions, Honasa Consumer, and Mangalam Drugs are in focus due to significant corporate news and investor activity.",
            "pubDate": "2025-12-30T03:18:15.497721"
        },
        {
            "title": "Asian stock rally pauses, silver stays volatile",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stock-rally-pauses-silver-stays-volatile/articleshow/126242103.cms",
            "description": "Asian stocks paused their seven-day rally, mirroring tech-led declines on Wall Street. Gold and silver fluctuated after a sharp drop from record highs. Despite risks, strategists anticipate further gains for US stocks in 2026, with the Fed's meeting minutes awaited.",
            "pubDate": "2025-12-30T03:18:15.497810"
        },
        {
            "title": "Sensex falls over 200 pts, Nifty below 25,900 as foreign flow woes linger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-pts-nifty-below-25900-as-foreign-flow-woes-linger/articleshow/126243538.cms",
            "description": "Indian stock markets began Tuesday on a down note. The Sensex and Nifty continued their recent decline. Investors remained cautious. This was due to quiet year-end trading. Concerns about foreign fund flows also kept markets subdued. Trading volumes were thin. Risk appetite was limited.",
            "pubDate": "2025-12-30T04:09:39.132848"
        },
        {
            "title": "New Year stock picks 2026: Motilal Oswal suggests HCL Tech, Eternal among 11 names to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-year-stock-picks-2026-motilal-oswal-suggests-hcl-tech-eternal-among-11-names-to-buy/slideshow/126243646.cms",
            "description": "Motilal Oswal Wealth Management has laid out its latest top equity ideas, blending large, mid and selective growth names across sectors for the new year 2026. The picks are backed by detailed valuation metrics, earnings visibility and return ratios, offering a snapshot of where the brokerage sees risk-reward turning favourable over the next two to three years.",
            "pubDate": "2025-12-30T04:09:39.132966"
        },
        {
            "title": "Dixon Technologies among 5 F&O stocks that saw a sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-among-5-fo-stocks-that-saw-a-sharp-rise-in-futures-open-interest/slideshow/126243561.cms",
            "description": "As of December 29, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-30T04:09:39.133095"
        },
        {
            "title": "Japan's Nikkei gauge trims 2025 surge as techs take a breather",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-gauge-trims-2025-surge-as-techs-take-a-breather/articleshow/126243364.cms",
            "description": "Japan's Nikkei index saw a slight dip on Tuesday, with tech stocks leading the decline. Despite this, the Nikkei is on track for a significant annual gain, its third consecutive. SoftBank's acquisition news and a broader tech pullback from Wall Street contributed to the day's movements, though analysts suggest end-of-year adjustments are a key factor.",
            "pubDate": "2025-12-30T04:09:39.133193"
        },
        {
            "title": "Motilal Oswal picks 4 defence stocks with upside potential of up to 36% after DAC’s Rs 79,000 cr clearance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-picks-4-defence-stocks-with-upside-potential-of-up-to-36-after-dacs-rs-79000-cr-clearance/articleshow/126243355.cms",
            "description": "Motilal Oswal has turned bullish on select defence stocks after the Defence Acquisition Council approved capital proposals worth Rs 79,000 crore. The brokerage sees Bharat Electronics, Hindustan Aeronautics, Bharat Dynamics and Astra Microwave Products benefiting from a strong defence procurement pipeline over the medium term.",
            "pubDate": "2025-12-30T04:09:39.133291"
        },
        {
            "title": "Honasa Consumer, HEG among 5 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-heg-among-5-stocks-closed-crossing-above-vwap/slideshow/126243162.cms",
            "description": "On December 29, the closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-12-30T04:09:39.133386"
        },
        {
            "title": "$16.5 billion in a year! Mukesh Ambani leads India’s 2025 billionaire wealth surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/16-5-billion-in-a-year-mukesh-ambani-leads-indias-2025-billionaire-wealth-surge/articleshow/126244085.cms",
            "description": "Mukesh Ambani led India's billionaire wealth surge in 2025, adding $16.5 billion as Reliance Industries rallied nearly 30%. Gautam Adani also saw his fortune grow by $5.9 billion following a clean chit from Sebi. Conversely, Shiv Nadar and Azim Premji experienced wealth declines amid IT stock downturns.",
            "pubDate": "2025-12-30T04:49:55.231197"
        },
        {
            "title": "Warren Buffett retires tomorrow. Can Berkshire Hathaway thrive without the Oracle of Omaha?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-retires-tomorrow-can-berkshire-hathaway-thrive-without-the-oracle-of-omaha/articleshow/126243994.cms",
            "description": "Warren Buffett is retiring as Berkshire Hathaway CEO on December 31. Gregory Abel will take over operational control. This marks the end of a significant chapter for the company. Investors are now considering Berkshire's future direction. Buffett will remain chairman. The company's vast holdings and investment strategy will be closely watched.",
            "pubDate": "2025-12-30T04:49:55.231336"
        },
        {
            "title": "Hindustan Copper double money in 2025 after 40% rally in 8 days. Too late to buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-double-money-in-2025-after-40-rally-in-8-days-too-late-to-buy-now/articleshow/126243898.cms",
            "description": "Hindustan Copper shares surged nearly 40% in eight sessions, crossing 100% gains for 2025, driven by global supply disruptions and surging demand from electrification and AI. Favorable macro trends, including a weak dollar and rising copper prices, further boosted the company's outlook. Experts suggest a strong medium-term outlook, though near-term caution is advised due to elevated RSI levels.",
            "pubDate": "2025-12-30T04:49:55.231547"
        },
        {
            "title": "Gujarat Kidney shares list at 6% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-kidney-shares-list-at-6-premium-over-ipo-price/articleshow/126243918.cms",
            "description": "Gujarat Kidney and Super Speciality debuted on stock exchanges with a 6% premium, opening at Rs 120.75 on BSE and Rs 120 on NSE, against its IPO price of Rs 114. The Rs 251 crore IPO saw healthy investor participation, driven by strong retail demand, despite muted grey market signals.",
            "pubDate": "2025-12-30T04:49:55.231647"
        },
        {
            "title": "The year of the antifragile: India’s 2025 performance signals structural strength heading into 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-year-of-the-antifragile-indias-2025-performance-signals-structural-strength-heading-into-2026/articleshow/126243872.cms",
            "description": "India's economy and markets displayed remarkable antifragility in 2025, not just enduring shocks but strengthening from them. Domestic investors stepped in decisively as global uncertainty and trade tariffs briefly unsettled markets. The India-UK FTA and a robust IPO market highlight India's growing global role and investor confidence, with participation expanding beyond major cities.",
            "pubDate": "2025-12-30T04:49:55.231743"
        },
        {
            "title": "Smallcap multibagger stock with 360% returns in a year goes ex-date for 3:1 bonus issue. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-multibagger-stock-with-360-returns-in-a-year-goes-ex-date-for-31-bonus-issue-do-you-own/articleshow/126243814.cms",
            "description": "A-1 Ltd, a smallcap stock with stellar returns, is offering a 3:1 bonus share issue. Investors must buy shares by December 30, 2025, to qualify. Following this, a 1:10 stock split will occur. These corporate actions aim to boost share count and liquidity for shareholders.",
            "pubDate": "2025-12-30T04:49:55.231839"
        },
        {
            "title": "In a photo finish, metals' superiority over PSU banks is a 2025 takeaway. Here's how",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/in-a-photo-finish-metals-superiority-over-psu-banks-is-a-2025-takeaway-heres-how/articleshow/126243749.cms",
            "description": "Metal stocks are set for a photo finish with PSU banks in 2025, but metals show broader strength with 93% generating positive returns versus 67% for PSU banks. Hindustan Copper leads with a 90% surge, while Canara Bank tops PSU banks with a 50% gain. Metal sector outlook remains positive.",
            "pubDate": "2025-12-30T04:49:55.231941"
        },
        {
            "title": "Reliance Jio's defining act: What the 2026 IPO means for RIL shareholders after Rs 4.5 lakh crore rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-jios-defining-act-what-the-2026-ipo-means-for-ril-shareholders-after-rs-4-5-lakh-crore-rally/articleshow/126243684.cms",
            "description": "Reliance Industries shareholders anticipate the much-awaited Jio IPO in H1 2026, potentially India's largest listing, aiming to unlock significant value. After a substantial rally driven by telecom, retail, and refining, the IPO could further boost RIL's market capitalization, though a holding company discount remains a consideration.",
            "pubDate": "2025-12-30T04:49:55.232033"
        },
        {
            "title": "MMTC shares decline 5% as gold, silver prices cool off from record levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mmtc-shares-decline-5-as-gold-silver-prices-cool-off-from-record-levels/articleshow/126244760.cms",
            "description": "Shares of MMTC Ltd fell 4.88% to Rs 67.21 on Tuesday as gold and silver prices retreated from recent highs. The government-owned bullion trader’s performance is closely linked to precious metal trends, with profit-taking and year-end volatility contributing to the stock’s decline, despite a morning rebound in metals.",
            "pubDate": "2025-12-30T05:39:41.070278"
        },
        {
            "title": "Lenskart revenue can grow 6x in next decade, valuations look optically high: Emkay",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-revenue-can-grow-6x-in-next-decade-valuations-look-optically-high-emkay/articleshow/126244663.cms",
            "description": "Emkay Global initiated coverage on Lenskart with a target price of Rs 525, citing strong long-term growth potential despite optically rich valuations. The brokerage expects robust revenue and earnings compounding driven by industry tailwinds, scale benefits, operating leverage and multiple scalable growth opportunities across India and international markets.",
            "pubDate": "2025-12-30T05:39:41.070400"
        },
        {
            "title": "Auto ancillary stocks in fast lane, rocket up to 130% in 2025. Do you have them in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-ancillary-stocks-in-fast-lane-rocket-up-to-130-in-2025-do-you-have-them-in-your-portfolio/slideshow/126245066.cms",
            "description": "While OEMs have performed well, auto ancillaries have clearly outshone in 2025 with 3 stocks delivering over 100% returns during the year. Industry estimates project India’s auto component market could reach $200 billion by 2030, growing at an 18% compounded annual growth rate. The sector recorded a turnover of $80 billion in FY25, nearly doubling over five years. Auto component exports are expected to grow at a 28–32% CAGR through FY30, driven by India’s emergence as a global manufacturing hub. Here are top 10 stocks that shone the brightest.",
            "pubDate": "2025-12-30T05:52:10.702526"
        },
        {
            "title": "F&O Radar| Deploy Long Iron Condor in Nifty to gain benefit from rising IVs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-long-iron-condor-in-nifty-to-gain-benefit-from-rising-ivs/articleshow/126245933.cms",
            "description": "Nifty closes below 26,000, indicating continued range-bound behaviour. India VIX and implied volatility show signs of rising. Analysts suggest a Long Iron Condor options strategy to capitalise on low volatility, with defined breakeven points and a balanced risk-reward setup for traders.",
            "pubDate": "2025-12-30T06:39:35.956420"
        },
        {
            "title": "Eternal shares slide 3% to over 5-month low after Blinkit CFO quits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-slide-3-to-over-5-month-low-after-blinkit-cfo-quits/articleshow/126245964.cms",
            "description": "Eternal shares fell to a more than five-month low after the resignation of Blinkit chief financial officer Vipin Kapooria rattled investor confidence, even as competition in India’s quick-commerce sector intensifies ahead of a wave of public listings.",
            "pubDate": "2025-12-30T06:39:35.956545"
        },
        {
            "title": "Revised lot sizes for index F&O contracts to kick in tomorrow. Here’s what you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/revised-lot-sizes-for-index-fo-contracts-to-kick-in-tomorrow-heres-what-you-need-to-know/articleshow/126245263.cms",
            "description": "NSE announces revised lot sizes for Nifty, Bank Nifty, Nifty Financial Services, and Nifty Midcap Select, effective from January 2026 contracts. The changes aim to align notional values with index levels and ensure efficient market functioning. Traders are advised to review positions and brokers to update platforms accordingly.",
            "pubDate": "2025-12-30T06:39:35.956748"
        },
        {
            "title": "Investors' wealth surges by Rs 30.20 lakh cr in 2025 as stock markets post decent gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-wealth-surges-by-rs-30-20-lakh-cr-in-2025-as-stock-markets-post-decent-gains/articleshow/126247433.cms",
            "description": "Dalal Street investors became richer by Rs 30.20 lakh crore this year, helped by over 8 per cent surge in the BSE benchmark Sensex, despite facing multiple headwinds in the form of foreign fund exodus, tariff-related uncertainties, elevated valuations and a weakening rupee.",
            "pubDate": "2025-12-30T07:51:03.851265"
        },
        {
            "title": "Can Rs 79,000-crore DAC boost help HAL, BEL, other defence stocks deliver in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-rs-79000-crore-dac-boost-help-hal-bel-other-defence-stocks-deliver-in-2026/articleshow/126246458.cms",
            "description": "India’s Rs 79,000 crore defence procurement clearance strengthens the capital expenditure upcycle and boosts long-term order visibility for defence PSUs and private players. Analysts highlight missiles, electronics, drones and shipbuilding as key beneficiaries, with policy reforms further supporting MSMEs and defence start-ups.",
            "pubDate": "2025-12-30T07:51:03.851391"
        },
        {
            "title": "Nifty indices rejig takes effect tomorrow. Check stocks set to see big inflows and outflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-indices-rejig-takes-effect-tomorrow-check-stocks-set-to-see-big-inflows-and-outflows/articleshow/126248434.cms",
            "description": "The Nifty Indices quarterly rebalance effective December 30, 2025, is expected to drive significant inflows and outflows across Nifty 50 and Nifty Bank stocks. Research projections highlight likely beneficiaries and laggards as passive funds adjust portfolios following methodology and weight changes.",
            "pubDate": "2025-12-30T09:17:11.250995"
        },
        {
            "title": "Japan's Nikkei trims 2025 surge as tech stocks take a breather",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-trims-2025-surge-as-tech-stocks-take-a-breather/articleshow/126247515.cms",
            "description": "Japan's Nikkei share ​gauge edged lower on the final trading day of 2025, dragged ⁠down by the technology sector that has been a key driver of the year's massive gains.",
            "pubDate": "2025-12-30T09:17:11.251120"
        },
        {
            "title": "Mutual Funds invest in 8 midcap stocks for 4 quarters; Gains of up to 85% in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-invest-in-8-midcap-stocks-for-4-quarters-gains-of-up-to-85-in-a-year/slideshow/126248025.cms",
            "description": "When it comes to price performance, the results are impressive—more than half of these stocks delivered positive returns over the last year. Among them, eight standout stocks have truly caught the market’s attention, rallying between 25% and 90% in just twelve months. Clearly, keeping an eye on where the smart money is flowing can offer valuable insights and these midcaps are worth a closer look. (Data Source: ACE Equity)",
            "pubDate": "2025-12-30T10:00:54.373236"
        },
        {
            "title": "Sebi cancels licence of research analyst after finding he was running a grocery shop",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-cancels-licence-of-research-analyst-after-finding-he-was-running-a-grocery-shop/articleshow/126250910.cms",
            "description": "Sebi has cancelled the licence of research analyst Purooskhan after finding his registration was misused by an unregistered advisory firm promising sure-shot returns. Despite claiming no involvement, he admitted to sharing his email password and confirmed he now runs a grocery shop, prompting the regulator to terminate his registration.",
            "pubDate": "2025-12-30T10:58:04.310375"
        },
        {
            "title": "Ambit closes Poonawalla Vision Fund I at Rs 1,000 crore after three-week oversubscription",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambit-closes-poonawalla-vision-fund-i-at-rs-1000-crore-after-three-week-oversubscription/articleshow/126250670.cms",
            "description": "Ambit Global Private Client has completed the final close of Poonawalla Vision Fund I at around Rs 1,000 crore after strong investor demand led to quick oversubscription. Backed by the Poonawalla family, the Category II AIF focuses on mid- to late-stage profitable companies across BFSI, consumer and business services, and will invest across private and select public market opportunities.",
            "pubDate": "2025-12-30T10:58:04.310484"
        },
        {
            "title": "Mutual Funds invest in 8 midcap stocks for 4 quarters; Gains of up to 85% in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-invest-in-8-midcap-stocks-for-4-quarters-gains-of-up-to-85-in-a-year/slideshow/126249995.cms",
            "description": "Investors often find it fascinating to track where institutional investors, like mutual funds, are placing their bets, after all, these funds usually make moves only after thorough research. In our latest analysis, we discovered a compelling trend: over the past four quarters, mutual funds have steadily increased their stakes in 22 midcap stocks.",
            "pubDate": "2025-12-30T10:58:04.310581"
        },
        {
            "title": "Market Wrap: Sensex down 20 pts, Nifty below 26,000 as year-end caution persists",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-down-20-pts-nifty-below-26000-as-year-end-caution-persists/articleshow/126250130.cms",
            "description": "Indian stocks saw little change on Tuesday as thin year-end trading and foreign fund outflows kept investors cautious. Volumes were subdued. Broader markets also weakened. Auto, metal, and PSU bank stocks gained. The market is expected to remain sideways.",
            "pubDate": "2025-12-30T10:58:04.310682"
        },
        {
            "title": "Is 2025 a blip? Samir Arora says Nifty's 11.8% USD CAGR since 1998 tops gold, S&P 500",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-2025-a-blip-samir-arora-says-niftys-11-8-usd-cagr-since-1998-tops-gold-sp-500/articleshow/126249977.cms",
            "description": "Samir Arora says Indian equities have beaten gold and US markets over 27 years, with Nifty 50 TRI delivering 1,922% returns despite recent global underperformance.",
            "pubDate": "2025-12-30T10:58:04.310779"
        },
        {
            "title": "These 10 largecap stocks trading at a discount to industry PE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-largecap-stocks-trading-at-a-discount-to-industry-pe/slideshow/126251242.cms",
            "description": "A price-to-earnings (PE) ratio lower than the industry average indicates that a stock is valued more cheaply relative to its earnings compared with its peers. Based on a valuation scan by StockEdge.com, we have identified the top 10 stocks from the NSE largecap segment with PE ratios below their respective industry averages.This may suggest potential undervaluation, making these stocks appear attractive investment opportunities. However, it could also reflect concerns about a company’s growth prospects or associated risks. In short, a low PE ratio can signal either a possible buying opportunity or underlying challenges within the business.",
            "pubDate": "2025-12-30T11:19:41.185272"
        },
        {
            "title": "Stock Radar: Down over 20% from highs! Ircon International stock breaks out from downward trending trendline; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-down-over-20-from-highs-ircon-international-stock-breaks-out-from-downward-trending-trendline-time-to-buy/articleshow/126251208.cms",
            "description": "Ircon International has broken out of a key downward-sloping trendline, supported by strong volumes and improving technical indicators. Experts suggest a potential upside to Rs 220, driven by railway sector momentum and budget-related expectations.",
            "pubDate": "2025-12-30T11:45:27.739197"
        },
        {
            "title": "Down nearly 20% from highs! Engineers India stock showing signs of bottoming out; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-down-nearly-20-from-highs-engineers-india-stock-showing-signs-of-bottoming-out-time-to-buy/articleshow/126229560.cms",
            "description": "Engineers India stock is showing positive technical signals. The stock has reclaimed key moving averages, indicating a potential shift towards bullish momentum. Experts suggest short-term traders can consider buying the stock for a target of Rs 228. The stock has formed a strong base near Rs 195-Rs 200. This suggests buying interest and a solid foundation for future growth.",
            "pubDate": "2025-12-30T11:45:27.739313"
        },
        {
            "title": "Don’t make the mistake of writing off IT sector in 2026: Vikas Khemani",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dont-make-the-mistake-of-writing-off-it-sector-in-2026-vikas-khemani/articleshow/126252527.cms",
            "description": "Despite record FII selling and a weak 2025 for IT stocks, Vikas Khemani believes fears around AI-led disruption are overstated. He argues that past tech transitions only expanded India’s IT opportunity and expects 2026 to be better as rates ease, flows improve, and selective IT stocks show long-term strength.",
            "pubDate": "2025-12-30T13:06:41.533098"
        },
        {
            "title": "Shriram Finance among 5 financial services stocks hit 52-week highs; gains up to 30% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-among-5-financial-services-stocks-hit-52-week-highs-gains-up-to-30-in-a-month/slideshow/126252226.cms",
            "description": "On Tuesday, the benchmark Sensex ended nearly unchanged but slipped marginally into the red, closing 20 points lower at 84,675. Despite the broader market’s slight weakness, seven BSE financial services stocks climbed to fresh 52-week highs, reaching their best levels in a year. Such breakouts are often viewed as indicators of sustained bullish momentum and could point to further upside in the near term.",
            "pubDate": "2025-12-30T13:06:41.533232"
        },
        {
            "title": "How inter-exchange arbitrage works for retail traders on NSE and BSE: Zerodha's Nithin Kamath explains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-inter-exchange-arbitrage-works-for-retail-traders-on-nse-and-bse-zerodhas-nithin-kamath-explains/articleshow/126253764.cms",
            "description": "Zerodha founder Nithin Kamath explained how retail traders can capture inter-exchange arbitrage by buying on one exchange and exiting on the other directly from the positions page. The feature releases margins instantly and works for both intraday and delivery trades, helping traders exploit short-lived NSE–BSE price gaps efficiently.",
            "pubDate": "2025-12-30T13:58:45.166090"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/126255412.cms",
            "description": "Indian markets ended flat on Tuesday as year-end caution and persistent FII outflows kept sentiment subdued. Nifty hovered below 26,000, with analysts flagging a weak short-term trend amid negative technical indicators. Activity remained stock-specific, with Hindustan Copper, auto names and PSU banks drawing strong interest despite overall bearish market breadth.",
            "pubDate": "2025-12-30T15:49:02.275086"
        },
        {
            "title": "Ramkrishna Forgings bulk deal: Morgan Stanley buys shares worth Rs 95 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ramkrishna-forgings-bulk-deal-morgan-stanley-buys-shares-worth-rs-95-crore/articleshow/126255365.cms",
            "description": "Ramkrishna Forgings saw major bulk deal activity on Tuesday as Morgan Stanley bought shares worth Rs 95 crore while Societe Generale sold Rs 75 crore worth. The buying and selling prices were at a discount of 1.2% over the Monday closing price of Rs 512.90 on the NSE.",
            "pubDate": "2025-12-30T15:49:02.275182"
        },
        {
            "title": "Market Trading Guide: Buy Adani Energy, Tata Steel and 4 more stocks on Wednesday for up to 8% gains. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-adani-energy-tata-steel-and-4-more-stocks-on-wednesday-for-up-to-8-gains-heres-why/slideshow/126255120.cms",
            "description": "Nifty ended with marginal declines, extending its fall to the fourth day in a row. While metal, auto and bank stocks provided a positive momentum, IT, realty and consumer stocks were spoilsports. The index has slipped to the upper band of the falling wedge pattern, where the correction appears to have been arrested.Commenting on the current trends, Rupak De, Senior Technical Analyst at LKP Securities, said that some negative technical factors may influence market sentiment in the coming days. \"The index has fallen below the middle Bollinger Band, the RSI has entered a bearish crossover, and the Nifty has also slipped below the 21 EMA, reinforcing the short-term downtrend. Immediate support is placed in the 25,850–25,870 zone. A decisive break below this level could intensify bearish sentiment, while resistance is placed at 26,000,\" De said.Here are 6 stock recommendations for Wednesday:",
            "pubDate": "2025-12-30T15:49:02.275268"
        },
        {
            "title": "Two Trades for Today: An auto ancillary major for a 6.65% rise; a large-cap iron & steel stock for an almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-auto-ancillary-major-for-a-6-65-rise-a-large-cap-iron-steel-stock-for-an-almost-6-gain/articleshow/126254704.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-30T15:49:02.275351"
        }
    ]
}