{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-03T07:12:26.107050",
    "items": [
        {
            "title": "L&T Finance among 8 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-finance-among-8-stocks-witness-5-year-swing-high-breakout/slideshow/124282007.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, eight stocks witnessed a 5-year swing high at the close on October 1, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-10-03T03:17:20.745850"
        },
        {
            "title": "Shriram Finance and 9 other stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-and-9-other-stocks-showing-bullish-rsi-upswing/slideshow/124281866.cms",
            "description": "Ten stocks from the NSE large-cap pack were highlighted in the RSI Trending Up scan on October 1, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-03T03:17:20.745973"
        },
        {
            "title": "Chatterbox Technologies IPO set for listing. GMP hints at healthy debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chatterbox-technologies-ipo-set-for-listing-gmp-hints-at-healthy-debut/articleshow/124281391.cms",
            "description": "Chatterbox Technologies will debut on the BSE SME platform this Friday. Its initial public offering closed earlier this week. The company raised 42.86 crore rupees. The IPO received strong investor interest. Shares are trading at a premium in the grey market. Chatterbox operates an influencer marketing platform connecting brands with creators.",
            "pubDate": "2025-10-03T03:17:20.746081"
        },
        {
            "title": "Gujarat Peanut and Agri Products IPO to debut today. GMP signals decent listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-peanut-and-agri-products-ipo-to-debut-today-gmp-signals-decent-listing/articleshow/124281351.cms",
            "description": "Gujarat Peanut and Agri Products is set to list on BSE SME October 3, following a fully subscribed IPO. The issue saw robust demand, subscribed nearly eight times, and commands a strong grey market premium of Rs 25. This indicates a potential strong debut around Rs 105-110, backed by the company's significant financial growth and established export presence.",
            "pubDate": "2025-10-03T03:17:20.746187"
        },
        {
            "title": "Positive Breakout: These 9 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-close-cross-above-their-200-dmas/slideshow/124281309.cms",
            "description": "In the Nifty200 pack, nine stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on October 01, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered an overall uptrend. Take a look:",
            "pubDate": "2025-10-03T03:17:20.746288"
        },
        {
            "title": "Telge Projects IPO set to list on Friday. GMP suggests muted debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/telge-projects-ipo-set-to-list-on-friday-gmp-suggests-muted-debut/articleshow/124281226.cms",
            "description": "Telge Projects will debut on the BSE SME platform on October 3, 2025. Its Rs 27 crore IPO concluded with a 2.99 times subscription. The grey market premium currently shows no gain. The company provides engineering design services. It reported strong revenue and profit growth in FY25. IPO funds will support new offices and IT infrastructure.",
            "pubDate": "2025-10-03T03:17:20.746391"
        },
        {
            "title": "Berkshire Hathaway to pay $9.7 billion for OxyChem, potentially Warren Buffett's last big deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-hathaway-to-pay-9-7-billion-for-oxychem-potentially-warren-buffetts-last-big-deal/articleshow/124281178.cms",
            "description": "Berkshire Hathaway is acquiring Occidental Petroleum's chemical division, OxyChem, for $9.7 billion, a deal potentially marking a leadership transition to Greg Abel. While Warren Buffett's direct mention was absent, his influence is widely assumed. This significant acquisition, though using under 3% of Berkshire's cash, will substantially help Occidental reduce its considerable debt.",
            "pubDate": "2025-10-03T03:17:20.746509"
        },
        {
            "title": "Blackstone hits $10 billion Asia buyout fund goal amid PE chill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstone-hits-10-billion-asia-buyout-fund-goal-amid-pe-chill/articleshow/124281091.cms",
            "description": "Blackstone Inc. has successfully reached its $10 billion target for its latest Asia buyout fund, with expectations to hit its $12.9 billion hard cap by early next year. This achievement, fueled by strong returns and an expanding presence in India and Japan, occurs despite a cautious global private equity market.",
            "pubDate": "2025-10-03T03:17:20.746606"
        },
        {
            "title": "Stocks to buy in 2025 for long term: TCS, Sun Pharma among 5 stocks that could give 14-36% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-tcs-sun-pharma-among-5-stocks-that-could-give-14-36-return/slideshow/124281126.cms",
            "description": "Brokerage firms have come out with their latest stock recommendations, highlighting opportunities across IT, pharma, financials, and healthcare for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-03T03:17:20.746702"
        },
        {
            "title": "Wall Street closes with records as tech support offsets labor, shutdown uncertainties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-with-records-as-tech-support-offsets-labor-shutdown-uncertainties/articleshow/124280957.cms",
            "description": "Wall Street indexes closed at record highs, primarily driven by the technology sector and AI chip companies, amidst a U.S. government shutdown. Investors, monitoring private labor data, anticipated potential Fed rate cuts. The shutdown also raised concerns about its duration and impacted specific stock performances.",
            "pubDate": "2025-10-03T03:17:20.746798"
        },
        {
            "title": "Tata Motors poised for upside as technicals indicate reversal: Choice Broking",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-poised-for-upside-as-technicals-indicate-reversal-choice-broking/videoshow/124263043.cms",
            "description": "On the daily chart, Tata Motors stock has taken support at the lower band of its Symmetrical Triangle formation, indicating the possibility of a bounce-back move. Traders can buy for a target of Rs 695-710 in the next few weeks,” Kkunal V. Parar, Vice-President of Technical Research and Algo, Choice Broking, said.",
            "pubDate": "2025-10-03T03:17:20.746893"
        },
        {
            "title": "Asian stocks edge up after tech powers Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-up-after-tech-powers-wall-street/articleshow/124280809.cms",
            "description": "Global equities reached new records as optimism around artificial intelligence propelled Asian stocks and US tech shares higher. The S&P 500 and Nasdaq 100 hit new highs, with Alibaba also surging. This strong tech momentum overshadowed concerns about a US government shutdown and potential federal job cuts.",
            "pubDate": "2025-10-03T03:17:20.746991"
        },
        {
            "title": "GIFT Nifty down 10 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124280791.cms",
            "description": "Indian equity markets staged a strong rebound on Wednesday after eight consecutive sessions of decline, with analysts expecting positive momentum to sustain on Friday. This outlook is supported by an accommodative monetary policy, favorable monsoon, festive demand, a fall in India VIX, and a recovering rupee.",
            "pubDate": "2025-10-03T03:17:20.747087"
        },
        {
            "title": "Stocks in news: Tata Motors, Adani Green, Waaree Energies, Maruti Suzuki, PVR Inox",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tata-motors-adani-green-waaree-energies-maruti-suzuki-pvr-inox/articleshow/124280766.cms",
            "description": "Markets rebounded on Wednesday after an eight-session losing streak. The Reserve Bank of India kept the repo rate unchanged. This signaled confidence in the economic outlook. Tata Motors, Adani Green, and PVR Inox were in focus. Tata Motors sales surged. Adani Green faced a deal challenge. PVR Inox received a CCI probe order.",
            "pubDate": "2025-10-03T03:17:20.747182"
        },
        {
            "title": "Lending leeway to pave way for Rs 5 lakh crore credit demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lending-leeway-to-pave-way-for-rs-5-lakh-crore-credit-demand/articleshow/124280664.cms",
            "description": "India's credit growth, currently below 10%, is poised to accelerate as new RBI measures could unleash ₹5 lakh crore in demand. Easing corporate exposure norms and allowing M&A financing are key drivers for this potential surge. While these relaxations are positive, weak credit demand remains a significant hurdle for faster economic expansion.",
            "pubDate": "2025-10-03T03:17:20.747280"
        },
        {
            "title": "Chipmakers add $200 billion in global rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chipmakers-add-200-billion-in-global-rally/articleshow/124280645.cms",
            "description": "Chipmakers' market value increased. Investors sought artificial intelligence exposure. Tech stocks reached new highs. OpenAI deals and Intel talks fueled this market. Korean chip stocks gained. European chip equipment makers also advanced. Investors showed fear of missing out. Valuations rose, nearing record levels. This rally reflects a scramble for AI technology.",
            "pubDate": "2025-10-03T03:17:20.747373"
        },
        {
            "title": "Tata Motors among 4 stocks that showed Bullish Candlestick Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-among-4-stocks-that-showed-bullish-candlestick-pattern/slideshow/124282736.cms",
            "description": "On October 1, in the NSE large cap pack, four stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-10-03T04:20:37.044608"
        },
        {
            "title": "Recent US rate cut aims to shield jobs amid economic uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/recent-us-rate-cut-aims-to-shield-jobs-amid-economic-uncertainty/slideshow/124282733.cms",
            "description": "Lorie Logan said the Federal Reserve appropriately cut rates last month to guard against risks of a sharp deterioration in the U.S. job market. She emphasised that this move served as “insurance” amid uncertainties, including a sluggish labour market and the threat of tariffs pushing inflation upward. (Source: Reuters)",
            "pubDate": "2025-10-03T04:20:37.044733"
        },
        {
            "title": "Hero MotoCorp shares in focus after reporting 8% YoY growth in September sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-after-reporting-8-yoy-growth-in-september-sales/articleshow/124282681.cms",
            "description": "Hero MotoCorp shares: Hero MotoCorp reported an 8% YoY sales rise in September 2025, dispatching 6,87,220 units versus 6,37,050 last year. The company also became the first Indian manufacturer to cross 125 million cumulative two-wheeler production. VAHAN registrations grew 19% YoY to 3,23,230 units, signaling strong festive season demand momentum.",
            "pubDate": "2025-10-03T04:20:37.044853"
        },
        {
            "title": "Sensex slips 200 pts, Nifty below 24,800 amid profit booking; IT, auto stocks fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-200-pts-nifty-below-24800-amid-profit-booking-it-auto-stocks-fall/articleshow/124282394.cms",
            "description": "Benchmark indices Nifty and Sensex traded lower on Friday, October 3, as investors booked profits after a significant Wednesday surge. Banks, FMCG, and IT stocks faced selling pressure, while metal and PSU bank stocks saw gains. The broader market, including Nifty Midcap and Smallcap, outperformed the benchmarks by opening in the green.",
            "pubDate": "2025-10-03T04:20:37.044960"
        },
        {
            "title": "Sammaan Capital shares in focus as IHC acquires controlling stake for Rs 8,850 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sammaan-capital-shares-in-focus-as-ihc-acquires-controlling-stake-for-rs-8850-crore/articleshow/124282638.cms",
            "description": "Sammaan Capital shares: Abu Dhabi’s International Holding Company (IHC) announced plans to acquire a 43.5% stake for ₹8,850 crore via preferential allotment of shares and warrants at ₹139 each. The deal will make IHC the new promoter, triggering a mandatory open offer for an additional 26% stake. Post-investment, IHC will control board appointments, subject to regulatory approvals.",
            "pubDate": "2025-10-03T04:20:37.045088"
        },
        {
            "title": "BOJ eyes gradual rate increases as economy shows resilience",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-eyes-gradual-rate-increases-as-economy-shows-resilience/slideshow/124282629.cms",
            "description": "Governor Kazuo Ueda stated that inflation in Japan is on track to durably reach the Bank of Japan’s 2% target. He highlighted that underlying inflation, which excludes one-off factors, is expected to accelerate. However, rising food costs could temporarily reduce consumption and put some pressure on overall inflation. (Source: Reuters)",
            "pubDate": "2025-10-03T04:20:37.045199"
        },
        {
            "title": "RBL Bank, IREDA among 7 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-ireda-among-7-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124282228.cms",
            "description": "There was a notable surge in futures open interest for seven stocks in the NSE F&O pack as of October 1, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-03T04:20:37.045300"
        },
        {
            "title": "Adani Green Energy shares in focus amid Andhra Pradesh transmission fee row in Rs 7,000 MW solar deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-energy-shares-in-focus-amid-andhra-pradesh-transmission-fee-row-in-rs-7000-mw-solar-deal/articleshow/124282148.cms",
            "description": "Adani Green share price: Adani Green Energy’s Rs 7,000 MW solar supply deal with Andhra Pradesh faces hurdles over transmission fee waivers, potentially delaying power offtake, while the company navigates ongoing regulatory and legal challenges in India and abroad.",
            "pubDate": "2025-10-03T04:20:37.045399"
        },
        {
            "title": "Tata Motors shares in focus on surpassing Hyundai, M&M to reclaim no. 2 spot in PV market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-on-surpassing-hyundai-mm-to-reclaim-no-2-spot-in-pv-market/articleshow/124282127.cms",
            "description": "Tata Motors share price: Tata Motors’ strong SUV and EV sales helped it reclaim the No. 2 spot in India’s passenger vehicle market, with September registrations rising 28%, while overall EV adoption more than doubled, highlighting the company’s growing dominance in the electric mobility segment.",
            "pubDate": "2025-10-03T04:20:37.045496"
        },
        {
            "title": "Reliance Industries shares in focus as co eyes Rs 30,000 crore packaged water market with Campa Sure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-as-co-eyes-rs-30000-crore-packaged-water-market-with-campa-sure/articleshow/124282111.cms",
            "description": "Reliance share price: RIL's arm Reliance Consumer Products is entering India’s Rs 30,000 crore packaged water market with its new brand, Campa Sure. The company aims to disrupt the segment through competitive pricing, partnerships with regional bottlers, and wider distribution, offering affordable, high-quality bottled water to consumers.",
            "pubDate": "2025-10-03T04:20:37.045595"
        },
        {
            "title": "Smallcap multibagger stock approaches record date for 1:10 stock split. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-multibagger-stock-approaches-record-date-for-110-stock-split-last-day-to-buy/articleshow/124282053.cms",
            "description": "Sigma Solve is approaching its 1:10 stock split with an ex-date on October 6, 2025. The split will increase the number of shares, lower the face value, and boost liquidity, making the stock more accessible for retail investors without changing the total investment value.",
            "pubDate": "2025-10-03T04:20:37.045697"
        },
        {
            "title": "HDFC Bank shares slide nearly 2% after 26.5 lakh shares change hands in block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-slide-nearly-2-after-26-5-lakh-shares-change-hands-in-block-deal/articleshow/124283299.cms",
            "description": "HDFC Bank shares: A large block deal of 26.5 lakh shares triggered heavy trading volumes. The bulk transaction sparked investor concerns over possible institutional selling, causing intraday weakness. The buyer and seller remain undisclosed, and the bank’s market cap stood at ₹14.68 lakh crore.",
            "pubDate": "2025-10-03T04:52:35.339987"
        },
        {
            "title": "Jinkushal Industries shares list at 3% premium over IPO price on bourses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jinkushal-industries-shares-list-at-3-premium-over-ipo-price-on-bse-nse/articleshow/124282989.cms",
            "description": "Jinkushal Industries debuted on bourses with a modest 3.45% premium over its IPO price, despite strong investor demand leading to a 65x oversubscription. The company, exporting construction machinery globally, reported robust FY25 revenue growth. Its long-term success depends on sustaining export demand and scaling its HexL brand.",
            "pubDate": "2025-10-03T04:52:35.340103"
        },
        {
            "title": "Axis Securities picks MGL, HDFC Bank among top 15 picks with upside potential of up to 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-picks-mgl-hdfc-bank-among-top-15-picks-with-upside-potential-of-up-to-30/slideshow/124283023.cms",
            "description": "As Indian equities navigate a shifting macroeconomic environment, Axis Securities has reiterated its confidence in the country’s long-term growth trajectory. The brokerage has maintained its Nifty target of 25,500 for March 2026, supported by expectations of robust earnings growth, favourable structural reforms such as GST 2.0, and improved credit and consumption momentum.Despite short-term volatility and earnings revisions in Q1FY26, Axis Securities sees upside potential driven by rural demand recovery, government spending, and a likely earnings upgrade from Q3FY26. Against this backdrop, Axis Securities has released its list of top stock picks across Large Cap, Mid Cap, and Small Cap segments, with upside potential of up to 30%",
            "pubDate": "2025-10-03T04:52:35.340209"
        },
        {
            "title": "TruAlt Bioenergy shares list at 11% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trualt-bioenergy-shares-list-at-11-premium-over-ipo-price/articleshow/124282748.cms",
            "description": "TruAlt Bioenergy share price: TruAlt Bioenergy shares debuted with a premium on October 3 after its Rs 839.28 crore IPO was oversubscribed 75 times, driven by strong institutional demand. The company, a major ethanol producer, reported rapid growth in FY25, but analysts note its aggressive valuation despite robust investor interest in renewables.",
            "pubDate": "2025-10-03T04:52:35.340306"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama recommends buy on APL Apollo & Amara Raja Batteries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-recommends-buy-on-apl-apollo-amara-raja-batteries/articleshow/124282865.cms",
            "description": "Brokerages remain bullish on select mid- and large-cap stocks, highlighting strong growth potential. Nuvama backs APL Apollo Tubes and Amara Raja Batteries for robust volumes, improving margins, and long-term opportunities, including lithium ventures. Axis Securities supports Star Cement, citing infrastructure-driven demand and strategic expansion. These recommendations reflect confidence in sector leaders across building materials, energy storage, and industrial segments.",
            "pubDate": "2025-10-03T04:52:35.340417"
        },
        {
            "title": "US Government Shutdown: What it means for markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-government-shutdown-what-it-means-for-markets/slideshow/124283516.cms",
            "description": "Investors had been anticipating the risks of a U.S. government shutdown for weeks. Now that it has occurred, the hope is that it will be brief, minimizing disruptions to the economy and markets.",
            "pubDate": "2025-10-03T05:21:41.408167"
        },
        {
            "title": "From Jaipur to Goa, realty players eye festive boom on stable policy and GST relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-jaipur-to-goa-realty-players-eye-festive-boom-on-stable-policy-and-gst-relief/articleshow/124285159.cms",
            "description": "India's real estate sector expects a demand increase. Repo rates remain unchanged, and GST cuts aid construction. Homebuyers and developers anticipate sales growth this festive season. Tier-II cities and holiday homes will see activity. This market trend is projected to continue through 2025 and into 2026. Sector confidence builds.",
            "pubDate": "2025-10-03T07:12:18.065688"
        },
        {
            "title": "Jefferies flags top 4 bank stocks as RBI norms set to fuel credit uptick",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-flags-top-4-bank-stocks-as-rbi-norms-set-to-fuel-credit-uptick/articleshow/124284974.cms",
            "description": "The RBI’s decision to keep interest rates steady at 5.5% and maintain a neutral liquidity stance offers relief to banks, limiting potential margin compression. Its measures to ease lending restrictions support credit growth. Jefferies recommends large private banks -- HDFC Bank, Axis Bank, ICICI Bank -- and SBI among PSU banks, citing strong capital buffers and better positioning for the ECL transition.",
            "pubDate": "2025-10-03T07:12:18.065827"
        },
        {
            "title": "On watchlist? 5 stocks that saw promoter buying in the last week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/on-watchlist-5-stocks-that-saw-promoter-buying-in-the-last-week/slideshow/124284441.cms",
            "description": "Some promoter groups and insiders have been active in the market this week, picking up additional stakes in their companies, according to Trendlyne. Here are the highlights.",
            "pubDate": "2025-10-03T07:12:18.065947"
        },
        {
            "title": "TruAlt Bioenergy shares fall 3% from day’s high after debut. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trualt-bioenergy-shares-fall-3-from-days-high-after-debut-should-you-buy-sell-or-hold/articleshow/124284535.cms",
            "description": "TruAlt Bioenergy shares debuted strongly but gave up early gains, trading at Rs 530 on the NSE, up 7% from the issue price of Rs 496. Analysts recommend booking partial profits while holding a portion of shares. The company, a high-growth player in biofuels and renewable energy, benefits from government support and strong demand, though valuations remain elevated.",
            "pubDate": "2025-10-03T07:12:18.066070"
        },
        {
            "title": "Tata Investment shares surge 12% to hit fresh 52-week high. What's fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-shares-surge-12-extend-winning-streak-to-fifth-sessions-whats-fuelling-the-rally/articleshow/124284270.cms",
            "description": "Tata Investment shares rose sharply on Friday, extending gains to a fifth session amid stock split plans, strong FII buying, and robust investor sentiment. The stock hit a 52-week high, reflecting bullish momentum and growing market confidence in its growth prospects.",
            "pubDate": "2025-10-03T07:12:18.066188"
        },
        {
            "title": "Axis Bank shares rally 2% as Morgan Stanley predicts valuation gap to narrow with HDFC Bank, ICICI Bank; sets Rs 1,450 target",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-shares-rally-2-as-morgan-stanley-predicts-valuation-gap-to-narrow-with-hdfc-bank-icici-bank-sets-rs-1450-target/articleshow/124284211.cms",
            "description": "Axis Bank surged after Morgan Stanley reaffirmed its ‘Overweight’ rating and raised the target price to ₹1,450, signaling a 25% upside. The broker highlighted that Axis Bank trades at a 30–40% discount to HDFC and ICICI Bank on a price-to-book basis, expecting this gap to narrow as retail deposit growth and loan spreads align with larger peers.",
            "pubDate": "2025-10-03T07:12:18.066332"
        },
        {
            "title": "Netweb Technologies shares surge 6%, rally for 3rd consecutive session. What's fueling the gains?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-shares-surge-6-rally-for-3rd-consecutive-session-whats-fueling-the-gains/articleshow/124284171.cms",
            "description": "Netweb Technologies shares reached a new record high. The stock gained 175 percent in six months. India's digital infrastructure shift drives this performance. AI adoption and policy support create growth opportunities. Ventura Securities forecasts market expansion by FY28. Netweb anticipates revenue growth from AI systems and cloud services. Recent large order wins support company prospects.",
            "pubDate": "2025-10-03T07:12:18.066447"
        }
    ]
}