{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-21T03:31:38.142405",
    "items": [
        {
            "title": "Godrej Properties shares in focus after winning Hyderabad land parcel bid with Rs 3,800 crore revenue potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-properties-shares-in-focus-after-winning-hyderabad-land-parcel-bid-with-rs-3800-crore-revenue-potential/articleshow/123422070.cms",
            "description": "Godrej Properties has emerged as the highest bidder for a 7.825-acre land parcel in Kukatpally, Hyderabad, with a revenue potential of approximately Rs 3,800 crore. Securing the parcel for Rs 547.75 crore in an e-auction by the Telangana Housing Board, this acquisition strengthens Godrej's presence in Hyderabad, building on recent successful launches.",
            "pubDate": "2025-08-21T03:31:16.517953"
        },
        {
            "title": "IndusInd Bank shares in focus after legacy issue resolutions, new leadership appointment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-after-legacy-issue-resolutions-new-leadership-appointment/articleshow/123421925.cms",
            "description": "IndusInd Bank's share price is likely to remain in focus as the lender resolves legacy issues in its treasury and microfinance businesses. The board has also cleared the appointment of veteran banker Rajiv Anand as MD & CEO.",
            "pubDate": "2025-08-21T03:31:16.518077"
        },
        {
            "title": "NTPC, Info Edge, Infosys among 10 stocks showing RSI Trending Up on August 20",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-info-edge-infosys-among-10-stocks-showing-rsi-trending-up-on-august-20/slideshow/123421779.cms",
            "description": "Ten stocks from the NSE large cap segment were highlighted in the RSI Trending Up scan on August 20, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-08-21T03:31:16.518188"
        },
        {
            "title": "Insurance stocks in focus as GoM proposes to exempt GST on premiums",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-life-hdfc-life-insurance-and-other-insurance-stocks-in-focus-as-gom-proposes-to-exempt-gst-on-insurance-premiums/articleshow/123421858.cms",
            "description": "Insurance stocks like SBI Life and HDFC Life will be in focus after a GoM proposed exempting GST on individual health and life insurance premiums. The move, part of GST 2.0 reforms, could ease costs for policyholders and improve sector outlook, pending council approval.",
            "pubDate": "2025-08-21T03:31:16.518289"
        },
        {
            "title": "PG Electroplast, Aurobindo Pharma, HAL among 9 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pg-electroplast-aurobindo-pharma-hal-among-9-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123421605.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack as of August 20, contributing to a total increase in open interest of over 6% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-08-21T03:31:16.518395"
        },
        {
            "title": "Positive Breakout: These 8 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/123421500.cms",
            "description": "In the Nifty200 pack, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on August 20, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-08-21T03:31:16.518502"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Global Health, Piramal Pharma among 5 stocks that could give 15-52% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-global-health-piramal-pharma-among-5-stocks-that-could-give-15-52-return/slideshow/123421403.cms",
            "description": "Brokerages remain optimistic on select stocks across sectors, highlighting healthy upside potential in the near to medium term.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-21T03:31:16.518599"
        },
        {
            "title": "Dividend record date: Last chance to buy shares of Godfrey Phillips, IRCTC, other 50 companies for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-record-date-last-chance-to-buy-shares-of-godfrey-phillips-irctc-other-50-companies-for-eligibility/articleshow/123421308.cms",
            "description": "Indian investors seeking dividends have a final chance to buy shares. Friday is the record date for eligibility. Godfrey Phillips India leads with a Rs 60 per share dividend. IRCTC, LIC Housing Finance, and Lodha Developers also announced payouts. Numerous other companies across sectors declared dividends. This includes ABM Knowledgeware, AGI Greenpac, and Jindal Stainless.",
            "pubDate": "2025-08-21T03:31:16.518724"
        },
        {
            "title": "Multibagger stock with nearly 1700% returns in a year goes ex-bonus, ex-split tomorrow. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-stock-with-nearly-1700-returns-in-a-year-goes-ex-bonus-ex-split-tomorrow-check-details/articleshow/123421263.cms",
            "description": "Bemco Hydraulics, known for its impressive 1672% returns, is set to reward investors with a 1:1 bonus issue and a 10:1 stock split. August 22 is the record date, requiring investors to purchase shares today to qualify. This dual action significantly increases the number of shares held, enhancing liquidity and making the stock more accessible to retail investors.",
            "pubDate": "2025-08-21T03:31:16.518822"
        },
        {
            "title": "Australian shares hit fresh high on mining and banks boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-hit-fresh-high-on-mining-and-banks-boost/articleshow/123421145.cms",
            "description": "Australian shares reached a record high, propelled by gains in the mining and banking sectors. Investors are keenly awaiting U.S. Federal Reserve Chair Jerome Powell's speech for insights into future interest rate decisions. Meanwhile, James Hardie and Whitehaven Coal experienced significant declines due to bleak outlooks and profit drops, respectively.",
            "pubDate": "2025-08-21T03:31:16.518918"
        },
        {
            "title": "Nasdaq, S&P 500 end lower as investors sell tech, buy less pricey sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-sp-500-end-lower-as-investors-sell-tech-buy-less-pricey-sectors/articleshow/123421006.cms",
            "description": "On Wednesday, the Nasdaq and S&P 500 experienced declines as investors shifted away from tech stocks towards sectors with lower valuations, awaiting insights from Federal Reserve officials at the Jackson Hole symposium. Tech stocks faced pressure due to concerns about AI valuations and potential government intervention. Meanwhile, investors are closely monitoring upcoming economic data and earnings reports from major retailers.",
            "pubDate": "2025-08-21T03:31:16.519017"
        },
        {
            "title": "Asian stocks mixed, bonds climb ahead of Powell speech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-bonds-climb-ahead-of-powell-speech/articleshow/123420500.cms",
            "description": "Asian equities are poised for a mixed open as Wall Street favored bonds ahead of the Federal Reserve's Jackson Hole gathering. Fed officials highlighted inflation risks, fueling debate within the central bank. Technology stocks declined, with the 'Magnificent Seven' experiencing their longest losing streak since April, raising concerns about a potential market correction.",
            "pubDate": "2025-08-21T03:31:16.519115"
        },
        {
            "title": "Nazara shares tank 15% on real money gaming ban",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-shares-tank-15-on-real-money-gaming-ban/articleshow/123420431.cms",
            "description": "Nazara Technologies' shares plummeted after the Lok Sabha passed a bill banning real money gaming. The company clarified its indirect exposure through a stake in PokerBaazi, which reported losses. Analysts suggest Nazara's investment in PokerBaazi is now at risk, while Delta Corp is unlikely to be affected due to a prior divestment.",
            "pubDate": "2025-08-21T03:31:16.519213"
        },
        {
            "title": "GIFT Nifty up 5 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123414928.cms",
            "description": "Nifty marked its fifth consecutive session gain, propelled by IT stocks, with analysts predicting a positive near-term outlook due to government support and increased consumption. Technically, Nifty is a 'buy on dips' above 24,800, targeting 25,250 and potentially 25,500. The rupee strengthened, while FIIs were net sellers and DIIs were net buyers.",
            "pubDate": "2025-08-21T03:31:16.519305"
        },
        {
            "title": "Stocks in news: IndusInd Bank, India Cements, Godrej Properties, Clean Sciences, Exide Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indusind-bank-india-cements-godrej-properties-clean-sciences-exide-industries/articleshow/123414804.cms",
            "description": "Indian market continues its upward trend. IndusInd Bank addresses past issues. Godrej Properties acquires stake in Godrej Skyline Developers. Promoters may sell stake in Clean Sciences. Exide Industries invests in Exide Energy Solutions. Vedanta informs about corporate guarantee. Jupiter Wagons receives order for Vande Bharat train wheelsets. UltraTech board approves stake sale in India Cements.",
            "pubDate": "2025-08-21T03:31:16.519397"
        },
        {
            "title": "Aditya Birla ARC delivers 40% IRR amidst stressed asset recovery",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-arc-delivers-40-irr-amidst-stressed-asset-recovery/articleshow/123420317.cms",
            "description": "Aditya Birla ARC, a joint venture, provided a 40% return to its investors. This is the highest among Indian asset reconstruction companies. The ARC invested ₹6,000 crore in stressed assets. It generated substantial profits from investments like KSK Mahanadi Power and Rattan India Power. However, the company plans to surrender its ARC license.",
            "pubDate": "2025-08-21T03:31:16.519490"
        }
    ]
}