{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-29T09:36:13.695509",
    "items": [
        {
            "title": "Wall Street edges higher in thin post-holiday trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-edges-higher-in-thin-post-holiday-trade/articleshow/125650924.cms",
            "description": "Indian markets saw a surge in stock prices on Friday. Retail and technology sectors led the gains. Investors anticipated a Federal Reserve interest rate cut. Major indexes recorded weekly gains. The Nasdaq experienced a monthly decline due to AI valuation concerns. A CME Group outage briefly disrupted trading. The holiday shopping season commenced with Black Friday and Cyber Monday.",
            "pubDate": "2025-11-29T05:38:16.511032"
        },
        {
            "title": "European shares clock monthly gains on Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-clock-monthly-gains-on-fed-rate-cut-hopes/articleshow/125650865.cms",
            "description": "European shares concluded Friday higher, extending a strong weekly and monthly advance. Optimism surrounding potential U.S. rate cuts fueled gains, with the banking sector notably performing well. Basic Resources also led Friday's rise, driven by record copper prices, while aerospace and defence stocks faced pressure amid Ukraine peace talks.",
            "pubDate": "2025-11-29T05:38:16.511156"
        },
        {
            "title": "India’s blockbuster 8.2% Q2 GDP growth beats expectations. But is it enough to lift the markets?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-blockbuster-8-2-q2-gdp-growth-beats-expectations-but-is-it-enough-to-lift-the-markets/articleshow/125650707.cms",
            "description": "India’s Q2 FY26 GDP surged 8.2%, beating expectations and reaffirming its position as the fastest-growing major economy. Markets may open positively on Monday, driven by robust manufacturing and services growth, easing inflation, and potential FII sentiment shift, though experts caution against chasing indices at elevated levels.",
            "pubDate": "2025-11-29T05:38:16.511363"
        },
        {
            "title": "Sebi Plans online disclosure of cos’ names, registration numbers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-plans-online-disclosure-of-cos-names-reg-numbers/articleshow/125650663.cms",
            "description": "The Securities and Exchange Board of India, often referred to as Sebi, is rolling out a set of new regulations designed to clamp down on the rising tide of fraud in the securities market.",
            "pubDate": "2025-11-29T05:38:16.511461"
        },
        {
            "title": "Wall Street Week Ahead: Investors on watch for AI, economic updates as US stocks steady",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-on-watch-for-ai-economic-updates-as-us-stocks-steady/articleshow/125650587.cms",
            "description": "Indian markets are watching for AI profitability signals and economic health indicators. Stocks rebounded, buoyed by expected December Fed rate cuts. However, AI stock volatility, particularly in Nvidia and Alphabet, keeps investors cautious. Upcoming economic reports and consumer sentiment data will be crucial in navigating market uncertainty through year-end.",
            "pubDate": "2025-11-29T05:38:16.511552"
        },
        {
            "title": "Meesho IPO: GMP among 10 key thingstoknow before subscription next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-ipo-gmp-among-10-key-things-to-know-before-subscription-next-week/slideshow/125651736.cms",
            "description": "The Rs 5,421 crore IPO of Meesho opens on December 3 with a grey market premium of 31%. Early demand in the unofficial market reflects strong interest in the platform's scale-led growth story, although valuations and profitability remain key watchpoints. Investors will be weighing Meesho's leadership in value-ecommerce against risks around margins and competition.",
            "pubDate": "2025-11-29T06:17:58.341835"
        },
        {
            "title": "Concurrent Gainers: 10 smallcap stocks that gain for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-10-smallcap-stocks-that-gain-for-5-days-in-a-row/slideshow/125653286.cms",
            "description": "Over the five trading sessions ending on November 28, the Sensex added around 0.56%, or 475 points, to settle at 85,707. The benchmark logged gains in only two of the five sessions. Amid this modest uptrend, 10 stocks from the BSE small-cap index posted gains in all five sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-11-29T07:38:57.784094"
        },
        {
            "title": "What’s needed for India to become a leader in PCB manufacturing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/whats-needed-for-india-to-become-a-leader-in-pcb-manufacturing/articleshow/125652744.cms",
            "description": "Through Make in India, electronics-focused PLI schemes, SPECS, and the new ECMS, the government has created tailwinds for PCB manufacturing.",
            "pubDate": "2025-11-29T07:38:57.784216"
        },
        {
            "title": "Globus Spirits, VRL Logistics among InCred Equities top 10 small, midcap picks with upside potential up to 74%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/globus-spirits-vrl-logistics-among-incred-equities-top-10-small-midcap-picks-with-upside-potential-up-to-74/slideshow/125652609.cms",
            "description": "The markets saw an action-packed week. Nifty dipped below 25,850 early on but bounced past 26,300 on Wednesday. Despite a subdued finish, it closed just above 26,200, posting a fresh 14-month high.After nearly 14 months, Nifty posted a fresh high. Despite this milestone, the market did not show exuberant celebrations as consolidation continued near the 26,300 zone. Against this backdrop, InCred Equities has released its latest mid-cap and small-cap recommendations. We have compiled a list of 10 stocks with an ‘ADD’ rating that show significant upside potential — with the top pick offering up to 74% expected upside.",
            "pubDate": "2025-11-29T07:38:57.784325"
        },
        {
            "title": "Droneacharya’s IPO under scanner: Sebi bars company, promoters from markets, slaps Rs 50 lakh penalty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/droneacharyas-ipo-under-scanner-sebi-bars-company-promoters-from-markets-slaps-rs-50-lakh-penalty/articleshow/125651797.cms",
            "description": "Sebi has barred Droneacharya Aerial Innovations and its promoters from the markets for two years after finding misuse of IPO proceeds, inflated financials, and diversion of funds. The regulator also penalised the company and related entities with Rs 75 lakh for running a fraudulent scheme that misled public investors.",
            "pubDate": "2025-11-29T07:38:57.784422"
        },
        {
            "title": "F&O Talk| Nifty hits record high, but rally remains selective: Sudeep Shah explains what lies ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-talk-nifty-hits-record-high-but-rally-remains-selective-sudeep-shah-explains-what-lies-ahead/articleshow/125654196.cms",
            "description": "Markets extended their winning streak to a third week, hitting new record highs driven by global risk sentiment and domestic factors. Nifty and Sensex closed higher, with analysts anticipating further upward movement. While large caps lead, broader market participation remains selective, with specific sectors showing strong bullish setups.",
            "pubDate": "2025-11-29T09:36:10.718284"
        },
        {
            "title": "Consumer demand strengthens ahead of festive & wedding season; Titan & HUL top buy: Siddhartha Khemka",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/consumer-demand-strengthens-ahead-of-festive-wedding-season-titan-hul-top-buy-siddhartha-khemka/articleshow/125653902.cms",
            "description": "Consumer demand is strengthening ahead of the festive and wedding season, with improving trends across jewellery, liquor, paints, and select FMCG categories. Titan and Hindustan Unilever remain top picks as brand momentum, premiumisation, and recovering rural sentiment drive growth. Analysts expect a stronger second half as consumption normalises and margins stabilise.",
            "pubDate": "2025-11-29T09:36:10.718433"
        },
        {
            "title": "Ashish Kacholia's portfolio shines in FY26: 3 stocks turn multibaggers, 5 fresh Q2 picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholias-portfolio-shines-in-fy26-3-stocks-turn-multibaggers-5-fresh-q2-picks/slideshow/125653601.cms",
            "description": "Investors on Dalal Street often track the portfolios of prominent market participants to gauge potential market trends. In this vein, ETMarkets has analysed the latest investment holdings of renowned investor Ashish Kacholia. As of the September 2025 quarter, he held disclosed stakes in 48 companies worth about Rs 2,844 crore—up 15% from Rs 2,477 crore in March. This list includes only firms where his stake exceeds 1%.Of these 48 stocks, 21 have delivered double-digit FY26 returns, with nine surging between 50% and 265%, including three multibaggers. The September quarter also saw five new additions to his portfolio. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-11-29T09:36:10.718554"
        },
        {
            "title": "Sebi imposes 7-day ban on Prabhudas Lilladher over multiple rule violations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-imposes-7-day-ban-on-prabhudas-lilladher-over-multiple-rule-violations/articleshow/125653808.cms",
            "description": "Sebi has barred Prabhudas Lilladher from taking new assignments for seven days from December 15, citing multiple violations involving client funds, margin reporting, account settlements, and improper penalty pass-throughs. The action follows a joint inspection by Sebi and stock exchanges, which flagged lapses across key compliance and operational processes.",
            "pubDate": "2025-11-29T09:36:10.718654"
        }
    ]
}