{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-26T05:50:44.798891",
    "items": [
        {
            "title": "ASK Automotive shares tumble 5% as Rs 516 crore OFS opens for non-retail investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ask-automotive-shares-tumble-5-as-rs-516-crore-ofs-opens-for-non-retail-investors/articleshow/113688583.cms",
            "description": "ASK Automotive shares fell 5.4% to ₹442.05 amid a ₹516.4 crore offer for sale, with promoter Kuldeep Singh Rathee offloading a 6% stake.",
            "pubDate": "2024-09-26T05:50:23.002339"
        },
        {
            "title": "Reliance Power shares rally 5%, now up 41% in 7 days. What's cooking?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-rally-5-now-up-41-in-7-days-whats-cooking/articleshow/113688512.cms",
            "description": "Shares of Anil Ambani's Reliance Power rallied another 5% on Thursday, reaching a fresh 52-week high of Rs 44.15 on the NSE. Today marked the seventh consecutive day that the small-cap stock, a favorite among retail investors, hit the 5% upper circuit limit.",
            "pubDate": "2024-09-26T05:50:23.002474"
        },
        {
            "title": "Rs 55,000 crore in play! Hyundai, Swiggy, NSE among 6 major IPOs to track in next 6 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-55000-crore-in-play-hyundai-swiggy-nse-among-6-major-ipos-to-track-in-next-6-months/slideshow/113687739.cms",
            "description": "The Indian IPO market is raging on with companies raising over Rs 70,000 crore through the primary market so far this year. The momentum is only set to intensify in the coming months, with several major companies gearing up to go public. Here's a look at the most highly anticipated IPOs in the next six months.",
            "pubDate": "2024-09-26T05:50:23.002580"
        },
        {
            "title": "IDFC First Bank and IDFC shares rally upto 2% on NCLT nod for amalgamation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idfc-first-bank-and-idfc-shares-rally-upto-2-on-nclt-nod-for-amalgamation/articleshow/113688448.cms",
            "description": "The bank is in the process of applying for availing certified true copy of the NCLT Order and completion of requisite statutory/ regulatory formalities, in order to make the scheme effective, according to a release.",
            "pubDate": "2024-09-26T05:50:23.002687"
        },
        {
            "title": "Can multibaggers KFin Tech & CAMS ride on MF tailwinds or will valuations play spoilsport?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-multibaggers-kfin-tech-cams-ride-on-mf-tailwinds-or-will-valuations-play-spoilsport/articleshow/113688368.cms",
            "description": "KFin Technologies and CAMS are well-positioned in the mutual fund industry despite their high valuations. With significant stock rallies over the past year, both companies benefit from a duopolistic market with high entry barriers. Analysts predict potential upsides of up to 26% for KFin Tech and 42% for CAMS.",
            "pubDate": "2024-09-26T05:50:23.002789"
        },
        {
            "title": "After doubling in 6 months, Trent shares rally another 4%. Here are 2 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-doubling-in-6-months-trent-shares-rally-another-4-here-are-2-reasons-why/articleshow/113688282.cms",
            "description": "The global brokerage firm in its note stated that Trent is outpacing its peers, which is driving the Street upgrades as the company adds organic growth engines.",
            "pubDate": "2024-09-26T05:50:23.002883"
        },
        {
            "title": "F&O Radar: Deploy Bull Call Spread in Nifty to make potential gains from bullish momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-make-potential-gains-from-bullish-momentum/articleshow/113688146.cms",
            "description": "Nifty closed positively after consolidation, supported at 25,800 with a target of 26,200. Options data suggests a bullish trend; consider a Bull Call Spread for potential gains.",
            "pubDate": "2024-09-26T05:50:23.002975"
        },
        {
            "title": "High Return on Capital Employed : 7 stocks with over 50% RoCE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-return-on-capital-employed-7-stocks-with-over-50-roce/slideshow/113687215.cms",
            "description": "",
            "pubDate": "2024-09-26T05:50:23.003066"
        },
        {
            "title": "Stock Radar: Escorts Kubota breaks out of a falling trendline; could hit fresh record highs above Rs 4,900",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-escorts-kubota-breaks-out-of-a-falling-trendline-could-hit-fresh-record-highs-above-rs-4900/articleshow/113664723.cms",
            "description": "Escorts Kubota Ltd has broken out from a falling trendline resistance on the weekly charts, indicating potential for the stock to reach Rs 4,900 levels in the next 3-4 months. The stock has shown strong momentum and is trading above crucial moving averages, suggesting further upside potential.",
            "pubDate": "2024-09-26T05:50:23.003204"
        },
        {
            "title": "Trent among 7 stocks on which brokerages initiated coverage can rally up to 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-among-7-stocks-on-which-brokerages-initiated-coverage-can-rally-up-to-27/slideshow/113686845.cms",
            "description": "Several global and domestic brokerage firms have initiated coverage on various stocks, expressing bullish sentiment on companies such as Trent, Tata Power, Power Grid, and JSW Energy, with a potential upside of up to 27%. Here’s a list of seven stocks on which brokerages have initiated coverage:",
            "pubDate": "2024-09-26T05:50:23.003310"
        },
        {
            "title": "Sensex up 850 times in 45 years! Will it hit the 1,00,000 milestone in FY25?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-850-times-in-45-years-will-it-hit-the-100000-milestone-in-fy25/articleshow/113686550.cms",
            "description": "Sensex has grown 850 times in 45 years, with an average CAGR of 16%. Now nearing the 1 lakh mark, it may achieve this milestone by FY25. Experts believe strong liquidity and FII flows could drive this growth, though risks from declining inflows exist.",
            "pubDate": "2024-09-26T05:50:23.003414"
        },
        {
            "title": "Sensex rises above 85,300 for the first time, Nifty hits fresh peak; IT, bank stocks shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-above-85300-for-the-first-time-nifty-hits-fresh-peak-it-bank-stocks-shine/articleshow/113686119.cms",
            "description": "Sensex and Nifty opened at record highs for the sixth session, fueled by IT and auto stock gains and optimism over foreign inflows.",
            "pubDate": "2024-09-26T05:50:23.003507"
        },
        {
            "title": "Saregama India and 3 other stocks closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saregama-india-and-3-other-stocks-closed-above-vwap/slideshow/113686377.cms",
            "description": "",
            "pubDate": "2024-09-26T05:50:23.003594"
        },
        {
            "title": "At multi-year highs: These 11 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-11-stocks-witness-5-year-swing-high-breakout/slideshow/113686098.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 10,000 crore, we have collated a list of five stocks that witnessed a 5-year swing high at the close on September 25, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2024-09-26T05:50:23.003684"
        },
        {
            "title": "Hot Stocks: Brokerages on Trent, Hero MotoCorp, HDFC Bank and M&M Finance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerages-on-trent-hero-motocorp-hdfc-bank-and-mm-finance/articleshow/113685757.cms",
            "description": "Citi has initiated coverage on Trent with a buy rating and a target price of Rs 9,250. The company is outperforming its peers, leading to upgrades from analysts as it adds new organic growth engines. Citi projects impressive revenue, EBITDA, and PAT CAGRs of 41%, 44%, and 56%, respectively, for FY24-27. Trent is effectively leveraging its supply chain and insights from its Westside and Zudio brands. Recognized as a standout performer, Trent has significant potential to scale up its pilot projects.",
            "pubDate": "2024-09-26T05:50:23.003780"
        },
        {
            "title": "Golden Crossovers: These 3 stocks signal further bullishness on September 26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/golden-crossovers-these-3-stocks-signal-further-bullishness-on-september-26/slideshow/113685577.cms",
            "description": "In the NSE list of stocks, three stocks with a market cap of over Rs 1000 crore have been witnessing Golden Crossovers, according to stockedge.com's technical scan data.Golden Cross is an important technical indicator of bullishness. It occurs when the short-term moving average crosses over the major long-term moving average on the upside. These stocks' 50-day simple moving averages (SMA) crossed their 200-day SMAs on September 25.",
            "pubDate": "2024-09-26T05:50:23.003882"
        }
    ]
}