{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-20T13:58:17.015068",
    "items": [
        {
            "title": "US stocks open higher with Trump's Middle East decision in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-with-trumps-middle-east-decision-in-focus/articleshow/121977372.cms",
            "description": "Wall Street's main indexes opened higher on Friday, tracking strength in global stocks after President Donald Trump held off from making an immediate call on U.S. involvement in the Israel-Iran war.",
            "pubDate": "2025-06-20T13:57:56.133120"
        },
        {
            "title": "Nithin Kamath: Why the broking business isn’t as glamorous as it seems",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nithin-kamath-why-the-broking-business-isnt-as-glamorous-as-it-seems/articleshow/121976709.cms",
            "description": "Zerodha co-founder Nithin Kamath highlighted major risks in India’s broking business, including heavy revenue reliance on Nifty and Sensex F&O contracts, limited diversification, and mounting regulatory pressure, questioning the industry's perceived glamour.",
            "pubDate": "2025-06-20T13:57:56.133242"
        },
        {
            "title": "These 6 stocks hit 52-week highs, rally up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-stocks-hit-52-week-highs-rally-up-to-25-in-a-month/slideshow/121976493.cms",
            "description": "",
            "pubDate": "2025-06-20T13:57:56.133350"
        },
        {
            "title": "BSE introduces AI tool to speed up SME IPO document checks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-introduces-ai-tool-to-speed-up-sme-ipo-document-checks/articleshow/121976663.cms",
            "description": "To enhance the SME listing process, BSE has rolled out an AI-powered tool that pre-screens draft IPO documents. The system helps merchant bankers identify compliance gaps early, significantly reducing review time. While not a replacement for BSE’s final check, it improves efficiency and accuracy in the IPO filing workflow.",
            "pubDate": "2025-06-20T13:57:56.133454"
        },
        {
            "title": "Sebi proposes 5-point AI rulebook for securities market. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-5-point-ai-rulebook-for-securities-market-check-details/articleshow/121976254.cms",
            "description": "Sebi has released a consultation paper proposing a 5-point regulatory framework for the responsible use of AI and ML in India’s securities markets. The guidelines focus on governance, transparency, fairness, data security, and risk controls, aiming to balance innovation with investor protection.",
            "pubDate": "2025-06-20T13:57:56.133552"
        },
        {
            "title": "Sun TV shares tumble over 5% in intra-day trade amid concerns over rift between Maran brothers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-tv-shares-tumble-over-5-in-intra-day-trade-amid-concerns-over-rift-between-maran-brothers/articleshow/121976130.cms",
            "description": "Shares of Sun TV Network tumbled over 5 per cent in intra-day trade on Friday before recovering most of the lost ground to end 1 per cent lower amid concerns over a rift between brothers Dayanidhi and Kalanithi Maran.",
            "pubDate": "2025-06-20T13:57:56.133651"
        },
        {
            "title": "HSBC starts coverage on Trent with buy, sees 19% upside on Zudio growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-starts-coverage-on-trent-with-buy-sees-19-upside-on-zudio-growth/articleshow/121976042.cms",
            "description": "HSBC Global Research initiated coverage on Trent Ltd with a 'buy' rating and ₹6,700 target, citing Zudio’s strong growth, robust execution, and a premium retail portfolio. The brokerage forecasts a 25% revenue CAGR over FY25–28 and values Trent on a SOTP basis.",
            "pubDate": "2025-06-20T13:57:56.133746"
        },
        {
            "title": "Gainers & Losers: HDFC Bank, Trent among 6 stocks that moved most on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-hdfc-bank-trent-among-6-stocks-that-moved-most-on-friday/slideshow/121975169.cms",
            "description": "",
            "pubDate": "2025-06-20T13:57:56.133836"
        },
        {
            "title": "Stock Radar: This BSE Sensex stock from IT space is now looking attractive after breaking out from ascending triangle pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-this-bse-sensex-stock-from-it-space-is-now-looking-attractive-after-breaking-out-from-ascending-triangle-pattern-time-to-buy/articleshow/121957498.cms",
            "description": "IT giant Infosys Ltd has broken out from an Ascending Triangle pattern, signalling potential upward movement. Experts suggest buying the stock with a target of Rs 1,770 in the next 7-8 weeks. Technical indicators like RSI and MACD support this bullish outlook, with analysts recommending a stop loss below Rs 1,560.",
            "pubDate": "2025-06-20T13:57:56.133952"
        },
        {
            "title": "Hyundai Motor, Bharti Airtel among 5 Nifty500 stocks that touch 52-week highs on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-bharti-airtel-among-5-nifty500-stocks-that-touch-52-week-highs-on-friday/slideshow/121974402.cms",
            "description": "Indian equity benchmarks edged higher on Friday, led by gains in financial stocks after the RBI relaxed project financing rules. However, escalating tensions in the Middle East capped broader market gains.Amid mixed sentiment, five stocks from the Nifty500 index touched fresh 52-week highs. Here’s a snapshot of the top performers:Despite the broader market weakness, five stocks from the Nifty500 index touched fresh 52-week highs. Here's a snapshot:",
            "pubDate": "2025-06-20T13:57:56.134047"
        },
        {
            "title": "HDB Financial IPO shocker: Price band 42% below unlisted market value",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdb-financial-ipo-shocker-price-band-42-below-unlisted-market-value/articleshow/121972790.cms",
            "description": "HDB Financial set its IPO price band at ₹700–740, a sharp 42% discount to its grey market valuation. This reflects a broader trend of conservative IPO pricing despite soaring unlisted market interest in firms like NSE and Tata Capital.",
            "pubDate": "2025-06-20T13:57:56.134138"
        },
        {
            "title": "These 6 stocks turned multibaggers in 2025 so far. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-stocks-turned-multibaggers-in-2025-so-far-do-you-own-any/slideshow/121972908.cms",
            "description": "So far in the calendar year 2025, the benchmark Sensex has risen by around 4%, reflecting steady but limited market-wide growth. However, several individual stocks have significantly outperformed, delivering multibagger returns to their investors during the same period.To focus on relatively larger and more stable companies, we filtered for stocks with a market capitalisation of over Rs 2,500 crore. Using this criterion, we identified six stocks that have more than doubled in share price (100 %+ gains) in 2025 so far. Interestingly, three of these six top-performing stocks belong to the chemical sector, highlighting a strong trend in that space. (Data Source: ACE Equity)",
            "pubDate": "2025-06-20T13:57:56.134227"
        },
        {
            "title": "Gold price prediction: Meltdown as prices fall by Rs 900/10 gram amid profit booking. Can bulls stage a comeback?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-price-prediction-meltdown-as-prices-fall-by-rs-600/10-gram-amid-profit-booking-can-bulls-stage-a-comeback/articleshow/121972291.cms",
            "description": "Gold prices fell on Friday as the dollar strengthened amid US Fed’s hawkish stance and cooling geopolitical tensions between Israel and Iran. Profit-booking also weighed on sentiment, with gold dropping on both MCX and COMEX. The movement in gold rates are inversely related to the dollar movement.  DXY is hovering around 99 against a basket of six major currencies and has appreciated by 0.5% over the the five sessions.",
            "pubDate": "2025-06-20T13:57:56.134316"
        },
        {
            "title": "Oswal Pumps shares rise 3% post listing below GMP; brokerages recommend holding for long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oswal-pumps-shares-rise-3-post-listing-below-gmp-brokerages-recommend-holding-for-long-term/articleshow/121971434.cms",
            "description": "Oswal Pumps made a muted market debut, listing at Rs 632 on the BSE—below grey market expectations of Rs 655—despite broader market gains. The stock rose up to Rs 649.15 in early trade. While the listing premium was modest at 2.7–3.3%, brokerages remain bullish on the company’s long-term prospects, citing strong fundamentals and favourable government policies.",
            "pubDate": "2025-06-20T13:57:56.134408"
        },
        {
            "title": "IT stocks up 35% in less than 2 months. Can it withstand Fed caution and geopolitical risk?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-up-35-in-less-than-2-months-can-it-withstand-fed-caution-and-geopolitical-risk/articleshow/121971400.cms",
            "description": "Coforge has surged nearly 35%, with Tech Mahindra and LTIMindtree each rising 28%. Persistent Systems, HCLTech, Oracle Financial Services Software (OFSS), and Mphasis have recorded gains between 16% and 22%. Even large-cap players like Infosys and Wipro have delivered double-digit returns during the same period.",
            "pubDate": "2025-06-20T13:57:56.134499"
        },
        {
            "title": "These 9 smallcaps stocks surged 50-110% in 2025,held by over 10 MF",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-smallcaps-stocks-surged-50-110-in-2025held-by-over-10-mf/slideshow/121971407.cms",
            "description": "So far in the calendar year 2025, the benchmark Sensex has posted a modest gain of around 4%. In contrast, the BSE Smallcap Index has declined by nearly 6%, reflecting broader weakness in smaller stocks. However, within the smallcap space, several individual stocks have performed exceptionally well.In fact, about 16 stocks within the Smallcap Index have surged more than 50% year-to-date. To narrow down this list to fundamentally stronger bets, we applied an additional filter: we considered only those stocks that were held by more than 10 mutual funds as of May 2025. This is based on the rationale that mutual funds typically invest after conducting detailed research, which can offer investors added confidence in the company's fundamentals. After applying these filters, we identified 9 smallcap stocks that have delivered returns of over 50% in 2025 so far and are backed by the portfolios of more than 10 mutual funds as of May 2025.(Data Source: ACE Equity, ACE MF) at the end of summary",
            "pubDate": "2025-06-20T13:57:56.134588"
        }
    ]
}