{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-28T11:10:29.390307",
    "items": [
        {
            "title": "Gainers & Losers: BSE, M&M among top stocks in limelight on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-bse-mampm-among-top-stocks-in-limelight-on-friday/slideshow/119650249.cms",
            "description": "",
            "pubDate": "2025-03-28T11:10:11.456709"
        },
        {
            "title": "Market Wrap: Auto, IT slump weighs on D-Street; Sensex sheds 191 pts, Nifty holds 23,500",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-auto-it-slump-weighs-on-d-street-sensex-sheds-191-pts-nifty-holds-23500/articleshow/119648979.cms",
            "description": "Indian benchmark indices closed lower on Friday, pressured by declines in auto and IT stocks as investor sentiment turned cautious ahead of next week's announcement of U.S. reciprocal tariffs.",
            "pubDate": "2025-03-28T11:10:11.456832"
        },
        {
            "title": "12 stocks that gained over 50% in each of last 3 fiscal years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-12-stocks-turned-multibaggers-over-the-last-3-fiscal-years/slideshow/119648114.cms",
            "description": "In FY25, the benchmark index Sensex rose by 5%, and over the past 3 years, it has surged more than 35%. Similarly, when examining stock performances, several stocks emerged as multibaggers in FY25. A closer examination shows that 12 of these stocks have generated returns of 50-150% in each of the last three consecutive fiscal years, resulting in a 5 to 30 times growth in investors' wealth over the past 3 years. We selected only stocks with a market capitalization of over Rs 10,000 crore. (Data Source: ACE Equity)",
            "pubDate": "2025-03-28T11:10:11.456939"
        },
        {
            "title": "Bitcoin, Gold, or Silver? Why Robert Kiyosaki thinks saving in cash is a bad idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bitcoin-gold-or-silver-why-robert-kiyosaki-thinks-saving-in-cash-is-a-bad-idea/articleshow/119646640.cms",
            "description": "Robert Kiyosaki calls fiat currency \"fake money\" due to inflation and advises investing in gold, silver, and Bitcoin. He believes silver is the best short-term investment, while Bitcoin is a long-term hedge against inflation.",
            "pubDate": "2025-03-28T11:10:11.457035"
        },
        {
            "title": "Stocks to Buy | Global Market Strategies: Punita Kumar Sinha on where to invest next?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-global-market-strategies-punita-kumar-sinha-on-where-to-invest-next/slideshow/119647173.cms",
            "description": "Market expert Punita Kumar Sinha in an interview with ET Now said that while markets are experiencing a rally, uncertainties still loom. The global economy faces risks due to tariffs and geopolitical tensions. Although markets were oversold, leading to a recent rally, another market correction could be on the horizon.",
            "pubDate": "2025-03-28T11:10:11.457135"
        },
        {
            "title": "Good news for RIL investors as Goldman Sachs sees earnings rebound in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/good-news-for-ril-investors-as-goldman-sachs-sees-earnings-rebound-in-fy26/articleshow/119646348.cms",
            "description": "RIL experienced three consecutive quarters of profit decline before rebounding with a 7% increase in the most recent third quarter. The recent muted earnings were attributed to a drop in the operating performance of its core oil-to-chemicals (O2C) business, along with weakness in the downstream chemicals sectors.",
            "pubDate": "2025-03-28T11:10:11.457234"
        },
        {
            "title": "Investing Beyond Borders: Why US markets are a smart bet for Indian Investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investing-beyond-borders-why-us-markets-are-a-smart-bet-for-indian-investors/articleshow/119643920.cms",
            "description": "The U.S. stock market offers Indian investors opportunities for diversification, global exposure, and strong returns. With significant growth in sectors like AI, technology, and semiconductors, U.S. equities complement India's market. Currency appreciation and rising accessibility through fintech platforms make investing in U.S. stocks increasingly attractive. However, investors should consider factors like taxation, platform choice, and long-term strategy.",
            "pubDate": "2025-03-28T11:10:11.457326"
        },
        {
            "title": "European shares fall at the end of week, dominated by tariff woes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-fall-at-the-end-of-week-dominated-by-tariff-woes/articleshow/119643664.cms",
            "description": "European shares dropped on Friday, at the end of a week marred by concerns over the global economic fallout of an intensifying trade war waged by U.S. President Donald Trump.",
            "pubDate": "2025-03-28T11:10:11.457418"
        },
        {
            "title": "Reciprocal tariffs on April 2: With billions at stake, can Indian stocks with stand the biggest macro shock this year?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reciprocal-tariffs-on-april-2-with-billions-at-stake-can-indian-stocks-with-stand-the-biggest-macro-shock-this-year/articleshow/119642574.cms",
            "description": "April 2 marks a crucial day as U.S. President Trump plans to announce reciprocal tariffs, escalating the trade war. This move could significantly impact Indian markets, raising questions about whether the markets have priced in the effect. The tariffs aim to rebalance trade with countries holding surpluses with the U.S., and the finer details of this strategy remain to be seen.",
            "pubDate": "2025-03-28T11:10:11.457510"
        },
        {
            "title": "Japan's Nikkei ends at 2-week low as automakers slump on US tariff worries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-2-week-low-as-automakers-slump-on-us-tariff-worries/articleshow/119641807.cms",
            "description": "Japan's Nikkei average ended at a two-week low on Friday in a broad selloff, with automakers leading the losses, as concerns over the potential impact of U.S. President Donald Trump's trade tariffs weighed.",
            "pubDate": "2025-03-28T11:10:11.457622"
        },
        {
            "title": "Stocks to Buy | Opportunities & Risks: Sandip Sabharwal on key market trends for April",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-opportunities-risks-sandip-sabharwal-on-key-market-trends-for-april/slideshow/119641511.cms",
            "description": "Market expert Sandip Sabharwal in an interview to ET Now said that markets rebounded strongly in March. Concerns about further declines faded as sentiment improved, closing the month on a high note. Investors are now looking ahead to further gains.",
            "pubDate": "2025-03-28T11:10:11.457722"
        },
        {
            "title": "RIL, DLF among Chris Wood’s top bets as he tweaks portfolio. Check what changed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-dlf-among-chris-woods-top-bets-as-he-tweaks-portfolio-check-what-changed/articleshow/119640007.cms",
            "description": "As reported by CNBC-TV18, citing Wood's latest GREED & Fear note, the strategist has increased the weightage of Reliance Industries by 2 percentage points in his India long-only portfolio.",
            "pubDate": "2025-03-28T11:10:11.457816"
        },
        {
            "title": "Specialty chemicals: Stick to few as a mix of head and tailwinds emerges. 5 stocks with upside potential of up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/specialty-chemicals-stick-to-few-as-a-mix-of-head-and-tailwinds-emerges-5-stocks-with-upside-potential-of-up-to-40/articleshow/119639436.cms",
            "description": "As the tariff war gets hotter, a good bit of the heat will be generated in the specialty chemicals space. Why? Because, chemical supply chains are very rigid by nature. To put this in perspective: If a product uses a certain chemical as raw material, and if there is a sudden shortage of that chemical, can it be replaced by another one? The answer is no. For the user, there is no option but to buy that chemical at a higher cost. Now, the reverse scenario. Suppose there is sudden overproduction of the chemical, will the user buy more because it is cheaper? The answer is again no. So, as tariffs cause disruption in the chemicals sector, we will see a mix of head and tailwinds.",
            "pubDate": "2025-03-28T11:10:11.457912"
        },
        {
            "title": "Auto, pharma stocks extend rout as Trump’s tariff plan spooks investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-pharma-stocks-extend-rout-as-trumps-tariff-plan-spooks-investors/articleshow/119639040.cms",
            "description": "Indian auto and pharma stocks fell on Friday amid fears of a 25% U.S. tariff on auto imports. The Nifty Auto and Pharma indices dropped by 0.8% and 0.9%, respectively. However, experts suggest the market's resilience is supported by foreign institutional investors' buying. Broader Indian markets remain strong despite the sector-specific declines, with strong FPI inflows.",
            "pubDate": "2025-03-28T11:10:11.458005"
        },
        {
            "title": "Tata Elxsi, IREDA among 5 stocks with long unwinding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-elxsi-ireda-among-5-stocks-with-long-unwinding/slideshow/119638494.cms",
            "description": "Long unwinding refers to the selling of positions or stocks owned for a longer period either to book profit or to exit it in anticipation of impending bearishness. In Friday's trading session, five stocks witnessed a long unwinding. Here's the list:",
            "pubDate": "2025-03-28T11:10:11.458094"
        },
        {
            "title": "Stock market holiday March 31, 2025: Will NSE, BSE be open or closed on Eid al-Fitr 2025?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-march-31-2025-will-nse-bse-be-open-or-closed-on-eid-al-fitr-2025/articleshow/119636137.cms",
            "description": "NSE Holidays 2025: Indian stock markets will remain closed for 14 days in 2025 due to festivals and other events. In April, trading will be halted for three days in observance of Mahavir Jayanti (April 10), Ambedkar Jayanti (April 14), and Good Friday (April 18).",
            "pubDate": "2025-03-28T11:10:11.458187"
        }
    ]
}