{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-31T09:03:20.042563",
    "items": [
        {
            "title": "Stock Market Holiday: Are NSE, BSE and MCX open for trading on Sunday for Budget 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-are-nse-bse-and-mcx-open-for-trading-on-sunday-for-budget-2026/articleshow/127813944.cms",
            "description": "Indian stock markets NSE and BSE, along with MCX and NCDEX, will remain open on Sunday, February 1, for Budget 2026. Investors can trade during live sessions as the Finance Minister presents the Budget, enabling real-time market reaction amid cautious sentiment and muted expectations.",
            "pubDate": "2026-01-31T04:42:42.156893"
        },
        {
            "title": "A 'non-event Budget' for stock market: Is that good news for Nifty which fell 1,000 points in January?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-non-event-budget-for-stock-market-is-that-good-news-for-nifty-which-fell-1000-points-in-january/articleshow/127813905.cms",
            "description": "As Budget 2026 approaches, analysts expect a low-impact event for equities amid muted expectations. With Nifty already down sharply in January, a non-event Budget may help stabilise sentiment rather than trigger volatility in a cautious, range-bound market.",
            "pubDate": "2026-01-31T04:42:42.157015"
        },
        {
            "title": "European shares cap strong January with earnings-fuelled gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-cap-strong-january-with-earnings-fuelled-gains/articleshow/127813797.cms",
            "description": "European stocks closed higher on Friday, extending a winning streak to seven months. Investors reacted to corporate earnings and news of a US presidential nominee for the Federal Reserve. Banks led gains, with Spanish lender Caixabank seeing a significant rise. Swiss watchmaker Swatch and German sportswear maker Adidas also reported positive results. However, some companies faced weaker-than-expected earnings.",
            "pubDate": "2026-01-31T04:42:42.157215"
        },
        {
            "title": "D-Street enagages in Budget safety, but could go higher in near term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-enagages-in-budget-safety-but-could-go-higher-in-near-term/articleshow/127813696.cms",
            "description": "The Indian stock markets faced a downturn on Friday, ending January with a notable 3.1% decline—the sharpest drop seen in January since 2016. Analysts suggest that investors are holding back in anticipation of the upcoming budget. Still, there's a silver lining on the horizon, with expectations of a gradual market recovery soon.",
            "pubDate": "2026-01-31T04:42:42.157318"
        },
        {
            "title": "Concurrent Gainers: 9 smallcaps log gains for 5 straight sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-9-smallcaps-log-gains-for-5-straight-sessions/slideshow/127814301.cms",
            "description": "Over the five trading sessions that ended January 30, the Sensex remained largely flat, slipping 0.05% or 38 points to close at 82,270. The benchmark ended higher in three of the five sessions between January 23 and 30.Despite the subdued market, nine stocks from the BSE Smallcap index advanced in all five sessions, clocking cumulative gains of up to 23% during the period. (Data source: ACE Equity)",
            "pubDate": "2026-01-31T05:26:35.585149"
        },
        {
            "title": "Defence stocks deliver up to 68% returns ahead since last Budget; 4 picks to watch in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-deliver-up-to-68-returns-ahead-of-budget-2026-4-picks-to-watch/articleshow/127814011.cms",
            "description": "Defence stocks are showing resilience ahead of the Union Budget 2026, with many Nifty India Defence index constituents outperforming the broader market. Investors anticipate key announcements that could further boost the sector, with specific stock performance expected to hinge on Finance Minister Nirmala Sitharaman's proposals.",
            "pubDate": "2026-01-31T05:26:35.585279"
        },
        {
            "title": "What would make this a ‘full-marks’ Budget for the capital markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-would-make-this-a-full-marks-budget-for-the-capital-markets/articleshow/127814724.cms",
            "description": "The upcoming Budget must focus not just on attracting capital but improving how efficiently it circulates through the economy. Faster corporate restructurings, stronger recovery mechanisms, better mobilisation of household gold and simpler capital-gains rules can meaningfully enhance market depth, investor confidence and long-term capital formation, earning the Budget full marks from markets.",
            "pubDate": "2026-01-31T05:57:51.289746"
        },
        {
            "title": "Gold plunges 12% in biggest single-day selloff. Key levels to watch on Budget Day 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-plunges-12-in-biggest-single-day-selloff-key-levels-to-watch-on-budget-day-2026/articleshow/127814942.cms",
            "description": "Gold prices slumped 12% in their worst single-day fall in over a decade after a stronger US dollar triggered profit booking. The sharp correction followed record highs and renewed macro re-pricing. With MCX open on Budget Day, investors will closely track key support levels and volatility cues.",
            "pubDate": "2026-01-31T07:06:26.606594"
        },
        {
            "title": "Madhusudan Kela’s portfolio sees 9 Stocks slide 15–45% in 7 months; adds One New Q3 Bet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/madhusudan-kelas-portfolio-sees-9-stocks-slide-1545-in-7-months-adds-one-new-q3-bet/slideshow/127816021.cms",
            "description": "Investors often track the holdings of prominent Dalal Street players, and ETMarkets has analysed the portfolio of renowned investor Madhusudan Kela. As per the latest disclosures for the December 2025 quarter, Kela held stakes in 15 stocks. By January 30, the estimated value of his portfolio stood at around Rs 2,219 crore, down nearly 45% from Rs 4,072 crore in June 2025.This analysis considers only companies where Kela’s shareholding exceeds 1% and may not reflect its complete investment universe.A closer look shows that 10 of the 15 stocks delivered negative returns between July 2025 and January 2026. Nine of these fell 15–45%, while two stocks posted gains despite market volatility. The portfolio also saw one new addition in the December quarter, with Kela holding a 1.12% stake. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2026-01-31T07:39:05.330860"
        },
        {
            "title": "Don’t rush to grade D-Street on Budget day, wait a bit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dont-rush-to-grade-d-st-on-b-day-wait-a-bit/articleshow/127814896.cms",
            "description": "Benchmark indices and broader markets have historically shown subdued performance on Union Budget day, with less than 1% movement. However, a week after the event, both Nifty and Sensex have shown stronger gains. Three months post-budget, while the Nifty experienced significant swings, it generally trended upwards, with the exception of a notable fall in 2020.",
            "pubDate": "2026-01-31T07:39:05.331061"
        },
        {
            "title": "Can Budget bring durable relief to stock market sentiments?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-budget-bring-durable-relief-to-stock-market-sentiments/articleshow/127816064.cms",
            "description": "Budget 2026 arrives amid weak market sentiment, thin participation, and geopolitical pressures. With fiscal constraints and limited scope for major tax changes, the focus is expected on structural reforms like power sector and IBC revamps. While these could support long-term equities, short-term market revival may remain muted.",
            "pubDate": "2026-01-31T09:03:19.426139"
        }
    ]
}