{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-28T11:12:35.739897",
    "items": [
        {
            "title": "Q3 results today: Maruti, L&T, GRSE and Pine Labs among 126 BSE-listed companies to announce earnings today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-maruti-lt-grse-and-pine-labs-among-126-bse-listed-companies-to-announce-earnings-today/articleshow/127669347.cms",
            "description": "A busy Wednesday for the stock market features earnings from 126 BSE-listed companies, including Nifty giants like Maruti Suzuki and L&T. Both are anticipated to report strong December-quarter results, with Maruti Suzuki expecting a 24-35% net profit rise and L&T projecting a 20-35% increase, driven by robust sales and execution.",
            "pubDate": "2026-01-28T04:28:16.489503"
        },
        {
            "title": "One 97 Communications Q3 Preview: Paytm parent may post up to 22% YoY revenue growth. Check PAT, margin expectations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/one-97-communications-q3-preview-paytm-parent-may-post-up-to-22-yoy-revenue-growth-check-pat-margin-expectations/articleshow/127681571.cms",
            "description": "Paytm is expected to post another profitable Q3, driven by festive-led demand in payments and financial services. Brokerages forecast a return to year-on-year profitability, around 6% sequential growth, and continued margin expansion, with revenue seen rising up to 22% YoY to about Rs 2,187–2,225 crore.",
            "pubDate": "2026-01-28T06:23:47.847845"
        },
        {
            "title": "Swiggy Q3 Preview: Losses to widen as Instamart investments weigh; revenue may jump 47% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swiggy-q3-preview-losses-to-widen-as-instamart-investments-weigh-revenue-may-jump-47-yoy/articleshow/127684848.cms",
            "description": "Swiggy is expected to post strong revenue growth of about 47% YoY in Q3FY26, led by steady food delivery demand and a sharp rise in quick commerce. However, continued investments in Instamart, rising competition, and dark store expansion costs are likely to widen losses, with brokerages estimating a Q3 loss in the range of Rs 804–1,045 crore.",
            "pubDate": "2026-01-28T06:57:14.789315"
        },
        {
            "title": "TVS Motor Q3 Results: Cons PAT zooms 49% YoY to Rs 841 crore; revenue jumps 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tvs-motor-q3-results-cons-pat-zooms-49-yoy-to-rs-841-crore-revenue-jumps-34/articleshow/127688092.cms",
            "description": "TVS Motor Q3 Results: TVS Motor Company achieved its highest-ever quarterly sales, revenue, and profits in the December quarter. Consolidated net profit surged 49% year-on-year to Rs 841 crore. Revenue from operations rose 34% to Rs 14,756 crore. Overall two-wheeler and three-wheeler sales grew 27% to a record 15.44 lakh units. Electric vehicle sales also saw a significant increase.",
            "pubDate": "2026-01-28T08:54:52.226423"
        },
        {
            "title": "SBI Life Q3 Results: Profit rises 5% YoY to Rs 577 crore; net premium income jumps 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-life-q3-results-profit-up-5-yoy-to-rs-577-crore-net-premium-income-rises-22/articleshow/127694724.cms",
            "description": "SBI Life Q3 Results: For the nine months ended December 2025, SBI Life retained its leadership position in individual rated premium, clocking Rs 16,680 crore and securing a 25.6% share of the private market.",
            "pubDate": "2026-01-28T09:54:50.237174"
        },
        {
            "title": "ACC Q3 Results: Cons profit plunges 63% YoY to Rs 404 crore, but revenue rises 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/acc-q3-results-cons-profit-falls-63-yoy-to-rs-404-crore-revenue-rises-22/articleshow/127693675.cms",
            "description": "ACC Q3 Results: ACC's net profit saw a significant drop of 63 percent year-on-year for the December quarter. The company posted a profit of Rs 404 crore. However, its revenue from operations showed growth, increasing by 22 percent to Rs 6,391 crore. This performance reflects a mixed financial outcome for the Adani Group firm during the period.",
            "pubDate": "2026-01-28T09:54:50.237302"
        },
        {
            "title": "Maruti Suzuki Q3 Results: Standalone PAT rises 4% YoY to Rs 3,794 crore; revenue jumps 29%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q3-results-standalone-pat-rises-4-yoy-to-rs-3794-crore-revenue-jumps-29/articleshow/127691963.cms",
            "description": "Maruti Suzuki Q3 Results FY26: Maruti Suzuki reported a 4% year-on-year rise in net profit to Rs 3,794 crore for the December quarter, driven by a 29% increase in revenue to Rs 49,891 crore.  However, lower export proceeds and a one-time provision impacted profitability, leading to a smaller-than-expected quarterly profit. The results saw the company's shares recover slightly from their day's low.",
            "pubDate": "2026-01-28T09:54:50.237411"
        },
        {
            "title": "BEL Q3 Results: Net profit rises 21% YoY to Rs 1,580 crore, revenue grows 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bel-q3-results-net-profit-rises-21-yoy-to-rs-1580-crore-revenue-grows-24/articleshow/127691796.cms",
            "description": "State-owned defence electronics major Bharat Electronics Ltd (BEL) announced a strong performance for the December quarter, with consolidated net profit surging 21% year-on-year to Rs 1,580 crore. Revenue from operations also saw a significant jump of 24% YoY, reaching Rs 7,154 crore, indicating robust growth for the company.",
            "pubDate": "2026-01-28T09:54:50.237517"
        },
        {
            "title": "Pine Labs Q3 Results: Co swings to black with cons PAT of Rs 42 crore versus YoY loss; revenue rises 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pine-labs-q3-results-co-swings-to-black-with-cons-pat-of-rs-42-crore-versus-yoy-loss-revenue-rises-24/articleshow/127699419.cms",
            "description": "Pine Labs swung to a consolidated profit of Rs 42 crore in Q3FY26 after a loss last year, driven by 24% revenue growth and strong platform volumes. EBITDA rose 59% YoY, while GTV hit Rs 4.5 lakh crore. Transaction growth stayed robust, though operating cash flow remained negative due to festive-driven working capital needs.",
            "pubDate": "2026-01-28T11:12:35.082022"
        }
    ]
}