{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-22T07:27:19.425760",
    "items": [
        {
            "title": "Simplest yet toughest, ‘just hold’ to create wealth: 10 mid-cap stocks from different sectors with upside potential of up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/simplest-yet-toughest-just-hold-to-create-wealth-10-mid-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-39/articleshow/125499749.cms",
            "description": "Go against what the world is saying. What this means for the market is: Don’t look at the value of your portfolio every evening. It may lead you to either buy or sell at a time when both should be avoided. We are bringing this up now because no one has any control over what President Trump may say or do next. Can anyone predict how China, or for that matter the EU, will react to what Trump does? The answer is no. In fact, the US, China, the EU, and many other parts of the world are going to make sure that noise levels in the global market increase.",
            "pubDate": "2025-11-22T05:43:02.705672"
        },
        {
            "title": "Wild ride on Wall Street as the crypto crash spooks risk complex",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wild-ride-on-wall-street-as-the-crypto-crash-spooks-risk-complex/articleshow/125499303.cms",
            "description": "Markets showed signs of strain this week. Risky trades like crypto and AI stocks saw sharp declines. This sudden sell-off and quick recovery highlighted how fragile the current market cycle has become. Investors are now more cautious, seeking protection against potential downturns. Even strong earnings from companies like Nvidia could not prevent broader market jitters.",
            "pubDate": "2025-11-22T05:43:02.705839"
        },
        {
            "title": "Fundamental stock picks: Radhakishan Damani-owned Dmart, Nestle among 8 stocks that offer up to 23% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fundamental-stock-picks-radhakishan-damani-owned-dmart-nestle-among-8-stocks-that-offer-up-to-23-upside/slideshow/125499462.cms",
            "description": "Investors hunting for fundamental picks may consider these eight stocks recommended by brokerages SBI Securities and Axis Direct. The stocks offer up to 23% upside. Check the stocks and reasons to buy:",
            "pubDate": "2025-11-22T05:43:02.705955"
        },
        {
            "title": "Ashish Dhawan's stock picks struggle: 5 stocks tumble up to 70% in CY25 — Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-dhawans-stock-picks-struggle-5-stocks-tumble-up-to-70-in-cy25-do-you-own-any/slideshow/125499261.cms",
            "description": "Investors in financial markets frequently monitor the portfolios of well-known market participants. In this context, ETMarkets has reviewed the latest investment disclosures of prominent investor Ashish Dhawan. According to the most recent data for the September 2025 quarter, Dhawan has publicly reported holdings in about 13 companies, with a combined value nearing Rs 2,801 crore as of November 21, 2025.These investments represent positions where his stake exceeds 1%. A closer look at these holdings shows that seven stocks delivered negative returns, five of them have declined between 20% and 70% so far in calendar year 2025. The analysis also highlights three stocks that have gained 19–33% during the same period. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-11-22T05:43:02.706059"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/125499023.cms",
            "description": "Global markets face a busy week with key events including the G20 summit, the UK budget announcement, and Alibaba's earnings report. U.S. consumer spending will be under scrutiny with Black Friday sales, while Bitcoin's recent decline and a technical 'death cross' signal potential further losses.",
            "pubDate": "2025-11-22T05:43:02.706180"
        },
        {
            "title": "Black Friday puts focus on consumer spending for rocky markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/black-friday-puts-focus-on-consumer-spending-for-rocky-markets/articleshow/125498997.cms",
            "description": "Investors are closely watching U.S. consumer spending this week, especially Black Friday sales, as the stock market faces a grim November. With limited recent data due to a government shutdown, early holiday shopping signals will be crucial for assessing the economy's health and potential Federal Reserve rate decisions.",
            "pubDate": "2025-11-22T05:43:02.706279"
        },
        {
            "title": "BOJ close to raising rates, board member Masu says -Nikkei",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-close-to-raising-rates-board-member-masu-says-nikkei/articleshow/125498936.cms",
            "description": "The Bank of Japan is signaling a near-term interest rate hike, with a board member suggesting a decision is imminent and won't wait for next year's wage talks. This follows recent comments from the Governor, indicating growing momentum for an increase to address persistent inflation and normalize borrowing costs. The central bank aims to manage economic conditions effectively.",
            "pubDate": "2025-11-22T05:43:02.706372"
        },
        {
            "title": "Bubble Trouble: AI rally shows cracks as investors question risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bubble-trouble-ai-rally-shows-cracks-as-investors-question-risks/articleshow/125498891.cms",
            "description": "Recent stock market swings reveal potential cracks in the artificial intelligence rally. High valuations in AI stocks are causing concern about a speculative bubble. Investors are watching for signs of a pullback. Comparisons are being made to past market manias. Valuations remain elevated, with risks around spending and capacity. Some leaders dismiss bubble fears, while others acknowledge potential impacts.",
            "pubDate": "2025-11-22T05:43:02.706469"
        },
        {
            "title": "Wall Street indexes jump as rate cut bets increase but suffer losses for week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-jump-as-rate-cut-bets-increase-but-suffer-losses-for-week/articleshow/125498121.cms",
            "description": "Indian markets surged Friday as traders anticipated a Federal Reserve interest rate cut next month, boosting sentiment. Despite weekly losses amid tech valuation worries, Nvidia saw a jump on potential China sales. Fed officials offered mixed signals on rate policy, creating market anticipation for the December meeting's outcome.",
            "pubDate": "2025-11-22T05:43:02.706559"
        },
        {
            "title": "Banks fully implement SWIFT messaging norm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-fully-implement-swift-messaging-norm/articleshow/125498092.cms",
            "description": "Indian banks have successfully adopted the new SWIFT ISO 20022 messaging standard. This achievement places them ahead of the global average. The Ministry of Finance and Reserve Bank of India drove this initiative. All Indian banks are now ready for cross-border payments under the new framework. This ensures smooth operations and avoids potential disruptions and penalties.",
            "pubDate": "2025-11-22T05:43:02.706648"
        },
        {
            "title": "Sebi plans overhaul of brokerage, MF rules in December board meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-plans-overhaul-of-brokerage-mf-rules-in-december-board-meeting/articleshow/125498041.cms",
            "description": "The Securities and Exchange Board of India (Sebi) is set to review its mutual fund and stock broker regulations next month. Key proposals include unbundling broking fees and updating stock broker rules, which were framed 30 years ago. Sebi aims to streamline compliance and enhance ease of doing business.",
            "pubDate": "2025-11-22T05:43:02.706770"
        },
        {
            "title": "Sebi looking to include REITs in indices to improve liquidity: Chief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-looking-to-include-reits-in-indices-to-improve-liquidity-chief/articleshow/125497959.cms",
            "description": "The Securities and Exchange Board of India (Sebi) is considering including real estate investment trusts (REITs) in market indices to enhance liquidity and appeal. Sebi is also exploring ways to expand investment options for REITs and infrastructure investment trusts (InvITs), while working to boost investor awareness and participation in these nascent asset classes.",
            "pubDate": "2025-11-22T05:43:02.706898"
        },
        {
            "title": "Valuation jitters in AI stocks drag Indian indices; volatility index spikes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuation-jitters-in-ai-stocks-drag-indian-indices-volatility-index-spikes/articleshow/125497892.cms",
            "description": "Indian stock markets saw a dip on Friday, following global trends. Concerns over technology stock valuations and potential US interest rate hikes impacted investor sentiment. Despite a cautious mood, analysts suggest the Nifty may soon reach new highs. Foreign investors were net sellers, while domestic investors bought shares. The market awaits clarity on the US-India trade deal.",
            "pubDate": "2025-11-22T05:43:02.706998"
        },
        {
            "title": "Big tech's AI-fuelled debt binge raises risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-techs-ai-fuelled-debt-binge-raises-risks/articleshow/125497799.cms",
            "description": "Big Tech firms are borrowing heavily to fund AI infrastructure. This shift from using cash reserves worries investors. The trend signals a new, riskier phase for AI. Companies with weaker finances are now involved. Interconnected deals create systemic risk. Valuations for major tech firms are also declining due to this unease.",
            "pubDate": "2025-11-22T05:43:02.707086"
        },
        {
            "title": "FII selling moderates to Rs 3,788 crore in Nov so far, 2025 outflows at Rs 1.43 lakh cr. These 3 trends to suggest reversal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-selling-moderates-to-rs-3788-crore-in-nov-so-far-2025-outflows-at-rs-1-43-lakh-cr-these-3-trends-to-suggest-reversal/articleshow/125501097.cms",
            "description": "Foreign investors continue to sell Indian shares.  November saw outflows of Rs 3,788 crore.  This follows significant selling throughout 2025.  Experts note improved sentiment but tentative flows.  Valuations and earnings clarity are key concerns.  Investors await earnings growth to catch up before increasing exposure.  Year-end portfolio rebalancing will offer clues.",
            "pubDate": "2025-11-22T07:27:18.060975"
        },
        {
            "title": "Concurrent Losers: 14 midcap stocks decline for 5 consecutive sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-losers-14-midcap-stocks-decline-for-5-consecutive-sessions/slideshow/125500636.cms",
            "description": "Over the last five trading sessions ending on November 21, the Sensex benchmark index gained 0.80%, settling at 85,232. However, the index registered losses in two of the five sessions. During this period, 14 stocks from the BSE Midcap index fell in all five consecutive sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-11-22T07:27:18.061110"
        }
    ]
}