{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-13T03:05:29.181527",
    "items": [
        {
            "title": "Wall Street ends lower; fears of AI bubble and inflation send investors away",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-fears-of-ai-bubble-and-inflation-send-investors-away/articleshow/125943209.cms",
            "description": "Technology stocks led a broad market decline on Friday, with the S&P 500 and Nasdaq falling over 1%. Concerns over an AI bubble, fueled by Broadcom and Oracle's warnings, coupled with rising Treasury yields, pressured investors. Anticipation of key labor and inflation data also contributed to market caution.",
            "pubDate": "2025-12-13T03:05:22.148686"
        },
        {
            "title": "Nifty could reach 30,000 levels by 2026; Bajaj Finserv, IOC, LTIMindtree among top picks: ICICI Direct",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-could-reach-30000-levels-by-2026-bajaj-finserv-ioc-ltimindtree-among-top-picks-icici-direct/articleshow/125943117.cms",
            "description": "ICICI Direct forecasts the Nifty reaching 30,000 by 2026.  The brokerage suggests investing in Bajaj Finserv, Indian Oil Corporation, LTIMindtree, Pidilite Industries, SRF, Can Fin Homes, and Jamna Auto Industries.  BFSI and Consumption sectors are expected to lead growth.  The Bank Nifty is also projected for significant gains.  Current market breadth indicates a potential for broad-based opportunities next year.",
            "pubDate": "2025-12-13T03:05:22.148798"
        },
        {
            "title": "Fed cut boosts D-Street even as rupee, trade worries persist",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-cut-boosts-d-street-even-as-rupee-trade-worries-persist/articleshow/125943062.cms",
            "description": "Indian stock markets saw a modest rise on Friday. The Nifty and Sensex closed higher, gaining about half a per cent. This uptick followed a US interest rate cut. However, uncertainty surrounding a US-India trade deal and a weaker rupee limited further gains. Investors are awaiting clarity on trade tariffs.",
            "pubDate": "2025-12-13T03:05:22.148885"
        },
        {
            "title": "Sebi mandates 2 new EDs to strengthen MIIs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-mandates-2-new-eds-to-strengthen-miis/articleshow/125943041.cms",
            "description": "Sebi has enhanced governance at Market Infrastructure Institutions by mandating the appointment of two executive directors. One ED will manage critical operations, while the other will oversee regulatory functions, compliance, risk, and investor grievances. Both will join the governing board, with hiring to be done through open advertisements.",
            "pubDate": "2025-12-13T03:05:22.148976"
        },
        {
            "title": "Tata Steel to boost capacity by 50% to maintain market lead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-to-boost-capacity-by-50-to-maintain-market-lead/articleshow/125942989.cms",
            "description": "Tata Steel plans a nearly 50% capacity expansion in India to defend market share and secure raw materials, with most capex expected from internal accruals. This strategic move aims to align new capacities with anticipated demand growth post-FY29, ensuring profitability and maintaining a healthy balance sheet.",
            "pubDate": "2025-12-13T03:05:22.149058"
        },
        {
            "title": "Credit demand climbs to 11.5% as deposits lag, RBI data shows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-demand-climbs-to-11-5-as-deposits-lag-rbi-data-shows/articleshow/125943201.cms",
            "description": "Credit demand is increasing across India. Banks are lending more to retail and service sectors. Industrial credit is also firming up. Deposit growth is steady but slower than last year. This trend is expected to continue with a repo rate reduction. Higher disposable income and GST rationalisation are also boosting demand. Rural demand remains robust, and urban demand is recovering.",
            "pubDate": "2025-12-13T03:05:22.149767"
        }
    ]
}