{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-22T11:15:02.976576",
    "items": [
        {
            "title": "Q3 results today: IndiGo, Adani Green among 57 companies to report earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-indigo-adani-green-among-57-companies-to-report-earnings-on-thursday/articleshow/127083634.cms",
            "description": "Many companies will announce their December quarter results today. IndiGo's earnings are expected to be mixed. Revenue is predicted to grow, but profits may fall. This is due to higher costs and lower ticket prices. Other key companies like Adani Green and DLF will also share their financial performance. Investors are watching these announcements closely for market direction.",
            "pubDate": "2026-01-22T02:07:47.631186"
        },
        {
            "title": "UTI AMC's Q3 PAT flat at Rs 138 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/uti-amcs-q3-pat-flat-at-rs-138-crore/articleshow/127074733.cms",
            "description": "UTI Asset Management reported a profit after tax of ₹138 crore for the December 2025 quarter. This figure remained largely stable compared to the previous year. Sequentially, profits saw a significant increase of 29%. Revenue from operations also grew by 24% to ₹517 crore. However, UTI AMC shares experienced a decline of 6.62%.",
            "pubDate": "2026-01-22T02:07:47.631297"
        },
        {
            "title": "FMCG firms seen posting mid-to-double digit Q3 growth as volumes recover",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/fmcg-firms-seen-posting-mid-to-double-digit-q3-growth-as-volumes-recover/articleshow/127073249.cms",
            "description": "FMCG companies anticipate mid-single to low-double-digit revenue growth in the December quarter, fueled by volume increases, easing GST disruptions, and stable pricing. Resilient rural demand and portfolio premiumization are key drivers, with ITC and HUL expected to show healthy improvements. Nestle India is poised for double-digit revenue growth as post-GST normalization continues.",
            "pubDate": "2026-01-22T02:07:47.631389"
        },
        {
            "title": "Adani Energy Solutions Q3 Results: Profit falls 2% YoY to Rs 552 crore, but revenue rises 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-energy-solutions-q3-results/articleshow/127139438.cms",
            "description": "Adani Energy Solutions Q3 Results: Adani Energy Solutions reported a slight dip in net profit but saw a 15% revenue jump, fueled by strong operational performance and higher capital expenditure. Record EBITDA was achieved, driven by transmission and smart metering growth. The company is expanding its transmission project pipeline and smart meter installations, anticipating robust future growth.",
            "pubDate": "2026-01-22T10:28:13.010617"
        },
        {
            "title": "Radico Khaitan Q3 Results: Profit surges 62% YoY on demand for premium liquor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/radico-khaitan-q3-results-profit-surges-62-yoy-on-demand-for-premium-liquor/articleshow/127135193.cms",
            "description": "India's Radico Khaitan reported a jump in quarterly ‍profit on Thursday, aided ​by sustained demand for its pricier liquor, ⁠sending its shares up 4%.",
            "pubDate": "2026-01-22T10:28:13.010735"
        },
        {
            "title": "Zee Ent Q3 Results: Cons profit falls 5% YoY to Rs 155 crore, revenue jumps 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zee-ent-q3-results-cons-profit-falls-5-yoy-to-rs-155-crore-revenue-jumps-15/articleshow/127126080.cms",
            "description": "Zee Entertainment Enterprises (ZEEL) reported a 5% year-on-year decline in its December quarter consolidated net profit, reaching Rs 155 crore. Despite this, the company saw a significant 15% rise in revenue from operations, which stood at Rs 2,149 crore for the quarter.",
            "pubDate": "2026-01-22T10:28:13.010835"
        },
        {
            "title": "Orient Electric Q3 Results: Profit down 4.4% to Rs 26 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/orient-electric-q3-results-profit-down-4-4-to-rs-26-crore/articleshow/127143126.cms",
            "description": "Orient Electric Ltd on Thursday reported a decline of 4.37 per cent at Rs 25.98 crore for the December quarter of FY26.",
            "pubDate": "2026-01-22T11:15:01.331508"
        },
        {
            "title": "InterGlobe Aviation Q3 Results: IndiGo parent's cons PAT plummets 78% YoY to Rs 550 crore, revenue up 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/interglobe-aviation-q3-results-indigo-parents-cons-pat-falls-78-yoy-to-rs-550-crore-revenue-up-6/articleshow/127142781.cms",
            "description": "IndiGo Q3 Results: IndiGo's net profit plummeted 78% year-on-year to Rs 550 crore in the December quarter, despite a 6% rise in revenue to Rs 23,472 crore. Excluding exceptional items, the profit stood at Rs 3,131 crore, with a significant dip in PAT margin to 2.3%.",
            "pubDate": "2026-01-22T11:15:01.331638"
        }
    ]
}