{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-17T02:16:51.611636",
    "items": [
        {
            "title": "Wall Street ends lower as investors turn cautious ahead of Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-as-investors-turn-cautious-ahead-of-fed-rate-decision/articleshow/123933246.cms",
            "description": "Wall Street witnessed a decline in its main stock indexes on Tuesday. This happened amid anticipation of a possible interest rate cut by the Federal Reserve. Investors are expecting a 25 basis-point cut. Retail sales data showed an increase in August. Webtoon Entertainment saw a surge after a deal with Disney.",
            "pubDate": "2025-09-17T02:16:39.365285"
        },
        {
            "title": "Religare Broking: Aurobindo Pharma poised for next leg of rally after consolidation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/religare-broking-aurobindo-pharma-poised-for-next-leg-of-rally-after-consolidation/videoshow/123920768.cms",
            "description": "“We are seeing a mixed trend within the pharma space, and Auropharma is currently sitting on the sidelines while hovering in a consolidation base. Traders can buy for a target of Rs 1300 in the next 1-2 months,” Ajit Mishra – SVP, Research, Religare Broking Ltd, said.",
            "pubDate": "2025-09-17T02:16:39.365417"
        },
        {
            "title": "Asian stocks slip as investors await Fed decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-slip-as-investors-await-fed-decision/articleshow/123933029.cms",
            "description": "Asian stock markets saw a slight dip as investors are cautious. Everyone is waiting for the United States Federal Reserve's interest-rate decision. Shares in Japan and South Korea decreased. Gold prices are holding steady. Attention is also on a Japanese government bond auction. Investors are keen to understand the future direction of interest rates.",
            "pubDate": "2025-09-17T02:16:39.365627"
        },
        {
            "title": "Stocks in news: Apollo Tyres, Akzo Nobel, Dr Reddy's, Mahindra Lifespace, Coal India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-apollo-tyres-akzo-nobel-dr-reddys-mahindra-lifespace-coal-india/articleshow/123933003.cms",
            "description": "Indian markets saw gains, with Apollo Tyres becoming the Indian cricket team's jersey sponsor. JSW Paints will acquire a stake in Akzo Nobel India, while Dr. Reddy's launched a new molecule for gastrointestinal issues. Mahindra Lifespace is set to redevelop housing societies, and Coal India has been named the preferred bidder for a rare earth element exploration block.",
            "pubDate": "2025-09-17T02:16:39.365728"
        },
        {
            "title": "Hexaware Tech rises on likely US rate cut, weak rupee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hexaware-tech-rises-on-likely-us-rate-cut-weak-rupee/articleshow/123932909.cms",
            "description": "Hexaware Technologies' stock has recently seen gains, driven by a weaker rupee and anticipated US interest rate cuts potentially boosting IT spending. Despite a modest revenue growth in the June quarter due to client spending reductions, the company is improving profitability through increased offshore revenue and employee utilization.",
            "pubDate": "2025-09-17T02:16:39.365827"
        },
        {
            "title": "GIFT Nifty up 55 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123926132.cms",
            "description": "Indian equity markets saw gains on Tuesday. Investors are optimistic before the US Federal Reserve decision. Analysts foresee a gradual market rise. Trade developments and the Fed rate cut are key. Immediate support is at 25,050. India VIX fell. FIIs were net buyers. The Rupee strengthened against the US dollar. FIIs reduced their net short positions in the futures market.",
            "pubDate": "2025-09-17T02:16:39.365930"
        },
        {
            "title": "ESAF SFB plans Rs 300-500 crore capital infusion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/esaf-sfb-plans-rs-300-500-crore-capital-infusion/articleshow/123932894.cms",
            "description": "ESAF Small Finance Bank is set to raise ₹300-500 crore in tier-1 capital, anticipating a business turnaround from the third quarter. The bank aims to bolster its capital adequacy ratio and fund expansion plans. A board meeting is scheduled for September 20 to finalize the fundraising details, including the instrument and modalities.",
            "pubDate": "2025-09-17T02:16:39.366062"
        },
        {
            "title": "Is the rally in small-cap solvent extraction stocks sustainable?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-rally-in-small-cap-solvent-extraction-stocks-sustainable/articleshow/123932839.cms",
            "description": "Small-cap solvent extraction companies have seen significant gains due to high edible oil demand, ethanol blending, and supportive policies. However, analysts now advise caution, noting that valuations may be exceeding fundamentals. Risks like raw material price volatility and supply challenges could lead to corrections, suggesting investors consider booking profits or waiting for better entry points.",
            "pubDate": "2025-09-17T02:16:39.366158"
        },
        {
            "title": "India Inc turns to non-bank routes for nearly half of FY25 funding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-turns-to-non-bank-routes-for-nearly-half-of-fy25-funding/articleshow/123932789.cms",
            "description": "Corporate India is increasingly diversifying its funding sources, with nearly half of the resources raised in FY25 coming from non-banking channels like equity markets and NBFC loans. While the total financial resources to the corporate sector saw a modest increase, bank credit demand declined, influenced by strong equity market performance and cautious lending.",
            "pubDate": "2025-09-17T02:16:39.368168"
        },
        {
            "title": "India's VIX slips to lifetime lows, traders see limited near-term risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-vix-slips-to-lifetime-lows-traders-see-limited-near-term-risks/articleshow/123932747.cms",
            "description": "India's VIX index has plummeted to record lows, indicating reduced market volatility and increased investor confidence ahead of the US Federal Reserve's policy meeting. While this suggests a period of market stability, analysts caution against potential complacency, as low VIX readings can mask underlying risks and unexpected market corrections. Institutional investors are positioning for limited near-term movement.",
            "pubDate": "2025-09-17T02:16:39.368270"
        },
        {
            "title": "Adani to invest Rs 30,000 crore more in ports business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-to-invest-rs-30000-crore-more-in-ports-business/articleshow/123932871.cms",
            "description": "Adani Ports plans a ₹30,000 crore expansion over two years, primarily targeting Mundra, Dhamra, and Vizhinjam ports to achieve a one billion tonne cargo handling target by 2030. The investment spans ports, logistics, renewables, and marine services, with a focus on berth and terminal expansion.",
            "pubDate": "2025-09-17T02:16:39.368461"
        }
    ]
}