{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-06T05:27:33.463543",
    "items": [
        {
            "title": "BEL, Ideaforge shares jump up to 3% as DAC approves projects worth Rs 67,000 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-ideaforge-shares-jump-up-to-3-as-dac-approves-projects-worth-rs-67000-crore/articleshow/123133681.cms",
            "description": "The Defence Acquisition Council (DAC), chaired by Defence Minister Rajnath Singh, has approved proposals for the procurement of indigenous Medium Altitude Long Endurance (MALE) drones, autonomous surface vessels, mountain radars, and upgrades to infantry combat vehicles and air defence systems.",
            "pubDate": "2025-08-06T05:27:15.026228"
        },
        {
            "title": "NCC shares jump nearly 5% despite YoY decline in Q1 PAT, revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncc-shares-jump-nearly-5-despite-yoy-decline-in-q1-pat-revenue/articleshow/123132955.cms",
            "description": "Despite reporting a decline in both profit and revenue for Q1 FY26, NCC Ltd's shares surged due to a robust order book, which grew 33% YoY to Rs 70,087 crore. The company's strong order inflow of Rs 3,658 crore, a significant jump from the previous year, further fueled investor optimism.",
            "pubDate": "2025-08-06T05:27:15.026359"
        },
        {
            "title": "Negative Breakout: 9 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-9-stocks-cross-below-their-200-dmas/slideshow/123133280.cms",
            "description": "In the Nifty500 pack, nine stocks closed below their 200-day moving average (200 DMA) on August 5, according to technical scan data from stockedge.com. Trading below the 200 DMA is generally considered a bearish signal, as it suggests that a stock’s price has fallen below its long-term trend line. The 200 DMA is widely used by traders and analysts to assess the overall trend and momentum of a stock. Here's a look at the stocks:",
            "pubDate": "2025-08-06T05:27:15.026470"
        },
        {
            "title": "NCDEX gets in-principle Sebi nod to launch equities, derivatives; plans Rs 750 crore fundraise: Source",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncdex-gets-in-principle-sebi-nod-to-launch-equities-derivatives-plans-rs-750-crore-fundraise-source/articleshow/123133087.cms",
            "description": "NCDEX has received in-principle approval from Sebi to launch its equity and equity derivatives segment, subject to certain conditions including maintaining robust commodity volumes and IT timelines. The exchange plans to invest ₹750 crore to develop the segment, starting with cash offerings. This move diversifies NCDEX's offerings and positions it against competitors like MSE, leveraging its rural penetration.",
            "pubDate": "2025-08-06T05:27:15.026571"
        },
        {
            "title": "Reliance Power shares down 31% in 1 month. Should you buy the dip or steer clear?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-down-31-in-1-month-should-you-buy-the-dip-or-steer-clear/articleshow/123133023.cms",
            "description": "Reliance Power shares have plummeted 31% in a month amid regulatory scrutiny and Anil Ambani's ED questioning over alleged loan fraud. Technical indicators signal a bearish trend, with the stock trading below key moving averages. Analysts advise caution, suggesting investors avoid new entries and consider exiting existing positions until stability is confirmed, given the ongoing investigations and reputational risks.",
            "pubDate": "2025-08-06T05:27:15.026672"
        },
        {
            "title": "Oil India, Sundaram Finance among 8 stocks that closed above VWAP on Aug 5, 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-india-sundaram-finance-among-8-stocks-that-closed-above-vwap-on-aug-5-2025/slideshow/123132714.cms",
            "description": "On August 4, the closing prices of eight stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price), indicating a potential bullish trend, according to technical scan data from stockedge.com.When the closing price moves above the VWAP, it signifies that the stock closed higher than the average price at which it was traded throughout the day – an average weighted by trading volume. This is often interpreted as a bullish signal by traders and investors, potentially indicating strengthening market sentiment.Nifty500 Stocks Closing Above VWAP (Aug 4):",
            "pubDate": "2025-08-06T05:27:15.026777"
        },
        {
            "title": "Rich investors follow sell-on-rise mantra in Swiggy, 10 other stocks. Are you still buying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rich-investors-follow-sell-on-rise-mantra-in-swiggy-10-other-stocks-are-you-still-buying/articleshow/123132480.cms",
            "description": "Despite market gains, HNIs booked profits in stocks like Swiggy and Waaree Energies, signaling a sell-on-rise strategy. While some analysts remain optimistic, profit booking and portfolio reshuffling may be driving HNI exits. Retail investors should note that even wealthy investors prioritize taking profits when stocks surge.",
            "pubDate": "2025-08-06T05:27:15.026879"
        },
        {
            "title": "NSDL shares list at 10% premium over issue price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsdl-shares-list-at-10-premium-over-issue-price/articleshow/123132304.cms",
            "description": "NSDL shares debuted on the stock exchanges on August 6, achieving a premium over the IPO price of Rs 800. The Rs 4,012 crore IPO witnessed substantial oversubscription, particularly from QIBs. NSDL, a key player in India's dematerialized securities market, reported revenue and profit growth in FY25, attracting long-term investors due to its institutional importance and dividend history.",
            "pubDate": "2025-08-06T05:27:15.026981"
        },
        {
            "title": "Pharma stocks in focus as Trump warns tariffs could hit 250%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-stocks-in-focus-as-trump-warns-tariffs-could-hit-250/articleshow/123132409.cms",
            "description": "Pharma stocks such as Sun Pharma, Cipla, Dr Reddy’s Laboratories, Lupin, and others will be in focus on Wednesday after US President Donald Trump said tariffs on imported pharmaceuticals could rise to as high as 250%. The proposed tariffs would start at a lower rate but escalate over time, he said in a CNBC interview.",
            "pubDate": "2025-08-06T05:27:15.027079"
        },
        {
            "title": "UNO Minda, Schaeffler India among 5 stocks showing RSI Trending Up on August 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uno-minda-schaeffler-india-among-5-stocks-showing-rsi-trending-up-on-august-5/slideshow/123132383.cms",
            "description": "On August 5, five stocks from the NSE midcap pack appeared in the RSI Trending Up scan, based on data from stockedge.com. This scan indicates an uptrend when the Relative Strength Index (RSI) value crosses above 50 from below.\"RSI trending up\" means that the RSI values are increasing, signaling strengthening momentum in a stock's price. This can be interpreted as a potential bullish indicator and is often used by traders to identify possible buying opportunities.",
            "pubDate": "2025-08-06T05:27:15.027196"
        },
        {
            "title": "Sensex falls over 200 pts, Nifty below 24,600 after RBI keeps rates steady amid tariff uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-50-pts-nifty-above-24650-amid-investor-caution-ahead-of-rbi-mpc-rate-decision/articleshow/123132089.cms",
            "description": "Indian benchmark indices experienced a flat trade on Wednesday as the RBI maintained the repo rate at 5.5%. Market sentiment was further dampened by concerns over potential US tariffs on Indian goods, particularly pharmaceuticals, following President Trump's statements. Global markets also showed weakness due to concerns about the impact of tariffs on economic activity.",
            "pubDate": "2025-08-06T05:27:15.027291"
        },
        {
            "title": "Positive Breakout: These 10 stocks close cross above their 200 DMA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-close-cross-above-their-200-dma/slideshow/123132285.cms",
            "description": "In the Nifty500 pack, 10 stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on August 05, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-08-06T05:27:15.027386"
        },
        {
            "title": "At multi-year highs! JK Cement and 6 other stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-jk-cement-and-6-other-stocks-witness-5-year-swing-high-breakouts/slideshow/123132171.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, seven stocks hit a 5-year swing high at the close on August 5, indicating bullish sentiment in these counters, according to technical scan data from stockedge.com.A 5-year swing high represents the highest price a stock has reached within a five-year period. This level often acts as a significant resistance point, where the price has historically struggled to move beyond. Hitting this level may be seen as a bullish signal, suggesting the potential for further upward movement. However, it's important to note that this differs from a 5-year breakout, which occurs when a stock’s price decisively surpasses a resistance level that has held firm for five years or more.",
            "pubDate": "2025-08-06T05:27:15.027480"
        },
        {
            "title": "Gujarat Gas shares in focus on reporting marginal dip in Q1 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-gas-shares-in-focus-on-reporting-marginal-dip-in-q1-pat/articleshow/123132032.cms",
            "description": "Gujarat Gas experienced a slight dip in PAT for Q1 FY26, reporting Rs 327 crore against Rs 330 crore YoY. Despite a revenue decrease to Rs 4,065 crore, EBITDA rose to Rs 579 crore. The company achieved record CNG sales, reaching 3.",
            "pubDate": "2025-08-06T05:27:15.027583"
        },
        {
            "title": "Smallcap stock in focus ahead of bonus issue record date. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stock-in-focus-ahead-of-bonus-issue-record-date-do-you-own/articleshow/123131970.cms",
            "description": "Murae Organisor's shares are in focus as today is the last day to qualify for its 1:10 bonus issue, with a record date set for August 7, 2025. Investors must own shares by today's close due to the T+1 settlement cycle to be eligible for the bonus shares. This corporate action aims to reward shareholders and improve stock liquidity.",
            "pubDate": "2025-08-06T05:27:15.027677"
        },
        {
            "title": "Stocks to buy in 2025 for long term: GMR Power, Epigral among 5 stocks that could give 15-50% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-gmr-power-epigral-among-5-stocks-that-could-give-15-50-return/slideshow/123132017.cms",
            "description": "Brokerages remain bullish on a diverse set of stocks across sectors, highlighting strong growth potential and attractive upside opportunities.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-06T05:27:15.027770"
        }
    ]
}