{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-16T05:58:56.872676",
    "items": [
        {
            "title": "Can domestic formulations shield Indian pharma from US pricing pressure in Q3?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-domestic-formulations-shield-indian-pharma-from-us-pricing-pressure-in-q3/articleshow/126555072.cms",
            "description": "Indian drugmakers anticipate a mixed third quarter. Domestic sales and new specialty drugs will drive growth. US generics will see new product boosts. Contract services and APIs are set for moderate gains. Sun Pharma and Lupin are poised for leadership. Cipla and Dr Reddy's face softer US sales. Divi's Laboratories expects strong custom synthesis growth.",
            "pubDate": "2026-01-16T00:54:14.011661"
        },
        {
            "title": "Q3 results today: RIL, Wipro among 42 companies to report earnings on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-ril-wipro-among-42-companies-to-report-earnings-on-friday/articleshow/126556000.cms",
            "description": "Apart from these, companies such as JSW Infrastructure, Poonawalla Fincorp, Central Bank of India, JB Chemicals, Tata Technologies, Sobha, KPI Green will also report their quarterly numbers",
            "pubDate": "2026-01-16T03:58:06.956638"
        },
        {
            "title": "ICICI Bank Q3 preview: PAT growth seen up to 7.5% YoY, NII likely to rise 6–8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q3-preview-pat-growth-seen-up-to-7-5-yoy-nii-likely-to-rise-68/articleshow/126558278.cms",
            "description": "ICICI Bank is set to announce its Q3FY26 results, with analysts projecting a steady performance. Profit After Tax (PAT) growth is anticipated between 1% and 7% year-on-year, supported by healthy loan growth in retail and SME segments. Net Interest Income (NII) is expected to rise 6-8% YoY, while Net Interest Margins (NIMs) are forecast to remain stable around 4.3%",
            "pubDate": "2026-01-16T05:58:55.342315"
        },
        {
            "title": "Reliance Industries Q3 results today: What to expect and 5 key things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q3-results-today-what-to-expect-and-5-key-things-to-track/articleshow/126556915.cms",
            "description": "Reliance Industries is set to announce its Q3 results today, with analysts expecting a strong performance from its refining division, driven by higher diesel cracks and a weaker rupee. However, the retail segment faces headwinds from quick commerce losses and a consumption slowdown, while Jio's ARPU trajectory and petrochemical pain are key areas to watch.",
            "pubDate": "2026-01-16T05:58:55.342435"
        }
    ]
}