{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-15T20:58:30.975646",
    "items": [
        {
            "title": "Dr Agarwal''s Health Care clocks Q4 consolidated profit after tax at Rs 28.24 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-agarwals-health-care-clocks-q4-consolidated-profit-after-tax-at-rs-28-24-cr/articleshow/118272626.cms",
            "description": "Dr Agarwal's Health Care Ltd reported a consolidated profit after tax of Rs 28.24 crore for the October-December 2024 quarter, up from Rs 22.59 crore in the same period last year. The company also raised Rs 3,027 crore through its recent IPO and expanded with 42 new facilities during April-December 2024.",
            "pubDate": "2025-02-15T20:58:22.639398"
        },
        {
            "title": "Reliance Infrastructure Q3 net loss widens to Rs 3,298.35 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-infrastructure-q3-net-loss-widens-to-rs-3298-35-crore/articleshow/118271464.cms",
            "description": "Reliance Infrastructure Ltd reported a significant increase in consolidated net loss to Rs 3,298.35 crore in the December quarter, compared to a net loss of Rs 421.17 crore in the previous year. Despite the loss, the company's total income rose to Rs 5,129.07 crore, and expenses decreased to Rs 4,963.23 crore.",
            "pubDate": "2025-02-15T20:58:22.639547"
        },
        {
            "title": "Samvardhana Motherson Q3 Results: Net profit rises 62% YoY to Rs 879 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/samvardhana-motherson-q3-results-net-profit-rises-62-yoy-to-rs-879-crore/articleshow/118253895.cms",
            "description": "Auto component maker Samvardhana Motherson International on Friday reported a consolidated net profit of Rs 879 crore for the third quarter ended December 31, 2024. The company had reported a net profit of Rs 542 crore for the October-December quarter of the last fiscal.",
            "pubDate": "2025-02-15T20:58:22.639654"
        },
        {
            "title": "Swan Energy Q3 Results: Cons PAT soars 406% to Rs 583 crore, revenue up 20%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swan-energy-q3-results-cons-pat-jumps-406-to-rs-583-crore-revenue-up-20/articleshow/118253212.cms",
            "description": "Swan Energy Q3 Results:  Swan Energy reported a 406% YoY surge in net profit to ₹583 crore for Q3 FY25, with revenue rising 20% to ₹1,908 crore. A sharp increase in other income boosted total income to ₹3,777 crore.",
            "pubDate": "2025-02-15T20:58:22.639759"
        },
        {
            "title": "Glenmark Pharmaceuticals Q3 Results: PAT at Rs 348 crore versus YoY loss, revenue up 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/glenmark-pharmaceuticals-q3-results-pat-at-rs-348-crore-versus-yoy-loss-revenue-up-35/articleshow/118252403.cms",
            "description": "Glenmark Pharmaceuticals Q3 Results: Glenmark Pharmaceuticals posted a net profit of ₹348 crore in Q3 FY25, reversing a ₹351 crore loss YoY. Revenue surged 35% to ₹3,388 crore, with strong growth in India and Europe, while EBITDA stood at ₹600 crore with a 17.7% margin.",
            "pubDate": "2025-02-15T20:58:22.639864"
        },
        {
            "title": "BSNL Q3 Results: Telco swings to black with Rs 262 crore profit, aided by network expansion & cost control",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bsnl-q3-results-telco-swings-to-black-with-rs-262-crore-profit-aided-by-network-expansion-cost-control/articleshow/118251768.cms",
            "description": "BSNL Q3 Results: The public sector telco reported a net loss of Rs 1,569.22 crore in Q3FY24. Its mobility services revenue grew 15% YoY, while fiber-to-the-home (FTTH) and leased line services saw YoY increases of 18% and 14%, respectively.",
            "pubDate": "2025-02-15T20:58:22.640021"
        },
        {
            "title": "Puravankara Q3 Results: Company posts net loss of Rs 92 crore, revenue slumps 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/puravankara-q3-results-company-posts-net-loss-of-rs-92-crore-revenue-slumps-43/articleshow/118251677.cms",
            "description": "Puravankara Limited reported a net loss of ₹92.64 crore in Q3 FY25, with revenue dropping 43% to ₹334 crore due to higher expenses and lower handovers. However, customer collections and average price realization showed positive growth.",
            "pubDate": "2025-02-15T20:58:22.640129"
        },
        {
            "title": "Hinduja Global Solutions Q3 Results: Company posts Rs 8.59 crore loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hinduja-global-solutions-q3-results-company-posts-rs-8-59-crore-loss/articleshow/118251219.cms",
            "description": "Business process management firm Hinduja Global Solutions (HGS) on Friday reported a consolidated loss of Rs 8.59 crore in the December quarter of FY25. It had posted a consolidated profit of Rs 8.18 crore in the year-ago period, according to a regulatory filing.",
            "pubDate": "2025-02-15T20:58:22.640236"
        },
        {
            "title": "EaseMyTrip Q3 Results: Net profit declines to Rs 34 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/easemytrip-q3-results-net-profit-declines-to-rs-34-crore/articleshow/118248429.cms",
            "description": "Online travel booking platform EaseMyTrip on Friday reported a decline in its consolidated net profit to Rs 34 crore in the quarter ended December. The company had a net profit of Rs 45.68 crore in the year-ago period, according to a regulatory filing.",
            "pubDate": "2025-02-15T20:58:22.640330"
        },
        {
            "title": "Shapoorji Pallonji  Q3 results: Net profit rises 36% y-o-y to Rs 148.85 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shapoorji-pallonji-q3-results-net-profit-rises-36-y-o-y-to-rs-148-85-crore/articleshow/118229729.cms",
            "description": "Net profit for the third quarter rose to Rs 148.85 crore, up from Rs 109.71 crore for the same period a year ago, the company reported in a filing to the exchange.",
            "pubDate": "2025-02-15T20:58:22.640445"
        }
    ]
}