{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-23T16:01:47.202130",
    "items": [
        {
            "title": "IndiGo Q3 profit plunges 75% amid pilot shortage, compensation costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-q3-profit-plunges-75-amid-pilot-shortage-compensation-costs/articleshow/127216011.cms",
            "description": "IndiGo's profit plummeted 75% to ₹549 crore in Q3 due to ₹1,546.5 crore in one-time costs for customer compensation and new labor rule implementation. The airline faced disruptions from pilot shortages and a DGCA investigation found management failures in planning and implementing new rest rules, impacting its growth forecast.",
            "pubDate": "2026-01-23T01:28:02.000202"
        },
        {
            "title": "Softer domestic prices, rising input costs to weigh on steelmakers’ Q3 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/softer-domestic-prices-rising-input-costs-to-weigh-on-steelmakers-q3-earnings/articleshow/127212583.cms",
            "description": "Steel companies anticipate lower profits this quarter. Softening domestic prices and higher input costs are impacting earnings. However, non-ferrous metal producers are set for better results. Strong rebounds in aluminium, zinc, and copper prices are driving this improvement. A new safeguard duty on steel imports is expected to boost prices in the coming months.",
            "pubDate": "2026-01-23T01:28:02.000329"
        },
        {
            "title": "Shriram Finance Q3 Results: PAT falls 29% YoY to Rs 2,522 crore, NII rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shriram-finance-q3-results-pat-falls-29-yoy-to-rs-2522-crore-nii-rises-16/articleshow/127256516.cms",
            "description": "Shriram Finance Q3 results:  Shriram Finance reported a 29% YoY fall in its December quarter standalone net profit at Rs 2,522 crore compared to Rs 3,570 crore reported in the year ago period.",
            "pubDate": "2026-01-23T08:52:15.020240"
        },
        {
            "title": "Adani Green Q3 Results: Company reports loss of Rs 41 crore vs Rs 492 crore profit a year ago",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-green-q3-results-company-reports-loss-of-rs-41-crore-vs-rs-492-crore-profit-a-year-ago/articleshow/127257687.cms",
            "description": "Adani Green Q3 Results: Adani Green reported a net loss of Rs 41 crore in the December quarter, a shift from last year's profit. Despite this, total income climbed 8% year-on-year to Rs 2,837 crore. The company's power supply segment saw robust growth, with revenue up 21% and EBITDA by 23%, fueled by significant greenfield capacity additions and new project commissioning.",
            "pubDate": "2026-01-23T09:16:44.362448"
        },
        {
            "title": "IndusInd Bank Q3 Results: PAT drops 89% YoY to Rs 161 crore; NII falls 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-q3-results-pat-drops-88-5-yoy-to-rs-161-crore-but-meets-estimates/articleshow/127269306.cms",
            "description": "IndusInd Bank Q3 Results: The lender’s net interest income stood at Rs 4,562 crore in Q3FY26, down 13% YoY but up 3% sequentially.",
            "pubDate": "2026-01-23T10:49:12.337038"
        },
        {
            "title": "JSW Steel Q3 Results: Cons net profit soars 198% YoY to Rs 2,139 crore, revenue up 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q3-results-cons-net-profit-soars-198-yoy-to-rs-2139-crore-revenue-up-11/articleshow/127265425.cms",
            "description": "JSW Steel Q3 Results: JSW Steel announced a significant 198% year-on-year surge in its consolidated net profit for the December quarter, reaching Rs 2,139 crore. This impressive growth was accompanied by an 11% year-on-year increase in its Q3FY26 revenue, which stood at Rs 45,991 crore.",
            "pubDate": "2026-01-23T10:49:12.337149"
        },
        {
            "title": "India Cements Q3 Results: UltraTech-owned co's loss narrows to Rs 5.72 cr on higher sales volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-owned-india-cements-narrows-quarterly-loss-as-sales-volumes-ramp-up/articleshow/127264393.cms",
            "description": "India Cements posted a smaller third-quarter loss on ‍Friday compared to ​a year earlier, helped by a 25% jump ⁠in sales volumes as parent UltraTech Cement ramps up capacity to meet an uptick in demand.",
            "pubDate": "2026-01-23T10:49:12.337240"
        },
        {
            "title": "UltraTech Cement Q3 Preview: Strong volumes seen driving up to 25% QoQ PAT growth; revenue may rise up to 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-q3-preview-strong-volumes-seen-driving-up-to-25-qoq-pat-growth-revenue-may-rise-up-to-11/articleshow/127280723.cms",
            "description": "UltraTech Cement is expected to post a steady Q3FY26 performance driven by strong volume growth, healthy revenue expansion and improved profitability. Brokerages estimate a QoQ PAT rise of up to 25% and revenue growth of up to 11%, supported by better demand, higher capacity utilisation and easing cost pressures.",
            "pubDate": "2026-01-23T13:52:39.521267"
        },
        {
            "title": "Urban Company Q3 Results: Co reports loss of Rs 21 crore, revenue up 33%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/urban-company-q3-results-co-reports-loss-of-rs-21-crore-revenue-up-33/articleshow/127274747.cms",
            "description": "Urban Company slipped to a Rs 21 crore Q3 loss as heavy investment in InstaHelp hurt earnings, despite 33% revenue growth. Core businesses stayed profitable, margins improved, and management expects continued growth while near-term losses persist from expanding housekeeping services.",
            "pubDate": "2026-01-23T13:52:39.521380"
        },
        {
            "title": "BPCL Q3 Results: Cons PAT jumps 89% YoY to Rs 7,188 crore, revenue up 7%. Rs 10/share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bpcl-q3-results-cons-pat-jumps-89-yoy-to-rs-7188-crore-revenue-up-7-rs-10/share-dividend-announced/articleshow/127294641.cms",
            "description": "BPCL posted an 89% surge in Q3FY26 net profit to Rs 7,188 crore on higher refining margins and revenue growth. The oil PSU also declared a Rs 10 interim dividend, while maintaining a stronger balance sheet with lower leverage.",
            "pubDate": "2026-01-23T14:44:16.101874"
        },
        {
            "title": "Kotak Bank Q3 Preview: PAT may grow by up to 3% YoY, NII to rise up to 5%. 7 things to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-bank-q3-preview-pat-may-grow-by-up-to-3-yoy-nii-to-rise-up-to-5-7-things-to-know/articleshow/127292313.cms",
            "description": "Kotak Mahindra Bank is expected to post modest Q3FY26 profit growth of 1–3%, aided by steady loan expansion, stable margins and improving asset quality. Brokerages see resilient earnings, controlled credit costs and moderate NII growth ahead of results on January 24.",
            "pubDate": "2026-01-23T14:44:16.101972"
        },
        {
            "title": "MCX Q3 Results: Cons PAT jumps 151% YoY to Rs 401 crore, revenue soars 121%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mcx-q3-results-cons-pat-jumps-151-yoy-to-rs-401-crore-revenue-soars-121/articleshow/127301666.cms",
            "description": "MCX posted a sharp Q3FY26 surge, with profit up 151% and revenue rising 121%, driven by booming derivatives volumes, strong bullion participation, new product launches and expanding options activity, supported by governance focus and readiness.",
            "pubDate": "2026-01-23T15:50:46.302434"
        },
        {
            "title": "Shriram Finance Q3 profit drops to Rs 2,522 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shriram-finance-q3-profit-drops-to-rs-2522-crore/articleshow/127302515.cms",
            "description": "Shriram Finance reported a 29% drop in third quarter net profit at Rs 2,522 crore as against Rs 3,570 crore. The company attributed the fall in profit to the exceptional gain of Rs 1489 crore it received for sale of its stake in subsidiary Shriram Housing Finance.",
            "pubDate": "2026-01-23T16:01:46.444503"
        }
    ]
}