{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-26T11:19:43.571221",
    "items": [
        {
            "title": "Asian stocks to slip as inflation clouds Fed cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-to-slip-as-inflation-clouds-fed-cuts/articleshow/123513626.cms",
            "description": "Asian equities are poised to decline, mirroring Wall Street's downturn, as investors await a crucial US inflation report that could influence the Federal Reserve's rate cut decisions. Concerns linger about the pace of potential rate reductions amid mixed signals from the labor market and persistent inflation.",
            "pubDate": "2025-08-26T01:25:48.133208"
        },
        {
            "title": "Stocks in news: Vodafone Idea, Sai Life, BPCL, IndusInd Bank, IREDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vodafone-idea-sai-life-bpcl-indusind-bank-ireda/articleshow/123507341.cms",
            "description": "Markets opened positively, fueled by global cues, with several companies in focus due to significant developments. Protean eGov Technologies secured a substantial order from UIDAI, while TGP Asia plans to sell a stake in Sai Life Sciences.",
            "pubDate": "2025-08-26T01:25:48.133333"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123507389.cms",
            "description": "Indian equity markets began the week with gains, buoyed by positive global cues. Analysts suggest focusing on thematic movers for better performance, advising traders to be cautious in Bank Nifty, awaiting bullish reversal confirmation. Meanwhile, India VIX edged up, and the rupee weakened slightly against the dollar, influenced by a strong US currency and rising crude oil prices.",
            "pubDate": "2025-08-26T01:25:48.133446"
        },
        {
            "title": "TPG beats Advent to emerge frontrunner for Tessolve stake; to invest $140–150 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tpg-in-advanced-talks-to-invest-140150-million-in-hero-electronix-backed-tessolve/articleshow/123513559.cms",
            "description": "TPG Inc. is leading the race to acquire a significant minority stake in Tessolve, a semiconductor design and engineering company primarily owned by Hero Electronix. TPG's growth fund has entered into an exclusivity agreement with Tessolve for final negotiations, surpassing Advent International's bid, valuing Tessolve at $475-500 million.",
            "pubDate": "2025-08-26T01:25:48.133545"
        },
        {
            "title": "Rajiv Anand takes charge as MD & CEO of IndusInd Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rajiv-anand-takes-charge-as-md-ceo-of-indusind-bank/articleshow/123513334.cms",
            "description": "Rajiv Anand has officially taken over as the MD & CEO of IndusInd Bank, commencing his three-year term that extends until August 2028. Following his appointment, the previously established 'Committee of Executives' and the 'Oversight Committee of the Board' have been dissolved, marking a new chapter for the bank's leadership.",
            "pubDate": "2025-08-26T01:25:48.133650"
        },
        {
            "title": "FPIs continue to sell in August, financial & IT stocks take biggest hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-continue-to-sell-in-august-financial-it-stocks-take-biggest-hit/articleshow/123513277.cms",
            "description": "Foreign fund managers increased selling of Indian equities in early August due to tariff concerns, a weak rupee, and poor corporate earnings. Financial services and IT stocks experienced the most significant selling pressure. Investors offloaded shares worth ₹34,022 crore across various sectors, driven by muted earnings expectations and uncertainty surrounding India-US relations, impacting market sentiment.",
            "pubDate": "2025-08-26T01:25:48.133752"
        },
        {
            "title": "SBI chief advocates for regulatory changes to boost corporate M&A",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-chief-advocates-for-regulatory-changes-to-boost-corporate-ma/articleshow/123513222.cms",
            "description": "SBI Chairman CS Setty advocates for regulatory flexibility, urging the RBI to allow local lenders to fund corporate M&As, particularly for listed companies with transparent shareholder approvals. This comes amid discussions on evolving corporate credit trends, with banks shifting towards short-term working capital.",
            "pubDate": "2025-08-26T01:25:48.133850"
        },
        {
            "title": "Top IT services stocks offer 10-15% upside, says Investec",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investec-upgrades-it-services-stocks-with-10-15-return-potential/articleshow/123513149.cms",
            "description": "Investec reports an improved risk-reward scenario for most IT services stocks, projecting potential one-year returns exceeding 10-15%. The brokerage upgraded Infosys to 'Buy' with a target price of ₹1,655, anticipating an 8% gain. Tech Mahindra, Infosys, and TCS are favored among larger stocks, while Mphasis, Zensar, and KPIT are preferred in the mid-sized category.",
            "pubDate": "2025-08-26T01:25:48.133947"
        },
        {
            "title": "Chinese stocks euphoria spreads as turnover tops $430 billion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinese-stocks-euphoria-spreads-as-turnover-tops-430-billion/articleshow/123513097.cms",
            "description": "Chinese stocks surged again, fueled by abundant liquidity and optimism surrounding DeepSeek's updated model. The rally, led by technology shares, broadened to include property stocks after Shanghai eased home-buying rules. While some see room for further gains, concerns about overheating are emerging as key benchmarks rise significantly from their lows, with investors closely monitoring liquidity indicators.",
            "pubDate": "2025-08-26T01:25:48.134040"
        },
        {
            "title": "Stock Radar: July breakout level holding firm for Aadhar Housing Finance; check for target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-july-breakout-level-holding-firm-for-aadhar-housing-finance-check-for-target-stop-loss/articleshow/123500194.cms",
            "description": "Aadhar Housing Finance Ltd, after a period of consolidation, is showing signs of a rebound following a retest of breakout levels from July. Experts suggest short-term traders consider buying the stock, targeting a price of Rs 560 in the near term. The stock's recent performance and technical indicators point towards renewed positive momentum.",
            "pubDate": "2025-08-26T01:25:48.134139"
        },
        {
            "title": "Seize the opportunity, invest boldly: RBI Guv Sanjay Malhotra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/seize-the-opportunity-invest-boldly-rbi-guv-sanjay-malhotra/articleshow/123513372.cms",
            "description": "\"Financial stability and price stability do not inhibit growth. Far from it. They are essential for sustainable growth. I look forward to working together with the regulated entities, to improve the efficiency and effectiveness of our financial intermediation, to ensure that the due benefits reach the people of our nation,\" RBI Guv Sanjay Malhotra said.",
            "pubDate": "2025-08-26T01:25:48.134262"
        },
        {
            "title": "Grihum Housing Finance set to name ex-Citi banker MD, CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grihum-housing-finance-set-to-name-ex-citi-banker-md-ceo/articleshow/123513383.cms",
            "description": "In a notice to stock exchanges on August 21, Grihum Housing Finance had announced that its current MD & CEO Manish Jaiswal will step down with effect from August 31. Jaiswal will continue as an advisor to the board until December 31. The company had said it would identify a suitable candidate for the top post in due course.",
            "pubDate": "2025-08-26T01:25:48.134361"
        },
        {
            "title": "Protean eGov Technologies shares in focus after bagging Rs 1,160 crore Aadhaar services work order from UIDAI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/protean-egov-technologies-shares-in-focus-after-bagging-rs-1160-crore-aadhaar-services-work-order-from-uidai/articleshow/123515900.cms",
            "description": "Protean eGov Technologies share price:  The UIDAI, under the Ministry of Electronics and Information Technology, has awarded a contract to Protean eGov Technologies for setting up and managing Aadhaar Seva Kendras across 188 districts in the country. These centres will provide citizens with Aadhaar enrolment, demographic and biometric updates, and other related services.",
            "pubDate": "2025-08-26T03:56:18.540615"
        },
        {
            "title": "YES Bank shares down 20% in 1 year. Can RBI’s nod to SMBC deal push the stock towards Rs 23?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-down-20-in-1-year-can-rbis-nod-to-smbc-deal-push-the-stock-towards-rs-23/articleshow/123515805.cms",
            "description": "YES Bank shares show recovery signs after RBI approved Sumitomo Mitsui Banking Corporation's stake purchase. While the deal is expected to bring capital infusion and expertise, analysts remain cautiously optimistic, citing structural challenges and resistance levels. Technical indicators suggest a potential upside, but broader trends and regulatory conditions warrant careful consideration for investors.",
            "pubDate": "2025-08-26T03:56:18.540744"
        },
        {
            "title": "Delhivery, SBI Cards, Angel One among 7 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/delhivery-sbi-cards-angel-one-among-7-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123515659.cms",
            "description": "There was a notable surge in futures open interest (OI) for seven stocks in the NSE F&O pack, with total OI rising over 7% on August 27 compared to the previous session. A sharp rise in futures OI indicates a significant increase in active, unexpired contracts of a particular security. This trend reflects growing participation in the market, as traders either initiate fresh positions or expand their existing ones in the futures segment.",
            "pubDate": "2025-08-26T03:56:18.540848"
        },
        {
            "title": "Stock Market Holiday 2025: Are NSE, BSE open or closed on August 27 for Ganesh Chaturthi 2025? Check now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-2025-are-nse-bse-open-or-closed-on-august-27-for-ganesh-chaturthi-2025-check-now/articleshow/123515717.cms",
            "description": "Indian stock and commodity markets will be closed on August 27, 2025, for Ganesh Chaturthi. Trading on BSE and NSE will halt, including equities and derivatives. MCX will have limited hours. NCDEX will be fully closed. Markets will reopen on August 28. More holidays are scheduled for October, November and December. Market participants will monitor global cues during the break.",
            "pubDate": "2025-08-26T03:56:18.540945"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Cohance Lifesciences, Divi’s Lab among 5 stocks that could give 10-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-cohance-lifesciences-divis-lab-among-5-stocks-that-could-give-10-30-return/slideshow/123515264.cms",
            "description": "Brokerages remain upbeat on select stocks across sectors, rolling out fresh Buy calls with healthy upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-26T03:56:18.541050"
        },
        {
            "title": "At multi-year highs: Maruti Suzuki, Apollo Micro among 10 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-maruti-suzuki-apollo-micro-among-10-stocks-witness-5-year-swing-high-breakout/slideshow/123515136.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, 10 stocks witnessed a 5-year swing high at the close on August 25, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-08-26T03:56:18.541153"
        },
        {
            "title": "Infosys, Wipro, TCS and 6 other Nifty stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-tcs-and-6-other-nifty-stocks-showing-rsi-trending-up/slideshow/123514990.cms",
            "description": "Nine stocks from the Nifty50 pack were highlighted in the RSI Trending Up scan on August 25, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-08-26T03:56:18.541255"
        },
        {
            "title": "Last day to buy shares of 13 companies to qualify for dividends as Aug 27 record date approaches",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-13-companies-to-qualify-for-dividends-as-aug-27-record-date-approaches/articleshow/123514746.cms",
            "description": "Investors seeking dividend income should purchase shares by August 26 to qualify for payouts from companies like Procter & Gamble Hygiene, Vedant Fashions, and Jyothy Labs. These firms, along with others such as Gujarat Pipavav Port and Route Mobile, have set August 27 as the record date for dividend eligibility.",
            "pubDate": "2025-08-26T03:56:18.541355"
        },
        {
            "title": "Positive Breakout: These 10 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-close-cross-above-their-200-dmas/slideshow/123514707.cms",
            "description": "The closing price of 10 stocks from the Nifty500 pack crossed above their 200 DMA (Daily Moving Averages) on August 25, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-08-26T03:56:18.541449"
        },
        {
            "title": "LGT Business Connextions shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lgt-business-connextions-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/123514554.cms",
            "description": "LGT Business Connextions Ltd. is set to debut on the BSE SME platform on Tuesday, August 26, with expectations of a flat listing as its grey market premium remains at the issue price of Rs 107. The IPO, which closed on August 21 and was subscribed 1.25 times, aims to utilize the Rs 28.",
            "pubDate": "2025-08-26T03:56:18.541541"
        },
        {
            "title": "HDFC Bank shares in focus as stock to trade ex-bonus for 1:1 issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-in-focus-as-stock-to-trade-ex-bonus-for-11-issue/articleshow/123514532.cms",
            "description": "HDFC Bank's shares are in focus as August 26 marks the record date for its first-ever 1:1 bonus share issue. Investors holding the stock on Monday qualify to receive one additional share for each share owned. This move signals management's confidence and rewards investors, following a Q1FY26 report of a 12% year-on-year standalone net profit growth to ₹18,155 crore.",
            "pubDate": "2025-08-26T03:56:18.541670"
        },
        {
            "title": "Indian stocks struggles to shake off pessimism ahead of tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-stocks-struggles-to-shake-off-pessimism-ahead-of-tariffs/articleshow/123514287.cms",
            "description": "Indian equities are expected to continue underperforming emerging markets due to escalating trade tensions with the US, including a new 25% tariff on Indian imports, bringing the cumulative levies to 50%.",
            "pubDate": "2025-08-26T03:56:18.541765"
        },
        {
            "title": "Wall Street ends down as traders focus on Nvidia, Fed after last week's rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-down-as-traders-focus-on-nvidia-fed-after-last-weeks-rally/articleshow/123514304.cms",
            "description": "Wall Street experienced a downturn on Monday as investors analyzed the U.S. interest rate outlook and awaited Nvidia's earnings report. Friday's rally, fueled by hints of a potential rate cut from the Federal Reserve, gave way to cautious trading. Upcoming inflation and jobs data are crucial, influencing expectations for Fed action.",
            "pubDate": "2025-08-26T03:56:18.541854"
        },
        {
            "title": "Asian Energy, Megasoft among 6 stocks with White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-energy-megasoft-among-6-stocks-with-white-marubozu-pattern/slideshow/123516440.cms",
            "description": "On August 25, six stocks with a market cap of over Rs 1,000 crore appeared on the NSE’s bullish “White Marubozu” scanner, according to StockEdge’s technical scan data.A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest and the closing price is the highest for a given period. Represented by a long white (or green) candlestick with no upper shadow and little to no lower shadow, it signals strong buying pressure throughout the session, indicating that buyers were in control from start to finish. Traders often view this as a potential indicator of further upside.",
            "pubDate": "2025-08-26T04:18:58.568566"
        },
        {
            "title": "GST reforms, RBI support to cushion India’s growth risks: Rob Subbaraman",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-reforms-rbi-support-to-cushion-indias-growth-risks-rob-subbaraman/articleshow/123516270.cms",
            "description": "Jerome Powell's recent remarks at the Jackson Hole Symposium have fueled market expectations of a U.S. Federal Reserve rate cut in September. While Nomura anticipates three cuts, they foresee a more cautious approach than markets predict. India faces potential tariff hikes from the U.S., but proactive policy responses are expected to mitigate the impact.",
            "pubDate": "2025-08-26T04:18:58.568693"
        },
        {
            "title": "Vodafone Idea shares slide 7% after Centre rules out further AGR relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-after-centre-rules-out-further-agr-relief/articleshow/123516200.cms",
            "description": "Vodafone Idea share price: The government has ruled out additional AGR relief for Vodafone Idea. The Centre clarified that no further concessions are planned beyond past equity conversions, leaving the telco’s Rs 75,000 crore liability and post-moratorium repayments a key concern for investors.",
            "pubDate": "2025-08-26T04:18:58.568801"
        },
        {
            "title": "Cantor initiates coverage on Ambuja Cements with 'Overweight' rating, sets target price at Rs 745",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cantor-initiates-coverage-on-ambuja-cements-with-overweight-rating-sets-target-price-at-rs-745/articleshow/123516147.cms",
            "description": "Global brokerage Cantor has initiated coverage on Ambuja Cements with an ‘Overweight’ rating and a target price of Rs 745, implying 28% upside. The firm cites Ambuja’s capacity expansion, cost efficiencies, and premium products as key drivers of growth and valuation re-rating potential.",
            "pubDate": "2025-08-26T04:18:58.568905"
        },
        {
            "title": "Sai Life Sciences shares in focus as TPG Asia likely to sell Rs 2,500 crore worth shares via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sai-life-sciences-shares-in-focus-as-tpg-asia-likely-to-sell-rs-2500-crore-worth-shares-via-block-deal/articleshow/123516100.cms",
            "description": "Sai Life Sciences is set to be in focus as TPG Asia prepares to exit its entire 14.72% stake via a Rs 2,500 crore block deal at a floor price of Rs 860 per share, a 5% discount to Monday’s close. The Hyderabad-based CRDMO has seen strong earnings growth, margin improvement, and steady share price gains in recent months.",
            "pubDate": "2025-08-26T04:18:58.569020"
        },
        {
            "title": "Sensex tumbles over 600 pts, Nifty below 24,800 after U.S. moves to levy steep tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-tumbles-over-500-pts-nifty-below-24800-after-u-s-moves-to-levy-steep-tariffs/articleshow/123515750.cms",
            "description": "Indian benchmark indices Sensex and Nifty experienced a downturn at the opening on Tuesday. This decline was triggered by concerns regarding potential U.S. trade measures, specifically the proposed tariffs of up to 50% on Indian goods.",
            "pubDate": "2025-08-26T04:18:58.569121"
        },
        {
            "title": "PTC Industries, eClerx Services among 7 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ptc-industries-eclerx-services-among-7-stocks-closed-crossing-above-vwap/slideshow/123516061.cms",
            "description": "The closing prices of seven stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on August 25, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-26T04:18:58.569221"
        },
        {
            "title": "Gem Aromatics shares list at 2% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gem-aromatics-shares-list-at-2-premium-over-ipo-price/articleshow/123516818.cms",
            "description": "Gem Aromatics made a muted debut on the stock market, listing with a slight premium on the NSE and flat on the BSE after its Rs 451.25 crore IPO. The IPO, subscribed 30.45 times overall, will use proceeds to repay borrowings and for corporate purposes. The company, a manufacturer of speciality ingredients, reported increased revenue and profit in FY25.",
            "pubDate": "2025-08-26T04:51:46.651019"
        },
        {
            "title": "Patel Retail shares list at 20% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patel-retail-shares-list-at-20-premium-over-ipo-price/articleshow/123516805.cms",
            "description": "Patel Retail's shares debuted strongly, listing with a premium of 19.6% after its IPO was oversubscribed 95.69 times. The IPO proceeds are earmarked for debt repayment, working capital, and general corporate needs. The company, operating as 'Patel's R Mart,' focuses on tier-III cities with a chain of supermarkets across Maharashtra and Gujarat.",
            "pubDate": "2025-08-26T04:51:46.651146"
        },
        {
            "title": "Delta Corp’s bet goes bust as stock drops 9% on RMG ban, 34% lower in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/delta-corps-bet-goes-bust-as-stock-drops-9-on-rmg-ban-34-lower-in-a-year/articleshow/123516942.cms",
            "description": "Delta Corp's stock has experienced a 9% drop in the last three sessions due to the ban on real money gaming (RMG), extending its year-long underperformance. Technical analysis suggests potential consolidation between Rs 82.80 and Rs 96.20, with analysts recommending caution.",
            "pubDate": "2025-08-26T04:51:46.651366"
        },
        {
            "title": "Vikram Solar makes a muted D-St debut, shares list at 2% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikram-solar-makes-a-muted-d-st-debut-shares-list-at-2-premium-over-ipo-price/articleshow/123516634.cms",
            "description": "Vikram Solar share price: Vikram Solar's shares debuted with a modest premium on the stock exchanges, following a highly successful IPO that was oversubscribed 56.42 times. The company, a major solar PV module manufacturer, witnessed strong financial growth in FY25, with revenue increasing by 37% and profit after tax surging by 75%. Post-IPO, Vikram Solar's market capitalization is estimated at Rs 12,009 crore.",
            "pubDate": "2025-08-26T04:51:46.651467"
        },
        {
            "title": "ONGC shares in focus as gas sales begin from Rajasthan’s Chinnewala Tibba field",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-shares-in-focus-as-gas-sales-begin-from-rajasthans-chinnewala-tibba-field/articleshow/123516880.cms",
            "description": "ONGC has commenced natural gas sales from the Chinnewala Tibba field in Rajasthan, a Discovered Small Field (DSF-II) block, supplying 1.0 LSCMD to RRVUNL. This move enhances domestic energy production and strengthens India's energy security, facilitated by collaboration between ONGC, DGH, GAIL, OIL, and RRVUNL. Despite this achievement, ONGC's shares have experienced a decline over the past year.",
            "pubDate": "2025-08-26T04:51:46.651567"
        },
        {
            "title": "Forget multibaggers, Sensex & Nifty fail to beat even bank FD returns in 1 year. What's wrong?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/forget-multibaggers-sensex-nifty-fail-to-beat-even-bank-fd-returns-in-1-year-whats-wrong/articleshow/123516848.cms",
            "description": "Indian stock market returns have stagnated, underperforming bank fixed deposits over the past year, frustrating investors who anticipated continued growth. While domestic inflows provide support, selling pressure from FIIs and promoters has created a time correction phase. Experts suggest focusing on long-term investment strategies, as historical data indicates equities offer superior returns over time, despite short-term volatility.",
            "pubDate": "2025-08-26T04:51:46.651678"
        },
        {
            "title": "Tata Motors shares in focus after NCLT clears restructuring scheme for 2 subsidiaries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-after-nclt-clears-restructuring-scheme-for-2-subsidiaries/articleshow/123516787.cms",
            "description": "Tata Motors is set for a major restructuring after the NCLT, Mumbai Bench, approved its Composite Scheme of Arrangement with subsidiaries TML Commercial Vehicles and Tata Motors Passenger Vehicles. The move will demerge the commercial vehicle arm and merge the passenger vehicle unit, creating a streamlined structure aimed at boosting operational efficiency, strategic focus, and long-term growth.",
            "pubDate": "2025-08-26T04:51:46.651776"
        },
        {
            "title": "Tariffs, Fed cuts and earnings will shape India’s market mood: Jigar Mistry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariffs-fed-cuts-and-earnings-will-shape-indias-market-mood-jigar-mistry/articleshow/123516750.cms",
            "description": "As Ganesh Chaturthi brings festive hope, expert Jigar Mistry advises investors to remain cautious. Global tariff disputes and delayed US rate cuts impact market sentiment. While corporate earnings show growth, revisions suggest a slowdown. Mistry highlights potential in travel, hotels, and financials.",
            "pubDate": "2025-08-26T04:51:46.651868"
        },
        {
            "title": "Why is the stock market down today? Sensex drops over 600 pts, Nifty below 24,800 — key reasons behind the slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-the-stock-market-down-today-sensex-drops-over-600-pts-nifty-below-24800-7-reasons-behind-the-slump/articleshow/123516594.cms",
            "description": "Indian stock markets experienced a significant decline. Sensex and Nifty both fell sharply on Tuesday. This drop followed the United States' announcement of potential tariffs on Indian goods. The proposed tariffs could reach up to 50%. Investors are reacting to this trade development. Currency fluctuations and foreign investor selling are also contributing to the market downturn.",
            "pubDate": "2025-08-26T04:51:46.651970"
        },
        {
            "title": "Did HDFC Bank shares really fall 62%? All you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/did-hdfc-bank-shares-really-fall-62-all-you-need-to-know/articleshow/123516531.cms",
            "description": "HDFC Bank shares appeared to crash 62% on Tuesday, but the decline was only a technical adjustment as the stock turned ex-bonus after its 1:1 issue. The bonus shares increase liquidity and retail access, without impacting the bank’s market capitalisation or shareholder value.",
            "pubDate": "2025-08-26T04:51:46.652070"
        },
        {
            "title": "Trade hit inevitable, but India can withstand the shock: Swaminathan Aiyar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trade-hit-inevitable-but-india-can-withstand-the-shock-swaminathan-aiyar/articleshow/123519282.cms",
            "description": "India is bracing for potential trade turmoil with the US as proposed 50% tariffs loom. Economist Swaminathan Aiyar suggests the dispute transcends trade, implicating geopolitics due to India's stance on Russian crude oil. Aiyar cautions about the impact on India's defense ties with the US, questioning future arms purchases if treated unfavorably.",
            "pubDate": "2025-08-26T06:49:37.166264"
        },
        {
            "title": "Sun Pharma shares slip 3% after BofA downgrade on premium valuations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-shares-slip-3-after-bofa-downgrade-on-premium-valuations/articleshow/123519218.cms",
            "description": "Bank of America downgraded Sun Pharma stock to ‘underperform’ from ‘neutral’, citing risks to premium valuations and slower speciality execution. The brokerage cut its target price, flagging concerns over Ilumya’s Medicare exposure, pricing pressures, and limited earnings visibility despite strong initial performance.",
            "pubDate": "2025-08-26T06:49:37.166383"
        },
        {
            "title": "Tariff Truce at Crossroads:  Chinese negotiator’s US visit sparks market buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-truce-at-crossroads-chinese-negotiators-us-visit-sparks-market-buzz/slideshow/123519044.cms",
            "description": "Senior Chinese trade negotiator Li Chenggang is set to travel to Washington this week for meetings with U.S. officials. A U.S. government spokesperson confirmed the trip but stressed that it will not be part of a formal negotiation round.",
            "pubDate": "2025-08-26T06:49:37.166498"
        },
        {
            "title": "UBS resumes coverage on Reliance Industries with 'Buy' rating, sets target price at Rs 1,750",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ubs-resumes-coverage-on-reliance-industries-with-buy-rating-sets-target-price-at-rs-1750/articleshow/123519152.cms",
            "description": "UBS resumed coverage on Reliance Industries with a ‘Buy’ rating and a Rs 1,750 target, citing strong prospects in Jio, retail, and new energy. The brokerage expects value unlocking across business segments, with earnings growth and sector-leading multiples supporting long-term re-rating potential for the stock.",
            "pubDate": "2025-08-26T06:49:37.166606"
        },
        {
            "title": "Private banks look more attractive than PSU peers on valuations: Deepak Shenoy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/private-banks-look-more-attractive-than-psu-peers-on-valuations-deepak-shenoy/articleshow/123519082.cms",
            "description": "IT stocks like Infosys, TCS, HCL Tech, and Wipro are seeing renewed buying interest as tariff clarity boosts confidence, though experts caution against sharp gains. Deepak Shenoy highlights AI-driven adaptation for IT and sees private banks offering better value than PSU peers amid valuation concerns.",
            "pubDate": "2025-08-26T06:49:37.166705"
        },
        {
            "title": "From Bailouts to Buy-Ins: Trump’s new economic playbook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-bailouts-to-buy-ins-trumps-new-economic-playbook/slideshow/123518752.cms",
            "description": "U.S. President Donald Trump has launched an unconventional strategy by converting government grants into equity stakes in private companies. The most recent example is a near-10% stake in Intel, announced on Friday, signaling a sharp shift in Washington’s approach.",
            "pubDate": "2025-08-26T06:49:37.166821"
        },
        {
            "title": "GST rate cut: Car and bike buyers hit pause button as auto stocks rev up for festive bonanza",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-rate-cut-car-and-bike-buyers-hit-pause-button-as-auto-stocks-rev-up-for-festive-bonanza/articleshow/123518449.cms",
            "description": "Indian auto sales are slowing as buyers delay purchases ahead of a possible GST rate cut of up to 10% in September, which could spark a strong festive demand surge; Jefferies expects 2Ws and small PV makers to be the biggest beneficiaries.",
            "pubDate": "2025-08-26T06:49:37.166937"
        },
        {
            "title": "Vikram Solar shares zoom 9% after a muted D-Street debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikram-solar-shares-zoom-9-after-a-muted-d-street-debut/articleshow/123518382.cms",
            "description": "Vikram Solar shares: The stock rallied 9.2% on Tuesday, trading 12% above its IPO price as strong revenue outlook and robust order book revived investor interest after a muted debut.",
            "pubDate": "2025-08-26T06:49:37.167038"
        },
        {
            "title": "Buffett slams brakes on railroad merger hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buffett-slams-brakes-on-railroad-merger-hopes/slideshow/123518328.cms",
            "description": "Berkshire Hathaway has put an end to speculation, with Warren Buffett confirming that the company is not looking to buy another railroad. (Source: Reuters)",
            "pubDate": "2025-08-26T06:49:37.167130"
        },
        {
            "title": "Shreeji Shipping Global shares list at 8% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shreeji-shipping-global-shares-list-at-8-premium-over-ipo-price/articleshow/123517807.cms",
            "description": "Shreeji Shipping Global shares listed on the stock exchanges. The stock opened above its IPO price on both BSE and NSE. The IPO was heavily subscribed by various investor categories. The company plans to use the IPO proceeds for expansion and debt repayment. Shreeji Shipping Global specializes in dry-bulk cargo operations with a large fleet of vessels and equipment.",
            "pubDate": "2025-08-26T06:49:37.167339"
        },
        {
            "title": "Lower GST will re-energise agri and rural sectors: Ashi Anand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lower-gst-will-re-energise-agri-and-rural-sectors-ashi-anand/articleshow/123519391.cms",
            "description": "Ashi Anand suggests a GST cut on farm equipment could boost India's rural economy. He believes large-scale tariffs on medicines are unlikely, despite US policy unpredictability. Investors should be selective in pharma, focusing on biosimilars and CRAMS. GLP therapies present a major opportunity as patents expire. CDMOs and branded generic players are well-positioned to capitalize on this trend.",
            "pubDate": "2025-08-26T06:59:34.763988"
        },
        {
            "title": "India must navigate US tariffs through global trade diversification: Geoff Dennis",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-must-navigate-us-tariffs-through-global-trade-diversification-geoff-dennis/articleshow/123519339.cms",
            "description": "India faces a major test as the US moves to impose 50% tariffs, shifting the issue from trade to geopolitics. While India explores diversification with Europe, ASEAN, and others, investor sentiment has weakened. Experts stress India’s strong fundamentals but caution that diplomatic strategy will be critical to safeguard growth.",
            "pubDate": "2025-08-26T06:59:34.764109"
        },
        {
            "title": "Indian IT firms face structural headwinds, Gen AI yet to deliver: HSBC India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-it-firms-face-structural-headwinds-gen-ai-yet-to-deliver-hsbc-india/articleshow/123519978.cms",
            "description": "Indian IT firms are unlikely to regain double-digit growth, with HSBC projecting long-term expansion of 4–5% due to structural headwinds, AI’s deflationary impact, and reliance on US/European demand.",
            "pubDate": "2025-08-26T07:35:04.825170"
        },
        {
            "title": "Gem Aromatics shares surge another 5% after modest listing on NSE, BSE. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gem-aromatics-shares-surge-another-5-after-modest-listing-on-nse-bse-what-should-investors-do/articleshow/123519883.cms",
            "description": "Gem Aromatics' shares experienced a surge, reaching a day's high of Rs 349 on the BSE after a debut with a modest premium. The IPO, which was subscribed 30.45 times, saw significant interest from institutional and retail investors. Funds raised will be used to repay borrowings and for general corporate purposes.",
            "pubDate": "2025-08-26T07:35:04.825293"
        },
        {
            "title": "Debt-free smallcaps surge: 9 multibaggers gain 70–130% in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/debt-free-smallcaps-surge-9-multibaggers-gain-70130-in-fy26/slideshow/123519672.cms",
            "description": "In the volatile world of smallcap investing, companies with little or no debt often command greater investor trust. A clean balance sheet provides financial flexibility, lowers risk, and enhances resilience in uncertain markets. As of FY25, nearly 290 smallcap firms on the BSE—excluding financials—were either debt-free or had a debt-to-equity ratio below 0.20x. Their fiscal strength is already rewarding investors: in FY26, 24 such stocks have surged more than 50%. 9 standout names have delivered remarkable gains of 70–130%, with two doubling wealth to become multibaggers in just months. While low debt is a strong filter, investors should also weigh earnings, valuations, and growth drivers. For now, this space offers attractive, disciplined momentum opportunities.",
            "pubDate": "2025-08-26T07:35:04.825409"
        },
        {
            "title": "Markets to deliver 7-8%, GST cuts could spark consumption revival: HDFC Sec’s Varun Lohchab",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-to-deliver-7-8-gst-cuts-could-spark-consumption-revival-hdfc-secs-varun-lohchab/articleshow/123519739.cms",
            "description": "HDFC Sec’s Varun Lohchab sees Indian markets delivering steady but modest returns, with earnings growth sustaining in double digits and consumption set to recover gradually aided by GST and tax reforms.",
            "pubDate": "2025-08-26T07:35:04.825512"
        },
        {
            "title": "TACO trade crumbles: Trump's fresh 25% tariff hammer falls tonight as export stocks crash",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/taco-trade-crumbles-trumps-fresh-25-tariff-hammer-falls-tonight-as-export-stocks-crash/articleshow/123521705.cms",
            "description": "President Trump’s fresh 25% tariff on Indian goods, effective midnight, doubled the effective duty to 50%, triggering a market rout. The Sensex crashed over 600 points and the Nifty shed 1% as hopes of a reprieve faded. Export-driven sectors like textiles, fisheries, gems, and jewellery faced heavy selling, with India now among the most tariff-hit nations globally.",
            "pubDate": "2025-08-26T08:51:02.952951"
        },
        {
            "title": "Japan's Nikkei ends at over 2-week low as yen gains after Trump fires Fed's Cook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-over-2-week-low-as-yen-gains-after-trump-fires-feds-cook/articleshow/123520587.cms",
            "description": "Japan's Nikkei share average ended at a more than two-week low on Tuesday, as the yen strengthened after U.S. President Donald Trump fired a Federal Reserve governor.",
            "pubDate": "2025-08-26T08:51:02.953073"
        },
        {
            "title": "9 debt-free smallcaps rally up to 130% in FY26; 2 turn multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-debt-free-smallcaps-rally-up-to-130-in-fy26-2-turn-multibaggers/slideshow/123519672.cms",
            "description": "In the volatile world of smallcap investing, companies with little or no debt often command greater investor trust. A clean balance sheet provides financial flexibility, lowers risk, and enhances resilience in uncertain markets. As of FY25, nearly 290 smallcap firms on the BSE—excluding financials—were either debt-free or had a debt-to-equity ratio below 0.20x. Their fiscal strength is already rewarding investors: in FY26, 24 such stocks have surged more than 50%. 9 standout names have delivered remarkable gains of 70–130%, with two doubling wealth to become multibaggers in just months. While low debt is a strong filter, investors should also weigh earnings, valuations, and growth drivers. For now, this space offers attractive, disciplined momentum opportunities.",
            "pubDate": "2025-08-26T08:51:02.953180"
        },
        {
            "title": "Patel Retail shares fall 5% after strong listing on NSE and BSE. Should investors buy or sell?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patel-retail-shares-fall-5-after-strong-listing-on-nse-and-bse-should-investors-buy-or-sell/articleshow/123520533.cms",
            "description": "Patel Retail fell 5% to ₹290 after a strong debut but still trades 14% above its IPO price of ₹255; with a market cap of over ₹971 crore, analysts advise short-term investors to book profits.",
            "pubDate": "2025-08-26T08:51:02.953280"
        },
        {
            "title": "European shares fall on French political risks, Fed concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-fall-on-french-political-risks-fed-concerns/articleshow/123520524.cms",
            "description": "European shares dropped on Tuesday, led by losses in France as political uncertainty deepened in the country, while mounting concerns over the U.S. Federal Reserve's independence curbed appetite for riskier assets globally.",
            "pubDate": "2025-08-26T08:51:02.953378"
        },
        {
            "title": "Markets face 4% upside, 11% downside risk from current levels despite policy push: Amish Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-face-4-upside-11-downside-risk-from-current-levels-despite-policy-push-amish-shah/articleshow/123522694.cms",
            "description": "Despite policy support, India’s markets face limited upside of 4% and a potential 11% downside, says Amish Shah. Valuations, earnings downgrades, and US tariff risks weigh in. Investors are advised to play volatility, rotate sectors, and focus on IT, utilities, and select consumer discretionary stocks.",
            "pubDate": "2025-08-26T09:50:42.426501"
        },
        {
            "title": "F&O Radar| Deploy Broken Wing in Zydus Lifesciences to play bullish momentum for gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-broken-wing-in-zydus-lifesciences-to-play-bullish-momentum-for-gains/articleshow/123522192.cms",
            "description": "Zydus Lifesciences shares show bullish momentum, forming a weekly Inverted Head and Shoulders pattern with a breakout above Rs 1,050. Traders can consider deploying a Broken Wing strategy to capitalise on potential short-term gains, supported by rising RSI, strong EMAs, and key derivatives support and resistance",
            "pubDate": "2025-08-26T09:50:42.426630"
        },
        {
            "title": "50% US tariffs won't be a surprise, Indian markets to stay resilient: Sunil Subramaniam",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/50-us-tariffs-wont-be-a-surprise-indian-markets-to-stay-resilient-sunil-subramaniam/articleshow/123521983.cms",
            "description": "The US administration’s move to impose tariffs on Indian goods from tomorrow (August 27) won't come as a major shock to the markets, according to market expert Sunil Subramaniam.",
            "pubDate": "2025-08-26T09:50:42.426858"
        },
        {
            "title": "Ola Electric shares rally 7% on PLI nod for Gen 3 scooter portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-rally-7-on-pli-nod-for-gen-3-scooter-portfolio/articleshow/123521937.cms",
            "description": "Ola Electric shares surged following PLI certification for its Gen 3 scooter portfolio, covering seven models that form the bulk of sales. The certification makes the company eligible for incentives up to 18%, boosting margins, profitability, and prospects for sustainable growth from FY26.",
            "pubDate": "2025-08-26T09:50:42.426958"
        },
        {
            "title": "India’s NSE enters global top 10 exchanges ranking for the first time",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-nse-enters-global-top-10-exchanges-ranking-for-the-first-time/articleshow/123523629.cms",
            "description": "The National Stock Exchange of India (NSE) has entered the global top 10 list of exchanges for the first time, securing the ninth spot in Brand Finance’s latest “Exchanges 10 2025” report.",
            "pubDate": "2025-08-26T10:59:18.969776"
        },
        {
            "title": "Tariff jitters push markets in red, Rohit Srivastava warns against carrying long positions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-jitters-push-markets-in-red-rohit-srivastava-warns-against-carrying-long-positions/articleshow/123523508.cms",
            "description": "With tariff concerns pushing Indian markets lower, Rohit Srivastava advises traders to avoid long positions overnight. According to him, FMCG and autos offer some support, but weakness in IT, metals, and energy drags indices, as investors brace for volatility ahead of the tariff deadline.",
            "pubDate": "2025-08-26T10:59:18.969900"
        },
        {
            "title": "Jefferies affirms preference for BPCL in OMC Pack, maintains ‘Buy’ with Rs 410 target",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-affirms-preference-for-bpcl-in-omc-pack-maintains-buy-with-rs-410-target/articleshow/123524506.cms",
            "description": "Jefferies maintains a ‘Buy’ on BPCL with a Rs 410 target, citing strong earnings visibility, favorable valuations, and supportive crude price trends. HPCL faces higher risks due to ongoing projects and duty sensitivity. IOCL also rated Buy. Key risks include rising crude, excise hikes, and large new energy capex.",
            "pubDate": "2025-08-26T11:19:42.411349"
        },
        {
            "title": "Maruti Suzuki shares jump nearly 3%, hit 52-week high on e-Vitara launch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-shares-jump-nearly-3-hit-52-week-high-on-e-vitara-launch/articleshow/123524436.cms",
            "description": "Shares of Maruti Suzuki today jumped nearly 3% to hit a fresh 52-week high of Rs 14,825 on the NSE after India's largest passenger car maker flagged off its first Battery Electric Vehicle (BEV), e-Vitara in Gujarat.",
            "pubDate": "2025-08-26T11:19:42.411473"
        }
    ]
}