{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-15T04:51:33.999140",
    "items": [
        {
            "title": "Trump vs. Fed: The Battle Over Governor Lisa Cook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-vs-fed-the-battle-over-governor-lisa-cook/slideshow/123892207.cms",
            "description": "The Trump administration renewed its request to a federal appeals court to allow the firing of Federal Reserve Governor Lisa Cook. This move comes ahead of the Fed’s upcoming interest rate vote. The administration argues that Cook’s legal reasoning for remaining on the board is without merit. (Source: Reuters)",
            "pubDate": "2025-09-15T04:51:15.504140"
        },
        {
            "title": "5 FII-backed penny stocks surge up to 500% in one year. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-fii-backed-penny-stocks-surge-up-to-500-in-one-year-do-you-own-any/slideshow/123891862.cms",
            "description": "Even as broader smallcaps have struggled this year, a handful of penny stocks with tiny foreign institutional investor (FII) presence have turned into multibaggers over the past year. With gains ranging from 50-500%, these names have caught the eye of traders betting on high-risk, high-reward opportunities. Here are five such stocks that have quietly delivered massive returns.",
            "pubDate": "2025-09-15T04:51:15.504271"
        },
        {
            "title": "Rs 6 lakh crore boom in 1 month! How PM Modi's GST cuts shook the stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-6-lakh-crore-boom-in-1-month-how-pm-modis-gst-cuts-shook-the-stock-market/articleshow/123891542.cms",
            "description": "Prime Minister Narendra Modi's GST rationalization led to a Rs 6 lakh crore stock market rally. Auto and consumer durable stocks emerged as big winners. Small cars and two-wheelers now attract lower GST. Analysts predict a boost in consumption and economic growth. Companies anticipate increased sales volume, especially in economy segments. Experts see a potential 'Lollapalooza effect' on aggregate demand.",
            "pubDate": "2025-09-15T04:51:15.504380"
        },
        {
            "title": "Buy, Sell or Hold: Antique sees over 30% upside in HAL; HSBC upgrades NTPC to buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-antique-sees-over-30-upside-in-hal-hsbc-upgrades-ntpc-to-buy-rating/articleshow/123891517.cms",
            "description": "Brokerages are optimistic on select frontline stocks, emphasizing strong earnings visibility and long-term growth. Antique stays positive on HAL due to improving supply chains, while HSBC upgrades NTPC to Buy, citing expansion into battery storage, nuclear power, and capex clarity.",
            "pubDate": "2025-09-15T04:51:15.504482"
        },
        {
            "title": "Sensex falls over 50 pts, Nifty below 25,100 as IT weakness offsets gains in auto stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-and-nifty-50-open-flat-as-it-weakness-offsets-gains-in-auto-players/articleshow/123891213.cms",
            "description": "Indian stock markets, Sensex and Nifty, started the week cautiously. This mirrored a similar trend in Asian markets. Investors are awaiting the U.S. Federal Reserve's policy meeting. They also anticipate progress in India's trade talks with Washington. The Sensex closed slightly higher. The Nifty 50 also saw a marginal increase. Market participants are keenly observing global cues.",
            "pubDate": "2025-09-15T04:51:15.504582"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/123891430.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-09-15T04:51:15.504681"
        },
        {
            "title": "KRBL shares crash 13% after independent director quits over governance concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/krbl-shares-in-focus-as-independent-director-quits-over-governance-concerns/articleshow/123891498.cms",
            "description": "KRBL shares: Independent director Anil Kumar Chaudhary resigned, citing corporate governance concerns. He highlighted issues like inconsistent meeting records, withheld information, and unexplained write-offs that undermine oversight and stakeholder interests.",
            "pubDate": "2025-09-15T04:51:15.504831"
        },
        {
            "title": "Vedanta shares rise 2% as subsidiary settles long-standing EPC disputes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-as-subsidiary-settles-long-standing-epc-disputes/articleshow/123891481.cms",
            "description": "Vedanta's shares experienced a surge of 2.2% following its subsidiary, Talwandi Sabo Power Limited (TSPL), reaching a settlement agreement with SEPCO Electric Power Construction Corporation. This agreement resolves long-standing disputes related to EPC contracts for a 3x660 MW thermal power project, leading to the withdrawal of pending arbitration proceedings and strengthening TSPL's operational position.",
            "pubDate": "2025-09-15T04:51:15.504934"
        },
        {
            "title": "Tata Tech shares rise 3% after €75 million acquisition of Germany's ES-Tec Group",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-tech-shares-in-focus-as-75-million-acquisition-targets-earnings-boost/articleshow/123891428.cms",
            "description": "Tata Technologies will acquire Germany’s ES-Tec Group for €75 million in cash. The deal, expected to close by December 2025, will boost its earnings from the first full year and enhance its ER&D capabilities in next-gen mobility and systems engineering.",
            "pubDate": "2025-09-15T04:51:15.505031"
        },
        {
            "title": "GMDC, Hindustan Copper among 5 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-hindustan-copper-among-5-stocks-that-closed-above-vwap/slideshow/123891389.cms",
            "description": "On September 12, the closing prices of five stocks in the Nifty500 pack rallied more than 2% above their VWAP (Volume Weighted Average Price), according to technical scan data from stockedge.com. A move above the VWAP is often seen as a potential bullish signal.When the closing price rises above the VWAP, it indicates that the stock ended the day higher than its average traded price, with the average weighted by trading volume. This is generally interpreted by traders and investors as a sign of positive sentiment in the market.Stocks closing above VWAP on September 12:",
            "pubDate": "2025-09-15T04:51:15.505126"
        },
        {
            "title": "Info Edge shares in focus after whistleblower complaint at 99acres unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/info-edge-shares-in-focus-after-whistleblower-complaint-at-99acres-unit/articleshow/123891309.cms",
            "description": "Info Edge shares: A whistleblower complaint alleged policy breaches at its 99acres unit. An independent investigation has been launched, though the company said there’s no material financial impact.",
            "pubDate": "2025-09-15T04:51:15.505223"
        },
        {
            "title": "Sebi’s equity tag for REITs to help unlock liquidity, index entry, global capital flows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-equity-tag-for-reits-to-help-unlock-liquidity-index-entry-global-capital-flows/articleshow/123891246.cms",
            "description": "SEBI's reclassification of Indian REITs as equity instruments is poised to boost the real estate sector. This move aligns India with global practices, paving the way for index inclusion and increased institutional investment. The decision is expected to enhance liquidity, broaden investor participation, and attract significant capital inflows into the growing Indian real estate market.",
            "pubDate": "2025-09-15T04:51:15.505325"
        },
        {
            "title": "NBCC, HFCL, among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-hfcl-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123891229.cms",
            "description": "There was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5.5% as of September 12, as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-15T04:51:15.505421"
        },
        {
            "title": "RailTel shares rally 8% after bagging Rs 210 crore order from Bihar Education Council",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railtel-shares-in-focus-after-bagging-rs-210-crore-order-from-bihar-education-council/articleshow/123891175.cms",
            "description": "RailTel share price: RailTel has bagged a Rs 210 crore order from Bihar Education Project Council under the PM SHRI scheme to supply digital infrastructure and related services aimed at enhancing education quality in the state. The project is slated for completion by September 2026.",
            "pubDate": "2025-09-15T04:51:15.505518"
        },
        {
            "title": "RIL, SBI Life, IRCTC among 13 stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-sbi-life-irctc-among-13-stocks-showing-rsi-trending-up/slideshow/123891148.cms",
            "description": "A total of 13 stocks from the Nifty200 pack were highlighted in the RSI Trending Up scan on September 12, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-15T04:51:15.505611"
        },
        {
            "title": "Adani Power shares jump 3% after 25-year, 2,400 MW power supply deal with Bihar Govt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-in-focus-after-25-year-2400-mw-power-supply-seal-with-bihar-govt/articleshow/123890722.cms",
            "description": "Adani Power share price: Adani Power signed a 25-year power supply agreement with Bihar State Power Generation Company for a 2,400 MW ultra supercritical thermal power plant in Bhagalpur district.  The $3 billion DBFOO project is expected to strengthen Bihar’s power availability and generate thousands of jobs.",
            "pubDate": "2025-09-15T04:51:15.505722"
        }
    ]
}