{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-20T05:11:23.114061",
    "items": [
        {
            "title": "Japan's MUFG seals Rs 39,600 crore Shriram Finance Deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-mufg-seals-rs-39600-crore-shriram-finance-deal/articleshow/126088299.cms",
            "description": "Japan's MUFG Bank will invest ₹39,620 crore for a 20% stake in Shriram Finance. This is India's biggest foreign investment in financial services. The deal will strengthen Shriram Finance's capital and accelerate its growth. MUFG will appoint two directors to Shriram Finance's board. This partnership aims to leverage global expertise with local strength.",
            "pubDate": "2025-12-20T04:54:10.040197"
        },
        {
            "title": "TCS among ICICI Securities' top 5 bets with upside potential of up to 26% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-among-icici-securities-top-5-bets-with-upside-potential-of-up-to-26-in-1-year/slideshow/126088270.cms",
            "description": "ICICI Securities has outlined a long-term statistical roadmap for the Nifty, identifying a risk-reward range of 24,200 to 29,200 for CY-26. According to the brokerage, every major correction since COVID-19 has found stability around the 24,200 zone, making it a reliable support base.On the upside, historical price action shows that strong market phases have touched the upper statistical band. Based on this trend, ICICI Securities projects 29,500 as a realistic upside level if bullish momentum sustains through 2026. Given this backdrop, ICICI Securities has also recommended its top 5 bets for a horizon of 12 months and with an upside potential of up to 26%:",
            "pubDate": "2025-12-20T04:54:10.040328"
        },
        {
            "title": "Stock market meets physics: 5 laws that explain why prices move the way they do",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-meets-physics-5-laws-that-explain-why-prices-move-the-way-they-do/articleshow/126088189.cms",
            "description": "Ambit Capital has drawn parallels between stock markets and classical physics, outlining five laws that explain price behaviour. From inertia and momentum to mean reversion and valuation resistance, the framework helps investors decode why some stocks outperform while others stagnate, and why rich valuations often cap long-term returns.",
            "pubDate": "2025-12-20T04:54:10.040435"
        },
        {
            "title": "Wall St ends higher as tech rally continues, led by Micron",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-ends-higher-as-tech-rally-continues-led-by-micron/articleshow/126088101.cms",
            "description": "U.S. stocks closed higher Friday, with technology shares like Micron and Nvidia leading the rebound after a rocky week. This surge offset declines in consumer stocks such as Nike, which experienced a significant drop. The market also saw optimism around potential Federal Reserve interest rate cuts and the traditional \"Santa Claus rally.\"",
            "pubDate": "2025-12-20T04:54:10.040534"
        },
        {
            "title": "European shares close at record high driven by defence stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-close-at-record-high-driven-by-defence-stocks/articleshow/126088074.cms",
            "description": "European stocks hit a record high Friday, buoyed by defence and insurance sectors, ending the year on an optimistic note. The STOXX 600 index saw significant gains, driven by strong performances in banking and aerospace. This surge follows a week of tech-led losses, with investors now favouring European markets over U.S. tech giants amid falling interest rates.",
            "pubDate": "2025-12-20T04:54:10.040630"
        },
        {
            "title": "Wall Street Week Ahead: A Santa rally? Investors hope for year-end gains to cap strong 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-a-santa-rally-investors-hope-for-year-end-gains-to-cap-strong-2025/articleshow/126088034.cms",
            "description": "U.S. stocks face year-end turbulence despite solid 2025 performance, with AI spending scrutiny and shifting Fed rate cut expectations driving market swings. While tame inflation data offers some optimism for a Santa Claus rally, investors are also digesting delayed economic reports and considering profit-taking after a strong year.",
            "pubDate": "2025-12-20T04:54:10.040727"
        },
        {
            "title": "Piramal Finance to exit Shriram Life Insurance Company",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/piramal-finance-to-exit-shriram-life-insurance-company/articleshow/126088410.cms",
            "description": "Piramal Finance is selling its 14.72% stake in Shriram Life Insurance to Sanlam Emerging Markets for ₹600 crore. This move aligns with Piramal's strategy to exit non-core assets and reinvest in its lending business. The transaction is expected to close by March 31, 2026, subject to regulatory approvals.",
            "pubDate": "2025-12-20T04:54:10.040826"
        },
        {
            "title": "Inox Green to Acquire Macquarie's Renewable Platform Vibrant",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-green-to-acquire-macquaries-renewable-platform-vibrant/articleshow/126088653.cms",
            "description": "Inox Green Energy Services is set to acquire Vibrant Energy, an Indian renewable energy platform. The deal values Vibrant Energy at around $200 million. This acquisition will significantly expand Inox Green's presence in India's growing renewable energy sector. Vibrant Energy manages a substantial renewable portfolio and has a strong client base, including Amazon.",
            "pubDate": "2025-12-20T05:11:21.846106"
        },
        {
            "title": "Most valued AMC ICICI Pru pips HDFC MF with 20% pop",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/most-valued-amc-icici-pru-pips-hdfc-mf-with-20-pop/articleshow/126088526.cms",
            "description": "ICICI Prudential Asset Management made its stock market debut on Friday. The company's shares listed at a significant premium. This listing propelled ICICI Prudential AMC to become the most valuable asset manager in India. Its market capitalization surpassed that of HDFC AMC. Analysts suggest a medium to long-term view for investors who received allotments.",
            "pubDate": "2025-12-20T05:11:21.846252"
        }
    ]
}