{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-08T08:25:34.665570",
    "items": [
        {
            "title": "For investors with a 2030 perspective: A combination of stocks with an upside potential of up to 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-a-2030-perspective-a-combination-of-stocks-with-an-upside-potential-of-up-to-43/articleshow/125177063.cms",
            "description": "First, a reality check: If you are bothered by what is happening to the Nifty and Sensex every day, remember that times are probably going to remain tough. As the New World Order takes shape, volatility is going to be part and parcel of the stock market. So, take the long view. And choose your company or sector carefully. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks, along with detailed company analysis focusing on five key components: earnings, fundamentals, relative valuation, risk, and price momentum to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2025-11-08T03:11:46.397997"
        },
        {
            "title": "Scared of the AI bubble? Hedge your fears with D-St bets: HSBC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/scared-of-the-ai-bubble-hedge-your-fears-with-d-st-bets-hsbc/articleshow/125178737.cms",
            "description": "HSBC sees India as a safe haven amid global AI market excitement. Indian stocks are currently underrepresented in emerging market portfolios. Increased investment could significantly benefit India. HSBC is positive on Indian equities, setting a 2026 Sensex target of 94,000. Valuations are now less of a concern. India offers value compared to Chinese equities.",
            "pubDate": "2025-11-08T05:45:09.206409"
        },
        {
            "title": "Time Technoplast floats QIP for Rs 800 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-technoplast-floats-qip-for-rs-800-crore/articleshow/125178646.cms",
            "description": "Time Technoplast, a polymer product maker, is raising funds through a qualified institutional placement. The company plans to raise approximately ₹800 crore. This move will dilute nearly 8.8% of its equity. The issue opens on November 6 at a floor price of ₹211.7 per share. The indicative issue price is ₹201.12 per share.",
            "pubDate": "2025-11-08T05:45:09.206538"
        },
        {
            "title": "Vanguard’s India Portfolio Shines: 10 Stocks rally up to 90% in FY26. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vanguards-india-portfolio-shines-10-stocks-rally-up-to-90-in-fy26-do-you-own-any/slideshow/125178413.cms",
            "description": "Vanguard Fund’s portfolio is making a powerful statement in the Indian equity market — the numbers speak for themselves. Ranked among the top five active foreign institutional investors (FIIs) in the country, Vanguard has built a sizable portfolio of Indian equities through its global funds. As of November 7, 2025, its holdings in 41 BSE-listed companies are valued at a staggering Rs 65,897 crore, marking a sharp 53% surge from Rs 43,047 crore in the March quarter.An ETMarkets analysis shows that 11 of its key holdings have delivered returns between 20% and 90% in FY26 so far, while 17 stocks have posted double-digit gains. The fund also added five new stocks to its portfolio during the September quarter. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-11-08T05:45:09.206641"
        },
        {
            "title": "Tailwinds for rally fade; focus on Bihar results, US equation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tailwinds-for-rally-fade-focus-on-bihar-results-us-equation/articleshow/125178123.cms",
            "description": "After an impressive surge, Indian stock markets took a breather on Friday, with both Nifty and Sensex registering slight declines. Experts indicate this pause is due to a temporary slowdown in buying interest, lacking robust bullish signals. Market sentiments were also swayed by remarks from the US Federal Reserve.",
            "pubDate": "2025-11-08T05:45:09.206740"
        },
        {
            "title": "Europe's STOXX 600 ends volatile week lower; ITV soars",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-600-ends-volatile-week-lower-itv-soars/articleshow/125177864.cms",
            "description": "European shares concluded a volatile week lower, with technology stocks leading the decline due to persistent valuation concerns and broader risk-off sentiment stemming from the U.S. Automakers saw gains, while broadcaster ITV surged on potential sale talks. Investors also assessed corporate earnings, which showed some positive signs despite individual company setbacks.",
            "pubDate": "2025-11-08T05:45:09.206838"
        },
        {
            "title": "Nasdaq posts worst week since April amid AI rally jitters, US yields slip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-posts-worst-week-since-april-amid-ai-rally-jitters-us-yields-slip/articleshow/125177839.cms",
            "description": "Indian markets saw a dip mirroring global trends. The Nasdaq experienced its largest weekly fall since April due to concerns over artificial intelligence stock sustainability. U.S. Treasury yields also declined. China's trade data showed the impact of tariffs. Bitcoin saw a weekly decline but gained on the day. Major U.S. indexes recovered some losses late in the session.",
            "pubDate": "2025-11-08T05:45:09.206932"
        },
        {
            "title": "Wall Street Week Ahead: Investors watching US economic signs as market pulls back, tech teeters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-watching-us-economic-signs-as-market-pulls-back-tech-teeters/articleshow/125177792.cms",
            "description": "Indian investors are closely watching U.S. economic signals amid concerns over a cooling labor market and tech stock volatility. Worrisome jobs data and a prolonged government shutdown are creating uncertainty, prompting a cautious approach. Attention now shifts to secondary economic reports and upcoming corporate earnings, particularly from tech giants like Nvidia, for further clues on market direction.",
            "pubDate": "2025-11-08T05:45:09.207052"
        },
        {
            "title": "Hindalco to infuse $750 million equity into US unit Novelis",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindalco-to-infuse-750-million-equity-into-us-unit-novelis/articleshow/125177892.cms",
            "description": "Hindalco Industries will infuse $750 million equity and raise debt to support its US arm Novelis after a fire hit its Oswego unit. The funds will aid cash flow and rising costs at the $5 billion Bay Minette plant. A second $1.5 billion phase is planned to double aluminium capacity.",
            "pubDate": "2025-11-08T05:45:09.207240"
        },
        {
            "title": "Quest 2030: SBI aims to be among world's top 10 banks by mcap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/three-indian-banks-to-be-among-global-top-10-lenders-in-m-cap-by-2030-cs-setty/articleshow/125178279.cms",
            "description": "Chairman CS Setty said that the goal of the bank, the biggest government asset by market capitalisation, is boosting its value further. While HDFC Bank has in the past broken into the top 10 leaderboard, it might find future company in ICICI Bank and SBI. Setty was speaking to reporters on the sidelines after the completion of the 12th Banking and Economic Conclave organised by SBI.",
            "pubDate": "2025-11-08T05:45:09.207780"
        },
        {
            "title": "Market wrap: Red reigns on D-Street as 347 of BSE 500 stocks see up to 12% WoW fall. IT, power scrips among worst hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-red-reigns-on-d-street-as-347-of-bse-500-stocks-see-up-to-12-wow-fall-it-power-scrips-among-worst-hit/articleshow/125180510.cms",
            "description": "Indian markets ended the week on a weak note, with the BSE 500 index down 0.8% as 347 stocks saw declines up to 12% WoW, led by IT, power, and FMCG sectors. FII selling and cautious investor sentiment continued to pressure the market, while DIIs partially cushioned the fall.",
            "pubDate": "2025-11-08T08:25:27.802583"
        },
        {
            "title": "Concurrent Losers: 9 stocks decline for 5 consecutive sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-losers-9-stocks-decline-for-5-consecutive-sessions/slideshow/125180447.cms",
            "description": "Over the last five trading sessions ending November 7, the Sensex benchmark index declined by 1.4%, settling at 83,216. The index registered losses in four of the five sessions. During this period, nine stocks from the BSE200 index fell in all five consecutive sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-11-08T08:25:27.802704"
        },
        {
            "title": "Smallcap rally: Thangamayil Jewellery and CCL Products among weekly top 10 performers, soar up to 56%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-rally-thangamayil-jewellery-and-ccl-products-among-weekly-top-10-performers-soar-up-to-56/slideshow/125180104.cms",
            "description": "Smallcap stocks traded under pressure this week as the BSE Smallcap index closed with a decline of 1.5% . Nearly 76% stocks in the index settled in the red. But 20 stocks witnessed strong investor action, delivering weekly gains up to 56%. Here are the top 10 performers:",
            "pubDate": "2025-11-08T08:25:27.802808"
        },
        {
            "title": "India is the engine of the global growth train in the days to come, says Nilesh Shah at Kotak Insight Summit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-is-the-engine-of-the-global-growth-train-in-the-days-to-come-says-nilesh-shah-at-kotak-insight-summit/articleshow/125179686.cms",
            "description": "India is a global growth engine, defying economic norms. Foreigners hold majority stakes in top companies, and the nation welcomes global tech giants. Despite significant gold imports, India is a leader in space exploration and AI accessibility. Its healthcare sector showcases both shortages and global dominance in generic drug manufacturing, proving India's unique, paradoxical strength.",
            "pubDate": "2025-11-08T08:25:27.802932"
        },
        {
            "title": "High-Conviction Shuffle: InCred Equities adds 3 new stocks to its top picks. How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-conviction-shuffle-incred-equities-adds-3-new-stocks-to-its-top-picks-how-many-do-you-own/slideshow/125179561.cms",
            "description": "Domestic brokerage firm InCred Equities has reshuffled its high-conviction stock list, adding three new names while dropping an equal number from diverse sectors. The move comes amid a festive demand surge in October 2025, bolstered by the recent GST rate cut, which helped drive peak retail sales across key consumer categories such as automobiles and electronics. GST collections rose 5% year-on-year, reflecting robust consumption trends. Meanwhile, new project proposals also saw a sharp rebound, doubling month-on-month to Rs 3.1 trillion in October and extending the steady recovery from the July 2025 lows. Here’s a look at the latest inclusions and exits.",
            "pubDate": "2025-11-08T08:25:27.803031"
        },
        {
            "title": "Lenskart, PhysicsWallah, and Groww: GMP trends suggest up to 22% listing gains for 9 IPOs next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-physicswallah-and-groww-gmp-trends-suggest-up-to-22-listing-gains-for-9-ipos-next-week/slideshow/125179173.cms",
            "description": "The IPO frenzy continues to grip Dalal Street as three of India’s most talked-about new-age companies -- Lenskart, PhysicsWallah, and Groww -- prepare for listing. Grey market trends suggest that next week’s listings could deliver returns ranging from 4% to as high as 22%, depending on investor sentiment and market momentum.Here’s a look at the week’s key IPOs and what the grey market is indicating:",
            "pubDate": "2025-11-08T08:25:27.803130"
        }
    ]
}