{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-16T11:22:32.801109",
    "items": [
        {
            "title": "L&T Tech Q2 Results: Net profit rises 2% YoY to Rs 320 crore, revenue jumps 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-tech-q2-results-net-profit-rises-2-yoy-to-rs-320-crore-revenue-jumps-8/articleshow/114283344.cms",
            "description": "Revenue from operations during the reporting period grew by 8% year-on-year to Rs 2,573 crore, up from Rs 2,386 crore in the same period last year.",
            "pubDate": "2024-10-16T11:07:27.395048"
        },
        {
            "title": "Wipro Q2 Results Preview: Revenue seen down up to 2% YoY, Q3 CC guidance at -1% to 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q2-results-preview-revenue-seen-down-up-to-2-yoy-q3-cc-guidance-at-1-to-1/articleshow/114277297.cms",
            "description": "Wipro's Q2 earnings are under scrutiny, with various brokerages providing mixed forecasts. JM Financial expects a 1.7% YoY revenue decline to Rs 22,134 crore but a 19% PAT increase. Sharekhan predicts a slight revenue rise, while Axis Securities anticipates a drop. Nuvama expects a minor revenue dip but a PAT increase of over 12%. Key focus areas include management commentary and future growth guidance.",
            "pubDate": "2024-10-16T11:07:27.395163"
        },
        {
            "title": "South Indian Bank Q2 Results: Profit rises 18% YoY to Rs 325 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/south-indian-bank-q2-results-profit-rises-18-yoy-to-rs-325-crore/articleshow/114276745.cms",
            "description": "Total income increased to Rs 2,804 crore during the quarter under review, as against Rs 2,485 crore in the same period last year, South Indian Bank said in a regulatory filing.",
            "pubDate": "2024-10-16T11:07:27.395268"
        },
        {
            "title": "Axis Bank Q2 results preview: Double-digit NII growth may drive PAT higher by 8% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q2-preview-double-digit-nii-growth-may-drive-pat-higher-by-8-yoy/articleshow/114273091.cms",
            "description": "Axis Bank is predicted to report an 8% increase in net profit for Q2 FY24, driven by a 10% rise in net interest income and a reduction in slippages on a sequential basis. Loan growth is expected at 11% year-on-year, while slippages are projected to increase by 29% year-on-year.",
            "pubDate": "2024-10-16T11:07:27.395379"
        },
        {
            "title": "LTIMindtree Q2 results preview: Strong sequential CC growth seen; margins to expand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ltimindtree-q2-preview-strong-sequential-cc-growth-seen-revival-in-bfsi-margins-to-expand/articleshow/114272643.cms",
            "description": "LTIMindtree is projected to show strong sequential revenue growth driven by the BFSI vertical and a revival in discretionary spending. Analysts foresee a 3% QoQ rise in constant currency terms for Q2 and expect EBIT margins to improve due to the absence of visa costs.",
            "pubDate": "2024-10-16T11:07:27.395501"
        },
        {
            "title": "Infosys Q2 results preview: PAT may rise 11% YoY; co may raise FY25 guidance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q2-preview-pat-may-rise-11-yoy-on-deals-ramp-up-co-may-raise-fy25-guidance/articleshow/114272085.cms",
            "description": "Infosys is projected to report an 11% YoY increase in PAT for Q2, driven by mega-deal ramp-ups and strong demand in financial services. Revenue is expected to grow around 5% YoY, with new financial guidance for FY25 potentially raised to 4-5% in constant currency terms.",
            "pubDate": "2024-10-16T11:07:27.395601"
        },
        {
            "title": "Q2 preview: Another weak quarter expected for banks. Top stocks to buy ahead of results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-preview-another-weak-quarter-expected-for-banks-top-stocks-to-buy-ahead-of-results/articleshow/114270142.cms",
            "description": "Banks are expected to show weak earnings growth in Q2, with private banks performing slightly better due to higher fees and lower provisions. Loan growth remains slow, impacting net interest income. Top stock picks are ICICI Bank, Axis Bank, and SBI due to their strong growth and asset quality.",
            "pubDate": "2024-10-16T11:07:27.395701"
        },
        {
            "title": "Q2 results today: Bajaj Auto among 19 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-bajaj-auto-among-19-companies-to-announce-earnings-on-wednesday/articleshow/114266982.cms",
            "description": "Bajaj Auto is anticipated to showcase a 24-29% year-on-year revenue growth for Q2, driven by higher volumes and increased average selling prices, with PAT growth estimated at 22-24%. Other companies reporting results today include Mphasis, Crisil, and South Indian Bank.",
            "pubDate": "2024-10-16T11:07:27.395800"
        },
        {
            "title": "Chipmaker ASML shares fall 15% after forecast cut in Q3 earnings published early due to technical error",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/asml-cuts-forecasts-in-q3-earnings-published-early-shares-fall-15/articleshow/114258593.cms",
            "description": "Computer chip equipment maker ASML on Tuesday reported weak bookings and cut 2025 sales forecasts in third quarter earnings published early on its website, sending its shares down 15% by 1500 GMT.",
            "pubDate": "2024-10-16T11:07:27.395895"
        },
        {
            "title": "Rallis India Q2 Results: Net profit rises 19.50% YoY to Rs 98 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rallis-india-q2-results-net-profit-rises-19-50-yoy-to-rs-98-crore/articleshow/114256371.cms",
            "description": "Rallis India, a subsidiary of Tata Chemicals, on Tuesday reported a 19.51 per cent growth in net profit during the quarter ending September 30 to Rs 98 crore compared to the same period in the previous financial year.",
            "pubDate": "2024-10-16T11:07:27.395998"
        },
        {
            "title": "Goldman Sachs Q3 profit beats estimates on investment banking strength",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/goldman-sachs-q3-profit-beats-estimates-on-investment-banking-strength/articleshow/114254611.cms",
            "description": "Goldman Sachs' third-quarter profit beat estimates, fueled by a rebound in bond sales, stock offerings and mergers, sending its shares up more than 3% in premarket trading.",
            "pubDate": "2024-10-16T11:07:27.396098"
        },
        {
            "title": "Citigroup Q3 profit beats estimates on investment banking boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/citigroup-profit-beats-estimates-on-investment-banking-boost/articleshow/114254450.cms",
            "description": "Citigroup posted a smaller-than-expected drop in profit for the third quarter thanks to gains in investment banking, sending its shares more than 2% higher in premarket trading on Tuesday.",
            "pubDate": "2024-10-16T11:07:27.396191"
        },
        {
            "title": "HDFC AMC Q2 Results: Net profit rises 32% YoY to Rs 577 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-amc-q2-results-net-profit-rises-32-yoy-to-rs-577-crore/articleshow/114246699.cms",
            "description": "HDFC Asset Management Company (AMC) on Tuesday reported a 32 per cent year-on-year growth in profit after tax (PAT) to Rs 576.61 crore for the three months ended September 2024. The HDFC AMC's profit after tax stood at Rs 436.52 crore in the same quarter of the preceding financial year (FY24).",
            "pubDate": "2024-10-16T11:07:27.396288"
        },
        {
            "title": "Bajaj Auto Q2 Results Preview: Robust volumes to drive revenue growth by up to 29% YoY. PAT may jump by up to 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q2-results-preview-robust-volumes-to-drive-revenue-growth-by-up-to-29-yoy-pat-may-jump-by-up-to-24/articleshow/114246432.cms",
            "description": "Bajaj Auto is expected to report a 24%-29% YoY growth in September quarter revenue, led by robust volume uptick and ASP increase. Revenue is estimated in the range of Rs 13,336-13,545 crore. YoY net profit (adjusted) growth is likely to be at 22%-24%, putting PAT in the range of Rs 2,246-2,275 crore. Kotak Equities has the highest revenue estimates, while Yes Securities is most bullish on PAT.",
            "pubDate": "2024-10-16T11:07:27.396385"
        },
        {
            "title": "Bank of Maharashtra Q2 results: Profit jumps 44% YoY to Rs 1,327 crore; NII rises 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-maharashtra-q2-results-profit-jumps-44-yoy-to-rs-1327-crore-nii-rises-15/articleshow/114245185.cms",
            "description": "Bank of Maharashtra reported a 44% YoY jump in net profit to Rs 1,327 crore in Q2FY25. Net interest income grew 15.4% to Rs 2,807 crore. Gross NPAs declined to 1.84% and net NPAs fell to 0.20% as of September 30, 2024.",
            "pubDate": "2024-10-16T11:07:27.396496"
        },
        {
            "title": "HDFC Life Q2 Results: Net profit rises 15% YoY to Rs 433 cr; net premium income up 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-life-q2-results-net-profit-rises-15-yoy-to-rs-433-cr-net-premium-income-up-12/articleshow/114244149.cms",
            "description": "Leading insurer HDFC Life reported a 15% increase in standalone net profit for the second quarter, reaching ₹433 crore, up from ₹377 crore in the same period last year.",
            "pubDate": "2024-10-16T11:07:27.396599"
        },
        {
            "title": "Bajaj Auto Q2 Results: PAT jumps 9% YoY to Rs 2,005 crore, revenue zooms 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q2-results-pat-jumps-9-yoy-to-rs-2005-crore-revenue-zooms-22/articleshow/114283757.cms",
            "description": "The company reported revenue from operations at Rs 13,127 crore, which was 22% higher than Rs 10,777 crore reported in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-16T11:22:31.364243"
        },
        {
            "title": "L&T Technology Services to give Rs 17/share dividend, sets record date on October 25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-technology-services-to-give-rs-17/share-dividend-sets-record-date-on-october-25/articleshow/114283431.cms",
            "description": "Midcap IT company L&T Technology Services on Wednesday announced an interim dividend of Rs 17 per share and has set the record date on October 25, 2024.",
            "pubDate": "2024-10-16T11:22:31.364360"
        }
    ]
}