{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-15T00:34:10.898040",
    "items": [
        {
            "title": "RIL Q2 Results: 5 top takeaways every investor should take note of",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q2-results-from-earnings-to-new-business-update-here-are-top-5-takeaways/articleshow/114224136.cms",
            "description": "Reliance announced that its first new energy giga-factory is expected to start producing solar PV modules by the end of the year. Chairman Mukesh Ambani mentioned that the new energy business, with its diverse range of renewable solutions, including solar, energy storage systems, green hydrogen, bio-energy, and wind, is set to become a major player in the global clean energy transition.",
            "pubDate": "2024-10-15T00:33:55.617054"
        },
        {
            "title": "Reliance Retail sees 3.5% revenue decline amid weak demand in fashion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-retail-sees-3-5-revenue-decline-amid-weak-demand-in-fashion/articleshow/114223196.cms",
            "description": "Reliance Retail's revenue declined by 3.5% in Q2 due to weak fashion demand and a strategic approach in its wholesale business. Despite the fall, the company opened 464 new stores, pushing total retail space to 79.4 million square feet, while its net profit increased by 1%.",
            "pubDate": "2024-10-15T00:33:55.617178"
        },
        {
            "title": "RIL Q2 PAT dips 5% YoY to Rs 16,563 cr, but beats estimates; Jio profit jumps 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q2-pat-dips-5-yoy-to-rs-16563-cr-but-beats-estimates-jio-profit-jumps-23/videoshow/114222982.cms",
            "description": "Mukesh Ambani-owned Reliance Industries Ltd (RIL) on Monday reported a 5% decline in its consolidated net profit to Rs 16,563 crore for the quarter ended September 2024. The same stood at Rs 17,394 crore in the year-ago period.",
            "pubDate": "2024-10-15T00:33:55.617281"
        },
        {
            "title": "Angel One Q2 results: Cons PAT jumps 39% YoY to Rs 423 crore, revenue up 44.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/angel-one-q2-results-cons-pat-jumps-39-yoy-to-rs-423-crore-revenue-up-44-5/articleshow/114222803.cms",
            "description": "Angel One reported a consolidated net profit of Rs 423 crore in Q2FY25, up 39% from Q2FY24. Total revenue from operations stood at Rs 1,515 crore, up 44.5% YoY. On a sequential basis, PAT was up 45% from Q1FY25. Consolidated total gross revenues for the reported quarter stood at Rs 1516 crore versus Rs 1,410 crore in Q1FY25, a growth of 7.5% QoQ",
            "pubDate": "2024-10-15T00:33:55.617382"
        },
        {
            "title": "Reliance Retail Q2 Results: Profit rises 1.3% YoY to Rs 2,836 crore, revenue declines by 3.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-retail-q2-results-profit-rises-1-3-yoy-to-rs-2836-crore-revenue-declines-by-3-5/articleshow/114215152.cms",
            "description": "Reliance Retail Q2 Results: Company experienced a 3.5% decline in revenue, reaching Rs 66,502 crore compared to Rs 68,937 crore in the same quarter last year. This dip was attributed to weaker demand in the fashion and lifestyle sector, along with a strategic focus on streamlining operations and adjusting its B2B approach to boost margins. Despite this, the retail arm still generated a substantial gross revenue of Rs 76,302 crore, though this figure also represents a 1.1% drop year-on-year.",
            "pubDate": "2024-10-15T00:33:55.617482"
        },
        {
            "title": "Reliance Jio Q2 Results: Profit jumps 23% YoY to Rs 6,539 crore, revenue up 18%; ARPU rises 7% to Rs 195.1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-jio-q2-results-profit-jumps-23-yoy-to-rs-6539-crore-revenue-up-18/articleshow/114221821.cms",
            "description": "Reliance Jio Q2 Results 2024: Reliance Jio Infocomm on Monday reported a 23.4% jump in its September quarter consolidated net profit at Rs 6,539 crore versus Rs 5,299 crore reported by the company in the year ago period. The revenue from operations stood at Rs 31,709 crore, higher by 18% over Rs 26,875 posted by the company in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-15T00:33:55.617584"
        },
        {
            "title": "RIL Q2 Results: Net profit falls 5% YoY to Rs 16,563 crore, but beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q2-results-net-profit-falls-5-yoy-to-rs-16563-crore-but-beats-estimates/articleshow/114215198.cms",
            "description": "Reliance Industries Q2 Results: The company exceeded profit forecasts in the second quarter, despite a marginal 0.2% YoY revenue growth to Rs 2.35 lakh crore and a 2% decline in EBITDA.  The company's profit beat the ET Now poll estimate of Rs 15,716 crore, signalling strength despite the slight dip in revenue and EBITDA.  EBITDA margins also decreased by 50 basis points to 17%.",
            "pubDate": "2024-10-15T00:33:55.617686"
        },
        {
            "title": "HCL Tech Q2 Results: PAT beats estimates, rises 10.5% YoY to Rs 4,235 cr; revenue up 8.2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-q2-results-pat-beats-estimates-rises-10-5-yoy-to-rs-4235-cr-revenue-up-8-2/videoshow/114221303.cms",
            "description": "India's third largest IT company by way of market capitalisation HCL Technologies on Monday reported a 10.5% jump in its September quarter consolidated net profit to Rs 4,235 crore, up from Rs 3,832 reported by the company in the year-ago period.",
            "pubDate": "2024-10-15T00:33:55.617782"
        },
        {
            "title": "HCL Tech Q2 Results: Cons PAT jumps 10.5% YoY to Rs 4,235 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-q2-results-cons-pat-jumps-10-5-to-rs-4235-crore-beats-estimates/articleshow/114215076.cms",
            "description": "HCL Tech Q2 Results: Company exceeded expectations with an 8.2% YoY revenue increase to Rs 28,862 crore and a 10.5% jump in profit to Rs 4,235 crore.  Both figures surpassed analyst estimates.  The company projects continued growth, forecasting a 3.5%-5% rise in revenue and an 18%-19% EBIT margin for the coming year.  Chairperson Roshni Nadar Malhotra emphasized HCL Tech's commitment to sustainable growth and upskilling its workforce in next-generation technologies.",
            "pubDate": "2024-10-15T00:33:55.617903"
        },
        {
            "title": "HCL Tech declares interim dividend of Rs 12 per share, fixes record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-declares-interim-dividend-of-rs-12-per-share-fixes-record-date/articleshow/114218641.cms",
            "description": "HCL Tech Interim Dividend: The Board of HCL Tech on Monday declared an interim dividend of Rs 12 per share for the financial year 2024-25. The company has fixed a record date as October 22 for the same.",
            "pubDate": "2024-10-15T00:33:55.618004"
        },
        {
            "title": "Sterling & Wilson Q2 Results: Co reports Rs 8.6 crore net profit, revenue jumps 36% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sterling-wilson-q2-results-co-reports-rs-8-6-crore-net-profit-revenue-jumps-36-yoy/articleshow/114214477.cms",
            "description": "Sterling & Wilson Renewable Energy reported a net profit of Rs 8.57 crore in Q2FY24, up from a net loss of Rs 54.51 crore in Q2FY23. Revenue from operations jumped 35.7% to Rs 1,030.49 crore. For the half year ended September 2024, PAT stood at Rs 13.40 crore, up from a net loss of Rs 149.83 crore in the same period of the previous financial year.",
            "pubDate": "2024-10-15T00:33:55.618094"
        },
        {
            "title": "HDFC Life Q2 Results Preview: APE may grow up to 26% YoY, VNB in range of 12-22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-life-q2-results-preview-ape-may-grow-up-to-26-yoy-vnb-in-range-of-12-22/articleshow/114211174.cms",
            "description": "The value of new businesses (VNBs) for Q2FY25 is projected to be between Rs 900-978 crore, reflecting a year-on-year growth of 12% to 22%, according to brokerage estimates. Sequentially, annualized premium equivalent (APE) could rise by 24-34%, while VNB is expected to increase by 25-36%.",
            "pubDate": "2024-10-15T00:33:55.618191"
        },
        {
            "title": "Q2 results today: RIL, HCL Tech among 14 companies to announce earnings on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-ril-hcl-tech-among-14-companies-to-announce-earnings-on-monday/articleshow/114200592.cms",
            "description": "Reliance Industries Ltd is expected to report muted earnings for the second quarter, due to weakness in the oil-to-chemicals segment. Analysts anticipate a 10% decrease in net profit year-on-year and a marginal 0.6% decline in net sales. However, strong performance in consumer businesses and other segments may offset this decline.",
            "pubDate": "2024-10-15T00:33:55.618285"
        }
    ]
}