{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-06T19:53:16.505211",
    "items": [
        {
            "title": "Volatile markets & unconventional use of dividend yield: 14 stocks, both for traders and investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/volatile-markets-unconventional-use-of-dividend-yield-14-stocks-where-both-traders-and-investors-may-use-it-from-their-own-perspectives/articleshow/113986602.cms",
            "description": "While it might not be conventional, an investor and a trader may look at the same parameter to decide on two different things: An investing decision and trading strategy. Of course, we are not in a conventional market. We have had a week in which FPIs sold more than Rs. 25,000 crore worth of stocks. Yet, the index declined by just 4%. Before 2019, the damage would have been far worse. So, in times like these, some basic work needs to be done before making an investment decision. Especially so if you entered the market after 2020 – and have only seen a bull run.",
            "pubDate": "2024-10-06T19:52:58.160696"
        },
        {
            "title": "11 Nifty stocks which may outperform the volatile Nifty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-nifty-stocks-which-may-outperform-the-volatile-corrective-index-in-the-medium-term/articleshow/113984894.cms",
            "description": "This week the Nifty corrected 4%. But did all Nifty stocks correct equally? The answer, obviously, is no. That never happens. If the volatility and correction continues, the Nifty stocks that fell in this round may not be the ones to get battered in the future. The market sees different kinds of sell-offs at different times. And the kind of sell-off decides the pace of the correction in the Nifty and Bank Nifty – both important indices. Understanding this is important. Right now the markets are correcting not only due to a sudden outflow and global developments, but also because we are close to the earning season. How that pans out will have a major impact on how the Nifty and the broader market behave in the short term.",
            "pubDate": "2024-10-06T19:52:58.160806"
        },
        {
            "title": "Samvardhana Motherson, BASF India among 5 stocks that are near the buy point. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/samvardhana-motherson-basf-india-among-5-stocks-that-are-near-the-buy-point-do-you-own-any/slideshow/113983382.cms",
            "description": "MarketSmith has a positive outlook on several stocks that it considers near the buy point. These include Samvardhana Motherson International, Torrent Pharma, and BASF India. Here is a list of 5 stocks close to the buy point, as highlighted by MarketSmith:",
            "pubDate": "2024-10-06T19:52:58.160903"
        },
        {
            "title": "Market Trading Guide: 2 stock recommendations for Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-2-stock-recommendations-for-monday/articleshow/113984949.cms",
            "description": "Rupak De, Senior Technical Analyst at LKP Securities, noted that the Nifty faced continued bearish pressure for the second day, with sustained trading below key levels prompting a correction toward 25,000. He emphasized that market sentiment has significantly weakened, with higher levels becoming selling zones. The next support level is anticipated at 24,750, while resistance is seen at 25,300.",
            "pubDate": "2024-10-06T19:52:58.161003"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/113984559.cms",
            "description": "Indian benchmark equity indices, the Sensex and Nifty, experienced their fifth consecutive decline on Friday, recording their worst weekly performance in over two years. Escalating tensions in the Middle East and rising foreign outflows contributed to investor unease. The Nifty 50 index fell 0.93% to 25,014, while the S&P BSE Sensex decreased by 0.98% to 81,688.",
            "pubDate": "2024-10-06T19:52:58.161109"
        },
        {
            "title": "China-focused hedge funds post explosive September returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-focused-hedge-funds-post-explosive-september-returns/articleshow/113984381.cms",
            "description": "Goldman Sachs estimates China-focused hedge funds had best weekly performance on record By Summer Zhen HONG KONG, - Some China-focused hedge funds are reporting explosive returns in September, thanks to a sharp rebound in Chinese stocks driven by Beijing's aggressive stimulus package.",
            "pubDate": "2024-10-06T19:52:58.161202"
        },
        {
            "title": "Add to cart! Nestle India among 4 stock ideas with up to 33% upside scope",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/add-to-cart-nestle-india-among-4-stock-ideas-with-up-to-33-upside-scope/slideshow/113981830.cms",
            "description": "Nifty50's 26,000 and Sensex's 85,000 milestones were short-lived as tensions in the Middle East and FII outflows to cheaper Asian markets dampened sentiment. Both indices dropped over 4% this week, with declines across the auto, banking, infrastructure, and energy sectors.Amid the weakness in the indices and the overall market, certain individual stocks are still displaying potential for investor growth.Here’s a list of 4 “stocks that rock” by Yes Securities with a target of 1 year:",
            "pubDate": "2024-10-06T19:52:58.161294"
        },
        {
            "title": "M&M, L&T Finance among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mampm-lampt-finance-among-5-stocks-with-short-buildup/slideshow/113980940.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of the underlying stock in the Futures and Options segment. This indicates that more traders are expecting the prices to decline and are creating short positions. In Friday's trading session, five stocks saw fresh short positions being built. Here's the list:",
            "pubDate": "2024-10-06T19:52:58.161387"
        },
        {
            "title": "Exide Industries, Wipro among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/exide-industries-wipro-among-5-stocks-with-long-buildup/slideshow/113980814.cms",
            "description": "A long buildup occurs when open interest and trading volumes increase alongside a rise in the underlying stock price in the Futures and Options segment, signaling a bullish market trend. In Friday's trading session, five stocks saw fresh long positions. Here’s the list:",
            "pubDate": "2024-10-06T19:52:58.161478"
        },
        {
            "title": "Breakout Stocks: How to trade Info Edge, Dr Lal PathLabs and Home First Finance on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-info-edge-dr-lal-pathlabs-and-home-first-finance-on-monday/slideshow/113980519.cms",
            "description": "The Indian market closed in the red for the fifth consecutive day on Friday, tracking muted global cues. The S&P BSE Sensex fell by more than 800 points, while the Nifty50 managed to close above 25,000",
            "pubDate": "2024-10-06T19:52:58.161570"
        },
        {
            "title": "Zomato grants Rs 330 crore in stock options to employees via ESOPs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zomato-grants-rs-330-crore-in-stock-options-to-employees-via-esops/articleshow/113980226.cms",
            "description": "Zomato, the renowned food delivery platform, announced the grant of nearly 12 million stock options valued at Rs 330.17 crore under its ESOPs in an official filing on October 2, 2024. The options aim to enhance employee motivation and long-term wealth creation. The majority (11,997,652) of the options belong to the ESOP 2021 plan, while only 116 are from the older ESOP 2014 plan",
            "pubDate": "2024-10-06T19:52:58.161663"
        },
        {
            "title": "FPIs withdraw Rs 27,142 crore in 3 sessions of Oct on geopolitical worries, Chinese market rebound",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-withdraw-rs-27142-crore-in-3-sessions-of-oct-on-geopolitical-worries-chinese-market-rebound/articleshow/113980114.cms",
            "description": "According to the data, FPIs made a net withdrawal of Rs 27,142 crore from equities between October 1 and 4, with October 2 being a trading holiday",
            "pubDate": "2024-10-06T19:52:58.161767"
        },
        {
            "title": "Don't miss it! Aswath Damodaran identifies 2 sectors that will shape India’s growth story",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dont-miss-it-aswath-damodaran-identifies-2-sectors-that-will-shape-indias-growth-story/slideshow/113979980.cms",
            "description": "In a recent interview with ET Now, Aswath Damodaran, a professor at Stern School of Business, NYU, shared his views on emerging sectors and the potential of AI in India's future.Known for his insights into market trends and valuations, Damodaran discussed the sectors he believes will shape India’s growth and how AI could transform the global and Indian technology landscape",
            "pubDate": "2024-10-06T19:52:58.161857"
        },
        {
            "title": "M-cap of nine of top 10 firms drops by nearly Rs 5 lakh crore; RIL, HDFC Bank worst hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/m-cap-of-nine-of-top-10-firms-drops-by-nearly-rs-5-lakh-crore-ril-hdfc-bank-worst-hit/articleshow/113979056.cms",
            "description": "Nine of the top 10 most valued firms lost a total of Rs 4,74,906.18 cr in market value last week. The largest losses were seen by Reliance Industries and HDFC Bank. Market trends were weak due to tensions in the Middle East. Despite the decline, Reliance Industries remains the most valued company.",
            "pubDate": "2024-10-06T19:52:58.161948"
        },
        {
            "title": "How to build Rs 1 crore nest egg: A guide to SIP calculators",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-build-rs-1-crore-nest-egg-a-guide-to-sip-calculators/articleshow/113978605.cms",
            "description": "The earlier you start, the higher the probability of achieving your goal. Time is your ally in investing, as it amplifies the power of compounding. If you begin investing in your 20s, the monthly amount needed to reach ₹1 cr by your 40s is significantly lower than if you start later.",
            "pubDate": "2024-10-06T19:52:58.162033"
        },
        {
            "title": "LIC increases stake in Bank of Maharashtra from 4.05% to 7.1% via QIP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-increases-stake-in-bank-of-maharashtra-from-4-05-to-7-1-via-qip/articleshow/113978535.cms",
            "description": "Life Insurance Corporation of India (LIC) has increased its stake in Bank of Maharashtra, the company informed the exchange in a filing.",
            "pubDate": "2024-10-06T19:52:58.162125"
        }
    ]
}