{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-22T04:50:29.541954",
    "items": [
        {
            "title": "Drug companies set for improved revenue growth in June quarter amid US market challenges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/drug-companies-set-for-improved-revenue-growth-in-june-quarter-amid-us-market-challenges/articleshow/122824606.cms",
            "description": "Indian pharma and healthcare companies anticipate improved revenue and profit in the June 2025 quarter, fueled by domestic market growth. However, US pricing pressure, particularly for Revlimid generics, may impact some firms. Hospital chains are poised for better performance due to increased operational beds, while individual companies like Lupin expect strong US growth and margin expansion.",
            "pubDate": "2025-07-22T04:50:18.907555"
        },
        {
            "title": "Havells Q1 standalone profit dips 14% to Rs 352 crore on weak AC sales; cables, switchgears shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/havells-q1-standalone-profit-dips-14-to-rs-352-crore-on-weak-ac-sales-cables-switchgears-shine/articleshow/122818920.cms",
            "description": "Havells India reported a 14% YoY drop in Q1 net profit at Rs 352 crore, with net sales down 6% due to a weak summer hitting AC, fan, and cooler sales. However, its cables and switchgear segments posted strong growth, partly offsetting losses from the Lloyd appliance segment.",
            "pubDate": "2025-07-22T04:50:18.907704"
        },
        {
            "title": "PNB Housing Q1 profit jumps 23% to Rs 534 crore on loan growth, NIM boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-housing-q1-profit-jumps-23-to-rs-534-crore-on-loan-growth-nim-boost/articleshow/122818857.cms",
            "description": "PNB Housing Finance posted a 23% YoY rise in Q1 net profit at Rs 534 crore, aided by strong loan growth, improved NIM of 3.74%, and better asset quality. Gross NPAs fell to 1.06%, and retail disbursements in affordable and emerging segments surged, contributing 50% of total.",
            "pubDate": "2025-07-22T04:50:18.907819"
        },
        {
            "title": "Dhanlaxmi Bank Q1 profit at Rs 12 crore despite higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dhanlaxmi-bank-q1-profit-at-rs-12-crore-despite-higher-provisions/articleshow/122818535.cms",
            "description": "Dhanlaxmi Bank posted a Q1 FY26 net profit of Rs 12.18 crore versus a Rs 8 crore loss a year ago. This turnaround came despite a spike in provisions. Asset quality improved, with gross NPAs falling to 3.22%, and total income rose to Rs 407 crore from Rs 338 crore last year.",
            "pubDate": "2025-07-22T04:50:18.907920"
        },
        {
            "title": "Choice International Q1 Results: Profit jumps 50% to Rs 48 crore, revenue up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/choice-international-q1-results-profit-jumps-50-to-rs-48-crore-revenue-up-16/articleshow/122818255.cms",
            "description": "Financial services company Choice International on Monday reported a 50 per cent rise in its consolidated profit after tax to Rs 47.96 crore for the quarter ended on June 30, 2025, driven by broad-based growth across its business verticals and operational efficiency.",
            "pubDate": "2025-07-22T04:50:18.908021"
        },
        {
            "title": "UCO Bank Q1 profit rises 10% to Rs 607 crore; NIM guidance revised",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/uco-bank-q1-profit-rises-10-to-rs-607-crore-nim-guidance-revised/articleshow/122817689.cms",
            "description": "UCO Bank posted a 10% YoY rise in Q1FY26 net profit at Rs 607 crore, aided by strong treasury gains. Despite higher provisions and lower NIM, gross advances grew 16.48% while deposits rose 11.37% YoY.",
            "pubDate": "2025-07-22T04:50:18.908120"
        },
        {
            "title": "Uco Bank Q1 Results: PAT jumps 10% YoY to Rs 607 crore, NII up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/uco-bank-q1-results-pat-jumps-10-yoy-to-rs-607-crore-nii-up-7/articleshow/122816409.cms",
            "description": "Uco Bank reported a 10% YoY increase in standalone net profit, reaching Rs 607 crore in Q1FY26, while net interest income rose by 7% to Rs 2,403 crore. Despite positive YoY growth, PAT experienced a 7% sequential decline compared to Q4FY25.",
            "pubDate": "2025-07-22T04:50:18.908214"
        },
        {
            "title": "Eternal Q1 Results: Zomato parent reports 90% YoY profit fall despite 70% revenue jump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-q1-results-pat-plunges-90-yoy-to-rs-25-crore-revenue-surges-70/articleshow/122812552.cms",
            "description": "Eternal Q1 Results FY26: Zomato's parent company reported a significant 90% YoY drop in net profit for Q1FY26, landing at Rs 25 crore. Despite this dip, revenue surged 70% to Rs 7,167 crore. The profit decline stems from ongoing investments in quick commerce and going-out ventures. However, Zomato shares jumped over 7% following the earnings announcement.",
            "pubDate": "2025-07-22T04:50:18.908309"
        },
        {
            "title": "IDBI Bank Q1 Results: Standalone profit jumps 17% YoY to Rs 2,007 cr, NII drops 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idbi-bank-q1-results-standalone-profit-jumps-17-yoy-to-rs-2007-crore-interest-income-up-5/articleshow/122811521.cms",
            "description": "IDBI Bank announced a 17% year-on-year increase in its standalone net profit for Q1FY26, reaching Rs 2,007 crore compared to Rs 1,719 crore in the same period last year. The private lender's Net Interest Income (NII) for Q1FY26 stood at Rs 3,166 crore, slightly lower than the Rs 3,233 crore reported in Q1FY25, marking a 2% decrease.",
            "pubDate": "2025-07-22T04:50:18.908399"
        },
        {
            "title": "UltraTech Cement Q1 Results: Cons PAT surges 49% YoY to Rs 2,226 crore, revenue jumps 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-q1-results-cons-pat-surges-49-yoy-to-rs-2226-crore-revenue-jumps-13/articleshow/122811028.cms",
            "description": "UltraTech Cement Q1 Results: The Aditya Birla Group company's revenue stood at Rs 21,275 crore, up 13% from Rs 18,818 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-07-22T04:50:18.908497"
        }
    ]
}