{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-29T17:39:57.369028",
    "items": [
        {
            "title": "Coal India Q2 Results: Cons net profit falls 30% YoY to Rs 4,354 crore, revenue slips 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/coal-india-q2-results-cons-pat-falls-30-yoy-to-rs-4354-crore-revenue-slides-3/articleshow/124894419.cms",
            "description": "Coal India Q2 Results:  Coal India reported a significant 30% year-on-year drop in net profit for the second quarter ended September 2025, reaching Rs 4,354.24 crore. Revenue from operations also saw a slight decrease of 3.2%, totaling Rs 30,186.7 crore for the period.",
            "pubDate": "2025-10-29T11:39:35.134884"
        },
        {
            "title": "Varun Beverages Q3 Results: PAT jumps over 18% YoY to Rs 745 crore, revenue up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/varun-beverages-q3-results-pat-jumps-over-18-yoy-to-rs-745-crore-revenue-up-2/articleshow/124893790.cms",
            "description": "Varun Beverages reported an 18.5% YoY rise in Q3 CY2025 PAT to Rs 745.2 crore, supported by lower finance costs and higher other income. Revenue grew 1.9% to Rs 4,896.6 crore, while EBITDA margins softened slightly amid higher expenses, even as gross margins improved.",
            "pubDate": "2025-10-29T11:39:35.135016"
        },
        {
            "title": "ICRA Q2 Results: Profit jumps 29% to Rs 48 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icra-q2-results-profit-jumps-29-to-rs-48-crore/articleshow/124890986.cms",
            "description": "Rating agency ICRA announced strong financial results for the September quarter. Consolidated net profit surged by 29.4 percent to Rs 48 crore. Revenue from operations also saw a healthy increase of 8.3 percent, reaching Rs 136.6 crore. For the half year, profit after tax grew 24.4 percent. This performance was driven by growth in the ratings and research segments.",
            "pubDate": "2025-10-29T11:39:35.135155"
        },
        {
            "title": "ITC Q2 results preview: PAT may grow up to 11% YoY, revenue seen 15% higher; 6 things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-q2-results-preview-pat-may-grow-up-to-11-yoy-revenue-seen-15-higher-6-things-to-track/articleshow/124890626.cms",
            "description": "ITC's Q2 earnings are anticipated to show a modest profit increase of up to 11% year-on-year, with revenue projected to climb around 15%. Analysts expect steady cigarette volumes and an improved product mix to drive growth, though FMCG and agri segments might see slower progress.",
            "pubDate": "2025-10-29T11:39:35.135266"
        },
        {
            "title": "Quess Corp Q2 Results: Revenue up 3%, headcount rises by 21,000",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/quess-corp-q2-results-revenue-up-3-headcount-rises-by-21000/articleshow/124909415.cms",
            "description": "Quess Corp reported a 3% year-on-year revenue increase to ₹3,832 crore in Q2FY26, with EBITDA reaching a record ₹77 crore, up 11%. Growth was primarily driven by the General Staffing segment, which added 21,000 employees, and strong performance in Professional Staffing, particularly in the GCC segment.",
            "pubDate": "2025-10-29T17:39:54.266684"
        },
        {
            "title": "Heidelberg Cement India Q2 Results: Profit surges two-fold to Rs 25 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/heidelberg-cement-india-q2-results-profit-surges-two-fold-to-rs-25-crore/articleshow/124906311.cms",
            "description": "HeidelbergCement India on Wednesday reported a two-fold rise in net profit to Rs 24.93 crore for the September quarter of FY26, helped by higher sales volume and improvement in prices.",
            "pubDate": "2025-10-29T17:39:54.266812"
        },
        {
            "title": "Cognizant Q3 profit rises 7.3% to $5.4 billion, company raises full-year guidance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cognizant-q3-profit-rises-7-3-to-5-4-billion-company-raises-full-year-guidance/articleshow/124900485.cms",
            "description": "US-based IT major Cognizant, which has a substantial number of employees in India, on Wednesday reported a better-than-expected growth with its revenue rising 7.3 per cent year-over-year to USD 5,415 million for the quarter ended September 2025.",
            "pubDate": "2025-10-29T17:39:54.266931"
        },
        {
            "title": "PB Fintech Q2 Results: Profit skyrockets 165% YoY to Rs 135 crore on strong insurance growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pb-fintech-q2-results-profit-skyrockets-165-yoy-to-rs-135-crore-on-strong-insurance-growth/articleshow/124900297.cms",
            "description": "PB Fintech, parent of Policybazaar and Paisabazaar, reported a 165% YoY surge in Q2 FY26 profit to Rs 135 crore, driven by 40% premium growth, better operational efficiency, and improved margins. Renewal revenues and new business lines also strengthened performance.",
            "pubDate": "2025-10-29T17:39:54.267038"
        },
        {
            "title": "Larsen & Toubro Q2 Results: Profit rises 16% YoY to Rs 3,926 crore, revenue up 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/larsen-toubro-q2-results-profit-rises-16-yoy-to-rs-3926-crore-revenue-up-10/articleshow/124899650.cms",
            "description": "Larsen & Toubro Q2 Results: Engineering and construction major Larsen and Toubro (L&T) reported 16% YoY growth in its consolidated net profit at Rs 3,926 crore in the second quarter on top of 10% jump in its revenues at Rs 67,984 crore.",
            "pubDate": "2025-10-29T17:39:54.267141"
        }
    ]
}