{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-28T23:55:26.895535",
    "items": [
        {
            "title": "These 10 penny stocks plunged up to 55% in just a month — Are you affected?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-penny-stocks-plunged-up-to-55-in-just-a-month-are-you-affected/slideshow/124190659.cms",
            "description": "In the past month, 10 penny stocks have witnessed steep declines, shedding between 25% and 55% of their value. These underperformers were identified using a targeted screening approach, focusing on stocks with a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares. This strategy is designed to highlight low-priced, actively traded penny stocks that have experienced notable downside. (Data Source: ACE Equity)Although penny stocks often attract investors with their low entry prices and potential for rapid gains, they come with substantial risks. Due to low liquidity, high volatility, and limited transparency, they are prone to manipulation and sudden drops. Without a clear strategy and strong risk controls, investors may face more losses than gains.",
            "pubDate": "2025-09-28T04:53:37.644429"
        },
        {
            "title": "September IPO Rush: 11 Listings, but half are below their issue price. Still Holding?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/september-ipo-rush-11-listings-but-half-are-below-their-issue-price-still-holding/slideshow/124190515.cms",
            "description": "September 2025 was an active month for IPOs, with 11 companies making their market debut. On listing day, excitement was high—10 out of 11 stocks opened in the green, delivering an average listing gain of 9.57%. However, the post-listing performance tells a different story. According to Trendlyne data, only five stocks are currently trading above their issue price, while six have slipped into the red, bringing the overall average return down to 9.04%.",
            "pubDate": "2025-09-28T04:53:37.644545"
        },
        {
            "title": "Will Laurus Labs, Wockhardt see more pain on Monday? Anand James reads the charts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-laurus-labs-wockhardt-see-more-pain-on-monday-anand-james-reads-the-charts/articleshow/124190472.cms",
            "description": "Pharma and IT stocks faced heavy pressure after Trump’s 100% tariff and H-1B visa fee hike, dragging Nifty lower. Laurus Labs showed a topping pattern while Wockhardt stayed in consolidation. Nifty IT broke support, hinting further downside. Analysts suggest cautious trading, with Tata Motors and VTL offering potential bullish setups.",
            "pubDate": "2025-09-28T04:53:37.644644"
        },
        {
            "title": "RBI MPC, IPO action and FII trends among 8 factors to impact stock markets in holiday-truncated week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-mpc-ipo-action-and-fii-trends-among-8-factors-to-impact-stock-markets-in-holiday-truncated-week/articleshow/124190447.cms",
            "description": "Indian markets ended the week down 2.7%, dragged by IT and pharma amid U.S. tariff and visa fee worries. Key drivers ahead include RBI policy outcome, U.S. market cues, IPO rush, rupee weakness, and crude price trends. Analysts suggest caution with focus on fundamentally strong stocks.",
            "pubDate": "2025-09-28T04:53:37.644733"
        },
        {
            "title": "Indo MIM files IPO with Sebi, aims to raise Rs 1,000 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indo-mim-files-ipo-with-sebi-aims-to-raise-rs-1000-crore/articleshow/124192005.cms",
            "description": "Precision components maker Indo MIM has filed preliminary papers with markets regulator Sebi to raise funds through an initial public offering (IPO) comprising a fresh issue of equity shares worth Rs 1,000 crore.",
            "pubDate": "2025-09-28T07:16:31.590243"
        },
        {
            "title": "For investor with a 2-3 year perspective: 5 stocks from 3 sectors with an upside potential of up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investor-with-a-2-3-year-perspective-5-stocks-from-3-sectors-with-an-upside-potential-of-up-to-39/articleshow/124191158.cms",
            "description": "Consider this. A company has implemented a restructuring plan and the numbers are showing a positive impact. So, should a decline in the stock price in a volatile phase be taken as an opportunity? The answer is yes, but with some caveats. First, don't just jump in and buy. Identify the stock, decide on your total exposure, and buy when a panic phase drives the price down. Also, don’t use money you may need in the near term. Why? Because (though the probability of it happening is low) if a time-wise correction is sparked for any global or domestic reason, then all stocks will underperform.",
            "pubDate": "2025-09-28T07:16:31.590368"
        },
        {
            "title": "Multibagger Mania: These 6 stocks rocketed up to 2,011% in 3 straight quarters. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-mania-these-6-stocks-rocketed-up-to-2011-in-3-straight-quarters-do-you-own-any/slideshow/124191764.cms",
            "description": "Tracking stocks that show consistent upward momentum can be highly rewarding for investors, since such stocks often continue to gain when overall market sentiment is positive. However, it is important to note that past performance is not a guarantee of future results. ETMarkets has highlighted six stocks that have stood out by delivering over 20% returns in each of the last three quarters of CY25, including the ongoing July–September quarter. Impressively, all six have already more than doubled investors’ wealth in the current calendar year.To create this list, a filtering process was applied: only companies with a market capitalization above Rs 2,500 crore and a last daily trading volume of more than 10,000 shares were included. This ensures the focus remains on actively traded, sizeable companies that are demonstrating sustained bullish momentum rather. (Data Source: ACE Equity)",
            "pubDate": "2025-09-28T07:16:31.590475"
        },
        {
            "title": "Nifty vs gold: 2026 could mark the big mean reversion trade, says Axis MF’s Shreyash Devalkar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-vs-gold-2026-could-mark-the-big-mean-reversion-trade-says-axis-mfs-shreyash-devalkar/articleshow/124191695.cms",
            "description": "After a year where gold and silver dazzled investors, Axis MF’s Equity Head Shreyash Devalkar believes 2026 could mark a turning point. With earnings recovery, sectoral rotation and supportive macros lining up, he argues Nifty may finally outshine precious metals, setting the stage for a classic mean reversion trade.",
            "pubDate": "2025-09-28T07:16:31.590595"
        },
        {
            "title": "Nifty breaks winning streak, traders eye Oct 3 for strong intraday momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-breaks-winning-streak-traders-eye-oct-3-for-strong-intraday-momentum/articleshow/124191648.cms",
            "description": "The Indian equity market ended a three-week winning streak as Nifty50 slipped 2.6%, pressured by global trade tensions, H-1B visa concerns, and persistent foreign outflows. Time-based technical signals indicate potential intraday volatility, emphasizing cautious trading and disciplined risk management for short-term traders amid fluctuating support and resistance levels.",
            "pubDate": "2025-09-28T07:16:31.590698"
        },
        {
            "title": "Saurabh Mukherjea-led Marcellus Investment Managers filed FIR against ex-CFO. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saurabh-mukherjea-led-marcellus-investment-managers-filed-fir-against-ex-cfo-heres-why/articleshow/124191553.cms",
            "description": "Marcellus Investment Managers filed a police complaint against ex-CFO Pankaj Harish Gupta for diverting Rs 1.18 crore for personal use. The firm reassures clients their investments remain unaffected. Gupta admitted misappropriation, while Marcellus cooperates with authorities, emphasizing transparency, governance, and business continuity. Client assets are safeguarded.",
            "pubDate": "2025-09-28T07:16:31.590799"
        },
        {
            "title": "Macro the Mightiest: ET Prime Special Series - Part 2 (A): Inflation, a misunderstood phenomenon",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/macro-the-mightiest-et-prime-special-series-part-2-a-inflation-a-misunderstood-phenomenon/articleshow/124191376.cms",
            "description": "This series aims to treat macroeconomics as a toolkit, not a lecture: Yes it is long read; maybe boring. So why read it? Because what finally matters to the stock market is a company’s earnings. And what impacts earnings is the macroeconomic condition of a country. So, to understand the market, you have to understand macroeconomics and its elements. In this, Part 2 of the series, we look at Inflation.",
            "pubDate": "2025-09-28T07:16:31.590893"
        },
        {
            "title": "From laggards to leaders: PSU Banks outpace private peers in loan growth after 15 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-laggards-to-leaders-psu-banks-outpace-private-peers-in-loan-growth-after-15-years/articleshow/124191485.cms",
            "description": "India’s public sector banks have achieved a remarkable turnaround, with asset quality improvements, disciplined cost management, and strong credit growth driving profitability. PSBs now deliver sustainable returns, with robust capital positions and cleaner balance sheets. SBI and PNB stand out as key beneficiaries, offering attractive investment potential in India’s evolving banking landscape.",
            "pubDate": "2025-09-28T07:16:31.590989"
        },
        {
            "title": "Stocks to watch this week: Hindustan Copper, NLC India among five picks with potential gains up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-watch-this-week-hindustan-copper-nlc-india-among-five-picks-with-potential-gains-up-to-28/slideshow/124191331.cms",
            "description": "Nifty ended the previous week with a decline of 2.7% amid twin shocks — Donald Trump's H-1B visa application fee hike and pharma sector tariffs, forcing Nifty to settle below 24,700. LKP Securities analyst Rupak De expects sentiments to remain weak. With stock-specific action likely to stay for now, ETMarkets has compiled 5 picks — technical and fundamental picks to buy this week for a potential upside of 28%. Take a look:",
            "pubDate": "2025-09-28T07:16:31.591084"
        },
        {
            "title": "Sun Pharma stares at 8-10% profit risk amid 100% Trump tariffs, says HSBC. Can the giant navigate this?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-stares-at-8-10-profit-risk-amid-100-trump-tariffs-says-hsbc-can-the-giant-navigate-this/articleshow/124191268.cms",
            "description": "Sun Pharma faces potential impact from the US 100% tariff on patented drugs, which could reduce FY26–27 earnings by 8–10%. Generic drugs remain exempt. The company’s innovative portfolio, strong cash position, and mitigation options support steady revenue growth, maintaining HSBC’s Buy rating with Rs 1,850 target.",
            "pubDate": "2025-09-28T07:16:31.591188"
        },
        {
            "title": "Alcobrew Distilleries India files draft papers for IPO; eyes Rs 258 cr via fresh issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alcobrew-distilleries-india-files-draft-papers-for-ipo-eyes-rs-258-cr-via-fresh-issue/articleshow/124191224.cms",
            "description": "Spirit maker Alcobrew Distilleries India Ltd has filed draft papers with capital markets regulator Sebi to seek its approval to raise funds through an initial public offering (IPO).",
            "pubDate": "2025-09-28T07:16:31.591279"
        },
        {
            "title": "Market cap of top-10 most valued firms drops by Rs 2.99 lakh cr; TCS hit hard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-cap-of-top-10-most-valued-firms-drops-by-rs-2-99-lakh-cr-tcs-hit-hard/articleshow/124191203.cms",
            "description": "The combined market valuation of the top-10 most valued firms eroded by Rs 2,99,661.36 crore last week, in line with a bearish trend in equities, with IT bellwether Tata Consultancy Services taking the biggest hit.",
            "pubDate": "2025-09-28T07:16:31.591373"
        },
        {
            "title": "Tata Capital: GMP action begins for biggest IPO of 2025. 5 things to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-capital-gmp-action-begins-for-biggest-ipo-of-2025-5-things-to-know/slideshow/124191195.cms",
            "description": "Tata Capital, the NBFC arm of the Tata Group, is set to launch India’s biggest IPO of 2025 on October 6. With an estimated issue size of Rs 17,200 crore, the street is buzzing ahead of the listing.",
            "pubDate": "2025-09-28T07:16:31.591467"
        },
        {
            "title": "Eternal vs Swiggy: Which one does HSBC pick as competition intensifies?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-vs-swiggy-which-one-does-hsbc-pick-as-competition-intensifies/articleshow/124191007.cms",
            "description": "HSBC reiterates “Buy” on Eternal, raising its target to Rs 390, citing strong scale, margin leadership, and robust cash reserves. Swiggy remains on “Hold” due to slower margin growth, high cash burn, and execution risks, despite rising average order values. Eternal outperforms in quick commerce and food delivery segments.",
            "pubDate": "2025-09-28T07:16:31.591579"
        },
        {
            "title": "FPIs offload Rs 16,422 crore last week, sentiments to reverse in near future: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-offload-rs-16422-crore-last-week-sentiments-to-reverse-in-near-future-analysts/articleshow/124190920.cms",
            "description": "Foreign portfolio investors (FPIs) offloaded Rs 16,422 crore worth of Indian equities last week, driven by concerns over valuations and new policy measures of US government but the sentiment is set to reverse, analysts said on Sunday.",
            "pubDate": "2025-09-28T07:16:31.591680"
        },
        {
            "title": "20 IPOs to open in the next two days. GMPs range between 8-18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/20-ipos-to-open-in-the-next-two-days-gmps-range-between-8-18/slideshow/124190989.cms",
            "description": "Dalal Street is gearing up for a busy week with 20 IPOs set to open over the next two days. Grey market premiums (GMPs) are sending mixed signals, ranging from flat to as high as 18%, giving investors plenty to track.",
            "pubDate": "2025-09-28T07:16:31.591773"
        },
        {
            "title": "Market Trading Guide: Buy Ashok Leyland, sell Dixon on Monday for gains up to 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-ashok-leyland-sell-dixon-on-monday-for-gains-up-to-9/slideshow/124192494.cms",
            "description": "The Nifty ended with sharp cuts on Friday, witnessing its sixth consecutive decline amid selling pressure across sectors, most notably in pharma and IT stocks. Nifty’s breaking below the crucial support level of 25,000 triggered a decline and led to the breach of other intermediate supports. Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities, said the sentiment remains weak, with immediate and critical support placed in the 24,550–24,500 zone. “A decisive breakdown below 24,500 could extend the correction towards 24,150, which corresponds to the 38.20% Fibonacci retracement of the rally from 21,743 to 25,669. On the other hand, if the index holds above 24,500, a sharp recovery can be expected,\" De said.The Nifty broke below the crucial support level of 25,000, triggering a decline that led to the breach of other intermediate supports. The sentiment remains weak, with immediate and critical support placed in the 24,550–24,500 zone. A decisive breakdown below 24,500 could extend the correction towards 24,150, which corresponds to the 38.20% Fibonacci retracement of the rally from 21,743 to 25,669. On the other hand, if the index holds above 24,500, a sharp recovery can be expected.Here are 4 stock recommendations for Monday:",
            "pubDate": "2025-09-28T08:35:41.975799"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/124193884.cms",
            "description": "Indian equities posted their steepest weekly fall in seven months as the Sensex and Nifty extended losses amid U.S. visa curbs and drug tariffs. Pharma and IT stocks dragged, while FIIs stayed cautious. Analysts flagged key support at 24,500, with volatility expected around monthly expiry and global uncertainties weighing on sentiment.",
            "pubDate": "2025-09-28T11:20:50.669483"
        },
        {
            "title": "IndusInd Bank, Wipro, Infosys, TCS are Emkay’s preferred picks amid volatility. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-wipro-infosys-tcs-are-emkays-preferred-picks-amid-volatility-heres-why/articleshow/124193765.cms",
            "description": "Amid heightened trade tensions and market volatility, Emkay Global has identified a clutch of value and quality stocks it believes could outperform in the months ahead.",
            "pubDate": "2025-09-28T11:20:50.669611"
        },
        {
            "title": "BYD sees Warren Buffett exit as routine, investors react with caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/byd-sees-warren-buffett-exit-as-routine-investors-react-with-caution/articleshow/124193391.cms",
            "description": "Warren Buffett’s Berkshire Hathaway has fully sold its 17-year stake in Chinese electric-vehicle maker BYD, ending one of the most profitable foreign bets in the conglomerate’s history.",
            "pubDate": "2025-09-28T11:20:50.669821"
        },
        {
            "title": "BSE, CDSL & other capital market-related stocks: Buy, sell, or hold? The answer lies in just one data point",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-cdsl-other-capital-market-related-stocks-buy-sell-or-hold-the-answer-lies-in-just-one-data-point/articleshow/124194416.cms",
            "description": "Remember the Surf Excel advertisement with the tagline “Daag achhe hain”? Similarly, there are times in the stock market when a decline – or what is commonly called a “correction” – may be described as “achhe hain”. These short-term setbacks caused by narratives and headwinds do create an opportunity for investors looking to pick up businesses with long and strong growth paths for the long term. However, given that stock prices have moved up and the valuations are no longer cheap, some amount of scepticism and fear is justified. And the antidote for scepticism and fear are facts and trends.",
            "pubDate": "2025-09-28T13:27:08.276903"
        },
        {
            "title": "Two Trades for Today: A financial investment firm for a 6.5% gain, a large-cap engineering stock for almost 7% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-financial-investment-firm-for-a-6-5-gain-a-large-cap-engineering-stock-for-almost-7-upmove/articleshow/124197936.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-28T18:11:34.660934"
        },
        {
            "title": "Stock Radar: Usha Martin stock breaks out from a rounding bottom pattern to hit fresh highs in September; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-usha-martin-stock-breaks-out-from-a-rounding-bottom-pattern-to-hit-fresh-highs-in-september-check-target-stop-loss/articleshow/124194937.cms",
            "description": "Usha Martin Ltd recently broke out above a rounding bottom pattern on weekly charts, signaling a potential upward trajectory. Experts recommend buying the stock, targeting Rs 479–491 in the next 3–4 weeks. This decisive breakout, confirmed by strong volume and bullish indicators, suggests robust underlying strength despite an overbought RSI.",
            "pubDate": "2025-09-28T23:55:26.082372"
        }
    ]
}