{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-08T04:34:06.505770",
    "items": [
        {
            "title": "Trump picks Stephen Miran to fill open spot on Fed Board",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-picks-stephen-miran-to-fill-open-spot-on-fed-board/articleshow/123178030.cms",
            "description": "Donald Trump plans to nominate Stephen Miran to the Federal Reserve. Miran will fill a vacant seat temporarily. The White House is searching for a permanent Fed Board member. They are also looking for a new Fed chair to replace Jerome Powell. Miran has advocated for changes in the Fed's governance. His nomination requires Senate approval.",
            "pubDate": "2025-08-08T02:18:52.260901"
        },
        {
            "title": "S&P 500 eases with Eli Lilly; Nasdaq manages record closing high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-eases-with-eli-lilly-nasdaq-manages-record-closing-high/articleshow/123177920.cms",
            "description": "The Dow and S&P 500 faced a slight dip. However, Nasdaq managed a record high close. Eli Lilly shares fell due to disappointing drug data. Trump plans to nominate Stephen Miran to the Federal Reserve. Christopher Waller is a top candidate for Fed chair. New tariffs from Trump raised import duties. Jobless claims saw a slight increase.",
            "pubDate": "2025-08-08T02:18:52.261018"
        },
        {
            "title": "GIFT Nifty down 45 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123177361.cms",
            "description": "Indian markets initially declined but recovered to close positively. Analysts anticipate range-bound movement, influenced by US-Russia talks, US tariffs, and domestic earnings. The India VIX decreased. Foreign investors net sold shares, while domestic institutional investors were net buyers. The Rupee strengthened against the US dollar. FII positions in the futures market showed an increase in net shorts.",
            "pubDate": "2025-08-08T02:18:52.261124"
        },
        {
            "title": "Stocks in news: LIC, SBI, Tata Motors, Titan, Airtel, Apollo Tyres",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-lic-sbi-tata-motors-titan-airtel-apollo-tyres/articleshow/123177297.cms",
            "description": "Indian equities experienced volatile trading before closing flat on expiry day. Several companies are in focus due to Q1 results: LIC reported a 5% profit increase, while BSE saw a 103% surge. Titan's profit grew by 34%, and Kalyan Jewellers by 49%. HPCL's profit jumped significantly by 1,128%.",
            "pubDate": "2025-08-08T02:18:52.261220"
        },
        {
            "title": "Asian equities edge up at open, dollar declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-equities-edge-up-at-open-dollar-declines/articleshow/123177224.cms",
            "description": "Asian stocks are on track for their best week since June, fueled by technology shares and optimism surrounding corporate earnings. The MSCI Asia Pacific Index saw gains, with Japanese equities leading the charge. The dollar weakened, while investors anticipate a potential interest-rate cut by the Federal Reserve, contributing to the positive market sentiment.",
            "pubDate": "2025-08-08T02:18:52.261313"
        },
        {
            "title": "India's general insurance sector reports muted growth in July",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-general-insurance-sector-reports-muted-growth-in-july/articleshow/123176910.cms",
            "description": "India's general insurance sector experienced slow growth in July. Premium growth was only 2.8 percent. Motor insurance sales were weak. Big companies like Bajaj Allianz and ICICI Lombard saw declines. New India Assurance, however, grew by 16 percent. Health insurers performed better, growing over 10 percent. The industry's total premium was ₹29,729 crore.",
            "pubDate": "2025-08-08T02:18:52.261409"
        },
        {
            "title": "Sebi permits joint inspections of stock brokers by Market Infrastructure Institutions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-permits-joint-inspections-of-stock-brokers-by-market-infrastructure-institutions/articleshow/123176844.cms",
            "description": "Sebi has permitted Market Infrastructure Institutions (MIIs) to conduct joint inspections of stock brokers, streamlining the process. This move aims to reduce the burden on intermediaries caused by frequent, separate inspections by stock exchanges, depositories, and clearing corporations. MIIs are also required to establish information-sharing mechanisms for inspection observations.",
            "pubDate": "2025-08-08T02:18:52.261499"
        },
        {
            "title": "Indian Continent Investment to sell 0.8% stake in Bharti Airtel for Rs 9,300 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-continent-investment-to-sell-0-8-stake-in-bharti-airtel-for-rs-9300-crore/articleshow/123176645.cms",
            "description": "Indian Continent Investment, led by Sunil Mittal, plans to sell approximately 0.8% of its stake in Bharti Airtel for over ₹9,300 crore through a block deal. The sale involves five crore shares at a floor price of ₹1,862 per share, a 3% discount. This follows a similar stake sale in February, with Bharti Airtel's shares showing significant gains this year.",
            "pubDate": "2025-08-08T02:18:52.261590"
        },
        {
            "title": "Tata & SP Group reignite exit talks after years: Chandrasekaran meets Mistry in first formal contact since relations soured in 2016",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-sp-group-reignite-exit-talks-after-years-chandrasekaran-meets-mistry-in-first-formal-contact-since-relations-soured-in-2016/articleshow/123177086.cms",
            "description": "Tata Sons has initiated early talks with minority shareholder Shapoorji Pallonji (SP) Group to explore potential exit and monetisation options for SP’s 18.37% stake, currently pledged with lenders. This follows a resolution by Tata Trusts to retain Tata Sons’ private status and seek a settlement. Chairman N Chandrasekaran recently met Shapoor Mistry, marking their first formal engagement since 2016.",
            "pubDate": "2025-08-08T02:18:52.261708"
        },
        {
            "title": "Can US-Russia summit alleviate India's concerns over Trump's tariff policies?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-us-russia-summit-alleviate-indias-concerns-over-trumps-tariff-policies/articleshow/123176551.cms",
            "description": "Indian equity markets rebounded on Thursday, recovering from earlier losses fueled by tariff concerns. Optimism surrounding a potential Trump-Putin meeting spurred hopes for eased US-India trade relations, particularly regarding Russian oil purchases. The NSE Nifty and BSE Sensex both closed marginally higher, driven by short covering and positive momentum indicators, suggesting a possible continuation of the upward trend.",
            "pubDate": "2025-08-08T02:18:52.261800"
        },
        {
            "title": "Stock Radar: APL Apollo Tubes stock fails to hold momentum after hitting highs in June; what should traders do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-apl-apollo-tubes-stock-fails-to-hold-momentum-after-hitting-highs-in-june-what-should-traders-do/articleshow/123163303.cms",
            "description": "APL Apollo Tubes, after failing to sustain momentum from June highs, is exhibiting bearish signals. Experts suggest short-term traders consider short positions, targeting Rs 1,430 within six weeks. The stock's decline below crucial moving averages and resistance at the 200-DMA indicate continued weakness, making it a potential short-selling opportunity.",
            "pubDate": "2025-08-08T02:18:52.261895"
        },
        {
            "title": "Co-lending norms: Tech integration could prove a hurdle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/co-lending-norms-tech-integration-could-prove-a-hurdle/articleshow/123176777.cms",
            "description": "Following the RBI's tighter regulations on co-lending, banks and NBFCs may shift towards direct assignment of assets. The new rules demand significant tech integration and credit policy alignment, potentially slowing down operationally intensive loans. While larger NBFCs might find the compliance burdensome, smaller ones could benefit from the default loss guarantee, enhancing their scaling ability.",
            "pubDate": "2025-08-08T02:18:52.262077"
        },
        {
            "title": "Weaver Services to buy Centrum Housing Finance for Rs 600 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weaver-services-to-buy-centrum-housing-finance-for-rs-600-crore/articleshow/123176763.cms",
            "description": "Weaver Services, backed by Gaja Capital, is set to acquire a 75% stake in Centrum Housing Finance for ₹600 crore. This deal values the mortgage lender at ₹800 crore, driven by Centrum's need to focus on its small finance bank as per regulatory requirements. The acquisition reflects continued investor interest in India's affordable housing finance sector, despite recent valuation adjustments.",
            "pubDate": "2025-08-08T02:18:52.262167"
        },
        {
            "title": "RBI plans hefty penalty to make banks settle death claims fast",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-plans-hefty-penalty-to-make-banks-settle-death-claims-fast/articleshow/123176746.cms",
            "description": "The Reserve Bank of India (RBI) mandates banks to settle deceased customers' deposit accounts, safe deposit lockers, and safe custody articles within 15 days, effective January 1, 2026. Non-compliance will incur penalties, including interest on deposit delays and a daily charge for locker settlement delays. The move aims to standardize claim processes and compensate customers for inconveniences.",
            "pubDate": "2025-08-08T02:18:52.262253"
        },
        {
            "title": "Swiggy shares crack 27% YTD. What’s behind the fall and should you stay invested?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-crack-27-ytd-whats-behind-the-fall-and-should-you-stay-invested/articleshow/123179740.cms",
            "description": "Swiggy shares have fallen this year due to poor financial results. The company is experiencing losses despite revenue growth. Analysts are observing potential signs of recovery in the stock. Key resistance levels are being monitored. A breakout above Rs 425 could lead to further gains. Investors should watch for a possible uptrend.",
            "pubDate": "2025-08-08T04:33:52.442294"
        },
        {
            "title": "Tariff game a non-event or new reality for your stocks? Here’s how to Trump-proof your portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-game-a-non-event-or-new-reality-for-your-stocks-heres-how-to-trump-proof-your-portfolio/articleshow/123179584.cms",
            "description": "Despite market resilience, a $4 billion FII outflow signals deeper concerns over Trump's tariffs, impacting Indian exporters in textiles, seafood, and gems & jewellery sectors. Experts warn of potential job losses, RBI rate cuts, and fiscal support measures. Investors are advised to focus on defensive stocks and sectors insulated from US tariffs like banks and telecom.",
            "pubDate": "2025-08-08T04:33:52.442428"
        },
        {
            "title": "Negative Breakout: Emami, Reliance Power, BHEL among 8 stocks below their 200 DMA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-emami-reliance-power-bhel-among-8-stocks-below-their-200-dmas/slideshow/123179554.cms",
            "description": "In the Nifty500 pack, eight stocks closed below their 200-day moving average (DMA) on August 7, according to technical scan data from StockEdge.com. Trading below the 200 DMA is generally seen as a negative signal, indicating that the stock's price is below its long-term trend line. Traders widely use the 200 DMA to assess the broader trend of a stock. Take a look:",
            "pubDate": "2025-08-08T04:33:52.442532"
        },
        {
            "title": "Sensex falls over 300 pts, Nifty below 24,500 as Trump tariffs fog street sentiments; IT stocks fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-150-pts-nifty-below-24600-as-trump-tariff-fogs-street-sentiments-it-stocks-fall/articleshow/123179268.cms",
            "description": "Indian stock markets started Friday on a weak note. This decline followed losses from the previous day. Investor sentiment was affected by U.S. tariffs and continuous selling by foreign investors. The Sensex and Nifty both experienced drops. Certain sectors like IT and finance faced significant selling pressure. Oil and gas stocks, however, showed some gains.",
            "pubDate": "2025-08-08T04:33:52.442637"
        },
        {
            "title": "Jio Financial, 12 other stocks to trade ex-dividend on Monday. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-12-other-stocks-to-trade-ex-dividend-on-monday-do-you-own/articleshow/123179411.cms",
            "description": "Shares of Jio Financial Services and several other companies are in focus today as August 8 marks the ex-dividend date. Investors must buy shares by today to qualify for dividends declared by firms like Akzo Nobel India, Castrol India, Kalyani Steels, and more. Dividend-paying stocks are likely to see heightened trading activity as the record date approaches on August 11.",
            "pubDate": "2025-08-08T04:33:52.442742"
        },
        {
            "title": "AU Small Finance Bank shares zoom over 7% after RBI nod for universal bank transition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-bank-shares-in-focus-after-rbi-nod-for-universal-bank-transition/articleshow/123179369.cms",
            "description": "AU Small Finance Bank's shares surged after the Reserve Bank of India granted in-principle approval for its transition to a Universal Bank. This makes AU the first Small Finance Bank in India to receive such approval, reflecting its strong performance and commitment to financial inclusion. The transition aligns with AU’s goal of becoming a full-service bank.",
            "pubDate": "2025-08-08T04:33:52.442839"
        },
        {
            "title": "BSE shares drop over 2% after Q1 results as brokerages downgrade stock, trim target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-in-focus-as-q1-profit-soars-103-yoy-should-you-buy-sell-or-hold/articleshow/123179331.cms",
            "description": "BSE shares: The exchange reported a 103% YoY jump in consolidated net profit to ₹539 crore for the June quarter, up from ₹265 crore last year. Revenue from operations also surged 59% YoY to ₹958 crore.",
            "pubDate": "2025-08-08T04:33:52.442932"
        },
        {
            "title": "Bharat Forge, Adani Power among 9 stocks that rose above VWAP on August 7",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-forge-adani-power-among-9-stocks-that-rose-above-vwap-on-august-7/slideshow/123179297.cms",
            "description": "On August 7, the closing prices of nine stocks in the Nifty500 pack rallied over 1.5% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-08T04:33:52.443024"
        },
        {
            "title": "Firstsource Solutions, ITI among 10 stocks that showed RSI Trending Up on August 7",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/firstsource-solutions-iti-among-10-stocks-that-showed-rsi-trending-up-on-august-7/slideshow/123179188.cms",
            "description": "On August 7, in the Nifty500 pack, 18 stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com, with the top 10 stocks highlighted. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-08-08T04:33:52.443115"
        },
        {
            "title": "MSCI August 2025 rejig: Swiggy, Vishal Megamart among 2 others included, 2 thrown out. Check full list here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/msci-august-2025-rejig-swiggy-vishal-megamart-among-2-others-included-2-thrown-out-check-full-list-here/articleshow/123178888.cms",
            "description": "MSCI’s August 2025 review adds Swiggy, Vishal Mega Mart, Hitachi Energy India, and Waaree Energies to its Global Standard Index, while removing Sona BLW Precision and Thermax. The reshuffle, effective August 26, is expected to trigger significant passive inflows and outflows.",
            "pubDate": "2025-08-08T04:33:52.443304"
        },
        {
            "title": "Ola Electric shares in focus as lock-in expiry frees up 10% of equity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-as-lock-in-expiry-frees-up-10-of-equity/articleshow/123178841.cms",
            "description": "Ola Electric Mobility shares are set to be active. The one-year lock-in period concludes. This releases a large number of shares into the market. Nuvama Alternative & Quantitative Research provided the data. This corporate development is important for investors. The lock-in expiry may increase trading activity. It could also impact the stock price.",
            "pubDate": "2025-08-08T04:33:52.443420"
        },
        {
            "title": "SoftBank shares surge to record after optimism for AI prospects boosted Q1 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/softbank-shares-surge-to-record-after-optimism-for-ai-prospects-boosted-q1-earnings/articleshow/123178796.cms",
            "description": "SoftBank Group's shares surged to a record high, jumping over 13% following a first-quarter profit that exceeded expectations, fueled by investor enthusiasm for its AI investments. The company reported a net profit of 421.8 billion yen, driven by strong performance in its diversified portfolio and thematic tailwinds.",
            "pubDate": "2025-08-08T04:33:52.443514"
        },
        {
            "title": "Explained: Nestle India 1:1 bonus issue; what it means for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-nestle-india-11-bonus-issue-what-it-means-for-investors/articleshow/123178649.cms",
            "description": "Nestle India's shares are in focus as the company sets August 8 as the record date for its inaugural 1:1 bonus share issue, a move aimed at enhancing stock liquidity and potentially improving affordability for retail investors. Investors holding shares by August 7 will receive one bonus share for each share owned.",
            "pubDate": "2025-08-08T04:33:52.443607"
        },
        {
            "title": "Airtel shares drop 3% on reports of Rs 12,500 crore promoter stake sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-shares-in-focus-as-promoter-to-offload-0-8-stake-via-block-deal/articleshow/123178617.cms",
            "description": "Bharti Airtel's shares experienced a 3% dip, reaching Rs 1,868.70 on the BSE, following Indian Continent Investment Ltd's sale of a 1.2% equity stake through a block deal involving 6.7 crore shares. The secondary sale, managed by Jefferies India and J.P. Morgan India, includes a 90-day lock-up period for the seller.",
            "pubDate": "2025-08-08T04:33:52.443703"
        },
        {
            "title": "Flysbs Aviation IPO GMP at 106% before debut on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/flysbs-aviation-ipo-gmp-at-106-before-debut-on-friday/articleshow/123178567.cms",
            "description": "Flysbs Aviation is set for a strong stock market debut on the NSE SME platform, fueled by robust investor demand. The IPO, priced at ₹225 per share, boasts a grey market premium of 106%, potentially doubling investor wealth on listing. The IPO was oversubscribed by 318.68 times.",
            "pubDate": "2025-08-08T04:33:52.443799"
        }
    ]
}