{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-10T11:26:00.294317",
    "items": [
        {
            "title": "NTPC shares in focus after pact with Gujarat govt to explore new energy ventures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-shares-in-focus-after-pact-with-gujarat-govt-to-explore-new-energy-ventures/articleshow/124443468.cms",
            "description": "NTPC shares: The company signed an MoU with the Gujarat government to explore opportunities in conventional and non-conventional energy sectors, aiming to expand its footprint in the state. The agreement was exchanged in the presence of Chief Minister Bhupendrabhai Patel, Union Minister Pralhad Joshi, and other senior officials.",
            "pubDate": "2025-10-10T03:54:00.272886"
        },
        {
            "title": "TCS shares in focus after Q2 miss; brokerages see up to 20% upside. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-after-q2-miss-brokerages-see-up-to-20-upside-should-you-buy-sell-or-hold/articleshow/124443444.cms",
            "description": "TCS shares: TCS reported a muted Q2 performance with net profit rising 1.4% year-on-year to ₹12,075 crore, missing analyst estimates, while revenue grew 2.4% to ₹65,799 crore. Despite the earnings miss, brokerages remain optimistic, citing TCS’s new AI infrastructure push and strong long-term growth potential, with some projecting up to 21% upside in the stock.",
            "pubDate": "2025-10-10T03:54:00.273013"
        },
        {
            "title": "12 stock picks from Geojit to light up your portfolio this Diwali. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-stock-picks-from-geojit-to-light-up-your-portfolio-this-diwali-do-you-own-any/slideshow/124443396.cms",
            "description": "As India steps into Samvat 2082, optimism runs high with the government’s fiscal push, tax relief worth Rs 1 lakh crore, and GST cuts adding Rs 50,000 crore in annual savings. Cooling inflation, a good monsoon, and the RBI’s credit reforms are expected to boost consumption and investment momentum in FY26. Against this backdrop, Geojit has unveiled 12 Diwali picks — a blend of large- and mid-cap names poised to ride India’s next growth wave.",
            "pubDate": "2025-10-10T03:54:00.273125"
        },
        {
            "title": "Copper at 16-month high! Hindustan Copper shares soar nearly 50% in 1 month. Should you cash in?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/copper-at-16-month-high-hindustan-copper-shares-soar-nearly-50-in-1-month-should-you-cash-in/articleshow/124443418.cms",
            "description": "Hindustan Copper has surged over 50% in the past two months, driven by rising global demand for base and industrial metals, tight supply, and bullish technical indicators. Supply disruptions at Teck Resources and Freeport-McMoRan, coupled with India-focused operational progress like the Rakha mine lease extension, have strengthened the stock’s upside potential, with analysts projecting further gains in the near to medium term.",
            "pubDate": "2025-10-10T03:54:00.273250"
        },
        {
            "title": "Is the becoming a bubble? Why Goldman, JPMorgan, IMF are sounding the alarm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-becoming-a-bubble-why-goldman-jpmorgan-imf-are-sounding-the-alarm/articleshow/124443190.cms",
            "description": "Global financial leaders — including Goldman Sachs, JPMorgan, the IMF, and the Bank of England — are warning that the AI-driven stock market boom may be nearing a tipping point. With Big Tech valuations soaring to historic highs and market concentration at 50-year peaks, concerns are mounting that speculative excess could trigger a sharp correction reminiscent of the dotcom bubble.",
            "pubDate": "2025-10-10T03:54:00.273383"
        },
        {
            "title": "GMDC, MCX India and 4 other stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-mcx-india-and-4-other-stocks-closed-crossing-above-vwap/slideshow/124442996.cms",
            "description": "The closing prices of six stocks in the Nifty500 pack rallied over 1.5% relative to their VWAP (Volume Weighted Average Price) on October 9, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-10-10T03:54:00.273493"
        },
        {
            "title": "Multi Commodity Exchange Of India among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multi-commodity-exchange-of-india-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124442874.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack, as of October 9, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-10T03:54:00.273597"
        },
        {
            "title": "Hindustan Zinc among 5 stocks showing a bullish candlestick pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-among-5-stocks-showing-a-bullish-candlestick-pattern/slideshow/124442770.cms",
            "description": "Five stocks from the Nifty200 pack came to the bullish scanner of \"White Marubozu\" on October 9, according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns to make informed decisions about future price movements in financial markets.",
            "pubDate": "2025-10-10T03:54:00.273695"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Delhivery, Lupin among 5 stocks that could give 15-25% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-delhivery-lupin-among-5-stocks-that-could-give-15-25-return/slideshow/124442732.cms",
            "description": "Brokerages have maintained a positive outlook on several prominent names across sectors, highlighting strong growth prospects and improving fundamentals for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-10T03:54:00.273792"
        },
        {
            "title": "Univastu India 2:1 bonus issue: Last day to buy shares ahead of October 13 ex-date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/univastu-india-21-bonus-issue-last-day-to-buy-shares-ahead-of-october-13-ex-date/articleshow/124442644.cms",
            "description": "Investors have until today to buy Univastu India shares to qualify for its 2:1 bonus issue, with the ex-date set for October 13. This corporate action, the company's second bonus issue, aims to boost share capital in line with growth initiatives. The stock has shown consistent returns, gaining over 24% in the past year.",
            "pubDate": "2025-10-10T03:54:00.273896"
        },
        {
            "title": "Positive Breakout: These 8 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/124442379.cms",
            "description": "In the Nifty500 pack, 12 stocks' closing prices crossed above their 200 DMAs (Daily Moving Averages) on October 9, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look",
            "pubDate": "2025-10-10T03:54:00.273995"
        },
        {
            "title": "Wall Street closes lower, pausing record-setting rally as earnings approach",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-lower-pausing-record-setting-rally-as-earnings-approach/articleshow/124442047.cms",
            "description": "Indian markets saw a pause as American stocks ended lower. Investors are now focused on upcoming corporate earnings and clues from the Federal Reserve about interest rate cuts. The market awaits signals on economic health and future monetary policy. This period of consolidation precedes a crucial earnings season, with major banks set to report results soon.",
            "pubDate": "2025-10-10T03:54:00.274094"
        },
        {
            "title": "Stocks in news: TCS, Tata Elxsi, Sammaan Capital, Waaree Renewable, Signature Global",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-tata-elxsi-sammaan-capital-waaree-renewable-signature-global/articleshow/124441827.cms",
            "description": "Indian stock markets saw a rebound on Thursday. Key companies like TCS, Tata Elxsi, Sammaan Capital, Waaree Renewable, and Signature Global are under the spotlight today. TCS reported its Q2 profit, while Tata Elxsi announced its results. Sammaan Capital is subject to an open offer. Waaree Renewable will announce its September quarter earnings.",
            "pubDate": "2025-10-10T03:54:00.274198"
        },
        {
            "title": "Asian shares dip at open, gold trades below $4,000",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-dip-at-open-gold-trades-below-4000/articleshow/124441804.cms",
            "description": "Asian equities opened lower, mirroring a pause in US stock rallies amid concerns over stretched valuations. While South Korea's Samsung Electronics surged, other markets saw declines. Investors are reassessing gains spurred by AI-linked tech stocks, with some analysts suggesting a potential bubble, though others point to sustained earnings power.",
            "pubDate": "2025-10-10T03:54:00.274311"
        },
        {
            "title": "Can TCS’ $6.5 billion AI data centre push revive its growth momentum?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-tcs-6-5-billion-ai-data-centre-push-revive-its-growth-momentum/articleshow/124441697.cms",
            "description": "Tata Consultancy Services is investing heavily in artificial intelligence and data centres. This move aims to build new capabilities for global companies. The company plans to create 1 gigawatt of data centre capacity. This initiative is a strategic response to slowing revenue growth. TCS is also acquiring ListEngage to boost its Salesforce platform.",
            "pubDate": "2025-10-10T03:54:00.274414"
        },
        {
            "title": "GIFT Nifty down 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124428792.cms",
            "description": "Indian stock markets, Nifty and Sensex, saw a rebound on Thursday. Gains in IT, metal, and pharma sectors boosted the indices. Nifty closed higher, while Sensex saw a slight dip. Experts suggest a positive outlook with potential for further rallies if key resistance levels are breached. The Rupee traded near its all-time low against the US dollar.",
            "pubDate": "2025-10-10T03:54:00.274508"
        },
        {
            "title": "Tata Motors demerger: Will it unlock value or more volatility for investors next week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-demerger-will-it-unlock-value-or-more-volatility-for-investors-next-week/articleshow/124445832.cms",
            "description": "Tata Motors shares snapped a five-day losing streak to rise on Friday ahead of the demerger record date, as the company prepares to split its passenger and commercial vehicle businesses. Analysts see potential for value unlocking, though caution on short-term volatility remains, with Jaguar Land Rover’s production restart adding to market sentiment.",
            "pubDate": "2025-10-10T06:13:54.701275"
        },
        {
            "title": "Ashish Kacholia picks 1.12 lakh shares in this smallcap multibagger that's up over 200% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-picks-1-12-lakh-shares-in-this-smallcap-multibagger-thats-up-over-200-in-1-year/articleshow/124445795.cms",
            "description": "TechEra Engineering India shares: The company, specializing in precision tooling, automation systems, and components for aerospace and defense, provides critical assembly tools, jigs, fixtures, MRO tooling, and ground support equipment for aircraft manufacturing and maintenance.",
            "pubDate": "2025-10-10T06:13:54.701395"
        },
        {
            "title": "SEC clears way for IPOs amid US government shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sec-clears-way-for-ipos-amid-us-government-shutdown/slideshow/124444854.cms",
            "description": "Wall Street’s top regulator has allowed companies to proceed with initial public offerings (IPOs) even during the federal government shutdown. (Source: Reuters)",
            "pubDate": "2025-10-10T06:13:54.701505"
        },
        {
            "title": "Reliance Power shares soar 15%. Here’s what is fuelling the rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-soar-15-heres-what-is-fuelling-the-rally/articleshow/124445314.cms",
            "description": "Reliance Power shares saw a significant jump on Friday, October 10, driven by renewed buying interest and high trading volumes. This surge occurred despite the company receiving Show Cause Notices from SEBI concerning CLE Private Limited. Earlier, Reliance Power reported a profit in Q1 FY26, a positive shift from a loss last year.",
            "pubDate": "2025-10-10T06:13:54.701607"
        },
        {
            "title": "Sept Fed rate cut driven by softening labor market and easing inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sept-fed-rate-cut-driven-by-softening-labor-market-and-easing-inflation/slideshow/124444729.cms",
            "description": "San Francisco Fed President Mary Daly said last month’s rate cut was driven by a softening labour market and easing inflation. She also indicated that the Fed might consider further rate reductions in the future. (Source: Reuters)",
            "pubDate": "2025-10-10T06:13:54.701708"
        },
        {
            "title": "Japan warns of yen volatility amid fiscal concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-warns-of-yen-volatility-amid-fiscal-concerns/slideshow/124444623.cms",
            "description": "Finance Minister Katsunobu Kato has signalled that the government is closely monitoring the foreign exchange market as the yen faces pressure due to fiscal concerns. (Source: Reuters)",
            "pubDate": "2025-10-10T06:13:54.701807"
        },
        {
            "title": "WeWork India shares make a weak debut, list flat at Rs 650 on NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wework-india-shares-make-a-weak-debut-list-flat-at-rs-650-on-nse/articleshow/124444170.cms",
            "description": "WeWork India shares: WeWork India Management shares experienced a subdued listing on stock exchanges Friday, opening with a marginal premium on the NSE and a slight dip on the BSE. The company's Rs 3,000-crore IPO, a pure offer-for-sale, saw strong demand from Qualified Institutional Buyers but fell short of its retail and Non-Institutional Investor quotas.",
            "pubDate": "2025-10-10T06:13:54.701906"
        },
        {
            "title": "Buy, Sell or Hold: JM Financial recommends buy on TCS post Q2 results; Motilal Oswal recommends Sell on Tata Elxsi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-jm-financial-recommends-buy-on-tcs-post-q2-results-motilal-oswal-recommends-sell-on-tata-elxsi/articleshow/124443692.cms",
            "description": "Brokerages maintained mixed views as JM Financial stayed bullish on TCS, Morgan Stanley backed Muthoot Finance’s growth, while Motilal Oswal turned cautious on Tata Elxsi amid margin pressure and muted demand.",
            "pubDate": "2025-10-10T06:13:54.702033"
        },
        {
            "title": "Tata Elxsi shares fall 3% after Q2 profit falls 32.5% YoY but rises sequentially",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-elxsi-shares-in-focus-after-q2-profit-falls-32-5-yoy-but-rises-sequentially/articleshow/124443655.cms",
            "description": "Tata Elxsi reported a 32.5% year-on-year decline in Q2FY26 net profit to Rs 154.81 crore, though sequential growth of 7.2% provided a modest silver lining. Revenue fell to Rs 918.1 crore, with EBITDA margins contracting to 21%. Weakness persisted in healthcare, while Media & Communications and Transportation segments remained resilient. Motilal Oswal maintains a sell rating.",
            "pubDate": "2025-10-10T06:13:54.702137"
        },
        {
            "title": "Sensex climbs 300 pts, Nifty tops 25,250 as FPIs return to D-St; TCS caps gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-climbs-100-pts-nifty-tops-25200-as-fpis-return-to-d-st-tcs-caps-gains/articleshow/124443582.cms",
            "description": "Indian equity indices Sensex and Nifty opened higher on Friday, buoyed by renewed foreign portfolio investor buying. Gains were partially offset by losses in TCS after a weaker-than-expected profit report. Broader markets also firmed, with midcaps and smallcaps showing positive movement.",
            "pubDate": "2025-10-10T06:13:54.702241"
        },
        {
            "title": "Citigroup expects up to $20 billion in India IPOs over next year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citigroup-expects-up-to-20-billion-in-india-ipos-over-next-year/articleshow/124443539.cms",
            "description": "India's initial public offerings are set to raise up to $20 billion in the coming year. This surge will solidify India's standing as a leading global listings market. Domestic capital, including retail investors, is fueling this growth. Several prominent companies are preparing for their IPOs, promising an active period for the Indian stock market.",
            "pubDate": "2025-10-10T06:13:54.702338"
        },
        {
            "title": "Aurobindo Pharma leads bullish RSI surge with 5 other stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aurobindo-pharma-leads-bullish-rsi-surge-with-5-other-stocks/slideshow/124443618.cms",
            "description": "On October 9, 44 Nifty50 stocks appeared in the RSI Trending Up scan, based on StockEdge.com data. We’ve highlighted those closing with gains of 4% or more. An RSI crossing above 50 from below signals an uptrend. “RSI trending up” indicates strengthening momentum in a stock’s price, often used by traders to spot potential buying opportunities.Top RSI movers:",
            "pubDate": "2025-10-10T06:13:54.702434"
        },
        {
            "title": "Tata Communications shares rally 15%. What’s driving the frenzy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-communications-shares-rally-15-whats-driving-the-frenzy/articleshow/124447878.cms",
            "description": "Tata Communications shares soared nearly 15% on heavy trading volumes, driven by optimism surrounding its potential role in the burgeoning AI and data center ecosystem.  The company is expected to benefit from TCS's ambitious data center plans, boosting its connectivity and cloud solutions business. Technical indicators also signal strong bullish momentum for the stock.",
            "pubDate": "2025-10-10T08:12:39.667837"
        },
        {
            "title": "Auto sector races ahead in FY26: These 5 stocks could accelerate even faster.  Are you riding along?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-sector-races-ahead-in-fy26-these-5-stocks-could-accelerate-even-faster-are-you-riding-along/articleshow/124447778.cms",
            "description": "The auto sector is leading the market in FY26 with over 24% gains, powered by festive demand, rural recovery, and new SUV launches. Analysts see continued momentum with picks like Maruti Suzuki, M&M, TVS Motors, Ashok Leyland, and Hyundai poised to accelerate further.",
            "pubDate": "2025-10-10T08:12:39.667988"
        },
        {
            "title": "LG Electronics IPO: Rs 30 crore m-cap company bids a whopping Rs 748 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-electronics-ipo-rs-30-crore-m-cap-company-bids-a-whopping-rs-748-crore/articleshow/124447285.cms",
            "description": "LG Electronics India’s mega IPO has drawn record-breaking interest, with bids far exceeding expectations. Notably, microcap Winro Commercial placed unusually large bids through leveraging. High subscription rates from institutional and retail investors underline strong demand, while brokerages remain optimistic about LG’s market dominance and growth potential despite premium valuations.",
            "pubDate": "2025-10-10T08:12:39.668204"
        },
        {
            "title": "YES Bank shares surge 8% to hit a 52-week high. What’s fueling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-surge-8-to-hit-a-52-week-high-whats-fueling-the-rally/articleshow/124446968.cms",
            "description": "YES Bank shares have surged to a 52-week high. This rally is fueled by Japanese financial major Sumitomo Mitsui Banking Corporation's stake acquisition. Investors are also anticipating the bank's upcoming Q2 FY26 results. The stock has shown strong performance recently, with significant gains in the past month and year-to-date. Technical indicators suggest a bullish momentum.",
            "pubDate": "2025-10-10T08:12:39.668311"
        },
        {
            "title": "Wealth creation: Macro policy push & sectoral trends which take time but worth the wait: 5 stocks which fit the bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-creation-macro-policy-push-sectoral-trends-which-take-time-but-worth-the-wait-5-stocks-which-fit-the-bill/articleshow/124446633.cms",
            "description": "All investors are looking for sectors and stocks where there is an opportunity to make big money. But we miss out on one critical factor when it comes to finding such sectors: They are often not in the news, and are not much talked-about on the street. These are sectors where macro changes are currently taking place in the overall demand. Its impact will be felt only later.",
            "pubDate": "2025-10-10T08:12:39.668409"
        },
        {
            "title": "TCS bets $6 billion on AI data centers: Bold pivot or costly detour?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-bets-6-billion-on-ai-data-centers-bold-pivot-or-costly-detour/articleshow/124446232.cms",
            "description": "TCS launches a $6B AI data centre initiative, marking a strategic pivot to co-location AI infrastructure. Analysts split on returns; the move tests financial discipline while targeting future growth opportunities.",
            "pubDate": "2025-10-10T08:12:39.668504"
        },
        {
            "title": "Jefferies’ Chris Wood sells India to buy more of China in Asia ex-Japan portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-chris-wood-sells-india-to-buy-more-of-china-in-asia-ex-japan-portfolio/articleshow/124449593.cms",
            "description": "Chris Wood cautioned that the US stock market’s AI-driven rally may be nearing its peak, comparing current exuberance to the Nasdaq boom of 2000. With margin debt up 33% year-on-year and valuations at record highs, GREED & fear has decided to remove Nvidia from its global equity portfolio after a 595% gain, replacing it with Greece’s Gek Terna.",
            "pubDate": "2025-10-10T09:59:35.738233"
        },
        {
            "title": "7 microcap stocks doubled investors' wealth in just 6 months — Did you miss them?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-microcap-stocks-doubled-investors-wealth-in-just-6-months-did-you-miss-them/slideshow/124449528.cms",
            "description": "As FY26 unfolds, the emerging stocks in the microcap space are quietly making big moves. While the benchmark Nifty index has clocked a respectable 7% gain so far, it’s the Nifty Microcap 250 that's turning heads — surging by an impressive 13% in the same period.But the real story lies beneath the surface. Thirty microcap stocks have skyrocketed by over 50%, and 7 of them have already entered multibagger territory, delivering returns of 100% or more in just a little over 6 months of FY26. In a year dominated by cautious optimism, it’s the smallest stocks making the biggest noise. (Data Source: ACE Equity)",
            "pubDate": "2025-10-10T09:59:35.738374"
        },
        {
            "title": "WeWork India shares slip over 5% after flat listing on debut. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wework-india-shares-slip-over-5-after-flat-listing-on-debut/articleshow/124448819.cms",
            "description": "WeWork India’s market debut was muted, slipping over 5% after listing flat despite full IPO subscription. Investor sentiment was cautious amid legal and governance concerns. While the company has shown a financial turnaround with rising revenue and profitability, analysts view its premium valuation and regulatory overhang as near-term challenges.",
            "pubDate": "2025-10-10T09:59:35.738490"
        },
        {
            "title": "European shares muted as rising autos, banks counter declining healthcare stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-muted-as-rising-autos-banks-counter-declining-healthcare-stocks/articleshow/124448390.cms",
            "description": "Automobiles gained 0.9%, with Milan-listed shares of Stellantis up 1.5% after the automaker said its global vehicle shipments rose 13% year-on-year in the third quarter.",
            "pubDate": "2025-10-10T09:59:35.738604"
        },
        {
            "title": "Japan's Nikkei falls on profit-booking, Fast Retailing shines on record profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-on-profit-booking-fast-retailing-shines-on-record-profit/articleshow/124448304.cms",
            "description": "The Nikkei surged 5% so far this week, after Sanae Takaichi was placed on course to become the next prime minister, boosting expectations of renewed fiscal stimulus and loose monetary policy.",
            "pubDate": "2025-10-10T09:59:35.738706"
        },
        {
            "title": "Market Wrap: Sensex rises 329 points, Nifty tops 25,250 as financials rally on FPI comeback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-rises-329-points-nifty-tops-25250-as-financials-rally-on-fpi-comeback/articleshow/124451441.cms",
            "description": "Indian benchmark indices Sensex and Nifty advanced Friday, lifted by gains in financial heavyweights on renewed foreign portfolio investor (FPI) inflows over the past three sessions. Optimism ahead of the quarterly earnings season added to the upbeat mood, though Tata Consultancy Services (TCS) capped broader gains after posting weaker-than-expected September-quarter results.",
            "pubDate": "2025-10-10T11:25:58.382769"
        },
        {
            "title": "Vijay Kedia-backed Eimco Elecon slumps 15% in two sessions as Q2 profit, revenue halve YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-backed-eimco-elecon-slumps-15-in-two-sessions-as-q2-profit-revenue-halve-yoy/articleshow/124450998.cms",
            "description": "Shares of Eimco Elecon, backed by Vijay Kedia, fell 15% in two sessions after reporting sharp declines in quarterly profit and revenue. Despite a recent stake purchase by Kedia, the smallcap stock remains volatile, trading below key moving averages amid broader market corrections.  The marquee investor Vijay Kedia picked up a stake worth Rs 11 crore in Eimco Elecon on Tuesday via a bulk deal",
            "pubDate": "2025-10-10T11:25:58.382905"
        },
        {
            "title": "Gabbar Singh asks, Nilesh Shah notices: Sholay-fication of Sebi tools takes centrestage in campaign",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gabbar-singh-asks-nilesh-shah-notices-sholay-fication-of-sebi-tools-takes-centrestage-in-campaign/articleshow/124450725.cms",
            "description": "An AI-generated Sholay-themed video on Sebi’s investor tools—SCORES, MITRA, and ODR—has gone viral after Kotak AMC’s Nilesh Shah shared it. The creative entry from Sebi’s Arth Yatra Contest 2025 uses Bollywood humour to promote financial literacy.",
            "pubDate": "2025-10-10T11:25:58.383125"
        }
    ]
}