{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-17T04:33:41.997561",
    "items": [
        {
            "title": "How are Indian IT giants navigating AI demands and tariff uncertainty?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/how-are-indian-it-giants-navigating-ai-demands-and-tariff-uncertainty/articleshow/124617925.cms",
            "description": "Indian IT exporters are demonstrating strong deal wins, adapting to AI-driven client demands amidst a challenging business environment. Despite uncertainties, companies are strategically integrating AI, bolstering their pipelines and showing resilience. Improved hiring and a weaker rupee are expected to support performance in the latter half of the fiscal year.",
            "pubDate": "2025-10-17T01:00:40.557556"
        },
        {
            "title": "Wipro shares plunge over 4% after Q2 results miss Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-shares-in-focus-after-marginal-rise-in-q2-profit-missing-street-estimates/articleshow/124619330.cms",
            "description": "Wipro's stock saw a significant fall after its Q2 FY26 financial results failed to meet market expectations. The IT services firm reported a modest profit increase year-on-year, but it was below analyst predictions. Revenue also saw a slight rise. Following the announcement, brokerage Motilal Oswal reiterated its 'Sell' recommendation on Wipro shares.",
            "pubDate": "2025-10-17T04:33:39.935954"
        },
        {
            "title": "RIL Q2 results today: 10 things to track as investors nurse Rs 1.8 lakh crore loss after Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q2-results-today-10-things-to-track-as-investors-nurse-rs-1-8-lakh-crore-loss-after-q1/articleshow/124619189.cms",
            "description": "Reliance Industries will announce its September quarter results today. Investors are keenly watching for key performance indicators. The company's stock has seen a significant drop after the previous quarter's results. Analysts are focused on revenue growth, segment performance, and cash flow trends. Updates on strategic initiatives like the Jio IPO are also anticipated.",
            "pubDate": "2025-10-17T04:33:39.936111"
        }
    ]
}