{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-07T04:00:34.084993",
    "items": [
        {
            "title": "FII bears have never been this harsh on Nifty, but that may be the buy signal! Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-bears-have-never-been-this-harsh-on-nifty-but-that-may-be-the-buy-signal-heres-why/articleshow/124352568.cms",
            "description": "Foreign investors have sold a record $18 billion in Indian equities, with Nifty futures positioning collapsing to near all-time lows. However, market veterans suggest this extreme pessimism could signal a contrarian opportunity for a near-term rebound. Domestic investors remain confident, providing crucial support amidst global uncertainties and valuation concerns.",
            "pubDate": "2025-10-07T03:43:10.129444"
        },
        {
            "title": "Zydus Lifesciences shares in focus after 2 regulatory approvals from Health Canada, USFDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-after-2-regulatory-approvals-from-health-canada-usfda/articleshow/124352535.cms",
            "description": "Zydus Life shares: Zydus Lifesciences received regulatory approvals from Health Canada for generic Liothyronine tablets and from the USFDA for Deflazacort oral suspension, expanding its portfolio and supporting global operations in Canada and the U.S.",
            "pubDate": "2025-10-07T03:43:10.129582"
        },
        {
            "title": "Fortis Healthcare, BSE, and 5 other stocks showing Bullish Candlestick Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fortis-healthcare-bse-and-5-other-stocks-showing-bullish-candlestick-pattern/slideshow/124352224.cms",
            "description": "Seven stocks from the Nifty200 pack came to the bullish scanner of \"White Marubozu\" on October 6, according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-10-07T03:43:10.129715"
        },
        {
            "title": "Adani Green Energy shares in focus after $250 million foreign currency loan deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-energy-shares-in-focus-after-250-million-foreign-currency-loan-deal/articleshow/124352463.cms",
            "description": "Adani Green share price: Adani Green Energy has secured a $250 million foreign currency loan from a consortium of global banks, including DBS and DZ Bank, to refinance existing debt. The five-year facility at an 8.2% interest rate aligns with the group’s strategy to reduce leverage and manage funding costs.",
            "pubDate": "2025-10-07T03:43:10.129821"
        },
        {
            "title": "LTIMindtree among 8 stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ltimindtree-among-8-stocks-showing-bullish-rsi-upswing/slideshow/124352114.cms",
            "description": "Eight stocks from the NSE largecap pack were highlighted in the RSI Trending Up scan on October 8, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-07T03:43:10.129924"
        },
        {
            "title": "Stocks to buy in 2025 for long term: GHCL, Indigo among 5 stocks that could give 19-49% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-ghcl-indigo-among-5-stocks-that-could-give-19-49-return/slideshow/124352019.cms",
            "description": "Brokerages remain upbeat on select stocks across sectors, highlighting a mix of strong fundamentals, earnings visibility, and favorable industry dynamics for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-07T03:43:10.130025"
        },
        {
            "title": "Sodhani Capital IPO: Strong subscription, but listing may stay flat with no GMP premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sodhani-capital-ipo-strong-subscription-but-listing-may-stay-flat-with-no-gmp-premium/articleshow/124351902.cms",
            "description": "Sodhani Capital shares will debut on the BSE SME platform on October 7. The Jaipur-based firm's IPO saw strong investor demand, subscribing 4.79 times. Proceeds will fund office acquisition, brand building, and technology development. Sodhani Capital focuses on mutual fund distribution, serving retail and HNI clients. The company aims to expand its digital presence and app development post-listing.",
            "pubDate": "2025-10-07T03:43:10.130127"
        },
        {
            "title": "Om Metallogic shares to debut today. Muted GMP, moderate subscription suggest tepid listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/om-metallogic-shares-to-debut-today-muted-gmp-moderate-subscription-suggest-tepid-listing/articleshow/124351869.cms",
            "description": "Om Metallogic, a metal processing company focused on recycling, is set to list on the BSE SME platform on October 7. The company's Rs 22.35 crore IPO saw a subscription of 1.47 times, with retail investors showing the most interest. Ahead of its debut, the grey market premium is near zero, indicating a flat opening.",
            "pubDate": "2025-10-07T03:43:10.130224"
        },
        {
            "title": "Vijaypd Ceutical IPO: Modest response and flat GMP ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijaypd-ceutical-ipo-modest-response-and-flat-gmp-ahead-of-listing/articleshow/124351844.cms",
            "description": "Vijaypd Ceutical's NSE SME debut on October 7 sees muted investor expectations with a near-zero grey market premium, suggesting a listing close to its Rs 35 issue price. The Rs 19.25 crore IPO saw moderate subscription, primarily driven by non-institutional investors, indicating cautious sentiment amid a surge of SME listings.",
            "pubDate": "2025-10-07T03:43:10.130319"
        },
        {
            "title": "Ashish Kacholia and Mukul Agrawal-backed Suba Hotels IPO listing today. Check GMP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-and-mukul-agrawal-backed-suba-hotels-ipo-listing-today-check-gmp/articleshow/124351799.cms",
            "description": "Suba Hotels is set to list on the NSE SME platform on October 7. The company's Rs 75 crore IPO saw strong investor demand, with a subscription of 15.33 times. The grey market premium indicates a positive debut. Suba Hotels operates 88 hotels across 50 cities. Funds raised will support hotel upgrades and expansion plans.",
            "pubDate": "2025-10-07T03:43:10.130421"
        },
        {
            "title": "Dhillon Freight Carrier IPO listing. Muted GMP points to a steady debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dhillon-freight-carrier-ipo-listing-muted-gmp-points-to-a-steady-debut/articleshow/124351744.cms",
            "description": "Dhillon Freight Carrier is listing on the BSE SME platform on October 7. The company completed a Rs 10.08 crore IPO. Retail investors showed strong interest. The stock may list near its issue price. Dhillon Freight offers logistics solutions across several Indian states. The IPO funds will help expand its fleet and operations.",
            "pubDate": "2025-10-07T03:43:10.130520"
        },
        {
            "title": "Positive Breakout: These 9 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-close-cross-above-their-200-dmas/slideshow/124351480.cms",
            "description": "In the Nifty200 pack, nine stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 6, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-07T03:43:10.130615"
        },
        {
            "title": "US stock market keeps setting records as AI excitement keeps building",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-market-keeps-setting-records-as-ai-excitement-keeps-building/articleshow/124351410.cms",
            "description": "Wall Street reached new highs, driven by AI enthusiasm, with AMD soaring after an OpenAI chip deal. Concerns about inflated AI valuations persist as OpenAI expands its infrastructure partnerships. Meanwhile, international markets reacted to political shifts, with Japanese stocks rising and French stocks falling.",
            "pubDate": "2025-10-07T03:43:10.130725"
        },
        {
            "title": "S&P 500, Nasdaq reach all-time closing highs on AI dealmaking boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-reach-all-time-closing-highs-on-ai-dealmaking-boost/articleshow/124351334.cms",
            "description": "Indian markets saw a boost from global trends. The S&P 500 and Nasdaq touched record highs driven by artificial intelligence deals. AMD's partnership with OpenAI fueled this surge. Despite a US government shutdown, investor sentiment remained strong for AI-related companies. Upcoming earnings reports and economic data will be closely watched.",
            "pubDate": "2025-10-07T03:43:10.130823"
        },
        {
            "title": "Japan's Nikkei hits record high as chip-related stocks track US peers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-hits-record-high-as-chip-related-stocks-track-us-peers/articleshow/124351318.cms",
            "description": "Japan's Nikkei stock market reached an all-time peak on Tuesday. Chip-related stocks mirrored gains seen in the United States. However, the index saw its rise diminish as excitement surrounding a potential new leader of the ruling party cooled. Investors had previously bet on increased spending and loose monetary policy.",
            "pubDate": "2025-10-07T03:43:10.130915"
        },
        {
            "title": "Axis Securities bullish on RBL Bank: Cup & Handle pattern in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-bullish-on-rbl-bank-cup-handle-pattern-in-focus/videoshow/124344631.cms",
            "description": "“RBL Bank's stock chart is painting an intriguing picture, showing signs of a classic \"Cup with Handle\" pattern—a bullish signal that often hints at a potential upward surge. Traders can buy for a target of Rs 310 in the next few weeks,” Rajesh Palviya, Senior Vice President – Research (Head Technical & Derivatives), Axis Securities, said.",
            "pubDate": "2025-10-07T03:43:10.131010"
        },
        {
            "title": "Sensex jumps over 150 pts, Nifty tops 25,100 as D-St opens in green for day 4; financials, oil & gas stock rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-150-pts-nifty-tops-25100-as-d-st-opens-in-green-for-day-4-financials-stock-rally/articleshow/124352824.cms",
            "description": "Indian stocks opened higher on Tuesday, extending their winning streak to a fourth session. The Sensex and Nifty saw gains, driven by strong performance in financial and oil & gas sectors. Positive sentiment was fueled by the central bank's new lending reforms and encouraging company business updates.",
            "pubDate": "2025-10-07T04:00:33.009130"
        },
        {
            "title": "Buy, Sell or Hold: Antique recommends a buy on Trent; Nuvama raises target price on Electronics Mart",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-antique-recommends-a-buy-on-trent-nuvama-raises-target-price-on-electronics-mart/articleshow/124352748.cms",
            "description": "Brokerages remain bullish on Trent, Star Health, and Electronics Mart India, citing strong earnings visibility, expanding retail presence, margin recovery, and resilient consumer demand, with upside potential ranging from 15% to 47%.",
            "pubDate": "2025-10-07T04:00:33.009284"
        }
    ]
}