{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-28T03:58:11.201948",
    "items": [
        {
            "title": "Can Fin's growth story finds new homes in the North",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-fins-growth-story-finds-new-homes-in-the-north/articleshow/125627583.cms",
            "description": "The surge in Can Fin Homes' stock prices reflects its successful strategy to extend operations outside southern India. As the company spreads its wings, it expects a substantial increase in its asset management growth. Recent reports indicate a sharp rise in loan disbursements, backed by strong asset quality and controlled NPAs.",
            "pubDate": "2025-11-28T02:49:44.808037"
        },
        {
            "title": "Gift Nifty trades on flat note; here's the trading setup for the day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-trades-on-flat-note-here-the-trading-setup-for-the-day/articleshow/125626931.cms",
            "description": "Indian markets reached new record highs on Thursday. Global markets showed strong performance, boosting domestic sentiment. Analysts identified 26,300 as a key resistance level. A break above this could lead to further gains. The India VIX, a fear gauge, declined. Foreign investors were net sellers, while domestic institutional investors were net buyers. The rupee weakened against the US dollar.",
            "pubDate": "2025-11-28T02:49:44.808161"
        },
        {
            "title": "Global stocks hold steady after four-day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-hold-steady-after-four-day-rally/articleshow/125627215.cms",
            "description": "Global equities held firm, buoyed by expectations of faster Federal Reserve rate cuts and a return of risk appetite, with Bitcoin surging. Markets anticipate a year-end rally, supported by a positive macro outlook and decent corporate earnings. Tech shares led gains in Asia, while German equities rose on takeover interest.",
            "pubDate": "2025-11-28T02:49:44.808371"
        },
        {
            "title": "Analysts see bullish trend intact as Nifty hits record high. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/analysts-see-bullish-trend-intact-as-nifty-hits-record-high-what-should-investors-do/articleshow/125627166.cms",
            "description": "Nifty hit a fresh intraday record, with analysts expecting the bullish trend to continue towards 26,500. Traders are advised to hold existing positions and focus on outperforming sectors like banking and financials. Strategies like buying at-the-money call options or bull-call spreads are suggested for potential gains.",
            "pubDate": "2025-11-28T02:49:44.808469"
        },
        {
            "title": "Nifty breaks a 14-month lull, yet Silver and Gold returns dominate D-Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-breaks-a-14-month-lull-yet-silver-and-gold-returns-dominate-d-street/articleshow/125627095.cms",
            "description": "After a 14-month period of underperformance compared to global peers, India's Nifty index has reached a new all-time high. During this time, silver and gold emerged as top-performing assets, while specific Indian sectoral indices like Capital Markets, PSU Bank, and Defence also saw significant gains.",
            "pubDate": "2025-11-28T02:49:44.808563"
        },
        {
            "title": "D-Street scales new peaks after 14 months as FPI selling cools, US-India deal eyed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-scales-new-peaks-after-14-months-as-fpi-selling-cools-us-india-deal-eyed/articleshow/125627051.cms",
            "description": "Indian stock markets reached new heights on Thursday, with the Sensex and Nifty crossing previous records. This surge follows a 14-month period of consolidation. Investors are now looking towards a potential US-India trade deal and a decrease in foreign investor selling to fuel further market gains. Analysts suggest focusing on large-cap stocks for potential upside.",
            "pubDate": "2025-11-28T02:49:44.808660"
        },
        {
            "title": "Asian stocks ebb as global rally loses momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-ebb-as-global-rally-loses-momentum/articleshow/125627007.cms",
            "description": "Asian stocks showed signs of losing momentum Friday, with indexes opening lower in South Korea and Japan, while global equities remained flat. Investors are closely watching Chinese stocks after JPMorgan upgraded its recommendation, and are also focused on the yen's stability amid steady Tokyo inflation and potential Bank of Japan rate hikes.",
            "pubDate": "2025-11-28T02:49:44.808752"
        },
        {
            "title": "Stocks in news: Bandhan Bank, Lenskart, LG India, Adani Enterprises, Wipro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-bandhan-bank-lenskart-lg-india-adani-enterprises-wipro/articleshow/125626885.cms",
            "description": "Markets reached a new record high on Thursday, buoyed by positive global sentiment, expectations of interest rate cuts, and falling crude oil prices. Several companies, including Bandhan Bank, Lenskart, and Adani Enterprises, are in focus due to significant business developments and strategic moves.",
            "pubDate": "2025-11-28T02:49:44.808846"
        },
        {
            "title": "Emcure Pharma shares in focus after GST Department conducts search at Mumbai offices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emcure-pharma-shares-in-focus-after-gst-department-conducts-search-at-mumbai-offices/articleshow/125628471.cms",
            "description": "Emcure Pharmaceuticals' shares could see action following a Goods and Services Tax search at its Mumbai offices. The inspection concluded this week. The company recently reported a robust rise in revenue and profit after tax. Domestic and international businesses both showed strong performance.",
            "pubDate": "2025-11-28T03:58:02.615067"
        },
        {
            "title": "Zydus Lifesciences shares in focus after US FDA nods for diabetes and blood pressure drugs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-after-us-fda-nods-for-diabetes-and-blood-pressure-drugs/articleshow/125628439.cms",
            "description": "Zydus Lifesciences is set to be in focus after it received tentative approval from the United States Food and Drug Administration for Empagliflozin and Linagliptin combination tablets for type 2 diabetes, alongside final approval for a blood pressure treatment drug. The company also entered into a licensing and commercialisation pact with RK Pharma for a supportive oncology product in the US. Shares ended marginally lower on Thursday as investors assessed the latest regulatory developments.",
            "pubDate": "2025-11-28T03:58:02.615198"
        },
        {
            "title": "GMDC among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-among-4-stocks-showing-bullish-rsi-upswing/slideshow/125628462.cms",
            "description": "On November 27, four stocks in the Nifty500 that gained over 3% appeared in the RSI Trending Up scan, according to data from StockEdge. An uptrend signal is generated when the RSI moves above 50 from below, indicating strengthening momentum. Rising RSI values suggest building bullishness in price action and may help traders identify potential buying opportunities.",
            "pubDate": "2025-11-28T03:58:02.615304"
        },
        {
            "title": "Kaynes Technology among 5 F&O stocks with a sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125628425.cms",
            "description": "There was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade, as of November 27. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-11-28T03:58:02.615405"
        },
        {
            "title": "Negative Breakout: These 10 stocks closed below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-close-below-their-200-dmas/slideshow/125628375.cms",
            "description": "In the Nifty500 pack, 10 stocks saw their closing prices fall below their 200-day moving average (200 DMA) on November 27, according to technical scan data from StockEdge. Trading below the 200 DMA is typically viewed as a bearish signal, as it indicates the stock has slipped under its long-term trend line, a key indicator used by traders to gauge overall momentum. Here are the details:",
            "pubDate": "2025-11-28T03:58:02.615513"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Tata Motors PV among 4 stocks that could give 10-28% returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-tata-motors-pv-among-4-stocks-that-could-give-10-28-returns/slideshow/125628182.cms",
            "description": "Brokerages remain selectively optimistic across sectors, with fresh target revisions signaling room for upside in several stocks.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-28T03:58:02.615614"
        },
        {
            "title": "Lenskart shares in focus as Jefferies initiates coverage with Buy rating. Check target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-in-focus-as-jefferies-initiates-coverage-with-buy-check-target-price/articleshow/125628072.cms",
            "description": "Jefferies initiated coverage on Lenskart with a 'Buy' rating, setting a Rs 500 price target, suggesting a 23% upside. The brokerage highlights Lenskart's leadership in India's under-penetrated eyewear market, driven by its tech-enabled, omni-channel model and strong store economics.  Growth is expected from network expansion and international operations.",
            "pubDate": "2025-11-28T03:58:02.615709"
        },
        {
            "title": "Thyrocare Technologies in focus as shares to trade ex-bonus for 2:1 issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thyrocare-technologies-in-focus-as-shares-to-trade-ex-bonus-for-21-issue/articleshow/125627854.cms",
            "description": "Thyrocare Technologies will trade ex-bonus today for its 2:1 bonus share issue, under which investors will receive two additional shares for every one held. The record date for determining eligible shareholders is November 28.",
            "pubDate": "2025-11-28T03:58:02.615802"
        }
    ]
}