{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-16T18:00:29.775625",
    "items": [
        {
            "title": "BluPine raises Rs 5,400 cr loan underwritten by Axis Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blupine-raises-rs-5400-cr-loan-underwritten-by-axis-bank/articleshow/126555124.cms",
            "description": "BluPine Energy, backed by Actis, has secured a significant ₹5,400 crore loan from Axis Bank. This long-term financing will support its renewable energy portfolio. The loan is secured against operating solar and wind assets. BluPine Energy is developing substantial renewable capacity in India. Proceeds will refinance existing borrowings, strengthening its financial position.",
            "pubDate": "2026-01-16T00:54:11.262158"
        },
        {
            "title": "Banks' credit-to-deposit ratio hits record 81.75% as mobilisation lags",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-credit-to-deposit-ratio-hits-record-81-75-as-mobilisation-lags/articleshow/126555068.cms",
            "description": "Indian banks' credit-to-deposit ratio hit an all-time high of 81.75% as of December 31, signaling pressure to attract deposits amid robust loan demand. This elevated ratio reflects challenges in deposit mobilization, with investors seeking higher returns elsewhere, and a lag in deposit growth compared to credit expansion.",
            "pubDate": "2026-01-16T00:54:11.262494"
        },
        {
            "title": "China’s $1.2 trillion windfall quietly seeps into global markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-1-2-trillion-windfall-quietly-seeps-into-global-markets/articleshow/126555689.cms",
            "description": "China's record trade surplus is fueling massive private overseas investments, with companies and individuals now holding over $1 trillion in foreign assets. This shift from state control to private capital flows introduces risks of sudden reversals, especially with a strengthening yuan. The global financial system faces increased reliance on this Chinese-sourced liquidity.",
            "pubDate": "2026-01-16T02:54:19.098304"
        },
        {
            "title": "Stocks to Buy in 2026: Angel One, Groww among 5 picks for 15–30% long-term returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-angel-one-groww-among-5-picks-for-1530-long-term-returns/slideshow/126545748.cms",
            "description": "A new round of brokerage recommendations highlights sustained optimism on select financial stocks, fintech platforms, and core infrastructure companies, even as markets remain selective on valuations and earnings visibilityWe have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-16T02:54:19.098425"
        },
        {
            "title": "GIFT Nifty down 5 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126555269.cms",
            "description": "Domestic markets experienced a choppy session, ending marginally lower as stock-specific movements dominated amid the ongoing earnings season. Investors are now closely watching corporate results, potential India-US trade deal developments, and cues from the upcoming Budget, with analysts anticipating a sideways market trend.",
            "pubDate": "2026-01-16T02:54:19.098551"
        },
        {
            "title": "Stocks in news: RIL, Wipro, Jio Financial, Infosys, Angel One, Indian Hotels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-wipro-jio-financial-infosys-angel-one-indian-hotels/articleshow/126555256.cms",
            "description": "Markets traded volatile, ending marginally lower amid mixed cues, with bulls defending the 100-day EMA support. Several companies like Reliance Industries, Wipro, and Infosys are in focus due to third-quarter results and other developments. Angel One reported a profit decline but approved an interim dividend and stock split.",
            "pubDate": "2026-01-16T02:54:19.098650"
        },
        {
            "title": "Asia shares near record high on AI optimism, dollar up on receding Fed cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-head-for-fourth-weekly-gain-on-tech/articleshow/126555221.cms",
            "description": "Asian stocks are on track for their best weekly run since May. Technology shares are reaching new highs, driven by strong investor interest in artificial intelligence. This surge follows positive news from Taiwan Semiconductor Manufacturing Company, boosting confidence in the tech sector. US and European markets also saw gains, with chipmakers performing exceptionally well.",
            "pubDate": "2026-01-16T02:54:19.098747"
        },
        {
            "title": "Moody's upgrades outlook for three key Adani Group firms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/moodys-upgrades-outlook-for-three-key-adani-group-firms/articleshow/126555202.cms",
            "description": "Moody's Ratings has upgraded the outlook for three Adani Group companies to stable. Adani Ports, Adani Transmission Step-One, and Adani Electricity Mumbai now have a stable outlook. This reflects improved liquidity and strong financial profiles. The companies are expected to maintain sufficient liquidity for operations and debt obligations over the next 18 months.",
            "pubDate": "2026-01-16T02:54:19.099034"
        },
        {
            "title": "Sensex surges 750 points, Nifty jumps nearly 1%: Infosys led IT rally and other factors pushing market higher today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-rising-today-sensex-surges-750-points-nifty-jumps-1-infosys-q3-push-and-other-factors-behind-the-rally/articleshow/126558208.cms",
            "description": "Indian equities surged on Friday, with the Sensex climbing over 750 points and Nifty topping 25,850, led by a strong rally in IT stocks. Infosys gained 5% after raising FY26 revenue guidance, lifting the Nifty IT index by 3%, while Wipro and other IT firms boosted overall market sentiment.",
            "pubDate": "2026-01-16T05:34:34.127208"
        },
        {
            "title": "Vedanta shares halt after 12% rally in 4 days, slip 2% amid sector weakness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-halt-after-12-rally-in-4-days-slip-2-amid-sector-weakness/articleshow/126558217.cms",
            "description": "Vedanta shares fell nearly 2% on Thursday, halting a four-day rally that saw the stock surge 12% to Rs 675.70. Profit-taking and weakness in the broader metal sector pressured the stock, while Hindalco, NMDC, Hindustan Zinc, and NALCO also traded lower amid elevated volumes and market volatility",
            "pubDate": "2026-01-16T05:34:34.127358"
        },
        {
            "title": "Union Bank of India, Swiggy among 5 F&O stocks with big jump in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-bank-of-india-swiggy-among-5-fampo-stocks-with-big-jump-in-futures-open-interest/slideshow/126557665.cms",
            "description": "As of January 5, five stocks in the NSE F&O segment witnessed a sharp jump in futures open interest, resulting in an overall increase of more than 8% compared to the previous trading sessionA sharp rise in futures open interest indicates a notable increase in outstanding, unsettled futures contracts in a particular security. This uptrend suggests that more participants are either opening fresh options or adding to their existing exposure in the futures market",
            "pubDate": "2026-01-16T05:34:34.127494"
        },
        {
            "title": "MMTC among 5 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mmtc-among-5-stocks-that-closed-above-vwap/slideshow/126557551.cms",
            "description": "On January 14, the closing prices of five stocks in the Nifty500 pack rallied more than 1.5% above their VWAP (volume-weighted average price). A move above the VWAP is often seen as a potential bullish signal, according to StockEdge.com’s technical scan dataWhen a stock closes above its VWAP, it indicates that the closing price is higher than the average price at which it traded during the session, weighted by volume. Traders and investors typically interpret this as a sign of positive market sentiment",
            "pubDate": "2026-01-16T05:34:34.127605"
        },
        {
            "title": "Cipla shares slide 5% after temporary halt in key drug manufacturing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-shares-slide-5-after-temporary-halt-in-key-drug-lanreotide-injection-manufacturing/articleshow/126557336.cms",
            "description": "Cipla shares fell sharply on Friday after a halt in Lanreotide Injection production due to USFDA observations at its Greek partner. Supply is expected to resume in H1 FY27. The stock trades near oversold levels, with bearish technical indicators, amid investor concern over the limited availability of a top US product.",
            "pubDate": "2026-01-16T05:34:34.127715"
        },
        {
            "title": "Mutual funds trim Paytm stake for first time since IPO; retail exits deepen. What’s next for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-trim-paytm-stake-for-first-time-since-ipo-retail-exits-deepen-whats-next-for-investors/articleshow/126556993.cms",
            "description": "Mutual funds have reduced their stake in Paytm for the first time since its IPO, while retail investors continue to exit. Despite this, several brokerages have upgraded the stock, citing improving regulatory conditions, clearer earnings visibility, and growth potential in new segments. Analysts believe Paytm's strong merchant network and improving profitability metrics are key drivers for future upside",
            "pubDate": "2026-01-16T05:34:34.127823"
        },
        {
            "title": "Angel One shares zoom over 7% after Q3 results, interim dividend, stock split announcement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/angel-one-shares-in-focus-after-announcing-q3-results-interim-dividend-and-stock-split/articleshow/126556956.cms",
            "description": "Angel One share price: On Friday, shares of Angel One soared as the company released its third-quarter earnings report, which highlighted a slight 4% year-over-year decline in net profit. Nevertheless, investor enthusiasm surged after the board announced an interim dividend of Rs 23 per share, coupled with an eye-catching 1:10 stock split.",
            "pubDate": "2026-01-16T05:34:34.127926"
        },
        {
            "title": "Sensex jumps over 700 pts, Nifty above 25,850 after Infosys earnings push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-200-pts-nifty-above-25700-after-infosys-earnings-push/articleshow/126556936.cms",
            "description": "Indian markets traded higher on Friday, with Sensex and Nifty buoyed by Infosys’ stronger-than-expected Q3 results and upgraded FY26 revenue guidance. IT stocks led gains, while mid- and small-caps also saw rises. Experts cited limited triggers, FII flows, and global cues—including AI momentum, crude stability, and Fed comments—as key factors.",
            "pubDate": "2026-01-16T05:34:34.128028"
        },
        {
            "title": "Jio Financial Services shares in focus after Q3 PAT drops 9% You",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-services-shares-in-focus-after-q3-pat-drops-9-you/articleshow/126556875.cms",
            "description": "Shares of Jio Financial Services are set to be in focus after the company reported a 9% YoY decline in Q3FY26 net profit to Rs 269 crore. The earnings softness came despite a sharp 106% surge in operating revenue, driven by strong growth in interest and fee income, highlighting momentum in core business lines",
            "pubDate": "2026-01-16T05:34:34.128130"
        },
        {
            "title": "Infosys shares climb 5% on FY26 guidance hike post Q3 results. Is more upside left?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-as-adr-jumps-over-7-in-2-days-after-fy26-guidance-raised-in-q3-results-what-should-investors-do/articleshow/126556774.cms",
            "description": "Infosys shares surged on Friday after the company boosted its FY26 revenue growth forecast. The IT major now expects constant-currency revenue growth between 3-3.5%. This positive outlook has led brokerages like Nomura, Elara Capital, and Emkay Global to maintain their buy or accumulate ratings. The company's ADRs also saw significant gains.",
            "pubDate": "2026-01-16T05:34:34.128232"
        },
        {
            "title": "ONGC, Oil India and other oil-linked stocks in focus as crude slides after Iran tensions ease",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-oil-india-and-other-oil-linked-stocks-in-focus-as-crude-slides-after-iran-tensions-ease/articleshow/126556750.cms",
            "description": "A sharp 4% drop in global crude has put ONGC, Oil India, Reliance, Indian Oil, BPCL and HPCL back in the spotlight. The reversal, driven by easing geopolitical fears, reshapes near-term expectations for upstream producers and refiners, with analysts watching whether oversupply or renewed tensions steer prices ahead.",
            "pubDate": "2026-01-16T05:34:34.128338"
        },
        {
            "title": "Groww shares surge 4% on positive brokerage commentary post Q3 results. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-in-focus-as-q3-profit-slumps-28-on-one-off-buy-sell-or-hold/articleshow/126556741.cms",
            "description": "In a surprising twist, Billionbrains Garage Ventures' stock surged on Friday despite a reported profit decline for Q3 of fiscal 2026. The notable increase in revenue, driven by market share expansion, impressed brokerages. Positive sentiments were echoed as Groww fortified its position in both stock and derivatives markets, with SIP inflows witnessing a remarkable uptick.",
            "pubDate": "2026-01-16T05:34:34.128467"
        },
        {
            "title": "Union Bank of India, Vedanta among 4 stocks flashing bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-bank-of-india-vedanta-among-4-stocks-flashing-bullish-signals-indicating-possible-uptrend/slideshow/126556671.cms",
            "description": "On January 14, four stocks from the Nifty200 universe appeared on the bullish “White Marubozu” scanner, based on data from StockEdge.com. A White Marubozu is a bullish candlestick pattern formed when the opening price is the session low and the closing price is the highDepicted by a long white or green candlestick with no upper shadow and a small or non-existent lower shadow, the pattern indicates sustained buying pressure throughout the session. Traders often view it as a sign of strong buyer control and improving near-term price momentum",
            "pubDate": "2026-01-16T05:34:34.128569"
        },
        {
            "title": "​Axis Bank among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-among-6-stocks-showing-bullish-rsi-upswing/slideshow/126556547.cms",
            "description": "On January 14, stocks from the NSE large-cap segment featured in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from below is considered an uptrend signal, reflecting strengthening price momentum and growing bullish interest, often tracked by traders to spot potential buying opportunities",
            "pubDate": "2026-01-16T05:34:34.128668"
        },
        {
            "title": "Negative Breakout: These 10 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-cross-below-their-200-dmas/slideshow/126556271.cms",
            "description": "In the Nifty500 pack, 10 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on January 14, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:\"",
            "pubDate": "2026-01-16T05:34:34.128765"
        },
        {
            "title": "Global money returns to US debt, lifting treasury holdings to all-time peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-money-returns-to-us-debt-lifting-treasury-holdings-to-all-time-peak/articleshow/126558428.cms",
            "description": "Foreign holdings of U.S. Treasuries hit an all-time high of $9.355 trillion in November, rebounding after the record 43-day government shutdown. Japan, the UK, and Canada led the gains, while China reduced exposure. Strong inflows reflected renewed global confidence, with Treasury and equity purchases driving a $212 billion net capital inflow.",
            "pubDate": "2026-01-16T05:51:24.777821"
        },
        {
            "title": "Wipro shares rally 4% ahead of Q3 results. What are brokerages expecting?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-rally-4-ahead-of-q3-results-what-are-brokerages-expecting/articleshow/126559823.cms",
            "description": "Wipro shares rose ahead of its Q3 results due later today, as investors tracked expectations of muted growth and margin pressure. Brokerages foresee flat to modest revenue improvement, aided partly by the Harman acquisition, though integration costs and furloughs may weigh on profitability. Street focus remains on guidance, deal momentum and margin outlook.",
            "pubDate": "2026-01-16T07:00:02.190106"
        },
        {
            "title": "Shadowfax IPO opens next week; GMP indicates 12% listing gain. Check key details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shadowfax-ipo-opens-next-week-gmp-indicates-12-listing-gain-check-key-details-here/articleshow/126559550.cms",
            "description": "Shadowfax Technologies is set to launch its Initial Public Offering (IPO) with a total issue size of Rs 1,907.27 crore. The offering consists of a fresh issue of 8.06 crore equity shares worth Rs 1,000 crore, which will be utilised to fund the company’s growth initiatives.",
            "pubDate": "2026-01-16T07:00:02.190231"
        },
        {
            "title": "ICICI Prudential AMC shares surge 7% after Q3 PAT jumps 45% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-amc-shares-surge-7-after-q3-pat-jumps-45-yoy/articleshow/126559463.cms",
            "description": "ICICI Prudential AMC shares rose sharply on Friday after the company posted strong Q3 results, with profit rising 45% year-on-year to Rs 917 crore. Operating performance improved sharply, asset growth remained robust, and equity-led AUM expansion continued. The AMC also announced a dividend and reaffirmed leadership continuity with S. Naren’s reappointment.",
            "pubDate": "2026-01-16T07:00:02.190443"
        },
        {
            "title": "YES Bank Q3 Results Preview: Profit likely to jump 27% YoY, NII seen rising up to 12%; here’s what else to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-q3-preview-profit-likely-up-27-yoy-nii-seen-rising-up-to-12-heres-what-you-can-expect/articleshow/126558949.cms",
            "description": "YES Bank will declare its financial results for the quarter and nine months ended December 31, 2025, and subsequently hold a post-earnings conference call with analysts and investors at 2:45 pm on the same day.",
            "pubDate": "2026-01-16T07:00:02.190541"
        },
        {
            "title": "Yes Bank shares jump 3% ahead of Q3 results tomorrow. Here’s what investors can expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-jump-3-ahead-of-q3-results-tomorrow-heres-what-investors-can-expect/articleshow/126558769.cms",
            "description": "Yes Bank shares saw an uptick on Friday ahead of Q3FY26 results scheduled tomorrow. Investors are optimistic about earnings recovery, with NII and PPOP expected to improve. PAT estimates vary, with Kotak projecting a slight decline and JM Financial forecasting strong year-on-year growth.",
            "pubDate": "2026-01-16T07:00:02.190641"
        },
        {
            "title": "South Indian Bank shares rise nearly 4% after Q3 profit growth, asset quality improves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-indian-bank-shares-rise-nearly-4-after-q3-profit-growth-asset-quality-improves/articleshow/126558673.cms",
            "description": "South Indian Bank shares rose nearly 4% after strong Q3 results showed profit growth, improving asset quality and robust loan expansion. Lower NPAs, stable capital adequacy and bullish technical indicators supported investor sentiment.",
            "pubDate": "2026-01-16T07:00:02.190737"
        },
        {
            "title": "Zen Technologies rallies over 9% after bagging Rs 404 crore Defence orders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zen-technologies-rallies-over-9-after-bagging-rs-404-crore-defence-orders/articleshow/126558616.cms",
            "description": "On the technical front, Trendlyne data shows that Zen Tech’s 14-day Relative Strength Index (RSI) stands at 26.5. An RSI below 30 typically signals an oversold condition, suggesting the stock may have witnessed excessive selling and could be poised for a potential rebound.",
            "pubDate": "2026-01-16T07:00:02.190831"
        },
        {
            "title": "Japan's Nikkei extends fall as rally loses steam",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-extends-fall-as-rally-loses-steam/articleshow/126561237.cms",
            "description": "\"The market priced in the best ‌political scenario where the LDP boosts seats at the election and Takaichi gets backing for spending plans that the stock market has high expectations on.\"",
            "pubDate": "2026-01-16T08:18:01.490923"
        },
        {
            "title": "FIIs boost stake in Suzlon Energy to 23.73% in December quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-boost-stake-in-suzlon-energy-to-23-73-in-december-quarter/articleshow/126561049.cms",
            "description": "On the performance front, Suzlon Energy has delivered a muted return over the past year, declining nearly 14%, but its long-term performance over three years has been remarkable, delivering nearly 400% gains for investors. Analysts remain optimistic, with Trendlyne data showing a “STRONG BUY” consensus from 10 analysts, and an average price target implying upside potential of around 45% from current levels.",
            "pubDate": "2026-01-16T08:18:01.491032"
        },
        {
            "title": "NSE IPO proxy play! Why smallcap IFCI shares jumped 26% in just 1 week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-ipo-proxy-play-why-smallcap-ifci-shares-jumped-26-in-just-1-week/articleshow/126560420.cms",
            "description": "IFCI shares have surged 26% in a week as expectations rise over Sebi potentially approving NSE’s long-delayed IPO this month. The NBFC holds an indirect stake in NSE through SHCIL, whose 4.4% stake is valued at about Rs 23,000 crore. Investor interest has also boosted unlisted NSE shares and lifted BSE stock.",
            "pubDate": "2026-01-16T08:18:01.491231"
        },
        {
            "title": "Will Budget bring back FIIs? Morgan Stanley's Ridham Desai expects 3 reforms to revive foreign flows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-budget-bring-back-fiis-morgan-stanleys-ridham-desai-expects-3-reforms-to-revive-foreign-flows/articleshow/126559892.cms",
            "description": "After $21 billion of sustained selling by foreign institutional investors since early 2025, market strategists are pinning hopes on the Union Budget to revive foreign inflows. Morgan Stanley’s India equity strategist Ridham Desai outlines three key capital market reforms that could help reverse the FII outflow trend and restore investor confidence in Indian equities.",
            "pubDate": "2026-01-16T08:18:01.491323"
        },
        {
            "title": "Buy gold, sell Bitcoin: Jefferies' Chris Wood explains his big bet of 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-gold-sell-bitcoin-jefferies-chris-wood-explains-his-big-bet-of-2026/articleshow/126562462.cms",
            "description": "Jefferies strategist Christopher Wood is selling Bitcoin and shifting to physical gold, citing quantum computing risks to Bitcoin’s cryptography. Accelerating quantum timelines undermine digital assets’ long-term store-of-value case, prompting portfolio reallocation toward gold and mining stocks for resilience globally today.",
            "pubDate": "2026-01-16T09:51:35.836969"
        },
        {
            "title": "‘India’s biggest startup-investment window is now open despite pessimism,’ says Zerodha CEO Nithin Kamath",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-biggest-startup-investment-window-is-now-open-despite-pessimism-says-zerodha-ceo-nithin-kamath/articleshow/126562422.cms",
            "description": "Marking National Startup Day as a moment for introspection, Kamath said that despite near-term uncertainties, the broader environment remains favourable for entrepreneurs. \"I can't think of a better time to build something in India, and for the world, despite all the challenges,\" he added.",
            "pubDate": "2026-01-16T09:51:35.837091"
        },
        {
            "title": "Federal Bank shares zoom 11% to fresh 52-week high after strong Q3 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-reports-9-yoy-growth-in-net-profit-nii-for-q3fy26-stock-shoots-up-11-to-new-52-week-high/articleshow/126562032.cms",
            "description": "Federal Bank delivered a robust Q3FY26 performance, with net profit rising 9% YoY to Rs 1,041 crore, driven by record NII, stronger margins, and healthier asset quality. Post earnings,  shares surged over 11% as improved CASA, lower NPAs, and steady business growth reinforced investor confidence and strengthened the bank’s financial outlook.",
            "pubDate": "2026-01-16T09:51:35.837208"
        },
        {
            "title": "Multibagger small-cap stock Silver Touch Technologies declares 1:5 stock split, 1:1 bonus issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-small-cap-stock-silver-touch-technologies-declares-15-stock-split-11-bonus-issue/articleshow/126563790.cms",
            "description": "Silver Touch Technologies has announced a 1:5 stock split and a 1:1 bonus issue, subject to shareholder approval. The move follows a strong rally, aiming to improve liquidity and affordability without altering shareholder value.",
            "pubDate": "2026-01-16T10:28:37.533759"
        },
        {
            "title": "Sebi proposes introducing trade netting for large foreign investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-introducing-trade-netting-for-large-foreign-investors/articleshow/126563622.cms",
            "description": "The ‍Securities and Exchange Board of ‌India has sought the changes \"in order to enhance operational efficiency and ‍reduce cost of funding\" for ‍foreign ⁠portfolio ⁠investors, it said in a consultation paper.",
            "pubDate": "2026-01-16T10:28:37.533882"
        },
        {
            "title": "Wipro declares interim dividend of Rs 6 per share; payout by Feb 14",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-declares-interim-dividend-of-rs-6-per-share-payout-by-feb-14/articleshow/126564174.cms",
            "description": "In the last 12 months, the company has declared an equity dividend amounting to Rs 11 per share and at a share price of Rs 267.60, Wipro's dividend yield stands at 4.11%, according to Trendlyne data.",
            "pubDate": "2026-01-16T10:58:49.872837"
        },
        {
            "title": "Sebi proposes easing cash settlement norms for foreign investors to cut funding costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-easing-cash-settlement-norms-for-foreign-investors-to-cut-funding-costs/articleshow/126564898.cms",
            "description": "Sebi has proposed allowing FPIs to net cash obligations for same-day buy and sell trades. The move aims to lower funding costs, improve efficiency during high-volume days, and ease liquidity stress without raising systemic risk.",
            "pubDate": "2026-01-16T11:21:25.966212"
        },
        {
            "title": "13 stocks added by 15 MFs in December rally up to 160% in FY26, 5 turn multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/13-stocks-added-by-15-mfs-in-december-rally-up-to-160-in-fy26-5-turn-multibaggers/slideshow/126564724.cms",
            "description": "In December 2025, mutual funds (MFs) maintained strong confidence in Indian equities, with net investments totaling approximately Rs 38,939 crore for the month. According to an ETMarkets analysis, 52 stocks were added to the portfolios of 15 or more mutual fund schemes in December, up from November 2025. Remarkably, 21 of these stocks have delivered price gains exceeding 50% so far in FY26. Additionally, we highlighted 13 stocks that have appreciated between 75% and 160%, including 5 multibaggers in FY26 to date. (Data Source: ACE MF | ACE Equity)",
            "pubDate": "2026-01-16T11:21:25.966417"
        },
        {
            "title": "February 1 Budget to make it a working Sunday for stock market traders. BSE, NSE announce schedule",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/february-1-budget-to-make-it-a-working-sunday-for-stock-market-traders-bse-nse-announce-schedule/articleshow/126565598.cms",
            "description": "In a rare instance, stock exchanges BSE and NSE have decided to keep the equity market open for trading on February 1 despite being a Sunday as Finance Minister Nirmala Sitharaman would present the Union Budget on that day.",
            "pubDate": "2026-01-16T11:55:57.505100"
        },
        {
            "title": "Madhu Kela picks up stake in this stock market proxy player in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/madhu-kela-picks-up-stake-in-this-stock-market-proxy-player-in-q3/articleshow/126569349.cms",
            "description": "Veteran investor Madhu Kela has bought a stake in Emkay Global. This signals new interest in the financial services firm. Ace investor Dolly Khanna has trimmed her holding. Emkay Global is a diversified financial services company. Kela's entry is watched closely. Khanna's move seems like portfolio rebalancing. The company's shares rose on the news.",
            "pubDate": "2026-01-16T13:52:24.174402"
        },
        {
            "title": "Vedanta among 8 stocks that hit 52-week high; rally up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-among-8-stocks-that-hit-52-week-high-rally-up-to-20-in-a-month/slideshow/126567112.cms",
            "description": "On Friday, the benchmark Sensex rose around 188 points to settle at 83,570. Amid a broader market upswing, eight stocks from the BSE 100 index surged to their 52-week highs, marking their strongest levels in the past year. These breakouts are widely viewed by traders and investors as bullish signals, reflecting robust upward momentum and the possibility of further gains ahead.",
            "pubDate": "2026-01-16T13:52:24.174535"
        },
        {
            "title": "Vijay Kedia buys stake in smallcap SPML Infra via bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-buys-stake-in-smallcap-spml-infra-via-bulk-deal/articleshow/126584652.cms",
            "description": "Ace investor Vijay Kedia has acquired a stake in SPML Infra. Kedia Securities bought over 14 lakh shares for approximately Rs 25 crore. SPML Infra is a smallcap infrastructure firm with expertise in power, water, and environment sectors. The company has a strong track record of executing projects across India.",
            "pubDate": "2026-01-16T16:49:06.098965"
        },
        {
            "title": "Sebi approves separate auction session to determine closing stock prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-approves-separate-auction-session-to-determine-closing-stock-prices/articleshow/126583422.cms",
            "description": "Sebi is revamping how stock closing prices are determined in India's equity cash market, moving from a 30-minute average to a new 20-minute Closing Auction Session (CAS). This move aims to enhance price discovery and transparency, aligning with global practices. Initially, CAS will apply to derivative-linked stocks, with a phased rollout starting August 3, 2026.",
            "pubDate": "2026-01-16T16:49:06.099092"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-36/articleshow/126587133.cms",
            "description": "If the current correction and bearish phase continue for a few more weeks, a kind of fatigue could set in on the street. At this juncture, it is important to take into account the fact that the market has its cycles, but the fundamentals of an industry have different cycles. Focus on the fundamentals because, in some cases, geopolitical events will have a fundamental impact on some sectors. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2026-01-16T18:00:28.952236"
        }
    ]
}