{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-12T14:16:21.282809",
    "items": [
        {
            "title": "MSCI rejig to lift India’s weight to 19% in EM index, unlocking inflows of up to $1 billion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/msci-rejig-to-lift-indias-weight-to-19-in-em-index-unlocking-inflows-of-up-to-1-billion/articleshow/118182475.cms",
            "description": "The MSCI reshuffle adds Hyundai Motor India while removing Adani Green Energy, impacting fund flows. IndusInd Bank is set to gain $264 million in passive inflows, while Hyundai’s inclusion may attract $257 million, per Nuvama estimates. Meanwhile, Adani Green’s exclusion could trigger outflows of approximately $170 million.",
            "pubDate": "2025-02-12T14:15:59.688314"
        },
        {
            "title": "These 5 capital goods stocks hit 52-week lows, fell up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-capital-goods-stocks-hit-52-week-lows-fell-up-to-20-in-a-month/slideshow/118182393.cms",
            "description": "On Wednesday, the benchmark Sensex fell by around 123 points, ending at 76,171. During this market decline, five stocks from the BSE Capital Goods Index reached their 52-week lows. A 52-week low reflects the lowest price a stock has traded at in the past year. While this may present buying opportunities for stocks with strong fundamentals, it can also signal potential problems or negative trends within those companies. Investors often use this metric to assess price movements and understand market sentiment.",
            "pubDate": "2025-02-12T14:15:59.688468"
        },
        {
            "title": "Sebi proposes changes in margin pledge system to prevent misuse of clients' securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-changes-in-margin-pledge-system-to-prevent-misuse-of-clients-securities/articleshow/118182144.cms",
            "description": "Sebi on Wednesday issued a draft circular proposing amendments to its margin pledge system to prevent the possible misuse of clients' securities by brokers. These changes aim to enhance transparency and reduce systemic risks associated with clients' securities.",
            "pubDate": "2025-02-12T14:15:59.688580"
        },
        {
            "title": "ICICI Bank to retain majority holding in ICICI Prudential Mutual Fund",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-to-retain-majority-holding-in-icici-prudential-mutual-fund/articleshow/118181473.cms",
            "description": "ICICI Bank on Wednesday said the bank intends to retain majority holding in ICICI Prudential Asset Management Company even though its joint venture partner plans listing and partial divestment of its stake in the fund house.",
            "pubDate": "2025-02-12T14:15:59.688685"
        },
        {
            "title": "Sebi launches MITRA to help investors trace inactive mutual fund folios",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-launches-mitra-to-help-investors-trace-inactive-mutual-fund-folios/articleshow/118180904.cms",
            "description": "In a circular, Sebi said the platform addresses a growing concern wherein investors, over time, lose track of their mutual fund investments lack of updated contact information, or unawareness of investments made in their name.",
            "pubDate": "2025-02-12T14:15:59.688791"
        },
        {
            "title": "Tech View: Nifty forms doji candle; buy-on-dips suggested with 22,780 as key support. How to trade on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-forms-doji-candle-buy-on-dips-suggested-with-22780-as-key-support-how-to-trade-on-thursday/articleshow/118180355.cms",
            "description": "Tech view: Nifty has formed a double bottom pattern and a doji candle near key support levels. The 21-day simple moving average (DSMA) at 23,285 makes the 23,280-23,000 zone a strong resistance. On the downside, 22,780 serves as crucial support. Holding above this level, a buy-on-dips strategy is recommended, says Hrishikesh Yedve of Asit C. Mehta Investment Intermediates.",
            "pubDate": "2025-02-12T14:15:59.688892"
        },
        {
            "title": "CDSL registers 15 crore demat accounts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cdsl-registers-15-crore-demat-accounts/articleshow/118179258.cms",
            "description": "CDSL, Asia’s only listed depository, has surpassed 15 crore demat accounts, highlighting India's booming capital markets. Strong digital adoption and financial literacy continue to drive retail investor participation, reinforcing CDSL’s role in market infrastructure and secure depository services.",
            "pubDate": "2025-02-12T14:15:59.688994"
        },
        {
            "title": "Profitability-focused investment strategies outperform Nifty 50, study shows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/profitability-focused-investment-strategies-outperform-nifty-50-study-shows/articleshow/118178090.cms",
            "description": "Profitable stocks: A Capitalmind study found that profitability-based investment strategies outperformed India's Nifty 50, delivering 17.9% annualized returns versus Nifty’s 12.8%. Despite global traction, factor investing remains underutilized in India, offering resilience during downturns and better risk-adjusted returns.",
            "pubDate": "2025-02-12T14:15:59.689091"
        },
        {
            "title": "Sebi slaps Rs 2.83 cr demand notice on former TV anchor Pandya, 7 others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-slaps-rs-2-83-cr-demand-notice-on-former-tv-anchor-pandya-7-others/articleshow/118177856.cms",
            "description": "Sebi has sent a demand notice to Pradeep Baijnath Pandya, who was anchoring stock market shows on a television channel, and seven other entities for failing to pay Rs 2.83 crore fines that have been imposed in connection with fraudulent trading activities.",
            "pubDate": "2025-02-12T14:15:59.689186"
        },
        {
            "title": "Index returns may be quite misleading to judge returns of retail investors: Kotak Equities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/index-returns-may-be-quite-misleading-to-judge-returns-of-retail-investors-kotak-equities/articleshow/118177240.cms",
            "description": "Kotak noted that taxes and trading costs have eroded retail returns, with weakening trailing returns putting the market “on thin ice.” While Nifty 50 posted a modest 6% gain over 12 months, it saw declines of 5% in six months and 4% in three months. Midcap and smallcap indices performed worse, dropping 11% and 13% over six months, respectively.",
            "pubDate": "2025-02-12T14:15:59.689282"
        },
        {
            "title": "The changing landscape of SIP Investments in India: Anurag Singh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-changing-landscape-of-sip-investments-in-india-anurag-singh/slideshow/118176183.cms",
            "description": "Systematic investment plans (SIPs) in India have witnessed remarkable growth over the past few years, but emerging trends suggest that investor behaviour is shifting. Anurag Singh, Managing Partner at Ansid Capital, highlights concerns about overcrowding in the market, the lack of conviction among investors, and the sustainability of long-term investing strategies. While SIPs were initially designed to avoid market timing, many investors now chase past returns by frequently switching funds. Comparing India’s investment trends to global markets, Singh questions whether the SIP model is truly effective in the long run or if it is merely a result of specific economic cycles.",
            "pubDate": "2025-02-12T14:15:59.689384"
        },
        {
            "title": "Dixon Technologies, Tata Elxsi among 5 stocks with short covering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-tata-elxsi-among-5-stocks-with-short-covering/slideshow/118175049.cms",
            "description": "Short covering happens when traders buy back shares they previously sold short, often due to a shift in market sentiment or new information. This usually results in a decrease in open interest and can drive the stock price higher. In Wednesday's trading session, five stocks saw short covering. Here's the list:",
            "pubDate": "2025-02-12T14:15:59.689514"
        },
        {
            "title": "ITC Hotels shares may rally by 30% led by strong franchise: Jefferies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-shares-may-rally-by-30-led-by-strong-franchise-jefferies/articleshow/118174420.cms",
            "description": "ITC Hotels:  Jefferies initiated coverage on ITC Hotels (ITCH) with a ‘buy’ rating and a target price of Rs 240, citing strong growth potential. It projects a 16%/19% CAGR in EBITDA/PAT over FY24-FY27e and expects occupancy in India to rise to 75% by FY27. ITCH’s debt-free balance sheet and strategic expansion plans support long-term growth, despite short-term challenges in greenfield projects.",
            "pubDate": "2025-02-12T14:15:59.689616"
        },
        {
            "title": "MSCI rejig: RIL, Hyundai, 2 Adani stocks among 14 counters to be affected",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/msci-rejig-ril-hyundai-2-adani-stocks-among-14-counters-to-be-affected/slideshow/118174223.cms",
            "description": "MSCI’s February 2025 rejig has introduced key shifts in its Global Standard Index, with Hyundai Motor India’s inclusion and Adani Green Energy’s exclusion being the most notable changes. Stocks like IndusInd Bank, PB Fintech, and Adani Enterprises gained weight, attracting fresh inflows, while Reliance Industries, ICICI Bank, HDFC Bank, and Infosys saw reductions. Here’s a detailed look at how these 14 stocks would be affected from the reshuffling:",
            "pubDate": "2025-02-12T14:15:59.689718"
        },
        {
            "title": "Mr Contrarian S Naren proved right! Smallcap investors trapped in bear market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mr-contrarian-s-naren-proved-right-smallcap-investors-trapped-in-bear-market/articleshow/118173644.cms",
            "description": "India's smallcap stocks entered bear market territory after renowned investor S Naren warned against investing in them. The smallcap index fell around 7% over three days, reflecting broader market concerns driven by global trade tensions, high valuations, and declining corporate earnings.",
            "pubDate": "2025-02-12T14:15:59.689813"
        },
        {
            "title": "Wipro among 5 stocks that can tumble up to 37%: BNP Paribas",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-among-5-stocks-that-can-tumble-up-to-37-bnp-paribas/slideshow/118173417.cms",
            "description": "The Indian stock market has been plagued with several concerns across key sectors, from stretched valuations in pharma and QSR stocks to slowing credit growth impacting auto demand. While FIIs continue to hold large stakes in Indian equities, their selling could weigh on these stocks in the near term, said BNP Paribas. The brokerage expects earnings growth to moderate in FY25, with several sectors facing headwinds. Among its top sell calls, the brokerage has flagged Wipro, SBI Cards & Payment Services, and TVS Motor. Here’s a closer look at the five stocks the brokerage has put on its sell radar.",
            "pubDate": "2025-02-12T14:15:59.689908"
        }
    ]
}