{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-26T05:26:18.577772",
    "items": [
        {
            "title": "Asian stocks edge up in thin trade, silver hits record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-up-in-thin-trade-silver-hits-record/articleshow/126181016.cms",
            "description": "Asian stocks saw a slight rise on Friday. Japanese and South Korean markets gained as others remained closed for holidays. Silver reached a record high, and gold neared its all-time peak. This movement extends a year-end rally. Investors are watching for a 'Santa Claus Rally' to push stocks higher. China's yuan strengthened past 7 per dollar.",
            "pubDate": "2025-12-26T01:41:26.173544"
        },
        {
            "title": "Stocks in news: IndusInd Bank, Ola Electric, IndiGo, Castrol India, Sun Pharma, RIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indusind-bank-ola-electric-indigo-castrol-india-sun-pharma-ril/articleshow/126177085.cms",
            "description": "Indian markets saw a subdued trading session on Wednesday, ending marginally lower. This consolidation follows a recent surge. Analysts suggest a positive outlook, recommending buying on dips as the Nifty maintains its uptrend. Banking index participation is crucial for further upward movement.",
            "pubDate": "2025-12-26T01:41:26.173671"
        },
        {
            "title": "GIFT Nifty lower 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126177122.cms",
            "description": "Nifty closed marginally lower on Wednesday due to profit-booking in certain sectors. Analysts anticipate a narrow trading range for Indian equities this week, with limited triggers and reduced global market activity. The India VIX remains near historical lows, supporting a bullish sentiment.",
            "pubDate": "2025-12-26T01:41:26.173875"
        },
        {
            "title": "Analysts see 40% upside in Leela Palaces stock on expansion plans, growing travel demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/analysts-see-40-upside-in-leela-palaces-stock-on-expansion-plans-growing-travel-demand/articleshow/126180923.cms",
            "description": "Leela Palaces Hotels & Resorts stock has seen an uptick, driven by expansion plans and growing travel demand. The company's international foray into Dubai and domestic growth, coupled with a widening luxury hospitality demand-supply gap, positions it for future success. Analysts anticipate significant upside, with a 'BUY' rating and a target price of ₹600.",
            "pubDate": "2025-12-26T01:41:26.173997"
        },
        {
            "title": "Merchants crack QR code to secure loans from NBFCs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/merchants-crack-qr-code-to-secure-loans-from-nbfcs/articleshow/126180985.cms",
            "description": "Non-banking finance companies (NBFC) such as Aditya Birla Finance (ABFL), L&T Finance, Poonawala Fincorp, and SMFG India Credit are among those extending credit to small businesses, harnessing the technology backbone offered by payment firms such as BharatPe, Paytm and PhonePe.",
            "pubDate": "2025-12-26T01:41:26.174101"
        },
        {
            "title": "Investors warn of 'rot in private equity' as funds come up with circular deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-warn-of-rot-in-private-equity-as-funds-come-up-with-circular-deals/articleshow/126180887.cms",
            "description": "Private equity firms are increasingly using \"continuation vehicles\" to sell companies to themselves, booking paper gains amid a backlog of unsold businesses. This strategy allows firms to wait for better market conditions, but investors worry about questionable valuations and unrealistic projections, as exemplified by the bankruptcies of Wheel Pros and United Site Services.",
            "pubDate": "2025-12-26T01:41:26.174199"
        },
        {
            "title": "Jupiter Hospital, Reliance-backed co in race for Mumbai SevenHills",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-hospital-reliance-backed-co-in-race-for-mumbai-sevenhills/articleshow/126180902.cms",
            "description": "Two companies are vying to buy SevenHills Healthcare. NK Holdings, backed by Reliance, and Jupiter Hospital have offered similar amounts. The hospital faces a long legal dispute over land compensation. Creditors are reviewing the bids. The Visakhapatnam hospital was recently sold.",
            "pubDate": "2025-12-26T01:41:26.174389"
        },
        {
            "title": "RBI may pump in ₹1 lakh cr more for liquidity comfort",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-pump-in-1-lakh-cr-more-for-liquidity-comfort/articleshow/126180859.cms",
            "description": "The Reserve Bank of India may inject an additional ₹1 lakh crore in February-March 2026 to maintain surplus liquidity in the banking system. This move aims to encourage banks to lower lending rates and stimulate credit demand, addressing the current liquidity deficit caused by forex interventions and tax outflows.",
            "pubDate": "2025-12-26T01:41:26.174493"
        },
        {
            "title": "Ola Electric shares in focus after Rs 366.78 crore PLI incentive sanctioned for FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-after-rs-366-78-crore-pli-incentive-sanctioned-for-fy25/articleshow/126181970.cms",
            "description": "Ola Electric Mobility shares are likely to stay in focus after the company secured a Rs 366.78 crore incentive under the PLI-Auto Scheme for FY25. The sanction underscores government support for domestic EV manufacturing, localisation and advanced automotive technology, strengthening Ola Electric’s position in India’s electric mobility ecosystem.",
            "pubDate": "2025-12-26T03:14:28.337845"
        },
        {
            "title": "PNB Housing Finance among 4 stocks flashing bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-housing-finance-among-4-stocks-flashing-bullish-signals-indicating-possible-uptrend/slideshow/126181895.cms",
            "description": "On December 24, four stocks from the Nifty500 universe appeared on the bullish White Marubozu scanner, according to technical scan data from stockedge.com. A White Marubozu is a bullish candlestick pattern in technical analysis that forms when the opening price is the lowest and the closing price is the highest for a given period.Depicted as a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, the pattern signals strong buying pressure throughout the session. Traders interpret this as buyers remaining in control from open to close, often using it to assess potential future price movements.",
            "pubDate": "2025-12-26T03:14:28.337972"
        },
        {
            "title": "IndusInd Bank shares in focus as SFIO initiates probe into Rs 2,600 crore accounting discrepancies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-as-sfio-initiates-probe-into-rs-2600-crore-accounting-discrepancies/articleshow/126181816.cms",
            "description": "IndusInd Bank shares are set to remain in focus after the SFIO sought information as part of an ongoing probe into accounting irregularities flagged during audits. The investigation covers internal derivative trades, misclassified assets and liabilities, and microfinance income entries, following disclosures of discrepancies totalling Rs 2,600 crore.",
            "pubDate": "2025-12-26T03:14:28.338082"
        },
        {
            "title": "Hindustan Copper among 4 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-among-4-stocks-closed-crossing-above-vwap/slideshow/126181787.cms",
            "description": "On December 24, the closing prices of four stocks in the Nifty 500 pack rallied by more than 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to Stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-12-26T03:14:28.338183"
        },
        {
            "title": "DCM Shriram Industries shares in focus as demerger record date takes effect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dcm-shriram-industries-shares-in-focus-as-demerger-record-date-takes-effect/articleshow/126181747.cms",
            "description": "DCM Shriram Industries shares are in focus as the stock trades ex-demerger following its approved scheme. Shareholders on the record date will receive a 1:1:1 ratio of shares in the residual company, DCM Shriram Fine Chemicals Ltd, and DCM Shriram International Ltd.",
            "pubDate": "2025-12-26T03:14:28.338316"
        },
        {
            "title": "Adani Ports and Special Economic Zone among 4 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-and-special-economic-zone-among-4-nifty-stocks-showing-bullish-rsi-upswing/slideshow/126181699.cms",
            "description": "On December 24, four stocks in the Nifty50 segment were flagged under the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal is generated when the RSI crosses above the 50 mark from below. “RSI trending up” indicates that the Relative Strength Index values are rising, suggesting strengthening price momentum. This may point to potential upward movement and is often used by traders to identify possible buying opportunities.",
            "pubDate": "2025-12-26T03:14:28.338417"
        },
        {
            "title": "Positive Breakout: These 8 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-cross-above-their-200-dmas/slideshow/126181291.cms",
            "description": "In the Nifty500 pack, eight stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 24, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-26T03:14:28.338514"
        },
        {
            "title": "Penny stock approaches record date for 1:10 stock split. Last chance to buy today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/penny-stock-approaches-record-date-for-110-stock-split-last-chance-to-buy-today/articleshow/126181228.cms",
            "description": "Investors in Caspian Corporate Services have until December 26 to buy shares before a 10-for-1 consolidation takes effect. The stock will trade ex-consolidation on December 29, with the record date set for the same day. This move will revert the equity shares' face value to Rs 10 from Rs 1, undoing a 2013 stock split.",
            "pubDate": "2025-12-26T03:14:28.338607"
        },
        {
            "title": "PSU banks are quietly eating private banks’ lunch? Motilal Oswal says HDFC Bank, ICICI Bank, SBI and AU Bank matter most",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-banks-are-quietly-eating-private-banks-lunch-motilal-oswal-says-hdfc-bank-icici-bank-sbi-and-au-bank-matter-most/articleshow/126182461.cms",
            "description": "PSU banks gain MSME and home loan share, but Motilal Oswal backs HDFC Bank, ICICI Bank, SBI and AU Bank as cycle stabilises.",
            "pubDate": "2025-12-26T04:05:03.495890"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama bet on Prestige Estates & Brigade Enterprises; Motilal recommends ICICI & HDFC Bank among top picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-bet-on-prestige-estates-brigade-enterprises-motilal-recommends-icici-hdfc-bank-among-top-picks/articleshow/126182398.cms",
            "description": "Nuvama and Motilal Oswal remain selective but constructive on real estate and financials, backing strong market leaders amid sectoral resets.",
            "pubDate": "2025-12-26T04:05:03.496024"
        },
        {
            "title": "Hindustan Zinc shares in focus as silver prices scale record highs, surge past $75 mark",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-as-silver-prices-scale-record-highs-surge-past-75-mark/articleshow/126182369.cms",
            "description": "Hindustan Zinc shares: Silver hit fresh lifetime highs above $75 an ounce, up over 140% in 2025, driven by strong industrial demand from solar, EVs and electronics, safe-haven buying amid geopolitical tensions, and tight global supply, with hopes of U.S. rate cuts adding to investor optimism.",
            "pubDate": "2025-12-26T04:05:03.496238"
        },
        {
            "title": "FII exodus: Rs 2 lakh crore bleeds from 6 key sectors as India's market appeal dims",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-exodus-rs-2-lakh-crore-bleeds-from-6-key-sectors-as-indias-market-appeal-dims/articleshow/126182321.cms",
            "description": "FIIs have pulled out heavily from Indian equities in 2025, but brokerages see scope for stabilisation and a gradual reversal. While IPO activity and global return differentials have diverted foreign flows, expectations of Fed rate cuts, improving earnings visibility and normalised valuations could support sentiment. Most brokerages recommend a selective, buy-on-dips strategy heading into 2026.",
            "pubDate": "2025-12-26T04:05:03.496336"
        },
        {
            "title": "BEL, BDL, other defence stocks in focus ahead of year-end DAC meeting today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-bdl-other-defence-stocks-in-focus-ahead-of-year-end-dac-meeting-today/articleshow/126182226.cms",
            "description": "Shares of defence companies are set to be in focus ahead of the Defence Acquisition Council meeting, where emergency procurement proposals are expected to be discussed. Potential approvals could fast-track new defence orders, benefiting manufacturers and suppliers amid the government’s push for domestic production and heightened operational preparedness.",
            "pubDate": "2025-12-26T04:05:03.496441"
        },
        {
            "title": "Nuvama Wealth Management among 5 F&O stocks that saw a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-wealth-management-among-5-fo-stocks-that-saw-a-sharp-rise-in-futures-open-interest/slideshow/126182026.cms",
            "description": "As of December 24, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% as compared to the previous trade.A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-26T04:05:03.496662"
        },
        {
            "title": "IEX shares slide over 4% after CERC rolls out VPPA framework",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-slide-over-4-after-cerc-rolls-out-vppa-framework/articleshow/126183225.cms",
            "description": "Shares of Indian Energy Exchange fell sharply after CERC introduced a framework for Virtual Power Purchase Agreements, raising concerns over potential impact on exchange-based power trading volumes amid broader regulatory uncertainty.",
            "pubDate": "2025-12-26T04:59:19.778805"
        },
        {
            "title": "RVNL, IRFC and other railway-linked stocks surge up to 10% as new railway fares kick in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-irfc-and-other-railway-linked-stocks-surge-up-to-10-as-new-railway-fares-kick-in/articleshow/126183142.cms",
            "description": "Railway stocks including RVNL, IRFC, IRCTC, and Jupiter Wagons surged up to 10% on Friday as new passenger fares came into effect, marking the second hike this year and boosting investor sentiment ahead of the Union Budget 2026-27.",
            "pubDate": "2025-12-26T04:59:19.778926"
        },
        {
            "title": "Sensex, Nifty edge lower in thin year-end trade ahead of earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-edge-lower-in-thin-year-end-trade-ahead-of-earnings/articleshow/126182558.cms",
            "description": "Indian stocks opened slightly lower on Friday, with both the Sensex and Nifty struggling for direction. Thin year-end trading volumes saw investors holding back on fresh bets ahead of upcoming earnings cues. Market participants believe future upside will depend on earnings momentum rather than short-term flows.",
            "pubDate": "2025-12-26T04:59:19.779138"
        },
        {
            "title": "Tata vs Reliance Industries vs Adani: Which conglomerate made stock market investors poorer in 2025 & why?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-vs-reliance-industries-vs-adani-which-conglomerate-made-stock-market-investors-poorer-in-2025-why/articleshow/126182471.cms",
            "description": "Tata Group experienced a significant market value erosion in 2025, underperforming rivals like Reliance and Adani. Key drags included sharp losses in Tata Motors Passenger Vehicles and Tata Consultancy Services, despite some bright spots. Investors now await a turnaround in 2026, focusing on earnings visibility and execution.",
            "pubDate": "2025-12-26T04:59:19.779251"
        },
        {
            "title": "Suzlon Energy share price gain  0.87% as Sensex  falls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-share-price-gain-0-87-as-sensex-falls/articleshow/126183441.cms",
            "description": "Suzlon Energy share price: On the technical charts, the RSI of the stock stood at 51.31.",
            "pubDate": "2025-12-26T05:26:17.866117"
        }
    ]
}