{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-04T14:19:38.535680",
    "items": [
        {
            "title": "Q2 results: Nifty companies show zero profit growth leading to downgrades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-nifty-companies-show-zero-profit-growth-leading-to-downgrades/articleshow/114932310.cms",
            "description": "September quarter results reveal weaker-than-expected earnings, with a flat YoY growth for 34 Nifty companies. Key downgrades in earnings estimates affected FY25 and FY26 projections, led by BPCL, Reliance Industries, and Coal India. Mixed performance noted across banks, IT, consumer, and oil marketing companies.",
            "pubDate": "2024-11-04T06:52:39.837160"
        },
        {
            "title": "Q2 results today: IRFC, IRCTC, Raymond among 47 companies to announce earnings on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-irfc-irctc-raymond-among-47-companies-to-announce-earnings-on-monday/articleshow/114926577.cms",
            "description": "Key companies, including IRFC, IRCTC, and Raymond, are set to announce their quarterly earnings today. Amara Raja Energy is anticipated to report a 17% YoY growth in net profit and a 10% YoY increase in revenue, driven by solid performance in the aftermarket division and new energy business.",
            "pubDate": "2024-11-04T06:52:39.837288"
        },
        {
            "title": "IRFC Q2 Results: PAT jumps 4% YoY to Rs 1,612 crore, revenue up by 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irfc-q2-results-pat-jumps-4-yoy-to-rs-1612-crore-revenue-up-by-2/articleshow/114944680.cms",
            "description": "Indian Railway Finance Corporation (IRFC) reported a 4% YoY jump in net profit to Rs 1,612.65 crore in Q2FY25. Revenue from operations increased by 2% to Rs 6,899.34 crore. The company declared an interim dividend of Rs 0.80 per share.",
            "pubDate": "2024-11-04T10:38:22.117947"
        },
        {
            "title": "Exide Industries Q2 Results: PAT drops 14% to Rs 233 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/exide-industries-q2-results-pat-drops-14-to-rs-233-crore/articleshow/114944488.cms",
            "description": "Battery maker Exide Industries Ltd on Monday reported a 13.66 per cent decline in consolidated profit after tax at Rs 233.4 crore in the September quarter, impacted by higher expenses.",
            "pubDate": "2024-11-04T10:38:22.118061"
        },
        {
            "title": "Titan Q2 Preview: Profit likely to decline up to 27% on one-time exceptional charge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titan-q2-preview-profit-likely-to-decline-up-to-27-on-one-time-exceptional-charge/articleshow/114942230.cms",
            "description": "Net profit for the July-September 2024 quarter is expected to decline by up to 27% year-on-year, based on the average estimate from four brokerages. In contrast, net sales are projected to increase by 3% year-on-year during the same period, according to the estimates.",
            "pubDate": "2024-11-04T10:38:22.118165"
        },
        {
            "title": "ABB India Q2 Results: PAT jumps 21% YoY to Rs 440 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/abb-india-q2-results-pat-jumps-21-yoy-to-rs-440-crore/articleshow/114950217.cms",
            "description": "\"We have delivered another quarter of consistent performance, creating balanced and profitable growth for our stakeholders and deepening engagement with our customers. The quarter was marked by record levels of backlog complemented by a strong book to bill and cash,\" the company's Managing Director, Sanjeev Sharma said in a statement.",
            "pubDate": "2024-11-04T14:19:36.184154"
        },
        {
            "title": "IRCTC Q2 Results: PAT rises 4% YoY to Rs 308 cr; co declares dividend of Rs 4/share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irctc-q2-results-pat-rises-4-yoy-to-rs-308-cr-co-declares-dividend-of-rs-4/share/articleshow/114949545.cms",
            "description": "The company reported consolidated revenue from operations of Rs 1,064 crore for the reporting period, a 7% increase from Rs 992 crore in the same period last year. The board has announced an interim dividend of Rs 4 per share with a face value of Rs 2 each for FY25. November 14 has been set as the record date to determine shareholder eligibility for the dividend distribution.",
            "pubDate": "2024-11-04T14:19:36.184288"
        },
        {
            "title": "NSE Q2 Results: Profit jumps 57% YoY to Rs 3,137 crore, revenue rises 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nse-q2-results-profit-jumps-57-yoy-to-rs-3137-crore-revenue-up-24/articleshow/114948350.cms",
            "description": "India's largest bourse National Stock Exchange (NSE), which is gearing up for its IPO next year, on Monday announced that its Q2 consolidated profit after tax jumped 57% year-on-year (YoY) to Rs 3,137 crore due to an 8% drop in expenses.",
            "pubDate": "2024-11-04T14:19:36.184397"
        },
        {
            "title": "Dr Reddy's Labs Q2 Preview: Healthy double-digit revenue growth seen, but PAT may fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-q2-preview-healthy-double-digit-revenue-growth-seen-but-pat-may-fall/articleshow/114944811.cms",
            "description": "For the July-September 2024 period, net profit is expected to decline by 3% year-on-year, based on the average estimate from four brokerages. Sales, however, are projected to increase by 13% year-on-year, according to the estimates.",
            "pubDate": "2024-11-04T14:19:36.184498"
        }
    ]
}