{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-18T02:33:41.857356",
    "items": [
        {
            "title": "Strides Founder raises Rs 1000 crore to refinance debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strides-founder-raises-rs-1000-crore-to-refinance-debt/articleshow/124652167.cms",
            "description": "Arun Kumar, founder of Strides Group and OneSource, has secured ₹1,000 crore by pledging shares. This move refinances existing loans, extending maturities and simplifying repayments. The transaction aims to consolidate smaller borrowings into larger, long-term facilities. It reflects a broader effort to clean up the promoter's balance sheet and shows a decline in pledged shares, indicating deleveraging.",
            "pubDate": "2025-10-18T02:33:40.041368"
        },
        {
            "title": "PSBs reap gains from rising interest income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-india-central-bank-and-uco-bank-post-q2-profit-gains-despite-margin-pressure/articleshow/124652381.cms",
            "description": "Public sector banks Uco Bank, Central Bank of India, and Bank of India reported increased net profits in the September quarter, driven by higher interest income and reduced provisions. Despite a dip in net interest margins, all three banks saw loan growth outpace deposit growth, indicating a positive operational trend.",
            "pubDate": "2025-10-18T02:33:40.041524"
        },
        {
            "title": "After a tough quarter, SFBs hope for credit quality, growth uptick",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-bank-jana-ujjivan-report-lower-q2-net-profit-on-higher-expenses-credit-cost/articleshow/124652260.cms",
            "description": "Small finance banks faced profitability pressures in the second quarter due to higher credit costs and expenses. AU Small Finance Bank saw a dip in net profit, while Ujjivan and Jana reported significant drops. Lenders expressed confidence in improving credit quality from unsecured business in the coming quarter.",
            "pubDate": "2025-10-18T02:33:40.041959"
        }
    ]
}