{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-11T01:42:57.159359",
    "items": [
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125900611.cms",
            "description": "Indian stock markets closed lower for the third day in a row. Early gains were lost as traders took profits. Analysts anticipate markets will follow global trends, with a focus on US monetary policy. Foreign investors sold shares, while domestic investors bought them. The Indian Rupee weakened against the US Dollar.",
            "pubDate": "2025-12-11T01:42:42.963937"
        },
        {
            "title": "Stocks in news: Jio Financial, Adani Green, Nestle, Cipla, IOC, Waaree Energies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-jio-financial-adani-green-nestle-cipla-ioc-waaree-energies/articleshow/125900591.cms",
            "description": "Indian markets saw volatility and closed lower on Wednesday. Analysts are watching key support levels. Several companies are in focus due to recent developments. Jio Financial and BlackRock are investing in their joint venture. Adani Enterprises' rights issue saw strong demand. Adani Green experienced a large block deal. Cipla launched a new medication. IOC is planning board restructuring.",
            "pubDate": "2025-12-11T01:42:42.964055"
        },
        {
            "title": "Asian stocks advance as Fed’s rate cut lifts mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-advance-as-feds-rate-cut-lifts-mood/articleshow/125900571.cms",
            "description": "Asian markets followed Wall Street higher after the US Federal Reserve lowered interest rates. Fed Chair Jerome Powell indicated confidence in the US economy's future. This move boosted tech and financial stocks across Asia. Investors anticipate positive trends for Asian equities and currencies. Export companies are expected to benefit from improved US growth prospects.",
            "pubDate": "2025-12-11T01:42:42.964145"
        },
        {
            "title": "Large caps set to deliver; annual market returns could be 12-14%: Raamdeo Agrawal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/large-caps-set-to-deliver-annual-market-returns-could-be-12-14-raamdeo-agrawal/articleshow/125900493.cms",
            "description": "Large-cap stocks are expected to lead market gains in the coming years. Motilal Oswal Financial Services chairman Raamdeo Agrawal sees significant potential in autos and capital markets. He believes the economy is transitioning towards car ownership, similar to China's growth phase. Specific companies in these sectors are highlighted as strong investment opportunities for wealth creation.",
            "pubDate": "2025-12-11T01:42:42.964232"
        },
        {
            "title": "Pension funds can now invest in more stocks, gold, silver ETFs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pension-funds-can-now-invest-in-more-stocks-gold-silver-etfs/articleshow/125900442.cms",
            "description": "Pension regulator PFRDA has revised investment rules, allowing private pension funds to invest in the top 250 market-cap stocks and gold/silver ETFs for better returns. These changes aim to boost pension fund popularity by offering wider options to savers, with the private sector overseeing ₹15.78 trillion in assets.",
            "pubDate": "2025-12-11T01:42:42.964315"
        },
        {
            "title": "TotalEnergies divests Adani Green shares worth Rs 2,778 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/totalenergies-divests-adani-green-shares-worth-rs-2778-cr/articleshow/125900393.cms",
            "description": "TotalEnergies Renewables Indian Ocean divested shares worth ₹2,778.1 crore in Adani Green Energy through a block deal on Wednesday. The entity sold 2.86 crore shares at ₹970 each, reducing its stake by 1.74%. Quant Mutual Fund and Authum Investment & Infrastructure were among the buyers.",
            "pubDate": "2025-12-11T01:42:42.964402"
        },
        {
            "title": "Kotak Securities sees 13% rise in Nifty by next December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-securities-sees-13-rise-in-nifty-by-next-december/articleshow/125900368.cms",
            "description": "Kotak Securities is optimistic about the stock markets, setting a Nifty target of 29,120 by December 2026, driven by strong earnings growth expectations. The brokerage anticipates over 17% earnings growth for 2027, with improved macro conditions and policy decisions expected to fuel gains. They favor BFSI, technology, healthcare, and hospitality sectors, while also noting positive outlooks for gold and silver.",
            "pubDate": "2025-12-11T01:42:42.964484"
        },
        {
            "title": "Adani Enterprises rights issue oversubscribed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-rights-issue-oversubscribed/articleshow/125900347.cms",
            "description": "Adani Enterprises' ₹25,000 crore rights issue concluded with 108% subscription, attracting applications for 149.5 million shares. The issue, priced at ₹1,800 per share, saw public investors oversubscribe their portion by 30%. Funds raised will be used for debt reduction and capital expenditure.",
            "pubDate": "2025-12-11T01:42:42.964575"
        },
        {
            "title": "Fixed deposit growth finds its key driver in rural incomes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fixed-deposit-growth-finds-its-key-driver-in-rural-incomes/articleshow/125900517.cms",
            "description": "Savings deposits in rural centres also posted a robust 10% increase, the fastest pace in six quarters. Experts attribute this shift to rising rural incomes while growth in the metro areas appears to be losing momentum as financially savvy investors increasingly divert funds into higher-yielding avenues such as mutual funds and equities.",
            "pubDate": "2025-12-11T01:42:42.964654"
        },
        {
            "title": "Stock Radar: Breakout from Ascending Triangle pattern makes Infosys an attractive buy check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-breakout-from-ascending-triangle-pattern-makes-infosys-an-attractive-buy-check-target-stop-loss/articleshow/125889128.cms",
            "description": "Infosys stock has broken out of a bullish technical pattern. This suggests a potential upward movement for the IT major. Experts recommend buying the stock now or on minor dips. The target price is set at Rs 2,000 within the next three to four months. This development offers an attractive opportunity for investors in the IT sector.",
            "pubDate": "2025-12-11T01:42:42.964734"
        },
        {
            "title": "RBI may maintain repo rate at 5.25% through FY27: Fitch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-maintain-repo-rate-at-5-25-through-fy27-fitch/articleshow/125900329.cms",
            "description": "The commentary from BMI comes amid many economists and bond-market experts in India factoring in a further quarter percentage point reduction in policy rates, lowering terminal rate expectations to 5% in the current easing cycle after RBI looked past a sharply retreating rupee to deliver a rate cut last Friday.",
            "pubDate": "2025-12-11T01:42:42.964963"
        },
        {
            "title": "ReNew Power to raise $800m to refinance debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/renew-power-to-raise-800m-to-refinance-debt/articleshow/125900413.cms",
            "description": "ReNew Power is raising $800 million through a five-year loan, with Societe Generale, Standard Chartered, and SMBC acting as lead banks. This significant borrowing, likely to be priced next quarter, will be used to refinance operational projects, aiming for a rate of 350-400 basis points over SOFR.",
            "pubDate": "2025-12-11T01:42:42.965114"
        }
    ]
}