{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-10T05:56:48.688782",
    "items": [
        {
            "title": "SBI Life, HDFC Life shares trade 3% lower as GST cut on insurance premiums postponed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-life-hdfc-life-shares-trade-3-lower-as-gst-cut-on-insurance-premiums-postponed/articleshow/113215403.cms",
            "description": "SBI Life shares dropped by 3.3%, reaching Rs 1,839.50, while HDFC Life experienced a 3% decline to Rs 714.20. Star Health and Allied Insurance Company also saw a 1.4% decrease, hitting a day's low of Rs 618 The 54th GST Council meeting was anticipated to offer relief to individuals and senior citizens by addressing the Goods and Services Tax (GST) rate on health insurance premiums. Currently, health and life insurance policies are taxed at an 18% GST rate.",
            "pubDate": "2024-09-10T05:56:26.019017"
        },
        {
            "title": "US election is just one risk among many for nervous stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-election-is-just-one-risk-among-many-for-nervous-stock-market/articleshow/113215149.cms",
            "description": "Growing risks to the U.S. stock rally are driving demand for portfolio hedging, as investors face economic uncertainty, shifting Federal Reserve policy, and a looming presidential election. The Cboe Volatility Index is elevated, reflecting concerns over potential market swings ahead of the high-stakes debate between Kamala Harris and Donald Trump.",
            "pubDate": "2024-09-10T05:56:26.019133"
        },
        {
            "title": "JK Cement, SBI Card among 4 fresh buy ideas from Axis Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jk-cement-sbi-card-among-4-fresh-buy-ideas-from-axis-securities/slideshow/113213967.cms",
            "description": "Indian benchmark index Nifty has registered a new all time high of 25,268 indicating bullish sentiments and the overall long term trend remains intact offering buying opportunities near the support zone, Axis Securities said in a note. This brokerage picks four stocks as September month's fresh ideas based on the technicals. Here's what it recommends",
            "pubDate": "2024-09-10T05:56:26.019281"
        },
        {
            "title": "Astrazeneca, Natco Pharma shares rally 4% after GST cut on cancer drugs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/astrazeneca-natco-pharma-shares-rally-4-after-gst-cut-on-cancer-drugs/articleshow/113214836.cms",
            "description": "In reaction to the update, pharma stocks like Astrazeneca Pharma surged 4.4% to its day’s high of Rs 7,069 on BSE while Fortis Healthcare shares went up by 3% to Rs 563.55 and those of Natco Pharma shot up 2.5% to Rs 1,585.",
            "pubDate": "2024-09-10T05:56:26.019388"
        },
        {
            "title": "Naturewings Holidays shares debut with 28% premium on BSE SME platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/naturewings-holidays-shares-debut-with-28-premium-on-bse-sme-platform/articleshow/113213632.cms",
            "description": "Naturewings Holidays shares made a strong debut on the BSE SME platform, listing at Rs 95, a 28.4% premium over the issue price of Rs 74. The IPO saw robust investor interest with a subscription rate of 300 times. The funds will be used for working capital, marketing, and corporate purposes.",
            "pubDate": "2024-09-10T05:56:26.019491"
        },
        {
            "title": "Street Favourites! 8 large & midcap stocks that can clock up to 30% returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/street-favourites-8-large-midcap-stocks-that-can-clock-up-to-30-returns/slideshow/113213310.cms",
            "description": "Several brokerages are bullish on a variety of stocks across sectors like banking, finance, and iron & steel. According to Trendlyne data, eight large and midcap stocks from the Nifty200 index, including IndusInd Bank, Canara Bank, Adani Ports, and APL Apollo Tubes, have high analyst ratings and are projected to deliver up to 30% returns. Here's a closer look:",
            "pubDate": "2024-09-10T05:56:26.019587"
        },
        {
            "title": "Bikaji Foods, Gopal Snacks, Prataap Snacks shares surge up to 8.5% after GST cuts on namkeen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bikaji-foods-gopal-snacks-prataap-snacks-shares-surge-up-to-8-5-after-gst-cuts-on-namkeen/articleshow/113212816.cms",
            "description": "Shares of Gopal Snacks rose 8.5% to Rs 354 while those of Prataap Snacks surged by 8% to 877. Meanwhile Bikaji Foods International shares went up by 7.7% to Rs 899 in an early intraday trade.",
            "pubDate": "2024-09-10T05:56:26.019682"
        },
        {
            "title": "Share buyback boom: Promoters wooing HNIs before new tax rules spoil the charm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/share-buyback-boom-promoters-wooing-hnis-before-new-tax-rules-spoil-the-charm/articleshow/113212705.cms",
            "description": "Promoters of Indian companies are rushing to complete share buybacks before new tax rules take effect on October 1. The changes will shift the tax burden from companies to shareholders, making buybacks less attractive for high-net-worth individuals. Several companies have already completed or announced buyback offers in anticipation of the new rules.",
            "pubDate": "2024-09-10T05:56:26.019778"
        },
        {
            "title": "Sensex jumps 150 pts, Nifty reclaims 25,000 tracking rally in US stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-150-pts-nifty-reclaims-25000-tracking-rally-in-us-stocks/articleshow/113212270.cms",
            "description": "Within Nifty, Power Grid, Divi's Lab, Bharti Airtel, and Apollo Hospitals were the top gainers and went up to 1-2% each.",
            "pubDate": "2024-09-10T05:56:26.019868"
        },
        {
            "title": "Stocks to buy today: IRCTC, ONGC among top 10 trading ideas for 10 September 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-irctc-ongc-among-top-10-trading-ideas-for-10-september-2024/articleshow/113212281.cms",
            "description": "The Indian market is expected to consolidate on Tuesday, influenced by mixed global cues. Nifty futures closed with a gain of 0.35% at 24,993 levels on Monday. Experts have recommended various stocks for short-term trading, including Britannia Industries, Havells India, and Dabur India among others. Options data suggests a broader trading range between 24,500 to 25,400 zones.",
            "pubDate": "2024-09-10T05:56:26.019967"
        },
        {
            "title": "F&O Ban List: Biocon, Chambal Fertilizers among 7 stocks under trade ban on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-ban-list-biocon-chambal-fertilizers-among-7-stocks-under-trade-ban-on-tuesday/articleshow/113211565.cms",
            "description": "Seven stocks, including Aditya Birla Fashion and Retail, Balrampur Chini, and Bandhan Bank, are under F&O trade ban as their open interest crossed 95% of market-wide position limits. The ban is lifted only if open interest falls below 80%. Nifty and Sensex closed higher, driven by banks and FMCG stocks.",
            "pubDate": "2024-09-10T05:56:26.020059"
        },
        {
            "title": "Hot stocks: Brokerage view on Infosys, SBI Life, ICICI Bank, Suzlon and Marico",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerage-view-on-infosys-sbi-life-icici-bank-suzlon-and-marico/articleshow/113211499.cms",
            "description": "Brokerage firms have shared their latest ratings on various companies. Citi has a neutral view on Infosys, InCred holds SBI Life, CLSA rates ICICI Bank as outperform, Morgan Stanley is overweight on Suzlon Energy, and Goldman Sachs recommends buying Marico. These ratings reflect current market trends and company performance.",
            "pubDate": "2024-09-10T05:56:26.020151"
        },
        {
            "title": "F&O Radar | Deploy Broken Wing strategy in Dabur for potential gains from breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-broken-wing-strategy-in-dabur-for-potential-gains-from-breakout/articleshow/113210940.cms",
            "description": "Dabur stock prices have been on an upward trend since April 2024, recently breaking out of an inverted Head & Shoulders pattern. Trading at Rs 662.35, the stock has surpassed its Rs 660 resistance level. Analysts suggest it could target Rs 700-715, with immediate support at Rs 635.",
            "pubDate": "2024-09-10T05:56:26.020238"
        },
        {
            "title": "Andhra Paper 1:5 stock split record date tomorrow; last day to buy for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/andhra-paper-15-stock-split-record-date-tomorrow-last-day-to-buy-for-eligibility/articleshow/113210270.cms",
            "description": "Andhra Papers has announced a 1:5 stock split, effective from September 11, 2024. Shareholders on record by this date will see each Rs 10 share divided into five Rs 2 shares. This move follows a previous split in 2001. Andhra Paper's stock has seen mixed performance over the past year.",
            "pubDate": "2024-09-10T05:56:26.020327"
        },
        {
            "title": "These 10 stocks will trade ex-dividend from tomorrow. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-stocks-will-trade-ex-dividend-from-tomorrow-do-you-own-any/articleshow/113210223.cms",
            "description": "TV Today Network and 10 other companies will be in focus today as they have set September 11 as the record date for determining shareholders eligible for dividend payments. Today is the last day to buy shares to qualify for dividends. Dividends are paid to shareholders listed on the record date.",
            "pubDate": "2024-09-10T05:56:26.020418"
        },
        {
            "title": "Shree Tirupati Balajee Agro Trading share allotment soon: Check status, GMP, listing date and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shree-tirupati-balajee-agro-trading-share-allotment-soon-check-status-gmp-listing-date-and-other-details/articleshow/113210037.cms",
            "description": "Shree Tirupati Balajee IPO Allotment: The share allotment for Shree Tirupati Balajee Agro Trading IPO is expected to be finalized today. Investors can check their allotment status via BSE or the registrar's website. The IPO received a strong response with a subscription of 124 times. The company plans to use the proceeds for debt repayment and working capital needs.",
            "pubDate": "2024-09-10T05:56:26.020502"
        }
    ]
}