{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-02T12:50:41.461460",
    "items": [
        {
            "title": "Vodafone Idea shares in focus on receiving Rs 638 crore GST order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-on-receiving-rs-638-crore-gst-order/articleshow/126297312.cms",
            "description": "Vodafone Idea shares are likely to stay in focus after the company received a CGST order confirming a tax demand, including penalty and interest. The telecom operator has disputed the order and plans to take legal action, stating that the potential financial impact could extend to the full amount demanded by the tax authorities.",
            "pubDate": "2026-01-02T03:05:40.634127"
        },
        {
            "title": "Tata Steel shares in focus as CEO flags lowest steel prices in 5 years, global headwinds, and expansion plans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-in-focus-as-ceo-flags-lowest-steel-prices-in-5-years-global-headwinds-and-expansion-plans/articleshow/126297234.cms",
            "description": "Tata Steel shares may remain in focus after CEO T V Narendran highlighted pricing pressures from global oversupply, Chinese exports and trade barriers in 2025. Despite challenges in overseas markets, resilient domestic operations and ongoing capacity expansions underline the company’s strategic focus on value-added growth and long-term operational resilience.",
            "pubDate": "2026-01-02T03:05:40.634238"
        },
        {
            "title": "Avanti Feeds among 4 stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/avanti-feeds-among-4-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126297167.cms",
            "description": "On January 1, in the NSE list of stocks with a market cap over Rs 10,000 crore, four stocks came to the bullish scanner of “White Marubozu”, according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or non-existent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns to assess potential future price movements.",
            "pubDate": "2026-01-02T03:05:40.634340"
        },
        {
            "title": "Adani Power, Vodafone Idea among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-vodafone-idea-among-5-stocks-showing-bullish-rsi-upswing/slideshow/126297086.cms",
            "description": "On January 1, 2026, five stocks from the Nifty200 segment were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. An uptrend signal is generated when the RSI crosses above 50 from below. “RSI trending up” indicates strengthening momentum, suggesting potential upward movement and possible buying opportunities.",
            "pubDate": "2026-01-02T03:05:40.634435"
        },
        {
            "title": "ITC, Godfrey Phillips shares in focus amid sharp excise duty hike on cigarettes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-godfrey-phillips-shares-in-focus-amid-sharp-excise-duty-hike-on-cigarettes/articleshow/126296922.cms",
            "description": "Cigarette stocks ITC and Godfrey Phillips India experienced significant losses following a steep hike in excise duties announced by the government. The new duty structure, effective February 1, has raised concerns about increased tax burdens, potential volume losses for legal players, and a possible resurgence of illicit trade.",
            "pubDate": "2026-01-02T03:05:40.634532"
        },
        {
            "title": "Devyani International shares in focus after mega merger announcement with Sapphire Foods",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/devyani-international-shares-in-focus-after-mega-merger-announcement-with-sapphire-foods/articleshow/126296900.cms",
            "description": "Devyani International and Sapphire Foods India are merging to create India's largest Yum! Brands franchisee, operating KFC and Pizza Hut. The share-swap deal, approved by both boards and Yum! Brands, aims to unlock significant synergies and drive accelerated expansion. The combined entity expects annual synergy benefits of Rs 210-225 crore.",
            "pubDate": "2026-01-02T03:05:40.634628"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/126296799.cms",
            "description": "In the Nifty500 pack, nine stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on January 1, 2026, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2026-01-02T03:05:40.634722"
        },
        {
            "title": "These large- and mid-cap stocks can give more than 25% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-and-mid-cap-stocks-can-give-more-than-25-return-in-1-year-according-to-analysts/articleshow/126296587.cms",
            "description": "Had it not been for the hit taken by the ITC stock, the Nifty and Sensex would have ended much higher on the first trading day of 2026. Again, however the indices move in the next couple of sessions, remember that a large majority of institutional investors will be back in office only by Monday or Tuesday. So, whether you decide to be bullish or bearish in the short- to medium-term horizon, let the hangover of the New Year party get over.",
            "pubDate": "2026-01-02T03:05:40.634817"
        },
        {
            "title": "Devyani & Sapphire to merge, form QSR giant",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/devyani-sapphire-to-merge-form-qsr-giant/articleshow/126296562.cms",
            "description": "Devyani International and Sapphire Foods India are merging operations. This union will create India's largest quick-service restaurant entity. The combined company will operate over 3,000 stores. This significant consolidation aims to accelerate KFC's expansion and revitalize Pizza Hut. The merger is set to become effective from April 1.",
            "pubDate": "2026-01-02T03:05:40.634914"
        },
        {
            "title": "GIFT Nifty up 35 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126296473.cms",
            "description": "Indian markets began the year range-bound, closing slightly higher amid thin trading and continued FII selling. Key drivers ahead include Q3 earnings, budget expectations, and global cues like the India-US trade deal and Fed actions, with earnings growth anticipated to lead in 2026.",
            "pubDate": "2026-01-02T03:05:40.635022"
        },
        {
            "title": "Stocks in news: ITC, Devyani International, Hudco, Tata Steel, KPI Green",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-itc-devyani-international-hudco-tata-steel-kpi-green/articleshow/126296454.cms",
            "description": "Markets began the New Year subdued, ending nearly unchanged. Analysts anticipate the Nifty will soon break its consolidation phase. A move above 26,200 could target 26,500–26,700. Investors are advised to buy on dips, focusing on banking, auto, and metal stocks. ITC, Devyani International, Hudco, Tata Steel, and KPI Green are in focus due to recent developments.",
            "pubDate": "2026-01-02T03:05:40.635118"
        },
        {
            "title": "Decade of relief ahead for Vodafone Idea to recuperate",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-seen-getting-decade-long-relief-agr-dues-of-87000-crore-may-halve-after-review-with-payments-in-fy36fy41/articleshow/126296489.cms",
            "description": "Vodafone Idea has secured a 10-year extension on its Adjusted Gross Revenue payments, a move that has been confirmed by officials who have frozen the owed amount. Anticipated adjustments are expected to bring down the total significantly, providing much-needed financial respite to the company.",
            "pubDate": "2026-01-02T03:05:40.635212"
        },
        {
            "title": "Rising incomes, rural recovery to power corporate India’s 2026 growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-incomes-rural-recovery-to-power-corporate-indias-2026-growth/articleshow/126296378.cms",
            "description": "Corporate India anticipates improved performance in 2026, driven by rising disposable incomes, a stronger rural economy, and infrastructure spending, partially offsetting rupee depreciation. Key sectors like automobiles, banking, FMCG, IT, metals, oil & gas, power, and pharmaceuticals are poised for growth, with AI and premiumization emerging as dominant themes.",
            "pubDate": "2026-01-02T03:05:40.635302"
        },
        {
            "title": "India valuations cheaper now, but pricier than regional peers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-valuations-cheaper-now-but-pricier-than-regional-peers/articleshow/126296323.cms",
            "description": "Indian stocks offer a mixed outlook for 2026. Valuations are lower than historical averages, a positive sign. However, they remain pricier than regional markets like China and Korea. Foreign investors have stayed away for months. A turnaround in earnings, a trade deal with the US, or shifts in the US AI sector could draw them back.",
            "pubDate": "2026-01-02T03:05:40.635389"
        },
        {
            "title": "Will the markets say cheese or continue to face January chills?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-the-markets-say-cheese-or-continue-to-face-january-chills/articleshow/126296295.cms",
            "description": "Indian equities historically struggle in January, with the Nifty and Sensex often seeing declines. However, analysts suggest this year might differ, potentially boosted by the upcoming Union Budget.  Technical indicators point to potential gains if key levels are breached, while broader markets have shown more resilience.  The Nifty closed slightly higher on the first trading day of 2026.",
            "pubDate": "2026-01-02T03:05:40.635479"
        },
        {
            "title": "D-Street welcomes 2026 on a sober note amid thin volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-welcomes-2026-on-a-sober-note-amid-thin-volumes/articleshow/126296287.cms",
            "description": "Indian equities began 2026 on a muted note, with benchmark indices closing flat amid thin trading volumes and a lack of global cues. While the Nifty and Sensex saw minor movements, stock-specific actions dominated, particularly in the auto sector. The FMCG index faced pressure due to a decline in ITC shares following an excise duty announcement.",
            "pubDate": "2026-01-02T03:05:40.635569"
        },
        {
            "title": "Sensex jumps over 200 pts, Nifty above 26,150 as earnings buzz builds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-200-pts-nifty-above-26150-as-earnings-buzz-builds/articleshow/126297954.cms",
            "description": "Indian stock markets began Friday with a modest rise. Investors are preparing for upcoming corporate news before the quarterly earnings season. The Sensex and Nifty are set for a small weekly gain. However, ongoing foreign investor selling is impacting market sentiment. Both major indices are trading higher today.",
            "pubDate": "2026-01-02T04:08:49.757721"
        },
        {
            "title": "SBI, HDFC Bank among Axis Securities 15 stocks to buy in 2026 for up to 54% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-hdfc-bank-among-axis-securities-15-stocks-to-buy-in-2026-for-up-to-54-upside/slideshow/126297987.cms",
            "description": "With most significant events now behind and majority of negative concerns regarding earnings already factored into the price, Axis Securities sees 2026 better than 2025. The domestic brokerage has picked 15 stocks for the new year, which it sees as potential winners with an upside up to 54%. Take a look!",
            "pubDate": "2026-01-02T04:08:49.757851"
        },
        {
            "title": "Buy, Sell or Hold: Motilal Oswal downgrades ITC; Citi maintains neutral rating on HCL Technologies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-motilal-oswal-downgrades-itc-citi-maintains-neutral-rating-on-hcl-technologies/articleshow/126297859.cms",
            "description": "Brokerage views on key frontline stocks reflect divergent trends. Citi maintained a Neutral stance on HCL Technologies while raising its target price due to improving sector prospects. Motilal Oswal downgraded ITC after a sharp cigarette tax hike raised earnings concerns. Emkay remained bullish on Devyani International, citing merger synergies with Sapphire Foods and long-term growth potential.",
            "pubDate": "2026-01-02T04:08:49.757955"
        },
        {
            "title": "Gold, silver or stocks in 2026? How to invest Rs 10 lakh in new year for balanced returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-silver-or-stocks-in-2026-how-to-invest-rs-10-lakh-in-new-year-for-balanced-returns/articleshow/126297821.cms",
            "description": "Indian investors face a strategic choice after precious metals outperformed equities in 2025. Experts suggest a shift back to stocks for 2026, emphasizing diversification. While gold and silver saw significant gains, analysts warn against chasing euphoria. A balanced portfolio with a higher equity allocation is recommended for the coming year, considering market performance and risk appetite.",
            "pubDate": "2026-01-02T04:08:49.758055"
        },
        {
            "title": "Aurobindo Pharma among 5 stocks that closed above VWAP, signaling bullish shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aurobindo-pharma-among-5-stocks-that-closed-above-vwap-signaling-bullish-shift/slideshow/126297783.cms",
            "description": "On January 1, the closing prices of five stocks in the Nifty500 pack rallied more than 1% above their VWAP (Volume Weighted Average Price), according to technical scan data from StockEdge.com. A move above the VWAP is often seen as a potential bullish signal.When a stock closes above its VWAP, it indicates that the closing price is higher than the average price at which it traded during the day, with the average weighted by trading volume. This is commonly interpreted by traders and investors as a sign of positive market sentiment and strengthening momentum.",
            "pubDate": "2026-01-02T04:08:49.758161"
        },
        {
            "title": "Hyundai Motor shares in focus as December 2025 sales jump nearly 7% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-shares-in-focus-as-december-2025-sales-jump-nearly-7-yoy/articleshow/126297761.cms",
            "description": "Hyundai Motor India shares are set to remain in focus after the company reported strong December sales growth, led by robust exports and steady domestic demand. Management highlighted benefits from GST reforms, rising interest in the new VENUE model and disciplined inventory management, supporting momentum despite recent stock price pressure.",
            "pubDate": "2026-01-02T04:08:49.758271"
        },
        {
            "title": "Shriram Finance, TVS Motor among 4 largecap stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-tvs-motor-among-4-largecap-stocks-witness-5-year-swing-high-breakout/slideshow/126297809.cms",
            "description": "In the NSE large-cap pack, four stocks witnessed a 5-year swing high at the close on January 1, indicating bullishness in the counters, according to technical scan data from stockedge.com.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe and acts as an important resistance level. While such moves are viewed as bullish, they are distinct from a 5-year breakout, which requires a decisive move beyond long-standing resistance.",
            "pubDate": "2026-01-02T04:08:49.758373"
        },
        {
            "title": "Hero MotoCorp shares jump 2% as December sales rise 40% to 4.56 lakh units",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-as-december-sales-rise-40-to-4-56-lakh-units/articleshow/126297740.cms",
            "description": "Hero MotoCorp is riding high on its recent sales success, with shares climbing steeply after announcing impressive December 2025 figures. The year-on-year increase in dispatches and demand indicates a thriving market, bolstered by the recent launch of exciting new models in the ICE scooter sector during Q3FY26.",
            "pubDate": "2026-01-02T04:08:49.758467"
        },
        {
            "title": "TVS Motor shares in focus as Q3FY26 sales hit record high; December volumes surge 50%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-shares-in-focus-as-q3fy26-sales-hit-record-high-december-volumes-surge-50/articleshow/126297648.cms",
            "description": "TVS Motor Company announced its best-ever quarterly sales for Q3FY26. The company also achieved strong sales figures in December 2025. Two-wheeler sales saw significant growth. Three-wheeler volumes more than doubled. International business also performed well. Net profit and revenue from operations increased substantially year-on-year. TVS Motor shares rallied in 2025.",
            "pubDate": "2026-01-02T04:08:49.758625"
        },
        {
            "title": "ITC hit by 6 brokerage downgrades as cigarette tax hike darkens earnings outlook. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hit-by-wave-of-downgrades-as-cigarette-tax-hike-darkens-earnings-outlook-should-you-buy-sell-or-hold/articleshow/126297625.cms",
            "description": "Brokerages have turned sharply cautious on ITC after the government’s steep hike in cigarette excise duties, triggering downgrades, earnings cuts and valuation resets. While domestic brokerages warn of volume pressure and a revival of illicit trade, Jefferies has retained a Buy rating, arguing that long-term returns and cash payouts could cushion near-term pain.",
            "pubDate": "2026-01-02T04:08:49.758727"
        },
        {
            "title": "Indian Bank shares rise 3% on Q3 update; total business up 13.4% to Rs 14.3 lakh crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-bank-shares-in-focus-on-q3-update-total-business-up-13-4-to-rs-14-3-lakh-crore/articleshow/126297371.cms",
            "description": "Indian Bank shares climbed on Friday, January 2, 2026. The bank reported robust third-quarter numbers for FY26. Total business saw a 13.4% increase. Gross advances grew by 14.5%. Deposits also rose by 12.5%. This performance exceeded management guidance. The bank's stock had gained nearly 60% in 2025.",
            "pubDate": "2026-01-02T04:08:49.758822"
        },
        {
            "title": "PSUs throw 24 winners with up to 109% gains, 36 washouts in 2025. Bet on budget buzz or avoid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psus-throw-24-winners-with-up-to-109-gains-36-washouts-in-2025-bet-on-budget-buzz-or-avoid/articleshow/126298478.cms",
            "description": "PSU stocks saw mixed results in 2025. Metals, PSU banks, and defence sectors performed well. However, power, railway, and NBFC sectors faced declines. Market participants anticipate Budget 2026 to boost state-owned firms with increased government spending and policy continuity. Investors are watching for further action in these stocks.",
            "pubDate": "2026-01-02T04:51:23.211253"
        },
        {
            "title": "Multibagger auto stock that rallied 215% in 2025 reports 50% jump in December sales; stock rises 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-auto-stock-that-rallied-215-in-2025-reports-50-jump-in-december-sales-stock-rises-5/articleshow/126298150.cms",
            "description": "Force Motors shares saw a significant jump on Friday, January 2, 2026. The company reported strong December sales, with total sales increasing by 50%. Domestic sales grew by 49%, and exports nearly doubled. Force Motors' net profit more than doubled in the second quarter and for the first half of FY26.",
            "pubDate": "2026-01-02T04:51:23.211380"
        },
        {
            "title": "PSU dividend stars: MSTC, Coal India among top 10 stocks in yield chart. Check more",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-dividend-stars-mstc-coal-india-among-top-10-stocks-in-yield-chart-check-more/slideshow/126298725.cms",
            "description": "Dividend-focused investors found several public sector stocks delivering attractive income in FY25, with yields calculated on the basis of December 31, 2025 closing prices and restricted to companies that have consistently paid dividends over the last three financial years (FY23–FY25). Here's the list of top 10 dividend paying PSU stocks:",
            "pubDate": "2026-01-02T05:14:28.726728"
        },
        {
            "title": "MCX shares crack 80% in early trade, but here’s why investors need not panic",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-crack-80-in-early-trade-but-heres-why-investors-need-not-panic/articleshow/126298549.cms",
            "description": "MCX shares plunged over 80% to Rs 2,192 as the stock turned ex-split on its record date for a 5:1 split, a mechanical price adjustment rather than a fundamental decline, with eligible shareholders set to receive additional shares.",
            "pubDate": "2026-01-02T05:14:28.726853"
        },
        {
            "title": "Olectra Greentech shares jump over 5% after Hyderabad EV plant begins operations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/olectra-greentech-shares-jump-over-5-after-hyderabad-ev-plant-begins-operations/articleshow/126298524.cms",
            "description": "Olectra Greentech shares jumped after the company began Phase-I commercial operations at its new greenfield EV plant in Hyderabad, marking December 31, 2025, as the facility’s official commercial operation date and notifying lender SBI.",
            "pubDate": "2026-01-02T05:14:28.726957"
        },
        {
            "title": "Ola Electric Mobility shares kick off 2026 with 12% surge in two days. What’s behind the move?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-mobility-shares-kick-off-2026-with-12-surge-in-two-days-whats-behind-the-move/articleshow/126298904.cms",
            "description": "Ola Electric shares surged 9% to Rs 40.77 on January 2, 2026, following a strong December sales performance. The company's market share rose to 9.3% in December from 7.2% in November, with a notable acceleration in the latter half of the month. This growth, driven by new product launches and in-house cell integration, positions Ola Electric for continued market gains.",
            "pubDate": "2026-01-02T05:55:10.569580"
        },
        {
            "title": "Tata Motors, TMPV shares surge up to 4% on December sales; Tata Motors hits record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-tmpv-shares-surge-up-to-4-on-december-sales-tata-motors-hits-record-high/articleshow/126298893.cms",
            "description": "Tata Motors surged to a record high on Friday, fueled by strong December commercial-vehicle volumes, while its passenger-vehicle arm TMPV rose on healthy EV and PV sales. Robust demand, a rebound in construction and mining, and an upbeat management outlook for FY26 drove investor optimism across both segments.",
            "pubDate": "2026-01-02T05:55:10.569706"
        },
        {
            "title": "Bajaj Auto shares fall 3% as 2-W domestic sales rise 3% in December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-auto-shares-fall-3-as-2-w-domestic-sales-rise-3-in-december/articleshow/126299670.cms",
            "description": "Bajaj Auto shares saw a dip following a modest 3% rise in domestic two-wheeler sales for December. However, total sales climbed 14% year-on-year. Exports surged 24%, and commercial vehicle sales also grew. The company reported a significant 53% jump in consolidated net profit for the quarter, driven by strong revenue and a favorable vehicle mix.",
            "pubDate": "2026-01-02T06:23:03.635986"
        },
        {
            "title": "ITC shares plunge to 3-year low after tax bombshell: Is this a falling knife or hidden value?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-shares-plunge-to-3-year-low-after-tax-bombshell-is-this-a-falling-knife-or-hidden-value/articleshow/126299782.cms",
            "description": "ITC shares slid to a three-year low after a sharp two-day, 14% fall triggered by a steep cigarette tax hike, prompting multiple brokerage downgrades amid concerns that large price increases will be needed to offset the impact, risking volumes and earnings.",
            "pubDate": "2026-01-02T06:23:03.636100"
        },
        {
            "title": "Ashok Leyland shares rise over 2%, extending fifth-day winning streak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-rise-over-2-extending-fifth-day-winning-streak/articleshow/126299732.cms",
            "description": "Ashok Leyland shares extended their winning streak for a fifth straight session, supported by strong December sales, improving financial performance, and bullish technical indicators, even as the stock appears overbought in the short term.",
            "pubDate": "2026-01-02T06:23:03.636301"
        },
        {
            "title": "Despite elevated valuations, Indian stock markets less expensive than US: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-elevated-valuations-indian-stock-markets-less-expensive-than-us-report/articleshow/126300293.cms",
            "description": "Indian stock markets look cheaper than those in the US based on a key valuation measure. Despite being above historical averages, Indian markets are considered fairly valued. This is due to strong earnings growth and positive economic outlook. Bond yields have also fallen, supporting this view. Higher market valuations are expected in the coming quarters.",
            "pubDate": "2026-01-02T06:52:58.588699"
        },
        {
            "title": "Devyani-Sapphire merger: What the 3,000 restaurant deal means for your shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/devyani-sapphire-merger-what-the-3000-restaurant-deal-means-for-your-shares/articleshow/126300264.cms",
            "description": "Devyani International and Sapphire Foods will merge through a near-parity share-swap to create one of India’s largest QSR players with over 3,000 outlets and revenue above Rs 7,800 crore, bringing all KFC and Pizza Hut operations under one operator, with limited arbitrage and equal synergy benefits for shareholders.",
            "pubDate": "2026-01-02T06:52:58.588810"
        },
        {
            "title": "Motilal Oswal sees AI-led revival in IT sector in 2026, names 4 top stock picks with up to 51% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-sees-ai-led-revival-in-it-sector-in-2026-names-4-top-stock-picks-with-up-to-51-upside/articleshow/126302446.cms",
            "description": "Motilal Oswal has maintained a cautiously optimistic stance on the Indian IT sector for calendar year 2026, acknowledging near-term challenges from seasonal furloughs and wage pressures while highlighting a gradual recovery driven by AI-led demand.",
            "pubDate": "2026-01-02T09:01:10.426229"
        },
        {
            "title": "Motilal Oswal sees AI-led revival in IT sector in 2026, names 4 top stock picks with up to 51% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-sees-ai-led-revival-in-it-sector-in-2026-names-4-top-stock-picks-with-up-to-51-upside/slideshow/126302613.cms",
            "description": "A recent analysis of the BSE universe shows that several companies have consistently maintained healthy profit margins, reflecting strong operational efficiency and supporting sustainable growth. Such stability continues to build investor confidence in these firms. Our study identified 184 such companies with a market capitalisation exceeding Rs 2,500 crore that have maintained a profit margin above 10% for eight consecutive quarters, till the quarter ended September 2025. The selection criteria included companies with net sales of over Rs 100 crore in each of the last eight quarters, while banking and financial stocks were excluded.",
            "pubDate": "2026-01-02T09:01:10.426355"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to play a capped risk-reward amid bullish outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-play-a-capped-risk-reward-amid-bullish-outlook/articleshow/126302117.cms",
            "description": "The Nifty 50 remains in a consolidation phase within a defined range but continues to show structural strength above key support levels. Analysts maintain a bullish outlook, recommending buy-on-dips and option strategies like bull call spreads to capitalise on potential upside.",
            "pubDate": "2026-01-02T09:01:10.426472"
        },
        {
            "title": "Pharma stocks: Time to change the prescription? 13 pharma stocks with an upside potential of up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-stocks-time-to-change-the-prescription-13-pharma-stocks-with-an-upside-potential-of-up-to-39/articleshow/126300841.cms",
            "description": "Close to three decades back, when Indian pharma firms began to move into the US market, they faced many challenges. And the fact is that they still do face challenges; but these are easily handled now as they have grown much bigger and are much more stable in overall terms. In the last one year, we have, of course, heard of US FDA inspections. But their frequency is much less than earlier. It is probably time to look at pharma stocks again, for several reasons; but own a basket rather than one or two.",
            "pubDate": "2026-01-02T09:01:10.426570"
        },
        {
            "title": "Coal India shares rally 7% to hit fresh 52-week high on permitting direct foreign participation in coal e-auctions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-shares-rally-7-to-hit-fresh-52-week-high-on-permitting-direct-foreign-participation-in-coal-e-auctions/articleshow/126302750.cms",
            "description": "Coal India shares surged to a 52-week high after announcing that foreign buyers from Bangladesh, Bhutan, and Nepal can directly participate in SWMA e-auctions from 1 January 2026. The move aims to enhance transparency, efficiency, and global market integration.",
            "pubDate": "2026-01-02T09:32:28.890821"
        },
        {
            "title": "Multibaggers: 10 stocks with profit margins above 10% for 8 straight quarters. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibaggers-10-stocks-with-profit-margins-above-10-for-8-straight-quarters-do-you-own-any/slideshow/126302613.cms",
            "description": "A recent analysis of the BSE universe shows that several companies have consistently maintained healthy profit margins, reflecting strong operational efficiency and supporting sustainable growth. Such stability continues to build investor confidence in these firms. Our study identified 184 such companies with a market capitalisation exceeding Rs 2,500 crore that have maintained a profit margin above 10% for eight consecutive quarters, till the quarter ended September 2025. The selection criteria included companies with net sales of over Rs 100 crore in each of the last eight quarters, while banking and financial stocks were excluded.",
            "pubDate": "2026-01-02T09:32:28.891040"
        },
        {
            "title": "Cupid shares plunge 20% on profit booking, end 13-session unbeaten rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-shares-plunge-20-on-profit-booking-end-13-session-unbeaten-rally/articleshow/126303299.cms",
            "description": "Cupid shares fell sharply on Fridat after a 13-session unbeaten rally, driven by heavy profit booking and strong volumes. The stock, which hit a 52-week high on Thursday, remains deeply overbought with RSI at 93 and MFI at 100. Despite the correction, Cupid has delivered 452% returns over the past year.",
            "pubDate": "2026-01-02T09:47:56.682741"
        },
        {
            "title": "PMS fund manager Siddhartha Bhaiya passes away after cardiac arrest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pms-fund-manager-siddhartha-bhaiya-passes-away-after-cardiac-arrest/articleshow/126303368.cms",
            "description": "Siddhartha Bhaiya, a prominent PMS fund manager, has passed away. He was the Managing Director of Aequitas, a firm managing Rs 7,700 crore. Bhaiya was known for identifying multibagger smallcap stocks. His passing occurred on December 31, 2025, due to a cardiac arrest in New Zealand.",
            "pubDate": "2026-01-02T09:56:38.403549"
        },
        {
            "title": "Commercial vehicle stocks at a turning point. Can Ashok Leyland, Tata Motors, and Force Motors deliver in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/commercial-vehicle-stocks-at-a-turning-point-can-ashok-leyland-tata-motors-and-force-motors-deliver-in-2026/articleshow/126303303.cms",
            "description": "India’s commercial vehicle sector may be nearing a recovery in 2026 as improving sales trends, supportive policy measures and infrastructure-led demand lift sentiment. Analysts and management commentary point to early signs of an upcycle, with buses, trucks and tractors benefiting from GST reforms, public spending and favourable rural conditions.",
            "pubDate": "2026-01-02T09:56:38.403677"
        },
        {
            "title": "Aluminum prices top $3,000 for the first time since 2022 as supply risks grow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aluminum-prices-top-3000-for-the-first-time-since-2022-as-supply-risks-grow/articleshow/126303415.cms",
            "description": "Global aluminium prices surge to $3,000 per tonne, the highest in over three years, driven by China’s production cap, rising demand in key sectors, and supply disruptions like South32’s Mozal smelter shutdown. Indian aluminium futures rise modestly amid cautious market sentiment, with medium-term support intact.",
            "pubDate": "2026-01-02T10:18:30.584237"
        },
        {
            "title": "Market Wrap: Nifty hits record high, Sensex gains 573 points on second trading day of 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-nifty-hits-record-high-sensex-gains-573-points-on-second-trading-day-of-2026/articleshow/126303888.cms",
            "description": "The Nifty 50 climbed as much as 193.45 points during the session to an all-time high of 26,340 before closing at 26,328.55, up 182 points, or 0.7%. The BSE Sensex advanced 573 points, or 0.67%, to finish at 85,762.",
            "pubDate": "2026-01-02T10:40:59.203990"
        },
        {
            "title": "Britain's FTSE-100 hits 10,000 mark, getting 2026 off to strong start",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/britains-ftse-100-hits-10000-mark-getting-2026-off-to-strong-start/articleshow/126303839.cms",
            "description": "London's blue-chip FTSE 100 index hit the symbolic 10,000 points mark ⁠for the first time on Friday, the latest sign of surging stock markets around the world, and a positive start to 2026 for the long unloved British market.",
            "pubDate": "2026-01-02T10:40:59.204112"
        },
        {
            "title": "Titan Company breaks out from 2-year consolidation to hit fresh record highs in January 2026; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-company-breaks-out-from-2-year-consolidation-to-hit-fresh-record-highs-in-january-2026-time-to-buy-or-book-profits/articleshow/126285545.cms",
            "description": "Titan Company has broken out of a two-year consolidation on weekly charts, with experts suggesting a potential rally to Rs 4,350 in the next one to two months. The stock shows strong upward momentum, trading above key moving averages and exhibiting bullish indicators, despite a high RSI suggesting a possible pullback.",
            "pubDate": "2026-01-02T11:52:04.424652"
        },
        {
            "title": "Gainers & Losers: Ola Electric among 6 stocks that were in focus on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-ola-electric-among-6-stocks-that-were-in-focus-on-friday/slideshow/126304822.cms",
            "description": "",
            "pubDate": "2026-01-02T11:52:04.424773"
        },
        {
            "title": "Siddhartha Bhaiya, the contra stock picker who turned Rs 10 lakh into Rs 4 crore in 13 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siddhartha-bhaiya-the-contra-stock-picker-who-turned-rs-10-lakh-into-rs-4-crore-in-13-years/articleshow/126305738.cms",
            "description": "Siddhartha Bhaiya, the celebrated contrarian investor behind the India Opportunities Fund, built a 33% CAGR track record by spotting smallcap and midcap multibaggers early. His bold calls—from raising 80% cash to shifting heavily into gold ETFs—turned Rs 10 lakh into Rs 4 crore in 13 years, cementing his legacy.",
            "pubDate": "2026-01-02T12:50:40.675460"
        }
    ]
}