{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-03T00:55:28.974713",
    "items": [
        {
            "title": "How will Sebi's new intraday limits impact equity index derivatives?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-sebis-new-intraday-limits-impact-equity-index-derivatives/articleshow/123667026.cms",
            "description": "Sebi is tightening intraday position limits in equity index derivatives starting October 1, aiming to curb volatility and potential market manipulation, especially on expiry days. The new framework sets a ₹5,000 crore intraday net futures-equivalent position limit in index options, down from the existing ₹1,500 crore end-of-day cap.",
            "pubDate": "2025-09-03T00:55:26.613648"
        },
        {
            "title": "Jane Street's $10.1-biilion trading haul sets Wall Street record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-streets-10-1-biilion-trading-haul-sets-wall-street-record/articleshow/123666969.cms",
            "description": "Jane Street Group achieved a record-breaking $10.1 billion in net trading revenue during the second quarter, surpassing major Wall Street banks. This surge, more than double the previous year's figure, propelled their first-half trading revenue to an unprecedented $17.3 billion. The firm benefited significantly from the market volatility spurred by President Trump's tariffs and subsequent investor repositioning.",
            "pubDate": "2025-09-03T00:55:26.613813"
        },
        {
            "title": "Sugar stocks soar up to 20% as govt lifts ethanol curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sugar-stocks-soar-up-to-20-as-govt-lifts-ethanol-curbs/articleshow/123666936.cms",
            "description": "Sugar stocks witnessed a surge following the central government's decision to remove restrictions on ethanol production from sugarcane. This move has boosted investor confidence in sugar companies. Analysts anticipate improved profitability and a potential rise in ethanol prices. The Supreme Court's stance on ethanol-blended petrol further supports the demand for ethanol. Rajshree Sugars and Shree Renuka Sugars experienced significant gains.",
            "pubDate": "2025-09-03T00:55:26.614030"
        },
        {
            "title": "Stock Radar: Short-term traders look to buy Hindalco stock on dips; 20-DEMA acts as a support",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-short-term-traders-look-to-buy-hindalco-stock-on-dips-20-dema-acts-as-a-support/articleshow/123653756.cms",
            "description": "Hindalco Industries, after breaking a key resistance in August 2025, is showing bullish signs. Despite a previous dip from an October 2024 high, the stock has been trending upwards since April 2025. Experts suggest short-term traders consider buying on dips, targeting Rs 750 in the coming weeks.",
            "pubDate": "2025-09-03T00:55:26.614135"
        }
    ]
}