{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-11T04:00:12.152064",
    "items": [
        {
            "title": "BEL shares in focus on new order win worth Rs 792 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-on-new-order-win-worth-rs-792-crore/articleshow/125239130.cms",
            "description": "Bharat Electronics Ltd (BEL) shares are likely to be in focus after the defence PSU announced fresh orders worth Rs 792 crore, marking its second consecutive win. The orders cover defence networks, communication systems, drones, and radars. BEL has secured major contracts every month since September, reflecting strong execution momentum.",
            "pubDate": "2025-11-11T03:37:22.458856"
        },
        {
            "title": "Vodafone Idea shares in focus after Q2 loss narrows YoY, ARPU grows 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-after-q2-loss-narrows-yoy-arpu-grows-9/articleshow/125238630.cms",
            "description": "Vodafone Idea's net loss narrowed significantly in the September quarter of FY26, reaching Rs 5,524 crore. The telecom operator also saw its Average Revenue Per User (ARPU) climb to Rs 180, a healthy 8.7% year-on-year jump. Revenue from operations increased, and the company expanded its 4G/5G subscriber base, signaling positive momentum.",
            "pubDate": "2025-11-11T03:37:22.458995"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Bajaj Auto, NYKAA among 5 stocks that could give 10-25% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-bajaj-auto-nykaa-among-5-stocks-that-could-give-10-25-return/slideshow/125238229.cms",
            "description": "Brokerages remain constructive on select stocks across sectors, with a mix of Buy and Accumulate calls supported by earnings visibility and growth drivers.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-11T03:37:22.459102"
        },
        {
            "title": "Bajaj Finance shares in focus after 22% YoY surge in Q2 net profit. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-shares-in-focus-after-22-yoy-surge-in-q2-net-profit-should-you-buy-sell-or-hold/articleshow/125238598.cms",
            "description": "Bajaj Finance announced a 22% rise in its Q2FY26 net profit.  However, this result was slightly below market expectations.  Analysts have differing opinions.  Morgan Stanley maintains an 'Overweight' rating with a revised target price.  Bernstein, however, reiterates an 'Underperform' rating due to emerging stress in certain loan segments and rising credit costs.",
            "pubDate": "2025-11-11T03:37:22.459204"
        },
        {
            "title": "Home improvement stocks: Has business matured enough to be part of a long-term portfolio? 4 stocks, 3 with upside potential of over 49%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/home-improvement-stocks-has-business-matured-enough-to-be-part-of-a-long-term-portfolio-4-stocks-3-with-upside-potential-of-over-49/articleshow/125238164.cms",
            "description": "After coming into the limelight in 2020, most stocks related to the home improvement sector (from laminate and tile makers to several others) have been moving in a very broad range. A majority, in fact, underperformed in the bull run of 2023-24. But the fact also is that no sector stays at high valuations forever; neither does it stay under pressure for extended periods. Is three years of underperformance coming to an end? Will the GST rate cut give these companies the required push? Have valuations cooled to a level where you should think of having them in your long-term portfolio?",
            "pubDate": "2025-11-11T03:37:22.459306"
        },
        {
            "title": "Last day to buy shares of Sagility, Kaveri Seed among 6 companies to be eligible for upcoming dividends. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-sagility-kaveri-seed-among-6-companies-to-be-eligible-for-upcoming-dividends-do-you-own/articleshow/125238172.cms",
            "description": "Today, November 11, marks the final opportunity for investors to acquire shares in Sagility, Gujarat Pipavav Port, Kaveri Seed Company, and others to qualify for their upcoming dividend payouts. The ex-dividend date for these companies is November 12, meaning shares must be held by the close of today's trading session.",
            "pubDate": "2025-11-11T03:37:22.459411"
        },
        {
            "title": "Positive Breakout: These 8 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-cross-above-their-200-dmas/slideshow/125238037.cms",
            "description": "In the Nifty500 pack, eight stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on November 10, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-11-11T03:37:22.459521"
        },
        {
            "title": "Wall Street jumps, Nvidia and Palantir lead AI surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-jumps-nvidia-and-palantir-lead-ai-surge/articleshow/125237894.cms",
            "description": "Indian markets saw a strong rebound on Monday. Major technology and AI-related companies like Nvidia and Palantir experienced significant gains. This surge followed positive developments in Washington regarding the resolution of a prolonged government shutdown. Investors are showing renewed confidence in the tech sector, indicating a 'buy the dip' sentiment is active. The overall market sentiment is optimistic.",
            "pubDate": "2025-11-11T03:37:22.459615"
        },
        {
            "title": "'I am going quiet': Warren Buffett says will no longer write annual letters in a poignant note filled with grace",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/i-am-going-quiet-warren-buffett-says-will-no-longer-write-annual-letters-in-a-poignant-note-filled-with-grace/articleshow/125237750.cms",
            "description": "Warren Buffett is stepping back from writing Berkshire's annual letters after nearly six decades, opting for a quieter approach. He will continue to communicate with shareholders through his annual Thanksgiving message.  Long-time lieutenant Greg Abel is set to officially take over as Berkshire's chief executive by year-end, marking the end of an era.",
            "pubDate": "2025-11-11T03:37:22.459755"
        },
        {
            "title": "Asian stocks buoyed by plans to end US shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-buoyed-by-plans-to-end-us-shutdown/articleshow/125237506.cms",
            "description": "Asian stocks advanced for a second day as a US government shutdown resolution neared, boosting sentiment across markets. Commodities and cryptocurrencies rallied alongside equities, while Treasuries declined. The reopening is expected to restore crucial economic data, offering clarity on the Federal Reserve's policy path.",
            "pubDate": "2025-11-11T03:37:22.459870"
        },
        {
            "title": "WestBridge raises Star Health stake by $12 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/westbridge-raises-star-health-stake-by-12-million/articleshow/125237427.cms",
            "description": "WestBridge Capital has boosted its stake in Star Health and Allied Insurance with a $12 million investment, even as it navigates regulatory approval for a new general insurance venture, Kiwi. The private equity firm clarified its Star Health investment was disclosed to Irdai during Kiwi's licensing process, adhering to promoter guidelines.",
            "pubDate": "2025-11-11T03:37:22.459961"
        },
        {
            "title": "Stocks in news: Bajaj Finance, Vodafone Idea, Britannia, Ather Energy, Hero MotoCorp",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-bajaj-finance-vodafone-idea-britannia-ather-energy-hero-motocorp/articleshow/125228937.cms",
            "description": "In today's trade, shares of Bajaj Finance, Vodafone Idea, Britannia, Ather Energy, Hero MotoCorp among others will be in focus due to various news developments and second quarter results.",
            "pubDate": "2025-11-11T03:37:22.460056"
        },
        {
            "title": "GIFT Nifty up 40 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125229021.cms",
            "description": "Indian stock markets opened flat this week, boosted by positive Asian market signals. The IT sector played a significant role in this momentum. Analysts anticipate markets will trade within a defined range, influenced by global trends. Strong corporate earnings and progress in India-US trade talks could offer further upward movement.",
            "pubDate": "2025-11-11T03:37:22.460149"
        },
        {
            "title": "US private equity firm General Atlantic set to acquire 7% of Balaji Wafers for ₹2,500 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ga-set-to-acquire-7-of-balaji-wafers-for-282m/articleshow/125237433.cms",
            "description": "General Atlantic is close to acquiring a 7% stake in Balaji Wafers for ₹2,500 crore. This deal values the Gujarat-based snack maker at approximately ₹35,000 crore. Balaji Wafers founder Chandu Virani confirmed the negotiations are in the final stages. The company is a major player in the Indian salty snack market, ranking third nationally.",
            "pubDate": "2025-11-11T03:37:22.460238"
        },
        {
            "title": "Should investors bet on Lenskart after its muted debut on Dalal Street?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/should-investors-bet-on-lenskart-after-its-muted-debut-on-dalal-street/articleshow/125237278.cms",
            "description": "Lenskart Solutions debuted on Indian bourses with a 1.7% discount to its IPO price, listing at ₹395 against ₹402. Despite a strong IPO subscription, analysts advised caution due to high valuations, recommending investors monitor profitability for 2-3 quarters before fresh purchases.",
            "pubDate": "2025-11-11T03:37:22.460327"
        },
        {
            "title": "Indices rebound as IT stocks drive gains after three-day loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indices-rebound-as-it-stocks-drive-gains-after-three-day-loss/articleshow/125237244.cms",
            "description": "Indian stock markets saw a rebound on Monday, with IT stocks leading the gains. This recovery followed three days of losses. Analysts suggest the market may trade within a range due to a lack of new catalysts. Investors are shifting focus to IT stocks, finding them attractive. Foreign investors were net sellers, while domestic investors bought shares.",
            "pubDate": "2025-11-11T03:37:22.460415"
        },
        {
            "title": "Hindustan Aeronautics among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-aeronautics-among-6-stocks-showing-bullish-rsi-upswing/slideshow/125239429.cms",
            "description": "Six stocks from the NSE large-cap pack were highlighted in the RSI Trending Up scan on November 10, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-11T04:00:09.319446"
        },
        {
            "title": "From Zomato to Lenskart: 25 tech startup IPOs, 8 losers, 4 multibaggers, and one unending argument",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-zomato-to-lenskart-25-tech-startup-ipos-8-losers-4-multibaggers-and-one-unending-argument/articleshow/125239336.cms",
            "description": "India's tech startup IPOs have seen a mixed bag since 2021, with 25 companies listing and generating an average 42% gain. Despite debates over high valuations like Lenskart's, four multibaggers have emerged, while eight have become losers.",
            "pubDate": "2025-11-11T04:00:09.319580"
        },
        {
            "title": "Rekha Jhunjhunwala-backed Baazar Style Retail shares in focus after turning profitable YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-backed-baazar-style-retail-shares-in-focus-after-turning-profitable-yoy/articleshow/125239293.cms",
            "description": "Baazar Style Retail reported a sharp turnaround in Q2FY26 with a consolidated net profit of Rs 51 crore, compared to a loss last year. Revenue surged 71% year-on-year to Rs 532 crore, while PAT jumped over 2,400% sequentially. Total income rose to Rs 535 crore despite higher expenses. The value fashion retailer, backed by Rekha Jhunjhunwala, continues expanding its strong presence in Eastern India.",
            "pubDate": "2025-11-11T04:00:09.319695"
        },
        {
            "title": "​UNO Minda, Balrampur Chini among 8 stocks flashing bullish signals, indicating a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uno-minda-balrampur-chini-among-8-stocks-flashing-bullish-signals-indicating-a-possible-uptrend/slideshow/125239251.cms",
            "description": "Eight stocks from the Nifty500 pack appeared in the bullish scanner for the “White Marubozu” pattern on November 10, according to technical scan data from StockEdge.com. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.\"",
            "pubDate": "2025-11-11T04:00:09.319803"
        },
        {
            "title": "ONGC shares in focus as Q2 profit falls 18% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-shares-in-focus-as-q2-profit-falls-18-yoy/articleshow/125239164.cms",
            "description": "Oil and Natural Gas Corporation (ONGC) reported an 18% year-on-year decline in net profit for the July-September quarter, primarily due to lower oil prices. Despite this, the company declared an interim dividend and approved strategic investments in renewable energy and ethane transportation ventures.",
            "pubDate": "2025-11-11T04:00:09.319907"
        }
    ]
}