{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-19T11:01:34.683087",
    "items": [
        {
            "title": "RIL EBITDA margin hits seven-quarter high as O2C strength offsets retail weakness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-ebitda-margin-hits-seven-quarter-high-as-o2c-strength-offsets-retail-weakness/articleshow/126664820.cms",
            "description": "Reliance Industries' consolidated EBITDA margin reached a seven-quarter high, driven by a strong oil-to-chemicals division and RJio's robust telecom performance. This growth partially offset weakness in the retail segment due to festive season shifts and GST rate changes. The company is also investing in a battery manufacturing facility and renewable power generation.",
            "pubDate": "2026-01-19T00:53:32.157398"
        },
        {
            "title": "Q3 earnings growth muted as IT weighs, banks lend support",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-earnings-growth-muted-as-it-weighs-banks-lend-support/articleshow/126665191.cms",
            "description": "December quarter results show mid-single digit net profit growth, primarily due to weak IT sector performance. Banking and finance companies, however, posted double-digit profit growth, supporting overall numbers. IT firms faced a profit decline, impacted by delayed client decisions and a shift towards AI projects.",
            "pubDate": "2026-01-19T07:38:06.043895"
        },
        {
            "title": "BHEL Q3 Results: Profit more than triples to Rs 382 crore; revenue jumps 16% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bhel-q3-results-profit-more-than-triples-to-rs-382-crore-revenue-jumps-16-yoy/articleshow/126672675.cms",
            "description": "BHEL reported a sharp turnaround in the December quarter, with net profit surging 206% year-on-year to Rs 382 crore, aided by stronger execution and operating leverage. Revenue rose 16% to Rs 8,473 crore, supported by improved project execution and a healthier order pipeline, signalling a gradual recovery in profitability for the state-owned engineering major.",
            "pubDate": "2026-01-19T08:51:35.853782"
        },
        {
            "title": "PNB Q3 Results: Standalone PAT rises 13% YoY to Rs 5,100 crore; NII drops 4.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-q3-results-net-profit-rises-13-yoy-to-rs-5100-crore/articleshow/126673881.cms",
            "description": "Punjab National Bank has announced a significant 13 percent rise in its net profit for the third quarter ending December 2025. The bank's net profit reached Rs 5,100 crore. This marks a substantial improvement compared to the previous year. Asset quality also saw positive movement with a reduction in gross and net non-performing assets ratios.",
            "pubDate": "2026-01-19T09:20:19.358423"
        },
        {
            "title": "IRFC Q3 Results: Co posts its biggest-ever profit of Rs 1,802 crore, up 11% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irfc-q3-results-co-posts-its-biggest-ever-profit-of-rs-1802-crore-up-11-yoy/articleshow/126674298.cms",
            "description": "Indian Railway Finance Corporation (IRFC) reported its highest-ever quarterly profit for the third consecutive quarter, with Rs 1,802 crore in Q3 FY26, driven by loan growth and improved margins. Despite a marginal income dip due to a project lease moratorium, the company achieved its full-year loan sanction target early and saw assets under management reach a record Rs 4.",
            "pubDate": "2026-01-19T09:51:55.328331"
        },
        {
            "title": "Hindustan Zinc Q3 results: Vedanta arm delivers highest-ever PAT growth of 46% YoY; revenue rises 27% on silver wave",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindustan-zinc-q3-results-vedanta-arm-delivers-highest-ever-pat-growth-of-46-yoy-revenue-rises-27-on-silver-wave/articleshow/126676309.cms",
            "description": "Hindustan Zinc posted record Q3FY26 revenue and profit, driven by higher mined metal output, rising silver production, lowest five-year costs and strong margins. Robust cash position, capacity expansion and superior shareholder returns reinforced its industry leadership.",
            "pubDate": "2026-01-19T11:01:33.774521"
        }
    ]
}