{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-27T16:45:07.416644",
    "items": [
        {
            "title": "Nvidia's profit jumps 80% as company rides tech's AI boom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nvidias-profit-jumps-80-as-company-rides-techs-ai-boom/articleshow/118590051.cms",
            "description": "Nvidia overcame fears about its future after a $600 billion value loss, with strong quarterly results showing revenue and profit increases by 78% and 80% respectively. The company dominates the AI chip market, benefitting from ongoing tech company investments in AI data centers. Despite geopolitical challenges and potential tariffs, Nvidia's growth continues to impress.",
            "pubDate": "2025-02-27T16:45:05.093859"
        },
        {
            "title": "SpiceJet clocks profit on reduced expense",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spicejet-clocks-profit-on-reduced-expense/articleshow/118583020.cms",
            "description": "Low cost carrier SpiceJet reported a profit of Rs 25 crore for Q3FY25, a turnaround from a loss of Rs 301.5 crore in the same quarter last year. This marks the first time in a decade the company's net worth has been positive, reflecting the success of its financial recovery efforts.",
            "pubDate": "2025-02-27T16:45:05.093998"
        },
        {
            "title": "SpiceJet Q3 Results: Co posts Rs 26 profit vs loss a year ago; revenue up 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spicejet-q3-results-co-posts-rs-26-profit-vs-loss-a-year-ago-revenue-up-35/articleshow/118578344.cms",
            "description": "SpiceJet Q3 Results: SpiceJet turned profitable in Q3 2024, recording a net profit of Rs 26 crore due to strong passenger demand and improved efficiency. The airline's revenue surged by 35%, and its net worth became positive for the first time in a decade, supported by strategic financial recovery efforts.",
            "pubDate": "2025-02-27T16:45:05.094104"
        }
    ]
}