{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-05T07:38:59.033194",
    "items": [
        {
            "title": "Japan's Nikkei ends lower as stronger yen, chip losses weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-as-stronger-yen-chip-losses-weigh/articleshow/113087059.cms",
            "description": "Japan's Nikkei share average fell 1% to its lowest level since mid-August, influenced by a stronger yen and losses in semiconductor stocks. Investors are keenly awaiting U.S. non-farm payroll data to assess the economy. Key exporters like Toyota and Sony saw declines, while chip-related stocks followed a slump in U.S. technology shares.",
            "pubDate": "2024-09-05T07:38:37.457850"
        },
        {
            "title": "Linde India shares rise over 6% on acquiring Tata Steel's gas supply assets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/linde-india-shares-rise-over-6-on-acquiring-tata-steels-gas-supply-assets/articleshow/113085977.cms",
            "description": "Linde India shares surged 6.1% to Rs 7,641.60 following the company's announcement that it has signed a plant sale agreement with Tata Steel to acquire their industrial gas supply assets.",
            "pubDate": "2024-09-05T07:38:37.457964"
        },
        {
            "title": "HAL, Polycab among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-polycab-among-5-stocks-with-short-buildup/slideshow/113082967.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of the underlying stock in the Futures and Options segment. This indicates that more traders are expecting the prices to decline and are creating short positions. In Thursday's trading session, five stocks saw fresh short positions being built. Here's the list:",
            "pubDate": "2024-09-05T07:38:37.458064"
        },
        {
            "title": "Vedanta shares gain 2% after long-term ratings upgrade from ICRA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-gain-2-after-long-term-ratings-upgrade-from-icra/articleshow/113085442.cms",
            "description": "Vedanta Share Price: Vedanta shares climbed 2% after ICRA upgraded the company’s long-term ratings. This upgrade was based on the anticipated improvement in Vedanta's credit metrics.",
            "pubDate": "2024-09-05T07:38:37.458166"
        },
        {
            "title": "Large business opportunity should be key to investing decision: 6 large cap from different sectors with upside potential of upto 34 %",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/large-business-opportunity-should-be-key-to-investing-decision-6-large-cap-from-different-sectors-with-upside-potential-of-upto-34-/articleshow/113085304.cms",
            "description": "Bulls showed their strength once again with the Nifty and sensex  witnessing Intraday recovery on a day when the global market had witnessed a correction. Given the out performance which Indian markets have been showing, one has to continue with a bullish stance, the only thing, look at some things more carefully before taking fresh exposure and probably even think of doing a rejig of the portfolio, giving more weightage to a stronger balance sheet and management past track record of dealing with different conditions.",
            "pubDate": "2024-09-05T07:38:37.458258"
        },
        {
            "title": "AU Small Finance Bank shares jump 5% as Goldman Sachs initiates coverage with 21% upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-bank-shares-jump-5-as-goldman-sachs-initiates-coverage-with-21-upside-potential/articleshow/113084808.cms",
            "description": "AU Small Finance Share Price: Shares of AU Small Finance Bank rose 5% to a day’s high of Rs 722.50 on the BSE after Goldman Sachs initiated coverage with a target price of Rs 831, suggesting a 21% upside from Wednesday’s close of Rs 688. The stock has also gained 7% over the last two days, following the bank’s application to the RBI for a transition from a small finance bank to a universal bank.",
            "pubDate": "2024-09-05T07:38:37.458355"
        },
        {
            "title": "PNB Housing Finance shares jump over 5%, hit 52-week high on Rs 2,500 crore NCD plans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-housing-finance-shares-jump-over-5-hit-52-week-high-on-rs-2500-crore-ncd-plans/articleshow/113084532.cms",
            "description": "PNB Housing Finance Share Price: Shares of PNB Housing Finance surged 5.4% to a 52-week high of Rs 1,109.9 on the BSE during Thursday’s trading. The increase followed the company’s announcement of plans to raise nearly Rs 2,500 crore through NCDs on September 9. According to an exchange filing, the board will meet on September 9, 2024, to consider and approve the issuance of up to Rs 2,500 crore in NCDs via private placement in tranches over the next six months.",
            "pubDate": "2024-09-05T07:38:37.458450"
        },
        {
            "title": "Cholamandalam Investment shares surge over 4% as Goldman Sachs sees 20% upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cholamandalam-investment-shares-surge-over-4-as-goldman-sachs-sees-20-upside-potential/articleshow/113084482.cms",
            "description": "Cholamandalam Finance Share Price: Shares of Cholamandalam Investment and Finance Company surged 4.3% to a new all-time high after Goldman Sachs initiated coverage with a target price of Rs 1,786, indicating a 20% upside potential. The company posted strong earnings growth and market share gains, with a robust loan growth driven by new business diversification.",
            "pubDate": "2024-09-05T07:38:37.458544"
        },
        {
            "title": "New Asian Tiger? India beats China in one of MSCI's emerging market indices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-asian-tiger-india-beats-china-in-one-of-mscis-emerging-market-indices/articleshow/113084312.cms",
            "description": "India has overtaken China in the MSCI EM Investable Market Index and is close to becoming the largest weight in the more popular EM index. This shift indicates increased foreign investment flows into Indian equities, driven by improving free float and rising relative earnings.",
            "pubDate": "2024-09-05T07:38:37.458634"
        },
        {
            "title": "Sona BLW Precision Forgings shares zoom 4% on fund raising plans via QIP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sona-blw-precision-forgings-shares-zoom-4-on-fund-raising-plans-via-qip/articleshow/113083507.cms",
            "description": "Sona BLW Precision Share Price: Sona BLW Precision Forgings' shares surged 4% to Rs 751 after the company announced a floor price of Rs 699.01 per share for its qualified institutional placement. The company may offer a discount of up to 5% on this floor price. Sona Comstar's shares have gained 26% over the past year.",
            "pubDate": "2024-09-05T07:38:37.458724"
        },
        {
            "title": "Biocon, Syngene International among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-syngene-international-among-5-stocks-with-long-buildup/slideshow/113082481.cms",
            "description": "A long buildup occurs when open interest and trading volumes increase alongside a rise in the underlying stock price in the Futures and Options segment, signaling a bullish market trend. In Thursday's trading session, five stocks saw fresh long positions. Here’s the list:",
            "pubDate": "2024-09-05T07:38:37.458817"
        },
        {
            "title": "Zomato shares rally 8% as JPMorgan hikes target price to Rs 340",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zomato-shares-rally-8-as-jpmorgan-hikes-target-price-to-rs-340/articleshow/113082086.cms",
            "description": "Zomato Share Price: Shares of Zomato surged 7.6% on the BSE today, hitting an intraday high of Rs 261.50, following JPMorgan's target price increase to Rs 340 from Rs 208, while maintaining an overweight rating. JPMorgan highlighted Zomato’s leadership in retail consumer transformation through Quick Commerce and its expansion across metros after validating the model in NCR.",
            "pubDate": "2024-09-05T07:38:37.458909"
        },
        {
            "title": "Suzlon Energy shares jump nearly 3% after co signs One Earth Property sale deed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-shares-jump-nearly-3-after-co-signs-one-earth-property-sale-deed/articleshow/113082007.cms",
            "description": "Suzlon Energy Share Price: Suzlon Energy shares rose nearly 3% after the company signed a sale deed for its One Earth Property with OE Business Park. The property will be leased back to Suzlon for five years. The deal is valued at around Rs 440 crore. Suzlon also recently acquired a 76% stake in Renom Energy Services.",
            "pubDate": "2024-09-05T07:38:37.458999"
        },
        {
            "title": "Raymond Lifestyle shares list at Rs 3,020 on NSE after demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/raymond-lifestyle-shares-list-at-rs-3020-on-nse-after-demerger/articleshow/113081362.cms",
            "description": "Raymond Lifestyle Share Price: Raymond Lifestyle, which demerged from Raymond Ltd in June, began trading on the stock exchanges today. The stock is listed at Rs 3,020 on NSE and Rs 3,000 on BSE, giving it a valuation of approximately Rs 18,300 crore. The listing positions Raymond Lifestyle as a key player in India's wedding and ceremonial market.",
            "pubDate": "2024-09-05T07:38:37.459090"
        },
        {
            "title": "Stock Radar: SBI Cards & Payment Services stock reclaims 200-DMA after 10% fall from highs; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-sbi-cards-payment-services-stock-reclaims-200-dma-after-10-fall-from-highs-time-to-buy/articleshow/113059419.cms",
            "description": "SBI Cards & Payment Services Ltd has reclaimed its 200-DMA after a significant drop from its September 2023 highs. Experts suggest that short-term traders with a high-risk profile could consider buying the stock for a target of Rs 820 in the next 1-2 months, given its current positive momentum and technical indicators.",
            "pubDate": "2024-09-05T07:38:37.459182"
        },
        {
            "title": "Bajaj Finance, IndusInd Bank among 10 stocks that earned downgrades in last 1 month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-indusind-bank-among-10-stocks-that-earned-downgrades-in-last-1-month/slideshow/113081359.cms",
            "description": "Several brokerages have downgraded target prices for multiple stocks over the past month. According to Trendlyne data, 10 stocks, including IndusInd Bank, Bajaj Finance, Dalmia Bharat, ACC, and Maruti Suzuki, have experienced downgrades from up to eight analysts.Here is a list of these stocks and their revised target prices:",
            "pubDate": "2024-09-05T07:38:37.459275"
        }
    ]
}