{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-14T15:22:49.278998",
    "items": [
        {
            "title": "Fusion Finance narrows losses, expects to be profitable in H2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/fusion-finance-narrows-losses-expects-to-be-profitable-in-h2/articleshow/125313061.cms",
            "description": "Warburg Pincus-backed Fusion Finance anticipates profitability in the second half of the current fiscal year, marking a turnaround after six consecutive quarters of net losses. The company plans to call for the second tranche of ₹400 crore from investors and aims to increase monthly loan disbursals to ₹550-600 crore from January onwards.",
            "pubDate": "2025-11-14T01:24:44.456864"
        },
        {
            "title": "Tata Motors PV Q2 Results: Cons PAT zooms multifold to Rs 76,170 cr on one-time gain, but revenue falls 13% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-pv-q2-results-cons-pat-surges-22x-yoy-to-rs-76170-crore-on-one-time-gain-but-revenue-falls-13-yoy/articleshow/125324060.cms",
            "description": "Tata Motors PV Q2 Results: The company’s revenue from operations for the quarter was Rs 71,714 crore, down 13% from Rs 82,841 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-11-14T10:39:38.347157"
        },
        {
            "title": "Marico Q2 results: Cons PAT dips marginally YoY to Rs 420 crore, but revenue up 31%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/marico-q2-results-cons-pat-dips-marginally-yoy-to-rs-420-crore-but-revenue-up-31/articleshow/125322228.cms",
            "description": "Marico reported a marginal 0.7% YoY dip in Q2FY26 consolidated PAT to Rs 420 crore, even as revenue surged nearly 31% to Rs 3,482 crore. Strong domestic volume growth and robust international performance drove the company’s multi-quarter-high topline expansion.",
            "pubDate": "2025-11-14T10:39:38.347281"
        },
        {
            "title": "MRF Q2 Results: Co declares Rs 3/share interim dividend as PAT jumps 12% YoY to Rs 526 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mrf-q2-results-co-declares-rs-3/share-interim-dividend-as-q2-pat-jumps-12-yoy-to-rs-526-crore/articleshow/125319872.cms",
            "description": "Tyre maker MRF announced an interim dividend of Rs 3 per share for the financial year ending March 2026. This comes as the company reported a 12% rise in its September quarter net profit. Shareholders will receive the dividend after December 5, 2025. The record date for eligibility is November 21.",
            "pubDate": "2025-11-14T10:39:38.347387"
        },
        {
            "title": "Oswal Pumps Q2 Results: Net profit rises 48% YoY to Rs 97.5 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oswal-pumps-q2-results-net-profit-rises-48-yoy-to-rs-97-5-crore/articleshow/125319598.cms",
            "description": "Oswal Pumps Ltd has announced a significant 48% surge in its consolidated net profit, reaching Rs 97.50 crore for the September quarter. This impressive growth is underpinned by a substantial rise in total income, which climbed to Rs 546.48 crore from Rs 310.84 crore in the same period last year.",
            "pubDate": "2025-11-14T10:39:38.347499"
        },
        {
            "title": "India Inc earnings comeback! 108 companies double profit. Time to reshuffle your stock portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-inc-earnings-comeback-108-companies-double-profit-time-to-reshuffle-your-stock-portfolio/articleshow/125316465.cms",
            "description": "India Inc's Q2 earnings reveal a robust recovery, with over 100 companies more than doubling profits, signaling broad demand resilience. Renewable energy, PSUs, and select consumption stocks led the surge. Analysts believe the earnings cycle has bottomed out, anticipating accelerated double-digit growth ahead, driven by margin improvements and topline expansion.",
            "pubDate": "2025-11-14T10:39:38.347621"
        },
        {
            "title": "Muthoot Finance Q2 profit surges 88% as gold loan demand hits new highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/muthoot-finance-q2-profit-surges-88-as-gold-loan-demand-hits-new-highs/articleshow/125325704.cms",
            "description": "Muthoot Finance posted an 88% jump in Q2 profit to Rs 2,345 crore, driven by strong gold loan demand, a 42% loan book expansion, improved asset quality, and upgraded FY26 growth guidance to 30–35%.",
            "pubDate": "2025-11-14T12:26:01.367663"
        },
        {
            "title": "Muthoot Finance Q2 results: Profit surges 88% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/muthoot-finance-q2-results-profit-surges-88-yoy/articleshow/125325549.cms",
            "description": "Muthoot Finance saw an 88% profit surge in the second quarter. Strong loan demand and rising gold prices fueled this record performance. The company has now raised its FY26 gold loan growth forecast to 30-35%. Its loan book expanded significantly. Asset quality also improved. Muthoot Finance plans to raise additional funds.",
            "pubDate": "2025-11-14T12:26:01.367795"
        },
        {
            "title": "Dish TV Q2 net loss widens to Rs 133 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dish-tv-q2-net-loss-widens-to-rs-133-crore/articleshow/125330444.cms",
            "description": "Dish TV India faced a significant net loss of Rs 133 crore in the September 2025 quarter. Revenue dropped, and profitability weakened considerably. The company is focusing on hybrid offerings and launched VZY Smart TVs to integrate DTH and OTT services. This move aims to create a comprehensive content ecosystem for Indian consumers, redefining home entertainment.",
            "pubDate": "2025-11-14T15:22:48.561628"
        }
    ]
}