{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-28T04:59:06.687584",
    "items": [
        {
            "title": "From rail to tech stocks: These 10 smallcap stocks post up to 35% weekly gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-rail-to-tech-stocks-these-10-smallcap-stocks-post-up-to-35-weekly-gains/slideshow/126212092.cms",
            "description": "Indian equity markets closed the holiday-shortened week on a cautious note, as mild profit booking set in near record highs amid thin year-end trading volumes and continued FII outflows. Despite the marginal decline, the overall market structure stayed broadly constructive, supported by strong domestic institutional flows, stable macroeconomic indicators, and firm earnings outlook.Within this backdrop of elevated-level consolidation, several smallcap stocks delivered sharp gains, bucking the broader market's subdued tone. Here's a look at the top 10 BSE smallcap stocks that recorded the highest weekly surge, with gains ranging up to 34%.",
            "pubDate": "2025-12-28T04:27:55.017453"
        },
        {
            "title": "Market outlook: FII trend, monthly expiry among top factors to track this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-outlook-fii-trend-monthly-expiry-among-top-factors-to-track-this-week/articleshow/126211889.cms",
            "description": "Indian markets are poised for a volatile week ahead, influenced by the December F&O expiry and crucial domestic data releases. Foreign institutional investors continue their selling spree, while global cues and currency movements also demand attention. Experts advise a cautious, stock-specific approach with disciplined risk management as the year concludes.",
            "pubDate": "2025-12-28T04:27:55.017577"
        },
        {
            "title": "Up to 527% gain! 29 SME IPOs that delivered multibagger returns to investors in a rough year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/up-to-527-gain-29-sme-ipos-that-delivered-multibagger-returns-to-investors-in-a-rough-year/articleshow/126212303.cms",
            "description": "Despite a sharp slowdown in SME IPO performance in 2025, a select group of fundamentally strong stocks delivered multibagger returns, underscoring the growing importance of quality and disciplined stock selection.",
            "pubDate": "2025-12-28T04:59:05.126578"
        },
        {
            "title": "14 Penny stocks surged up to 440% in CY25; 6 emerge as multibaggers. Did you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/14-penny-stocks-surged-up-to-440-in-cy25-6-emerge-as-multibaggers-did-you-own-any/slideshow/126212275.cms",
            "description": "Penny stocks often attract attention due to their low entry price and potential for explosive growth. However, while the rewards can be significant, the risks are equally high. These stocks typically have low liquidity, high volatility and limited financial transparency. Investors should proceed with caution, success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2025-12-28T04:59:05.126699"
        },
        {
            "title": "2025: A defining year that reshaped global trade, policy, and capital markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2025-a-defining-year-that-reshaped-global-trade-policy-and-capital-markets/articleshow/126212125.cms",
            "description": "2025 proved a transformative year, marked by the US's assertive 'America First' agenda and escalating global trade tariffs. India responded with significant economic reforms, including tax relief and a GST overhaul, while navigating volatile foreign investment flows. The year concluded with strong GDP growth, low inflation, and supportive monetary policy, positioning India for future resilience.",
            "pubDate": "2025-12-28T04:59:05.126806"
        }
    ]
}