{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-20T21:43:33.056876",
    "items": [
        {
            "title": "Accenture beats third-quarter revenue estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/accenture-beats-third-quarter-revenue-estimates/articleshow/121974432.cms",
            "description": "Accenture beat Wall Street estimates for third-quarter revenue on Friday, driven by growing demand for the consulting giant's AI-driven services from enterprise customers.",
            "pubDate": "2025-06-20T21:43:31.396105"
        },
        {
            "title": "Indian Banks' earnings growth forecast halved amid economic caution and high deposit costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-banks-earnings-growth-forecast-halved-amid-economic-caution-and-high-deposit-costs/articleshow/121963715.cms",
            "description": "Indian banks are facing a significant slowdown in earnings growth, potentially halving to 6.5% in FY26 due to a cautious economy and reduced core profits. Muted credit demand, high deposit costs, and RBI's measures to control unsecured lending contribute to this deceleration. However, a rebound to 16.1% is expected in FY27 with anticipated rate cuts and improved demand.",
            "pubDate": "2025-06-20T21:43:31.396227"
        },
        {
            "title": "SpiceJet Q4 Results: PAT jumps 173% YoY to highest-ever quarterly profit of Rs 325 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spicejet-q4-results-pat-jumps-173-yoy-to-highest-ever-quarterly-profit-of-rs-325-crore/articleshow/121845350.cms",
            "description": "Spicejet announced a significant profit increase for the March quarter. The airline's standalone profit after tax rose 173% YoY. This marks their highest ever quarterly profit. Spicejet also reported a full-year net profit after seven years. Improved yields and cost optimization drove the growth. The company's Chairman, Ajay Singh, expressed confidence in Spicejet's sustainable growth.",
            "pubDate": "2025-06-20T21:43:31.396333"
        }
    ]
}