{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-28T10:53:38.512769",
    "items": [
        {
            "title": "From rail to tech stocks: These 10 smallcap stocks post up to 35% weekly gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-rail-to-tech-stocks-these-10-smallcap-stocks-post-up-to-35-weekly-gains/slideshow/126212092.cms",
            "description": "Indian equity markets closed the holiday-shortened week on a cautious note, as mild profit booking set in near record highs amid thin year-end trading volumes and continued FII outflows. Despite the marginal decline, the overall market structure stayed broadly constructive, supported by strong domestic institutional flows, stable macroeconomic indicators, and firm earnings outlook.Within this backdrop of elevated-level consolidation, several smallcap stocks delivered sharp gains, bucking the broader market's subdued tone. Here's a look at the top 10 BSE smallcap stocks that recorded the highest weekly surge, with gains ranging up to 34%.",
            "pubDate": "2025-12-28T04:27:55.017453"
        },
        {
            "title": "Market outlook: FII trend, monthly expiry among top factors to track this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-outlook-fii-trend-monthly-expiry-among-top-factors-to-track-this-week/articleshow/126211889.cms",
            "description": "Indian markets are poised for a volatile week ahead, influenced by the December F&O expiry and crucial domestic data releases. Foreign institutional investors continue their selling spree, while global cues and currency movements also demand attention. Experts advise a cautious, stock-specific approach with disciplined risk management as the year concludes.",
            "pubDate": "2025-12-28T04:27:55.017577"
        },
        {
            "title": "Up to 527% gain! 29 SME IPOs that delivered multibagger returns to investors in a rough year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/up-to-527-gain-29-sme-ipos-that-delivered-multibagger-returns-to-investors-in-a-rough-year/articleshow/126212303.cms",
            "description": "Despite a sharp slowdown in SME IPO performance in 2025, a select group of fundamentally strong stocks delivered multibagger returns, underscoring the growing importance of quality and disciplined stock selection.",
            "pubDate": "2025-12-28T04:59:05.126578"
        },
        {
            "title": "14 Penny stocks surged up to 440% in CY25; 6 emerge as multibaggers. Did you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/14-penny-stocks-surged-up-to-440-in-cy25-6-emerge-as-multibaggers-did-you-own-any/slideshow/126212275.cms",
            "description": "Penny stocks often attract attention due to their low entry price and potential for explosive growth. However, while the rewards can be significant, the risks are equally high. These stocks typically have low liquidity, high volatility and limited financial transparency. Investors should proceed with caution, success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2025-12-28T04:59:05.126699"
        },
        {
            "title": "2025: A defining year that reshaped global trade, policy, and capital markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2025-a-defining-year-that-reshaped-global-trade-policy-and-capital-markets/articleshow/126212125.cms",
            "description": "2025 proved a transformative year, marked by the US's assertive 'America First' agenda and escalating global trade tariffs. India responded with significant economic reforms, including tax relief and a GST overhaul, while navigating volatile foreign investment flows. The year concluded with strong GDP growth, low inflation, and supportive monetary policy, positioning India for future resilience.",
            "pubDate": "2025-12-28T04:59:05.126806"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms declines by Rs 35,439 cr; SBI biggest laggard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-declines-by-rs-35439-cr-sbi-biggest-laggard/articleshow/126212867.cms",
            "description": "The combined market valuation of seven of the top-10 most valued firms declined by Rs 35,439.36 crore in a holiday-shortened last week, with State Bank of India taking the biggest hit, in line with a muted trend in equities.",
            "pubDate": "2025-12-28T06:22:38.216760"
        },
        {
            "title": "Looking to invest in smallcaps in 2026? 5 big predictions by 5 experts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/looking-to-invest-in-smallcaps-in-2026-5-big-predictions-by-5-experts/articleshow/126212838.cms",
            "description": "After a steep underperformance in 2025, India’s smallcap stocks enter 2026 amid divided expert views. While some see improving earnings and selective opportunities, others warn valuations and ownership risks remain. Most strategists agree largecaps offer better visibility, with stock selection and active management critical in smaller segments.",
            "pubDate": "2025-12-28T06:22:38.216888"
        },
        {
            "title": "Hindustan Copper, RVNL, 8 other BSE 500 stocks surge up to 23% past week. Is yours on the list?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-rvnl-8-other-bse-500-stocks-surge-up-to-23-past-week-is-yours-on-the-list/slideshow/126212500.cms",
            "description": "Indian equities ended the holiday-shortened week with modest gains, continuing their consolidation phase. After opening the week on a strong note, benchmark indices largely moved sideways in subsequent sessions, weighed down by mixed global signals and muted year-end participation. The Nifty closed at 26,042.30 and the Sensex at 85,041, reflecting a steady but cautious market environment.Meanwhile, Foreign Institutional Investors (FIIs) resumed net selling, and subdued trading volumes continued amid stable currency movements and record-high bullion prices. Amid this backdrop, here’s a look at the top 10 BSE 500 stocks that registered the highest gains over the past week:",
            "pubDate": "2025-12-28T06:22:38.216995"
        },
        {
            "title": "Foreign investors exit Indian stocks at record scale; withdraw Rs 1.6 lakh cr in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-investors-exit-indian-stocks-at-record-scale-withdraw-rs-1-6-lakh-cr-in-2025/articleshow/126212789.cms",
            "description": "Foreign investors fled Indian equities in 2025 at a scale never seen before, pulling out a record Rs 1.6 lakh crore (USD 18 billion) as volatile currency movements, global trade tensions, especially potential US tariffs, and stretched valuations eroded risk appetite, though flows are expected to turn sustainably positive in 2026.",
            "pubDate": "2025-12-28T06:22:38.217112"
        },
        {
            "title": "Hybrid funds at the core of asset allocation for 2026: A practical playbook for balance, behaviour, and better outcomes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hybrid-funds-at-the-core-of-asset-allocation-for-2026-a-practical-playbook-for-balance-behaviour-and-better-outcomes/articleshow/126212757.cms",
            "description": "As markets enter 2026 amid uncertainty, hybrid mutual funds offer a balanced, disciplined approach to portfolio construction by blending equity growth with debt stability, helping investors navigate volatility and stay aligned with long-term goals.",
            "pubDate": "2025-12-28T06:22:38.217208"
        },
        {
            "title": "India’s growth story: Sectors poised to lead the next wave of market expansion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-growth-story-sectors-poised-to-lead-the-next-wave-of-market-expansion/articleshow/126212534.cms",
            "description": "India’s strong macro fundamentals, policy reforms, easing monetary conditions and revival in consumption and capex are expected to support growth and drive sectoral opportunities in FY27.",
            "pubDate": "2025-12-28T06:22:38.217307"
        },
        {
            "title": "How Sundararaman Ramamurthy rebuilt BSE into a 14x wealth-creation machine in 3 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-sundararaman-ramamurthy-rebuilt-bse-into-a-14x-wealth-creation-machine-in-3-years/articleshow/126212666.cms",
            "description": "BSE has staged a remarkable turnaround since January 2023 under CEO Sundararaman Ramamurthy, driven by cost discipline, technology upgrades and the relaunch of equity derivatives. The strategy transformed market share, margins and investor confidence, delivering multi-fold returns and positioning BSE as a serious rival in index options.",
            "pubDate": "2025-12-28T06:22:38.217399"
        },
        {
            "title": "Trading Nifty in the last week of 2025: Levels, flows and the Santa rally question",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trading-nifty-in-the-last-week-of-2025-levels-flows-and-the-santa-rally-question/articleshow/126212597.cms",
            "description": "As hopes of a Santa rally fade, traders enter the final week of 2025 focused on Nifty’s technical levels, FII positioning and derivatives cues. Analysts see key supports near 26,000, selective sector strength in defence stocks, and tactical buying opportunities in stocks like NBCC and DBL.",
            "pubDate": "2025-12-28T06:22:38.217490"
        },
        {
            "title": "Market Trading Guide: Buy NBCC and Dalmia Bharat on Monday for up to 11% gains. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-nbcc-and-dalmia-bharat-on-monday-for-up-to-11-gains-heres-why/articleshow/126212557.cms",
            "description": "Indian equities extended losses for a second straight session as IT, financial and auto stocks weighed on benchmarks, pushing the Nifty below key short-term averages. Amid rising bearish momentum, analysts flagged 26,000 as a crucial support, while recommending NBCC and Dalmia Bharat on technical breakouts.",
            "pubDate": "2025-12-28T06:22:38.217583"
        },
        {
            "title": "Shriram Finance deal: Will it bring the good days back? 5 NBFC stocks with a modest upside potential between 7% & 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-deal-will-it-bring-the-good-days-back-5-nbfc-stocks-with-a-modest-upside-potential-between-7-19/articleshow/126212968.cms",
            "description": "Read the headline, it says modest upside potential. Because, if one looks at analyst estimates, they are only moderately positive about the NBFC space. This was the case even a few months back. Since then, stocks like Shriram Finance have moved up sharply. Yes, it’s because a big stake deal has happened. But, the deal underlines the interest in the lending space, though with some caveats. Either the company should be reasonably okay in terms of its books and franchise network (even if the promoter is not so good). Or, both the business and promoter should be strong. The question now is: Will the NBFC sector, which was a market favourite till 2018, get back its mojo on the street?",
            "pubDate": "2025-12-28T07:00:26.806951"
        },
        {
            "title": "11 IPOs set to list this week. GMPs signal listing returns of up to 90%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-ipos-set-to-list-this-week-gmps-signal-listing-returns-of-up-to-90/slideshow/126213049.cms",
            "description": "The IPO calendar is crowded with listings this week, even as fresh fundraising slowed. As many as 11 companies are set to list, most of them on the SME platforms. Grey market trends suggest that investors could still see sharp listing pops in select names, with GMPs indicating gains of up to 90%, even as overall sentiment remains cautious.",
            "pubDate": "2025-12-28T07:00:26.807105"
        },
        {
            "title": "9 Midcap stocks with massive upside potential; up to 45%! Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-midcap-stocks-with-massive-upside-potential-up-to-45-do-you-own-any/slideshow/126213160.cms",
            "description": "Analyst forecasts are more than just numbers; they provide a forward-looking perspective on market potential. For investors searching for the next breakout opportunities, a fresh analysis of Nifty Midcap 100 stocks highlights several compelling prospects.Based on analysts’ consensus estimates, Trendlyne data shows that a number of mid-cap stocks are expected to deliver strong returns over the next 12 months. This projected upside reflects the average expected gain over the period, offering a data-driven roadmap for investors exploring high-potential mid-cap opportunities. We highlight nine mid-cap stocks with estimated upside potential ranging between 25% and 45% over the coming year.",
            "pubDate": "2025-12-28T07:26:28.323798"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/126214726.cms",
            "description": "Indian markets ended lower on Friday as the Sensex and Nifty slipped amid thin year-end trading, foreign outflows, and profit booking. Largecaps underperformed while midcaps and smallcaps showed selective strength. Key support for Nifty is near 26,000, with potential retracement toward 26,200. Metals and consumer durables saw buying interest, while IT, autos, and banks faced selling pressure.",
            "pubDate": "2025-12-28T10:53:37.818052"
        }
    ]
}