{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-17T22:36:09.950510",
    "items": [
        {
            "title": "Ceat Q2 Results: Net profit declines 42% to Rs 121 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ceat-q2-results-net-profit-declines-42-to-rs-121-crore/articleshow/114323261.cms",
            "description": "Its revenue from operations rose to Rs 3,304 crore for the second quarter compared to Rs 3,053 crore in the year-ago period, Ceat said in a regulatory filing.",
            "pubDate": "2024-10-17T22:35:51.991246"
        },
        {
            "title": "Infosys, Wipro show strong sequential growth in Q2 dollar revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-wipro-show-strong-sequential-growth-in-q2-dollar-revenue/articleshow/114322951.cms",
            "description": "Infosys and Wipro delivered better than expected sequential growth in dollar denominated revenue for the September quarter. All four top IT exporters reported sequential growth in reported dollar denominated revenue for the September quarter after a gap of six quarters.",
            "pubDate": "2024-10-17T22:35:51.991379"
        },
        {
            "title": "Indian Overseas Bank Q2 Results: Net profit rises 24% to Rs 777 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-overseas-bank-q2-results-net-profit-rises-24-to-rs-777-crore/articleshow/114321945.cms",
            "description": "State-owned Indian Overseas Bank on Thursday posted a 24% surge in net profit to Rs. 777 crore in the second quarter ended September 2024, due to interest income and onboarding of new customers. The bank had earned a net profit of Rs. 625 crore in the same quarter a year ago.",
            "pubDate": "2024-10-17T22:35:51.991490"
        },
        {
            "title": "Karur Vysya Bank Q2 Results: Company posts 25% growth in net profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/karur-vysya-bank-q2-results-company-posts-25-growth-in-net-profits/articleshow/114321656.cms",
            "description": "Private sector lender Karur Vysya Bank posted a 25.13% growth in net profit for the quarter ended September 30 on strong growth in loans and on containing bad loans.",
            "pubDate": "2024-10-17T22:35:51.991602"
        },
        {
            "title": "Tata Chemicals Q2 Results: Net profit falls 55% to Rs 194 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-chemicals-q2-results-net-profit-falls-55-to-rs-194-crore/articleshow/114320383.cms",
            "description": "Tata Chemicals on Thursday reported a 54.67 per cent decline in its consolidated net profit at Rs 194 crore during the second quarter ended September 2024. The company's net profit stood at Rs 428 crore during the corresponding period of the previous fiscal, Tata Chemicals said in a regulatory filing.",
            "pubDate": "2024-10-17T22:35:51.991716"
        },
        {
            "title": "Wipro Q2 Results: Cons PAT jumps 21% YoY to Rs 3,209 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q2-results-cons-pat-jumps-21-yoy-to-rs-3209-crore/videoshow/114319965.cms",
            "description": "IT major Wipro on Thursday reported a 21% jump in net profit to Rs 3,209 crore for the quarter ended September 2024 versus Rs 2,646 crore logged in the year-ago period.The figure was higher than ET Now poll estimates of Rs 3,050 crore. Revenue from operations in the reported quarter stood at Rs 22,302 crore, marginally lower over Rs 22,516 crore posted in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-17T22:35:51.991821"
        },
        {
            "title": "Infosys Q2 Results: Profit rises 5% YoY to Rs 6,506 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q2-results-profit-rises-5-yoy-to-rs-6506-crore/videoshow/114318643.cms",
            "description": "India's second-largest software exporter, Infosys, reported a 5% growth in its consolidated net profit, reaching Rs 6,506 crore in the second quarter, compared to Rs 6,212 crore a year ago.The company has revised its FY25 revenue guidance to 3.75%–4.5%. The upward revision of revenue guidance for the fiscal comes on the back of ramp-up of mega deals. Earlier, the company had given a revenue growth guidance of 3-4% for FY25.",
            "pubDate": "2024-10-17T22:35:51.991923"
        },
        {
            "title": "Havells India Q2 Results: Cons PAT rises 7.5% YoY, revenue jumps 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/havells-india-q2-results-cons-pat-rises-7-5-yoy-revenue-jumps-16/articleshow/114318277.cms",
            "description": "While yearly revenue jumped by 16.4% to Rs 4,539.31 crore, the company experienced a decline on a quarterly basis. Profit fell by 34.3% and revenue dropped by nearly 22% compared to the previous quarter.",
            "pubDate": "2024-10-17T22:35:51.992025"
        },
        {
            "title": "Jindal Stainless Q2 Results: PAT up 2% at Rs 589 crore, sees tailwinds in domestic market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jindal-stainless-q2-results-pat-up-2-at-rs-589-crore-sees-tailwinds-in-domestic-market/articleshow/114318160.cms",
            "description": "July-Sep quarter sales at Rs. 9746 crore remain flat as dumping from China and Vietnam continues, says company.",
            "pubDate": "2024-10-17T22:35:51.992129"
        },
        {
            "title": "LTIMindtree Q2 Results: Net profit rises 8% YoY to Rs 1,251 crore, revenue up 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ltimindtree-q2-results-net-profit-rises-8-yoy-to-rs-1251-crore/articleshow/114316124.cms",
            "description": "IT services company LTIMindtree reported 8% year-on-year growth in its consolidated net profit at Rs 1,251 crore in the quarter ended September 2024. Revenue from operations in the reporting period rose 6% year-on-year to Rs 9,433 crore.",
            "pubDate": "2024-10-17T22:35:51.992232"
        },
        {
            "title": "Wipro board announces 1:1 bonus share issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-board-announces-11-bonus-share-issue/articleshow/114316064.cms",
            "description": "Shareholders with company shares in their demat accounts on the record date will receive an additional share as a bonus. The record date for this has not yet been announced.",
            "pubDate": "2024-10-17T22:35:51.992330"
        },
        {
            "title": "Axis Bank Q2 Results: PAT surges 18% YoY to Rs 6,918 crore, NII jumps 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q2-results-pat-surges-18-yoy-to-rs-6918-crore-nii-jumps-9/articleshow/114315021.cms",
            "description": "Axis Bank Q2 Results:  Axis Bank's net profit rose 18% YoY in Q2 FY25 to Rs 6,918 crore, driven by a 9% increase in Net Interest Income (NII) and growth in non-interest income. The bank expanded its branch network and regional presence, contributing to improved operating profit and fee income.",
            "pubDate": "2024-10-17T22:35:51.992430"
        },
        {
            "title": "Wipro Q2 Results: Cons PAT jumps 21% YoY to Rs 3,209 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q2-results-cons-pat-jumps-21-yoy-to-rs-3209-crore-beats-estimates/articleshow/114314319.cms",
            "description": "Wipro Q2 Results: Gross revenue stood at Rs 22,300 crore, marking a 1.5% increase quarter-on-quarter and a 1% decline year-on-year. IT services segment revenue reached $2,660.1 million, up 1.3% QoQ and down 2% YoY.",
            "pubDate": "2024-10-17T22:35:51.992528"
        },
        {
            "title": "Infosys Q2 Results: Profit rises 5% YoY to Rs 6,506 crore; co revises FY25 revenue guidance to 3.75-4.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q2-results-profit-rises-5-yoy-to-rs-6506-crore-revenue-also-up-5/articleshow/114314236.cms",
            "description": "Infosys Q2 Results: Infosys, India's second-largest software exporter, reported a 5% growth in consolidated net profit to Rs 6,506 crore for Q2, with revenue from operations rising by 5% YoY to Rs 40,986 crore. The company revised its FY25 revenue growth guidance to 3.75%–4.5%, driven by strong financial services momentum and mega deal ramp-ups.",
            "pubDate": "2024-10-17T22:35:51.992627"
        },
        {
            "title": "Tata Communications Q2 results: Cons PAT rises 3% YoY to Rs 227 crore but declines 32% QoQ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-communications-q2-results-cons-pat-rises-3-yoy-to-rs-227-crore-but-declines-32-qoq/articleshow/114313637.cms",
            "description": "Tata Communications reported a consolidated net profit of Rs 227.23 crore in Q2FY24, up 3% YoY. Revenue from operations stood at Rs 5,767.35 crore, up 18% YoY. Total expenses incurred by the company in the July-September quarter was at Rs 5,503.47 crore versus Rs 4,599.59 crore in Q2FY24.",
            "pubDate": "2024-10-17T22:35:51.992719"
        },
        {
            "title": "Central Bank of India Q2 Results: Profit surges 51% YoY to Rs 913 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/central-bank-of-india-q2-results-profit-surges-51-yoy-to-rs-913-crore/articleshow/114312166.cms",
            "description": "Central Bank of India Q2 Results: Total income increased to Rs 9,849 crore during the quarter under review, as against Rs 8,412 crore in the same period last year, Central Bank of India said in a regulatory filing.",
            "pubDate": "2024-10-17T22:35:51.992819"
        }
    ]
}