{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-23T11:51:10.158374",
    "items": [
        {
            "title": "Dr Reddy’s Q2 Preview: PAT may grow up to 11–18% YoY; revenue seen steady despite pricing pressure in US",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-q2-preview-pat-may-grow-up-to-1118-yoy-revenue-seen-steady-despite-pricing-pressure-in-us/articleshow/124759054.cms",
            "description": "Dr Reddy’s Laboratories is expected to post steady September-quarter earnings with 10–14% revenue growth led by India and Europe, though US pricing pressure and weaker product mix may compress margins. Brokerages project up to 18% YoY profit growth.",
            "pubDate": "2025-10-23T11:51:07.040770"
        },
        {
            "title": "Nokia posts profit beat as AI, cloud demand boost optical sales; shares soar 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nokia-posts-profit-beat-as-ai-cloud-demand-boost-optical-sales/articleshow/124757348.cms",
            "description": "Nokia reported third-quarter profit which was ahead of market expectations on Thursday, driven by strong optical and cloud demand, including AI-focused data centre sales following its Infinera acquisition",
            "pubDate": "2025-10-23T11:51:07.040902"
        },
        {
            "title": "HUL Q2: FMCG major declares interim dividend of Rs 19 per share; check record and payout dates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hul-q2-results-fmcg-major-declares-interim-dividend-of-rs-19-per-share-check-record-payout-date/articleshow/124754635.cms",
            "description": "Hindustan Unilever Ltd (HUL) has announced an interim dividend of Rs 19 per share for its eligible shareholders, with a record date of November 7 and payment on November 20. The FMCG major reported a consolidated net profit of Rs 2,694 crore for Q2FY26, a 4% increase from the previous year, while revenue from operations saw a marginal 2% rise.",
            "pubDate": "2025-10-23T11:51:07.041014"
        },
        {
            "title": "HUL Q2 Results: Cons PAT rises 4% YoY to Rs 2,685 crore; revenue up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hul-q2-results-cons-pat-rises-4-yoy-to-rs-2694-crore-revenue-up-2/articleshow/124754151.cms",
            "description": "HUL Q2 Results: Hindustan Unilever announced a net profit of Rs 2,685 crore for the second quarter of FY26, a 3.6% increase year-on-year. This growth was boosted by a one-time tax settlement. Revenue saw a modest rise to Rs 16,241 crore. The company declared an interim dividend of Rs 19 per share.",
            "pubDate": "2025-10-23T11:51:07.041118"
        }
    ]
}