{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-25T09:48:56.336819",
    "items": [
        {
            "title": "Stocks to Buy | Smart trading tips from Rajesh Bhosale for next few sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-smart-trading-tips-from-rajesh-bhosale-for-next-few-sessions/slideshow/123500265.cms",
            "description": "Rajesh Bhosale, in an interview with ET Now, said that while the week has started on a decent note, post-opening movements have not shown major traction. Rajesh Bhosale notes that with a truncated week and monthly expiry, the market is likely to consolidate before making any significant moves.",
            "pubDate": "2025-08-25T09:48:42.377471"
        },
        {
            "title": "Online gaming ban: How much Nikhil Kamath and Madhusudan Kela lost in Nazara shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/online-gaming-ban-how-much-nikhil-kamath-and-madhusudan-kela-lost-in-nazara-shares/articleshow/123499878.cms",
            "description": "Nazara Technologies’ sharp 26.6% fall wiped out over Rs 100 crore in combined mark-to-market wealth of Nikhil Kamath and Madhusudan Kela within four sessions, while Rekha Jhunjhunwala had fully exited earlier, avoiding steep losses amid regulatory concerns.",
            "pubDate": "2025-08-25T09:48:42.377605"
        },
        {
            "title": "Shanghai stock benchmark hits new decade high, HK nears 4-year peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shanghai-stock-benchmark-hits-new-decade-high-hk-nears-4-year-peak/articleshow/123499472.cms",
            "description": "China and Hong Kong stocks jumped on Monday, led by the rare earth and property sectors, extending the recent bull run as abundant liquidity continued to fuel gains.",
            "pubDate": "2025-08-25T09:48:42.377712"
        },
        {
            "title": "A defence goldmine? Up already 100% this year, Apollo Micro Systems shares rally 4% to hit fresh all-time high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-defence-goldmine-up-already-100-this-year-apollo-micro-systems-shares-rally-4-to-hit-fresh-all-time-high/articleshow/123499205.cms",
            "description": "Shares of Apollo Micro Systems surged 4% on Monday, hitting a lifetime high and gaining nearly 25% in the last five trading sessions. The defence-focused technology company has doubled investors’ wealth since January and delivered over 500% returns since its 2018 listing. It supplies mission-critical systems for India’s submarine programme, aerospace, and homeland security, boosting indigenisation and strategic capabilities.",
            "pubDate": "2025-08-25T09:48:42.377813"
        },
        {
            "title": "TCS, Infosys shares gain over 3% after brokerages' bullish nudge. What's driving the upgrades?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-infosys-shares-gain-over-3-after-brokerages-bullish-nudge-whats-driving-the-upgrades/articleshow/123499143.cms",
            "description": "Shares of TCS and Infosys jumped over 3% after Investec and JP Morgan upgraded ratings with higher targets, citing long-term IT resilience. Analysts see recovery in H2 FY26, driven by AI-led transformation, cost efficiency, and robust order books despite near-term demand pressures.",
            "pubDate": "2025-08-25T09:48:42.377913"
        },
        {
            "title": "Stocks to Buy | Top Trading Ideas: Cipla & Maruti for near-term rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-top-trading-ideas-cipla-amp-maruti-for-near-term-rally/slideshow/123499298.cms",
            "description": "Rajesh Palviya, in an interview with ET Now, said that Nifty is expected to remain in the range of 24,800–25,000 over the next few days.",
            "pubDate": "2025-08-25T09:48:42.378018"
        },
        {
            "title": "JK Paper, TNPL and other paper stocks rally to 17% as govt fixes floor price on packaging imports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jk-paper-tnpl-and-other-paper-stocks-rally-to-17-as-govt-fixes-floor-price-on-packaging-imports/articleshow/123498660.cms",
            "description": "Shares of paper companies surged up to 17% on Monday after the government imposed a Minimum Import Price (MIP) on Virgin Multi-layer Paper Board to curb cheaper imports and protect domestic producers. JK Paper, Tamil Nadu Newsprint & Papers, and West Coast Paper led the gains, with heavy trading volumes signaling strong investor interest in the sector.",
            "pubDate": "2025-08-25T09:48:42.378139"
        },
        {
            "title": "European shares retreat after Powell rally, JDE Peet's soars on buyout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-retreat-after-powell-rally-jde-peets-soars-on-buyout/articleshow/123498458.cms",
            "description": "European shares retreated on Monday, having come close to record highs in the previous session on optimism around U.S. monetary policy easing, while shares of JDE Peet's touched a three-year high following a buyout deal.",
            "pubDate": "2025-08-25T09:48:42.378342"
        },
        {
            "title": "Fed rate moves could drive Wall Street rally: Peter McGuire",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-rate-moves-could-drive-wall-street-rally-peter-mcguire/articleshow/123498310.cms",
            "description": "Wall Street staged a notable comeback last week, leaving investors weighing the implications of Fed policy, inflation, and labor market signals. The Nasdaq jumped nearly 2%, the S&P 500 rose 1.5%, and the Dow saw strong gains after remarks from Fed Chair Jerome Powell stirred hopes of potential rate cuts.",
            "pubDate": "2025-08-25T09:48:42.378442"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 26% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-26-in-1-year/articleshow/123498131.cms",
            "description": "We have seen the positive impact on the street of the promised GST rate rationalisation. Going forward, it is the speed at which this decision is implemented that will determine festive season sales. And that is critical for the earnings of companies that notch up most of their sales in these months. Also, in the coming weeks, keep an eye on the currency market as that would be the lead indicator of what is going to happen in the equity markets. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-08-25T09:48:42.378534"
        },
        {
            "title": "Expert take: Vodafone Idea, Vedanta among 5 stocks to buy this week for upside up to 24%. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/expert-take-vodafone-idea-vedanta-among-5-stocks-to-buy-this-week-for-upside-up-to-24-heres-why/articleshow/123498207.cms",
            "description": "Nifty started Monday positively, supported by GST reform updates and expectations of Fed rate cuts. Expert Anuj Gupta recommends five stocks—Vodafone Idea, Dabur India, Tata Motors, Reliance Industries, Vedanta—with potential upside of 6–24% in the short-to-medium term. Stop-loss and target levels are suggested for cautious trading.",
            "pubDate": "2025-08-25T09:48:42.378630"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Spread in Nifty for likely gains amid bullish view",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-for-likely-gains-amid-bullish-view/articleshow/123498038.cms",
            "description": "Nifty ended the week at 24,870, up 0.97%, showing bullish momentum above the 20-SMA. Short-term profit booking and geopolitical concerns caused a bearish shift. Traders may consider a Bull Call Spread to benefit from potential rebound while managing risk amid mixed global cues.",
            "pubDate": "2025-08-25T09:48:42.378720"
        },
        {
            "title": "Ethereum jumps nearly 9% in a week to $4,716;  Bitcoin stays range-bound. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ethereum-jumps-nearly-9-in-a-week-to-4716-bitcoin-stays-range-bound-heres-why/articleshow/123497979.cms",
            "description": "Ethereum hit a four-year high above $4,920 before easing near $4,750, up 9% in a week. Bitcoin slipped from $117K to $112K after the Fed signals, sparking liquidations. Altcoins traded mixed, with Hyperliquid leading. Market cap hovered near $3.93 trillion, sentiment neutral.",
            "pubDate": "2025-08-25T09:48:42.378905"
        },
        {
            "title": "Valuation & Liquidity: Quantum AMC’s Winning Investment Approach",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuation-liquidity-quantum-amcs-winning-investment-approach/slideshow/123497946.cms",
            "description": "George Thomas in an interview to ET Now pointed out that with interest rate cuts, net interest margins for banks may see some moderation in the near term. However, the market has already factored this in. On the positive side, non-performing asset cycles remain benign, keeping credit costs under control. This makes the sector attractive from a valuation standpoint. Within banking, he prefers private sector banks where the upside looks stronger, especially as credit growth is expected to pick up with economic momentum.",
            "pubDate": "2025-08-25T09:48:42.378999"
        }
    ]
}