{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-19T14:54:34.789564",
    "items": [
        {
            "title": "Sebi promotes broadened investor participation in infrastructure sector for enhanced liquidity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-promotes-broadened-investor-participation-in-infrastructure-sector-for-enhanced-liquidity/articleshow/123987431.cms",
            "description": "SEBI is looking to attract a wider range of investors, including mutual funds, pension funds, and retail participants, to the infrastructure sector to boost liquidity in infrastructure securities. Chairman Tuhin Kanta Pandey highlighted the need for expedited asset monetisation by state governments and cautioned against over-reliance on banks and government funding, advocating for market-based instruments to diversify risk.",
            "pubDate": "2025-09-19T00:47:19.408941"
        },
        {
            "title": "Stocks in news: Adani Enterprises, Adani Power, Vedanta, Texmaco Rail, Oil India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-adani-enterprises-adani-power-vedanta-texmaco-rail-oil-india/articleshow/123980753.cms",
            "description": "Markets showed volatility but maintained a positive trend. Adani Group stocks are in focus as Sebi dismissed allegations in the Hindenburg case. Indian Hotels clarified its leasehold rights for The Pierre hotel. Bombay Dyeing appointed Rohit Santhosh as CEO of Bombay Realty, while Oil India anticipates the restart of a Mozambique LNG project by year-end.",
            "pubDate": "2025-09-19T00:47:19.409062"
        },
        {
            "title": "NaBFID needs to make ambitious projects bankable: DFS secretary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nabfid-needs-to-make-ambitious-projects-bankable-dfs-secretary/articleshow/123987404.cms",
            "description": "NaBFID, having sanctioned ₹2 lakh crore in projects, is urged to enhance expertise and systems for long-term infrastructure viability, according to M Nagaraju. He suggested NaBFID act as a transaction advisor, mitigating early-stage risks to attract commercial investment. Focus should be on urban infrastructure and water, developing standards and engaging with states to improve project bankability.",
            "pubDate": "2025-09-19T00:47:19.409292"
        },
        {
            "title": "Motilal Oswal settles case with Sebi,  pays Rs 34.85 lakh as settlement charges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-settles-case-with-sebi-pays-rs-34-85-lakh-as-settlement-charges/articleshow/123987376.cms",
            "description": "Sebi has settled proceedings with Motilal Oswal Financial Services regarding a case of suspected front-running by the Chaturvedi Group, linked to a large client's trades. The brokerage paid ₹34.85 lakh as settlement charges. The regulator alleged the firm failed to maintain proper order records and attempted to create supporting documents post-execution, leading to a show-cause notice earlier this year.",
            "pubDate": "2025-09-19T00:47:19.409397"
        },
        {
            "title": "Will US Fed rate cut lead to revival of foreign investment in Indian stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-us-fed-rate-cut-lead-to-revival-of-foreign-investment-in-indian-stocks/articleshow/123987336.cms",
            "description": "Following the US Federal Reserve's rate cut, anticipation surrounds the potential return of foreign capital to Indian equities. However, high valuations in India and attractive opportunities in markets like China may temper inflows. While foreign selling has slowed, a significant turnaround hinges on domestic institutional investor activity and improved earnings momentum to shift FPI sentiment.",
            "pubDate": "2025-09-19T00:47:19.409493"
        },
        {
            "title": "Nifty, Sensex rise for a 3rd day after US Fed rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-sensex-rise-for-a-3rd-day-after-us-fed-rate-cut/articleshow/123987249.cms",
            "description": "Indian stock indices climbed for the third consecutive session on Thursday, buoyed by the US Federal Reserve's expected interest rate cut. The NSE Nifty and BSE Sensex both closed 0.4% higher, while the India Volatility Index hit a record low. Foreign and domestic portfolio investors were net buyers, contributing to the positive market sentiment.",
            "pubDate": "2025-09-19T00:47:19.409588"
        },
        {
            "title": "Stock Radar: Defense major HAL gains momentum; upside seen till Rs 5,130, Shivangi Sarda recommends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-defense-major-hal-gains-momentum-upside-seen-till-rs-5130-shivangi-sarda-recommends/articleshow/123972607.cms",
            "description": "Hindustan Aeronautics Limited stock broke out after consolidating for two months. Experts suggest short-term traders consider buying. The stock previously hit a high in May. It faced resistance around Rs 4,600. Support was found near Rs 4,300. The stock rallied over ten percent in a week. Analysts recommend a target of Rs 5,130 in the coming weeks.",
            "pubDate": "2025-09-19T00:47:19.409684"
        },
        {
            "title": "Step up infrastructure credit flow, India requires $4.5 trillion growth capital: PFRDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/step-up-infrastructure-credit-flow-india-requires-4-5-trillion-growth-capital-pfrda/articleshow/123987356.cms",
            "description": "India requires a substantial $4.5 trillion infrastructure investment by 2030 to maintain its desired growth. Sivasubramanian Ramann highlighted the shift in financing from banks to pension and insurance funds, better suited for long-term projects. Regulatory reforms and wider use of credit enhancement schemes are expected to boost credit flow and bond issuance for infrastructure companies.",
            "pubDate": "2025-09-19T00:47:19.409773"
        },
        {
            "title": "NCLT approves Gayatri Projects' settlement plan from promoters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nclt-approves-gayatri-projects-settlement-plan-from-promoters/articleshow/123987349.cms",
            "description": "The Hyderabad NCLT has approved a ₹2,400 crore OTS plan by Gayatri Projects' promoters, resolving ₹8,100 crore in dues to lenders led by Canara Bank. With 97% lender approval, the promoters have 90 days to pay ₹750 crore, cover bank guarantee invocations, and allocate ₹450 crore from arbitration claims.",
            "pubDate": "2025-09-19T00:47:19.409870"
        },
        {
            "title": "Godfrey Phillips India shares in focus following arrest of director Samir Modi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godfrey-phillips-india-shares-in-focus-following-arrest-of-director-samir-modi/articleshow/123988835.cms",
            "description": "Godfrey Phillips India's shares are under scrutiny after director Samir Modi's arrest in Delhi on rape charges, following a complaint filed by a former employee alleging repeated sexual assault since 2019. Modi's legal team denies the allegations, claiming extortion.",
            "pubDate": "2025-09-19T03:38:53.341143"
        },
        {
            "title": "Vedanta shares in focus after being named preferred bidder for manganese block in Andhra Pradesh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-after-being-named-preferred-bidder-for-manganese-block-in-andhra-pradesh/articleshow/123988791.cms",
            "description": "Vedanta share price: Vedanta has been declared the ‘Preferred Bidder’ for the Punnam Manganese Block in Andhra Pradesh after qualifying in the government’s auction process. The 152-hectare block is at the G4 exploration stage, and the license grant will be subject to regulatory approvals and conditions.",
            "pubDate": "2025-09-19T03:38:53.341269"
        },
        {
            "title": "Hindenburg case ends: 5 Adani Group stocks with potential to rally up to 58%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindenburg-case-ends-5-adani-group-stocks-with-potential-to-rally-up-to-58/slideshow/123988863.cms",
            "description": "The Sebi closure of investigations into the Hindenburg allegations has come as a major relief to the Adani Group. With the regulatory cloud lifted, brokerages have turned their focus back to fundamentals and growth potential. Here are five Adani stocks that analysts believe could rally significantly from current levels.",
            "pubDate": "2025-09-19T03:38:53.341385"
        },
        {
            "title": "Adani Group stocks in focus as Sebi clears Gautam Adani, Rajesh Adani of Hindenburg allegations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-in-focus-as-sebi-clears-gautam-adani-rajesh-adani-of-hindenburg-allegations/articleshow/123988723.cms",
            "description": "Adani Group share price: Sebi has given a clean chit to Gautam Adani, Rajesh Adani, and several Adani Group firms in the Hindenburg case, saying its probe found no fraud, fund misuse, or rule violations. The regulator said the transactions in question were regular loans and not related-party deals.",
            "pubDate": "2025-09-19T03:38:53.341489"
        },
        {
            "title": "Dividend alert: BEML, 56 other stocks to go ex-dividend on Monday. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-alert-beml-56-other-stocks-to-go-ex-dividend-on-monday-do-you-own-any/articleshow/123988670.cms",
            "description": "Investors seeking BEML Ltd's dividend must buy shares today. September 22 is the record date. Many listed firms also offer dividends with the same record date. A list of companies trading ex-dividend today includes AB Infrabuild, Accel Ltd, Bajaj Holdings, and many more. Investors should purchase shares before market close to receive dividends. This information is sourced from StockEdge data.",
            "pubDate": "2025-09-19T03:38:53.341591"
        },
        {
            "title": "Adani Power 1:5 stock split: Last day to buy shares for first-ever split eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-15-stock-split-last-day-to-buy-shares-for-first-ever-split-eligibility/articleshow/123988431.cms",
            "description": "Investors have one last chance to buy Adani Power shares to qualify for the stock split. The record date is September 22, 2025. Each share of face value Rs 10 will split into five shares of face value Rs 2. Shareholders approved the split on September 4, 2025. The company aims to increase outstanding shares and improve liquidity.",
            "pubDate": "2025-09-19T03:38:53.341692"
        },
        {
            "title": "Smallcap stock with 1,100% 5-year returns to go ex-bonus for 2:1 bonus issue. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stock-with-1100-5-year-returns-to-go-ex-bonus-for-21-bonus-issue-last-day-to-buy/articleshow/123988386.cms",
            "description": "Sandur Manganese & Iron Ores announces a 2:1 bonus issue. Investors aiming for bonus shares must buy shares today. September 22, 2025, is the record date. The company's stock has shown significant growth in the past. Shareholders will receive two shares for each share held. This bonus issue increases the total number of outstanding shares.",
            "pubDate": "2025-09-19T03:38:53.341787"
        },
        {
            "title": "Interns are being offered $14,000 a month by high-speed trading firms in India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/interns-are-being-offered-14000-a-month-by-high-speed-trading-firms-in-india/articleshow/123988097.cms",
            "description": "Despite regulatory scrutiny in India's equity derivatives market, high-speed trading firms are significantly increasing entry-level pay. Companies like IMC Trading and Quadeye are offering lucrative packages to interns and new hires, driven by the potential for substantial profits.",
            "pubDate": "2025-09-19T03:38:53.341881"
        },
        {
            "title": "Banco Products among 5 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banco-products-among-5-stocks-witness-5-year-swing-high-breakout/slideshow/123988057.cms",
            "description": "In the NSE list of companies with a market cap over Rs 10,000 crore, five stocks witnessed a 5-year swing high at the close on September 18, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as bullish, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-19T03:38:53.341975"
        },
        {
            "title": "Biocon, ITC among 8 Stocks flashing bullish RSI signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-itc-among-8-stocks-flashing-bullish-rsi-signals/slideshow/123988020.cms",
            "description": "Eight stocks in the Nifty200 pack were highlighted in the RSI Trending Up scan on September 18, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-19T03:38:53.342091"
        },
        {
            "title": "Positive Breakout: These 6 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-6-stocks-close-cross-above-their-200-dmas/slideshow/123987967.cms",
            "description": "The closing prices of six stocks from the Nifty500 pack crossed above their 200 DMAs (Daily Moving Averages) on September 18, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-19T03:38:53.342188"
        },
        {
            "title": "Wall Street indexes notch record-high closes as Intel soars on Nvidia stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-notch-record-high-closes-as-intel-soars-on-nvidia-stake/articleshow/123987858.cms",
            "description": "Wall Street saw record highs after the US Federal Reserve reduced interest rates. Chipmaker Intel experienced a significant surge following Nvidia's investment. The small-cap Russell 2000 index also reached a new high. The Fed indicated potential further rate cuts due to a softening job market. CrowdStrike shares rose after brokerage upgrades.",
            "pubDate": "2025-09-19T03:38:53.342280"
        },
        {
            "title": "Motilal Oswal bullish on HAL: breakout, strong volumes support uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-bullish-on-hal-breakout-strong-volumes-support-uptrend/videoshow/123979713.cms",
            "description": "“Hindustan Aeronautics (HAL) stock has remained in strong focus on the back of a sustained uptrend in both its price action and derivatives activity, reinforcing bullish strength from the chart as well as data. Traders can buy for a target of Rs 5130 in the next 2-3 weeks,” Shivangi Sarda, Analyst, Derivatives and Technical Research, Motilal Oswal Financial Services Ltd, said.",
            "pubDate": "2025-09-19T03:38:53.342375"
        },
        {
            "title": "Asian stocks rise as global gauge hits new peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-as-global-gauge-hits-new-peak/articleshow/123987572.cms",
            "description": "Asian stock markets are performing well. US equity benchmarks reached new highs. This was supported by the Federal Reserve's interest rate cut. Stocks in Japan and Australia increased. South Korea remained stable. The S&P 500 and other indexes achieved record highs together. The yen remained steady after Japan's inflation slowed. The Bank of Japan's rate decision is expected.",
            "pubDate": "2025-09-19T03:38:53.342465"
        },
        {
            "title": "Sebi gives clean chit to Adani on Hindenburg allegations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-gives-clean-chit-to-adani-on-hindenburg-allegations/articleshow/123987506.cms",
            "description": "Sebi has exonerated Gautam Adani and other Adani group companies regarding Hindenburg Research's allegations of stock manipulation. The investigation, spanning from FY13 to FY21, found no evidence of fraudulent transactions or siphoning of funds. Sebi concluded that the transactions in question did not qualify as related-party transactions, thus not violating listing agreements.",
            "pubDate": "2025-09-19T03:38:53.342558"
        },
        {
            "title": "Will Saatvik Green Energy IPO spark long-term value for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-saatvik-green-energy-ipo-spark-long-term-value-for-investors/articleshow/123987460.cms",
            "description": "Saatvik Green Energy, a solar module manufacturer, is planning an IPO. The company aims to raise ₹700 crore through fresh equity. It will use the funds to expand capacity and repay debt. An additional ₹200 crore will be raised through an offer for sale. The IPO will reduce promoter stake to 76.02%. Saatvik's financials show strong revenue and profit growth.",
            "pubDate": "2025-09-19T03:38:53.342655"
        },
        {
            "title": "Tata Investment, STL Networks among 9 stocks flashing White Marubozu breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-stl-networks-among-9-stocks-flashing-white-marubozu-breakouts/slideshow/123989222.cms",
            "description": "On September 18, nine NSE-listed stocks with a market cap above Rs 1,000 crore appeared on the bullish “White Marubozu” scanner, according to StockEdge’s technical scan data.A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest point of the session and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and little or no lower shadow, it signals strong buying pressure throughout the day. Traders often view it as an indication that buyers dominated from open to close, using it as a cue for potential bullish momentum.",
            "pubDate": "2025-09-19T03:59:15.240452"
        },
        {
            "title": "Vodafone Idea shares in focus ahead of key AGR hearing in Supreme Court",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-ahead-of-key-agr-hearing-in-supreme-court/articleshow/123989125.cms",
            "description": "Vodafone Idea shares will be in focus on September 19 as the Supreme Court hears its plea against the DoT’s Rs 9,450 crore AGR demand. The telco argues the claim includes duplications and pre-merger liabilities, while the DoT calls it pending account finalisation. The verdict could impact Vodafone Idea’s funding talks and long-term financial strategy.",
            "pubDate": "2025-09-19T03:59:15.240579"
        },
        {
            "title": "Biocon, Laurus Labs among 6 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-laurus-labs-among-6-stocks-that-closed-above-vwap/slideshow/123989085.cms",
            "description": "On September 18, the closing prices of six stocks in the Nifty500 pack ended over 1% higher than their VWAP (Volume Weighted Average Price), according to StockEdge’s technical scan data. A move above VWAP is typically seen as a potential bullish signal.When the closing price is above the VWAP, it means the stock closed higher than the average price at which it traded during the day, with the average weighted by trading volume. Traders and investors often interpret this as an indication of positive market sentiment.",
            "pubDate": "2025-09-19T03:59:15.240682"
        },
        {
            "title": "Indian Bank, HFCL, among 8 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-bank-hfcl-among-8-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123989040.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack as of September 18, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-19T03:59:15.240777"
        },
        {
            "title": "Ola Electric shares rally 40% in one month. Are you missing out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-rally-40-in-one-month-are-you-missing-out/articleshow/123989521.cms",
            "description": "Ola Electric shares have experienced a 40% surge in the past month, driven by supportive government policies, improved operational efficiency, and overall sector optimism. The company's eligibility for Production Linked Incentive scheme and enhanced gross margins have boosted investor confidence. However, technical indicators present a mixed outlook, with analysts suggesting potential short-term corrections despite the positive trend.",
            "pubDate": "2025-09-19T04:24:43.040618"
        },
        {
            "title": "Indian Hotels shares in focus after clarification on Pierre Hotel exit buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-hotels-shares-in-focus-after-clarification-on-pierre-hotel-exit-buzz/articleshow/123989481.cms",
            "description": "Indian Hotels Company clarified it does not own but operates New York’s The Pierre under leasehold rights, dismissing reports of a $2 billion exit deal as “misleading and speculative.” The filing stressed hotel operations remain unaffected, with disclosures to follow if required. The clarification comes amid IHCL’s selective overseas strategy and focus on city-specific opportunities.",
            "pubDate": "2025-09-19T04:24:43.040743"
        },
        {
            "title": "Foreign holdings of US treasuries hit record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-holdings-of-us-treasuries-hit-record-high/slideshow/123989497.cms",
            "description": "Foreign holdings of U.S. Treasuries surged to a record $9.159 trillion in July, up from $9.126 trillion in June. Compared with a year earlier, Treasuries owned by foreigners have increased by nearly 9%, reflecting a steady appetite for U.S. government debt. (Source: Reuters)",
            "pubDate": "2025-09-19T04:24:43.040849"
        },
        {
            "title": "BOJ keeps interest rates steady, decides to start selling ETFs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-keeps-interest-rates-steady-decides-to-start-selling-etfs/articleshow/123989415.cms",
            "description": "The Bank of Japan (BOJ) has decided to maintain its short-term interest rates at 0.5% following a two-day policy meeting. However, in a significant shift, the BOJ will begin selling its holdings of exchange-traded funds (ETFs) and real-estate investment trusts (REITs). The decision saw dissent from board members Naoki Tamura and Hajime Takata.",
            "pubDate": "2025-09-19T04:24:43.040963"
        },
        {
            "title": "5 big-ticket IPOs gearing up for Diwali debut. Check details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-big-ticket-ipos-gearing-up-for-diwali-debut-check-details-here/slideshow/123989405.cms",
            "description": "India’s IPO market is regaining momentum after bouts of volatility, with startup listings taking centre stage. With Sebi’s regulatory reforms and strong domestic SIP inflows cushioning foreign outflows, bankers expect three to five startups to hit the market around Diwali, according to a report by the Times of India. Here are five of the hottest IPOs lining up for a late October–November debut.",
            "pubDate": "2025-09-19T04:24:43.041059"
        },
        {
            "title": "Sensex sheds over 200 pts, Nifty50 below 25,400 as D-St snaps 3-day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-sheds-over-200-pts-nifty50-below-25400-as-d-st-snaps-3-day-rally/articleshow/123989293.cms",
            "description": "Indian stocks experienced a slight downturn on Friday, halting a three-day rally. The Sensex and Nifty 50 indices both opened lower, influenced by tempered enthusiasm regarding potential U.S. Federal Reserve rate cuts and the advancement of trade discussions between India and the United States. Investors are adopting a cautious approach after recent gains.",
            "pubDate": "2025-09-19T04:24:43.041156"
        },
        {
            "title": "The big Rs 1.4 lakh crore question: Are FIIs done betting against Sensex, Nifty?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-big-rs-1-4-lakh-crore-question-are-fiis-done-betting-against-sensex-nifty/articleshow/123989350.cms",
            "description": "Foreign investors may reverse their stance on Indian markets. A rally in Sensex and Nifty is expected. US Federal Reserve rate cuts and India's economic resilience are key factors. GST reductions and other reforms are also important. Earnings recovery is expected from Q3FY26. This could trigger renewed capital inflows. The macroeconomic foundation of India remains strong.",
            "pubDate": "2025-09-19T04:24:43.041249"
        },
        {
            "title": "Waaree Energies shares in focus after board okays Racemosa stake buy by unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-in-focus-after-board-okays-racemosa-stake-buy-by-unit/articleshow/123989301.cms",
            "description": "Waaree Energies' subsidiary, Waaree Power, is set to acquire a 76% stake in Racemosa Energy, a smart meter manufacturer, for approximately Rs 53 crore. This strategic move will allow Waaree to enhance its renewable energy and power distribution offerings by leveraging Racemosa's expertise in smart metering solutions. The deal, expected to close in FY 2025-26, is subject to regulatory approvals.",
            "pubDate": "2025-09-19T04:24:43.041343"
        },
        {
            "title": "John Cockerill India shares jump 4% on after bagging contract from Tata Steel in Jamshedpur",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/john-cockerill-india-shares-in-focus-on-tata-steels-jamshedpur-project-contract/articleshow/123989269.cms",
            "description": "John Cockerill India's shares rose after securing a contract from Tata Steel to supply a push-pull pickling line and acid regeneration plant for its Jamshedpur Tinplate Division. The advanced technology aims to enhance production efficiency and support Tata Steel's sustainability goals. Earlier this month, the company also secured a contract from JSW JFE Electrical Steel Nashik.",
            "pubDate": "2025-09-19T04:24:43.041436"
        },
        {
            "title": "Adani Power shares soar 9% as Morgan Stanley initiates coverage with 'Overweight' rating, 30% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-soar-9-as-morgan-stanley-initiates-coverage-with-overweight-rating-30-upside-seen/articleshow/123989945.cms",
            "description": "Adani Power share price: Morgan Stanley initiated coverage of Adani Power with an Overweight rating and a Rs 818 price target, seeing nearly 30% upside. The brokerage highlighted the company’s large coal-based capacity, growth plans to 41.9 GW by FY32, and robust long-term PPAs under India’s SHAKTI policy.",
            "pubDate": "2025-09-19T05:14:44.327904"
        },
        {
            "title": "UK consumer confidence dips ahead of November Budget",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uk-consumer-confidence-dips-ahead-of-november-budget/slideshow/123990174.cms",
            "description": "Britons grew more pessimistic in September, with GfK reporting that the consumer confidence index fell to -19, down from -17 in August. August had been the highest reading since December last year, but September’s decline shows renewed concerns among households. The figure was also slightly below the -18 forecast in a Reuters poll. (Source: Reuters)",
            "pubDate": "2025-09-19T05:14:44.328034"
        },
        {
            "title": "BOJ keeps interest rates steady, decides to start selling ETFs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-keeps-interest-rates-steady-decides-to-start-selling-etfs/articleshow/123989780.cms",
            "description": "The Bank of Japan has maintained its short-term interest rates at 0.5%. However, the central bank decided to begin selling its exchange-traded funds and real-estate investment trusts. Naoki Tamura and Hajime Takata dissented to the decision. Governor Kazuo Ueda will explain the decision at a news conference. The policy meeting concluded on Friday.",
            "pubDate": "2025-09-19T05:14:44.328138"
        },
        {
            "title": "RVNL shares rally over 12% in 11 days. What's behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-rally-over-12-in-11-days-whats-behind-the-surge/articleshow/123992377.cms",
            "description": "Shares of Rail Vikas Nigam Ltd (RVNL) have seen an impressive rally, surging 12.5% over eleven sessions, mirroring a broader recovery in railway-linked stocks like Titagarh Rail and IRFC. This rebound is fueled by a reset in valuations and new contract wins, including a Rs 169 crore project from West Central Railway.",
            "pubDate": "2025-09-19T06:54:57.716690"
        },
        {
            "title": "Jefferies finds Adani Green Energy shares trading at 63% discount. Check target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-finds-adani-green-energy-shares-trading-at-63-discount-check-target-price/articleshow/123992043.cms",
            "description": "Adani Green shares surged after SEBI cleared Hindenburg allegations. Jefferies set Rs 1,300 target, citing capacity growth, strong PPAs, and debt reduction, while risks include execution delays and US probe. Q1 profit rose 60%.",
            "pubDate": "2025-09-19T06:54:57.716817"
        },
        {
            "title": "Rs 2,800 crore! Top 10 stocks that saw promoters & other insiders step up buying in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-2800-crore-top-10-stocks-that-saw-promoters-other-insiders-step-up-buying-in-2025/slideshow/123992266.cms",
            "description": "Despite geopolitical conflicts, trade tariffs, and domestic uncertainty shaking investor confidence in 2025, company insiders and promoters have been quietly accumulating shares in their own firms. Here’s a snapshot of the top insider buys this year, from January 1 to September 16, highlighting the value of purchases, stock performance since the transaction, and distance from 52-week highs.",
            "pubDate": "2025-09-19T06:54:57.716937"
        },
        {
            "title": "Supreme Court weighs Trump’s bid to remove Fed Governor Lisa Cook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/supreme-court-weighs-trumps-bid-to-remove-fed-governor-lisa-cook/slideshow/123992025.cms",
            "description": "The Trump administration has asked the U.S. Supreme Court to allow the firing of Federal Reserve Governor Lisa Cook. This unprecedented move challenges the independence of the Fed, which has been protected since its founding in 1913. President Trump seeks to remove Cook, a Biden appointee, citing alleged mortgage fraud as the reason. On September 9, U.S. District Judge Jia Cobb temporarily blocked the removal, ruling that Trump’s claims likely do not constitute sufficient legal grounds under the law that governs the Fed. (Source: Reuters)",
            "pubDate": "2025-09-19T06:54:57.717068"
        },
        {
            "title": "GST cuts, Fed rate action spark market optimism:  Alok Agarwal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-cuts-fed-rate-action-spark-market-optimism-alok-agarwal/articleshow/123991730.cms",
            "description": "Alok Agarwal sees brighter prospects for Indian equities, citing tax reforms, GST cuts, and global easing as growth drivers. While trade talks with the US remain a hurdle, cooling valuations, resilient earnings, and emerging sectoral opportunities point to renewed investor confidence and potential FII inflows after earlier outflows.",
            "pubDate": "2025-09-19T06:54:57.717169"
        },
        {
            "title": "Adani Power share price target at Rs 818: 3 reasons the stock is up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-share-price-target-at-rs-818-3-reasons-the-stock-is-up-9/articleshow/123991557.cms",
            "description": "Shares of Adani Power surged 9% to Rs 687 on the NSE on September 19, driven by renewed investor enthusiasm. Analysts cite three key catalysts for a potential 30% upside, including Morgan Stanley’s overweight rating, the company’s plan to expand operational capacity from 18.15 GW to 41.9 GW by FY32, and a $22–27 billion investment in under-construction projects.",
            "pubDate": "2025-09-19T06:54:57.717268"
        },
        {
            "title": "Rs 46,000 crore rally! What Sebi slamming the door on Hindenburg means for Adani investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-46000-crore-rally-what-sebi-slamming-the-door-on-hindenburg-means-for-adani-investors/articleshow/123991448.cms",
            "description": "After 32 months of scrutiny, Sebi has given the Adani Group a clean chit, dismissing Hindenburg Research’s allegations. The verdict has sparked a strong market reaction, with the group’s combined market capitalization surging over Rs 46,000 crore to Rs 13.8 lakh crore. Individual stocks jumped up to 10%, marking the end of a regulatory overhang that had weighed on the conglomerate since January 2023.",
            "pubDate": "2025-09-19T06:54:57.717359"
        },
        {
            "title": "Rs 15,000 crore! Top 10 stocks that saw highest promoter & other insider selling in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-15000-crore-top-10-stocks-that-saw-highest-promoter-other-insider-selling-in-2025/slideshow/123991510.cms",
            "description": "From January 1 to September 16, a handful of leading companies saw their insiders offload significant shares, Nuvama’s latest report shows. It’s been a year mostly filled with steep slides followed by moderately sharp rebounds. While some promoters snapped up falling stocks, the overwhelming mood was caution. Market purchases and sales tracked by Nuvama show that insiders—promoters and groups who know their companies best—increasingly offloading stakes, spooked by global turmoil like trade tariffs, geopolitical conflicts, and domestic uncertainty. Here the top 10 insider selling stocks, with volumes, value, and standout market trends.",
            "pubDate": "2025-09-19T06:54:57.717450"
        },
        {
            "title": "JSW Energy shares up 3%, rise for 2nd straight session: Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-energy-shares-up-3-rise-for-2nd-straight-session-heres-why/articleshow/123990833.cms",
            "description": "JSW Energy shares surged following the announcement of JSW Neo Energy's acquisition of Tidong Power Generation for Rs 39 crore, supporting its 30 GW renewable energy target by FY 2030. Additionally, GE Power's boiler business demerger into JSW Energy, with a share exchange ratio, further fueled investor optimism.",
            "pubDate": "2025-09-19T06:54:57.717543"
        },
        {
            "title": "Canara Bank shares gain 2% on strong volumes, hover near 52-week high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canara-bank-shares-gain-2-on-strong-volumes-hover-near-52-week-high/articleshow/123990802.cms",
            "description": "Canara Bank shares are performing well. The stock price increased by 2.2% on Friday. It reached an intraday high of Rs 117.85 on the BSE. The stock is close to its 52-week high. Technical data suggests continued support. Trading volumes are strong, indicating active market participation. The relative strength index shows firm momentum. Buying interest remains consistent.",
            "pubDate": "2025-09-19T06:54:57.717637"
        },
        {
            "title": "Japan's Nikkei flips to losses, yen firms as BOJ holds rates in split decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-flips-to-losses-yen-firms-as-boj-holds-rates-in-split-decision/articleshow/123990788.cms",
            "description": "Bank of Japan maintains interest rates. However, it signals a possible future tightening of monetary policy. This decision surprises markets. Nikkei declines, and the yen strengthens. The central bank plans to sell its ETF holdings. Japanese government bond yields rise. Investors anticipate potential rate hikes later this year. Focus now shifts to Governor Kazuo Ueda's upcoming news conference.",
            "pubDate": "2025-09-19T06:54:57.717729"
        },
        {
            "title": "Texmaco Rail & Engineering shares rally 4% on Rs 87 crore order win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/texmaco-rail-engineering-shares-rally-4-on-rs-87-crore-order-win/articleshow/123990718.cms",
            "description": "Texmaco Rail & Engineering share price: Texmaco Rail & Engineering secured a fresh order worth Rs 86.85 crore from UltraTech Cement for BCFC wagons and a Brake Van, with delivery by March 2026. Recent wins, including contracts from RVNL and Leap Grain Rail Logistics, highlight strong momentum in the wagon and engineering segment.",
            "pubDate": "2025-09-19T06:54:57.717820"
        },
        {
            "title": "Redington shares rally 8% on iPhone 17 launch; gain 28% in five sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-shares-jump-another-jump-8-as-iphone-17-sale-go-live-in-india/articleshow/123990662.cms",
            "description": "Redington Ltd Share price of surged 7.59% to Rs 310 on the BSE, gaining 28% over the past five sessions amid optimism around Apple’s iPhone 17 launch. The stock’s rally reflects confidence in Redington’s long-standing Apple distribution partnership and strong execution across high-growth markets. Over the last six months, the share has gained 36.7%, highlighting renewed investor interest.",
            "pubDate": "2025-09-19T06:54:57.717910"
        },
        {
            "title": "China in holding pattern, India needs reforms: 5 key insights from Jim Walker",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-in-holding-pattern-india-needs-reforms-5-key-insights-from-jim-walker/articleshow/123993207.cms",
            "description": "Aletheia Capital's Chief Economist, Jim Walker, suggests China is in a holding pattern, awaiting policy clarity in 2025, while India's strong fundamentals require reforms to ease business operations. Walker believes tariff tensions could catalyze India's reforms, and investors should focus on financials and consumer stocks. Despite global uncertainties, he remains optimistic about the long-term prospects of both India and China.",
            "pubDate": "2025-09-19T07:36:33.938643"
        },
        {
            "title": "Chris Wood of Jefferies sells Reliance Industries shares to buy Adani stock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chris-wood-of-jefferies-sells-reliance-industries-shares-to-buy-adani-stock/articleshow/123993135.cms",
            "description": "Investor Chris Wood of Jefferies has sold Reliance Industries shares and reduced exposure to select banks, shifting focus to Ambuja Cement amid India’s long-only portfolio. The move follows RIL’s AGM announcements, including Jio Platforms’ 2026 IPO and FMCG revenue targets. Ambuja gained appeal from a GST rate cut, cost efficiencies, and accelerated industry consolidation, prompting HSBC to upgrade it to buy.",
            "pubDate": "2025-09-19T07:36:33.938770"
        },
        {
            "title": "US markets riding on Fed optimism, but challenges loom ahead: Taimur Baig",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-markets-riding-on-fed-optimism-but-challenges-loom-ahead-taimur-baig/articleshow/123993017.cms",
            "description": "Despite US market frothiness, AI investment fuels growth, says DBS Bank's Taimur Baig. He notes a nuanced labor market with potential wage pressures and steady consumption. Two Fed rate cuts are anticipated, possibly influenced by political factors. Looking ahead to 2026, Baig cautions about emerging inflation sources, including tariffs, energy demands from AI, and wage pressures.",
            "pubDate": "2025-09-19T07:36:33.938975"
        },
        {
            "title": "Eicher Motors’ 20-year journey: Rs 1 lakh grows into Rs 3.5 crore with 35,000% returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eicher-motors-20-year-journey-rs-1-lakh-grows-into-rs-3-5-crore-with-35000-returns/articleshow/123992773.cms",
            "description": "Eicher Motors has turned Rs 1 lakh into Rs 3.5 crore since its 2004 NSE listing, delivering 35,000% returns. Riding on GST-led price cuts and strong three-month gains of 29%, analysts see more upside with targets of Rs 7,500–7,800 in the near term.",
            "pubDate": "2025-09-19T07:36:33.939111"
        },
        {
            "title": "When gold prices go up, stock prices go down: The inverse relationship is now broken",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/when-gold-prices-go-up-stock-prices-go-down-the-inverse-relationship-is-now-broken/articleshow/123992706.cms",
            "description": "ICICI Securities reports that gold's risk signal for equities is now unreliable, reminiscent of the 1970s 'Nixon shock.' The traditional inverse correlation between gold and stocks has faded since 2022, driven by central banks' increased gold demand amid geopolitical risks. This shift renders gold prices questionable for long/short equities strategies until the current reset completes.",
            "pubDate": "2025-09-19T07:36:33.939211"
        },
        {
            "title": "Indian financial sector set for 11% credit growth in FY25, says Jefferies analyst",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-financial-sector-set-for-11-credit-growth-in-fy25-says-jefferies-analyst/articleshow/123992603.cms",
            "description": "The Indian financial sector has evolved significantly, expanding beyond banks to include NBFCs, insurers, asset managers, and fintech firms. Investors now benefit from greater choice, competition, and attractive valuations. With proactive RBI policies, GST cuts, and rising credit growth, the sector remains resilient, offering balanced growth opportunities across all segments.",
            "pubDate": "2025-09-19T07:36:33.939314"
        },
        {
            "title": "To create wealth, think beyond Trump & even GST rationalisation: 8 stocks from different sectors with upside potential of up to 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/to-create-wealth-think-beyond-trump-even-gst-rationalisation-8-stocks-from-different-sectors-with-upside-potential-of-up-to-38/articleshow/123993128.cms",
            "description": "Is the decline in the Nifty and Sensex today (Friday) making you jittery? Worry not. It’s a minor volatility caused largely by profit-booking. It is bound to happen every now and then. Powered by the euphoria of the GST rate rationalisation and the hope that an India-US trade deal will soon be inked, the underlying sentiment in the market remains bullish. So, ignore the near-term fluctuations and focus on identifying good businesses to buy. And that too for the long term.",
            "pubDate": "2025-09-19T07:59:35.196924"
        },
        {
            "title": "Markets eye GST reset and festive boost; consumption and interest-sensitive sectors in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-eye-gst-reset-and-festive-boost-consumption-and-interest-sensitive-sectors-in-focus/articleshow/123993355.cms",
            "description": "Global markets are showing positive signs after the U.S. Federal Reserve's policy announcement. Indian stock markets are watching for local events like the Goods and Services Tax changes during Navratra. Investors are also paying close attention to festive season sales and September quarter results. Experts suggest focusing on consumption-related and interest rate-sensitive stocks.",
            "pubDate": "2025-09-19T07:59:35.197047"
        },
        {
            "title": "F&O Radar | Deploy Short Strangle in Nifty to gain from cautious, range-bound trading environment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-short-strangle-in-nifty-to-gain-from-cautious-range-bound-trading-environment/articleshow/123993268.cms",
            "description": "The Nifty50 gained over 1,000 points since late August, but a “Hanging Man” pattern signals potential consolidation. Key support lies at 25,250–25,050, with resistance near 25,500–25,600. Analysts suggest a cautious, range-bound approach, with the Short Strangle options strategy offering traders opportunities to benefit from time decay and volatility.",
            "pubDate": "2025-09-19T07:59:35.197262"
        },
        {
            "title": "Fed’s rate cut raises stagflation fears; Jim Walker warns of US recession by 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-rate-cut-raises-stagflation-fears-jim-walker-warns-of-us-recession-by-2026/articleshow/123993262.cms",
            "description": "The US Federal Reserve reduced interest rates due to a cooling labour market. Economist Jim Walker believes this could worsen inflation. He suggests focusing on government spending instead. Further rate cuts are expected in 2025. This could aid Asian economies but tariffs pose a risk. Walker sees parallels to 2008 but highlights government spending as a key difference.",
            "pubDate": "2025-09-19T07:59:35.197361"
        },
        {
            "title": "NBFCs face rising delinquencies even as growth momentum stays intact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfcs-face-rising-delinquencies-even-as-growth-momentum-stays-intact/articleshow/123995254.cms",
            "description": "India’s NBFC sector continues to grow rapidly, outpacing banks, but Moody’s warns of rising delinquencies in vehicle loans, microfinance, subprime mortgages, and education loans, with profitability pressured by higher credit costs despite resilient gold loan growth.",
            "pubDate": "2025-09-19T09:42:03.519733"
        },
        {
            "title": "CDSL shares surge over 40% in 6 months. Can they reclaim record high levels?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cdsl-shares-surge-over-40-in-6-months-can-they-reclaim-record-high-levels/articleshow/123995094.cms",
            "description": "CDSL has delivered a stellar 42% return in six months, with shares trading near Rs 1,600 on NSE, not far from their December 2024 peak of Rs 1,989.80. After a consolidation phase, the stock has regained momentum, posting weekly and monthly gains, and analysts are watching if this strength can drive it back to record highs.",
            "pubDate": "2025-09-19T09:42:03.519876"
        },
        {
            "title": "Ixigo shares jump over 3% after Jefferies' Chris Wood adds stock in India long only portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ixigo-shares-jump-over-3-after-jefferies-chris-wood-adds-stock-in-india-long-only-portfolio/articleshow/123994944.cms",
            "description": "Ixigo shares gained over 3% after Chris Wood of Jefferies added the stock to the India long-only portfolio with a 4% weight. The stock's entry in Wood's portfolio comes on the back of a stellar run over the past year. The online travel company has rallied 88% over the past year, outperforming the Nifty India Tourism index’s 13% returns.",
            "pubDate": "2025-09-19T09:42:03.519984"
        },
        {
            "title": "Adani’s regulatory risks not over as other SEBI probes continue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adanis-regulatory-risks-not-over-as-other-sebi-probes-continue/articleshow/123994828.cms",
            "description": "India’s market regulator, Sebi, continues probing multiple allegations against the Adani Group, including minimum public shareholding compliance and related-party transactions. While some Hindenburg claims were cleared, pending cases and a US DOJ bribery indictment keep regulatory risks alive. Adani’s listed firms have rallied, and expansion plans continue amid scrutiny.",
            "pubDate": "2025-09-19T09:42:03.520079"
        },
        {
            "title": "Japan's Nikkei flips to losses, yen firms as BOJ holds rates in split decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-flips-to-losses-yen-firms-as-boj-holds-rates-in-split-decision/articleshow/123993946.cms",
            "description": "Japan's Nikkei share average turned negative on Friday, while the yen firmed, after the Bank of Japan (BOJ) kept interest rates steady as expected, but in a split decision, with two of the nine board members voting in favour of a hike.",
            "pubDate": "2025-09-19T09:42:03.520213"
        },
        {
            "title": "European shares head for quiet end to event-packed week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-head-for-quiet-end-to-event-packed-week/articleshow/123993905.cms",
            "description": "European shares were muted on Friday and were set to end an event-filled week marginally lower, which included crucial central bank decisions, especially from the U.S. Federal Reserve.",
            "pubDate": "2025-09-19T09:42:03.520324"
        },
        {
            "title": "Gainers & Losers: Adani Power, Urban Company and Paytm among 6 major movers on Friday.",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-adani-power-urban-company-and-paytm-among-6-major-movers-on-friday-/slideshow/123997174.cms",
            "description": "",
            "pubDate": "2025-09-19T11:23:57.735982"
        },
        {
            "title": "Can GST cuts, low food inflation and IT relief create a triple tailwind for households? Here’s what Crisil’s DK Joshi has to say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-gst-cuts-low-food-inflation-and-it-relief-create-a-triple-tailwind-for-households-heres-what-crisils-dk-joshi-has-to-say/articleshow/123996849.cms",
            "description": "GST rationalization in India is set to boost consumption, particularly for middle- and lower-middle-income households. Cuts in one-third of household spending, including autos, processed foods, and durables, coincide with low inflation and income tax relief. Festive season sales may accelerate pass-through, supporting FY26 consumption-led growth despite short-term fiscal impact.",
            "pubDate": "2025-09-19T11:23:57.736116"
        },
        {
            "title": "Rs 1 lakh question: iPhone 17 now or mutual fund for future? Vijay Kedia decodes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-1-lakh-question-iphone-17-now-or-mutual-fund-for-future-vijay-kedia-decodes/articleshow/123996519.cms",
            "description": "As Apple’s iPhone 17 sparks long queues and pre-orders, Vijay Kedia urges buyers to rethink spending Rs 1 lakh on a phone versus investing it for wealth creation and future gains.",
            "pubDate": "2025-09-19T11:23:57.736223"
        },
        {
            "title": "Market Wrap: Sensex drops 387 pts, Nifty 50 slips below 25,400 as 3-day rally halts on profit-taking",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-drops-387-pts-nifty-50-slips-below-25400-as-3-day-rally-halts-on-profit-taking/articleshow/123996369.cms",
            "description": "Indian equities retreated on Friday, with the Sensex and Nifty snapping a three-day winning streak that had been buoyed by hopes of U.S. Federal Reserve rate cuts and progress in trade talks between New Delhi and Washington.",
            "pubDate": "2025-09-19T11:23:57.736332"
        },
        {
            "title": "Gold price target of $6,600 is now reasonable, says Jefferies’ Chris Wood. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-price-target-of-6600-is-now-reasonable-says-jefferies-chris-wood-heres-why/articleshow/123995840.cms",
            "description": "Jefferies’ Chris Wood says $6,600 per ounce is a fair gold price, aligning with historical income-adjusted peaks. He maintains a bullish stance, urging gold as a core portfolio allocation despite Fed-driven market volatility.",
            "pubDate": "2025-09-19T11:23:57.736438"
        },
        {
            "title": "What’s next for market?  Harsha Upadhyaya on GST upside, US-India trade talks & Nifty earnings growth outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/whats-next-for-market-harsha-upadhyaya-on-gst-upside-us-india-trade-talks-nifty-earnings-growth-outlook/articleshow/123995753.cms",
            "description": "Harsha Upadhyaya of Kotak AMC sees GST’s structural benefits driving earnings growth, with Nifty EPS likely to rise 14% by FY27. He expects India-US trade resolution to revive FII inflows and continues to prefer domestic sectors, with selective bets on chemicals, consumption and financials.",
            "pubDate": "2025-09-19T11:23:57.736540"
        },
        {
            "title": "Urban Company shares continue dream run post-listing, soar 81% from issue price in 3 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-continue-dream-run-post-listing-soar-81-from-issue-price-in-3-days/articleshow/123995631.cms",
            "description": "Urban Company shares soared nearly 10%, taking total gains to over 81% in just three sessions post-listing. Analysts remain bullish, citing its market leadership, strong brand recall, and long-term growth prospects in the tech-driven home services segment across India and abroad.",
            "pubDate": "2025-09-19T11:23:57.736655"
        },
        {
            "title": "Retail Frenzy: 5 stocks soar up to 80% in less than 3 months, do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-hits-misses-apollo-micro-systems-up-79-reliance-power-down-32-in-3-months/slideshow/123995529.cms",
            "description": "Retail investors play a crucial role in shaping the Indian stock market, and their impact is especially visible within the vast BSE universe. Among companies valued at over Rs 2,000 crore, around 83 firms stand out for having exceptionally high retail participation, with individual investors holding more than 25% of the stake. For context, retail here refers to resident individuals with a nominal shareholding of up to Rs 2 lakh. As of the June 2025 quarter, Bajaj Hindusthan Sugar topped the list with retail investors owning a hefty 47.15% of the company, closely followed by South Indian Bank at 46.52%. Yet, despite such confidence, both stocks delivered negative returns post-June—falling about 14% and 4% respectively.The September quarter (July to present) has revealed an uncomfortable truth: most of these retail-heavy stocks are leaving small investors in the red. While the enthusiasm of high retail ownership suggests strong conviction, the returns so far have been largely disappointing. To get a clearer picture, we dug deeper into the performance trends. From the beginning of July to now, a breakdown of the top 5 gainers and top 5 losers among these 83 retail-heavy stocks, we uncover where small investors’ collective bets have paid off—and where they’ve turned sour. (Data Source: ACE Equity)",
            "pubDate": "2025-09-19T11:23:57.736753"
        },
        {
            "title": "Sebi's tweak on capital gains simplifies securities transfer from nominee to legal heir. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-tweak-on-capital-gains-simplifies-securities-transfer-from-nominee-to-legal-heir-check-details/articleshow/124000619.cms",
            "description": "Sebi has simplified the process of transferring securities from nominees to legal heirs by introducing a standard reason code ‘TLH’. Effective January 1, 2026, this ensures exemption clarity under Section 47 of the Income Tax Act.",
            "pubDate": "2025-09-19T14:54:31.535742"
        },
        {
            "title": "US stocks tick higher after rally, FedEx gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-after-rally-fedex-gains/articleshow/124000094.cms",
            "description": "Wall Street is set to conclude a record-breaking week. The S&P 500 is up, aiming for its ninth winning week. The Dow and Nasdaq also hit new highs. Stocks are rallying on hopes of Federal Reserve interest rate cuts. FedEx's strong results are helping. Lennar's revenue miss caused a stock drop.",
            "pubDate": "2025-09-19T14:54:31.535861"
        },
        {
            "title": "Adani Power, Ashok Leyland and 5 other stocks hit 52-week highs and rallied up to 18% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-ashok-leyland-and-5-other-stocks-hit-52-week-highs-and-rallied-up-to-18-in-a-month/slideshow/123998444.cms",
            "description": "On Friday, the benchmark Sensex dropped by nearly 387 points, closing at 82,626. Despite the broader market decline, seven stocks from the BSE 200 index hit their 52-week highs, marking their highest levels in the past year. These breakouts are often viewed by traders and investors as bullish signals, indicating strong upward momentum and the possibility of further gains.",
            "pubDate": "2025-09-19T14:54:31.535966"
        },
        {
            "title": "Sebi allows more charitable entities to raise funds via Social Stock Exchange",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-allows-more-charitable-entities-to-raise-funds-via-social-stock-exchange/articleshow/123999783.cms",
            "description": "Markets regulator Sebi on Friday permitted more charitable entities to raise funds through the Social Stock Exchange (SSE), in a bid to broaden access to the platform.",
            "pubDate": "2025-09-19T14:54:31.536065"
        },
        {
            "title": "Vodafone Idea among 7 midcap stocks with high EV to Market cap ratios",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-among-7-midcap-stocks-with-high-ev-to-market-cap-ratios/slideshow/123997713.cms",
            "description": "A high EV-to-MCAP ratio suggests that a company carries significant debt or liabilities relative to its market value, indicating increased financial risk. Among NSE midcap stocks, the top seven companies have a high enterprise value compared to their market capitalization, according to StockEdge's valuation scan data.This may also imply that the company has limited cash reserves or a disproportionately high enterprise value relative to its equity, which could impact investor confidence and the company’s market valuation. Enterprise Value (EV) represents the total value of a company, including its market capitalization and debt, minus cash. It reflects the theoretical cost of acquiring the entire business.",
            "pubDate": "2025-09-19T14:54:31.536163"
        }
    ]
}