{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-26T21:26:36.865846",
    "items": [
        {
            "title": "South Korean shares set to snap 4-week rally on US tariff woes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-set-to-snap-4-week-rally-on-us-tariff-woes/articleshow/124141191.cms",
            "description": "South Korean shares experienced a significant slump on Friday, poised for their first weekly loss in five weeks, influenced by uncertainties surrounding trade negotiations with the U.S. and new tariffs imposed by President Trump. The Korean won weakened to its lowest level in over four months, while the benchmark bond yield increased.",
            "pubDate": "2025-09-26T02:39:42.589782"
        },
        {
            "title": "Negative Breakout: These 9 stocks close cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-9-stocks-close-cross-below-their-200-dmas/slideshow/124141166.cms",
            "description": "In the Nifty500 pack, 9 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on September 25, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders to determine a particular stock's overall trend. Take a look:",
            "pubDate": "2025-09-26T02:39:42.589911"
        },
        {
            "title": "Wall Street indexes finish lower, data raises uncertainty for rate-cut outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-finish-lower-data-raises-uncertainty-for-rate-cut-outlook/articleshow/124140853.cms",
            "description": "United States stock market saw a moderate dip. This happened because economic data created confusion about possible interest rate cuts by the Federal Reserve. Jobless claims decreased, but the economy grew faster than expected. Chicago Fed President expressed worry about cutting rates too quickly. Investors are now awaiting the Personal Consumption Expenditures price index.",
            "pubDate": "2025-09-26T02:39:42.590042"
        },
        {
            "title": "Technical breakout: Suprajit Engineering set for a fresh rally, says SMC Global",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-breakout-suprajit-engineering-set-for-a-fresh-rally-says-smc-global/videoshow/124120420.cms",
            "description": "“After spending weeks stuck in a tight range, Suprajit Engineering stock has finally broken above the consolidation phase. Traders can buy for a target of Rs 555 in the next 5-7 weeks,” Shitij Gandhi, Senior Technical Analyst, SMC Global Securities, said",
            "pubDate": "2025-09-26T02:39:42.590162"
        },
        {
            "title": "Asian stocks drop after Wall Street rally stalls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-drop-after-wall-street-rally-stalls/articleshow/124139480.cms",
            "description": "Asian stocks declined amid concerns over high Wall Street valuations, triggered by strong US economic data and mixed signals from Federal Reserve officials regarding potential rate cuts. The dollar strengthened, while the yen weakened. Investors are now closely watching the upcoming inflation report, which will influence the Fed's future policy decisions, adding to market uncertainty.",
            "pubDate": "2025-09-26T02:39:42.590262"
        },
        {
            "title": "Polycab India promoters sell shares worth Rs 1,739 crore in block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/polycab-india-promoters-sell-rs-1739-crore-worth-shares-in-block-deal/articleshow/124139191.cms",
            "description": "Promoters, including Nikhil Jaisinghani and Anil Jaisinghani, divested ₹1,739 crore worth of Polycab India shares through a block deal on the NSE, selling 23.32 lakh shares at ₹7,458 each. This sale reduced their collective stake from 48.7% to approximately 47.1%. Prominent buyers included JP Morgan Fund, Morgan Stanley Asia Singapore, and Kotak Mahindra Life.",
            "pubDate": "2025-09-26T02:39:42.590363"
        },
        {
            "title": "GIFT Nifty down 55 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124125306.cms",
            "description": "Indian stock markets saw a fifth day of losses. Nifty dipped below 25,000. Foreign fund outflows and US visa concerns impacted sentiment. Analysts foresee continued market pressure. They are watching global cues and India-US trade talks. India VIX rose, indicating market fear. Rupee settled slightly higher due to suspected RBI action. FIIs increased their net short positions.",
            "pubDate": "2025-09-26T02:39:42.590456"
        },
        {
            "title": "Stocks in news: Infosys, TCS, RIL, NTPC, BHEL, Maruti Suzuki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-tcs-ril-ntpc-bhel-maruti-suzuki/articleshow/124125200.cms",
            "description": "Indian markets faced pressure, extending losses amid persistent underperformance in key sectors and FII outflows. Reliance Consumer Products and Coca-Cola bottlers pledged ₹65,000 crore to boost food processing. NTPC will commence operations at its Nokh Solar Project, while ABB India invests ₹140 crore in its LV motors facility.",
            "pubDate": "2025-09-26T02:39:42.590553"
        },
        {
            "title": "Capital market payments via UPI down 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capital-market-payments-via-upi-down-22/articleshow/124138900.cms",
            "description": "UPI transactions for capital market investments experienced a 22% year-on-year decline in volume from June to August, totaling ₹1.51 lakh crore. This drop occurred as investors became cautious ahead of the new UPI payment framework aimed at curbing fraud, set to launch on October 1. The new system introduces a fund-blocking mechanism similar to ASBA.",
            "pubDate": "2025-09-26T02:39:42.590644"
        },
        {
            "title": "Could SEBI's potential clampdown on weekly contracts disrupt India's derivatives market?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/could-sebis-potential-clampdown-on-weekly-contracts-disrupt-indias-derivatives-market/articleshow/124138696.cms",
            "description": "Weekly derivatives contracts in India are under scrutiny. Securities and Exchange Board of India is considering potential curbs. This follows concerns about speculation by individual traders. Restrictions could impact market liquidity and trading volumes. Exchanges and brokers may face challenges. Market participants worry about higher hedging costs. The regulator aims to address systemic risk in the derivatives segment.",
            "pubDate": "2025-09-26T02:39:42.590741"
        },
        {
            "title": "Maruti Suzuki becomes world’s 8th most valuable carmaker, surpasses Ford, GM and Volkswagen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-becomes-worlds-8th-most-valuable-carmaker-surpasses-ford-gm-and-volkswagen/articleshow/124138296.cms",
            "description": "Maruti Suzuki India has ascended to become the world's eighth most valuable automaker, surpassing giants like Ford and General Motors. Fuelled by positive investor sentiment following tax reforms and a revamped GST regime, Maruti's market capitalization has soared to nearly $57.6 billion. The company's stock has rallied significantly, outperforming the Nifty Auto index, with foreign investors increasing their exposure.",
            "pubDate": "2025-09-26T02:39:42.590833"
        },
        {
            "title": "ET poll: Economists predict RBI to hold policy rates steady amid economic uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-poll-economists-predict-rbi-to-hold-policy-rates-steady-amid-economic-uncertainty/articleshow/124139314.cms",
            "description": "Economists anticipate the Reserve Bank of India (RBI) to maintain policy rates next week, despite potential for cuts, due to uncertainties from US tariffs and GST impacts. While some advocate for proactive rate cuts given low inflation, the majority prefers retaining options, awaiting clearer signs of economic slowdown and assessing the effects of recent GST reductions on inflation and growth.",
            "pubDate": "2025-09-26T02:39:42.590924"
        },
        {
            "title": "Stock Radar: Suprajit Engineering breaks out from an inverse Head & Shoulder pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-suprajit-engineering-breaks-out-from-an-inverse-head-shoulder-pattern-time-to-buy/articleshow/124113470.cms",
            "description": "Suprajit Engineering Ltd. has broken out from an inverse Head & Shoulder pattern, signaling a potential upward trend. Experts suggest short-term traders consider buying the stock, targeting Rs 560 within 1-2 months. The stock's recent rally, coupled with its position above key moving averages, reinforces the bullish outlook.",
            "pubDate": "2025-09-26T02:39:42.591038"
        },
        {
            "title": "NBFCs grab a bigger personal loan share amid bank caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfcs-grab-a-bigger-personal-loan-share-amid-bank-caution/articleshow/124138274.cms",
            "description": "Non-bank lenders are increasing their hold on the personal loan market. Data shows NBFCs' share in new personal loans has risen significantly. This growth is driven by fintech companies. Meanwhile, banks' share has decreased. The personal loan market is now over fifteen lakh crore rupees. NBFCs are more flexible, attracting borrowers banks might overlook.",
            "pubDate": "2025-09-26T02:39:42.591139"
        },
        {
            "title": "Digital payment norms revised, two-factor nod mandatory",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/digital-payment-norms-revised-two-factor-nod-mandatory/articleshow/124138670.cms",
            "description": "The Reserve Bank of India has announced new guidelines for digital payment security. Two-factor authentication will become mandatory for all transactions. Banks can now use biometrics and other methods for verification. Small-value transactions are exempt from strict authentication. These rules aim to boost security and will be effective from April 1, 2026.",
            "pubDate": "2025-09-26T02:39:42.591230"
        },
        {
            "title": "Credit card issuances soar to seven-month high in August",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-card-issuances-soar-to-seven-month-high-in-august/articleshow/124138641.cms",
            "description": "Credit card issuances in India reached a seven-month high in August, driven by lenders like HDFC Bank and Axis Bank preparing for increased festive season demand. Nearly 700,000 new cards were issued, bringing the total active cards to 112.3 million.",
            "pubDate": "2025-09-26T02:39:42.591329"
        },
        {
            "title": "Siddhi Cotspin IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siddhi-cotspin-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/124143256.cms",
            "description": "Siddhi Cotspin is set to debut on the market on September 26. The company's Rs 70 crore IPO saw moderate demand. The IPO was subscribed 4.2 times overall. Qualified institutional buyers drove demand. Siddhi Cotspin manufactures and sells cotton yarns. The company has reported steady growth. Revenue rose 25% to Rs 725 crore in FY25.",
            "pubDate": "2025-09-26T03:43:22.337253"
        },
        {
            "title": "Saatvik Green Energy shares to list today. GMP points to mild debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saatvik-green-energy-shares-to-list-today-gmp-points-to-mild-debut/articleshow/124143202.cms",
            "description": "Saatvik Green Energy will debut on the market on September 26. The company raised Rs 900 crore through its IPO. The IPO was subscribed 6.93 times overall. The company plans to use the funds to prepay borrowings. It will also fund a subsidiary’s debt repayment. Saatvik aims to set up a new solar PV module manufacturing facility in Odisha.",
            "pubDate": "2025-09-26T03:43:22.337366"
        },
        {
            "title": "TCS, TVS Motor among 7 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-tvs-motor-among-7-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124142870.cms",
            "description": "There was a notable surge in futures open interest for seven stocks in the NSE F&O pack on September 25, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-26T03:43:22.337464"
        },
        {
            "title": "GK Energy shares to debut today. GMP hints at modest listing gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gk-energy-shares-to-debut-today-gmp-hints-at-modest-listing-gains/articleshow/124143154.cms",
            "description": "GK Energy is set to list on the stock exchanges on September 26, following a highly successful IPO that was oversubscribed 93.6 times. The IPO price was Rs 153, and the grey market premium suggests a listing price of around Rs 165, potentially offering investors an 8% gain.",
            "pubDate": "2025-09-26T03:43:22.337557"
        },
        {
            "title": "Newgen Software, Gujarat Pipavav Port among 8 stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/newgen-software-gujarat-pipavav-port-among-8-stocks-showing-bullish-rsi-upswing/slideshow/124142528.cms",
            "description": "Eight stocks from the Nifty500 pack that gained over 1.5% were highlighted in the RSI Trending Up scan on September 25, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-26T03:43:22.337649"
        },
        {
            "title": "India’s options crackdown gives 150-year-old bourse surprise win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-options-crackdown-gives-150-year-old-bourse-surprise-win/articleshow/124141894.cms",
            "description": "BSE is gaining ground in India’s derivatives market after SEBI’s crackdown reshaped weekly expiries. By shifting its contracts to Thursdays, the 150-year-old exchange has captured traders’ attention, challenging NSE’s long-held dominance. While liquidity hurdles remain, BSE’s rising turnover on expiry days signals a shift in market dynamics that could redefine competition in derivatives trading.",
            "pubDate": "2025-09-26T03:43:22.337749"
        },
        {
            "title": "Nazara Technologies shares in focus on trading ex-bonus, ex-split today. Check how 10 shares turn into 40",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-technologies-shares-in-focus-on-trading-ex-bonus-ex-split-today-check-how-10-shares-turn-into-40/articleshow/124141777.cms",
            "description": "Nazara Technologies' shares are trading ex-bonus and ex-split today, following the announcement of a 1:1 bonus issue and a 1:2 stock split. This corporate action will effectively turn 10 shares into 40 for existing investors. While the company previously issued a bonus in June 2022, this marks its first-ever stock split.",
            "pubDate": "2025-09-26T03:43:22.337850"
        },
        {
            "title": "IT Stocks in focus as Accenture reports 7% revenue growth in Q4. Infosys, Wipro ADRs tumble up to 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-it-stocks-in-focus-as-accenture-reports-7-revenue-growth-in-q4-infosys-wipro-adrs-tumble-up-to-3/articleshow/124141287.cms",
            "description": "Accenture's Q4 results revealed $17.6 billion in revenue, a 7% year-on-year increase, with full-year revenue reaching $69.7 billion. Despite a dip in Accenture's shares, Indian IT ADRs, specifically Infosys and Wipro, saw modest gains in after-hours trading. The company also announced an $865 million restructuring program to focus on digital and AI services, reflecting industry-wide cost optimization efforts.",
            "pubDate": "2025-09-26T03:43:22.337965"
        },
        {
            "title": "Explained: Why hasn't GST2.0 triggered a rally in Tata Motors' stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-hasnt-gst2-0-triggered-a-rally-in-tata-motors-stock/articleshow/124144640.cms",
            "description": "Tata Motors' stock has remained stagnant despite GST benefits boosting domestic auto companies. With Jaguar Land Rover (JLR) contributing 70% to revenue, Tata Motors gains less from Indian tax cuts. A recent cyberattack disrupting JLR's production and potential £2 billion financial impact further dampen investor sentiment.",
            "pubDate": "2025-09-26T04:27:33.735899"
        },
        {
            "title": "Rs 3 lakh crore lollapalooza to hit India: What this means for consumer demand and stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-3-lakh-crore-lollapalooza-to-hit-india-what-this-means-for-consumer-demand-and-stocks/articleshow/124144283.cms",
            "description": "India is set for a consumption boost of Rs 3 lakh crore. GST and income tax cuts, along with RBI's rate reductions, will fuel this surge. Experts predict a 'Lollapalooza effect' impacting consumption-linked sectors. Rural demand is recovering, and urban areas will benefit from tax cuts. Discretionary spending is expected to rise.",
            "pubDate": "2025-09-26T04:27:33.736027"
        },
        {
            "title": "South Korea to open currency market for 24-hour trading",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korea-to-open-currency-market-for-24-hour-trading/slideshow/124144336.cms",
            "description": "President Lee Jae Myung announced that South Korea plans to introduce around-the-clock currency trading, making it easier for foreign investors to access the market. He highlighted that the current trading system has strict time limits, which the government now plans to remove almost entirely. (Source: Reuters)",
            "pubDate": "2025-09-26T04:27:33.736126"
        },
        {
            "title": "Tata Motors, Mahindra & Mahindra, and other auto stocks in focus as Trump’s slaps 25% tariff on heavy-duty trucks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-mahindra-mahindra-and-other-auto-stocks-in-focus-as-trumps-slaps-25-tariff-on-heavy-duty-trucks/articleshow/124144190.cms",
            "description": "Donald Trump has announced sweeping tariffs effective October 1, including 25% on heavy-duty trucks, 100% on branded drugs, 50% on kitchen cabinets and vanities, and 30% on upholstered furniture — a move that has stoked global trade tensions.",
            "pubDate": "2025-09-26T04:27:33.736225"
        },
        {
            "title": "Ather Energy shares in focus as rare earth magnet crunch delays Rs 26 crore incentive claim",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ather-energy-shares-in-focus-as-rare-earth-magnet-crunch-delays-rs-26-crore-incentive-claim/articleshow/124144057.cms",
            "description": "Ather Energy shares: The EV maker said supply chain disruptions from China’s rare earth export curbs forced temporary changes in its motor production. The company has sought a waiver from the Ministry of Heavy Industries on domestic magnet fitment rules and delayed demand incentive claims worth ₹26.25 crore.",
            "pubDate": "2025-09-26T04:27:33.736320"
        },
        {
            "title": "Sensex drops over 400 pts, Nifty below 24,800 as D-St extends losses to day 6 after Trump slaps fresh tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-over-200-pts-nifty-below-24850-as-d-st-extends-losses-to-day-6-after-trump-slaps-fresh-tariffs/articleshow/124143755.cms",
            "description": "Indian stock markets declined on Friday, extending losses for the sixth consecutive session, primarily driven by a sell-off in pharmaceutical stocks. This downturn followed U.S. President Donald Trump's announcement of new tariffs, including a 100% levy on branded drugs and 25% on heavy-duty trucks, impacting market sentiment and broader indices.",
            "pubDate": "2025-09-26T04:27:33.736420"
        },
        {
            "title": "Tata Investment Corp and 5 other stocks closed below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corp-and-5-other-stocks-closed-below-vwap/slideshow/124143891.cms",
            "description": "On September 25, the closing prices of six Nifty500 stocks fell over 2.5% and ended more than 1% below their VWAP (Volume Weighted Average Price). A close below VWAP often indicates a potential bearish trend, according to technical scan data from StockEdge.com.VWAP represents the average price at which a stock was traded during the day, weighted by volume. When the closing price is below this level, it may suggest increased selling pressure.",
            "pubDate": "2025-09-26T04:27:33.736516"
        },
        {
            "title": "Waaree Energies shares drop 5% after US customs probe into alleged tariff evasion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-in-focus-amid-us-customs-probe-into-alleged-tariff-evasion/articleshow/124143639.cms",
            "description": "Waaree Energies' shares declined following a U.S. customs investigation into potential tariff evasion. The probe centers on allegations that the company mislabeled Chinese-made solar cells and panels as Indian products to avoid U.S. duties. This investigation, prompted by concerns from the American Alliance for Solar Manufacturing Trade Committee, could significantly impact Indian solar exports.",
            "pubDate": "2025-09-26T04:27:33.736615"
        },
        {
            "title": "Vodafone Idea shares slide 4% ahead of Supreme Court hearing on Rs 9,450 crore AGR dues plea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-ahead-of-supreme-court-hearing-on-rs-9450-crore-agr-dues/articleshow/124143492.cms",
            "description": "Vodafone Idea share price: The Supreme Court will hear Vodafone Idea’s plea against the Department of Telecommunications’ demand for Rs 9,450 crore in additional AGR dues. The telecom operator has challenged the claim, citing duplication and inconsistencies, while the outcome could significantly impact its funding plans and financial strategy.",
            "pubDate": "2025-09-26T04:27:33.736725"
        },
        {
            "title": "Sun Pharma, Cipla & other pharma stocks crack up to 5% as Trump announces 100% tariff on imported patented drugs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-sun-pharma-biocon-other-pharma-stocks-in-focus-after-trump-announces-100-tariff-on-imported-patented-drugs-from-october-1/articleshow/124143393.cms",
            "description": "Indian pharmaceutical stocks declined following Donald Trump's tariff announcement. Sun Pharma experienced the most significant drop. Other companies like Biocon and Zydus Lifesciences also saw declines. The tariff targets branded pharmaceuticals imported into the United States. Companies can avoid the tariff by establishing manufacturing plants in the U.S.",
            "pubDate": "2025-09-26T04:27:33.736821"
        },
        {
            "title": "Why stock market is down today? Sensex tumbles over 750 pts, Nifty below 24,650; key reasons behind the slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-sensex-is-down-today-sensex-tumbles-over-750-pts-nifty-below-24650-key-reasons-behind-the-slump/articleshow/124152914.cms",
            "description": "Stock Market Crash: Indian stock markets faced a sharp decline on Friday. This occurred after US President Donald Trump declared significant tariffs. These tariffs, reaching up to 100%, will affect branded and patented drug imports. The new tariffs are scheduled to take effect from October 1, 2025. The Sensex and Nifty50 both experienced considerable drops following this announcement.",
            "pubDate": "2025-09-26T08:51:57.247259"
        },
        {
            "title": "7 Largecap Laggards: Big Drops in CY25, but up to 40% Upside Potential Ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-largecap-laggards-big-drops-in-cy25-but-up-to-40-upside-potential-ahead/slideshow/124153354.cms",
            "description": "So far in calendar year 2025 (CY25), the broader market has continued its upward march, with the benchmark Sensex gaining 3.9% and the BSE Largecap Index slightly outperforming it with a 4.5% rise. Many large-cap stocks have performed well, but a few have lagged behind. Market watchers note that such dips often attract investors looking to accumulate fundamentally strong large-caps at discounted levels. In fact, most of these stocks have a \"Buy\" rating according to Trendlyne Forecaster data.As many as seven large-cap stocks have dropped over 25% since the start of the year, clearly showing that not all large-caps are performing well. Among the biggest losers, Trent has fallen 34%, while Varun Beverages is down 30%. These significant drops have occurred even as overall investor sentiment remains largely positive. (Data source: ACE Equity)",
            "pubDate": "2025-09-26T08:51:57.247387"
        },
        {
            "title": "Japan's Topix posts record-high close despite US tariffs on pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-topix-posts-record-high-close-despite-us-tariffs-on-pharma/articleshow/124152050.cms",
            "description": "Japan's broad Topix index closed at an all-time high on Friday, despite pressure from pharmaceutical shares following new tariffs on the sector from the White House overnight.",
            "pubDate": "2025-09-26T08:51:57.247515"
        },
        {
            "title": "JM Financial initiates coverage on 3 plastic pipes stock, predicts up to 27% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-initiates-coverage-on-3-plastic-pipes-stock-predicts-up-to-27-upside/articleshow/124151713.cms",
            "description": "JM Financial initiates coverage on four Indian plastic piping companies—Supreme Industries, Astral, Prince Pipes, and Plastic Pipes—projecting up to 25% upside. Sector recovery is supported by stabilising PVC prices, infrastructure push, real estate growth, and regulatory support. Selective investment opportunities arise amid margin expansion and structural upcycle.",
            "pubDate": "2025-09-26T08:51:57.247620"
        },
        {
            "title": "Hyundai Motor India shares can fall over 26%, says InCred Equities. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-shares-can-fall-over-26-says-incred-equities-heres-why/articleshow/124150565.cms",
            "description": "InCred Equities projects a potential 26% drop in Hyundai Motor India's shares, setting a target price of Rs 2,023. They believe limited GST impact and high reliance on exports and SUVs will hinder revenue growth, unlike Maruti Suzuki and Tata Motors. Despite strong recent margins, new plant overheads may pressure future EBITDA.",
            "pubDate": "2025-09-26T08:51:57.247728"
        },
        {
            "title": "HAL shares up 15% in 2025, analysts see potential rally up to Rs 6,220. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-shares-up-15-in-2025-analysts-see-potential-rally-up-to-rs-6220-heres-why/articleshow/124149156.cms",
            "description": "Hindustan Aeronautics Limited shares are soaring. This follows a major contract from the Defence Ministry for 97 Light Combat Aircraft Mk1A. Analysts predict further stock gains. The deal is worth over Rs 62,370 crore. Deliveries are expected to start in FY28. The aircraft will have over 64% indigenous content. This project will boost India's domestic aerospace sector and create jobs.",
            "pubDate": "2025-09-26T08:51:57.247830"
        },
        {
            "title": "Explained: What Dr Trump’s 100% bitter tariff pill means for India’s $10 billion pharma export machine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-dr-trumps-100-bitter-tariff-pill-means-for-indias-10-billion-pharma-export-machine/articleshow/124148742.cms",
            "description": "The US has imposed a 100% tariff on branded and patented pharmaceuticals, targeting imports from India’s $10 billion export industry. While generics remain unaffected for now, uncertainty persists around complex drugs. Sun Pharma, Dr. Reddy’s, Cipla, and Zydus face the highest risks due to significant US revenue exposure.",
            "pubDate": "2025-09-26T08:51:57.247925"
        },
        {
            "title": "GK Energy shares rally 7% after D-Street debut, IPO investors see 15% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gk-energy-shares-rally-7-after-d-street-debut-ipo-investors-see-15-gains/articleshow/124147706.cms",
            "description": "GK Energy shares climbed 6.6% to ₹175.95, taking total IPO listing gains to nearly 15% after debuting at an 11.8% premium.",
            "pubDate": "2025-09-26T08:51:57.248020"
        },
        {
            "title": "Japanese stocks on track for 11th straight year of seasonal September outflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japanese-stocks-on-track-for-11th-straight-year-of-seasonal-september-outflows/articleshow/124147425.cms",
            "description": "Foreign investors continued their selling spree of Japanese equities for the second consecutive week, totaling 1.75 trillion yen, driven by profit-taking after a record-setting rally. This trend contributes to a potential 11th straight year of net outflows in September. Meanwhile, Japanese investors increased their holdings of foreign long-term bonds, marking the fourth consecutive week of net purchases.",
            "pubDate": "2025-09-26T08:51:57.248112"
        },
        {
            "title": "Tata Motors shares gain 2%, snap two-day fall as JLR commences phased restart after cyberattack",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-gain-2-snap-two-day-fall-as-jlr-commences-phased-restart-after-cyberattack/articleshow/124146817.cms",
            "description": "Tata Motors shares rose on September 26 as Jaguar Land Rover (JLR) began a phased restart after a cyberattack halted production for nearly a month. Operations, IT systems, and logistics are being restored, aiming to clear backlogs and stabilise revenue impact.",
            "pubDate": "2025-09-26T08:51:57.248208"
        },
        {
            "title": "Epack Prefab Technologies IPO Day 3: Issue susbcribed 77% so far;check GMP, and other key details. Should you bid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/epack-prefab-technologies-ipo-day-3-check-gmp-and-subscription-status-should-you-invest/articleshow/124146664.cms",
            "description": "Epack Prefab Technologies’ IPO is trading at a grey market premium of roughly 6.8% (₹14), indicating moderate investor interest. The shares are likely to list near ₹218 based on the current GMP.",
            "pubDate": "2025-09-26T08:51:57.248299"
        },
        {
            "title": "Risk of US Government shutdown rises as Congress hits funding impasse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/risk-of-us-government-shutdown-rises-as-congress-hits-funding-impasse/slideshow/124146836.cms",
            "description": "The risk of a partial US government shutdown is increasing as congressional Democrats and Republicans remain at an impasse over federal funding. A shutdown could begin next week, potentially affecting financial markets and delaying key economic data releases. (Source: Reuters)",
            "pubDate": "2025-09-26T08:51:57.248392"
        },
        {
            "title": "Sun Pharma, Cipla or Dr Reddy's: Which pharma major is most vulnerable to Trump's 100% tariff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-cipla-or-dr-reddys-which-pharma-major-is-most-vulnerable-to-trumps-100-tariff/articleshow/124146390.cms",
            "description": "President Trump's imposition of 100% tariffs on branded drugs has shaken Indian pharma companies, impacting stocks like Sun Pharma, Cipla, and Dr. Reddy's. With significant US revenue exposure, firms face potential earnings hits, especially if tariffs expand to complex generics. Companies with US manufacturing plants may find some mitigation, but uncertainty looms over the future of Indian pharma exports.",
            "pubDate": "2025-09-26T08:51:57.248502"
        },
        {
            "title": "Nazara Technologies stock price down 75%? Here’s what’s really happening",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-technologies-stock-price-down-75-heres-whats-really-happening/articleshow/124145951.cms",
            "description": "Nazara Technologies shares appeared to fall 75% on September 26 due to a simultaneous 1:2 stock split and 1:1 bonus issue. Each share effectively converted into four, lowering the price proportionally while keeping overall investment value unchanged and boosting liquidity for investors.",
            "pubDate": "2025-09-26T08:51:57.248606"
        },
        {
            "title": "Japan's Topix hits record high despite US tariffs on pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-topix-hits-record-high-despite-us-tariffs-on-pharma/articleshow/124145336.cms",
            "description": "Japan's Topix index reached a record high on Friday. This happened despite pharmaceutical shares facing pressure. The Nikkei index, however, declined after a record close. Real estate performed well, while pharma struggled. Chip-related shares also saw a sharp drop. Masayuki Kichikawa remains optimistic about Japanese equities. He cited healthy economic fundamentals and reasonable valuations.",
            "pubDate": "2025-09-26T08:51:57.248705"
        },
        {
            "title": "Swiggy shares down 21% so far in 2025. Will Rapido stake sale fuel Instamart’s next leg?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-down-21-so-far-in-2025-will-rapido-stake-sale-fuel-instamarts-next-leg/articleshow/124145149.cms",
            "description": "Swiggy is selling its stake in Rapido. This move aims to free up funds for Instamart. Instamart is Swiggy's quick-commerce business. The sale is worth Rs 2,400 crore. Prosus and Westbridge Capital are the buyers. Analysts have mixed opinions on the sale. Some believe it's a temporary fix. Others see it as a positive step.",
            "pubDate": "2025-09-26T08:51:57.248799"
        },
        {
            "title": "1 year since Nifty’s all-time high: Index falls just 5% but portfolios bleed with double-digit losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/1-year-since-niftys-all-time-high-index-falls-just-5-but-portfolios-bleed-with-double-digit-losses/articleshow/124153959.cms",
            "description": "One year after Nifty 50’s record high of 26,277, the index has slipped just 5.5%. However, SAMCO Securities warns retail investors faced steeper pain, with most mid, small, and microcap stocks significantly underperforming.",
            "pubDate": "2025-09-26T09:23:36.721768"
        },
        {
            "title": "CarTrade shares more than double in 1 year. Elara sees 36% upside, here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cartrade-shares-more-than-double-in-1-year-elara-sees-36-upside-heres-why/articleshow/124154445.cms",
            "description": "CarTrade Tech surged nearly 8% to Rs 2,648.25, extending a 146% rally, after Elara Capital’s ‘buy’ call with a Rs 3,590 target and Norway’s wealth fund stake boosted investor sentiment.",
            "pubDate": "2025-09-26T09:44:30.836619"
        },
        {
            "title": "Raymond Lifestyle shares slide 4% as Income Tax Department conducts survey at offices and units",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/raymond-lifestyle-shares-slide-4-as-income-tax-department-conducts-survey-at-offices-and-units/articleshow/124154873.cms",
            "description": "Raymond Lifestyle shares fell 4.2% to Rs 1,200.55 after the Income Tax Department conducted surveys at its offices and plants, triggering investor caution despite recent short-term gains.",
            "pubDate": "2025-09-26T09:52:11.396427"
        },
        {
            "title": "Auto ancillary sector: Re-rating on the cards? Some transformed better than others; 25 auto ancillary stocks, 8 probably better placed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-ancillary-sector-re-rating-on-the-cards-some-transformed-better-than-others-25-auto-ancillary-stocks-8-probably-better-placed/articleshow/124154393.cms",
            "description": "Close to four years back, every investor was looking for stocks that had anything to do with EVs. The reason: EV was supposed to be the next big transformation and wealth creators tend to emerge out of transformation. Today, the number of EVs in absolute terms has gone up, and every auto maker has a presence in the sector with one or the other product. But the hype around EVs has settled somewhat. Now, in this four-year period, some auto ancillaries have been able to enter the EV ecosystem. Some less, some more. But as transformation gains ground, there are companies which might get their shine back.",
            "pubDate": "2025-09-26T09:52:11.396549"
        },
        {
            "title": "Gurmeet Chadha's stock market mantra is stay in the game. Sees these 2 things to reverse trends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gurmeet-chadhas-stock-market-mantra-is-stay-in-the-game-sees-these-2-things-to-reverse-trends/articleshow/124155195.cms",
            "description": "Gurmeet Chadha urges investors to stay invested despite FII-led correction, citing double-digit earnings growth and reforms as trend reversals. Markets fell amid heavy foreign selling and U.S. tariff announcements.",
            "pubDate": "2025-09-26T10:24:38.577215"
        },
        {
            "title": "US stocks open higher after inflation data calms rate-cut jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-after-inflation-data-calms-rate-cut-jitters/articleshow/124160978.cms",
            "description": "Wall Street indexes opened higher on Friday. Inflation data met expectations, easing concerns about delayed interest rate cuts by the Federal Reserve. The Dow Jones Industrial Average, S&P 500, and Nasdaq Composite all recorded gains. This positive market reaction followed the latest economic figures. Investors welcomed the news, reflecting a sense of relief regarding future monetary policy.",
            "pubDate": "2025-09-26T13:45:40.953187"
        },
        {
            "title": "NCDEX shareholders approve Rs 770 crore preferential issue to fund equity, equity derivatives launch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncdex-shareholders-approve-rs-770-crore-preferential-issue-to-fund-equity-equity-derivatives-launch/articleshow/124160022.cms",
            "description": "NCDEX secured shareholder approval to issue Rs 770 crore worth of shares, marking a key step toward launching equity and derivatives segments by 2026, strengthening its multi-asset exchange vision.",
            "pubDate": "2025-09-26T13:45:40.953306"
        },
        {
            "title": "Valuation check: 8 largecap stocks trade above Industry PE benchmarks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuation-check-8-largecap-stocks-trade-above-industry-pe-benchmarks/slideshow/124159692.cms",
            "description": "When a company's Price-to-Earnings (P/E) ratio is above the industry average, it typically indicates that the stock is valued higher than its peers in the same industry. In the NSE Large-cap pack, we highlight the top seven stocks, whose trailing twelve-month P/E ratio is higher than the industry P/E, based on the StockEdge valuation scan.This could mean investors are willing to pay a premium for the stock, often due to expectations of higher growth, strong performance, or confidence in the company’s future prospects. However, it can also suggest that the stock might be overvalued or that the market is overestimating its potential compared to other companies in the industry.",
            "pubDate": "2025-09-26T13:45:40.953412"
        },
        {
            "title": "FIIs set to return to India after 12-month absence, says HSBC; picks 11 stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-set-to-return-to-india-after-12-month-absence-says-hsbc-picks-11-stocks/articleshow/124159847.cms",
            "description": "HSBC upgraded India to ‘Overweight’ and expects FIIs to return after 12 months, citing attractive valuations, policy support, resilient flows, and easing global conditions. It named 11 top stock picks across sectors.",
            "pubDate": "2025-09-26T13:45:40.953511"
        },
        {
            "title": "Ambani vs Adani: India’s desert war for ‘green gold’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambani-vs-adani-indias-desert-war-for-green-gold/videoshow/124158930.cms",
            "description": "Two of India’s richest men, Mukesh Ambani and Gautam Adani, are locked in a high-stakes battle for India’s green energy future. Who will dominate the desert land, billion-dollar investments, and the renewable power race? Watch to see this epic corporate clash unfold.",
            "pubDate": "2025-09-26T13:45:40.953638"
        },
        {
            "title": "Indo Thai Securities, Netweb Tech, 8 other stocks hit 52-week highs and rally up to 60% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indo-thai-securities-netweb-tech-8-other-stocks-hit-52-week-highs-and-rally-up-to-60-in-a-month/slideshow/124159333.cms",
            "description": "On Friday, the benchmark Sensex fell by around 733 points, ending the session at 80,426. Despite the broader market downturn, 10 stocks from the BSE Smallcap index hit their 52-week highs — the highest levels recorded in the past year. These breakouts are often seen by traders and investors as bullish indicators, suggesting strong upward momentum and the potential for continued gains.",
            "pubDate": "2025-09-26T13:45:40.953737"
        },
        {
            "title": "Kidnapping of promoter's son, ransom and Rs 200-crore wipeout! SEBI unmasks Seacoast Shippings’ ultimate shock twist",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kidnapping-of-promoters-son-ransom-and-rs-200-crore-wipeout-sebi-unmasks-seacoast-shippings-ultimate-shock-twist/articleshow/124157985.cms",
            "description": "Seacoast Shipping misused Rs 48 crore rights issue funds to pay ransom, while fabricating revenues and assets to mislead investors. SEBI’s probe revealed fake trades, sham governance, and massive equity dilution. Shares crashed to Rs 1.48, erasing Rs 200 crore. SEBI banned directors and ordered restitution.",
            "pubDate": "2025-09-26T13:45:40.953852"
        },
        {
            "title": "Madhu Kela family hiked stake in this smallcap stock that has rallied 80% in 2025. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/madhu-kela-family-hiked-stake-in-this-smallcap-stock-that-has-rallied-80-in-2025-do-you-own/articleshow/124157614.cms",
            "description": "GRM Overseas attracted marquee investors like Nikhil Vora and the Madhu Kela family, who raised stakes after promoters sold 2.65% for Rs 58 crore. The company is pivoting toward packaged foods through its fast-growing subsidiary, GRM Foodkraft. Shares surged 80% in 2025, supported by strong revenues, rice exports, and expansion initiatives.",
            "pubDate": "2025-09-26T13:45:40.953946"
        },
        {
            "title": "​Stock Radar: Hindustan Zinc breaks out from 6-week consolidation range on weekly charts; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-hindustan-zinc-breaks-out-from-6-week-consolidation-range-on-weekly-charts-check-target-stop-loss/articleshow/124146306.cms",
            "description": "Hindustan Zinc Ltd. recently broke out of a 6-week consolidation, signaling potential for an upward trend. Experts suggest that short-term traders could consider buying the stock, targeting Rs 505 in the coming weeks. Technical indicators, including MACD crossover and trading above key moving averages, support a bullish outlook for the stock.",
            "pubDate": "2025-09-26T13:45:40.954036"
        },
        {
            "title": "Titan Company’s weak Q2 provides good entry point, says Nomura after initiating coverage with Buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-companys-weak-q2-provides-good-entry-point-says-nomura-after-initiating-coverage-with-buy-rating/articleshow/124157398.cms",
            "description": "Nomura initiates Buy on Titan Company with a target of Rs 4,275, citing growth from rising affluent consumers, wedding jewellery, and global expansion. Despite near-term headwinds from high gold prices and lab-grown diamond competition, the brokerage expects 18–19% CAGRs in sales and EBIT over FY26–28.",
            "pubDate": "2025-09-26T13:45:40.954133"
        },
        {
            "title": "Gainers & Losers: OFSS, Waaree among 6 stocks in the spotlight on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-ofss-waaree-among-6-stocks-in-the-spotlight-on-friday/slideshow/124157049.cms",
            "description": "",
            "pubDate": "2025-09-26T13:45:40.954220"
        },
        {
            "title": "Parijat Industries files DRHP with SEBI for Rs 160 crore IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/parijat-industries-files-drhp-with-sebi-for-rs-160-crore-ipo/articleshow/124156914.cms",
            "description": "Parijat Industries has filed DRHP with SEBI to raise Rs 160 crore via IPO. Proceeds will primarily repay borrowings, while strong domestic and global presence supports its agrochemical growth story.",
            "pubDate": "2025-09-26T13:45:40.954309"
        },
        {
            "title": "Daimler Truck, Traton shares fall on Trump's truck tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/daimler-truck-traton-shares-fall-on-trumps-truck-tariffs/articleshow/124162249.cms",
            "description": "Shares in Germany's Daimler Truck and Traton fell on Friday after U.S. President Donald Trump announced tariffs on heavy-duty trucks, adding to trade tensions that have hit the automotive sector hard.",
            "pubDate": "2025-09-26T14:55:13.191383"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 19% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-19-in-1-year/articleshow/124165834.cms",
            "description": "Five straight sessions of decline in the stock market is all it took to end the festive season bullishness. Now, this is where you need to be different – and vigilant. Indian markets do not fall in isolation. The fact is that global markets are confused. Look at US bond yields; they have moved higher. In such a time, you cannot expect the Indian market to outperform. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-09-26T21:26:34.074943"
        },
        {
            "title": "Big US pharma stocks rise as Street reacts to Trump's tariff on drugs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-us-pharma-stocks-rise-as-street-reacts-to-trumps-tariff-on-drugs/articleshow/124164693.cms",
            "description": "President Trump announced new 100 percent import taxes on branded pharmaceuticals. These tariffs begin October 1. Companies building US manufacturing plants will be exempt. Major drugmakers like Merck and Lilly saw slight share increases. Analysts predict minimal impact on large firms. Smaller drugmakers might face vulnerability. Generic medicines remain unaffected by this new policy.",
            "pubDate": "2025-09-26T21:26:34.075072"
        },
        {
            "title": "VIP Industries' promoter entities sell stake worth Rs 343 crore via bulk deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vip-industries-promoter-entities-sell-stake-worth-rs-343-crore-via-bulk-deals/articleshow/124164530.cms",
            "description": "VIP Industries' promoter entities sold stakes worth Rs 343 crore via bulk deals at a 9% discount, with Multiples Private Equity and Samvibhag Securities among the buyers. The company's shares closed down 4.01% on Friday, continuing a 28% decline over the past year amidst a recent net loss.",
            "pubDate": "2025-09-26T21:26:34.075278"
        },
        {
            "title": "Crisil upgrades Muthoot Microfin outlook to positive, reaffirms A+ rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/crisil-upgrades-muthoot-microfin-outlook-to-positive-reaffirms-a-rating/articleshow/124163909.cms",
            "description": "Crisil Ratings revised Muthoot Microfin’s outlook to ‘positive’ from ‘stable’, reaffirming ‘A+’ rating. Despite asset quality stress, strong collections, adequate provisioning, and continued parent support underpin the microfinance lender’s stability and resilience in FY26.",
            "pubDate": "2025-09-26T21:26:34.075374"
        }
    ]
}