{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-23T13:48:07.600641",
    "items": [
        {
            "title": "Adani Power, Netweb Technologies among 5 stocks showing Bullish Candlestick Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-netweb-technologies-among-5-stocks-showing-bullish-candlestick-pattern/slideshow/124060375.cms",
            "description": "On September 22, five stocks with a market cap above Rs 10,000 crore featured in NSE’s bullish scanner for the “White Marubozu” candlestick pattern, according to technical scan data from stockedge.com.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for a given period and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and a small or no lower shadow, it signals strong buying pressure throughout the session. Traders view it as an indication that buyers were in control from open to close and often use it to guide future trading decisions.",
            "pubDate": "2025-09-23T03:42:02.772951"
        },
        {
            "title": "Birla Corporation shares in focus after subsidiary declared preferred bidder for mining block in Telangana",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/birla-corporation-shares-in-focus-after-subsidiary-declared-preferred-bidder-for-mining-block-in-telangana/articleshow/124060331.cms",
            "description": "Birla Corporation's stock is set to gain attention as its subsidiary, RCCPL Private Ltd, secured the Preferred Bidder status for a Limestone and Manganese block in Telangana. Awarded by the Government of Telangana, the block spans 3.34 sq km in Adilabad district.",
            "pubDate": "2025-09-23T03:42:02.773075"
        },
        {
            "title": "KEC International shares in focus after securing Rs 3,243 crore orders in international T&D Segment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kec-international-shares-in-focus-after-securing-rs-3243-crore-orders-in-international-td-segment/articleshow/124060008.cms",
            "description": "KEC International share price: KEC International has secured new international Transmission and Distribution (T&D) orders worth Rs 3,243 crore, including 400 kV transmission line projects in the UAE and tower, hardware, and pole supplies in the Americas. The company said this is its largest-ever EPC order in the international T&D segment.",
            "pubDate": "2025-09-23T03:42:02.773233"
        },
        {
            "title": "Vedanta shares in focus as Govt denies extension for Cambay Basin oil block",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-as-govt-denies-extension-for-cambay-basin-oil-block/articleshow/124059795.cms",
            "description": "Vedanta share price: The government has rejected Vedanta’s request to extend the production sharing contract (PSC) for the CB-OS/2 Cambay Basin oil and gas block, reverting control to ONGC. The decision impacts the Lakshmi and Gauri fields, which produce 3,400 barrels of oil daily, and marks a setback for Vedanta’s energy business.",
            "pubDate": "2025-09-23T03:42:02.773342"
        },
        {
            "title": "TCS shares in focus as board to review Q2 results, second interim dividend on October 9",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-as-board-to-review-q2-results-second-interim-dividend-on-october-9/articleshow/124059567.cms",
            "description": "Tata Consultancy Services (TCS) will convene a Board of Directors meeting on October 9, 2025, to approve the financial results for the second quarter and half-year ending September 30, 2025. The board will consider a second interim dividend for shareholders, with October 15 set as the record date.",
            "pubDate": "2025-09-23T03:42:02.773449"
        },
        {
            "title": "Oil India among 5 stocks showing bullish RSI signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-india-among-5-stocks-showing-bullish-rsi-signals/slideshow/124059514.cms",
            "description": "Five stocks from the NSE midcap segment were highlighted in the RSI Trending Up scan on September 22, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-23T03:42:02.773600"
        },
        {
            "title": "Positive Breakout: These 9 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-close-cross-above-their-200-dmas/slideshow/124059427.cms",
            "description": "A total of 14 NSE-listed stocks with a market capitalisation of over Rs 1,000 crore closed above their 200-day moving average (DMA) on September 22, according to data from StockEdge.com's technical scan. Of these, we have highlighted the top 10 stocks that posted gains of more than 2%. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered an overall uptrend. Take a look:",
            "pubDate": "2025-09-23T03:42:02.773714"
        },
        {
            "title": "Euro Pratik Sales shares to debut on Tuesday. GMP signals modest listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/euro-pratik-sales-shares-to-debut-on-tuesday-gmp-signals-modest-listing/articleshow/124059385.cms",
            "description": "Euro Pratik Sales will list on the stock exchanges on Tuesday. This follows the completion of its Rs 451.39 crore IPO last week. The IPO saw moderate subscription rates across various investor categories. The company markets decorative wall panels and laminates. It reported revenue of Rs 291.5 crore and a net profit of Rs 76.4 crore for FY25.",
            "pubDate": "2025-09-23T03:42:02.773811"
        },
        {
            "title": "Wall Street indexes post record closing highs again, with Nvidia, tech shares higher",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-post-record-closing-highs-again-with-nvidia-tech-shares-higher/articleshow/124059213.cms",
            "description": "U.S. stock indexes achieved record closing highs for the third consecutive session, propelled by technology sector gains. Nvidia's investment in OpenAI and Apple's surge due to iPhone 17 demand fueled market optimism. Despite some Federal Reserve officials expressing caution about further rate cuts, the S&P 500 continues its strong performance this year.",
            "pubDate": "2025-09-23T03:42:02.773905"
        },
        {
            "title": "Strong volumes, RSI momentum signal bullish ride for Ashok Leyland, says Rajesh Palviya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-volumes-rsi-momentum-signal-bullish-ride-for-ashok-leyland-says-rajesh-palviya/videoshow/124052615.cms",
            "description": "“Ashok Leyland stock has recently broken out of a long-standing resistance zone, confirming a rounding bottom pattern on the weekly chart. Traders can buy the stock for a target of Rs 165-175 in the next few weeks,” Rajesh Palviya, SVP - Research, Axis Securities, said",
            "pubDate": "2025-09-23T03:42:02.774007"
        },
        {
            "title": "Asian markets edge higher after Wall Street rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-markets-edge-higher-after-wall-street-rally/articleshow/124058982.cms",
            "description": "Asian stocks experienced a slight increase following Wall Street's record-breaking rally, fueled by renewed optimism in big tech, particularly Nvidia's investment in OpenAI. While US equities have risen for three weeks, buoyed by the anticipated Federal Reserve rate cut, investors are advised to remain cautiously optimistic.",
            "pubDate": "2025-09-23T03:42:02.774097"
        },
        {
            "title": "IT stocks plummet as Trump increases H-1B visa costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-plummet-as-trump-increases-h-1b-visa-costs/articleshow/124058943.cms",
            "description": "Information technology stocks faced a downturn on Monday, pulling market indices down due to President Trump's decision to increase H-1B visa costs. The Nifty IT index experienced a significant drop, with major companies like Infosys, TCS, and Wipro declining. This move heightened concerns about the sector's growth prospects, already facing uncertainty from AI and a demand slowdown in the US.",
            "pubDate": "2025-09-23T03:42:02.774221"
        },
        {
            "title": "Kirti Doshi acquires close to 21% in Emkay Global via Antique Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kirti-doshi-acquires-close-to-21-in-emkay-global-via-antique-securities/articleshow/124058897.cms",
            "description": "Dalal Street veteran Kirti Doshi, through Antique Securities, has acquired a significant 21% stake in Emkay Global Financial Services. This investment, along with contributions from promoters Krishna Kumar Karwa and Prakash Kacholia, totals ₹227.5 crore via a warrant issue. The move has boosted investor confidence, with Emkay Global's stock price surging 20% to ₹315.2.",
            "pubDate": "2025-09-23T03:42:02.774321"
        },
        {
            "title": "Stocks in news: TCS, Vedanta, IndusInd Bank, Brigade Enterprises, Kfin Technologies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-vedanta-indusind-bank-brigade-enterprises-kfin-technologies/articleshow/124054721.cms",
            "description": "Markets experienced volatility, closing lower, with analysts predicting consolidation between 25,500 and 25,000. TCS will announce Q2 earnings and consider a dividend on October 9. Vedanta's contract extension for a key oil and gas block was rejected, while IndusInd Bank appointed a new CFO. Brigade Enterprises secured a residential project, and KEC International won new orders.",
            "pubDate": "2025-09-23T03:42:02.774415"
        },
        {
            "title": "GIFT Nifty down 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124054817.cms",
            "description": "Indian equities experienced a downturn on Monday, influenced by concerns surrounding President Trump's H-1B visa fee changes. Investors are closely watching Piyush Goyal's upcoming US visit for trade negotiations amid existing tariff tensions. Technically, the Nifty's 25,000 level is crucial, while the rupee weakened against the dollar.",
            "pubDate": "2025-09-23T03:42:02.774504"
        },
        {
            "title": "H-1B fallout likely to be modest, add largecap IT on weakness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-trumps-100000-h-1b-levy-impact-indian-it-earnings/articleshow/124058717.cms",
            "description": "Brokerages anticipate a limited impact on Indian IT companies' earnings due to Donald Trump's $100,000 H-1B levy. They expect increased offshoring and localization to largely compensate for the levy. Nomura, Kotak, and BofA suggest accumulating large-cap stocks like Infosys and TCS during market dips, viewing the disruption as temporary.",
            "pubDate": "2025-09-23T03:42:02.774594"
        },
        {
            "title": "Time Technoplast shares in focus as 1:1 bonus issue kicks in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-technoplast-shares-in-focus-as-11-bonus-issue-kicks-in/articleshow/124060482.cms",
            "description": "Shares of Time Technoplast Ltd will trade ex-bonus on Tuesday, September 23, following its 1:1 bonus issue. Investors on record as of Monday’s close will get one additional share for every share held, while new buyers from Tuesday onward won’t be eligible. The move, the company’s first-ever bonus issue, aims to enhance liquidity and attract wider retail participation.",
            "pubDate": "2025-09-23T03:52:10.976282"
        },
        {
            "title": "KFin Technologies, RBL Bank among 6 F&O stocks that saw a surge in Futures Open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kfin-technologies-rbl-bank-among-6-fo-stocks-that-saw-a-surge-in-futures-open-interest/slideshow/124060453.cms",
            "description": "As of September 22, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 11% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-23T03:52:10.976399"
        },
        {
            "title": "India’s generic pharma faces tariff uncertainty but retains edge in US market: JPMorgan analyst",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-generic-pharma-faces-tariff-uncertainty-but-retains-edge-in-us-market-jpmorgan-analyst/articleshow/124060898.cms",
            "description": "India’s generic pharma faces tariff uncertainty but retains edge in US market: JPMorgan analyst",
            "pubDate": "2025-09-23T04:26:27.279777"
        },
        {
            "title": "SME market intact? In a punishing year, 5 IPOs doubled investors’ wealth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sme-market-intact-in-a-punishing-year-5-ipos-doubled-investors-wealth/slideshow/124060983.cms",
            "description": "The SME IPO market in 2025 has largely been muted, with most issues struggling to hold on to their listing gains. Yet, a handful of small and mid-sized companies have delivered multibagger returns, defying the broader trend. Here are five SME listings that have more than doubled investor wealth this year.",
            "pubDate": "2025-09-23T04:26:27.279884"
        },
        {
            "title": "For risk-takers with slightly long-term perspective: 5 mid-cap stocks from different sectors with upside potential of over 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-risk-takers-with-slightly-long-term-perspective-5-mid-cap-stocks-from-different-sectors-with-upside-potential-of-over-19/articleshow/124060668.cms",
            "description": "As the market witnesses a recovery, many investors will be faced with a dilemma: What should they do with the stocks in their portfolio? Especially those that are quoting at a cut and don’t see a recovery when the Nifty and Sensex move up? And if they are to put fresh money in the market, should this stock be considered? There are no simple answers here. Just remember what matters to the street: Valuations, quality of businesses, and individual managements. So, if you have the ability to digest volatility (it will keep recurring), you can be bullish. But be selective and cautious when picking stocks; and stagger your buying.",
            "pubDate": "2025-09-23T04:26:27.279976"
        },
        {
            "title": "YES Bank shares rally 10% in 1 month as Sumitomo ups stake. Analysts eye Rs 25, is it a buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-rally-10-in-1-month-as-sumitomo-ups-stake-analysts-eye-rs-25-is-it-a-buy/articleshow/124060771.cms",
            "description": "YES Bank shares are up following Sumitomo Mitsui Banking Corporation's increased stake. This move boosts investor confidence in the bank's recovery. Analysts predict the stock could reach Rs 25 soon. YES Bank is planning to enter wealth management and expand branches. The bank reported strong Q1 FY26 results, raising hopes for a credit rating upgrade.",
            "pubDate": "2025-09-23T04:26:27.280070"
        },
        {
            "title": "Gold, silver or stocks? Top 5 fund managers on how to invest Rs 10 lakh in the market now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-silver-or-stocks-top-5-fund-managers-on-how-to-invest-rs-10-lakh-in-the-market-now/articleshow/124060737.cms",
            "description": "Amidst geopolitical tensions and market volatility, Indian fund managers are advising investors to diversify their portfolios. They suggest allocating a significant portion to equities, with a focus on consumption-led sectors and financials. Additionally, they recommend including gold and silver as hedges against uncertainty and currency depreciation, while fixed income offers favorable risk-reward due to high real rates.",
            "pubDate": "2025-09-23T04:26:27.280166"
        },
        {
            "title": "Sensex falls over 200 pts, Nifty below 25,150 as H-1B visa fee hike concerns cloud investor sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-100-pts-nifty-tops-25230-as-us-trade-hopes-offset-visa-concerns/articleshow/124060544.cms",
            "description": "Indian stock markets initially rose, driven by optimism surrounding trade talks. However, the Sensex and Nifty soon declined. The auto sector performed well, led by companies like Ashok Leyland and Maruti Suzuki. IT stocks saw a slight recovery after a previous day's fall due to H-1B visa fee concerns. Investor sentiment was boosted by U.S.-India talks at the U.N.",
            "pubDate": "2025-09-23T04:26:27.280275"
        },
        {
            "title": "Good old days back for Adani stocks? Jefferies reveals up to 17% upside in 5 counters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/good-old-days-back-for-adani-stocks-jefferies-reveals-up-to-17-upside-in-5-counters/slideshow/124060660.cms",
            "description": "Adani Group stocks have staged a strong comeback, adding over Rs 1 lakh crore in market value in just two sessions after Sebi gave billionaire Gautam Adani a clean chit in the Hindenburg case. Despite this rally, Jefferies targets suggest more gains ahead.",
            "pubDate": "2025-09-23T04:26:27.280366"
        },
        {
            "title": "RVNL shares in focus after emerging lowest bidder for Rs 145 crore Southern Railway project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-after-emerging-lowest-bidder-for-rs-145-crore-southern-railway-project/articleshow/124060512.cms",
            "description": "Shares of Rail Vikas Nigam Ltd (RVNL) will be in focus on Tuesday, September 23, after the company emerged as the lowest bidder for a Southern Railway project. The Rs 145.35 crore order covers the design, supply, erection, testing, and commissioning of traction substations, SCADA systems, and related equipment for the Jolarpettai–Salem section, to be completed within 540 days.",
            "pubDate": "2025-09-23T04:26:27.280460"
        },
        {
            "title": "Fed urged to stay cautious amid persistent inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-urged-to-stay-cautious-amid-persistent-inflation/slideshow/124061266.cms",
            "description": "Cleveland Fed President Beth Hammack stressed that the Federal Reserve needs to be very cautious in easing restrictive monetary policy. With inflation still above the central bank’s 2% target and showing persistence, she warned that removing restrictions too soon could risk overheating the economy. (Source: Reuters)",
            "pubDate": "2025-09-23T04:49:40.594970"
        },
        {
            "title": "Earnings cuts ease, Motilal Oswal sees brighter outlook for Nifty stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-cuts-ease-motilal-oswal-sees-brighter-outlook-for-nifty-stocks/articleshow/124072398.cms",
            "description": "Motilal Oswal expects Indian equities to stabilize as earnings cuts slow. Supportive policies, favorable valuations, and sector-specific improvements could drive a market uptrend and recovery in FY26–27.",
            "pubDate": "2025-09-23T13:47:48.315768"
        },
        {
            "title": "US stocks muted at open with Powell in spotlight for rate outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-muted-at-open-with-powell-in-spotlight-for-rate-outlook/articleshow/124072316.cms",
            "description": "Wall Street's indexes displayed a muted opening on Tuesday, pausing after a recent surge driven by technology stocks. Investors are currently awaiting insights from Federal Reserve Chair Jerome Powell regarding the economic outlook. The Dow Jones Industrial Average experienced a slight dip, while the S&P 500 and Nasdaq Composite also saw marginal declines at the opening bell.",
            "pubDate": "2025-09-23T13:47:48.315889"
        },
        {
            "title": "9 stocks with rising promoter stakes signal strong insider confidence",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-stocks-with-rising-promoter-stakes-signal-strong-insider-confidence/slideshow/124071807.cms",
            "description": "Promoters have boosted their shareholding in the company in the most recent quarter compared to the previous one. We spotlight nine leading stocks from the Nifty500 universe where promoter stakes rose by more than 100 basis points in the June 2025 quarter versus March 2025.This trend reflects growing confidence and increased commitment from the promoters towards their businesses. A rise in promoter stake often suggests positive outlooks for the company’s future and can be a bullish sign for investors.",
            "pubDate": "2025-09-23T13:47:48.315994"
        },
        {
            "title": "Sebi approves Bain Capital open offer for Manappuram Finance stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-approves-bain-capital-open-offer-for-manappuram-finance-stake/articleshow/124071559.cms",
            "description": "Sebi has approved Bain Capital’s 26% open offer for Manappuram Finance after its 18.6% stake purchase. RBI clearance is pending, with the tendering process to begin post-approval.",
            "pubDate": "2025-09-23T13:47:48.316097"
        },
        {
            "title": "GST cuts to fuel Rs 96,000-crore consumer spending; QSRs, Nykaa, fashion set to gain: Karan Taurani",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-cuts-to-fuel-rs-96000-crore-consumer-spending-qsrs-nykaa-fashion-set-to-gain-karan-taurani/articleshow/124071506.cms",
            "description": "The recent Goods and Services Tax (GST) cuts are expected to inject fresh momentum into India’s consumption-driven economy, potentially expanding consumer wallets by nearly Rs 96,000 crore through the multiplier effect, according to Karan Taurani, EVP, Elara Securities.",
            "pubDate": "2025-09-23T13:47:48.316198"
        },
        {
            "title": "Nomura sees good times ahead for Indian steel players, picks JSW Steel and Jindal Steel as top bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-sees-good-times-ahead-for-indian-steel-players-picks-jsw-steel-and-jindal-steel-as-top-bets/articleshow/124071390.cms",
            "description": "Nomura reaffirmed its bullish stance on India’s steel sector, citing strong domestic demand, Chinese production cuts, and potential Beijing stimulus. It raised targets for JSW Steel (Rs 1,300) and Jindal Steel (Rs 1,150), forecasting capacity-driven growth and EBITDA expansion. Import curbs, firm demand, and improving pricing dynamics support sector outlook.",
            "pubDate": "2025-09-23T13:47:48.316295"
        },
        {
            "title": "Vodafone Idea shares end 4% up ahead of Supreme Court's Friday hearing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-end-4-up-ahead-of-supreme-courts-friday-hearing/articleshow/124070930.cms",
            "description": "Vodafone Idea shares surged 7% intraday amid investor hopes for Supreme Court relief on Rs 9,450 crore AGR dues. The apex court will hear the plea on September 26, a crucial decision impacting funding plans, debt resolution, and operational continuity for the debt-laden telecom operator seeking clarity on dues reconciliation.",
            "pubDate": "2025-09-23T13:47:48.316391"
        },
        {
            "title": "Who is Shrikant Badve, the newest addition to India’s billionaire club?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/who-is-shrikant-badve-the-newest-addition-to-indias-billionaire-club/articleshow/124070767.cms",
            "description": "Shrikant Badve, founder of Belrise Industries, has joined India’s billionaire club as shares hit record highs. Holding a 59.56% stake worth Rs 8,623 crore, his company’s strong growth prospects and analyst upgrades fuel investor optimism.",
            "pubDate": "2025-09-23T13:47:48.316489"
        },
        {
            "title": "Maruti Suzuki, Ashok Leyland, and two other auto stocks hit 52-week highs; rally up to 18% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-ashok-leyland-and-two-other-auto-stocks-hit-52-week-highs-rally-up-to-18-in-a-month/slideshow/124070360.cms",
            "description": "On Tuesday, the benchmark Sensex dipped by approximately 58 points, closing at 82,102. Despite the slight market decline, four stocks from the BSE Auto index reached their 52-week highs, marking their highest levels in the past year. Such breakouts are typically viewed by traders and investors as bullish signals, indicating strong upward momentum and the potential for sustained gains.",
            "pubDate": "2025-09-23T13:47:48.316581"
        },
        {
            "title": "Gainers & Losers: Refex Industries, Adani Total Gas among 6 top movers on Tuesday. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-refex-industries-adani-total-gas-among-6-top-movers-on-tuesday-heres-why/slideshow/124069595.cms",
            "description": "",
            "pubDate": "2025-09-23T13:47:48.316673"
        },
        {
            "title": "Tata Motors shares fall nearly 2% from day’s high as JLR extends production delay for second time",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-fall-nearly-2-from-days-high-as-jlr-extends-production-delay-for-second-time/articleshow/124069159.cms",
            "description": "Tata Motors slipped after JLR extended its production halt till October 1 following a cyberattack. While festive sales boosted sentiment, uncertainty over recovery lingers, adding to the stock’s 30% yearly decline.",
            "pubDate": "2025-09-23T13:47:48.316782"
        },
        {
            "title": "Nifty holds 25,000, rally seen towards 25,500; Motherson Sumi, Aadhar Housing Finance among top picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-holds-25000-rally-seen-towards-25500-motherson-sumi-aadhar-housing-finance-among-top-picks/articleshow/124069084.cms",
            "description": "Nifty held above 25,000 despite recent volatility, with analysts calling the trend bullish. Strong sectoral participation, leadership from Bank Nifty, and midcap opportunities suggest dips should be bought, with upside potential toward 25,500 in the near term.",
            "pubDate": "2025-09-23T13:47:48.316875"
        },
        {
            "title": "Market Wrap: Nifty extends slide to Day 3, falls below 25,200, Sensex drops 57 points as U.S. visa worries weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-nifty-extends-slide-to-day-3-falls-below-25200-sensex-drops-57-points-as-u-s-visa-worries-weigh/articleshow/124068459.cms",
            "description": "Indian benchmark indices Sensex and Nifty ended lower on Tuesday, falling for a third consecutive session, with gains in auto makers on festive-season demand failing to offset broader losses fueled by worries over a steep increase in U.S. H-1B visa fees.",
            "pubDate": "2025-09-23T13:47:48.316966"
        },
        {
            "title": "Tata Investment Corp shares surge 12% to new 52-week high as board approves 1:10 stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corp-shares-surge-12-to-new-52-week-high-as-board-approves-110-stock-split/articleshow/124068297.cms",
            "description": "Shares of Tata Investment Corporation surged 11.7% in intraday trade today to hit a new 52-week high of Rs 8,131.50 on the BSE. The rally followed the company’s announcement of a 1:10 stock split aimed at improving liquidity and enhancing retail participation.",
            "pubDate": "2025-09-23T13:47:48.317059"
        },
        {
            "title": "H-1B, drug price noise won’t hurt Indian IT & pharma; festive cheer drives auto stocks:  Vikas Khemani",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/h-1b-drug-price-noise-wont-hurt-indian-it-pharma-festive-cheer-drives-auto-stocks-vikas-khemani/articleshow/124068230.cms",
            "description": "Vikas Khemani sees autos as key festive season winners, expects IT to weather H-1B visa changes with minimal margin impact, and remains bullish on pharma despite US drug pricing concerns. He views market consolidation as healthy, supported by strong macro fundamentals and GCC expansion.",
            "pubDate": "2025-09-23T13:47:48.317148"
        },
        {
            "title": "Midcap Mayhem: 11 midcap stocks in freefall, crack 40–50% from peaks. Is your portfolio hit?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcap-mayhem-11-midcap-stocks-in-freefall-crack-4050-from-peaks-is-your-portfolio-hit/slideshow/124068151.cms",
            "description": "Equity markets remain as unpredictable as ever, with sharp swings catching investors off guard. While the benchmark Sensex has dipped 4% and the BSE Midcap Index has fallen 6% from their 52-week highs, several midcap stocks have suffered significantly sharper corrections.Across the BSE Midcap space, nearly 50 stocks have plunged over 25% from their yearly peaks. Among them, 11 names stand out, having crashed 40–50% from their 52-week highs, marking some of the deepest corrections in the segment (Data Source: ACE Equity).",
            "pubDate": "2025-09-23T13:47:48.317238"
        }
    ]
}