{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-30T12:00:01.652547",
    "items": [
        {
            "title": "Q3 results today: Meesho, Nestle among 158 companies to report earnings on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-meesho-nestle-among-158-companies-to-report-earnings-on-friday/articleshow/127789023.cms",
            "description": "Nestle India's Q3 results are anticipated to show steady revenue growth. Strong domestic sales are expected to drive this performance. However, rising input costs may impact profitability. Analysts predict a modest year-on-year profit increase. The company's focus remains on volume expansion and innovation for long-term growth. Investors will monitor commentary on commodity prices.",
            "pubDate": "2026-01-30T02:03:42.898329"
        },
        {
            "title": "Vedanta sees better Q4 after solid Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-sees-better-q4-after-solid-q3/articleshow/127788546.cms",
            "description": "Vedanta's CFO Ajay Goel anticipates a \"significantly bigger and better\" March quarter performance, projecting full-year EBITDA exceeding $6 billion. The company reported an all-time high in revenue, profit, and EBITDA for the December quarter, with a 60% year-on-year net profit jump. Goel highlighted positive pricing trends and the historical strength of the fourth quarter in their industry.",
            "pubDate": "2026-01-30T02:03:42.898460"
        },
        {
            "title": "NTPC Green Energy Q3 Results: Net profit plunges 74% YoY to Rs 17.32 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ntpc-green-energy-q3-results-net-profit-plunges-74-yoy-to-rs-17-32-crore/articleshow/127792332.cms",
            "description": "NTPC Green Energy Ltd, or NGEL, saw its net profit drop significantly by 74 percent in the December quarter. This decline to Rs 17.32 crore was caused by a sharp rise in expenses. Despite this, the company's total income grew to Rs 684.22 crore. NGEL is NTPC's arm for clean energy projects.",
            "pubDate": "2026-01-30T06:02:14.986127"
        },
        {
            "title": "ACME Solar Holdings Q3 Results: Net profit rises to Rs 114 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/acme-solar-holdings-q3-results-net-profit-rises-to-rs-114-crore/articleshow/127792042.cms",
            "description": "ACME Solar Holdings Ltd reported a 1.5% rise in net profit to Rs 114 crore for the December quarter, driven by a significant 53.9% surge in total revenues to Rs 617 crore. The company also declared an interim dividend of Rs 0.20 per equity share and partially commissioned 72 MW of wind projects in Gujarat.",
            "pubDate": "2026-01-30T06:02:14.986254"
        },
        {
            "title": "Brookfield India REIT Q3 net operating income jumps 14% YoY to Rs 540 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/brookfield-india-reit-q3-net-operating-income-jumps-14-yoy-to-rs-540-crore/articleshow/127792722.cms",
            "description": "Brookfield India REIT reported a strong Q3, with net operating income rising 14% YoY to Rs 540.4 crore, driven by higher leasing and improved occupancy. Leasing hit 1.2 million sq ft with a 17% re-leasing spread, while committed occupancy reached 92%. The REIT also completed the Ecoworld acquisition, boosting portfolio scale.",
            "pubDate": "2026-01-30T08:20:07.733365"
        },
        {
            "title": "Strides Pharma Q3 Results: PAT rises over 2-fold at Rs 208.12 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/strides-pharma-q3-results-pat-rises-over-2-fold-at-rs-208-12-crore/articleshow/127795617.cms",
            "description": "Strides Pharma Science Ltd on Friday reported over two-fold rise in consolidated net profit at Rs 208.12 crore in the third quarter ended December 31, 2025 on the back of robust sales growth and one time income on sale of property.",
            "pubDate": "2026-01-30T08:59:50.767105"
        },
        {
            "title": "Nestle Q3 Results: Cons profit jumps 45% YoY to Rs 998 crore; Rs 7/share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-q3-results-cons-profit-jumps-45-yoy-to-rs-998-crore-rs-7/share-dividend-declared/articleshow/127795589.cms",
            "description": "Nestle India reported strong Q3FY26 results with net profit surging 45% YoY to Rs 998 crore and revenue rising 19% to Rs 5,667 crore. Sequential profit jumped 34%, while shares hit a 52-week high. Broad-based growth across e-commerce, organised trade, exports and OOH helped drive performance amid mixed commodity trends.",
            "pubDate": "2026-01-30T08:59:50.767237"
        },
        {
            "title": "Nestle India declares Rs 7 interim dividend with with Q3 results; Check record date, other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-india-declares-rs-7-interim-dividend-with-with-q3-results-check-record-date-other-details/articleshow/127796343.cms",
            "description": "Nestle India announced an interim dividend of Rs 7 per share after reporting a 45% jump in December-quarter net profit, driven by broad-based volume growth, revenues, strong category performance, and benefits from capacity investments, advertising push, and GST-led market recovery.",
            "pubDate": "2026-01-30T09:45:21.980754"
        },
        {
            "title": "Bajaj Auto Q3 Results: Profit jumps 19% YoY to Rs 2,503 crore, revenue too up 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q3-results-profit-jumps-19-yoy-to-rs-2503-crore-revenue-too-up-19/articleshow/127798951.cms",
            "description": "Bajaj Auto Q3 Results: Two-wheeler major Bajaj Auto on Friday reported 19% year-on-year (YoY) growth in its consolidated net profit at Rs 2,503 crore. Revenue from operations to rose 19% YoY to 15,220 crore, driven by record quarterly volumes and a richer mix.",
            "pubDate": "2026-01-30T12:00:00.521076"
        },
        {
            "title": "NALCO posts rise in quarterly profit on higher aluminium prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nalco-posts-rise-in-quarterly-profit-on-higher-aluminium-prices/articleshow/127797604.cms",
            "description": "India's National Aluminium Company (NALCO) reported a marginal increase ‍in third-quarter profit on Friday, ​helped by firm aluminium prices.",
            "pubDate": "2026-01-30T12:00:00.521187"
        }
    ]
}