{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-05T18:00:43.137794",
    "items": [
        {
            "title": "Wall St ends lower as bank CEOs warn of possible pullback, fueling tech bubble jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-ends-lower-as-bank-ceos-warn-of-possible-pullback-fueling-tech-bubble-jitters/articleshow/125099973.cms",
            "description": "Indian investors, take note: US stocks plunged Tuesday as banking titans warned of a potential market drawdown, fueled by stretched valuations and AI boom exuberance. Major indexes saw significant drops, with tech shares leading the decline. Concerns over high valuations and profit-taking are mounting, prompting a cautious outlook.",
            "pubDate": "2025-11-05T02:51:29.489304"
        },
        {
            "title": "ChrysCapital raises $2.2 billion in largest Indian PE fund",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chryscapital-raises-2-2-billion-in-largest-indian-pe-fund/articleshow/125099547.cms",
            "description": "ChrysCapital has secured a record $2.2 billion for its latest fund, ChrysCapital X. This marks a significant achievement for the Indian private equity firm. The fund saw strong participation from both global and domestic investors. ChrysCapital's strategy focuses on key sectors like consumer, healthcare, and technology. The firm has a proven track record of delivering substantial returns to its investors.",
            "pubDate": "2025-11-05T02:51:29.489429"
        },
        {
            "title": "Asian markets pull back as stretched valuation fears jolt Wall St",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-markets-pull-back-as-stretched-valuation-fears-jolt-wall-st/articleshow/125099515.cms",
            "description": "Asian markets are in a tailspin, echoing the dip witnessed on Wall Street as investor hesitation grows over inflated stock prices. This market tumble is echoing alerts from top financiers about looming corrections. The current buzz around generative AI is stirring memories of the dot-com bubble. Major Asian indices, particularly in Japan, are experiencing steep declines.",
            "pubDate": "2025-11-05T02:51:29.489557"
        },
        {
            "title": "Stock Market Holiday on Gurunanak Jayanti 2025: Are NSE, BSE open or closed today on November 5 for Gurpurab?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-on-gurunanak-jayanti-2025-are-nse-bse-open-or-closed-today-on-november-5-for-gurpurab/articleshow/125091989.cms",
            "description": "NSE Holidays 2025: Indian stock markets are shut today, November 5, 2025, for Guru Nanak Jayanti. Trading on NSE and BSE is suspended across all segments. This is the second market holiday in November. The festival commemorates the 556th birth anniversary of Guru Nanak Dev Ji. MCX trading is also suspended. Markets reopen tomorrow, November 6.",
            "pubDate": "2025-11-05T02:51:29.489660"
        },
        {
            "title": "Sebi to overhaul 30-yr-old stock broker rules ‘ASAP’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-overhaul-30-yr-old-stock-broker-rules-asap/articleshow/125099380.cms",
            "description": "The Securities and Exchange Board of India (Sebi) plans to update stock broker regulations by December 2025 to enhance risk management and data protection. This review follows a discussion paper on rationalizing existing rules, some of which are over 30 years old.",
            "pubDate": "2025-11-05T02:51:29.489761"
        },
        {
            "title": "Adani Enterprises to raise Rs 25,000 cr via rights issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-to-raise-rs-25000-cr-via-rights-issue/articleshow/125099271.cms",
            "description": "Adani Enterprises plans to raise up to ₹25,000 crore via a rights issue to fund debt repayment and capital expenditure, primarily in its airport business. The company reported an 84% year-on-year net profit increase to ₹3,199 crore for the September quarter, boosted by an exceptional gain from a stake sale in Adani Wilmar.",
            "pubDate": "2025-11-05T02:51:29.489860"
        },
        {
            "title": "Warren Buffett’s long goodbye: 3 years of selling, $382 billion in cash as clock ticks on his Berkshire tenure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffetts-long-goodbye-3-years-of-selling-382-billion-in-cash-as-clock-ticks-on-his-berkshire-tenure/articleshow/125103747.cms",
            "description": "Warren Buffett ends his six-decade tenure at Berkshire Hathaway as a cautious investor, selling more stocks and amassing a record Rs 382 billion cash pile. With Greg Abel set to take over, Buffett leaves behind a disciplined legacy marked by patience, prudence, and one final deal with Occidental Petroleum.",
            "pubDate": "2025-11-05T07:50:38.907884"
        },
        {
            "title": "Market Trading Guide: Buy Kalpataru Projects, Asahi India and 3 more smallcap stocks on Thursday for up to 10% potential returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-kalpataru-projects-asahi-india-and-3-more-smallcap-stocks-on-thursday-for-up-to-10-potential-returns/slideshow/125103543.cms",
            "description": "Nifty extended its losses on Tuesday after a Monday pause, as sharp declines in IT, auto, and metal stocks weighed on sentiment. It has moved towards the support zone at 25,525.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities, said that the index has found initial support near the 21EMA and the RSI indicates weak price momentum with a bearish crossover. “If the index falls below 25,590, the correction may extend towards 25,500–25,525. On the other hand, resistance is placed at 25,700, above which the index could regain strength,\" De said.Here are 5 stock recommendations for Thursday:",
            "pubDate": "2025-11-05T07:50:38.908026"
        },
        {
            "title": "Earnings outlook brightens: 5 Nifty stocks get upgrades from Motilal Oswal after Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-outlook-brightens-5-nifty-stocks-get-upgrades-from-motilal-oswal-after-q2-results/slideshow/125101691.cms",
            "description": "India’s corporate earnings season has brought a sense of cautious optimism to the markets. According to Motilal Oswal, Nifty earnings per share (EPS) estimates for FY26 and FY27 have been marginally upgraded, reflecting steady performance across key sectors despite a challenging global backdrop.",
            "pubDate": "2025-11-05T07:50:38.908130"
        },
        {
            "title": "Global chip selloff erases $500 billion in value as fears mount",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-chip-selloff-erases-500-billion-in-value-as-fears-mount/articleshow/125101486.cms",
            "description": "Global semiconductor stocks experienced a significant selloff, driven by concerns over inflated valuations for AI boom beneficiaries. Major Asian chipmakers, including Samsung Electronics and Taiwan Semiconductor Manufacturing Co., saw substantial declines. This pullback signals growing unease about the sector's earnings potential and high stock prices amid persistent interest rate concerns.",
            "pubDate": "2025-11-05T07:50:38.908225"
        },
        {
            "title": "Sunil Singhania’s Abakkus Portfolio: 9 Stocks soar up to 80% in FY26; 6 new buys in Q2 revealed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sunil-singhanias-abakkus-portfolio-9-stocks-soar-up-to-80-in-fy26-6-new-buys-in-q2-revealed/slideshow/125101712.cms",
            "description": "Investors keep a close watch on the portfolios of leading market participants on Dalal Street. In this regard, ETMarkets has analysed the investment holdings of veteran investor Sunil Singhania’s Abakkus Asset Manager, a prominent Indian investment firm. According to the latest data for the September 2025 quarter, Abakkus holds stakes in around 26 publicly listed stocks, with a total valuation of approximately Rs 2,757 crore as of 4 November. This list includes only those companies where the ace investor’s holding exceeds 1%, and may not represent his complete portfolio.A deeper analysis reveals that 9 of these 26 stocks have delivered over 25% returns in FY26 so far, with the best performers gaining up to 80%. On the flip side, Anup Engineering emerged as a notable underperformer, slipping 33%. Additionally, the portfolio features six newly added stocks this quarter. (Data Source: ACE Equity, Trendlyne).",
            "pubDate": "2025-11-05T07:50:38.908334"
        },
        {
            "title": "10 stocks Mukul Agrawal bought in September quarter amid Rs 7,700 crore portfolio reshuffle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-stocks-mukul-agrawal-bought-in-september-quarter-amid-rs-7700-crore-portfolio-reshuffle/slideshow/125101368.cms",
            "description": "Ace investor Mukul Mahavir Agrawal undertook a major reshuffle in the September 2025 quarter, adding 10 new stocks and raising stakes in five others. The portfolio overhaul, worth about Rs 400 crore, spans sectors such as consumer durables, healthcare, engineering, technology, renewable energy, and EV mobility. These new buys reflect his focus on diversification, conviction bets, and exposure to India’s growth stories across emerging and traditional industries.",
            "pubDate": "2025-11-05T07:50:38.908434"
        },
        {
            "title": "Dividend darlings disappoint as 5 of top 10 PSU yield plays fall in double digits up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-darlings-disappoint-as-5-of-top-10-psu-yield-plays-fall-in-double-digits-up-to-28/articleshow/125101122.cms",
            "description": "India's leading dividend-paying PSU stocks have disappointed investors. Many have seen substantial price drops over the past year, failing to match market gains. Despite high dividend yields, earnings challenges and market caution have impacted these companies. Experts suggest a shift towards stocks with growth potential. Some PSU banks show promise due to improved fundamentals and attractive valuations.",
            "pubDate": "2025-11-05T07:50:38.908528"
        },
        {
            "title": "IT sector stabilising; Motilal Oswal sees 16–33% upside in HCL Tech, Coforge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-sector-stabilising-motilal-oswal-sees-1633-upside-in-hcl-tech-coforge/articleshow/125101040.cms",
            "description": "India’s IT services sector showed stabilisation in Q2, with improved execution, resilient margins, and supportive currency effects. AI adoption is shifting from trials to implementation, opening medium-term opportunities. Stocks like HCL Technologies and Coforge offer healthy growth visibility and valuation comfort.",
            "pubDate": "2025-11-05T07:50:38.908625"
        },
        {
            "title": "How GST reform is powering affordable insurance and accessible healthcare for all",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-gst-reform-is-powering-affordable-insurance-and-accessible-healthcare-for-all/articleshow/125100989.cms",
            "description": "Abolishing GST on health and life insurance has immediately reduced premiums by 18%, making financial protection more accessible for millions, especially the 'missing middle'. This reform, coupled with reduced GST on medical devices and medicines, aims to lower treatment costs and make quality healthcare truly inclusive and affordable for all Indians.",
            "pubDate": "2025-11-05T07:50:38.908718"
        },
        {
            "title": "From challenger to leader: How Groww pipped its rival Zerodha to become India's largest investment platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-challenger-to-leader-how-groww-pipped-its-rival-zerodha-to-become-indias-largest-investment-platform/articleshow/125100781.cms",
            "description": "Groww has surpassed Zerodha in active user count, capturing a significant market share by targeting first-time investors and underserved cities. Despite this user base advantage, Zerodha maintains a lead in profitability and revenue per user. Both platforms face headwinds from regulatory scrutiny on derivatives trading and increased competition.",
            "pubDate": "2025-11-05T07:50:38.908810"
        },
        {
            "title": "Nifty slips 2% after coming within 170 points of record high. What’s next for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-slips-2-after-coming-within-170-points-of-record-high-whats-next-for-investors/articleshow/125100110.cms",
            "description": "Indian markets have pulled back over 2% from record highs due to trade deal uncertainty and fading rate cut hopes. Analysts see this as healthy consolidation within an uptrend, with key support at 25,400-25,600. Investors are advised to buy quality stocks on dips, with fresh longs considered above 26,100.",
            "pubDate": "2025-11-05T07:50:38.908915"
        },
        {
            "title": "Japan's Nikkei falls 4% as tech stocks follow Wall Street lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-4-as-tech-stocks-follow-wall-street-lower/articleshow/125100082.cms",
            "description": "Japan's Nikkei share average plunged 4% on Wednesday, its worst session in seven months, mirroring Wall Street's sharp overnight declines. High-flying technology stocks like SoftBank Group and Advantest led the fall, though analysts suggest it's a reaction to recent gains rather than a market exit.  Nintendo, however, jumped on an improved sales forecast.",
            "pubDate": "2025-11-05T07:50:38.909009"
        },
        {
            "title": "These small-caps stocks may give more than 27% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-small-caps-stocks-may-give-more-than-27-return-in-1-year-according-to-analysts/articleshow/125104363.cms",
            "description": "Let’s start with the assumption that the markets have a higher probability of moving up from here. Now, what will you do when that happens? Most of us don't prepare for our actions. We react to what happens in the market. And our reaction is mostly determined by the narrative and momentum at that point in time. In the markets, it is always better to have a plan, with a clear understanding that the plan and the assumption can go wrong. But it is still better than just reacting to what is happening to the Nifty and Sensex.",
            "pubDate": "2025-11-05T08:27:56.479369"
        },
        {
            "title": "Mahindra & Mahindra shares may rally up to 22%, brokerages say after Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahindra-mahindra-shares-may-rally-up-to-22-brokerages-say-after-q2-results-should-you-buy-sell-or-hold/articleshow/125107001.cms",
            "description": "Nomura and Nuvama reiterated ‘Buy’ ratings on Mahindra & Mahindra after strong Q2 results, projecting up to 22% upside on robust SUV demand, farm segment growth, and rising margins driven by new launches and PLI benefits.",
            "pubDate": "2025-11-05T11:08:08.851361"
        },
        {
            "title": "Tech stocks pull European shares lower; earnings in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-stocks-pull-european-shares-lower-earnings-in-focus/articleshow/125105639.cms",
            "description": "European shares dipped to a two-week low on Wednesday, mirroring global investor nervousness over elevated equity valuations. Technology stocks led the decline, while Novo Nordisk slipped after issuing a cautious profit forecast.  However, Vestas shares surged on better-than-expected earnings.",
            "pubDate": "2025-11-05T11:08:08.851483"
        },
        {
            "title": "DIIs betting big on these 9 midcap stocks.  Are you holding any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diis-betting-big-on-these-9-midcap-stocks-are-you-holding-any/slideshow/125105019.cms",
            "description": "Domestic Institutional Investors (DIIs) increasing their stakes often signals growing confidence in the market or specific companies. Such moves typically reflect expectations of strong future performance and stable economic conditions. Based on StockEdge’s shareholding scan, we have highlighted nine NSE midcap stocks where DII shareholding rose by more than 250 basis points sequentially in the September 2025 quarter.",
            "pubDate": "2025-11-05T11:08:08.851593"
        },
        {
            "title": "Japan's Nikkei falls 2.5% as tech stocks track Wall Street lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-2-5-as-tech-stocks-track-wall-street-lower/articleshow/125105603.cms",
            "description": "Japan's Nikkei share average fell 2.5% on Wednesday, mirroring Wall Street's overnight declines, with technology stocks leading the losses. The index dropped as much as 4.65% before recovering slightly, as investors eyed potential buying opportunities below the 50,000 mark. Despite the dip, analysts anticipate a slow but steady rise for the Nikkei in the future.",
            "pubDate": "2025-11-05T11:08:08.851689"
        },
        {
            "title": "Don't panic yet, investors say, as high-flying AI stocks tumble",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dont-panic-yet-investors-say-as-high-flying-ai-stocks-tumble/articleshow/125112730.cms",
            "description": "Technology stocks experienced sharp declines, with bourses in Seoul and Tokyo falling significantly from recent peaks. While the selloff appears largely positioning-driven, with recent outperformers taking the brunt, investors are viewing it as a potential breather and rotation rather than a cause for panic.",
            "pubDate": "2025-11-05T18:00:33.898059"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/125111701.cms",
            "description": "Indian markets were closed for a holiday on Wednesday. On Tuesday, the Sensex and Nifty closed lower, extending their losing streak due to sharp cuts in IT, auto, and metal stocks. Investor sentiment remained subdued amid FII selling and rising US bond yields, though India's economic fundamentals remain resilient.",
            "pubDate": "2025-11-05T18:00:33.898187"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/125111663.cms",
            "description": "The way things are panning out in the markets, the bulls are steadily gaining control. Yes, we will see small phases of correction, like the one sparked by what happened to the Nasdaq. But the overall bias is expected to remain bullish. The likely difference this time is that the market may be more stock- or even sector-specific. Also, if one looks at the macro picture – which impacts stock prices – it is mostly positive. So, bullish, cautious and selective are the three words you need to use at the same time.",
            "pubDate": "2025-11-05T18:00:33.898393"
        },
        {
            "title": "Stock market sentiment likely to remain constructive after sharp rally in October: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-sentiment-likely-to-remain-constructive-after-sharp-rally-in-october-analysts/articleshow/125111043.cms",
            "description": "Indian stock markets are poised for continued optimism, with analysts anticipating new record highs for Nifty and Sensex by year-end, contingent on supportive global cues and domestic earnings. October saw a significant rally driven by strong corporate results, FII inflows, and easing global yields, though some consolidation is expected due to higher valuations.",
            "pubDate": "2025-11-05T18:00:33.898497"
        },
        {
            "title": "US stocks edge up as tech stocks settle; investors parse through private payrolls data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-muted-as-investors-parse-through-private-payrolls-data/articleshow/125110782.cms",
            "description": "Indian markets saw a mixed trend. Technology stocks recovered after a previous day's dip. A strong private payrolls report offered some comfort. Investors are keenly watching for clues on the Federal Reserve's December rate decision. Companies like McDonald's and Eli Lilly reported positive results. However, some firms like Humana and Super Micro Computer faced declines.",
            "pubDate": "2025-11-05T18:00:33.898614"
        },
        {
            "title": "Multibagger or IBC - Part 31: Will this auto ancillary from a large group rewire itself for the EV world? If yes, then a re-rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-part-31-will-this-auto-ancillary-from-a-large-group-rewire-itself-for-the-ev-world-if-yes-then-a-re-rating/articleshow/125110234.cms",
            "description": "When shareholders say no, business models change. That’s exactly what happened here. For decades, this auto ancillary company routed nearly all its sales through a related party. When investors said no, the entire structure had to be rebuilt as the company must now sell directly to OEMs. What looks like a procedural change is actually a test of adaptability in India’s shifting auto-ancillary landscape. The move could unlock better transparency and margins if executed well, or expose the company’s overdependence on its partner. Either way, it marks a turning point for a firm that has quietly powered India’s heavy-vehicle backbone for over four decades. This series on auto ancillary companies works with the assumption that, from the whole set of auto ancillary companies, some multibagger stocks will emerge. And some companies in this space risk going bankrupt.",
            "pubDate": "2025-11-05T18:00:33.898705"
        },
        {
            "title": "Two Trades for Today: An automotive major for a 4.6% upmove, a mid-cap logistics stock for almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-automotive-major-for-a-4-6-upmove-a-mid-cap-logistics-stock-for-almost-6-gain/articleshow/125109824.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-05T18:00:33.898799"
        },
        {
            "title": "Emirates NBD proposes to launch open offer for RBL Bank stake on December 12",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emirates-nbd-proposes-to-launch-open-offer-for-rbl-bank-stake-on-december-12/articleshow/125109837.cms",
            "description": "Emirates NBD Bank plans to acquire a significant stake in RBL Bank. An open offer at Rs 280 per share will commence from December 12. This deal marks a major foreign investment in India's banking sector. The transaction aims to boost RBL Bank's growth capital and digital capabilities. RBL Bank will seek government approval for increased foreign direct investment.",
            "pubDate": "2025-11-05T18:00:33.898895"
        }
    ]
}