{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-27T06:33:47.584015",
    "items": [
        {
            "title": "Dalal Street edges down amid low volumes, global uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-edges-down-amid-low-volumes-global-uncertainty/articleshow/126199271.cms",
            "description": "On Friday, Indian stock exchanges experienced a downturn as investors opted to trim their portfolios ahead of the weekend break. Meanwhile, bullion markets thrived, with gold and silver prices hitting unprecedented levels, marking a continued upward trend. Global trading activity remained lukewarm, reflecting the seasonal slowdown due to year-end festivities.",
            "pubDate": "2025-12-27T04:02:46.928822"
        },
        {
            "title": "Wall Street closes near record highs; precious metals rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-near-record-highs-precious-metals-rise/articleshow/126200045.cms",
            "description": "Indian markets mirrored global trends as major U.S. stock indexes neared record highs, buoyed by anticipated Federal Reserve rate cuts and a weaker dollar. Precious metals like silver and gold surged to all-time peaks amid geopolitical tensions. Investors are keenly watching for Fed policy shifts and a new chair nomination, while oil prices dipped on supply glut fears.",
            "pubDate": "2025-12-27T05:18:21.748669"
        },
        {
            "title": "US stocks end close to all-time highs in light, post-holiday session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-close-to-all-time-highs-in-light-post-holiday-session/articleshow/126199996.cms",
            "description": "Indian markets saw a flat close on Friday after a strong rally. Investors are watching for the Santa Claus rally, a seasonal trend. This year has been volatile with tariff concerns and geopolitical tensions. Major indexes are set for double-digit gains. Experts advise preparing for continued volatility. Nvidia and Target saw stock movements.",
            "pubDate": "2025-12-27T05:18:21.748782"
        },
        {
            "title": "India’s quiet drift toward duopoly: A risk investors can no longer ignore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-quiet-drift-toward-duopoly-a-risk-investors-can-no-longer-ignore/articleshow/126199642.cms",
            "description": "India's markets are consolidating into duopolies, with two dominant players controlling nearly 90% of sectors like aviation, food delivery, and digital payments. This concentration, exemplified by IndiGo and Air India, shifts incentives from customer service to market management, potentially harming consumers and innovation. The government is now intervening to foster new competition.",
            "pubDate": "2025-12-27T05:18:21.748977"
        },
        {
            "title": "ICICI Bank, AU SFB well-placed as credit cycle turns more disciplined: Siddhartha Khemka",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-au-sfb-well-placed-as-credit-cycle-turns-more-disciplined-siddhartha-khemka/articleshow/126199620.cms",
            "description": "India’s banking sector is recalibrating as asset quality improves and growth turns selective. PSU banks are regaining MSME and home loan share, unsecured lending is moderating, and secured retail drives stability. Analysts favour execution-led lenders like ICICI Bank and AU Small Finance Bank.",
            "pubDate": "2025-12-27T05:18:21.749075"
        },
        {
            "title": "Wall Street Week Ahead: S&P 500 eyes 7,000 mark as investors look for upbeat end to strong 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-sp-500-eyes-7000-mark-as-investors-look-for-upbeat-end-to-strong-2025/articleshow/126199330.cms",
            "description": "US stocks are poised for a strong finish to 2025, nearing record highs. Despite recent tech sector jitters, the S&P 500 is on an impressive streak. Investors are keenly awaiting Fed minutes for clues on interest rate cuts and President Trump's Fed chair nomination, anticipating further market movements.",
            "pubDate": "2025-12-27T05:18:21.749168"
        },
        {
            "title": "Beaten-down solar stocks turn attractive? Waaree Energies, Premier and Vikram Solar offer up to 33% upside, says Prabhudas",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/beaten-down-solar-stocks-turn-attractive-waaree-energies-premier-and-vikram-solar-offer-up-to-33-upside-says-prabhudas/slideshow/126200771.cms",
            "description": "Prabhudas Lilladher has initiated coverage on three solar stocks viz. Waaree Energies, Premiere Energies and Vikram Solar. All the three stocks have been market laggards with Waaree gaining 6% (Nifty 10%) in 2025 while Premiere plunging by 34% YTD. Meanwhile, Vikram Solar, the August 2025 listing, has seen its stock slip 25% below the issue price. Here is why PL sees up to 33% upside in them.",
            "pubDate": "2025-12-27T06:33:46.444702"
        },
        {
            "title": "2025 is the year retail investing matured: Key shifts and the road ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2025-is-the-year-retail-investing-matured-key-shifts-and-the-road-ahead/articleshow/126200498.cms",
            "description": "India’s capital markets are undergoing a structural shift as millions move from trading to disciplined investing. Rising SIP flows, younger investors, and growing retail ownership are reshaping savings habits, market stability, and long-term wealth creation.",
            "pubDate": "2025-12-27T06:33:46.444803"
        }
    ]
}