{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-08T19:14:44.210459",
    "items": [
        {
            "title": "Tata Motors Q2 Results: Profit declines 62% to Rs 477 crore, falls short of expectations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-q2-results-profit-declines-62-to-rs-477-crore-falls-short-of-expectations/articleshow/115091459.cms",
            "description": "Tata Motors reported a 62.4% YoY decline in Q2 net profit to Rs 477 crore, missing expectations. Revenue dropped 16.3% to Rs 15,518 crore due to weak demand in passenger vehicles, aluminum supply issues, and commercial vehicle sales slowdown.",
            "pubDate": "2024-11-08T19:14:25.737064"
        },
        {
            "title": "Equitas Small Finance Bank Q2 Results: Net profit plummets 93% to Rs 13 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/equitas-small-finance-bank-q2-results-net-profit-plummets-93-to-rs-13-crore/articleshow/115090892.cms",
            "description": "Equitas Small Finance Bank's Q2 net profit dropped 93% YoY to Rs 13 crore, mainly due to higher provisions for risky loans. Its operating profit rose 6%, while NPAs increased, with gross NPAs at 2.95% and net NPAs at 0.97%.",
            "pubDate": "2024-11-08T19:14:25.737185"
        },
        {
            "title": "Whirlpool India Q2 Results: Net profit rises 40% to Rs 53 crore on higher volume",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/whirlpool-india-q2-results-net-profit-rises-40-to-rs-53-crore-on-higher-volume/articleshow/115090418.cms",
            "description": "Consumer durable maker Whirlpool of India Ltd on Friday reported a 40.13 per cent rise in its consolidated net profit to Rs 53.53 crore in the September 2024 quarter, helped by volume growth and cost productivity actions.",
            "pubDate": "2024-11-08T19:14:25.737289"
        },
        {
            "title": "Asian Paints Q2 Preview: Weak demand to drag revenue, profit lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/asian-paints-q2-preview-weak-demand-to-drag-revenue-profit-lower/articleshow/115089497.cms",
            "description": "Revenue from operations in the second quarter is expected to decline slightly by 0.2% year-on-year, based on an average of four brokerage estimates. Net profit is projected to decrease by 7% year-on-year, with operating margins and profit also likely to fall due to negative operating leverage and rising costs amid increased competition.",
            "pubDate": "2024-11-08T19:14:25.737386"
        },
        {
            "title": "Fortis Healthcare Q2 Results: Net profit rises 5% YoY to Rs 193 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/fortis-healthcare-q2-results-net-profit-rises-5-yoy-to-rs-193-crore/articleshow/115089354.cms",
            "description": "Fortis Healthcare on Friday said its consolidated net profit increased by 5 per cent year on year to Rs 193 crore for the second quarter ended September 30, 2024, aided by strong performance by the hospital segment.",
            "pubDate": "2024-11-08T19:14:25.737480"
        },
        {
            "title": "Shipping Corp Q2 Results: Net profit jumps multi-fold to Rs 291 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shipping-corp-q2-results-net-profit-jumps-multi-fold-to-rs-291-crore/articleshow/115089268.cms",
            "description": "Disinvestment-bound Shipping Corporation of India Ltd (SCI) on Friday reported a multi-fold rise in its consolidated net profit to Rs 291.44 crore for the second quarter ended September 2024.",
            "pubDate": "2024-11-08T19:14:25.737579"
        },
        {
            "title": "Orient Cement Q2 Results: Profit slides 90% to Rs 2.32 cr, sales down 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/orient-cement-q2-results-profit-slides-90-to-rs-2-32-cr-sales-down-24/articleshow/115087336.cms",
            "description": "CK Birla group firm Orient Cement Ltd on Friday reported a 90.5 per cent decline in net profit to Rs 2.32 crore for the second quarter ended September 2024. The company reported a net profit of Rs 24.62 crore for the July-September quarter a year ago.",
            "pubDate": "2024-11-08T19:14:25.737674"
        },
        {
            "title": "Welspun Corp Q2 Results: Profit falls 27% to Rs 283 cr; board approves over Rs 2,000 cr investments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/welspun-corp-q2-results-profit-falls-27-to-rs-283-cr-board-approves-over-rs-2000-cr-investments/articleshow/115087275.cms",
            "description": "Welspun Corp on Friday reported around 27 per cent fall in consolidated net profit at Rs 282.96 crore for September quarter, mainly on account of fall in income. It had posted Rs 386.57 crore net profit for July-September 2023, the company said in an exchange filing.",
            "pubDate": "2024-11-08T19:14:25.737815"
        },
        {
            "title": "Satin Creditcare Q2 Results: Profit slumps 60% to Rs 42 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/satin-creditcare-q2-results-profit-slumps-60-to-rs-42-crore/articleshow/115086758.cms",
            "description": "Satin Creditcare Network's Q2 net profit dropped 60% YoY to Rs 42 crore, amid stress in the microfinance sector. The company revised its growth outlook to protect asset quality, though operating profit rose 16.5% to Rs 191 crore.",
            "pubDate": "2024-11-08T19:14:25.737913"
        },
        {
            "title": "PFC Q2 Results: Profit rises nearly 9% to Rs 7,215 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pfc-q2-results-profit-rises-nearly-9-to-rs-7215-cr/articleshow/115085082.cms",
            "description": "State-owned Power Finance Corporation (PFC) on Friday posted nearly 9 per cent rise in consolidated net profit at Rs 7,214.90 crore for September quarter mainly on the back of higher revenues.",
            "pubDate": "2024-11-08T19:14:25.738013"
        },
        {
            "title": "Ola Electric Q2 Results: Net loss narrows YoY to Rs 495 cr; revenue jumps 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ola-electric-q2-results-net-loss-narrows-yoy-to-rs-495-cr-revenue-jumps-39/articleshow/115084708.cms",
            "description": "Ola Electric Q2 Results: Revenue from operations increased by 39% YoY to Rs 1,214 crore in the September quarter. However, the loss widened sequentially from Rs 347 crore in the previous June quarter. EBITDA losses for the quarter stood at Rs 223 crore, which is higher compared with Rs 321 crore loss reported in the last year period. However, on a quarter-on-quarter basis, operating losses widened from Rs 65 crore posted in Q1FY25.",
            "pubDate": "2024-11-08T19:14:25.738102"
        },
        {
            "title": "India Cements Q2 Results: Loss widens to Rs 339 crore, revenue down 18% as prices fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-cements-q2-results-loss-widens-to-rs-339-crore-revenue-down-18-as-prices-fall/articleshow/115083798.cms",
            "description": "The India Cements Ltd (ICL) on Friday reported widening of consolidated net loss to Rs 339.13 crore for the second quarter ended September 2024, impacted by a decline in selling price. It had incurred a loss of Rs 80.07 crore in the July-September period a year ago, according to a BSE filing from ICL, in which rival Aditya Birla group firm UltraTech Cement has announced to acquire a majority stake.",
            "pubDate": "2024-11-08T19:14:25.738191"
        },
        {
            "title": "Tata Motors Q2 Results: Cons PAT falls 11% YoY to Rs 3,343 crore, misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-q2-results-cons-pat-falls-11-yoy-to-rs-3343-crore-misses-estimates/articleshow/115083418.cms",
            "description": "Tata Motors Q2 Results: During the quarter, its revenue dropped 3.5% YoY to Rs 101,450 crore. In a challenging environment, the company’s EBITDA margin dropped by 230 bps YoY to 11.4%, with caution on short-term domestic demand. JLR revenue fell 5.6% to £6.5 billion due to supply issues, leading to a 220 bps EBIT margin drop to 5.1%. Commercial vehicle revenue declined 13.9%, but EBITDA margin improved to 10.8% (up 40 bps) due to favourable pricing and cost savings.",
            "pubDate": "2024-11-08T19:14:25.738278"
        },
        {
            "title": "LIC Q2 Results: Profit slips 4% YoY to Rs 7,621 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-q2-results-profit-slips-4-yoy-to-rs-7621-crore/articleshow/115082898.cms",
            "description": "LIC Q2 Results: Net premium income during the reporting quarter increased 11% year-on-year (YoY) to Rs 1.19 lakh crore, compared with Rs 1.07 lakh crore in the same quarter last year.",
            "pubDate": "2024-11-08T19:14:25.738364"
        },
        {
            "title": "Info Edge Q2 Results: PAT slides 59% YoY to Rs 86 crore; revenue rises 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/info-edge-q2-results-pat-slides-59-yoy-to-rs-86-crore-revenue-rises-11/articleshow/115082857.cms",
            "description": "Revenue from operations grew 11% to Rs 656 crore in the quarter, up from Rs 593 crore in the same period last year. The recruitment business saw steady growth in Q2, while non-recruitment segments also expanded, reducing operating losses.",
            "pubDate": "2024-11-08T19:14:25.738455"
        },
        {
            "title": "Ashok Leyland Q2 Results: Profit jumps 37% YoY to Rs 770 crore; Rs 2 per share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ashok-leyland-q2-results-profit-jumps-37-yoy-to-rs-770-crore-rs-2-per-share-dividend-declared/articleshow/115080298.cms",
            "description": "Ashok Leyland reported a 37.2% YoY rise in Q2 net profit to Rs 770 crore, surpassing estimates. However, revenue fell 9% YoY to Rs 8,768.8 crore. The company declared an interim dividend and maintained strong market shares in MHCV and buses.",
            "pubDate": "2024-11-08T19:14:25.738547"
        }
    ]
}