{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-15T19:01:48.805485",
    "items": [
        {
            "title": "Bank of Maharashtra Q1 profit rises 23% YoY to Rs 1,593 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-maharashtra-q1-profit-rises-23-yoy-to-rs-1593-crore/articleshow/122516063.cms",
            "description": "Bank of Maharashtra reported a 23% YoY rise in Q1FY26 net profit to Rs 1,593 crore, aided by lower provisions and stable asset quality, despite NIM contraction.",
            "pubDate": "2025-07-15T19:01:35.353470"
        },
        {
            "title": "HDB Financial Q1 Results: PAT falls 2% to Rs 568 crore; NII rises 18% on healthy loan growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdb-financial-q1-results-pat-falls-2-to-rs-568-crore-nii-rises-18-on-healthy-loan-growth/articleshow/122509080.cms",
            "description": "HDB Financial Services experienced a slight dip in net profit for Q1 FY26, reporting Rs 568 crore, a 2% decrease YoY. Despite this, the company demonstrated strong operational performance. Net interest income saw a healthy 18% YoY increase, reaching Rs 2,092 crore, driven by growth in advances and interest-earning assets.",
            "pubDate": "2025-07-15T19:01:35.353596"
        },
        {
            "title": "HDFC Life Q1 Results: Standalone profit rises 14% YoY to Rs 546 cr; net premium income up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-life-q1-results-standalone-profit-rises-14-yoy-to-rs-546-crore-net-premium-income-grows-16/articleshow/122502983.cms",
            "description": "HDFC Life Insurance reported a 14% YoY increase in net profit, reaching ₹546 crore for Q1FY26, driven by a 16% rise in net premium income. The company's Individual APE grew by 12.5% YoY, boosting its market share to 12.1% overall and 17.5% within the private sector.",
            "pubDate": "2025-07-15T19:01:35.353705"
        },
        {
            "title": "ICICI Prudential Life Q1 Results: Profit jumps 34% YoY as premiums rise, costs fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-prudential-life-q1-results-profit-jumps-34-yoy-as-premiums-rise-costs-fall/articleshow/122499672.cms",
            "description": "ICICI Prudential Life Insurance reported a 34% surge in first-quarter profit, reaching 3.02 billion rupees, driven by increased group policy premiums and reduced operating costs. Net premium income rose 8% to 85.03 billion rupees, fueled by a 20% jump in single premiums. However, growth in ULIPs slowed due to market volatility, while annualized premium equivalent sales fell 5% to 18.",
            "pubDate": "2025-07-15T19:01:35.353805"
        },
        {
            "title": "Bank of Maharashtra Q1 Results: Net profit jumps 23% YoY to Rs 1,593 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-maharashtra-q1-results-net-profit-jumps-23-yoy-to-rs-1593-crore/articleshow/122494599.cms",
            "description": "Bank of Maharashtra announced a net profit of Rs 1593 crore for Q1 June 2025, marking a 23% year-over-year increase. Total income rose by 16% to Rs 7879.18 crore, although other income saw a slight decrease. Asset quality remained stable with gross NPA at 1.74% and net NPA at 0.18%.",
            "pubDate": "2025-07-15T19:01:35.353907"
        },
        {
            "title": "Tech Mahindra Q1 Results Preview: PAT may rise 42% YoY; CC revenue to dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q1-results-preview-pat-may-rise-42-yoy-cc-revenue-to-dip/articleshow/122486399.cms",
            "description": "Tech Mahindra anticipates a slight revenue decline in constant currency for Q1 FY26 due to weakness in the hi-tech sector and seasonal softness in its BPO business. Despite Comviva's support, core segment drags are expected to dominate. However, PAT is projected to increase significantly YoY, with strong deal wins expected, reaching around $750 million.",
            "pubDate": "2025-07-15T19:01:35.354040"
        },
        {
            "title": "NABFID's FY25 net profit up 37% on 60% surge in loan growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nabfids-fy25-net-profit-up-37-on-60-surge-in-loan-growth/articleshow/122474140.cms",
            "description": "National Bank for Financing Infrastructure and Development saw a significant rise in profits. The government-backed firm's net profit increased by 37% in fiscal year 2025. This growth was driven by a 60% expansion in its loan portfolio. Total interest earned almost doubled during the same period. Most of the loans were given to transport, logistics and energy sectors.",
            "pubDate": "2025-07-15T19:01:35.354237"
        },
        {
            "title": "HCL Tech Q1 Results: Cons PAT slips 10% YoY to Rs 3,843 crore; Rs 12 per share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-q1-results-cons-pat-slips-10-yoy-to-rs-3843-crore-rs-12-per-share-dividend-declared/articleshow/122440192.cms",
            "description": "HCL Technologies on Monday reported a 10% fall in its Q1FY26 consolidated net profit at Rs 3,843 crore versus Rs 4,257 in the year ago period. The net profit is attributable to the owners of the company and was lower than Street's estimates of Rs 4,224 crore.",
            "pubDate": "2025-07-15T19:01:35.354332"
        },
        {
            "title": "Tata Technologies Q1 Results: Cons PAT grows 5% YoY to Rs 170 crore; revenue down 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-technologies-q1-results-cons-pat-grows-5-yoy-to-rs-170-crore-revenue-down-2/articleshow/122437271.cms",
            "description": "Tata Technologies announced its Q1FY26 results. The company's net profit increased by 5% year-on-year, reaching Rs 170 crore. However, revenue from operations saw a slight decrease of 2% to Rs 1,244 crore. The company's shares closed at Rs 713.90, showing a gain of 0.72%. The EBITDA margin stood at 16.1%, with operating EBITDA at Rs 200 crore.",
            "pubDate": "2025-07-15T19:01:35.354429"
        },
        {
            "title": "Tata Technologies Q1 results today, shares down 50% from peak. Here’s how to trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-technologies-q1-results-today-shares-down-50-from-peak-heres-how-to-trade/articleshow/122432804.cms",
            "description": "Tata Technologies shares are trading near Rs 700, down 50% from listing highs, amid a persistent bearish trend. Ahead of Q1 FY26 results, analysts suggest caution, with a possible breakdown below Rs 695 or upside toward Rs 735. Technical indicators show weakness, with no clear reversal signs yet.",
            "pubDate": "2025-07-15T19:01:35.354525"
        },
        {
            "title": "HDFC Life Q1 preview: PAT may rise 16% YoY; double-digit APE growth seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-life-q1-preview-pat-may-rise-16-yoy-double-digit-ape-growth-seen/articleshow/122432315.cms",
            "description": "HDFC Life Insurance anticipates steady first quarter FY26 results. Brokerages predict double-digit growth in Annual Premium Equivalent. Profitability metrics are expected to expand. Profit after tax may reach Rs 5,550 crore, a 16% increase. EBITDA could hit Rs 5,606 crore, up 13%. Annual Premium Equivalent growth is projected around 15–16%. Value of New Business is also expected to grow.",
            "pubDate": "2025-07-15T19:01:35.354622"
        },
        {
            "title": "Ola Electric Q1 Results: Net loss widens 23% YoY to Rs 428 crore, revenue drops 50%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ola-electric-q1-results-net-loss-widens-23-yoy-to-rs-428-crore-revenue-drops-50/articleshow/122429308.cms",
            "description": "Ola Electric Q1 Results: Ola Electric reported a consolidated net loss of Rs 428 crore for Q1 2025, a 23% increase year-on-year, while revenue from operations sharply declined by 49.6% to Rs 828 crore. Despite the revenue drop, the company reduced total expenses and saw its auto business achieve near-neutral operating cash flow, expecting it to turn positive later in the year.",
            "pubDate": "2025-07-15T19:01:35.354722"
        },
        {
            "title": "HCL Tech Q1 preview: Street expects muted sequential show amid seasonal softness. 5 key things to check",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-q1-preview-street-expects-muted-sequential-show-amid-seasonal-softness-5-key-things-to-check/articleshow/122415114.cms",
            "description": "HCL Technologies is set to announce Q1FY26 results with analysts projecting flattish sequential growth due to seasonal softness. While revenue may rise 7–8% YoY, margin pressures persist. PAT forecasts diverge across brokerages. Deal wins and guidance retention are expected to support sentiment amid global macro uncertainty.",
            "pubDate": "2025-07-15T19:01:35.354816"
        }
    ]
}