{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-05T03:38:32.689410",
    "items": [
        {
            "title": "RVNL shares in focus after Rs 404-crore East Coast Railway project win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-after-rs-404-crore-east-coast-railway-project-win/articleshow/117933699.cms",
            "description": "Rail Vikas Nigam Ltd (RVNL) shares will be in focus on February 5 after receiving a Rs 404.4 crore contract from East Coast Railway for the Koraput-Singapur Road Doubling Project. The project includes the construction of 27 major bridges, including 22 major bridges and five road-over bridges (ROBs), along with earthworks and other tasks between Tikiri and Bhalumaska stations.",
            "pubDate": "2025-02-05T03:38:18.936855"
        },
        {
            "title": "Titan shares in focus after Q3 PAT falls marginally. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-shares-in-focus-after-q3-pat-falls-marginally-what-should-investors-do/articleshow/117933138.cms",
            "description": "Titan shares are under scrutiny following a slight dip in Q3 net profit to Rs 1,047 crore, despite a 25% increase in total income. Analysts are optimistic about Titan's growth, with Macquarie maintaining an 'Outperform' rating and Goldman Sachs giving a 'Buy' rating due to strong jewelry segment performance.",
            "pubDate": "2025-02-05T03:38:18.936966"
        },
        {
            "title": "At multi-year highs: These 3 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-3-stocks-witness-5-year-swing-high-breakout/slideshow/117932971.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1000 crore, we have collated a list of three stocks that witnessed a 5-year swing high at the close on February 4, suggesting bullishness in counters, according to stockedge.com's technical scan data.",
            "pubDate": "2025-02-05T03:38:18.937070"
        },
        {
            "title": "Asian Paints shares in focus after Q3 results. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-shares-in-focus-after-q3-results-should-you-buy-sell-or-hold/articleshow/117932833.cms",
            "description": "The revenue from operations for Q3FY25 stood at Rs 8,549 crore, marking a 6% decline from Rs 9,103 crore reported in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-02-05T03:38:18.937164"
        },
        {
            "title": "​Positive Breakout: These 4 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-4-stocks-cross-above-their-200-dmas/slideshow/117932621.cms",
            "description": "In the Nifty200 pack, four stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on February 4, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-02-05T03:38:18.937256"
        },
        {
            "title": "ITC Hotels to be removed from Sensex and BSE indices today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-to-be-removed-from-sensex-and-bse-indices-today/articleshow/117932370.cms",
            "description": "ITC Hotels share price: The newly demerged entity made its debut on the NSE and BSE at Rs 180 and Rs 188 per share, respectively, giving it a market valuation of Rs 39,126.02 crore at the time of listing. Since then, its valuation has decreased to Rs 34,266.48 crore.",
            "pubDate": "2025-02-05T03:38:18.937352"
        },
        {
            "title": "Tata Power shares in focus after Q3 profit rises 10% YoY to Rs 1,188 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-power-shares-in-focus-after-q3-profit-rises-10-yoy-to-rs-1188-crore/articleshow/117932105.cms",
            "description": "Tata Power reported a consolidated net profit increase of 10% year-on-year, reaching Rs 1,188 crore for Q4 2024, driven by higher revenues. The company plans to explore opportunities in small modular nuclear reactors, with a current operational clean energy capacity of 6.7 GW and 10 GW in progress.",
            "pubDate": "2025-02-05T03:38:18.937442"
        },
        {
            "title": "CONCOR, Sun Pharma among 6 stocks set to trade ex-dividend on Thursday. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concor-sun-pharma-among-6-stocks-set-to-trade-ex-dividend-on-thursday-last-day-to-buy/articleshow/117932063.cms",
            "description": "State-owned Container Corporation of India, Sun Pharmaceutical Industries, and four other companies will be the focus as February 6 is set as the record date for determining shareholder eligibility for dividend payouts. Investors must purchase shares by February 5 to qualify. Dividends from these companies are a significant component of total shareholder returns.",
            "pubDate": "2025-02-05T03:38:18.937529"
        },
        {
            "title": "China markets return from holiday facing trade war and AI rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-markets-return-from-holiday-facing-trade-war-and-ai-rally/articleshow/117931840.cms",
            "description": "China’s markets resume after a holiday amid a fresh trade dispute with the U.S. and volatility in the global artificial intelligence sector. Key indicators include Beijing's responses to tariffs and economic support measures. Chinese AI stocks could surge due to DeepSeek’s new AI model, despite global market concerns driven by Trump's tariffs.",
            "pubDate": "2025-02-05T03:38:18.937631"
        },
        {
            "title": "Wall Street rises on US-China trade optimism, energy boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-rises-on-us-china-trade-optimism-energy-boost/articleshow/117931724.cms",
            "description": "Major stock indexes closed higher on Tuesday, driven by energy stocks and optimism over U.S.-China trade talks after Trump delayed tariffs for Canada and Mexico. Corporate earnings were strong, with 76.8% of S&P 500 companies exceeding expectations. Palantir shares surged 24%, while Alphabet dipped post-market. Advancing issues outnumbered decliners on both NYSE and Nasdaq.",
            "pubDate": "2025-02-05T03:38:18.937719"
        },
        {
            "title": "Asian stocks track US higher, China set to reopen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-track-us-higher-china-set-to-reopen/articleshow/117931180.cms",
            "description": "The first volleys in the latest US-China trade war made clear that Xi Jinping is taking a more cautious approach than during Donald Trump’s first term. After the US leader gave last-minute reprieves to Canada and Mexico, his 10% tariffs on China took effect on Tuesday. Beijing swiftly announced additional tariffs on roughly 80 products to take effect on Feb. 10, but traders are hoping upcoming talks will ease tensions.",
            "pubDate": "2025-02-05T03:38:18.937894"
        },
        {
            "title": "GIFT Nifty up 80 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/117931117.cms",
            "description": "However, a decisive upside breakout of 23,500-23,600 levels could open more upside ahead. Immediate support is placed at 23,200 levels, said Nagaraj Shetti of HDFC Securities.",
            "pubDate": "2025-02-05T03:38:18.937978"
        },
        {
            "title": "Stocks in news: Swiggy, Titan, Tata Power, Hero MotoCorp, Bandhan Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-swiggy-titan-tata-power-hero-motocorp-bandhan-bank/articleshow/117931077.cms",
            "description": "Consumer discretionary major Titan reported a marginal dip (-0.6%) in its third quarter consolidated net profit at Rs 1,047 crore, even as the total income rose 25% YoY to Rs 17,723 crore.",
            "pubDate": "2025-02-05T03:38:18.938064"
        },
        {
            "title": "Algo trades to open for retail investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/algo-trades-to-open-for-retail-investors/articleshow/117930729.cms",
            "description": "Under the framework, the facility of algo trading would be provided by the stockbroker to retail investors only after obtaining permission of the stock exchange for each algo.",
            "pubDate": "2025-02-05T03:38:18.938237"
        }
    ]
}