{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-25T04:49:53.603729",
    "items": [
        {
            "title": "Last day to buy PFC shares to qualify for dividend as stock approaches ex-date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-pfc-shares-to-qualify-for-dividend-as-stock-approaches-ex-date/articleshow/125553734.cms",
            "description": "Investors have a final chance today, November 25, to buy shares of Power Finance Corporation and Shyamkamal Investments to qualify for their interim dividends. PFC offers Rs 3.65 per share, while Shyamkamal Investments declared Rs 0.10 per share. Both stocks turn ex-dividend tomorrow, November 26, meaning only shareholders on record by then will receive the payouts.",
            "pubDate": "2025-11-25T02:50:42.404989"
        },
        {
            "title": "HDFC AMC 1:1 bonus issue: Stock nears record date. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-11-bonus-issue-stock-nears-record-date-do-you-own/articleshow/125553672.cms",
            "description": "Investors have a final chance today to buy HDFC AMC shares for a bonus issue. The company is offering one new share for every existing share held. This corporate action aims to increase liquidity and lower the per-share price. The stock has shown strong performance over the past year. However, recent periods indicate a cooling phase.",
            "pubDate": "2025-11-25T02:50:42.405112"
        },
        {
            "title": "Stock to buy in 2025 for long term: Senco Gold, M&M among 5 stocks that could give 16-56% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-buy-in-2025-for-long-term-senco-gold-mm-among-5-stocks-that-could-give-16-56-return/slideshow/125553650.cms",
            "description": "Brokerages remain broadly optimistic across key sectors, issuing strong Buy calls on a diverse set of companies ranging from jewellery and autos to infrastructure, chemicals, and defence-related manufacturing. We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-25T02:50:42.405241"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/125553540.cms",
            "description": "In the Nifty500 pack, 9 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on November 24, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-11-25T02:50:42.405355"
        },
        {
            "title": "Wall Street rallies on tech rebound, rising rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-rallies-on-tech-rebound-rising-rate-cut-bets/articleshow/125553447.cms",
            "description": "Indian stock markets saw a strong start to the week. Investors are optimistic about a potential US Federal Reserve interest rate cut in December. This has boosted confidence despite concerns about high tech stock prices. Economic data releases are expected this week, offering further insights into the market's direction. The holiday shopping season also begins, with expectations of record sales.",
            "pubDate": "2025-11-25T02:50:42.405453"
        },
        {
            "title": "GIFT Nifty up 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125553159.cms",
            "description": "Indian equities experienced selling pressure on Monday, with the Nifty falling below 26,000 due to profit booking. Analysts anticipate cautious market sentiment until progress is seen in India-US trade talks and GDP numbers are released. Fluctuating foreign flows are expected to add to interim volatility.",
            "pubDate": "2025-11-25T02:50:42.405555"
        },
        {
            "title": "Stocks in news: Dr Reddy's, GAIL, Hudco, HUL, Acme Solar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-dr-reddys-gail-hudco-hul-acme-solar/articleshow/125553133.cms",
            "description": "Indian markets experienced a subdued trading session, closing nearly half a percent lower due to global uncertainties and continued FII selling. With the monthly expiry approaching, volatility is expected to remain high. Investors are advised to maintain a stock-specific approach and accumulate quality stocks on dips.",
            "pubDate": "2025-11-25T02:50:42.405651"
        },
        {
            "title": "Asian stocks track US gains on Fed rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-track-us-gains-on-fed-rate-cut-bets/articleshow/125553113.cms",
            "description": "Asian stocks mirrored Wall Street's gains, driven by growing confidence in a potential Federal Reserve interest-rate cut in December and a rebound in technology shares. This optimism follows Fed Governor Christopher Waller's signal of support for a rate reduction, suggesting November's pullback may set the stage for a December rally.",
            "pubDate": "2025-11-25T02:50:42.405741"
        },
        {
            "title": "FPIs extend IT sell-off, dump Rs 4,873 crore in first half of November",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-extend-it-sell-off-dump-rs-4873-crore-in-first-half-of-november/articleshow/125553006.cms",
            "description": "Foreign investors are selling Indian IT shares heavily. This trend continues as valuations remain high and AI opportunities are missed. Other sectors like consumer services and healthcare also saw selling. Delays in the US-India trade deal are a factor. Telecommunication sector received inflows due to a large deal. Oil & gas and 'Others' saw purchases. Investors remain cautious on India.",
            "pubDate": "2025-11-25T02:50:42.405834"
        },
        {
            "title": "IT counters' weak show could be a silver lining: Motilal Oswal Financial",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-counters-weak-show-could-be-a-silver-lining-motilal-oswal-financial/articleshow/125552982.cms",
            "description": "Investors may consider increasing their stake in Indian IT companies. Valuations are now attractive after a period of underperformance. Spending on Generative AI services is expected to pick up in the coming quarters. The Nifty IT index has lagged the benchmark Nifty. This presents an opportunity for selective and gradual portfolio adjustments.",
            "pubDate": "2025-11-25T02:50:42.405925"
        },
        {
            "title": "WeWork India posts strong Q2 growth, eyes faster FY26 expansion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wework-india-posts-strong-q2-growth-eyes-faster-fy26-expansion/articleshow/125552889.cms",
            "description": "WeWork India reported robust double-digit growth in revenue and EBITDA for the September 2025 quarter, with sustained momentum expected to drive faster top-line growth in FY26. The company is focused on capacity expansion and strengthening its balance sheet, aiming for near-zero debt by March 2026. Analysts maintain a 'buy' rating, citing strong performance and future potential.",
            "pubDate": "2025-11-25T02:50:42.406016"
        },
        {
            "title": "Fast food, fast growth: Investors queue for quick-service restaurants",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fast-food-fast-growth-investors-queue-for-quick-service-restaurants/articleshow/125552915.cms",
            "description": "India’s quick service restaurant (QSR) sector is sizzling again. Multiple deals are in motion as fast-expanding chains attract serious investor appetite, sources told us.",
            "pubDate": "2025-11-25T02:50:42.406113"
        },
        {
            "title": "1729 Capital gets RBI nod to raise Suryoday stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/1729-capital-gets-rbi-nod-to-raise-suryoday-stake/articleshow/125552819.cms",
            "description": "The Reserve Bank of India has approved foreign portfolio investor 1729 Capital to increase its stake in Suryoday Small Finance Bank to 7.14%. Previously holding 3.81%, the FPI will now require prior RBI consent for any further stake increases or if their holding drops below 5%.",
            "pubDate": "2025-11-25T02:50:42.406240"
        },
        {
            "title": "How will revised BSDA rules impact demat account holders?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-revised-bsda-rules-impact-demat-account-holders/articleshow/125552727.cms",
            "description": "The Securities and Exchange Board of India (Sebi) has proposed excluding delisted securities and zero-coupon, zero-principal bonds from portfolio value calculations for basic services demat accounts. This move aims to ensure fairness and prevent artificial inflation of holdings, as these securities lack realisable market value or investment potential.",
            "pubDate": "2025-11-25T02:50:42.406336"
        },
        {
            "title": "HAL skids after Tejas crash; analysts expect limited hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-skids-after-tejas-crash-analysts-expect-limited-hit/articleshow/125552697.cms",
            "description": "Hindustan Aeronautics shares extended losses Monday following a Tejas aircraft accident during a Dubai air show. Analysts anticipate limited financial impact on the company's orderbook and execution, noting fighter jet crashes are not uncommon. While near-term pressure and slowed export negotiations are possible, the incident occurred at an air show, not during a mission.",
            "pubDate": "2025-11-25T02:50:42.406427"
        },
        {
            "title": "Yuan powers towards its biggest annual gains since 2020",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yuan-powers-towards-its-biggest-annual-gains-since-2020/slideshow/125555759.cms",
            "description": "The yuan is set for its sharpest annual gain since 2020, despite pressures such as slow growth, weak investment and low interest rates. Its steady appreciation has revived speculation that China is renewing efforts to boost the currency’s global role. (Source: Reuters)",
            "pubDate": "2025-11-25T04:49:33.883578"
        },
        {
            "title": "Jefferies initiates buy on LG Electronics shares with Rs 1,980 target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-initiates-buy-on-lg-electronics-shares-with-rs-1980-target-price/articleshow/125555327.cms",
            "description": "Jefferies has initiated coverage on LG Electronics India with a Buy rating and a target price of Rs 1,980, implying a 21% upside. The brokerage sees strong rerating potential as the stock trades 10–15% below peers like Blue Star and Havells. Its bullish view is supported by LGEL’s market leadership, superior margins, and capacity expansion plans to capitalise on rising demand.",
            "pubDate": "2025-11-25T04:49:33.883706"
        },
        {
            "title": "Groww shares jump over 3% but still down 22% from record high. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-jump-over-3-but-still-down-22-from-record-high-what-should-investors-do/articleshow/125555144.cms",
            "description": "Billionbrains Garage Ventures, parent of Groww, saw its shares climb after a recent slide. Despite volatility, analysts remain optimistic about Groww's long-term prospects due to its dominant digital platform and low customer acquisition costs, reflected in strong financial metrics. However, concerns over elevated valuations and potential SEBI regulatory tightening in the F&O segment linger.",
            "pubDate": "2025-11-25T04:49:33.883815"
        },
        {
            "title": "India looking beyond Horlicks and Lux? A story of struggling HUL even as Sensex doubled in 5 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-looking-beyond-horlicks-and-lux-a-story-of-struggling-hul-even-as-sensex-doubled-in-5-years/articleshow/125555050.cms",
            "description": "Hindustan Unilever faces challenges as its growth slows. Traditional brands like Horlicks and Lux are seeing reduced demand. New-age competitors are gaining ground in beauty and personal care. Home care remains a strong segment. HUL is implementing strategies for volume recovery and sharper segmentation. Investors anticipate steady growth rather than rapid returns.",
            "pubDate": "2025-11-25T04:49:33.883908"
        },
        {
            "title": "Dr. Reddy’s Laboratories shares jump over 1% as European Commission approves biosimilar AVT03",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-laboratories-shares-jump-over-1-as-european-commission-approves-biosimilar-avt03/articleshow/125555014.cms",
            "description": "Dr. Reddy's Laboratories secured European Commission approval for AVT03, a biosimilar to Prolia and Xgeva, for osteoporosis and bone complications. This significant milestone, following a positive CHMP recommendation, allows marketing across EU member states and EEA countries.  Dr. Reddy's, in partnership with Alvotech, will commercialize the drug under brands Acyvbra and Xbonzy.",
            "pubDate": "2025-11-25T04:49:33.884002"
        },
        {
            "title": "Sensex off to a flat start, Nifty below 26,000 as IT, oil & gas stocks fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-off-to-a-flat-start-nifty-below-26000-as-it-oil-gas-stocks-fall/articleshow/125554989.cms",
            "description": "Indian stock markets opened on a subdued note today. The Sensex and Nifty saw slight dips. Losses in IT and oil & gas sectors weighed on the indices. However, gains in metal and PSU bank stocks provided some support. Broader markets also experienced minor declines.",
            "pubDate": "2025-11-25T04:49:33.884106"
        },
        {
            "title": "Buy, Sell or Hold: Jefferies maintain buy on Lupin; Motilal Oswal initiates coverage on Blue Star",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-jefferies-maintain-buy-on-lupin-motilal-oswal-initiates-coverage-on-blue-star/articleshow/125554984.cms",
            "description": "Brokerages shared a mixed outlook across sectors: Jefferies stays bullish on Lupin on the back of steady US growth and strong margins, while Motilal Oswal begins coverage on Blue Star with a neutral view, citing near-term demand softness despite solid long-term fundamentals.",
            "pubDate": "2025-11-25T04:49:33.884203"
        },
        {
            "title": "Ceigall India shares rise 3% after winning Rs 58.5 crore annual contract for 35 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ceigall-india-shares-in-focus-after-winning-rs-585-million-annual-contract-for-35-years/articleshow/125554888.cms",
            "description": "Ceigall India shares: The company received an LoI from REC Power Development & Consultancy for a 35-year infrastructure project worth ₹585 million annually. The project involves setting up a 400/220 kV Velgaon GIS substation under TBCB norms. The company must submit a ₹9.35 crore performance guarantee within 10 days.",
            "pubDate": "2025-11-25T04:49:33.884318"
        },
        {
            "title": "India's ‘AI losers’ just made investors richer by Rs 2.6 lakh crore & nobody saw the boom coming",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-ai-losers-just-made-investors-richer-by-rs-2-6-lakh-crore-nobody-saw-the-boom-coming/articleshow/125554826.cms",
            "description": "Indian IT stocks, once dismissed as \"AI losers,\" have surged 10% since October, adding Rs 2.6 lakh crore in market capitalization. Investors are betting on a long-awaited AI services inflection point, with companies like TCS and Coforge showing significant gains. This comeback follows years of muted growth, as the sector now aligns with strengths in AI applications and services.",
            "pubDate": "2025-11-25T04:49:33.884411"
        },
        {
            "title": "High frequency firms see India profits surge despite regulatory curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-frequency-firms-see-india-profits-surge-despite-regulatory-curbs/articleshow/125554761.cms",
            "description": "High-frequency trading firms have posted robust profit growth in India despite regulatory curbs, highlighting their ability to navigate the $5.4 trillion equity market. Hudson River Trading led with a 156% profit surge for the fiscal year ending March 31. Other firms, including Optiver, AlphaGrep Securities, and Graviton Research Capital, also reported strong annual gains, reflecting resilience and strategic agility.",
            "pubDate": "2025-11-25T04:49:33.884504"
        },
        {
            "title": "Siemens Energy India shares rally 4% post robust Q4, strong order book",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siemens-energy-india-shares-in-focus-post-robust-q4-strong-order-book/articleshow/125554621.cms",
            "description": "Siemens Energy India shares could see activity today as it posted robust financial results for the fourth quarter of FY2025. Revenue and profit saw significant increases, supported by a substantial rise in the order backlog. The company declared a dividend, reflecting its strong operational performance. Continued demand for energy and electrification solutions is expected to drive future growth.",
            "pubDate": "2025-11-25T04:49:33.884596"
        },
        {
            "title": "Paras Defence shares jump 2% after MoU with IUAC for MRI magnet system",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paras-defence-shares-in-focus-after-mou-with-iuac-for-mri-magnet-system/articleshow/125554530.cms",
            "description": "Paras Defence and Space Technologies shares are likely to draw investor attention on Tuesday, November 25, following the signing of a Memorandum of Understanding (MoU) with the Inter-University Accelerator Centre (IUAC), New Delhi. IUAC, an autonomous institute under the UGC and Ministry of Education, focuses on particle accelerator-based research and development. The collaboration aims to advance technology and innovation in India.",
            "pubDate": "2025-11-25T04:49:33.884688"
        },
        {
            "title": "Rail Vikas Nigam among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rail-vikas-nigam-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125554485.cms",
            "description": "As of November 24, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase of more than 10% compared with the previous trade. A sharp rise in futures open interest indicates the addition of fresh positions or expansion of existing ones, reflecting growing trader participation in the derivatives market.",
            "pubDate": "2025-11-25T04:49:33.884783"
        },
        {
            "title": "HUDCO shares in focus after signing MoU with NIUA for urban development collaboration",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hudco-shares-in-focus-after-signing-mou-with-niua-for-urban-development-collaboration/articleshow/125554393.cms",
            "description": "Housing and Urban Development Corporation has signed a five-year non-binding MoU with the National Institute of Urban Affairs to collaborate on urban infrastructure initiatives, capacity-building programmes, research activities and financing exploration. The partnership aims to support urban development through joint programmes, evaluation frameworks and coordination with multilateral funding agencies.",
            "pubDate": "2025-11-25T04:49:33.884876"
        },
        {
            "title": "Eris Lifesciences shares in focus on move to acquire Swiss Parenterals in Rs 423 crore deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eris-lifesciences-shares-in-focus-on-move-to-acquire-swiss-parenterals-in-rs-423-crore-deal/articleshow/125554259.cms",
            "description": "Eris Lifesciences is set to fully acquire its injectable unit, Swiss Parenterals. The deal involves a share swap valued at Rs 423.3 crore. This move aims to enhance operational control and financial integration. Swiss Parenterals, a significant exporter, has shown consistent revenue growth. Eris also reported strong Q2 performance with increased revenue and profit.",
            "pubDate": "2025-11-25T04:49:33.884968"
        },
        {
            "title": "ACC among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/acc-among-5-stocks-showing-bullish-rsi-upswing/slideshow/125554224.cms",
            "description": "On November 24, in the Nifty 200 pack, five stocks appeared in the RSI Trending Up scan on StockEdge.com. An RSI crossing above 50 indicates improving strength. Rising RSI values indicate building momentum, suggesting a possible upward movement and providing traders with an early opportunity to identify potential buying opportunities.",
            "pubDate": "2025-11-25T04:49:33.885057"
        }
    ]
}