{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-31T13:50:43.788343",
    "items": [
        {
            "title": "Coal India Q1 Results: PAT falls 20% YoY to Rs 8,734 crore; Rs 5.50 per share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/coal-india-q1-results-pat-falls-20-yoy-to-rs-8734-crore-rs-5-50-per-share-dividend-declared/articleshow/123020526.cms",
            "description": "Coal India Q1 Results: State-owned coal miner Coal India reported 20% YoY decline in its consolidated net profit at Rs 8734 crore in the first quarter. Revenues too fell 4% YoY to Rs 35,842 crore in the same period.",
            "pubDate": "2025-07-31T13:50:31.156339"
        },
        {
            "title": "ITC Q1 Results Preview: PAT may grow up to 4% YoY. Stable cigarette volume to drive topline growth up to 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-q1-results-preview-pat-may-grow-up-to-4-yoy-stable-cigarette-volume-to-drive-topline-growth-up-to-8/articleshow/123020341.cms",
            "description": "ITC is expected to post modest Q1FY26 earnings with flat to slight growth in PAT and EBITDA. Margin pressure in FMCG and paper may offset gains from stable cigarette and agri business performance, according to top brokerage estimates.",
            "pubDate": "2025-07-31T13:50:31.156486"
        },
        {
            "title": "Swiggy Q1 Results: Loss widens to Rs 1,197 crore, revenue soars 54%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swiggy-q1-results-loss-widens-to-rs-1197-crore-revenue-soars-54/articleshow/123018340.cms",
            "description": "Swiggy Q1 Results: Food delivery player Swiggy Ltd on Thursday reported widening of its net losses to Rs 1,197 crore in the first quarter of FY26, compared to Rs 611 crore in the year-ago period. Revenue from operations in the reporting period rose 54% YoY to Rs 4,961 crore.",
            "pubDate": "2025-07-31T13:50:31.156618"
        },
        {
            "title": "Maruti Suzuki Q1 Results: Cons PAT rises marginally to Rs 3,792 crore, revenue jumps 8% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q1-results-cons-pat-rises-marginally-to-rs-3792-crore-revenue-jumps-8-yoy/articleshow/123017213.cms",
            "description": "Maruti Suzuki Q1 Results: Maruti Suzuki India announced its Q1FY26 results. The company's consolidated net profit increased slightly to Rs 3,792 crore. Revenue from operations also rose to Rs 38,605 crore. Sales volume saw a marginal increase. However, operating EBIT declined due to adverse commodity prices and other factors. The company also faced expenses related to its new Kharkhoda plant.",
            "pubDate": "2025-07-31T13:50:31.156722"
        },
        {
            "title": "Adani Enterprises Q1 Results: Cons PAT plunges 45% YoY to Rs 976 crore; revenue drops 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-enterprises-q1-results-cons-pat-plunges-45-yoy-to-rs-976-crore-revenue-drops-14/articleshow/123016782.cms",
            "description": "Adani Enterprises Q1 Results FY26: Adani Enterprises experienced a 45% profit drop in the first quarter, reaching Rs 976.48 crore. Revenue also decreased by 13.7% to Rs 21,961.20 crore. Lower trade volumes and index price volatility impacted performance. However, incubating businesses saw a 5% EBITDA increase, driven by Airports and Roads segments. Navi Mumbai Airport and other projects are expected to contribute to future EBITDA.",
            "pubDate": "2025-07-31T13:50:31.156850"
        },
        {
            "title": "Vedanta Q1 Results: Cons PAT slides 12% YoY to Rs 3,185 crore, revenue rises 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-q1-results-cons-pat-slides-12-yoy-revenue-rises-6/articleshow/123016654.cms",
            "description": "Vedanta Q1 Results FY26: Mining major Vedanta on Thursday posted its first quarter results for FY26, reporting a 11.7% year-on-year (YoY) decline in its consolidated net profit to Rs 3,185 crore. However, the company’s revenue from operations rose by 5.75% YoY to Rs 37,824 crore, up from Rs 35,764 reported a year ago.",
            "pubDate": "2025-07-31T13:50:31.156960"
        },
        {
            "title": "Sun Pharma Q1 Results: Cons profit falls 20% YoY to Rs 2,278 crore, but revenue rises 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sun-pharma-q1-results-cons-profit-falls-20-yoy-to-rs-2278-crore-but-revenue-gains-10/articleshow/123016474.cms",
            "description": "Sun Pharma Q1 Results FY26: Sun Pharmaceutical Industries reported a 20% fall in Q1 consolidated net profit, reaching Rs 2,278 crore. Despite this dip, revenue from operations increased by 10% to Rs 13,786 crore. Strong performance in the India market and growth in global innovative medicines sales, including the U.S. launch of LEQSELVI, contributed to the company's overall progress.",
            "pubDate": "2025-07-31T13:50:31.157061"
        },
        {
            "title": "Ambuja Cements Q1 Results: Cons profit rises 24% YoY to Rs 970 crore, revenue jumps 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ambuja-cements-q1-results-cons-profit-rises-24-yoy-to-rs-970-crore-revenue-jumps-23/articleshow/123015440.cms",
            "description": "Ambuja Cements reported a robust 23.8% YoY increase in net profit, reaching Rs 969.66 crore for Q1 FY26, driven by a 23.45% surge in revenue from operations. The company's cement capacity is currently at 104.5 MTPA, with plans to expand to 118 MTPA by March 2026.",
            "pubDate": "2025-07-31T13:50:31.157154"
        },
        {
            "title": "TVS Motor Q1 Results: Cons PAT jumps 32% YoY to Rs 610 crore, revenue rises 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tvs-motor-q1-results-cons-pat-jumps-32-yoy-to-rs-610-crore-revenue-grows-18/articleshow/123015413.cms",
            "description": "TVS Motor Q1 Results: TVS Motor Company witnessed a strong Q1FY26, with consolidated net profit surging 32% YoY to Rs 610 crore and revenue from operations climbing 18% to Rs 12,210 crore. Standalone PAT also rose significantly by 35% to Rs 779 crore, accompanied by a 20% increase in standalone revenue to Rs 10,081 crore.",
            "pubDate": "2025-07-31T13:50:31.157250"
        },
        {
            "title": "HUL Q1 Results: Standalone PAT rises 8% YoY to Rs 2,732 crore, revenue up 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hul-q1-results-pat-rises-8-yoy-to-rs-2732-crore-revenue-up-4/articleshow/123010830.cms",
            "description": "HUL Q1 Results: Revenue from operations rose 3.8% to Rs 15,747 crore, compared to Rs 15,166 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-07-31T13:50:31.157346"
        },
        {
            "title": "Vedanta to announce Q1 results today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-to-announce-q1-results-today-heres-what-to-expect/articleshow/123009204.cms",
            "description": "Vedanta is projected to experience a sequential decrease in profitability for the April-June quarter of FY26, primarily due to declining commodity prices in its aluminium and zinc segments. Brokerages anticipate a 12-14% quarter-on-quarter drop in EBITDA, although cost reductions may partially mitigate the impact.",
            "pubDate": "2025-07-31T13:50:31.157441"
        },
        {
            "title": "Microsoft tops quarterly revenue estimates on strong Azure demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/microsoft-tops-quarterly-revenue-estimates-on-strong-azure-demand/articleshow/123009071.cms",
            "description": "Microsoft exceeded revenue expectations, fueled by strong demand for AI tools and Azure cloud services, with Azure revenue soaring by 39%. The company's shares jumped over 6% after the announcement. Azure's full-year revenue surpassed $75 billion, marking a significant milestone.",
            "pubDate": "2025-07-31T13:50:31.157536"
        }
    ]
}