{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-30T18:18:35.220569",
    "items": [
        {
            "title": "Two Trades for Today: A large-cap pharma firm for an over 6% gain, a mid-cap capital goods stock for close to 6% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-large-cap-pharma-firm-for-an-over-6-gain-a-mid-cap-capital-goods-stock-for-close-to-6-rise/articleshow/122164981.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-06-30T18:18:15.302407"
        },
        {
            "title": "Apollo Hospitals approves major restructuring plan; to list digital health, pharmacy arms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-hospitals-approves-major-restructuring-plans-to-list-digital-health-pharmacy-arms/articleshow/122164441.cms",
            "description": "Apollo Hospitals' board has approved a major restructuring involving the demerger and consolidation of its pharmacy and digital health units under Apollo Healthtech, which will be listed separately. The move aims to unlock value and enable shareholders to directly own a stake in the restructured Omni-Channel Pharmacy and Digital Health platform.",
            "pubDate": "2025-06-30T18:18:15.302526"
        },
        {
            "title": "Market Trading Guide: Bank of Baroda, Adani Green among 5 stocks to buy on Tuesday for near term gains up to 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-bank-of-baroda-adani-green-among-5-stocks-to-buy-on-tuesday-for-near-term-gains-up-to-6/slideshow/122164186.cms",
            "description": "India’s headline indices ended Monday in the red, breaking their four-session winning streak amid profit booking in auto and bank stocks. The Nifty index has formed a bearish engulfing pattern on the daily timeframe, indicating fatigue in the ongoing market rally. In the near term, the index may enter a phase of consolidation. Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities, said that the short-term trend is likely to remain sideways before any decisive directional move. “On the downside, a decisive fall below 25,500 could trigger a correction. On the upside, resistance is placed at 25,600 and 25,800,” he said.Here are 5 stock recommendations for Tuesday:",
            "pubDate": "2025-06-30T18:18:15.302633"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/122164225.cms",
            "description": "Stock market today: As the Nifty forms a bearish engulfing pattern, technical analysts suggest the market may enter a consolidation phase. While global cues remain supportive, domestic factors and earnings season are expected to shape short-term trends. Mid- and small-cap stocks showed resilience on expectations of stronger earnings and margin expansion.",
            "pubDate": "2025-06-30T18:18:15.302763"
        },
        {
            "title": "Astral banks on new plants, value-added products for growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/astral-banks-on-new-plants-value-added-products-for-growth/articleshow/122163962.cms",
            "description": "Astral share price: Astral expects robust revenue growth in FY26, supported by three new plants, expansion in value-added product lines, and a rebound in infrastructure demand. Despite a dip in net profit and EBITDA margin, its strong distribution network and strategic capex position it for long-term gains, analysts say.",
            "pubDate": "2025-06-30T18:18:15.302869"
        },
        {
            "title": "Sebi extends cybersecurity framework compliance deadline by 2 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-extends-cybersecurity-framework-compliance-deadline-by-2-months/articleshow/122163567.cms",
            "description": "Markets regulator Sebi on Monday extended the deadline by two months till August for regulated entities to adopt and implement the cybersecurity and cyber resilience framework.",
            "pubDate": "2025-06-30T18:18:15.302964"
        },
        {
            "title": "Hospital business, improving diagnostics segment to drive growth for Fortis Healthcare",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hospital-business-improving-diagnostics-segment-to-drive-growth-for-fortis-healthcare/articleshow/122163511.cms",
            "description": "Fortis Healthcare is poised for robust growth, driven by hospital expansion and a turnaround in its diagnostics business. With plans to add 900+ beds and expectations of 14–15% revenue growth in FY26, analysts remain bullish. Brownfield expansions and improving ARPOB are likely to support margin improvement and top-line growth.",
            "pubDate": "2025-06-30T18:18:15.303067"
        },
        {
            "title": "Sebi clears NPCI’s e-KYC Setu system for Aadhaar-based digital KYC by intermediaries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-clears-npcis-e-kyc-setu-system-for-aadhaar-based-digital-kyc-by-intermediaries/articleshow/122163382.cms",
            "description": "To make the KYC process easier, markets regulator Sebi on Monday said that registered intermediaries are allowed to use 'e-KYC Setu System' of National Payments Corporation of India (NPCI) to perform digital KYC.",
            "pubDate": "2025-06-30T18:18:15.303166"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/122163224.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-06-30T18:18:15.303258"
        },
        {
            "title": "S&P 500, Nasdaq at record highs as trade hopes feed quarterly momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-open-at-record-levels-on-trade-talk-hopes/articleshow/122162567.cms",
            "description": "The S&P 500 and Nasdaq reached new record highs, fueled by optimism surrounding potential U.S. trade deals. While the indexes are on track for quarterly gains, they still face their weakest first-half performance since 2022. Bank stocks surged following positive stress test results, and several companies experienced significant gains due to acquisitions and cloud service agreements.",
            "pubDate": "2025-06-30T18:18:15.303354"
        },
        {
            "title": "Two Sharp with ET: Reliance eyes Rosneft’s India stake | Smallcaps set for H2 Comeback?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-reliance-eyes-rosnefts-india-stake-smallcaps-set-for-h2-comeback/videoshow/122162124.cms",
            "description": "Reliance is in early talks to acquire Nayara Energy from Russia’s Rosneft, which is seeking to exit India amid pressure from sanctions. If the deal goes through, Reliance could surpass IOC as India’s top refiner and gain over 6,700 retail outlets. Meanwhile, smallcaps have bounced back sharply in Q2. With strong SIP flows, rate cuts, and FII interest, could they lead the market in the second half of 2025? All of this in today’s two sharp with Nisha Poddar.",
            "pubDate": "2025-06-30T18:18:15.303447"
        },
        {
            "title": "CLSA rates SBI ‘Outperform’ with Rs 1,050 target, citing value unlocking potential from unpriced NSE and Yes Bank stakes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/clsa-rates-sbi-outperform-with-rs-1050-target-citing-value-unlocking-potential-from-unpriced-nse-and-yes-bank-stakes/articleshow/122161495.cms",
            "description": "CLSA retained an ‘Outperform’ rating on SBI with a Rs 1,050 target, citing strong core metrics, steady loan growth, and potential value unlocking from stakes in NSE and Yes Bank. SBI’s consistent asset quality and market share gains support re-rating hopes despite modest stock performance.",
            "pubDate": "2025-06-30T18:18:15.303546"
        },
        {
            "title": "Breakout Stocks: How to trade City Union Bank, Karur Vysya Bank and Indigo that hit fresh 52-week highs?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-howtotrade-city-union-bankkarur-vysya-bankandindigothathit-fresh-52-week-highs/slideshow/122160519.cms",
            "description": "Indian market snapped a 4-day winning streak to close in the red on Monday. The BSE Sensex fell nearly 500 points while the Nifty50 closed below 25500.",
            "pubDate": "2025-06-30T18:18:15.303645"
        },
        {
            "title": "Stock Radar: A Cup & Handle pattern breakout pushed Gillette India stock to record highs; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-a-cup-handle-pattern-breakout-pushed-gillette-india-stock-to-record-highs-what-should-investors-do/articleshow/122115837.cms",
            "description": "Gillette India broke out from a Cup & Handle pattern in June 2025, reaching record highs. Experts suggest buying the stock with a target above 12,000 in 2-3 months. The stock consolidated between December 2024 and May 2025, gaining momentum thereafter, supported by Supertrend indicator buy signal and positive price action above key moving averages.",
            "pubDate": "2025-06-30T18:18:15.303763"
        },
        {
            "title": "Raymond Realty's debut sparks 15% rally in parent Raymond, 16% in lifestyle arm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/raymond-realtys-debut-sparks-15-rally-in-parent-raymond-16-in-lifestyle-arm/articleshow/122160126.cms",
            "description": "Shares of Raymond and its lifestyle arm rallied sharply on Tuesday ahead of the listing of Raymond Realty on Wednesday, following a recent demerger. Strong investor interest and high trading volumes signalled optimism around the real estate business. Brokerages expect value unlocking, citing strong growth potential and favourable valuation compared to listed peers.",
            "pubDate": "2025-06-30T18:18:15.303859"
        },
        {
            "title": "Will worst of perception be over in Q1 earning season? 9 IT stocks, probably best contrarian bets. Use a different way to be contrarian",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-worst-of-perception-be-over-in-q1-earning-season-9-it-stocks-probably-best-contrarian-bets-use-a-different-way-to-be-contrarian/articleshow/122159752.cms",
            "description": "Being contrarian. It is easier said than done because it is tough to go against the narrative. Let's look at a sector swamped by negative news. Soon it will be close to four years since IT stocks have been under pressure. And not for entirely wrong reasons. The bellwether companies have been painting a bleak picture of the prospects of their order books. So, how can the street be confident?  But remember: When it comes to projections, most IT companies tend to be cautious; and some have even stopped giving future guidance. The big question: Will Q1FY26 will change this? Maybe, maybe not. But if the perception changes, these stocks may witness a round of re-rating.",
            "pubDate": "2025-06-30T18:18:15.303952"
        }
    ]
}