{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-29T21:48:44.529331",
    "items": [
        {
            "title": "Quess Corp revenues up 14%, strong hiring in retail, telecom & GCCs pushes headcount up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/quess-corp-revenues-up-14-strong-hiring-in-retail-telecom-gccs-pushes-headcount-up/articleshow/117697189.cms",
            "description": "Business services provider Quess Corp on Wednesday reported Rs 5519 crore in revenues for the quarter ended December (Q3FY25), recording a 14% year-on-year (YoY) and 7% sequential growth.",
            "pubDate": "2025-01-29T21:48:26.284415"
        },
        {
            "title": "Tamilnad Mercantile Bank Q3 Results: Profit rises 6% to Rs 300 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tamilnad-mercantile-bank-q3-results-profit-rises-6-to-rs-300-crore/articleshow/117696181.cms",
            "description": "Private sector Tamilnad Mercantile Bank reported a 6% rise in third quarter net profit at Rs 300 crore against Rs 284 crore in the year ago quarter.",
            "pubDate": "2025-01-29T21:48:26.284545"
        },
        {
            "title": "Capital Small Finance Bank Q3 Results: Profit rises 17% YoY to Rs 34 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/capital-small-finance-bank-q3-results-profit-rises-17-yoy-to-rs-34-crore/articleshow/117696078.cms",
            "description": "Capital Small Finance Bank has reported a 17% rise in net profit at Rs 34 crore for the third quarter ending December 30, 2024 against Rs 29 crore in the year-ago quarter.",
            "pubDate": "2025-01-29T21:48:26.284648"
        },
        {
            "title": "Indian Bank Q3 Results: Profit surges 35% YoY to Rs 2,852 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-bank-q3-results-profit-surges-35-yoy-to-rs-2852-crore/articleshow/117695648.cms",
            "description": "State-owned Indian Bank has reported a 35% year-on-year rise in third quarter net profit at Rs 2852 crore, as against Rs 2119 crore in the year ago period, on account of higher earnings and lower provisions.",
            "pubDate": "2025-01-29T21:48:26.284747"
        },
        {
            "title": "Jupiter Wagons Q3 Results: Net profit rises 18% to Rs 96 crore on higher revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jupiter-wagons-q3-results-net-profit-rises-18-to-rs-96-crore-on-higher-revenue/articleshow/117692780.cms",
            "description": "Jupiter Wagons Ltd (JWL) reported an 18.4 per cent year-on-year (YoY) increase in consolidated net profit to Rs 96.4 crore for the quarter ended December 2024, driven by higher revenue and improved margins.",
            "pubDate": "2025-01-29T21:48:26.284839"
        },
        {
            "title": "Brigade Group Q3 Results: Profit jumps over 3X on robust sales, leasing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/brigade-group-q3-results-profit-jumps-over-3x-on-robust-sales-leasing/articleshow/117692558.cms",
            "description": "Brigade Group Q3 Results: Brigade Group reported a 3x increase in net profit to Rs 236 crore in Q3 FY25, driven by strong sales, leasing growth, and premium project launches, with revenue up 27% to Rs 1,530 crore.",
            "pubDate": "2025-01-29T21:48:26.284939"
        },
        {
            "title": "Embassy REIT records highest ever quarterly revenue and NOI for Q3 FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/embassy-reit-records-highest-ever-quarterly-revenue-and-noi-for-q3-fy25/articleshow/117692373.cms",
            "description": "Embassy REIT: Embassy Office Parks REIT reported record Q3 FY25 revenue and Net Operating Income (NOI), growing 9% YoY. Strong leasing demand, high occupancy rates, and cost-saving initiatives position the company for continued growth in India's dynamic office space market.",
            "pubDate": "2025-01-29T21:48:26.285029"
        },
        {
            "title": "Bajaj Finance Q3 Results: Cons PAT grows 17% YoY to Rs 4,247 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finance-q3-results-cons-pat-grows-17-yoy-to-rs-4247-crore-beats-estimates/articleshow/117687440.cms",
            "description": "Bajaj Finance Q3 Results: Bajaj Finance on Wednesday reported a 17% year-on-year growth in its December quarter consolidated net profit at Rs 4,247 crore versus Rs 3,639 crore posted in the year ago period. It is higher than ET Now poll of Rs 4,227 crore.",
            "pubDate": "2025-01-29T21:48:26.285125"
        },
        {
            "title": "Indian Bank Q3 net profit surges 35 pc to Rs 2,852 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-bank-q3-net-profit-surges-35-pc-to-rs-2852-cr/articleshow/117685368.cms",
            "description": "State-owned Indian Bank on Wednesday reported a 35 per cent increase in net profit at Rs 2,852 crore for the third quarter ended December 2024, helped by core income.",
            "pubDate": "2025-01-29T21:48:26.285225"
        },
        {
            "title": "Tata Motors Q3 Results: Profit falls 22% YoY to Rs 5,451 crore, misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-q3-results-profit-falls-22-yoy-to-rs-5451-crore-misses-estimates/articleshow/117685040.cms",
            "description": "Tata Motors Q3 Results: Profit fell short of ET Now's estimate of Rs 6,791 crore, while revenue rose 3% YoY to Rs 1.13 lakh crore. Consolidated EBITDA rose to Rs 15,500 crore, driven by easing supply challenges. CV revenues fell 8.4% YoY to Rs 18,400 crore, but EBITDA margins improved 130 bps to 12.4%, aided by lower commodity costs and PLI incentives.",
            "pubDate": "2025-01-29T21:48:26.285319"
        },
        {
            "title": "Tata Consumer Q3 preview: Topline to grow by up to 17% YoY. Tea business may hit profitability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-q3-preview-topline-to-grow-by-up-to-17-yoy-tea-business-may-hit-profitability/articleshow/117684790.cms",
            "description": "Tata Consumer Q3 Results: Tata Consumer Products is expected to post 15-17% revenue growth in Q3FY25, driven by strong domestic performance. However, rising tea prices may impact profitability, with brokerages predicting a YoY PAT decline. EBITDA margins are also expected to shrink.",
            "pubDate": "2025-01-29T21:48:26.285429"
        },
        {
            "title": "Adani Power Q3 Results: Cons PAT grows 7% YoY to Rs 2,940 crore, revenue up 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-power-q3-results-cons-pat-grows-7-yoy-to-rs-2940-crore-revenue-up-5/articleshow/117680652.cms",
            "description": "Adani Power Q3 Results: Revenue from operations rose 5% to Rs 13,671 crore from Rs 12,991 crore in the same quarter last year. The company announced earnings during market hours, driving shares up 5% to Rs 528 on the BSE. PAT declined 11% sequentially to Rs 3,298 crore in Q2FY25.",
            "pubDate": "2025-01-29T21:48:26.285527"
        },
        {
            "title": "Maruti Suzuki Q3 Results: PAT rises 13% YoY to Rs 3,525 crore, revenue advances 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q3-results-pat-rises-13-yoy-to-rs-3525-crore-revenue-advances-16/articleshow/117677040.cms",
            "description": "Maruti Suzuki Q3 Results:  Maruti Suzuki, India's leading carmaker, reported a 13% YoY growth in standalone net profit, reaching Rs 3,525 crore in Q3. The company saw a 16% YoY rise in revenue from operations to Rs 38,492 crore, with total vehicle sales of 566,213 units, marking its highest-ever export volume in any quarter.",
            "pubDate": "2025-01-29T21:48:26.285619"
        },
        {
            "title": "L&T Q3 Preview: Strong EPC performance to boost revenue and PAT growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-q3-preview-strong-epc-performance-to-boost-revenue-and-pat-growth/articleshow/117676340.cms",
            "description": "L&T Q3 Preview: L&T’s revenue from operations for the third quarter is expected to rise 20% YoY, while PAT is projected to grow 24% YoY, according to four brokerage estimates. Analysts anticipate a 24% YoY increase in core EPC revenues, with overseas execution offsetting domestic weakness. Key factors to watch include the domestic order pipeline, margin performance, and the working capital cycle.",
            "pubDate": "2025-01-29T21:48:26.285711"
        },
        {
            "title": "Ambuja Cement Q3 Results: Cons PAT skyrockets 157% YoY to Rs 2,115 crore, revenue rises 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ambuja-cement-q3-results-cons-pat-skyrockets-157-yoy-to-rs-2115-crore-revenue-rises-4/articleshow/117676081.cms",
            "description": "Ambuja Cement Q3 Results: Ambuja Cements reported a 157% increase in consolidated net profit for Q3 FY25, driven by significant volume growth and efficiency investments. Revenue from operations grew by 4.5%, with the company achieving its highest-ever cement sales volume in a quarter. The company remains debt-free with strong financial ratings.",
            "pubDate": "2025-01-29T21:48:26.285802"
        },
        {
            "title": "Starbucks' better-than-expected results point to turnaround taking root",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/starbucks-better-than-expected-results-point-to-turnaround-taking-root/articleshow/117664144.cms",
            "description": "Starbucks reported a smaller-than-expected fall in first-quarter comparable sales, signaling early benefits from CEO Brian Niccol's revival efforts. Niccol plans to simplify the U.S. menu, reduce wait times, and improve mobile ordering to reinvigorate the chain. The company is also restructuring its leadership team to enhance store operations.",
            "pubDate": "2025-01-29T21:48:26.285886"
        }
    ]
}