{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-11T21:36:29.822325",
    "items": [
        {
            "title": "DMart Q1 Results: Profit rises 2% YoY to Rs 830 crore, revenue up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dmart-q1-results-profit-rises-2-yoy-to-rs-830-crore-revenue-up-16/articleshow/122389767.cms",
            "description": "DMart Q1 Results: Avenue Supermarts, which operates retail chain DMart, reported a standalone net profit of Rs 830 crore in the first quarter of FY26. This was up just 2% from Rs 812 crore posted in the previous year quarter.",
            "pubDate": "2025-07-11T21:36:16.975719"
        },
        {
            "title": "Can TCS overcome short-term challenges to achieve its FY-26 growth targets?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-tcs-overcome-short-term-challenges-to-achieve-its-fy-26-growth-targets/articleshow/122376000.cms",
            "description": "Tata Consultancy Services missed analyst expectations for the June quarter. This was due to the BSNL deal ending. Net profit grew, helped by a one-time gain. Project ramp-ups faced delays. New deal wins increased to $9.4 billion. Headcount rose, but attrition also increased. Revenue fell slightly. Net profit increased due to one-time income.",
            "pubDate": "2025-07-11T21:36:16.975856"
        },
        {
            "title": "Dull loan growth, margin pressure, credit cost to weigh on bank earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dull-loan-growth-margin-pressure-credit-cost-to-weigh-on-bank-earnings/articleshow/122375836.cms",
            "description": "State Bank of India anticipates lackluster Q1 results due to margin dips and slow loan growth, while HDFC Bank projects a profit increase driven by core operating income. Overall, banks face challenges like muted loan growth and margin compression. Strong treasury gains may offer some cushion amidst weak earnings and rising pressure on margins across the sector.",
            "pubDate": "2025-07-11T21:36:16.975986"
        },
        {
            "title": "TCS Q1 Results: From PAT, revenue to dividend, here are 9 key takeaways",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q1-results-from-pat-revenue-to-dividend-here-are-9-key-takeaways/articleshow/122368254.cms",
            "description": "TCS posted a 6% YoY rise in Q1FY26 net profit to Rs 12,760 crore, with revenue up 1.3% despite macro challenges. Consumer, healthcare verticals lagged.",
            "pubDate": "2025-07-11T21:36:16.976093"
        },
        {
            "title": "Tata Elxsi Q1 Results: PAT plunges 22% YoY, revenue falls 3.7% on macroeconomic headwinds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-elxsi-q1-results-pat-plunges-22-yoy-revenue-falls-3-7-on-macroeconomic-headwinds/articleshow/122367653.cms",
            "description": "Tata Elxsi posted a 22% year-on-year fall in Q1FY26 net profit to ₹144 crore and a 3.7% drop in revenue due to macroeconomic headwinds and client-specific challenges.",
            "pubDate": "2025-07-11T21:36:16.976297"
        },
        {
            "title": "Avenue Supermarts Q1 Results Preview: DMart owner's PAT likely to rise by up to 8%, revenue may see 18% surge on store additions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/avenue-supermarts-q1-results-preview-pat-likely-to-rise-by-up-to-8-revenue-may-see-18-surge-on-store-additions/articleshow/122364925.cms",
            "description": "Avenue Supermarts, operating as DMart, is projected to reveal its Q1FY26 earnings on July 11, anticipating a 6-10% YoY bottom-line growth, potentially reaching Rs 817-892 crore. Revenue could surge 16-18% YoY, ranging from ₹15,932 crore to ₹16,348 crore.",
            "pubDate": "2025-07-11T21:36:16.976397"
        },
        {
            "title": "TCS Q1 Results FY26: Cons PAT up 6% YoY at Rs 12,760 crore; Rs 11 per share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q1-results-cons-pat-up-6-at-rs-12760-crore-rs-11-per-share-dividend-declared/articleshow/122364627.cms",
            "description": "TCS Q1 Results 2025: Indian IT bellwether Tata Consultancy Services (TCS) on Thursday reported a 6% growth in its Q1FY26 consolidated net profit at Rs 12,760 crore versus Rs 12,040 crore in the year ago period.",
            "pubDate": "2025-07-11T21:36:16.976497"
        },
        {
            "title": "TCS to announce Q1 results today: What to expect and 7 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-to-announce-q1-results-today-what-to-expect-and-7-things-to-watch-out-for/articleshow/122357622.cms",
            "description": "TCS is set to announce its Q1 results today amid weak demand and macro uncertainties. Brokerages expect a sequential revenue decline, mainly due to the BSNL project wind-down. The stock, down 18% in 2025 so far, traded flat ahead of the announcement. Analysts see continued headwinds for India’s top IT firm despite global market resilience.",
            "pubDate": "2025-07-11T21:36:16.976596"
        },
        {
            "title": "TCS expected to show marginal revenue growth in Q1 amid currency fluctuations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-expected-to-show-marginal-revenue-growth-amid-currency-fluctuations/articleshow/122353474.cms",
            "description": "Tata Consultancy Services is projected to reveal a slight increase in dollar-denominated revenue growth for the June quarter, outperforming the previous quarter. Supported by a weaker dollar against the pound and euro, revenue is expected to rise by 1.2%. However, rupee-term revenue growth may be slower due to rupee appreciation, with a modest net profit increase anticipated.",
            "pubDate": "2025-07-11T21:36:16.976695"
        },
        {
            "title": "TCS Q1 Results Preview: IT major may clock modest 3% profit growth; Trump tariffs impact in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q1-results-preview-it-major-may-clock-modest-3-profit-growth-trump-tariffs-impact-in-focus/articleshow/122337457.cms",
            "description": "Tata Consultancy Services (TCS) is set to announce Q1FY26 results on July 10, with brokerages estimating a 1-3% YoY net profit growth between Rs 12,040 crore and Rs 12,416 crore. Revenue is expected to rise 2.7-3.8% to Rs 62,613-64,993 crore. Nuvama offers the most conservative PAT forecast, while InCred is the most optimistic on both profit and revenue.",
            "pubDate": "2025-07-11T21:36:16.976790"
        },
        {
            "title": "Q1 results boom: 11 companies set to double profits with up to 2,500% surge. Own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q1-result-season-begins-this-week-11-companies-set-to-double-profits-own-any-of-these-stocks/articleshow/122333179.cms",
            "description": "The Q1 earnings season, which begins with TCS announcing numbers on July 10, is being seen as a crossover quarter, marking a transition from the low single-digit earnings growth seen in the early FY25 to a more sustained double-digit trajectory over the next four quarters. Oil marketing companies are leading this earnings recovery, with one firm, Paradeep Phosphates, anticipating gains exceeding 2,500%. HPCL is also expected to post significant growth, driven by improved refining margins and marketing performance.",
            "pubDate": "2025-07-11T21:36:16.976888"
        },
        {
            "title": "Nifty 50 companies to see 4.6% net profit growth amid mixed sector performance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nifty-50-companies-to-see-4-6-net-profit-growth-amid-mixed-sector-performance/articleshow/122307985.cms",
            "description": "Nifty 50 companies are projected to experience a modest 4.6% net profit increase and a 4.5% revenue rise for the June 2025 quarter, marking the first single-digit profit growth in nine quarters. Muted demand persists, impacting revenue growth for the fourth consecutive quarter.",
            "pubDate": "2025-07-11T21:36:16.977005"
        },
        {
            "title": "Nykaa eyes Q1 revenue growth in mid-20s, driven by broad-based segment strength",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-eyes-q1-revenue-growth-in-mid-20s-driven-by-broad-based-segment-strength/articleshow/122289869.cms",
            "description": "Nykaa anticipates revenue growth for the first quarter of fiscal year 2026. The growth is expected across all business segments. Despite geopolitical tensions impacting sales, the beauty vertical shows strong GMV growth. The fashion vertical is also projected to improve. FSN E-Commerce Ventures reported a significant increase in net profit for the previous quarter.",
            "pubDate": "2025-07-11T21:36:16.977101"
        }
    ]
}