{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-11T04:52:44.155524",
    "items": [
        {
            "title": "Adani Power shares in focus after Nagpur coal mine nod",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-in-focus-after-nagpur-coal-mine-nod/articleshow/123821087.cms",
            "description": "Adani Power is in focus after securing approval for an underground coal mine in Nagpur. This adds to investor excitement. The company also has a new hydroelectric project in Bhutan. Shareholders have approved Adani Power's first stock split. Analysts cite upcoming GST reforms as a potential boost. The stock is trading above key moving averages.",
            "pubDate": "2025-09-11T03:45:05.940577"
        },
        {
            "title": "Diwali rally watch: Is Trump the last piece of the puzzle for Nifty breakout?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-rally-watch-is-trump-the-last-piece-of-the-puzzle-for-nifty-breakout/articleshow/123821042.cms",
            "description": "Indian stock markets anticipate a potential breakout as Donald Trump signals a trade deal, potentially ending tariff standoffs. This, combined with expected earnings recovery in 2025, GST rate cuts, and anticipated Fed rate cuts, could trigger a significant Diwali rally. Analysts foresee positive impacts on BFSI, IT, and export-oriented sectors, potentially leading to substantial market gains.",
            "pubDate": "2025-09-11T03:45:05.940730"
        },
        {
            "title": "Poonawalla Fincorp, Divi's Labs among 7 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/poonawalla-fincorp-divis-labs-among-7-stocks-closed-crossing-above-vwap/slideshow/123820993.cms",
            "description": "On September 10, the closing prices of seven stocks in the Nifty500 pack rallied more than 1% above their VWAP (Volume Weighted Average Price). According to technical scan data from StockEdge, a close above the VWAP indicates a potential bullish trend.When the closing price rises above the VWAP, it means the stock closed higher than the average price at which it was traded throughout the day, with the average weighted by trading volume. Traders and investors often interpret this as a bullish signal, suggesting positive market sentiment.",
            "pubDate": "2025-09-11T03:45:05.940838"
        },
        {
            "title": "Oracle Financial Services, Trent among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-financial-services-trent-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123820707.cms",
            "description": "There was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as of September 10, as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-11T03:45:05.940941"
        },
        {
            "title": "At multi-year highs: Sundaram Finance, Cupid among 5 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-sundaram-finance-cupid-among-5-stocks-witness-5-year-swing-high-breakout/slideshow/123820619.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, five stocks witnessed a 5-year swing high at the close on September 10, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-11T03:45:05.941041"
        },
        {
            "title": "Bharat Electronics, SBI, HDFC Life among 8 Nifty stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-electronics-sbi-hdfc-life-among-8-nifty-stocks-showing-rsi-trending-up/slideshow/123820517.cms",
            "description": "Eight stocks from the the Nifty50 pack were highlighted in the RSI Trending Up scan on September 10, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-11T03:45:05.941140"
        },
        {
            "title": "Stocks to buy in 2025 for long term: HDFC Life, Berger Paints among 5 stocks that could give 17-26% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-hdfc-life-berger-paints-among-5-stocks-that-could-give-17-26-return/slideshow/123820411.cms",
            "description": "Brokerages remain upbeat on select stocks across insurance, healthcare, paints, and cement, highlighting strong growth prospects and attractive valuations.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-11T03:45:05.941233"
        },
        {
            "title": "Patanjali Foods shares in focus as stock turns ex-bonus for 2:1 issue on record date today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patanjali-foods-shares-in-focus-as-stock-turns-ex-bonus-for-21-issue-on-record-date-today/articleshow/123820229.cms",
            "description": "Patanjali Foods' shares turned ex-bonus on Thursday, September 11, following a 2:1 bonus issue. Shareholders who held the stock by Wednesday's close are eligible to receive two additional shares for each share owned. While the bonus issue expands holdings, the stock's performance has been mixed, with a year-long decline contrasting recent gains over the past three months.",
            "pubDate": "2025-09-11T03:45:05.941329"
        },
        {
            "title": "Dividend alert: Cochin Shipyard, GRSE among over 80 stocks in focus as they approach record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-alert-cochin-shipyard-grse-among-over-80-stocks-in-focus-as-they-approach-record-date/articleshow/123820213.cms",
            "description": "Cochin Shipyard and GRSE shares are in focus as today is the last day to buy them to qualify for dividends. The record date is September 12, 2025. Cochin Shipyard declared a 45% final dividend at Rs 2.25 per share, while GRSE announced a 49% final dividend at Rs 4.9 per share.",
            "pubDate": "2025-09-11T03:45:05.941423"
        },
        {
            "title": "Positive Breakout: These 9 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-close-cross-above-their-200-dmas/slideshow/123820202.cms",
            "description": "The closing prices of nine stocks from the Nifty200 pack crossed above their 200 DMA (Daily Moving Averages) on September 10, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-11T03:45:05.941516"
        },
        {
            "title": "JSW Cement shares in focus as 37 mn shares become free to trade. What lock-in expiry means for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-cement-shares-in-focus-as-37-mn-shares-become-free-to-trade-what-lock-in-expiry-means-for-investors/articleshow/123820150.cms",
            "description": "Attention traders! 37 million JSW Cement shares, representing 3% of equity and valued at $62 million, become available for trading today as the one-month shareholder lock-in period expires. This event, the largest among peers this month, is expected to increase liquidity but could also create downward pressure if investors choose to sell.",
            "pubDate": "2025-09-11T03:45:05.941609"
        },
        {
            "title": "Infosys shares in focus ahead of board meeting to approve share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-ahead-of-board-meeting-to-approve-share-buyback/articleshow/123820089.cms",
            "description": "Infosys board will meet today to discuss a share buyback. This comes as Infosys stock has not performed well. The stock has fallen nearly 25% in the past year. Investors are watching to see if the buyback will be a tender offer or open market. This would be Infosys' fifth buyback. FII selling has also impacted Indian IT stocks.",
            "pubDate": "2025-09-11T03:45:05.941724"
        },
        {
            "title": "S&P 500 and Nasdaq notch record-high closes as Oracle soars on AI optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-and-nasdaq-notch-record-high-closes-as-oracle-soars-on-ai-optimism/articleshow/123819869.cms",
            "description": "The S&P 500 and Nasdaq achieved record highs, fueled by Oracle's surge due to AI demand and encouraging inflation data, bolstering expectations of Federal Reserve interest rate cuts. AI-related chip stocks also rallied, while Apple declined. Investors are now awaiting consumer prices data for further inflation insights.",
            "pubDate": "2025-09-11T03:45:05.941823"
        },
        {
            "title": "SMC Global’s Shitij Gandhi: Accumulate Dr. Reddy’s for targets of Rs 1,360–1,365",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smc-globals-shitij-gandhi-accumulate-dr-reddys-for-targets-of-rs-13601365/videoshow/123813000.cms",
            "description": "“After weeks of consolidation, Dr. Reddy’s Laboratories' stock has delivered a strong technical breakout on the daily charts. Traders can buy for a target of Rs 1360 in the next 5-7 weeks,” Shitij Gandhi, Senior Technical Analyst, SMC Global Securities, said.",
            "pubDate": "2025-09-11T03:45:05.941916"
        },
        {
            "title": "Asian shares steady as US stocks climb on Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-steady-as-us-stocks-climb-into-cpi/articleshow/123819531.cms",
            "description": "Asian equities displayed mixed performance following Wall Street's rally, fueled by hopes of Federal Reserve rate cuts after a drop in producer prices. US futures saw slight gains as the S&P 500 reached a new record.",
            "pubDate": "2025-09-11T03:45:05.942007"
        },
        {
            "title": "IT stocks surge as Trump signals progress in US-India trade talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-surge-as-trump-signals-progress-in-us-india-trade-talks/articleshow/123819481.cms",
            "description": "IT stocks surged following positive comments from Donald Trump regarding US-India trade negotiations, easing concerns about potential tariffs. Optimism surrounding a possible US Federal Reserve rate cut and Infosys' share buyback further fueled the rally. Investors are anticipating more buybacks from other IT companies, contributing to the sector's positive momentum.",
            "pubDate": "2025-09-11T03:45:05.942101"
        },
        {
            "title": "Consumption will drive growth, not investments: Indranil Pan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/consumption-will-drive-growth-not-investments-indranil-pan/articleshow/123821826.cms",
            "description": "Fitch raised India’s FY26 GDP forecast to 6.9% on strong demand, GST changes, and potential rate cuts, while Yes Bank slightly increased its forecast to 6.6%. However, global trade tensions, crop damage, and weak urban consumption pose risks to growth.",
            "pubDate": "2025-09-11T04:52:29.023332"
        },
        {
            "title": "Urban Company IPO Day 2: Issue gets subscribed over 300%, GMP jumps 34%; Should you subscribe?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-ipo-day-2-issue-gets-subscribed-over-300-gmp-jumps-34-should-you-subscribe/articleshow/123821806.cms",
            "description": "Urban Company’s ₹1,900 crore IPO is seeing strong traction, with 3.13x subscription on Day 1 and a 34% GMP. Analysts view valuations as fully priced but recommend long-term subscription, citing strong brand equity, rapid growth, and leadership in India’s home services market.",
            "pubDate": "2025-09-11T04:52:29.023454"
        },
        {
            "title": "​Global bond markets wobble as debt concerns rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-bond-markets-wobble-as-debt-concerns-rise/slideshow/123821931.cms",
            "description": "Investor concern is rising as some of the world’s largest economies face increasing bond market stress. Many believe governments are not doing enough to reduce their high debt levels. Guy Miller, chief market strategist at Zurich Insurance Group, warns, “Government debt levels are simply too high and not enough has been done to tackle them.” (Source: Reuters)",
            "pubDate": "2025-09-11T04:52:29.023582"
        },
        {
            "title": "Patanjali Foods shares crash 67%! But that's just optical",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patanjali-foods-shares-crash-67-but-thats-just-optical/articleshow/123821759.cms",
            "description": "Patanjali Foods shares fell 66.7% on Thursday as the stock turned ex-bonus following a 2:1 bonus issue. The decline is a technical adjustment, with shareholder value and market capitalization unchanged. Investors now hold three shares instead of one, at a proportionally lower price. The move aims to boost liquidity and broaden retail participation.",
            "pubDate": "2025-09-11T04:52:29.023688"
        },
        {
            "title": "Reliance Industries shares in focus after new AI unit launch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-after-new-ai-unit-launch/articleshow/123821601.cms",
            "description": "Reliance Industries has launched Reliance Intelligence, a wholly-owned subsidiary, to spearhead its AI ambitions in India. This move, announced after market hours with RIL shares closing positively, follows Mukesh Ambani's vision to transform RIL into a deep-tech enterprise.",
            "pubDate": "2025-09-11T04:52:29.023788"
        },
        {
            "title": "Tata Motors shares in focus after JLR faces cybersecurity breach",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-after-jlr-faces-cybersecurity-breach/articleshow/123821561.cms",
            "description": "Tata Motors share price: Jaguar Land Rover, Tata Motors' British subsidiary, suffered a cybersecurity breach, causing production and sales delays. The incident adds to ongoing challenges, including slowing demand, launch delays, and a 63% decline in Q1 consolidated net profit.",
            "pubDate": "2025-09-11T04:52:29.023887"
        },
        {
            "title": "Buy, Sell or Hold: Nomura sees about 30% upside in GAIL India; Motilal Oswal recommends a buy call on Coal India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nomura-sees-about-30-upside-in-gail-india-motilal-oswal-recommends-a-buy-call-on-coal-india/articleshow/123821396.cms",
            "description": "Nomura backs GAIL India on tariff hike, petrochemical recovery; Motilal Oswal bullish on Cummins India’s demand outlook and Coal India’s long-term dominance despite near-term earnings pressure. Targets: Rs 225, Rs 4,500, Rs 450.",
            "pubDate": "2025-09-11T04:52:29.023983"
        },
        {
            "title": "Dr Reddy’s shares slip nearly 2% on investor concerns amid $50 million foray into anti-vertigo category",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-shares-in-focus-after-50-million-acquisition-for-entry-in-anti-vertigo-category/articleshow/123821403.cms",
            "description": "Dr. Reddy's Laboratories' shares experienced a slight dip following the announcement of their acquisition of Stugeron from Johnson & Johnson for $50.5 million. This strategic move aims to bolster Dr. Reddy's Central Nervous System portfolio and expand its presence in the anti-vertigo market across 18 markets in APAC and EMEA, with a focus on India and Vietnam.",
            "pubDate": "2025-09-11T04:52:29.024074"
        },
        {
            "title": "Sensex rises over 50 pts, Nifty50 above 24,950 on U.S.-India trade talk hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-100-pts-nifty-50-tops-25000-on-u-s-india-trade-talk-hopes/articleshow/123821267.cms",
            "description": "Indian stocks began trading on a positive note Thursday, marking the Nifty 50's seventh consecutive session of gains. This surge followed U.S. President Donald Trump's announcement of planned discussions with Prime Minister Narendra Modi to address trade tensions. The S&P BSE Sensex rose by 0.13%, while the NSE Nifty 50 increased by 0.",
            "pubDate": "2025-09-11T04:52:29.024171"
        },
        {
            "title": "Kotak Mahindra Bank shares in focus as Sumitomo exits with Rs 6,256 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-as-sumitomo-exits-with-rs-6256-crore-block-deal/articleshow/123821340.cms",
            "description": "Kotak Mahindra Bank shares: SMBC sold its entire 1.65% stake in Kotak Mahindra Bank for ₹6,256 crore through block deals, with major global and domestic investors like BlackRock, Goldman Sachs, and Abu Dhabi Investment Authority participating.",
            "pubDate": "2025-09-11T04:52:29.024269"
        },
        {
            "title": "Infosys to announce billion-dollar share buyback plan today. What to expect and will the stock rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-to-announce-billion-dollar-share-buyback-plan-today-what-to-expect-and-will-the-stock-rally/articleshow/123821195.cms",
            "description": "Infosys is set to announce a Rs 10,000–15,000 crore share buyback today, its fifth since listing. Analysts see potential short-term support and EPS boost, while Infosys' share price's 25% year-long decline and attractive valuations make this buyback closely watched by investors.",
            "pubDate": "2025-09-11T04:52:29.024365"
        },
        {
            "title": "Titan, Astral among 5 stocks where foreign brokerages see up to 25% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-astral-among-5-stocks-where-foreign-brokerages-see-up-to-25-upside/slideshow/123821145.cms",
            "description": "Global brokerages have recently initiated coverage on several Indian companies across consumer, financials, and industrials, spotting potential upsides of up to 25%. Here are the five stocks in focus.",
            "pubDate": "2025-09-11T04:52:29.024458"
        }
    ]
}