{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-21T19:20:15.060291",
    "items": [
        {
            "title": "India Cements Q3 Results: Net profit at Rs 116.52 cr boosted by sale of investments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-cements-q3-results-net-profit-at-rs-116-52-cr-boosted-by-sale-of-investments/articleshow/117432399.cms",
            "description": "India Cements Ltd on Tuesday reported a consolidated net profit of Rs 116.52 crore in the third quarter ended on December 31, 2024, boosted by the sale of investments.",
            "pubDate": "2025-01-21T19:19:57.335460"
        },
        {
            "title": "ICICI Prudential Q3 results: Cons PAT jumps 43% YoY to Rs 325 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-prudential-q3-results-cons-pat-jumps-43-yoy-to-rs-325-crore/articleshow/117432379.cms",
            "description": "ICICI Prudential Life Insurance reported a 43% YoY net profit rise to ₹325 crore in Q3FY25, with net premium income growing 23% to ₹12,261 crore, driven by strong single premium performance.",
            "pubDate": "2025-01-21T19:19:57.335589"
        },
        {
            "title": "South Indian Bank Q3 Results: PAT rises 12% YoY to Rs 341 crore, NII up 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/south-indian-bank-q3-results-pat-rises-12-yoy-to-rs-341-crore-nii-up-6/articleshow/117432331.cms",
            "description": "South Indian Bank on Tuesday reported a 12 per cent increase in its December quarter net profit to Rs 341.87 crore. The lender had reported a net profit of Rs 305.36 crore in the year-ago period.",
            "pubDate": "2025-01-21T19:19:57.335716"
        },
        {
            "title": "PNB Housing Finance Q3 Results: Net profit jumps 43% YoY to Rs 483 crore on strong home loan demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-housing-finance-q3-results-net-profit-jumps-43-yoy-to-rs-483-crore-on-strong-home-loan-demand/articleshow/117431845.cms",
            "description": "PNB Housing Finance on Tuesday reported a 43 per cent jump in net profit to Rs 483 crore for the December quarter. The non-banking finance company, promoted by Punjab National Bank, had earned Rs 338 crore in the same quarter a year ago.",
            "pubDate": "2025-01-21T19:19:57.335826"
        },
        {
            "title": "Dalmia Bharat Q3 Results: Profit slumps over 75% to Rs 66 crore on weak cement prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dalmia-bharat-q3-results-profit-slumps-over-75-to-rs-66-crore-on-weak-cement-prices/articleshow/117431567.cms",
            "description": "Dalmia Bharat's Q3 profit plummeted 75% YoY to ₹66 crore, driven by weak cement prices and demand, despite lower raw material and logistics costs. Revenue fell 12%, with margins contracting significantly.",
            "pubDate": "2025-01-21T19:19:57.335928"
        },
        {
            "title": "3M Q4 Results: Company posts profit above estimates on strong demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/3m-q4-results-company-posts-profit-above-estimates-on-strong-demand/articleshow/117430818.cms",
            "description": "U.S. industrial conglomerate 3M Co on Tuesday reported fourth-quarter adjusted profit above estimates as demand for industrial adhesives, tapes and electronics picked up, sending its shares more than 5% higher in premarket trade.",
            "pubDate": "2025-01-21T19:19:57.336027"
        },
        {
            "title": "UCO Bank Q3 Results: Profit jumps 27% to Rs 639 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/uco-bank-q3-results-profit-jumps-27-to-rs-639-crore/articleshow/117430336.cms",
            "description": "UCO Bank reported a 27% YoY rise in Q3FY24 net profit to ₹639 crore, driven by improved asset quality, higher operating profit, and a 20% increase in net interest income.",
            "pubDate": "2025-01-21T19:19:57.336128"
        },
        {
            "title": "IndiaMart Intermesh Q3 Results: PAT jumps 36% YoY to Rs 125 crore, revenue rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indiamart-intermesh-q3-results-pat-jumps-36-yoy-to-rs-125-crore-revenue-rises-16/articleshow/117427905.cms",
            "description": "IndiaMart Q3 Results: Sequentially, the company’s revenue increased by 1.6% to Rs 337 crore from Rs 332 crore in Q2FY25, while profit after tax fell by 1.6% from Rs 127 crore. Total expenses dropped to Rs 199 crore in Q3FY25, compared to Rs 218 crore in Q2FY25 and Rs 211 crore in Q3FY24, including employee benefits, finance costs, and other expenses.",
            "pubDate": "2025-01-21T19:19:57.336251"
        },
        {
            "title": "Tata Technologies Q3 Results: Cons PAT falls marginally YoY to Rs 169 crore, revenue up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-tech-q3-results-cons-pat-falls-marginally-yoy-to-rs-169-crore-revenue-up-2/articleshow/117426648.cms",
            "description": "Tata Tech Q3 Results:  Q3FY25 revenue from operations rose 2% to Rs 1,317 crore, compared to Rs 1,289 crore in the same quarter last year. On a sequential basis, the profit after tax (PAT) grew 7% as against Rs 157 crore posted in Q2FY25. Meanwhile, the topline increased 1.6% versus 1,296 crore in the July-September quarter.",
            "pubDate": "2025-01-21T19:19:57.336351"
        },
        {
            "title": "HUL Q3 Preview: Weak urban demand continues to weigh on earnings as PAT, revenue seen muted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hul-q3-preview-weak-urban-demand-continues-to-weigh-on-earnings-as-pat-revenue-seen-muted/articleshow/117420062.cms",
            "description": "Hindustan Unilever Ltd (HUL) is expected to report subdued Q3 earnings for December 2024 due to weak urban demand, despite gradual rural recovery. Revenues are projected to grow by 2% YoY with a 3% rise in PAT. Analysts anticipate a 1% underlying volume growth, affected by price hikes in soaps and tea.",
            "pubDate": "2025-01-21T19:19:57.336455"
        },
        {
            "title": "HDFC Bank Q3 results preview: NII likely to rise by up to 8.4% YoY, NIMs may remain flat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q3-results-preview-nii-likely-to-rise-by-up-to-8-4-yoy-nims-may-remain-flat/articleshow/117417472.cms",
            "description": "HDFC Bank's December quarter NII is anticipated to grow by 7-8.4% YoY, with net profit projected between Rs 15,873 crore and Rs 17,232 crore. While brokerages foresee NIMs remaining flat, key monitorables include deposit growth, seasonal stress in the agri book, and asset quality stability.",
            "pubDate": "2025-01-21T19:19:57.336552"
        },
        {
            "title": "Tata Technologies will announce its Q3 results today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-technologies-will-announce-its-q3-results-today-heres-what-to-expect/articleshow/117411443.cms",
            "description": "Tata Technologies is anticipated to report subdued third quarter results with marginal revenue growth of around 0.3%, but an 8% decline in net profit to Rs 157 crore. The company’s revenue from the services segment faces headwinds from auto sector weakness and reduced client spending despite a healthy order book.",
            "pubDate": "2025-01-21T19:19:57.336697"
        },
        {
            "title": "Q3 results today: Tata Technologies among 31 companies to announce earnings on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-tata-technologies-among-31-companies-to-announce-earnings-on-tuesday/articleshow/117411259.cms",
            "description": "Approximately 31 companies will announce their Q3 results, including Tata Technologies, ICICI Prudential Life, and Indiamart. Tata Technologies is expected to report marginal revenue growth and a dip in net profit. Key focus areas include medium-term client spends, Airbus engagements, and technology solutions segment outlook. Investors will closely watch for updates on these aspects.",
            "pubDate": "2025-01-21T19:19:57.336795"
        },
        {
            "title": "J&K Bank Q3 Results: Profit jumps 26% to Rs 532 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jk-bank-q3-results-profit-jumps-26-to-rs-532-crore/articleshow/117403498.cms",
            "description": "J&K Bank's Q3 net profit rose 26% YoY to ₹532 crore, driven by higher net interest income and improved asset quality. Gross NPA declined to 4.08%, reflecting operational efficiency.",
            "pubDate": "2025-01-21T19:19:57.336885"
        },
        {
            "title": "IOB plans to dilute govt's stake by up to 2.5% to raise Rs 2,000 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/iob-plans-to-dilute-govts-stake-by-up-to-2-5-to-raise-rs-2000-crore/articleshow/117401200.cms",
            "description": "Indian Overseas Bank plans to raise ₹2,000 crore by selling shares to institutional investors, reducing government stake. Q3FY24 net profit rose 21% YoY to ₹874 crore, driven by strong income growth.",
            "pubDate": "2025-01-21T19:19:57.336979"
        },
        {
            "title": "MRPL Q3 Results: Net profit drops 21% YoY to Rs 309 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mrpl-q3-results-net-profit-drops-21-yoy-to-rs-309-crore/articleshow/117400506.cms",
            "description": "Mangalore Refinery and Petrochemicals Ltd (MRPL) on Monday reported a 21 per cent drop in its third-quarter net profit as revenues slid, negating a rise in refinery margins.",
            "pubDate": "2025-01-21T19:19:57.337071"
        }
    ]
}