{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-16T13:54:28.868457",
    "items": [
        {
            "title": "Reliance Industries Q2 results preview: O2C, Jio to power 11% profit growth; retail seen lagging",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q2-results-preview-o2c-jio-to-power-11-profit-growth-retail-seen-lagging/articleshow/124595484.cms",
            "description": "Reliance Industries is poised for an 11% year-on-year profit increase in Q2FY26, driven by strong performance in its Oil-to-Chemicals and telecom segments. While retail growth is expected to moderate slightly, Jio's subscriber momentum and ARPU uptick will sustain its steady growth trajectory.",
            "pubDate": "2025-10-16T05:13:34.267367"
        },
        {
            "title": "Jio Financial Q2 results today: Shares in bullish setup with potential 9% upside. 5 key things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q2-results-today-shares-in-bullish-setup-with-potential-9-upside-5-key-things-to-track/articleshow/124595383.cms",
            "description": "Jio Financial Services shares are gaining momentum. Analysts expect strong Q2 FY26 results. The stock is consolidating above Rs 300-Rs 310. Investors will watch profit and revenue growth. Consumer business performance and the BlackRock partnership are key. Technically, the stock is in a bullish setup.",
            "pubDate": "2025-10-16T05:13:34.267484"
        },
        {
            "title": "Angel One shares rally 4% as Q2 profit soars 85% QoQ to Rs 212 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/angel-one-shares-in-focus-as-q2-profit-slumps-50-yoy-to-rs-212-crore/articleshow/124594789.cms",
            "description": "In a surprising turn of events, Angel One's shares soared following a report of sequential profit growth. Nonetheless, their year-on-year earnings took a hit, largely influenced by new regulations that have transformed the landscape of derivatives trading.",
            "pubDate": "2025-10-16T05:13:34.267587"
        },
        {
            "title": "GST impact caps HDFC Life’s Q2 profit growth at 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gst-impact-weighs-on-hdfc-lifes-q2-profit-growth-up-3/articleshow/124594440.cms",
            "description": "HDFC Life Insurance saw a profit rise of 3.27% in the July-September quarter of FY26. Net premium income grew over 13%. A one-time GST impact affected profits. The company expects this drag to fade by year-end. Management expenses increased. Persistency rates saw a decline. HDFC Life plans to raise Rs 750 crore to boost its solvency ratio.",
            "pubDate": "2025-10-16T05:13:34.267688"
        },
        {
            "title": "Nuvoco Vistas reports strong Q2 performance with 62% EBITDA surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nuvoco-vistas-reports-strong-q2-performance-with-62-ebitda-surge/articleshow/124592992.cms",
            "description": "Nuvoco Vistas reported a profit of Rs 36.43 crore for the September quarter. This marks a significant turnaround from a loss in the same period last year. The company's earnings before interest, tax, depreciation, and amortisation surged by 62%. Revenue also saw an 8% year-on-year increase. Nuvoco Vistas is expanding its production capacity to 35 million tonnes by FY27.",
            "pubDate": "2025-10-16T05:13:34.267800"
        },
        {
            "title": "Axis Bank reports 26% drop in Q2 net profit amid one-time provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-reports-26-drop-in-q2-net-profit-amid-one-time-provisions/articleshow/124592933.cms",
            "description": "Axis Bank reported a 26% drop in September-quarter net profit to ₹5,090 crore, primarily due to a one-time ₹1,231 crore standard asset provision for discontinued crop loan variants. Despite this, net interest income rose 2% year-on-year to ₹13,745 crore, with the bank optimistic about GST cuts and retail loan growth.",
            "pubDate": "2025-10-16T05:13:34.267912"
        },
        {
            "title": "Nestle India Q2 Results: Cons PAT declines 17% YoY to Rs 743 crore,  but revenue rises 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-india-q2-results-standalone-pat-declines-24-yoy-to-rs-753-crore-but-revenue-rises-10/articleshow/124597433.cms",
            "description": "Nestle India Q2 Results: ​​The revenue for Q2 FY26 stood at Rs 5,643.61 crore, compared with Rs 5,104 crore in the same quarter of the previous financial year.",
            "pubDate": "2025-10-16T06:56:50.087188"
        },
        {
            "title": "Jio Financial Q2 Results: Cons PAT up marginally YoY at Rs 695 crore, revenue surges 41%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q2-results-cons-pat-up-marginally-yoy-at-rs-695-crore-revenue-surges-41/articleshow/124606259.cms",
            "description": "Jio Financial Q2 Results: Jio Financial Services on Thursday reported a 0.9% YoY growth in its consolidated Q2 net profit at Rs 695 crore versus Rs 689 crore in the year ago period.",
            "pubDate": "2025-10-16T13:54:20.635485"
        },
        {
            "title": "Cyient Q2 profit drops 40% YoY amid wage hikes, seasonal headwinds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cyient-q2-profit-drops-40-yoy-amid-wage-hikes-seasonal-headwinds/articleshow/124605995.cms",
            "description": "India' Cyient on Thursday reported a nearly 40% fall in profit, as a higher wage bill in a seasonally tough quarter weighed on the engineering research and development firm.",
            "pubDate": "2025-10-16T13:54:20.635612"
        },
        {
            "title": "LTIMindtree Q2 Results: Cons PAT jumps 12% YoY to Rs 1,401 crore, revenue up 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ltimindtree-q2-results-cons-pat-jumps-12-yoy-to-rs-1401-crore-revenue-up-10/articleshow/124605133.cms",
            "description": "LTIMindtree reported a 12% year-on-year jump in consolidated Q2 net profit to Rs 1,401 crore, with revenue rising 10% to Rs 10,394 crore. The IT firm also declared a Rs 22 per share dividend.",
            "pubDate": "2025-10-16T13:54:20.635727"
        },
        {
            "title": "Infosys Q2 Results: Profit jumps 13% YoY to Rs 7,364 crore, revenue up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q2-results-profit-jumps-13-yoy-to-rs-7364-crore-revenue-up-9/articleshow/124602906.cms",
            "description": "Infosys Q2 Results: Infosys announced strong financial results for the second quarter of FY26. Net profit saw a 13% year-on-year increase to Rs 7,364 crore. Revenue from operations grew by 9% to Rs 44,490 crore. The company also declared an interim dividend of Rs 23 per share. Infosys revised its FY26 revenue guidance upwards.",
            "pubDate": "2025-10-16T13:54:20.635836"
        },
        {
            "title": "Wipro Q2 Results: Cons PAT rises 1.2% YoY to Rs 3,246 crore, misses Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q2-results-cons-pat-rises-1-2-yoy-to-rs-3246-crore-misses-street-estimates/articleshow/124602269.cms",
            "description": "Wipro Q2 Results: The company's revenue from operations in the quarter stood at Rs 22,697 crore, up 1.8% from Rs 22,302 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-10-16T13:54:20.635938"
        },
        {
            "title": "Zee Entertainment Q2 Results: Cons net profit falls 63% YoY to Rs 76 crore, revenue down 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zee-entertainment-q2-results-cons-net-profit-falls-63-yoy-to-rs-76-crore-revenue-down-2/articleshow/124601553.cms",
            "description": "Zee Entertainment Q2 Results: Zee Entertainment Enterprises saw its second-quarter net profit drop by 63 percent. Revenue also declined due to slower ad spending and a weak linear TV market. Advertising revenue fell 12 percent. Subscription revenue saw modest growth. Expenses increased, impacting margins. The company noted a soft domestic ad environment but anticipates a near-term pick-up from the festive season.",
            "pubDate": "2025-10-16T13:54:20.636038"
        },
        {
            "title": "Eternal Q2 Results: Zomato parent's PAT plunges 63% YoY to Rs 65 crore, but revenue soars 183%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-q2-results-zomato-parents-pat-plunges-63-yoy-to-rs-65-crore-but-revenue-soars-183/articleshow/124601077.cms",
            "description": "Eternal Q2 Results:  Food delivery giant Eternal witnessed a significant 63% drop in net profit to Rs 65 crore for the September quarter, falling short of market expectations. Despite this, revenue surged by an impressive 183% year-on-year to Rs 13,590 crore. The company's strong topline growth, up 90% sequentially, pleased investors, pushing its stock to a new 52-week high.",
            "pubDate": "2025-10-16T13:54:20.636142"
        }
    ]
}