{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-25T06:46:42.285424",
    "items": [
        {
            "title": "Japan's Nikkei posts weekly fall amid domestic election jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-posts-weekly-fall-amid-domestic-election-jitters/articleshow/114573368.cms",
            "description": "Japan’s Nikkei average falls for the second straight week, ending 0.6% lower amid fears of the ruling party losing its majority in the upcoming election. Market volatility increases with broad declines; all 33 industry sectors close in the red led by the shipping sector.",
            "pubDate": "2024-10-25T06:46:21.169886"
        },
        {
            "title": "Nippon Life India AMC shares surge 10% post Q2 results, interim dividend announcement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nippon-life-india-amc-shares-surge-10-post-q2-results-interim-dividend-announcement/articleshow/114572166.cms",
            "description": "Nippon Life India Asset Management's shares jumped 10% after reporting a 47% rise in Q2 profit. An interim dividend of Rs 8 per share was also announced.",
            "pubDate": "2024-10-25T06:46:21.169997"
        },
        {
            "title": "Shriram Finance, BHEL among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-bhel-among-5-stocks-with-short-buildup/slideshow/114571526.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of the underlying stock in the Futures and Options segment. This indicates that more traders are expecting the prices to decline and are creating short positions. In Friday's trading session, five stocks saw fresh short positions being built. Here's the list:",
            "pubDate": "2024-10-25T06:46:21.170096"
        },
        {
            "title": "Dixon Technologies shares dip 10% despite 265% YoY jump in Q2 profit. What analysts say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-shares-dip-10-despite-265-yoy-jump-in-q2-profit-what-analysts-say/articleshow/114571864.cms",
            "description": "Shares of Dixon Technologies fell 9.7% to Rs 13,601.30 on the BSE after reaching a new all-time high of Rs 15,999.95. Despite this drop, the company reported a 265% year-on-year increase in Q2 PAT to Rs 412 crore, driven by higher mobile phone production and a one-time gain of Rs 209.6 crore.",
            "pubDate": "2024-10-25T06:46:21.170199"
        },
        {
            "title": "Godavari Biorefineries IPO subscribed 66% on Day 3 so far, GMP down to 4%. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godavari-biorefineries-ipo-subscribed-66-on-day-3-so-far-gmp-down-to-4-check-details/articleshow/114571652.cms",
            "description": "Godavari Biorefineries' IPO sees muted demand, with 66% subscription. Retail investors lead at 1.17 times, while analysts express caution due to significant debt and high valuations.",
            "pubDate": "2024-10-25T06:46:21.170294"
        },
        {
            "title": "ITC, Godrej Consumer Products among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-godrej-consumer-products-among-5-stocks-with-long-buildup/slideshow/114571412.cms",
            "description": "A long buildup occurs when open interest and trading volumes increase alongside a rise in the underlying stock price in the Futures and Options segment, signaling a bullish market trend. In Friday's trading session, five stocks saw fresh long positions. Here’s the list:",
            "pubDate": "2024-10-25T06:46:21.170387"
        },
        {
            "title": "IREDA, RVNL among 12 midcap multibaggers since last Diwali. 10 gems for next Samvat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ireda-rvnl-among-12-midcap-multibaggers-since-last-diwali-10-gems-for-next-samvat/articleshow/114570663.cms",
            "description": "Analysts suggest a cautiously optimistic approach for Indian equities amid current market corrections. Top stock picks from Fisdom Research include HCL Technologies, IndusInd Bank, Max Healthcare Institute, Kalyan Jewellers, and Crompton Greaves Consumer Electricals, each with considerable growth potential and key technical and fundamental triggers.",
            "pubDate": "2024-10-25T06:46:21.170482"
        },
        {
            "title": "Bikaji Foods shares surge 10% post Q2 results, profit after tax up by 14.7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bikaji-foods-shares-surge-10-post-q2-results-profit-after-tax-up-by-14-7/articleshow/114570425.cms",
            "description": "Bikaji Foods shares rose 10% after Q2 results showed 18.5% revenue growth and 15% profit increase, driven by strong demand in ethnic snacks and packaged sweets during the festive season.",
            "pubDate": "2024-10-25T06:46:21.170576"
        },
        {
            "title": "PNB Housing Finance shares rally 11% after strong Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-housing-finance-shares-rally-11-after-strong-q2-results/articleshow/114570312.cms",
            "description": "PNB Housing Share Price: PNB Housing Finance shares climbed 11% to Rs 1,035 after posting a 23% YoY rise in Q2 FY25 net profit to Rs 470 crore, attributed to improved asset quality and reduced GNPA ratio. Net interest income grew modestly, while net interest margin showed slight improvement.",
            "pubDate": "2024-10-25T06:46:21.170671"
        },
        {
            "title": "Samvat 2081: 5 techno-funda stock picks with up to 36% potential returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/samvat-2081-5-techno-funda-stock-picks-with-up-to-36-potential-returns/slideshow/114570014.cms",
            "description": "After a strong northward rally seen in the markets in the last few months, the markets have seemed to take a breather, witnessing a phase of correction in the current month so far.With the Indian equities experiencing pressure, analysts believe that while the macroeconomic picture of the country is still strong, a cautiously optimistic approach to the markets is advisable.Anchored by two robust mega-caps for stability, and complemented by mid and small caps for growth, Fisdom Research designed a selection of stocks to capitalize on market trends while managing risks for potential returns of up to 36%:",
            "pubDate": "2024-10-25T06:46:21.170763"
        },
        {
            "title": "Global brokerages see over 20% upside in Paytm, Coforge, Godrej Properties & Birlasoft",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-brokerages-see-over-20-upside-in-paytm-coforge-godrej-properties-birlasoft/slideshow/114569738.cms",
            "description": "Several top global brokerages have shared their latest views on key stocks, highlighting growth potential and target prices.Citi has upgraded Paytm to a \"buy\" following resolved regulatory risks, while Macquarie continues to be positive on Birlasoft despite a margin miss.Jefferies sees strong growth prospects for Godrej Properties, citing robust demand and accelerated land acquisition, and JPMorgan remains \"overweight\" on Coforge, anticipating sustained organic growth and margin expansion.We have collated inputs from ETNow and here's a closer look at their recommendations and target prices:",
            "pubDate": "2024-10-25T06:46:21.170856"
        },
        {
            "title": "Godrej Consumer Products shares surge 5% on reporting 13% YoY Q2 PAT growth. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-products-shares-surge-5-on-reporting-13-yoy-q2-pat-growth-should-you-invest/articleshow/114569432.cms",
            "description": "Godrej Consumer Products shares rose 5% after a 13% net profit increase to Rs 491.31 crore. Analysts maintain buy ratings, with target prices ranging from Rs 1,450 to Rs 1,600.",
            "pubDate": "2024-10-25T06:46:21.170954"
        },
        {
            "title": "Stock Radar: Why United Breweries is a ‘buy on dips’ stock at current levels after a 10% fall from highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-why-united-breweries-is-a-buy-on-dips-stock-at-current-levels-after-a-10-fall-from-highs/articleshow/114554412.cms",
            "description": "The stock peaked at Rs 2,202 on September 27, 2024, but retreated to Rs 1,991 by October 23, marking a 10% decline. It fell below key moving averages on the daily charts before bouncing back after testing the 200-EMA, indicating a potential bullish recovery. The stock also found support above the lower boundary of an Ascending Triangle pattern, suggesting that if momentum strengthens, it could retest the Rs 2,100 level. This pattern generally signals a continuation of an uptrend.",
            "pubDate": "2024-10-25T06:46:21.171047"
        },
        {
            "title": "Stocks to buy or sell today: Wipro, SBI among top 10 trading ideas for October 25, 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-or-sell-today-wipro-sbi-among-top-10-trading-ideas-for-october-25-2024/articleshow/114568901.cms",
            "description": "In the options market, the highest Call Open Interest (OI) is positioned at 25,500, followed by 25,000, while the maximum Put OI is at 24,000 and then at 24,400. Call writing is evident at the 24,500 and 24,400 strikes, whereas Put writing is noted at the 24,400 and 24,300 strikes.",
            "pubDate": "2024-10-25T06:46:21.171139"
        },
        {
            "title": "NTPC shares in focus after Q2 net profit grows 14% YoY to Rs 5,380 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-shares-in-focus-after-q2-net-profit-grows-14-yoy-to-rs-5380-crore/articleshow/114568841.cms",
            "description": "NTPC reported a 14% rise in Q2 net profit to Rs 5,380.25 crore despite a decline in total income. The company approved a Rs 2.50 interim dividend.",
            "pubDate": "2024-10-25T06:46:21.171238"
        },
        {
            "title": "Paytm shares rally nearly 11% in a week. Is the worst behind?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-rally-nearly-11-in-a-week-is-the-worst-behind/articleshow/114568798.cms",
            "description": "Paytm shares rise nearly 11% in one week after securing NPCI approval for onboarding new UPI users and reporting a net profit of Rs 928.3 crore for Q2 FY2024, bolstered by a one-time gain from selling its entertainment ticketing business. Analysts highlight significant business and profitability improvements.",
            "pubDate": "2024-10-25T06:46:21.171333"
        }
    ]
}