{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-27T21:19:04.834521",
    "items": [
        {
            "title": "Ashok Leyland shares rise 5% to hit 52-week high on proposed merger of finance arm with NDL Ventures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-rise-5-to-hit-52-week-high-on-proposed-merger-of-finance-arm-with-ndl-ventures/articleshow/125605782.cms",
            "description": "Ashok Leyland shares surged to a 52-week high following its subsidiary Hinduja Leyland Finance's approval to merge with NDL Ventures. This strategic absorption, effective April 2026 pending approvals, involves a 25:10 share exchange ratio. The move is part of a broader realignment of Ashok Leyland's key subsidiaries.",
            "pubDate": "2025-11-27T05:43:16.342330"
        },
        {
            "title": "Tata stock which doubled money for two consecutive years is down 40% in 2025. Is the dip strong enough to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-stock-which-doubled-money-for-two-consecutive-years-is-down-40-in-2025-is-the-dip-strong-enough-to-buy/articleshow/125605687.cms",
            "description": "Trent, a top Tata Group retailer, faces a tough year. Its stock is down 40% in 2025. Growth is slowing, and expansion worries investors. Analysts are cautious. However, long-term prospects remain, with strong brands and investments in technology. The company is navigating a challenging phase.",
            "pubDate": "2025-11-27T05:43:16.342459"
        },
        {
            "title": "Conflicting Fed signals drive surge in hedging activity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/conflicting-fed-signals-drive-surge-in-hedging-activity/slideshow/125605278.cms",
            "description": "US rate-cut uncertainty has ignited volatility and increased hedging flows as investors try to navigate mixed signals from the Federal Reserve. (Source: Reuters)",
            "pubDate": "2025-11-27T05:43:16.342564"
        },
        {
            "title": "Sensex, Nifty hit all-time highs: Is India's 2026 supercycle about to begin?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-hit-all-time-highs-is-indias-2026-supercycle-about-to-begin/articleshow/125605517.cms",
            "description": "Stock Market all time high: Indian markets hit new milestones on Thursday, with the Sensex crossing 86,000 for the first time and the Nifty50 breaking past previous records from September 2024. The rally is fueled by expectations of coordinated rate cuts by the U.S. Fed and RBI next month, which could boost liquidity.",
            "pubDate": "2025-11-27T05:43:16.342665"
        },
        {
            "title": "Patel Engineering shares zoom 10% after securing Rs 798 crore coal excavation order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patel-engineering-shares-zoom-10-after-securing-rs-798-crore-coal-excavation-order/articleshow/125605442.cms",
            "description": "Patel Engineering's stock soared after securing two significant Letters of Intent worth Rs 798.19 crore for coal excavation and transportation projects in Chhattisgarh. Awarded by South Eastern Coalfields Limited, these nine-year contracts involve extensive overburden removal, coal handling, and logistics. This win further solidifies the company's position in crucial infrastructure development for public sector undertakings.",
            "pubDate": "2025-11-27T05:43:16.342771"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs maintains buy on Emami; Nuvama retains Hold on Kaynes Technology",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-maintains-buy-on-emami-nuvama-retains-hold-on-kaynes-technology/articleshow/125605387.cms",
            "description": "Top brokerages issued mixed views across sectors, with Goldman Sachs maintaining a Buy on Emami citing attractive valuations and recovery prospects, while Motilal Oswal reiterated a Buy on Global Health driven by strong momentum and expansion visibility. Nuvama retained a Hold on Kaynes Technology, flagging premium valuations despite robust growth plans.",
            "pubDate": "2025-11-27T05:43:16.342875"
        },
        {
            "title": "How big is the smallcap crisis? Headlines can't do justice as 1,000 stocks drop at least 20% from peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-big-is-the-smallcap-crisis-headlines-cant-do-justice-as-1000-stocks-drop-at-least-20-from-peak/articleshow/125605331.cms",
            "description": "India's smallcap market is experiencing a severe downturn, with over 1,000 stocks falling at least 20% from their peaks. This broad-based correction, driven by significant earnings misses and a valuation reset, has seen many companies collapse by over 50%. Analysts suggest the worst of the froth may be gone, but future recovery hinges on consistent earnings growth.",
            "pubDate": "2025-11-27T05:43:16.342976"
        },
        {
            "title": "Reliance Infrastructure shares rally 5%, hit upper circuit for second day after recent sell-off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infrastructure-shares-rally-5-hit-upper-circuit-for-second-day-after-recent-sell-off/articleshow/125604871.cms",
            "description": "Reliance Infrastructure surged 5% to hit the upper circuit for the second consecutive session, extending its rebound after a sharp six-day decline. Despite the recovery, the stock remains under pressure—down 27% in a month and nearly 60% from its 52-week high—while technical indicators continue to signal broader weakness.",
            "pubDate": "2025-11-27T05:43:16.343076"
        },
        {
            "title": "Gold, silver prices witness profit booking but analysts remain optimistic. Is Rs 1.3 lakh target in sight?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-silver-prices-witness-profit-booking-but-analysts-remain-optimistic-is-rs-1-3-lakh-target-in-sight/articleshow/125604779.cms",
            "description": "Gold and silver prices opened lower due to profit booking and market volatility, even as expectations of December Fed rate cuts and a weaker dollar provided support. Gold February futures on MCX fell 0.41% to ₹1,27,248 per 10 grams, while silver March futures dropped 0.36% to ₹1,64,349 per kg.",
            "pubDate": "2025-11-27T05:43:16.343166"
        },
        {
            "title": "Sterling and Wilson Renewable Energy shares rise 5% on Rs 1,313-crore order win. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sterling-and-wilson-renewable-energy-shares-rise-5-on-rs-1313-crore-order-win-check-details/articleshow/125604373.cms",
            "description": "Sterling and Wilson Renewable Energy shares saw a significant jump on Thursday. The company announced it secured a major international project in South Africa. This new contract is for a 240 MW AC Solar PV project valued at approximately $147 million. This win strengthens the company's position in the growing South African solar market.",
            "pubDate": "2025-11-27T05:43:16.343279"
        },
        {
            "title": "At fresh record highs! Sensex rallies past 86,000 level, Nifty tops 26,300 mark",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-50-hits-fresh-all-time-high-after-14-months-crosses-26280-sensex-jumps-300-pts-higher/articleshow/125604255.cms",
            "description": "Stock Market Today: Indian equities reached new heights on Thursday, with the Nifty 50 hitting an all-time peak. This surge was driven by optimism surrounding potential interest rate cuts in both the U.S. and domestically next month, which ignited fresh buying interest in the market.",
            "pubDate": "2025-11-27T05:43:16.343377"
        },
        {
            "title": "DOMS, Ajanta Pharma among 7 high conviction small, midcap picks with up to 69% upside: PL Capital",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/doms-ajanta-pharma-among-7-high-conviction-small-midcap-picks-with-up-to-69-upside-pl-capital/slideshow/125604313.cms",
            "description": "Nifty has moved up 4% in the past three months after a long consolidation phase, as markets look ahead with optimism due to a resilient Q2 corporate performance. With hopes of a resolution in the tariff row with the USA and signs of domestic demand revival during the ongoing festival and wedding season, aided by GST rationalization, investor sentiment appears to be improving.The broader economic momentum is expected to be fueled by factors such as income tax rate cuts, lower interest rates, favorable monsoons, a 12-year low in inflation, and the benefits of GST rationalization. These tailwinds are particularly supportive for small and midcap companies, which are witnessing accelerated growth in sales during the festive season. With this, PL Capital has highlighted its high conviction small and midcap picks with upside potential of up to 69%:",
            "pubDate": "2025-11-27T05:43:16.343472"
        },
        {
            "title": "Rs 30,000 crore IPO gold rush triggers worst selling by retail investors since FY19",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-30000-crore-ipo-gold-rush-triggers-worst-selling-by-retail-investors-since-fy19/articleshow/125604126.cms",
            "description": "India's retail investors are exiting the secondary market, offloading Rs 4,729 crore in FY26, their worst selling streak since FY19. This exodus is fueled by a Rs 30,000 crore surge into the booming IPO market, where investors chase listing gains despite rich valuations and a rising share of Offer for Sale transactions.",
            "pubDate": "2025-11-27T05:43:16.343562"
        },
        {
            "title": "Wipro shares in focus on strategic alliance with IISc to drive innovation in frontier technologies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-in-focus-on-strategic-alliance-with-iisc-to-drive-innovation-in-frontier-technologies/articleshow/125604100.cms",
            "description": "Wipro shares may be in focus after the company announced a strategic collaboration with IISc and FSID to advance frontier technologies, including quantum computing, agentic AI, and secure digital infrastructure. The partnership aims to develop autonomous digital systems, sector-specific applications, and industry-ready solutions through joint research and innovation programmes.",
            "pubDate": "2025-11-27T05:43:16.343653"
        },
        {
            "title": "Eternal shares in focus following Rs 600 crore fund infusion into Blinkit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-in-focus-following-rs-600-crore-fund-infusion-into-blinkit/articleshow/125604083.cms",
            "description": "Eternal, the parent of Blinkit, has infused Rs 600 crore into the quick commerce platform, taking its total 2025 investment to Rs 2,600 crore. The funds support Blinkit’s aggressive expansion of dark stores and rising operational needs, even as the company continues to post losses despite efficiency gains and strong growth ambitions.",
            "pubDate": "2025-11-27T05:43:16.343744"
        },
        {
            "title": "MCX, Aditya Birla Capital among 6 stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-aditya-birla-capital-among-6-stocks-witness-5-year-swing-high-breakouts/slideshow/125604062.cms",
            "description": "In the Nifty500 segment, six stocks hit a 5-year swing high at the close on November 26, indicating bullishness in these counters, according to StockEdge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year period. This level often acts as a significant resistance point where prices have historically struggled to move higher. Such an occurrence may be viewed as a bullish signal, suggesting potential for further upside. However, it differs from a 5-year breakout, which occurs when a stock decisively surpasses a resistance level that has held for five years or more.",
            "pubDate": "2025-11-27T05:43:16.343835"
        },
        {
            "title": "Nifty hits record high, but half its stocks haven’t in 2025. What’s next for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-hits-record-high-but-half-its-stocks-havent-in-2025-whats-next-for-investors/articleshow/125609532.cms",
            "description": "Nifty reclaimed a fresh record high after 14 months, ending a long corrective phase driven by expensive valuations, heavy FII outflows, geopolitical risks, and soft earnings. Despite the milestone, foreign investors still remain significantly under-exposed to India, with their holdings at a 15-year low following over ₹2 lakh crore in selling this year.",
            "pubDate": "2025-11-27T08:51:59.228166"
        },
        {
            "title": "Wealth creation is about clean & strong balance sheets: 5 large-caps from different sectors with upside potential of up to 37%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-creation-is-about-clean-strong-balance-sheets-5-large-caps-from-different-sectors-with-upside-potential-of-up-to-37/articleshow/125608386.cms",
            "description": "With the Nifty touching new highs, there is a high probability that you will be disappointed with the value of your portfolio. The reason is simple: While the Nifty has been rising steadily, the broader market has not been doing as well. Be it pharma, FMCG, or a majority of the indices – all of them clearly show that things have not been as good as they might appear to be. But the fact is that, in the long term, every sector will go through phases of consolidation and valuation readjustment.",
            "pubDate": "2025-11-27T08:51:59.228275"
        },
        {
            "title": "12 smallcaps soar up to 180% in 3 months. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-smallcaps-soar-up-to-180-in-3-months-do-you-own-any/slideshow/125608288.cms",
            "description": "The market logged a strong session on November 26, with the benchmark Sensex rallying over 1,000 points to close at 85,609. Over the past three months, the index has gained nearly 6%. In sharp contrast, the small-cap index has inched up less than half a per cent during the same period, making it one of the market’s flattest performers.Yet beneath this muted headline number, several small-cap stocks have delivered eye-popping returns. We identified 12 small-cap names that have surged more than 50% in just three months. And in a standout case, one stock has turned multibagger, soaring nearly 200%. (Data Source: ACE Equity).",
            "pubDate": "2025-11-27T08:51:59.228367"
        },
        {
            "title": "Bank of Japan advocates 'measured' rate hikes to balance the economy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-japan-advocates-measured-rate-hikes-to-balance-the-economy/slideshow/125608079.cms",
            "description": "BOJ board member Asahi Noguchi stressed the importance of a measured, step-by-step approach in raising interest rates. A gradual pace ensures that the economy adjusts smoothly without causing unnecessary shocks. (Source: Reuters)",
            "pubDate": "2025-11-27T08:51:59.228452"
        },
        {
            "title": "Sensex, Nifty at all-time highs. But it's not a bull market yet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-at-all-time-high-but-its-not-a-bull-market-yet/articleshow/125607575.cms",
            "description": "Sensex and Nifty hit record highs, but nearly half of Nifty50 stocks remain below all-time peaks, highlighting a narrow rally led by a few largecaps. Retail investors are exiting secondary markets for IPOs, while analysts advise caution, selective buying, and tight risk management amid high valuations and market concentration.",
            "pubDate": "2025-11-27T08:51:59.228537"
        },
        {
            "title": "HDFC Bank, Bajaj Finance lead as Nifty50 climbs to fresh record above 26,300",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-bajaj-finance-lead-as-nifty50-climbs-to-fresh-record-above-26300/articleshow/125607371.cms",
            "description": "The Nifty50 index reached a record high of 26,310.45. Strong buying in financial, IT, infrastructure, and consumption stocks fueled the rally.  Domestic institutional flows and sector-specific momentum supported the gains.  Bajaj Finance and Larsen & Toubro were among the top performers.  Despite some declines, the overall market sentiment remained positive.",
            "pubDate": "2025-11-27T08:51:59.228620"
        },
        {
            "title": "GMDC shares rise for third straight session, up 7% on government rare earth incentive",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-shares-rise-for-third-straight-session-up-7-on-government-rare-earth-incentive/articleshow/125607327.cms",
            "description": "Gujarat Mineral Development Corporation (GMDC) shares surged 7% for a third consecutive day following a Rs 7,280-crore government incentive scheme to boost domestic production of critical minerals. This initiative aims to reduce reliance on China and create significant production capacity for rare earth magnets, benefiting companies like GMDC.",
            "pubDate": "2025-11-27T08:51:59.228702"
        },
        {
            "title": "Natco Pharma shares drop over 5% after previous day’s double-digit gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/natco-pharma-shares-drop-over-5-after-previous-days-double-digit-gains/articleshow/125607274.cms",
            "description": "Natco Pharma shares fell as investors booked profits after a sharp rally in the previous session. The stock has been volatile this week, slipping earlier after the US FDA issued seven Form-483 observations at its Manali API plant, which the company said were manageable.",
            "pubDate": "2025-11-27T08:51:59.228785"
        },
        {
            "title": "IREDA's 632% vertical takeoff to 42% slide in just 50 sessions, PSU stock gives a reality check. Buy, hold or exit?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iredas-632-vertical-takeoff-to-42-slide-in-just-50-sessions-psu-stock-gives-a-reality-check-buy-hold-or-exit/articleshow/125606952.cms",
            "description": "IREDA shares have witnessed volaityly in the recent past,  surging 632% in 13 months before tumbling 42% in just 50 sessions. Despite strong Q2FY26 earnings and long-term growth potential, analysts warn of ongoing bearish momentum, margin pressures, and sectoral headwinds. Investors are advised to hold near support levels of Rs 137–140.",
            "pubDate": "2025-11-27T08:51:59.228864"
        },
        {
            "title": "Kevin Hassett tipped as next Fed Chair, markets eye dollar impact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kevin-hassett-tipped-as-next-fed-chair-markets-eye-dollar-impact/slideshow/125606856.cms",
            "description": "U.S. bond markets remain steady despite speculation that White House economic adviser Kevin Hassett could replace Jerome Powell as Federal Reserve Chair in May. Hassett’s reputation for favoring rate cuts has sparked concerns that the dollar could weaken. Betting markets show rising odds for Hassett, while short-term yields dipped briefly before rebounding. (Source: Reuters)",
            "pubDate": "2025-11-27T08:51:59.228945"
        },
        {
            "title": "RBI & Sebi n talks to review curbs on currency derivatives: Reports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-sebi-n-talks-to-review-curbs-on-currency-derivatives-reports/articleshow/125606599.cms",
            "description": "Indian regulators are considering easing strict rules on currency derivatives after a significant market shift offshore. The Reserve Bank of India's 2024 enforcement of requiring underlying exposures for derivative positions led to a sharp decline in domestic trading, while overseas markets saw a surge. Discussions are underway to potentially revive the market for individual traders with new safeguards.",
            "pubDate": "2025-11-27T08:51:59.229020"
        },
        {
            "title": "Kotak Equities begins Urban Company coverage with a sell call; stock trading 15% below debut price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-equities-initiates-coverage-of-urban-company-with-sell-call-stock-trading-15-below-debut-price/articleshow/125606406.cms",
            "description": "Kotak Institutional Equities has initiated coverage of Urban Company with a ‘sell’ rating and a target price of Rs 120, weeks after its strong market debut. The stock, which opened at Rs 162.25, has slipped to Rs 138.20 as of November 26, down 15% from its IPO price, reflecting concerns over growth costs despite a strong expansion story.",
            "pubDate": "2025-11-27T08:51:59.229107"
        },
        {
            "title": "CarTrade Tech slides 5% as talks to absorb CarDekho, BikeDekho collapse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cartrade-tech-slides-5-as-talks-to-absorb-cardekho-bikedekho-collapse/articleshow/125606217.cms",
            "description": "CarTrade Tech shares fell 5% after the company and Girnar Software mutually agreed not to proceed with the proposed acquisition of CarDekho and BikeDekho, a deal that could have reshaped India’s automotive classifieds and digital auto-retail market.",
            "pubDate": "2025-11-27T08:51:59.229186"
        },
        {
            "title": "Adani Ports, SBI, ITC among Prabhudas Lilladher's 11 investment gems",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-sbi-itc-among-prabhudas-lilladhers-11-investment-gems/slideshow/125606282.cms",
            "description": "Domestic brokerage Prabhudas Lilladher has raised its Nifty 12-month target to 29,094 from 28,781 earlier, implying an 11% growth from current levels. The brokerage picked financials, consumer, defence and ports as key themes to achieve this for investors. Prabhudas remains more bullish on the largecaps and has 11 preferred picks to buy. See details!",
            "pubDate": "2025-11-27T08:51:59.229262"
        },
        {
            "title": "Uday Kotak’s crisis-time MCX bet turns into a 1,618% windfall in 11 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uday-kotaks-crisis-time-mcx-bet-turns-into-a-1618-windfall-in-11-years/articleshow/125606085.cms",
            "description": "MCX’s surge past Rs 10,000 milestone, has turned Uday Kotak’s 2014 crisis-time investment into a massive 1,618% gain, with Kotak Mahindra Bank’s 15% stake now valued at ₹7,887 crore. The rally follows strong earnings, rising 29% YoY, and has pushed the stock well above key moving averages despite elevated volatility.",
            "pubDate": "2025-11-27T08:51:59.229341"
        },
        {
            "title": "Sharekhan bullish despite pharma's underperformance; backs Cipla, Lupin & 3 more for up to 16% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sharekhan-bullish-despite-pharmas-underperformance-backs-cipla-lupin-amp-3-more-for-up-to-16-gains/slideshow/125612464.cms",
            "description": "Notwithstanding an underperformance by pharmaceuticals and healthcare stocks over the last one year, Sharekhan remains positive about the sector. Its coverage universe of pharmaceutical companies clocked a strong 12% YoY revenue growth and 18% rise in EBITDA as complex drugs, biosimilars and branded formulations got a greater share of the revenue pie. The brokerage has now picked 5 stocks as buys, estimating up to 16% potential upside. Take a look:",
            "pubDate": "2025-11-27T11:09:35.137825"
        },
        {
            "title": "Market Wrap: Sensex edges up 111 pts, Nifty holds above 26,215 as D-St closes just shy of record highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-edges-up-111-pts-nifty-holds-above-26215-as-d-st-closes-just-shy-of-record-highs/articleshow/125611384.cms",
            "description": "Indian equities reached new all-time highs on Thursday, with both the Sensex and Nifty briefly touching record levels before closing with modest gains. Investor optimism, fueled by expectations of potential U.S. and domestic interest-rate cuts next month, supported a positive market sentiment and attracted fresh buying.",
            "pubDate": "2025-11-27T11:09:35.137969"
        },
        {
            "title": "Top 10 Nifty stocks that are down up to 94% from record peaks. How many do you have?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-10-nifty-stocks-that-are-down-up-to-94-from-record-peaks-how-many-do-you-have/slideshow/125611431.cms",
            "description": "Nifty’s 14-month wait for a fresh record finally ended as the index surged past 26,277, reclaiming an all-time high after 289 trading sessions. The rally marks a decisive reversal from the correction that began in September 2024—a phase dominated by stretched valuations, persistent FII selling, geopolitical tensions, the absence of a trade deal with the US, and weaker-than-expected corporate earnings. Despite today’s milestone, 23 out of 50 Nifty stocks are yet to hit their all-time highs and are still down at least 10% from record levels. Here are 10 stocks that haven't touched their record peaks in 2025",
            "pubDate": "2025-11-27T11:09:35.138078"
        },
        {
            "title": "FIIs, mutual funds slash stake in Suzlon Energy; stock down 12% in 2025 so far",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-mutual-funds-slash-stake-in-suzlon-energy-stock-down-12-in-2025-so-far/articleshow/125610341.cms",
            "description": "Suzlon Energy delivered a strong quarter with improved margins, efficient execution, and solid profitability despite institutional investors reducing exposure. While fundamentals continue to strengthen, technical indicators show short-term weakness. Analyst sentiment remains broadly positive, suggesting potential upside as the company advances its turnaround within India’s expanding clean-energy landscape",
            "pubDate": "2025-11-27T11:09:35.138181"
        },
        {
            "title": "Magellanic Cloud shares crash 10%, extending 4-day rout to 46%. What’s driving the plunge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/magellanic-cloud-shares-crash-10-extending-4-day-rout-to-46-whats-driving-the-plunge/articleshow/125610127.cms",
            "description": "Magellanic Cloud’s shares hit a 10% lower circuit on November 27, dragging the stock down more than 46% in just four trading sessions, despite the company announcing a Rs 6 crore order win from East Coast Railway earlier in the week. The stock has now dropped around 68% from its July high and is down 55% in 2025 so far.",
            "pubDate": "2025-11-27T11:09:35.138284"
        },
        {
            "title": "Nifty Infra delivers double the Nifty 50 returns over 3 years. Here are key sectors to watch in India’s multi-year capex boom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-infra-delivers-double-the-nifty-50-returns-over-3-years-here-are-key-sectors-to-watch-in-indias-multi-year-capex-boom/articleshow/125609936.cms",
            "description": "The Nifty Infrastructure Index has outperformed the Nifty 50 by a wide margin, delivering 2x its three-year returns as India enters a multi-year capex boom. Investment managers highlight strong order books, improving execution, and sectoral tailwinds across roads, airports, logistics, energy, and digital infrastructure through FY26–FY30.",
            "pubDate": "2025-11-27T11:09:35.138386"
        },
        {
            "title": "Stock Radar: Eicher Motors stock breaks out from Falg & Pole pattern to hit fresh highs; will the rally continue in December?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-eicher-motors-stock-breaks-out-from-falg-pole-pattern-to-hit-fresh-highs-will-the-rally-continue-in-december/articleshow/125586709.cms",
            "description": "Eicher Motor Ltd broke out from a Flag & Pole pattern on weekly charts, hitting fresh highs and suggesting a continued rally. Experts recommend buying the stock for a target of Rs 7,650 in the next 1-2 months, citing robust price structural developments and strong bullish momentum across multiple timeframes.",
            "pubDate": "2025-11-27T11:38:44.931235"
        },
        {
            "title": "Gainers & Losers: Ashok Leyland, GMDC among 6 top movers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-ashok-leyland-gmdc-among-6-top-movers/slideshow/125613069.cms",
            "description": "",
            "pubDate": "2025-11-27T11:38:44.931363"
        },
        {
            "title": "Sebi cancels registration of 68 investment advisers for non-payment of renewal fee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-cancels-registration-of-68-investment-advisers-for-non-payment-of-renewal-fee/articleshow/125613583.cms",
            "description": "The list of cancelled entities includes Truenorth Labs Pvt Ltd, Equity Mantra, Saurabh Mundra, Sheetal Agrawal, Ateet Hemant Wagh, Getbasis Securities and Technologies India Pvt Ltd, Lucid Technologies, and Avenue Venture Partners Investment Adviser LLP, among others.",
            "pubDate": "2025-11-27T11:46:36.792154"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/125618452.cms",
            "description": "Indian markets touched new all-time highs before profit booking trimmed gains, with optimism around upcoming rate cuts supporting sentiment. Analysts see a positive short-term trend, with Nifty holding above key averages and strong activity across major stocks despite neutral broader market breadth.",
            "pubDate": "2025-11-27T15:56:33.749787"
        },
        {
            "title": "Market Trading Guide: Buy Belrise Industries,Mahindra Lifespace on Friday for up to 14% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-belrise-industriesmahindra-lifespace-on-friday-for-up-to-14-gains/slideshow/125617362.cms",
            "description": "India’s benchmark index Nifty finally ended the 14-month long wait to surpass its previous lifetime high and create a fresh one. But the index remained sideways after a positive start, ending the day almost unchanged. Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that Nifty's breakout was muted and the index moved sideways thereafter. \"The short-term trend, however, remains positive, with the index trading comfortably above all major moving averages. The RSI is in a bullish crossover, and the higher-top, higher-bottom structure appears intact, confirming an ascending chart pattern. Support is placed at 26,000. The index may move towards 26,440-26,580. A buy-on-dips approach would be a better strategy, as some consolidation in the near term is expected after the recent sharp up-move,\" De said.Here are 2 stock recommendations for Friday:",
            "pubDate": "2025-11-27T15:56:33.749915"
        },
        {
            "title": "Indian bonds surrender some recent gains with focus turning to growth data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-bonds-surrender-some-recent-gains-with-focus-turning-to-growth-data/articleshow/125615737.cms",
            "description": "India's July-September growth data is due on Friday and the economy likely grew 7.3%, according to a Reuters poll, after expanding 7.8% in April-June.",
            "pubDate": "2025-11-27T15:56:33.750017"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125614924.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-11-27T15:56:33.750112"
        },
        {
            "title": "India REITs hold Rs 10.8 lakh cr market growth potential in four years: JLL India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-reits-hold-rs-10-8-lakh-cr-market-growth-potential-in-four-years-jll-india/articleshow/125614254.cms",
            "description": "India’s REIT market, now ₹1.6 lakh crore in size, is poised for a ₹10.8 lakh crore boost by 2029 driven by office-retail supply, strong NOI growth, high occupancy, institutional inflows and ample debt headroom.",
            "pubDate": "2025-11-27T15:56:33.750213"
        },
        {
            "title": "Motilal Oswal Alternates launches maiden private credit fund",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-alternates-launches-maiden-private-credit-fund/articleshow/125614159.cms",
            "description": "“India’s private credit market is relatively a matured asset class and growing rapidly. Mid-market corporates with strong operating track records are seeking flexible, non-dilutive growth capital suiting their financial needs,” said Rakshat Kapoor, Head Private Credit, Motilal Oswal Alternates.",
            "pubDate": "2025-11-27T15:56:33.750331"
        },
        {
            "title": "Ashok Leyland among 7 midcap stocks that hit 52-week highs & gained up to 24% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-among-7-midcap-stocks-that-hit-52-week-highs-amp-gained-up-to-24-in-a-month/slideshow/125614131.cms",
            "description": "On Thursday, the benchmark Sensex climbed 111 points to finish at 85,720. During the upswing, seven BSE midcap stocks hit their 52-week highs, reaching their strongest levels in a year. Such breakouts are generally seen as bullish indicators by traders and investors, pointing to solid momentum and the possibility of additional short-term gains.",
            "pubDate": "2025-11-27T15:56:33.750430"
        },
        {
            "title": "Two Trades for Today: A hospitality major for a rise of 7.1%, a mid-cap auto ancillary stock for an almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-hospitality-major-for-a-rise-of-7-1-a-mid-cap-auto-ancillary-stock-for-an-almost-7-gain/articleshow/125620048.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-27T17:48:57.453550"
        },
        {
            "title": "These large- and mid-cap stocks can give more than 25% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-and-mid-cap-stocks-can-give-more-than-25-return-in-1-year-according-to-analysts/articleshow/125621183.cms",
            "description": "We keep telling you to ignore volatility. But what does “ignoring volatility” mean in practice? It is not about indifference; it is about discipline. It means staying anchored to business quality: Growth runway, pricing power, return on capital, reinvestment opportunities, free-cash generation, and governance. It means asking, when a stock is down 5% because of a headline, whether anything in the company’s unit economics, competitive moat, or capital allocation has actually deteriorated. If the answer is no, the lower price is a long-term entry point, not a reason to sell.",
            "pubDate": "2025-11-27T21:19:04.078206"
        }
    ]
}