{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-17T14:35:49.955014",
    "items": [
        {
            "title": "Godrej Properties acquires 50 acres of land in Raipur; to sell housing plots",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-properties-acquires-50-acres-of-land-in-raipur-to-sell-housing-plots/articleshow/122619770.cms",
            "description": "Godrej Properties Ltd. has expanded its footprint into Raipur with the acquisition of 50 acres of land. The company plans to develop premium plotted residential units on the acquired land, projecting a saleable area of approximately 9.5 lakh square feet. This acquisition signifies Godrej Properties' strategic move to strengthen its presence in emerging real estate markets across India.",
            "pubDate": "2025-07-17T06:57:32.405928"
        },
        {
            "title": "Salman Khan sells 1,318 sq ft flat in Mumbai for Rs 5.35 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/salman-khan-sells-1318-sq-ft-flat-in-mumbai-for-rs-5-35-cr/articleshow/122619621.cms",
            "description": "Bollywood superstar Salman Khan has recently sold his 1,318 square feet apartment in Bandra (West), Mumbai, for a substantial Rs 5.35 crore. According to real estate consultant Square Yards, the transaction, registered this month, involves an apartment located in Shiv Asthan Heights.",
            "pubDate": "2025-07-17T06:57:32.406101"
        },
        {
            "title": "Stocks to Buy | Sector Spotlight: Capital goods, real estate, and EMS in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-sector-spotlight-capital-goods-real-estate-and-ems-in-focus/slideshow/122617249.cms",
            "description": "Sanjay H Parekh in an interview to ET Now said that overall market valuations are currently fair but not cheap. The pace at which markets have moved suggests a need for caution. He expects both time and price corrections ahead. While Q4 earnings were weak, Q1 is likely to remain soft, and even Q2 may not bring a clear recovery. He emphasises that earnings momentum might only pick up meaningfully from Q3 onwards.",
            "pubDate": "2025-07-17T06:57:32.406220"
        },
        {
            "title": "Mahindra Logistics shares jump 5% after board approves Rs 750 crore rights issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahindra-logistics-shares-jump-5-after-board-approves-rs-750-crore-rights-issue/articleshow/122618559.cms",
            "description": "Mahindra Logistics shares: The board has approved the issuance of 2.7 crore fully paid-up equity shares at ₹277 each, which includes a premium of ₹267 per share. The full amount is payable upon application.",
            "pubDate": "2025-07-17T06:57:32.406341"
        },
        {
            "title": "Nifty Private Bank Index Fund: Growth backed by interesting return profile",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-private-bank-index-fund-growth-backed-by-interesting-return-profile/articleshow/122618322.cms",
            "description": "India's private banks are driving economic growth, outperforming the broader market with superior efficiency and strong balance sheets. The Nifty Private Bank Index, comprising ten leading private banks, has delivered impressive returns, boasting a 20-year CAGR of over 18.6%.",
            "pubDate": "2025-07-17T06:57:32.406439"
        },
        {
            "title": "Mukul Agrawal picks 1.14% stake in smallcap stock in Q1FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-picks-1-14-stake-in-smallcap-stock-in-q1fy26/articleshow/122617931.cms",
            "description": "Ace investor Mukul Mahavir Agrawal acquired a 1.14% stake in Yatharth Hospital & Trauma Care Services in the June 2025 quarter, purchasing 11 lakh shares worth around Rs 68.1 crore. Following the update, the stock rose 3% in Thursday’s trade on the BSE and has rallied 40% over the last six months.",
            "pubDate": "2025-07-17T06:57:32.406541"
        },
        {
            "title": "India slips to 4th spot among favourite Asian stock market, shows BofA survey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-slips-to-4th-spot-among-favourite-asian-stock-market-shows-bofa-survey/articleshow/122617575.cms",
            "description": "India’s slide in regional market preference comes amid a shift in foreign fund flows toward semiconductor-led rallies in Japan, Taiwan, and South Korea. Indian equities continue to grapple with persistent IT sector weakness and a dearth of fresh catalysts.",
            "pubDate": "2025-07-17T06:57:32.406638"
        },
        {
            "title": "Trump: India trade deal 'very close', EU could follow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-india-trade-deal-very-close-eu-could-follow/slideshow/122617042.cms",
            "description": "President Donald Trump stated that the United States is very close to finalising a trade agreement with India. A high-level Indian trade delegation arrived in Washington earlier this week to continue discussions. The Trump administration is pushing to close multiple deals before the August 1 deadline, when tariffs on most U.S. imports are set to rise again. (Source: Reuters)",
            "pubDate": "2025-07-17T06:57:32.406732"
        },
        {
            "title": "Waaree Renewable shares rally 30% in 3 days ahead of Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-shares-rally-30-in-3-days-ahead-of-q1-results/articleshow/122616122.cms",
            "description": "Waaree Renewable's share price has rallied nearly 30% in three days ahead of its Q1FY26 results, surging past Rs 1,200 for the first time in months. The surge is supported by improving sentiment in the renewable energy sector ahead of the company's Q1 earnings.",
            "pubDate": "2025-07-17T06:57:32.406830"
        },
        {
            "title": "Dollar’s slide set to boost U.S. multinationals' earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dollars-slide-set-to-boost-u-s-multinationals-earnings/slideshow/122616030.cms",
            "description": "Recent months have seen the U.S. Dollar Index fall nearly 10%—with half that drop occurring since early April. This sharp decline is expected to benefit American multinational companies, which previously suffered from a strong dollar that reduced the value of foreign revenues. (Source: Reuters)",
            "pubDate": "2025-07-17T06:57:32.406924"
        },
        {
            "title": "AWL Agri Business shares surge over 6% on record Q1 revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/awl-agri-business-shares-surge-over-6-on-record-q1-revenue/articleshow/122615647.cms",
            "description": "AWL Agri Business reported its highest-ever Q1 revenue at Rs 17,059 crore, driven by strong edible oil performance. Despite a 24% YoY profit decline, robust top-line growth and retail expansion boosted investor sentiment in Thursday’s trade.",
            "pubDate": "2025-07-17T06:57:32.407018"
        },
        {
            "title": "Ixigo shares jumps 14%, hits 52-week high after strong Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ixigo-shares-jumps-12-hits-52-week-high-after-strong-q1-results/articleshow/122615567.cms",
            "description": "Ixigo Share Price: Ixigo's shares soared after reporting strong Q1FY26 results, with revenue up 73% YoY to Rs 314.5 crore and net profit increasing 27% YoY to Rs 19 crore. Growth was fueled by significant increases in flight, bus, and train GTV. The company is focusing on AI-driven efficiencies and customer-centric approaches, leading to record revenue and profits across key verticals.",
            "pubDate": "2025-07-17T06:57:32.407111"
        },
        {
            "title": "PNC Infratech shares rise 5% after emerging as lowest Bidder for NHPC solar power project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnc-infratech-shares-rise-5-after-emerging-as-lowest-bidder-for-nhpc-solar-power-project/articleshow/122615439.cms",
            "description": "PNC Infratech shares: PNC Infratech has secured a 300 MW solar project and a 150 MW / 600 MWh energy storage system under ISTS norms, as part of a recent tender. The contract was awarded through an online reverse auction conducted on July 15, 2025.",
            "pubDate": "2025-07-17T06:57:32.407202"
        },
        {
            "title": "ITC Hotels shares hit record high, rise over 3% after Q1 profit jumps 54% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-shares-hit-record-high-rise-over-3-after-q1-profit-jumps-54-yoy/articleshow/122614763.cms",
            "description": "ITC Hotels shares: The company reported a 54% YoY increase in net profit for Q1FY26, reaching ₹133 crore, up from ₹87 crore a year ago. Revenue from operations rose 15.5% to ₹816 crore, compared to ₹706 crore in the same quarter last year.",
            "pubDate": "2025-07-17T06:57:32.407344"
        },
        {
            "title": "How to trade Eternal shares after a 34% rally? Check key levels & strategies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-trade-eternal-shares-after-a-34-rally-check-key-levels-strategies/articleshow/122613700.cms",
            "description": "Eternal shares have surged 34% since April, fueled by investor optimism, but analysts suggest caution. Profit booking is advised near Rs 260 due to potential momentum loss, while others see buying opportunities above Rs 278 or near the Rs 240-Rs 235 support zone. Long-term investors should hold, adding on dips above Rs 245.",
            "pubDate": "2025-07-17T06:57:32.407441"
        },
        {
            "title": "$26 billion worth of shares to hit the market as lock-ins end for 60 firms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/26-billion-worth-of-shares-to-hit-the-market-as-lock-ins-end-for-60-firms/articleshow/122612781.cms",
            "description": "Over $26 billion worth of shares across 60 companies are set to become tradable over the next four months as pre-listing lock-ins expire, according to Nuvama. Key expiries include Hexaware, Ather Energy, and HDB Financial. While some unlocks may pressure liquidity, many shares remain with promoters, limiting immediate offloading and offering selective cues for investors to track.",
            "pubDate": "2025-07-17T06:57:32.407533"
        },
        {
            "title": "Stock Radar: JG Chemicals breaks out from Cup pattern to hit fresh record highs; check for target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-jg-chemicals-breaks-out-from-cup-pattern-to-hit-fresh-record-highs-check-for-target-stop-loss/articleshow/122573939.cms",
            "description": "JG Chemicals Ltd. broke out from a Cup pattern, propelling the stock towards record highs in July 2025. Experts suggest short-term traders consider buying, targeting Rs 592 within 1-2 months. Technical analysis indicates a bullish trend, supported by strong volumes and positive indicators, with potential for further upward movement. Analysts recommend a stop-loss at Rs 430.",
            "pubDate": "2025-07-17T11:59:18.779718"
        },
        {
            "title": "FIIs raise stakes in smallcaps: 8 stocks surge over 50% in 2025, 2 become multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-raise-stakes-in-smallcaps-8-stocks-surge-over-50-in-2025-2-become-multibaggers/slideshow/122627856.cms",
            "description": "Foreign Institutional Investors (FIIs) have shown growing interest in India’s smallcap space. According to June 2025 shareholding data, FIIs increased their stake in 132 smallcap stocks, up from the March quarter. This trend is significant because FIIs are known for their rigorous due diligence. When they step in, it often boosts investor confidence and can signal long-term growth potential in those companies.Out of these 132 smallcap stocks, 23 have already rallied more than 25% in 2025, showcasing strong market momentum. Even more impressive, 8 of them have surged over 50%, and 2 stocks have turned into multibaggers, doubling investors’ money in just over six months. (Data Source: ACE Equity).",
            "pubDate": "2025-07-17T11:59:18.779836"
        },
        {
            "title": "Electrum Portfolio Managers launches AIF-Laureate, a SEBI-Registered Category III alternative investment fund",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/electrum-portfolio-managers-launches-aif-laureate-a-sebi-registered-category-iii-alternative-investment-fund/articleshow/122638972.cms",
            "description": "Electrum Portfolio Managers has launched AIF–Laureate, a SEBI-registered Category III fund based on its Laureate PMS strategy. Targeting HNIs and institutions, it uses a GARP-based, benchmark-agnostic approach focused on under-researched small and mid-caps with strong fundamentals and governance.",
            "pubDate": "2025-07-17T11:59:18.779938"
        },
        {
            "title": "Zepto co-founder Kaivalya Vohra leads Avendus-Hurun India list of Under-30 entrepreneurs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zepto-co-founder-kaivalya-vohra-leads-avendus-hurun-india-list-of-under-30-entrepreneurs/articleshow/122637795.cms",
            "description": "Kaivalya Vohra and Aadit Palicha of Zepto top the first Avendus Wealth Hurun India 2025 Under-30 list, featuring 79 young entrepreneurs. The list spans multiple sectors, highlights Mumbai’s dominance, and notes over $5 billion in funding raised. Only six women made the list, underscoring gender disparity.",
            "pubDate": "2025-07-17T11:59:18.780038"
        },
        {
            "title": "Sensex settles 375 pts lower, Nifty below 25,120 led by losses in IT, bank stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-settles-375-pts-lower-nifty-below-25120-led-by-losses-in-it-bank-stocks/articleshow/122635873.cms",
            "description": "Indian benchmark indices Sensex and Nifty closed lower due to losses in financial and IT stocks, influenced by investor caution regarding Federal Reserve Chair Jerome Powell's tenure and US-India trade talks. Tech Mahindra and Infosys were significant drags. Global markets showed mixed trends, with European markets rising while U.S. futures remained cautious.",
            "pubDate": "2025-07-17T11:59:18.780140"
        },
        {
            "title": "Need for a deeper cash equities market, longer tenure F&O contracts: Sebi official",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/need-for-a-deeper-cash-equities-market-longer-tenure-fo-contracts-sebi-official/articleshow/122633441.cms",
            "description": "Sebi Whole Time Member Ananth Narayan has called for a deeper cash equities market, stressing that short-term derivatives dominate volumes and may hamper capital formation. He also backed extending the tenure of F&O contracts to improve market quality.",
            "pubDate": "2025-07-17T11:59:18.780236"
        },
        {
            "title": "Adani Group sells 20% stake in AWL Agri Business to Wilmar in Rs 7,150 crore deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-sells-20-stake-in-awl-agri-business-to-wilmar-in-rs-7150-crore-deal/articleshow/122629875.cms",
            "description": "Adani Group divested its 20% stake in AWL Agri Business Limited to Wilmar International for ₹7,150 crore at ₹275 per share, causing the stock to surge. This sale aligns with Adani's strategy to exit the FMCG sector, following a previous 13.5% stake sale in January. Wilmar International will now become the majority shareholder.",
            "pubDate": "2025-07-17T11:59:18.780336"
        },
        {
            "title": "Sona BLW shares rally over 8% after report of supply talks with Chinese automaker BYD, potential China plant",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sona-blw-shares-rally-over-8-after-report-of-supply-talks-with-chinese-automaker-byd-potential-china-plant/articleshow/122629323.cms",
            "description": "Sona BLW and BYD have reportedly been in talks for several months, with the proposed manufacturing facility in China seen as a key part of Sona BLW’s broader strategy to deepen its long-term partnership with the Chinese EV major.",
            "pubDate": "2025-07-17T11:59:18.780432"
        },
        {
            "title": "HUDCO approves Rs 3,000 crore NCD issue on private placement basis",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hudco-approves-rs-3000-crore-ncd-issue-on-private-placement-basis/articleshow/122627714.cms",
            "description": "HUDCO plans to raise up to Rs 3,000 crore through NCDs on a private placement basis, approved by the Bond Allotment Committee on July 17, 2025. These three-year bonds will carry a 6.64% coupon rate, with annual interest and principal payments.",
            "pubDate": "2025-07-17T11:59:18.780531"
        },
        {
            "title": "Stocks to Buy | Mihir Vora’s Strategy: Selective bets, staggered pharma exposure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-mihir-voras-strategy-selective-bets-staggered-pharma-exposure/slideshow/122626843.cms",
            "description": "Mihir Vora, in an interview to ET Now said that while benchmark indices have remained volatile, the broader market has shown underlying strength, primarily supported by midcap and smallcap stocks. He notes that these segments often provide support on days when largecaps falter, indicating that despite headline-level noise, market breadth is healthy and investors are still finding value beyond the top names.",
            "pubDate": "2025-07-17T11:59:18.780642"
        },
        {
            "title": "Bitcoin bet makes microcap stock double money in 3 months, hits upper circuit for 13th day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bitcoin-bet-makes-microcap-stock-double-money-in-3-months-hits-upper-circuit-for-13th-day/articleshow/122624815.cms",
            "description": "Jetking Infotrain shares continued their meteoric rise on Thursday, hitting the upper circuit for the 13th time this month. The stock has rallied 135.7% in just over three months, fueled by the company’s aggressive shift to Bitcoin as a treasury reserve asset. With a 12-month return of 309.4%, Jetking’s market cap now stands at Rs 139 crore.",
            "pubDate": "2025-07-17T11:59:18.780742"
        },
        {
            "title": "European shares rise after four-day drop as ABB shines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-after-four-day-drop-as-abb-shines/articleshow/122623696.cms",
            "description": "European shares rebounded on Wednesday, fueled by robust quarterly results from ABB and optimism surrounding potential trade negotiations between the U.S. and EU. ABB's strong performance, driven by U.S. demand and AI-related products, boosted shares of Siemens and Schneider Electric. Investors are closely monitoring U.S.-EU trade talks, with the EU preparing retaliatory measures if negotiations falter.",
            "pubDate": "2025-07-17T11:59:18.780839"
        },
        {
            "title": "Japan's Nikkei gains on weaker yen; chip shares cheer TSMC earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-gains-on-weaker-yen-chip-shares-cheer-tsmc-earnings/articleshow/122623271.cms",
            "description": "Japan's Nikkei share average recovered from early losses to end Thursday with solid gains as a weakening yen bolstered sentiment, while chip shares pared declines after Taiwanese chipmaker TSMC posted record earnings.",
            "pubDate": "2025-07-17T11:59:18.780931"
        },
        {
            "title": "DLF to invest Rs 900 cr to build first housing project in Mumbai, aims Rs 2,300 cr revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dlf-to-invest-rs-900-cr-to-build-first-housing-project-in-mumbai-aims-rs-2300cr-revenue/articleshow/122623066.cms",
            "description": "DLF Ltd has re-entered the Mumbai market with a Rs 900 crore investment in a luxury housing project, 'Westpark', in Andheri (West). The 5.18-acre project, developed in partnership with Trident Group, offers 416 apartments priced between Rs 4 crore and Rs 7.5 crore, targeting a sales realization of Rs 2,300 crore.",
            "pubDate": "2025-07-17T11:59:18.781030"
        },
        {
            "title": "Sebi looks to extend tenure of derivatives contracts, official says",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-looks-to-extend-tenure-of-derivatives-contracts-official-says/articleshow/122621254.cms",
            "description": "India is exploring measures to strengthen its cash equities markets while also aiming to enhance the quality of the derivatives market by extending the duration and maturity of contracts.",
            "pubDate": "2025-07-17T11:59:18.781124"
        },
        {
            "title": "SEBI aims to deepen equity market, flags concerns over derivatives frenzy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-aims-to-deepen-equity-market-flags-concerns-over-derivatives-frenzy/articleshow/122646091.cms",
            "description": "SEBI on Thursday expressed concern over the growing dominance of ultra-short-term derivatives trading, cautioning that such trends could undermine the health of India's capital markets, while contemplating steps to extend the tenure and maturity of these products.",
            "pubDate": "2025-07-17T14:35:42.051866"
        },
        {
            "title": "Alternative investments to gain more traction in India: Experts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alternative-investments-to-gain-more-traction-in-india-experts/articleshow/122645511.cms",
            "description": "India's alternative investment market is poised for rapid growth as family offices, corporates and institutional investors increasingly turn to these instruments in search of higher returns with relatively lower risk and volatility compared to equities, according to industry experts.",
            "pubDate": "2025-07-17T14:35:42.051999"
        },
        {
            "title": "These 5 financial services stocks hit 52-week highs, rally up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-financial-services-stocks-hit-52-week-highs-rally-up-to-25-in-a-month/slideshow/122643667.cms",
            "description": "",
            "pubDate": "2025-07-17T14:35:42.052123"
        },
        {
            "title": "US stocks trade higher as markets weigh fresh economic data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-markets-weigh-fresh-economic-data-tsmc-earnings-light-up-chip-stocks/articleshow/122643694.cms",
            "description": "Wall Street opened largely steady on Thursday, as investors mulled over fresh economic data, while upbeat results from Taiwan's TSMC energized U.S. chipmakers.",
            "pubDate": "2025-07-17T14:35:42.052232"
        },
        {
            "title": "I don’t promote stocks or seek out investors: Aswath Damodaran warns against scammers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/i-dont-promote-stocks-or-seek-out-investors-aswath-damodaran-warns-against-scammers/articleshow/122643529.cms",
            "description": "NYU finance professor Aswath Damodaran issued a strong social media warning, distancing himself from investment promotions or affiliations. Highlighting rising impersonation cases, he reaffirmed his educator role and cautioned followers against scams misusing his name and insights.",
            "pubDate": "2025-07-17T14:35:42.052335"
        },
        {
            "title": "Two Sharp with ET: Trump eyes India trade deal on Indonesia lines | iPhone exports from India soar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-trump-eyes-india-trade-deal-on-indonesia-lines-iphone-exports-from-india-soar/videoshow/122643271.cms",
            "description": "Trump says a US-India trade deal is “very close” and could follow his Indonesia template, which includes full US access and significant Indian purchases. Meanwhile, Apple’s iPhone exports from India surged 53% in H1 2025 as it ramps up production to avoid US tariffs on China—all of this in today’s Two Sharp with ET with Nisha Poddar.",
            "pubDate": "2025-07-17T14:35:42.052434"
        },
        {
            "title": "Breakout Stocks: How to trade JK Lakshmi Cement, LT Foods & Asahi India Glass that hit 52-week high?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-jk-lakshmi-cement-lt-foods-amp-asahi-india-glass-that-hit-52-week-high/slideshow/122642824.cms",
            "description": "Indian market snapped a 2-day winning streak on Thursday to close in the red. The BSE Sensex fell nearly 400 points while the Nifty50 managed to hold on to 25100 levels.",
            "pubDate": "2025-07-17T14:35:42.052533"
        },
        {
            "title": "4 companies with consistent growth in cash from operations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/4-companies-with-consistent-growth-in-cash-from-operations/slideshow/122642126.cms",
            "description": "",
            "pubDate": "2025-07-17T14:35:42.052625"
        }
    ]
}