{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-07T08:34:24.008124",
    "items": [
        {
            "title": "Japan's Nikkei ends lower as strong yen hurts appetite",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-as-strong-yen-hurts-appetite/articleshow/118008507.cms",
            "description": "Japan's Nikkei share average snapped a three-day winning streak to end lower on Friday as a stronger yen dampened appetite. However, investors scooped up stocks with a strong outlook, capping declines.",
            "pubDate": "2025-02-07T08:34:03.152835"
        },
        {
            "title": "BPCL, Indian Hotels among 5 stocks with short covering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bpcl-indian-hotels-among-5-stocks-with-short-covering/slideshow/118008050.cms",
            "description": "Short covering happens when traders buy back shares they previously sold short, often due to a shift in market sentiment or new information. This usually results in a decrease in open interest and can drive the stock price higher. In Friday's trading session, five stocks saw short covering. Here's the list:",
            "pubDate": "2025-02-07T08:34:03.152960"
        },
        {
            "title": "RBI rate cut: What it means for banks, NBFCs, auto and real estate stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-rate-cut-what-it-means-for-banks-nbfcs-auto-and-real-estate-stocks/articleshow/118007820.cms",
            "description": "Although the rate cut is seen as positive for equities, the RBI's policy failed to offer a clear direction for the stock market, which has been facing pressure due to FII outflows, the ongoing Trump tariff war, and Q3 earnings that were insufficient to support valuations.",
            "pubDate": "2025-02-07T08:34:03.153077"
        },
        {
            "title": "Sebi bans 'She Wolf of stock market' YouTuber who made Rs 104 crore by selling tips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bans-she-wolf-of-stock-market-youtuber-who-made-rs-104-crore-by-selling-tips/articleshow/118007475.cms",
            "description": "SEBI has banned Asmita Jitesh Patel and her trading school for offering unregistered investment advice, impounding Rs 54 crore of illicit gains. Patel, known as the \"Options Queen,\" used social media to promote stock trading courses. Investigations revealed course fees were routed through third-party entities. SEBI has barred all involved from accessing the securities market.",
            "pubDate": "2025-02-07T08:34:03.153187"
        },
        {
            "title": "Zerodha’s Nithin Kamath breaks down Sebi’s new retail algo trading rules. What you must know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodhas-nithin-kamath-breaks-down-sebis-new-retail-algo-trading-rules-what-you-must-know/articleshow/118007360.cms",
            "description": "Nithin Kamath emphasized that retail traders selling trading strategies or algorithms must now collaborate with a broker and register with exchanges. Marketplaces where traders share algos for a fee will also need exchange registration and a research analyst license. Further operational details from exchanges are expected by April 1, clarifying compliance requirements for traders and algo-sharing platforms.",
            "pubDate": "2025-02-07T08:34:03.153309"
        },
        {
            "title": "Why FIIs favor US over emerging markets despite weak dollar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-fiis-favor-us-over-emerging-markets-despite-weak-dollar/slideshow/118006747.cms",
            "description": "Foreign institutional investors (FIIs) typically shift funds based on currency strength, bond yields, and economic trends. Despite a weaker dollar and falling bond yields, emerging markets like India are not seeing expected inflows. Cameron Brandt, Director of Research at EPFR Global, explains why global investors are favoring US assets over emerging markets and what this trend means for India.",
            "pubDate": "2025-02-07T08:34:03.153428"
        },
        {
            "title": "Trinity of triggers! Can RBI rate cut, Budget boost and January sales spur auto stocks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trinity-of-triggers-can-rbi-rate-cut-budget-boost-and-january-sales-spur-auto-stocks/articleshow/118005955.cms",
            "description": "Maruti Suzuki leads with a 9% return since the Budget, followed by Mahindra & Mahindra and TVS Motor Company, each gaining nearly 6%. Exide Industries, Eicher Motors, Tata Motors, MRF, Hero MotoCorp, and Bajaj Auto have returned between 5% and 1%. Nifty Auto outperformed Nifty with 3.6% returns, making it the second-best sector, just behind Nifty Consumer Durable at 3.8%.",
            "pubDate": "2025-02-07T08:34:03.153533"
        },
        {
            "title": "Trends in retail investors shifting from stocks to bonds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trends-in-retail-investors-shifting-from-stocks-to-bonds/articleshow/118005480.cms",
            "description": "Fixed deposits have been a staple for conservative investors due to their simplicity and guaranteed returns. However, their appeal is fading when examined closely. Leading banks offer around 7%, but for investors in the 30% tax bracket, this drops to 5.1% post-tax. With inflation averaging 5%, the real return is negligible, barely preserving purchasing power.",
            "pubDate": "2025-02-07T08:34:03.153635"
        },
        {
            "title": "Rate-sensitive auto, realty stocks surge up to 3%, banks decline after RBI MPC cuts repo rate",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rate-sensitive-auto-realty-stocks-surge-up-to-3-banks-decline-after-rbi-mpc-cuts-repo-rate/articleshow/118005425.cms",
            "description": "Stocks in rate-sensitive sectors reacted mixed to the RBI's 25 bps repo rate cut to 6.25%. Auto and real estate stocks surged, with gains of up to 3%, led by Apollo Tyres, Ashok Leyland, M&M, and Godrej Properties. However, banking and financial stocks fell by nearly 1.5%, with Bajaj Finance, SBI, Axis Bank, and ICICI Bank leading the declines.",
            "pubDate": "2025-02-07T08:34:03.153741"
        },
        {
            "title": "Sandip Sabharwal's market insights: Is it time to buy brokerage stocks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sandip-sabharwals-market-insights-is-it-time-to-buy-brokerage-stocks/slideshow/118005090.cms",
            "description": "Sandip Sabharwal’s analysis covered trends in the cement and construction sector, large-cap companies, banking, and brokerage stocks, highlighting both challenges and opportunities in various sectors.",
            "pubDate": "2025-02-07T08:34:03.153841"
        },
        {
            "title": "RBI panel to review trading, settlement timings across various market segments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-panel-to-review-trading-settlement-timings-across-various-market-segments/articleshow/118003541.cms",
            "description": "RBI Governor Sanjay Malhotra announced the formation of a panel to review trading and settlement timings for markets regulated by the central bank. The decision follows a three-day Monetary Policy Committee (MPC) meeting. The working group, with stakeholder representation, will assess recent developments in financial markets and submit its report by April 30th.",
            "pubDate": "2025-02-07T08:34:03.153934"
        },
        {
            "title": "10 largecap stocks analysts expect to soar by 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-largecap-stocks-analysts-expect-to-soar-by-40/slideshow/118003444.cms",
            "description": "Brokerages remain optimistic about select large-cap stocks across key sectors like banking, auto, and insurance. Trendlyne data shows that 10 BSE Large-cap stocks, including Axis Bank, IndusInd Bank, Tata Motors, Hindalco, Ambuja Cement, and SBI have high analyst ratings and can deliver up to 40%. Here's a list of these stocks:",
            "pubDate": "2025-02-07T08:34:03.154029"
        },
        {
            "title": "KPI Green Energy shares surge 5% to hit upper circuit as Q3 profit soars 67% YoY; declares interim dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kpi-green-energy-shares-surge-5-to-hit-upper-circuit-as-q3-profit-soars-67-yoy-declares-interim-dividend/articleshow/118003275.cms",
            "description": "Shares of KPI Green Energy rose 5% after reporting a 67% YoY increase in Q3 net profit to Rs 84.5 crore. Revenue surged 38.8% to Rs 458.36 crore. The company also declared a 4% interim dividend. Analysts target Rs 1,100 per share.",
            "pubDate": "2025-02-07T08:34:03.154124"
        },
        {
            "title": "ITC, Delhivery among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-delhivery-among-5-stocks-with-short-buildup/slideshow/118003230.cms",
            "description": "A short buildup occurs when open interest and trading volumes rise, accompanied by a decrease in the stock price in the Futures and Options segment. This suggests that traders are anticipating further price declines and are establishing short positions. In Friday's trading session, five stocks saw notable short positions. Here's the list:",
            "pubDate": "2025-02-07T08:34:03.154221"
        },
        {
            "title": "Bharti Airtel, Indus Towers among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-indus-towers-among-5-stocks-with-long-buildup/slideshow/118002740.cms",
            "description": "A long buildup occurs when both open interest (OI) and trading volumes rise alongside an increase in the underlying stock price, signaling a bullish trend in the Futures and Options segment. In Friday's trading session, five stocks witnessed fresh long positions. Here's the list:",
            "pubDate": "2025-02-07T08:34:03.154332"
        },
        {
            "title": "NCC shares sink 15% as Q3 profit declines 12.5% YoY, margins contract",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncc-shares-sink-15-as-q3-profit-declines-12-5-yoy-margins-contract/articleshow/118002317.cms",
            "description": "NCC Ltd shares fell 14.6% after reporting a 12.5% YoY drop in Q3 net profit to Rs 193.2 crore. EBITDA declined 16.6%, with margins contracting to 7.9%. Revenue rose slightly to Rs 5,344.5 crore. The stock has dropped 31.8% in six months, though analysts remain largely positive.",
            "pubDate": "2025-02-07T08:34:03.154435"
        }
    ]
}