{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-02T08:49:25.795320",
    "items": [
        {
            "title": "Nomura lifts Nifty target price by 1,170 points, unveils 17 top stock picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-lifts-nifty-target-price-by-1170-points-unveils-17-top-stock-picks/articleshow/121564283.cms",
            "description": "Nomura observed that, despite overall earnings estimate reductions, India’s Q4 season saw more companies outperform than underperform. Since March 2025, consensus earnings estimates for FY26 and FY27 have been lowered by 2.3% and 1.4%, respectively.",
            "pubDate": "2025-06-02T06:32:03.588699"
        },
        {
            "title": "From Robo-Taxis to Pharma: Hedge Funds’ Global Growth Strategies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-robo-taxis-to-pharma-hedge-funds-global-growth-strategies/slideshow/121564197.cms",
            "description": "Hedge funds showcased a range of top investment ideas at the Sohn Investment Conference in Hong Kong, highlighting opportunities across China, India, Korea, Spain, and Japan. This year’s selections reflect a geographically diverse approach, as investors aim to spread their exposure and manage risks amid tariff uncertainties and market volatility.(Source: Reuters)",
            "pubDate": "2025-06-02T06:32:03.588819"
        },
        {
            "title": "India and China are promising alternatives for investment, says Mirae Asset VC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-and-china-are-promising-alternatives-for-investment-says-mirae-asset-vc/articleshow/121563921.cms",
            "description": "Mirae Asset suggests India and China as investment alternatives. This comes amid concerns about over-reliance on the US economy. Weakening global confidence and rising nationalism are factors. India's digital infrastructure and population growth are attractive. China's policy shifts are also creating opportunities. Foxconn plans a significant investment in its India unit. South Korean exports to the US have declined recently.",
            "pubDate": "2025-06-02T06:32:03.588923"
        },
        {
            "title": "Yes Bank shares jump 6% on fundraising buzz; board meet set for June 3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-jump-6-on-fundraising-buzz-board-meet-set-for-june-3/articleshow/121563446.cms",
            "description": "Yes Bank shares jumped 6% to Rs 22.86 after the bank announced a June 3 board meeting to consider capital raising via equity, debt, or other instruments. The move follows SBI’s plan to sell a significant part of its 23.97% stake to Japan’s SMBC, which may inject further capital and potentially raise its stake to 51%.",
            "pubDate": "2025-06-02T06:32:03.589028"
        },
        {
            "title": "These 5 F&O stocks witness high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-fo-stocks-witness-high-increase-in-futures-open-interest/slideshow/121563808.cms",
            "description": "As of May 30, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 20% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-06-02T06:32:03.589128"
        },
        {
            "title": "Balancing Act:  Fed eyes flexibility amid inflation jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balancing-act-fed-eyes-flexibility-amid-inflation-jitters/slideshow/121563705.cms",
            "description": "Federal Reserve Governor Christopher Waller signalled that interest rate cuts could still happen later in 2025, even as recent tariffs from the Trump administration temporarily push inflation higher. He emphasised that the labour market remains strong and inflation is showing signs of improvement, giving the Fed room to be patient and flexible. (Source: Reuters)",
            "pubDate": "2025-06-02T06:32:03.589230"
        },
        {
            "title": "Suzlon Energy shares jump 11% in 3 days on 365% Q4 PAT surge, brokerages eye Rs 83 target",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-shares-jump-11-in-3-days-on-365-q4-pat-surge-brokerages-eye-rs-83-target/articleshow/121563267.cms",
            "description": "Suzlon Energy shares: The stock rallied after the company reported a 365% year-on-year jump in consolidated PAT, rising to Rs 1,182 crore in Q4FY25 from Rs 254 crore in the same quarter last year.",
            "pubDate": "2025-06-02T06:32:03.589469"
        },
        {
            "title": "Reliance Power shares rally 5% to hit fresh 52-week high amid volume surge and clean energy order win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-rally-5-to-hit-fresh-52-week-high-amid-volume-surge-and-clean-energy-order-win/articleshow/121562646.cms",
            "description": "Reliance Power shares: Reliance Power's recent gains follow its May 28 announcement that subsidiary Reliance NU Energies received a Letter of Award from SJVN for a 350 MW ISTS-connected solar project, along with a 175 MW/700 MWh battery storage system.",
            "pubDate": "2025-06-02T06:32:03.589570"
        },
        {
            "title": "At multi-year highs: These 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-6-stocks-witness-5-year-swing-high-breakout/slideshow/121562834.cms",
            "description": "In the Nifty500 pack, six stocks witnessed a 5-year swing high at the close on May 30, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-06-02T06:32:03.589664"
        },
        {
            "title": "Why is the stock market down today? Sensex slumps over 700 pts, Nifty slips below 24,600; 5 key reasons behind the decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-the-stock-market-down-today-sensex-slumps-over-700-pts-nifty-slips-below-24600-5-key-reasons-behind-the-decline/articleshow/121562206.cms",
            "description": "Indian stock markets experienced a significant decline on Monday. Sensex and Nifty both traded lower. Selling pressure in metal and IT stocks contributed to the downturn. This weakness overshadowed India's strong GDP growth figures. Global cues remained mixed. Investors grew cautious before key U.S. macroeconomic data releases. Broader markets also faced pressure, with small-cap and mid-cap indices slipping.",
            "pubDate": "2025-06-02T06:32:03.589757"
        },
        {
            "title": "D-Street lures FIIs back with big ticket block trades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-st-lures-fiis-back-with-big-ticket-block-trades/articleshow/121562198.cms",
            "description": "Foreign investors are returning to Indian stocks, spurred by $5.5 billion in block trades in May, the highest in almost a year. This influx follows a significant outflow and is driven by attractive valuations and India's strong economic performance. Interest is particularly strong in banking, telecommunications, and diversified conglomerates, signaling renewed confidence in the Indian equities market.",
            "pubDate": "2025-06-02T06:32:03.589848"
        },
        {
            "title": "Niva Bupa shares fall 11% as PE investor sells 12% stake in block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niva-bupa-shares-fall-11-as-pe-investor-sells-12-stake-in-block-deal/articleshow/121561600.cms",
            "description": "Niva Bupa shares: ETNOW had reported that Fettle Tone LLP, an investment arm of True North, was likely to offload up to 122 million shares, representing about 6.7% of Niva Bupa’s equity. Additionally, CEO Krishnan Ramachandran was expected to sell around 10 million shares, or 0.5% of the company’s stake. The shares were priced at ₹82 each, valuing the total deal at approximately ₹1,082 crore.",
            "pubDate": "2025-06-02T06:32:03.589939"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/121561498.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-06-02T06:32:03.590035"
        },
        {
            "title": "Smallcap stocks are doubling money like it’s 2024 once again. Should you jump in?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stocks-are-doubling-money-like-its-2024-once-again-should-you-jump-in/articleshow/121561368.cms",
            "description": "Smallcap stocks are experiencing a resurgence, mirroring the gains seen in 2024, with the BSE Smallcap Index significantly outperforming the Nifty. While economic recovery and liquidity inflows fuel this rally, experts caution about stretched valuations and the need for selective stock picking based on strong fundamentals.",
            "pubDate": "2025-06-02T06:32:03.590127"
        },
        {
            "title": "Stocks to buy today: Paytm, Swiggy among top 5 trading ideas for 2 June 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-paytm-swiggy-among-top-5-trading-ideas-for-2-june-2025/articleshow/121561131.cms",
            "description": "The Indian market is expected to consolidate with a positive bias on Monday amid mixed global cues. Nifty futures closed lower at 24,852 on Friday, while India VIX dropped over 2%. Analysts suggest a broader trading range of 24,300–25,300. Key levels to watch are 24,800 for upside momentum and 24,444 on the downside. Experts recommend stocks like Paytm, Swiggy, and Bajaj Finserv.",
            "pubDate": "2025-06-02T06:32:03.590221"
        },
        {
            "title": "Bernstein raises Reliance Industries target price to Rs 1,640, citing 3-year low valuation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bernstein-raises-reliance-industries-target-price-to-rs-1640-citing-3-year-low-valuation/articleshow/121567074.cms",
            "description": "Global brokerage firm Bernstein has increased its target price for Reliance Industries shares. The new target is Rs 1,640, suggesting a potential 15.4% upside. The firm maintains an 'outperform' rating. This revision is due to growth momentum and an improved earnings outlook. Reliance is nearing the end of its store rationalization. Telecom is expected to support earnings growth.",
            "pubDate": "2025-06-02T08:49:11.734208"
        },
        {
            "title": "Nykaa shares slip 4% as brokerages flag fashion losses after Q4 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-shares-slip-4-as-brokerages-flag-fashion-losses-after-q4-results-should-you-buy-sell-or-hold/articleshow/121566808.cms",
            "description": "Nykaa shares slipped nearly 4% after Q4 results showed strong beauty business growth but continued fashion segment losses. Brokerages are divided, with target prices ranging from Rs 185 to Rs 250, reflecting mixed views on margin recovery and fashion losses. While the beauty segment shows promise, fashion remains a drag, causing uncertainty among investors.",
            "pubDate": "2025-06-02T08:49:11.734333"
        },
        {
            "title": "Technical picks: HDFC Life, Pidilite Industries among 5 stocks that can rally up to 20% in short term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-hdfc-life-pidilite-industries-among-5-stocks-that-can-rally-up-to-20-in-short-term/slideshow/121564858.cms",
            "description": "Indian equity benchmarks ended slightly lower on Friday but recorded a third consecutive monthly gain, buoyed by steady institutional inflows and strong corporate earnings, despite global trade and geopolitical concerns. The Nifty 50 rose 1.7% and the Sensex gained 1.5% in May. Amid this positive backdrop, analysts have identified five technical picks that could deliver gains of up to 20% in the near term.",
            "pubDate": "2025-06-02T08:49:11.734437"
        },
        {
            "title": "Mphasis, Persistent, and other IT stocks fall up to 6% amid renewed US-China trade tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mphasis-persistent-and-other-it-stocks-fall-up-to-6-amid-renewed-us-china-trade-tensions/articleshow/121566718.cms",
            "description": "Shares of Indian IT companies tumbled sharply amid renewed US-China trade tensions, with Mphasis leading losses, dropping 6.5% after FedEx ended its long-term deal. Persistent Systems, Tech Mahindra, and Wipro also fell. The Nifty IT index slipped over 1%, reflecting investor concerns over the escalating trade conflict and its impact on IT exports tied to the US market.",
            "pubDate": "2025-06-02T08:49:11.734541"
        },
        {
            "title": "India crowned top destination for stock compounders, says BofA; lists 9 structural themes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-crowned-top-destination-for-stock-compounders-says-bofa-lists-9-structural-themes/articleshow/121565634.cms",
            "description": "According to the International Monetary Fund, India is projected to be the fastest-growing major economy in 2025 and 2026. Over the past 30 years, Indian markets have delivered USD-based returns at a 7% CAGR, second only to the U.S. Notably, this performance has been driven primarily by earnings growth rather than valuation increases, distinguishing India on the global stage.",
            "pubDate": "2025-06-02T08:49:11.734638"
        },
        {
            "title": "Inox Wind shares slide 3% after Q4 results, but brokerages predict 21% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-shares-slide-3-after-q4-results-but-brokerages-predict-21-upside/articleshow/121565363.cms",
            "description": "Inox Wind shares dipped over 3% despite reporting a record 391% jump in Q4FY25 profit to Rs 190.34 crore. Revenue surged 130% YoY to Rs 1,311 crore. Brokerages remain bullish post-results, with target prices up to Rs 236, implying a 21% upside. Analysts cite strong execution, robust order book, and the Inox Wind Energy merger as key positives.",
            "pubDate": "2025-06-02T08:49:11.734743"
        },
        {
            "title": "European shares start lower after Trump's fresh tariff threats",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-start-lower-after-trumps-fresh-tariff-threats/articleshow/121566280.cms",
            "description": "European shares opened lower on Monday, after rounding off monthly gains in May, as U.S. President Donald Trump's new tariff plans threatened to rekindle global trade tensions.",
            "pubDate": "2025-06-02T08:49:11.734874"
        },
        {
            "title": "Japan's Nikkei ends lower on worries about US-China trade tension, stronger yen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-on-worries-about-us-china-trade-tension-stronger-yen/articleshow/121566248.cms",
            "description": "Japan's Nikkei share average ended lower on Monday amid worries over trade tensions between the U.S. and China, and a stronger yen, which hurt automakers.",
            "pubDate": "2025-06-02T08:49:11.734971"
        },
        {
            "title": "The Leela Hotels, Aegis Vopak Terminals shares surge up to 10% post listing. What should investors do now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aegis-vopak-terminals-the-leela-hotels-shares-surge-up-to-10-post-listing-what-should-investors-do-now/articleshow/121565910.cms",
            "description": "Aegis Vopak Terminals debuted at Rs 220, opening 6.4% below its IPO price of Rs 235. However, the stock swiftly rebounded, hitting the 10% upper circuit at Rs 241.95.",
            "pubDate": "2025-06-02T08:49:11.735065"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Butterfly Spread in Nifty for gains from bullish momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-butterfly-spread-in-nifty-for-gains-from-bullish-momentum/articleshow/121565022.cms",
            "description": "The Nifty index closed at 24,750 after losing 82 points. It finds support at the Bollinger Bands' middle band. This level has been a critical support zone. Nifty remains above the 61.8% Fibonacci retracement level. The RSI indicates a short-term loss of bullish momentum. Experts suggest a Bull Call Butterfly strategy to leverage bullish momentum while mitigating risk.",
            "pubDate": "2025-06-02T08:49:11.735157"
        },
        {
            "title": "Asia’s Crude Demand: Why lower prices aren’t boosting imports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asias-crude-demand-why-lower-prices-arent-boosting-imports/slideshow/121564702.cms",
            "description": "The OPEC+ group, consisting of eight members, recently agreed to raise oil output by 411,000 barrels per day (bpd) starting in July. This marks the third consecutive month where the group has maintained the same incremental increase in production. More than half of this additional output will come from the group’s largest producers: Saudi Arabia, Russia, and the United Arab Emirates.(Source: Reuters)",
            "pubDate": "2025-06-02T08:49:11.735249"
        }
    ]
}