{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-11T10:57:29.532638",
    "items": [
        {
            "title": "Trump tariffs, Q3 earnings among 8 factors to impact D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-tariffs-q3-earnings-among-8-factors-to-impact-d-street-this-week/articleshow/126461224.cms",
            "description": "Markets ended the week sharply lower as weak global cues and rising uncertainty triggered a broad risk-off move. Sentiment was hit by concerns over higher US tariffs on Indian exports, uncertainty around India–US trade ties, geopolitical tensions involving the US and Venezuela, and persistent selling by foreign institutional investors.",
            "pubDate": "2026-01-11T04:50:02.707511"
        },
        {
            "title": "ICICI Lombard alerts exchanges after employee shares draft Q3 results on WhatsApp",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-lombard-alerts-exchanges-after-employee-shares-draft-q3-results-on-whatsapp/articleshow/126461114.cms",
            "description": "ICICI Lombard reported a corporate governance lapse after draft financial results were accidentally posted on a senior employee's personal WhatsApp status. The insurer promptly removed the post and informed stock exchanges as a precaution. This incident highlights concerns over safeguarding sensitive information amid informal messaging, following a similar case with Hatsun Agro Product.",
            "pubDate": "2026-01-11T04:50:02.707641"
        },
        {
            "title": "Ahead of Market: 10 things to watch for stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-to-watch-for-stock-market-action-on-monday/articleshow/126461456.cms",
            "description": "Indian stock markets ended Friday with losses for the fifth day straight. The Sensex and Nifty declined as global trade worries and political uncertainty impacted investor mood. Analysts noted a consolidation phase driven by weak global cues and foreign investor outflows. Despite this, domestic GDP growth is expected to remain strong, with Q3 results potentially stabilizing sentiment.",
            "pubDate": "2026-01-11T05:42:01.688000"
        },
        {
            "title": "Volatility called Trump has a medicine, but being selective is a must. 7 hospital & healthcare stocks with upside potential of up to 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/volatility-called-trump-has-a-medicine-but-being-selective-is-a-must-7-hospital-healthcare-stocks-with-upside-potential-of-up-to-26/articleshow/126461694.cms",
            "description": "Stock-selection impacts the money you make in the market. Consider this: Suppose you bought Infosys on March 8, 2000, the day the dotcom boom peaked. Suppose you held the stock through the subsequent market crash. Adjusted for bonus and dividend, the stock returned to the March 8, 2000, level only by the end of 2005. Your situation would have been far worse had you bought other IT stocks. Wipro took over 15 years to recover. And don’t even ask about the fate of others. Some, like Satyam, just vanished. The lesson: When a sector is witnessing a bull run, it is important to be selective from many perspectives. And management ability tops the list.",
            "pubDate": "2026-01-11T05:54:36.471436"
        },
        {
            "title": "8 Nifty500 stocks with up to 75% upside — do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-nifty500-stocks-with-up-to-75-upside-do-you-own-any/slideshow/126462407.cms",
            "description": "The stock is currently trading at Rs 114. Analysts have set a target price of Rs 203, implying an upside potential of 78%. Of the seven analysts tracking the stock, the consensus recommendation stands at Strong Buy.",
            "pubDate": "2026-01-11T07:41:19.519726"
        },
        {
            "title": "FMCG players witness strong Q3 recovery on demand surge, margin expansion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fmcg-players-witness-strong-q3-recovery-on-demand-surge-margin-expansion/articleshow/126462708.cms",
            "description": "The FMCG sector anticipates strong volume growth and better operating margins for the December quarter. This positive outlook is fueled by GST reforms, robust festive sales, and easing raw material costs. Companies like Dabur, Marico, and Godrej Consumer Products report signs of recovery. Rural demand continues to outpace urban markets. Organized retail and e-commerce are also showing significant growth.",
            "pubDate": "2026-01-11T08:23:37.046187"
        },
        {
            "title": "Investors’ eye on 11 IPOs this week; GMPs hint at up to 45% listing gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-eye-on-11-ipos-this-week-gmps-hint-at-up-to-45-listing-gains/slideshow/126463638.cms",
            "description": "Armour Security opens on January 14 and closes on January 19, with listing expected on January 22. The IPO is currently commanding a modest GMP of Rs 1, indicating muted listing expectations.",
            "pubDate": "2026-01-11T09:55:07.528004"
        },
        {
            "title": "D-Street investors eye 11 IPOs this week; GMPs hint at up to 45% listing gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-eye-on-11-ipos-this-week-gmps-hint-at-up-to-45-listing-gains/slideshow/126463854.cms",
            "description": "A packed IPO calendar awaits investors next week, with 11 public issues in focus across mainboard and SME platforms. Of these, six IPOs are scheduled to open for subscription, while five companies are lined up to list, as grey market premiums (GMPs) point to potential listing gains of up to 45% in select names.",
            "pubDate": "2026-01-11T10:37:47.004894"
        },
        {
            "title": "8 Nifty500 stocks with up to 75% upside. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-nifty500-stocks-with-up-to-75-upside-do-you-own-any/slideshow/126463959.cms",
            "description": "Analyst forecasts go beyond mere numbers — they offer a strategic lens into future market potential. For investors looking out for the next breakout opportunity, Nifty500 stocks stand out as compelling picks. According to the estimates from Trendlyne, as many as Nifty500 stocks have the potential to deliver significant returns over the coming 12 months.These upside estimates, based on average analyst price targets, offer a data-driven reference point for investors scouting high-return opportunities within the Nifty 500. In this analysis, we highlight eight Nifty 500 stocks tracked by at least five analysts, each carrying an estimated upside of 50% to nearly 80% over the next 12 months.",
            "pubDate": "2026-01-11T10:37:47.005128"
        },
        {
            "title": "Narmadesh Brass Industries Rs 44.8-cr SME IPO to open on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/narmadesh-brass-industries-rs-44-8-cr-sme-ipo-to-open-on-monday/articleshow/126464046.cms",
            "description": "Gujarat-based Narmadesh Brass Industries, a manufacturer of brass products, announced on Sunday that its Rs 44.8-crore initial public offering will open for public subscription on the BSE's SME platform on January 12.",
            "pubDate": "2026-01-11T10:50:06.708714"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms erodes by Rs 3.63 lakh cr; Reliance biggest laggard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-erodes-by-rs-3-63-lakh-cr-reliance-biggest-laggard/articleshow/126464123.cms",
            "description": "The combined market valuation of seven of the top-10 most valued firms eroded by Rs 3,63,412.18 crore last week, with Reliance Industries emerging as the biggest laggard, amid a bearish trend in equities.",
            "pubDate": "2026-01-11T10:57:28.984516"
        }
    ]
}