{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-16T19:39:27.604703",
    "items": [
        {
            "title": "Holy trinity of promoters, FIIs and DIIs bought these 21 stocks. Can they be the next big stars?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/holy-trinity-of-promoters-fiis-and-diis-bought-these-21-stocks-can-they-be-the-next-big-stars/articleshow/123329730.cms",
            "description": "In the June 2025 quarter, 21 companies saw simultaneous buying from promoters, FIIs, and DIIs, signaling confidence in long-term prospects despite mixed stock performance. Experts view this “holy trinity” alignment as a strong indicator of underlying business strength and investor trust.",
            "pubDate": "2025-08-16T06:45:27.116110"
        },
        {
            "title": "Power Grid, Suzlon, UltraTech among 5 stocks with 28% potential upside. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-grid-suzlon-ultratech-among-5-stocks-with-28-potential-upside-heres-why/slideshow/123329532.cms",
            "description": "Even as markets remain topsy-turvy (Nifty down 2%) amid lacklustre Q1 and tariff-related uncertainties, a couple of brokerages have picked their conviction buys with potential upside of 28%. Here's what they recommended and why: Buy Power Grid around Rs 289 | Target: 369 | Upside: 28%",
            "pubDate": "2025-08-16T06:45:27.116233"
        },
        {
            "title": "Investors react to US-Russia summit reaching no agreement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-react-to-us-russia-summit-reaching-no-agreement/articleshow/123329403.cms",
            "description": "The Trump-Putin Alaska summit ended without any breakthrough on Ukraine, though both leaders cited progress on unspecified issues. Markets reacted calmly, with analysts noting no sanctions impact and limited geopolitical influence on investor sentiment.",
            "pubDate": "2025-08-16T06:45:27.116339"
        },
        {
            "title": "From Paytm to Eternal: 42 stocks where India's top performing PMS fund managers are betting on",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-paytm-to-eternal-42-stocks-where-indias-top-performing-pms-fund-managers-are-betting-on/articleshow/123329257.cms",
            "description": "India’s top-performing PMS funds placed bold bets in July across 42 stocks, spanning fintech giants, healthcare disruptors, agrochemicals, and industrial leaders. With strategies focused on digital disruption, speciality chemicals, and consumption growth, money managers are positioning portfolios for India’s next phase of growth.",
            "pubDate": "2025-08-16T06:45:27.116442"
        },
        {
            "title": "Wall Street Week Ahead: US stocks train sights on Jackson Hole Fed gathering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-stocks-train-sights-on-jackson-hole-fed-gathering/articleshow/123329006.cms",
            "description": "Investors are keenly waiting for the Jackson Hole symposium. Federal Reserve policymakers will gather to discuss interest rate cuts. These cuts could potentially boost stock prices. Jerome Powell's speech on Friday will be crucial. Market anticipates further rate cuts this year. Sectors like homebuilders and industrials may benefit. Powell needs to balance economic outlook to avoid market disruption.",
            "pubDate": "2025-08-16T06:45:27.116539"
        },
        {
            "title": "World equities flat, crude oil prices fall as Trump, Putin hold high-stakes talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/world-equities-flat-crude-oil-prices-fall-as-trump-putin-hold-high-stakes-talks/articleshow/123328995.cms",
            "description": "Global stock markets remained stable near record highs on Friday. Donald Trump and Vladimir Putin met in Alaska to discuss Ukraine. US Treasury bond prices declined amid expectations of a Federal Reserve rate cut. The Dow reached a new intraday high. European shares saw a slight pullback after nearing a five-month high.",
            "pubDate": "2025-08-16T06:45:27.116633"
        },
        {
            "title": "European shares log second weekly gain, focus on Trump-Putin talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-log-second-weekly-gain-focus-on-trump-putin-talks/articleshow/123328972.cms",
            "description": "European shares experienced a slight dip, influenced by declines in tech and financial sectors, even as investors eyed the U.S.-Russia summit. While miners and healthcare showed gains, corporate earnings painted a mixed picture. Pandora's significant fall due to weakening sales and Standard Chartered's probe call impacted market sentiment.",
            "pubDate": "2025-08-16T06:45:27.116724"
        },
        {
            "title": "Dow ends higher after UnitedHealth gains, other indexes slip on rate cut uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-ends-higher-after-unitedhealth-gains-other-indexes-slip-on-rate-cut-uncertainty/articleshow/123328955.cms",
            "description": "The Dow Jones closed higher, hitting a record high, propelled by UnitedHealth's surge after Berkshire Hathaway increased its stake. Other indexes slipped amid mixed economic data impacting Federal Reserve's policy decisions. Investors are anticipating a potential rate cut in September. Trump and Putin's meeting in Alaska raised hopes for resolving the Ukraine conflict and influencing crude prices.",
            "pubDate": "2025-08-16T06:45:27.116830"
        },
        {
            "title": "It's only a matter of time before Trump blinks on tariff: Chris Wood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/its-only-a-matter-of-time-before-trump-blinks-on-tariff-chris-wood/articleshow/123328778.cms",
            "description": "Christopher Wood suggests buying Indian equities despite US tariffs. He believes Trump will eventually reverse the tariffs. Wood highlights India's geopolitical importance and notes the unusual nature of the tariffs. He mentions India's underperformance in equities and links the second tariff tranche to India's Russian oil purchases. Wood also observes the US Federal Reserve's potential rate cut in September.",
            "pubDate": "2025-08-16T06:45:27.116923"
        },
        {
            "title": "Vikram Solar, 5 other IPOs to open next week. Here's what GMPs suggest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikram-solar-5-other-ipos-to-open-next-week-heres-what-gmps-suggest/slideshow/123331742.cms",
            "description": "It will be an IPO-studded week ahead as 5 mainboard initial public offerings (IPOs) and one SME issue will hit the primary markets. Here is a sneak peek into their grey market premiums (GMPs) ahead of the opening. GMP is the premium (or discount) at which an IPO’s shares are traded unofficially before their official listing on the stock exchange. They are dynamic and subject to change.",
            "pubDate": "2025-08-16T08:53:16.579156"
        },
        {
            "title": "Berkshire's 13F filing reveals Warren Buffett's 7 big stock moves in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshires-13f-filing-reveals-warren-buffetts-7-big-stock-moves-in-q2/slideshow/123331577.cms",
            "description": "Warren Buffett’s Berkshire Hathaway disclosed major portfolio shifts in its second-quarter 13F filing, surprising markets with a fresh healthcare bet while trimming long-held stakes and exiting a major telecom position. The $300 billion portfolio, long a reflection of Buffett’s investing style, showed both defensive moves and opportunistic bets. Here are the seven big stock moves revealed in Berkshire’s latest filing.",
            "pubDate": "2025-08-16T08:53:16.579273"
        },
        {
            "title": "How markets may react to Trump-Putin talks and Modi’s GST tax reform on Monday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-markets-may-react-to-trump-putin-talks-and-modis-gst-tax-reform-on-monday/articleshow/123331263.cms",
            "description": "Global equities may open positive as Trump and Putin reached an “understanding” on Ukraine, easing tensions. Meanwhile, PM Modi’s GST reforms promise lower rates, boosting consumption, investor sentiment, and potentially driving Indian equities higher in the festive season.",
            "pubDate": "2025-08-16T08:53:16.579381"
        },
        {
            "title": "Vanguard’s India portfolio shines: 10 stocks rally up to 80% in FY26. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vanguards-india-portfolio-shines-10-stocks-rally-up-to-80-in-fy26-do-you-own-any/slideshow/123331080.cms",
            "description": "",
            "pubDate": "2025-08-16T08:53:16.579477"
        },
        {
            "title": "Concurrent Gainers: 9 smallcap stocks that gain for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-9-smallcap-stocks-that-gain-for-5-days-in-a-row/slideshow/123330721.cms",
            "description": "Over the five trading sessions ending on August 14, the Sensex remained largely flat with a slight negative bias, slipping just 26 points to close at 80,597. The benchmark index ended in the red on two out of the five days (from August 8 to 14). Despite the overall market being flat and somewhat volatile, nine smallcap stocks consistently gained across all five sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-08-16T08:53:16.579572"
        },
        {
            "title": "FIIs sell Indian equities worth Rs 20,975 crore in August so far. Can Trump-Putin's Ukraine “understanding” reverse trends?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-sell-indian-equities-worth-rs-20975-crore-in-august-so-far-can-trump-putins-ukraine-understanding-reverse-trends/articleshow/123333156.cms",
            "description": "Foreign investors sold Indian equities worth Rs 20,975 crore in August so far, extending FII outflows despite strong DII buying. Analysts say Trump-Putin’s Ukraine “understanding,” easing tariff concerns, and India’s S&P rating upgrade may improve sentiment, though weak earnings growth and elevated valuations continue to weigh on markets.",
            "pubDate": "2025-08-16T11:23:16.250237"
        },
        {
            "title": "Nifty consolidates below resistance, key supports hold amid cautious outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-consolidates-below-resistance-key-supports-hold-amid-cautious-outlook/articleshow/123332985.cms",
            "description": "Nifty remains range-bound, consolidating below the 24,800–25,000 resistance zone. While the index holds above key moving averages, weak momentum and falling trendline resistance cap upside, leaving the market cautious yet resilient with crucial support at 24,200.",
            "pubDate": "2025-08-16T11:23:16.250372"
        },
        {
            "title": "Unofficial gauges: What they say is more important than you think; 4 retail stocks with an upside potential of over 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unofficial-gauges-what-they-say-is-more-important-than-you-think-4-retail-stocks-with-an-upside-potential-of-over-22/articleshow/123338567.cms",
            "description": "Every economy has its unofficial gauges, the indicators that go beyond GDP releases and inflation reports to capture the pulse of how people actually feel. In India, nothing reveals consumer confidence more directly than how households open their wallets during the festive season. Diwali, Dussehra, Durga Puja, Christmas, and the New Year are more than cultural rituals, they are economic events, driving an outsized share of annual retail sales. Watching which companies benefit, how much they benefit, and how they guide investors afterward is one of the sharpest ways to understand the undercurrents of India’s economy.",
            "pubDate": "2025-08-16T19:39:26.050005"
        },
        {
            "title": "History of wealth creators: Everything should be in context, whether it is PE or PEG; on a standalone basis they mean nothing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/history-of-wealth-creators-everything-should-be-in-context-whether-it-is-pe-or-peg-on-a-standalone-basis-they-mean-nothing/articleshow/123337048.cms",
            "description": "Conventional wisdom suggests that a PEG below 1 is a bargain, a PEG equal to 1 is fair, and anything above is too rich. Textbooks, broker reports, and online forums all echo the same refrain: Avoid stocks with PEGs of 1.5 or 2, because they are overpriced. But history tells a different story. The best of the wealth creators have spent long stretches trading on PEGs comfortably above 1, often above 2, and yet delivered extraordinary returns. To understand why, one has to look beyond the formula to the essence of what investors are truly paying for: The quality and durability of growth.",
            "pubDate": "2025-08-16T19:39:26.050128"
        }
    ]
}