{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-12T11:48:28.551496",
    "items": [
        {
            "title": "Stocks to Buy | Why Sandip Sabharwal believes these 2 sectors are long-term winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-why-sandip-sabharwal-believes-these-2-sectors-are-long-term-winners/slideshow/121106240.cms",
            "description": "Market expert Sandip Sabharwal in an interview to ET Now said that the announcement of a ceasefire with Pakistan is a major relief for Indian financial markets. He notes that this is complemented by positive developments on the global front, such as progress in US-China trade discussions and the possibility of Ukraine-Russia dialogue. Sandip highlights that the geopolitical environment is shifting from negative to constructive with surprising speed, which could boost equities while safe-haven assets like gold may see a correction.",
            "pubDate": "2025-05-12T11:48:07.466572"
        },
        {
            "title": "Metal stocks surge over 8% as US-China tariff truce lifts market sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metal-stocks-surge-over-8-as-us-china-tariff-truce-lifts-market-sentiment/articleshow/121105132.cms",
            "description": "Domestic metal stocks rallied over 8% after the US and China agreed to ease tariffs for 90 days, boosting global metal prices and market sentiment.",
            "pubDate": "2025-05-12T11:48:07.466704"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 31% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-31-in-1-year/articleshow/121104702.cms",
            "description": "As far as the market is concerned, two worrying “events” are now behind it. One, which was important from a domestic perspective, was the India-Pakistan tensions. And two: On the tariffs front, the US stands seems to have mellowed vis-a-vis the rest of the world. There is thus a high possibility that we will see a more bullish than bearish move in equity markets worldwide. And India will be no different. So, be bullish. But be selective and cautious as well.",
            "pubDate": "2025-05-12T11:48:07.466817"
        },
        {
            "title": "Sensex zooms 3,000 points, Nifty eyeing 25K. Should you trust the stock market rally or it’s a trap in disguise?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-zooms-2700-points-nifty-eyeing-25k-should-you-trust-the-stock-market-rally-or-its-a-trap-in-disguise/articleshow/121103480.cms",
            "description": "Dalal Street staged a powerful comeback as the Sensex surged over 3,000 points and the Nifty crossed 24,900, driven by a surprise India-Pakistan ceasefire, easing global tensions, and robust foreign inflows. Analysts remain cautiously optimistic, citing strong domestic macros but flagging risks in pharma and the potential for short-term overenthusiasm as geopolitical and economic uncertainties persist.",
            "pubDate": "2025-05-12T11:48:07.466944"
        },
        {
            "title": "BSE, Solar Industries among 6 midcap stocks hit 52-week highs after relief rally on India-Pakistan ceasefire",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-solar-industries-among-6-midcap-stocks-hit-52-week-highs-after-relief-rally-on-india-pakistan-ceasefire/slideshow/121102924.cms",
            "description": "Indian benchmark equity indices Sensex and Nifty50 jumped over 2.5% on Monday as India held a ceasefire with Pakistan over the weekend after four days of cross-military strikes, the worst in nearly three decades. During the session, six midcap stocks from the Nifty200 index hit fresh 52-week highs. Here's a look:",
            "pubDate": "2025-05-12T11:48:07.467053"
        },
        {
            "title": "Could India-Pakistan tensions spark market turmoil? Mark Mobius identifies sectors in spotlight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/could-india-pakistan-tensions-spark-market-turmoil-mark-mobius-identifies-sectors-in-spotlight/articleshow/121101828.cms",
            "description": "Mark Mobius advises India to maintain military readiness amid ongoing tensions with Pakistan, anticipating potential market volatility. Despite geopolitical concerns and regulatory hurdles, Mobius remains bullish on the Indian market, particularly in defence, pharmaceuticals, and IT sectors. He also acknowledges uncertainty in the US-China trade conflict, highlighting Taiwan as a key issue.",
            "pubDate": "2025-05-12T11:48:07.467156"
        },
        {
            "title": "China stocks rally, yuan gains after U.S.-China reach trade deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-rally-yuan-gains-after-u-s-china-reach-trade-deal/articleshow/121102084.cms",
            "description": "Chinese stocks rallied and the yuan strengthened on Monday after the United States and China said they have agreed to a deal to slash reciprocal tariffs in a substantial de-escalation of a potentially damaging trade war.",
            "pubDate": "2025-05-12T11:48:07.467251"
        },
        {
            "title": "Japan's Nikkei ends higher on US-China trade deal hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-higher-on-us-china-trade-deal-hopes/articleshow/121101995.cms",
            "description": "Japan's Nikkei share average ended higher on Monday as indications of progress in U.S.-China trade talks boosted hopes of a deal between the major economies.",
            "pubDate": "2025-05-12T11:48:07.467344"
        },
        {
            "title": "European shares rise as US, China hail 'constructive' Geneva trade talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-as-us-china-hail-constructive-geneva-trade-talks/articleshow/121101681.cms",
            "description": "European shares rose on Monday, as investors welcomed signs of progress in U.S.-China trade talks aimed at cooling a trade war between the world's two largest economies and dispelling some of the uncertainty clouding financial markets.",
            "pubDate": "2025-05-12T11:48:07.467448"
        },
        {
            "title": "Stocks to Buy | Investing Insight: Mark Mobius’s take on Geopolitics,  India, China and the road ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-investing-insight-mark-mobiuss-take-on-geopolitics-india-china-and-the-road-ahead/slideshow/121101880.cms",
            "description": "Mark Mobius in an interview to ET Now commended India for its effective handling of the recent tensions with Pakistan. However, he emphasized the need for continuous vigilance and military preparedness, as such conflicts may reoccur. He noted that lasting peace would only be possible if Pakistan undergoes substantial internal reform, a process he expects to take considerable time.",
            "pubDate": "2025-05-12T11:48:07.467546"
        },
        {
            "title": "F&O Radar | Deploy Bear Put Butterfly Spread in Sensex to play bearish momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bear-put-butterfly-spread-in-sensex-to-play-bearish-momentum/articleshow/121101054.cms",
            "description": "Indian stock markets witnessed a significant downturn on Friday, with the Sensex plummeting 880 points to close at 79,454, due to escalating India-Pakistan tensions. This geopolitical uncertainty, coupled with bearish technical indicators like a lower high, lower low sequence and a bearish RSI crossover, has heightened market volatility. The India VIX surged to 21.",
            "pubDate": "2025-05-12T11:48:07.467639"
        },
        {
            "title": "Tata Motors Q4 Preview: PAT may fall 36% YoY on higher costs; revenue to stay flat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-q4-preview-pat-may-fall-36-yoy-on-higher-costs-revenue-to-stay-flat/articleshow/121100717.cms",
            "description": "Tata Motors Q4FY25 performance may be mixed with flat revenue and margin pressure, especially at JLR. Analysts foresee weak profit due to higher costs, despite JLR volume growth. Domestic PV margins may improve slightly amid headwinds.",
            "pubDate": "2025-05-12T11:48:07.467734"
        },
        {
            "title": "Zen Tech and other defence stocks rally up to 8% after ceasefire fuels hopes of higher military spending",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zen-tech-ideaforge-other-defence-stocks-rally-up-to-8-after-ceasefire-fuels-hopes-of-higher-military-spending/articleshow/121100140.cms",
            "description": "Indian defence stocks surged, fueled by a ceasefire along the India-Pakistan border and expectations of increased military spending. The government's push for defence sector reforms and ambitious export targets further boosted investor confidence. Analysts highlight the potential for Indian companies to capitalize on heightened geopolitical activity and growing export opportunities, particularly with AI and robotics integration.",
            "pubDate": "2025-05-12T11:48:07.467829"
        },
        {
            "title": "Tata Motors shares rally 3% as investors eye dividend, JLR outlook ahead of Q4 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-rally-3-as-investors-eye-dividend-jlr-outlook-ahead-of-q4-results/articleshow/121100272.cms",
            "description": "Tata Motors shares: Tata Motors is scheduled to release its earnings for the March quarter and the full fiscal year on Tuesday, May 13. In addition, the Board of Directors will review a proposal for a dividend for FY25, the company disclosed in a stock exchange filing.",
            "pubDate": "2025-05-12T11:48:07.467942"
        },
        {
            "title": "Japan's Balancing Act: Tariffs, taxes and debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-balancing-act-tariffs-taxes-and-debt/slideshow/121099977.cms",
            "description": "Japan is facing economic pressure due to higher tariffs imposed by the United States. Prime Minister Shigeru Ishiba stated that the government is prepared to take additional steps to cushion the blow and support the economy, especially for those most affected. (Source: Reuters)",
            "pubDate": "2025-05-12T11:48:07.468041"
        },
        {
            "title": "Ideaforge shares rally 8% despite calm skies over Pakistan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ideaforge-shares-rally-8-despite-calm-skies-over-pakistan/articleshow/121099227.cms",
            "description": "ideaForge Technology specializes in manufacturing Unmanned Aircraft Systems (UAS), producing UAVs tailored for mapping, security, and surveillance. Its drones are used in diverse applications, including mining area planning and detailed mapping solutions.",
            "pubDate": "2025-05-12T11:48:07.468138"
        }
    ]
}