{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-18T05:44:47.682852",
    "items": [
        {
            "title": "Negative Breakout: These 7 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-7-stocks-cross-below-their-200-dmas/slideshow/126048641.cms",
            "description": "In the Nifty500 pack, seven stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on December 17, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-12-18T01:57:11.468179"
        },
        {
            "title": "GIFT Nifty down 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126048386.cms",
            "description": "Indian markets saw choppy movement on Wednesday. Nifty closed lower by 41 points. Analysts suggest the underlying trend remains weak. Nifty is expected to find support around 25700-25650 levels. Any bounce back may face resistance around 25950-26000 levels. Foreign portfolio investors were net sellers.",
            "pubDate": "2025-12-18T01:57:11.468307"
        },
        {
            "title": "Stocks in news: Ola Electric, Vedanta, Akzo Nobel, Jio Financial, NTPC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ola-electric-vedanta-akzo-nobel-jio-financial-ntpc/articleshow/126048327.cms",
            "description": "Markets experienced volatility, closing with a marginal decline amid ongoing currency swings and mixed global signals. Analysts anticipate continued choppy price action, with key support at 25,700 and resistance around 25,950–26,050. Several companies, including Ola Electric, Vedanta, and NTPC, are in focus due to significant news developments.",
            "pubDate": "2025-12-18T01:57:11.468411"
        },
        {
            "title": "More drops for AI stocks drag Wall Street to its worst day in nearly a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/more-drops-for-ai-stocks-drag-wall-street-to-its-worst-day-in-nearly-a-month/articleshow/126048329.cms",
            "description": "U.S. stock markets experienced a downturn for the fourth consecutive day, primarily driven by declines in AI stocks. The S&P 500 saw its worst day in nearly a month, with companies like Broadcom, Oracle, and Nvidia facing significant drops. Concerns about AI investment profitability and rising corporate debt weighed on investor sentiment.",
            "pubDate": "2025-12-18T01:57:11.468535"
        },
        {
            "title": "Asian stocks decline as traders retreat from tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-decline-as-traders-retreat-from-tech/articleshow/126048312.cms",
            "description": "Asian markets opened lower mirroring losses in the US. Global investors adopted a risk-off approach. Technology stocks faced significant selling pressure. This sentiment impacted cryptocurrencies like Bitcoin. However, US futures showed a slight uptick. Concerns over AI company valuations and infrastructure spending are growing. This led to a rise in Treasury yields for longer maturities. Gold and silver prices surged.",
            "pubDate": "2025-12-18T01:57:11.468650"
        },
        {
            "title": "Shriram Finance board to weigh stake sale to MUFG",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-board-to-weigh-stake-sale-to-mufg/articleshow/126048279.cms",
            "description": "Shriram Finance's board will meet to consider selling an equity stake to Japan's MUFG, potentially for over ₹40,000 crore. This would be the largest strategic investment by an overseas lender in an Indian NBFC, following SMBC's investment in Yes Bank. The deal involves a primary issuance, with MUFG open to a higher stake later.",
            "pubDate": "2025-12-18T01:57:11.468750"
        },
        {
            "title": "Insurers may soon get direct equity access to unlisted cos",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurers-may-soon-get-direct-equity-access-to-unlisted-cos/articleshow/126048235.cms",
            "description": "A proposed bill could allow Indian insurers, managing over ₹70 lakh crore, to invest directly in unlisted companies, removing a long-standing legal bar. This move would align them with other state-backed institutions and unlock new long-term capital for infrastructure and entrepreneurial ventures by enabling direct equity investments in private limited companies.",
            "pubDate": "2025-12-18T01:57:11.468848"
        },
        {
            "title": "Can new acquisitions and capex drive Samvardhana stock to new highs?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-new-acquisitions-and-capex-drive-samvardhana-stock-to-new-highs/articleshow/126048187.cms",
            "description": "Samvardhana Motherson International's shares surged to a 52-week high, driven by anticipated revenue growth and margin expansion. The auto ancillary firm is investing heavily in new facilities and acquisitions, bolstering its order book and positioning for long-term industry consolidation and EV transition benefits.",
            "pubDate": "2025-12-18T01:57:11.468943"
        },
        {
            "title": "Margin trading book at record high in Nov, but growth rate dips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/margin-trading-book-at-record-high-in-nov-but-growth-rate-dips/articleshow/126048119.cms",
            "description": "Investor borrowing via Margin Trading Funding reached a record high in November. However, the growth rate decelerated compared to previous months. This slowdown is linked to the weak performance of mid- and small-cap stocks. The overall equity market turnover on NSE also saw a decline. Analysts suggest this trend may continue until key market indices show sustained upward movement.",
            "pubDate": "2025-12-18T01:57:11.469039"
        },
        {
            "title": "Sebi tweaks MF, IPO rules, skips conflict of interest changes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-tweaks-mf-ipo-rules-skips-conflict-of-interest-changes/articleshow/126048089.cms",
            "description": "The capital market regulator has approved significant changes to mutual fund fee structures, aiming for greater transparency and cost efficiency for investors. These reforms include reducing total expense ratios and brokerage fees, alongside simplifying IPO disclosures and revamping stock broker regulations. The board also deferred a decision on managing internal conflicts of interest.",
            "pubDate": "2025-12-18T01:57:11.469138"
        },
        {
            "title": "India VIX hits new low as directionless market drains volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-vix-hits-new-low-as-directionless-market-drains-volatility/articleshow/126048013.cms",
            "description": "India's Volatility Index (VIX) hit a fresh lifetime low of 9.84, reflecting expectations of reduced market swings. This decline is attributed to muted trading, a lack of significant market triggers, and reduced derivatives activity, with analysts noting a contraction in realized volatility and lower option premiums.",
            "pubDate": "2025-12-18T01:57:11.469245"
        },
        {
            "title": "Insurance companies must switch to 1600-series numbers by Feb 15: Trai",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurance-companies-must-switch-to-1600-series-numbers-by-feb-15-trai/articleshow/126048142.cms",
            "description": "All entities regulated by the Insurance Regulatory and Development Authority of India must use the designated numbering series for customer service and transaction-related calls, Trai said in a direction issued on Tuesday. The deadline was set in consultation with the insurance regulator.",
            "pubDate": "2025-12-18T01:57:11.469431"
        },
        {
            "title": "HCL Tech shares in focus on contract with Netherlands’ ASN Bank for digital transformation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-tech-shares-in-focus-on-contract-with-netherlands-asn-bank-for-digital-transformation/articleshow/126049478.cms",
            "description": "HCL Tech has been selected as a strategic partner by ASN Bank in the Netherlands to modernize its IT architecture under a multi-year agreement. This collaboration aims to consolidate IT services and enhance efficiency. The IT major's Q2 net profit remained flat year-on-year, while revenue from operations saw an 11% increase.",
            "pubDate": "2025-12-18T03:19:04.184793"
        },
        {
            "title": "World-beating 55,000% surge in Indian AI stock fuels bubble fears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/world-beating-55000-surge-in-india-ai-stock-fuels-bubble-fears/articleshow/126049271.cms",
            "description": "India's RRP Semiconductor, once the world's best-performing stock with a 55,000% surge, is now a cautionary tale. Despite negative revenue and a tiny employee base, online hype fueled its rise. Regulators are now examining the surge, highlighting risks for retail investors chasing AI proxies.",
            "pubDate": "2025-12-18T03:19:04.184915"
        },
        {
            "title": "Stocks to buy for 2026: RBL Bank, HDFC Life among 5 stocks that could give 10-30% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-rbl-bank-hdfc-life-among-5-stocks-that-could-give-10-30-return-in-1-year/slideshow/126049451.cms",
            "description": "Brokerage firms remain upbeat on select stocks across banking, insurance, retail and financial services, pointing to attractive valuation-led opportunities and improving earnings visibility.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-18T03:19:04.185018"
        },
        {
            "title": "HDFC AMC among other AMC stocks in focus after Sebi's mutual fund expense ratio rule changes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-among-other-amc-stocks-in-focus-after-sebis-mutual-fund-expense-ratio-rule-changes/articleshow/126049121.cms",
            "description": "As per the revised framework, the total mutual fund expense ratio will now consist of four separate components: the base expense ratio, brokerage, statutory levies, and regulatory levies.",
            "pubDate": "2025-12-18T03:19:04.185142"
        },
        {
            "title": "Ola Electric shares in focus after Bhavish Aggarwal offloads another 4.2 crore shares via open mkt transaction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-after-bhavish-aggarwal-offloads-another-4-2-crore-shares-via-open-mkt-transaction/articleshow/126048981.cms",
            "description": "The company, after Tuesday's stake sale, stated that the stake sale was a one-time, limited monetisation of a small portion of the promoter’s personal stake. The proceeds from the transaction are intended to fully repay a promoter-level loan worth Rs 260 crore.",
            "pubDate": "2025-12-18T03:19:04.185242"
        },
        {
            "title": "DCM Shriram Industries demerger: Last day to buy shares before Dec 19 record date. Here's what shareholders will receive",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dcm-shriram-industries-demerger-last-day-to-buy-shares-before-dec-19-record-date-heres-what-shareholders-will-receive/articleshow/126048823.cms",
            "description": "Shareholders whose names appear on the company’s register as of the record date will be entitled to receive equity shares in the two newly formed companies under the approved composite scheme of arrangement.",
            "pubDate": "2025-12-18T03:19:04.185347"
        },
        {
            "title": "Dr. Lal PathLabs shares turn ex-bonus tomorrow for 1:1 issue, last day to buy for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-lal-pathlabs-shares-turn-ex-bonus-tomorrow-for-11-issue-last-day-to-buy-for-eligibility/articleshow/126048794.cms",
            "description": "As per the corporate filings, the company will issue one fully paid-up bonus equity share of face value Rs 10 for every one existing fully paid-up equity share of Rs 10 held by shareholders as on the record date.",
            "pubDate": "2025-12-18T03:19:04.185444"
        },
        {
            "title": "Pajson Agro India shares to list today. Here's what GMP suggests",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pajson-agro-india-shares-to-list-today-heres-what-gmp-suggests/articleshow/126048744.cms",
            "description": "The Rs 74.45 crore book-built IPO was subscribed 6.5 times overall, led by qualified institutional buyers, who subscribed their portion nearly 11 times.",
            "pubDate": "2025-12-18T03:19:04.185535"
        },
        {
            "title": "HRS Aluglaze shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hrs-aluglaze-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126048683.cms",
            "description": "The Rs 51 crore book-built IPO was subscribed 44.83 times overall, driven by strong demand from non-institutional and retail investors",
            "pubDate": "2025-12-18T03:19:04.185626"
        },
        {
            "title": "KPI Green shares gain 4% on landmark deal with Botswana for renewable energy projects",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kpi-green-shares-gain-4-on-landmark-deal-with-botswana-for-renewable-energy-projects/articleshow/126050349.cms",
            "description": "KPI Green Energy shares surged following its parent company's MoU with Botswana for renewable energy development. The agreement aims to establish large-scale generation, storage, and transmission infrastructure, requiring an estimated $4 billion investment. This collaboration supports Botswana's net-zero goals and KP Group's international expansion.",
            "pubDate": "2025-12-18T04:41:44.868538"
        },
        {
            "title": "Tata Steel shares up 25% in 2025 after a sharp run-up. Should you chase the rally or brace for a pause?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-up-25-in-2025-after-a-sharp-run-up-should-you-chase-the-rally-or-brace-for-a-pause/articleshow/126050209.cms",
            "description": "Tata Steel shares have surged 25% in 2025, driven by expansion approvals like the Neelachal Ispat Nigam Ltd project and a strategic acquisition. While these moves promise long-term growth and margin improvement, mixed technical signals suggest a potential pause as the market weighs execution risk against future potential.",
            "pubDate": "2025-12-18T04:41:44.868668"
        },
        {
            "title": "Nifty’s worst performers of 2025: 10 stocks that took the biggest hit this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niftys-worst-performers-of-2025-10-stocks-that-took-the-biggest-hit-this-year/slideshow/126050140.cms",
            "description": "The Nifty 50 may have delivered near 10% returns in 2025, but not all stocks shared in the market’s resilience. A combination of earnings disappointments and sector-specific headwinds dragged several heavyweights sharply lower over the course of the year. Here’s a closer look at the 10 worst-performing Nifty stocks of 2025.",
            "pubDate": "2025-12-18T04:41:44.868775"
        },
        {
            "title": "Sensex falls over 300 pts, Nifty below 25,750 amid trade pact worries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-100-pts-nifty-below-25800-amid-trade-pact-worries/articleshow/126050154.cms",
            "description": "Indian stocks extended losses for a fourth session on Thursday, with the Sensex and Nifty falling amid U.S.-India trade deal uncertainty. However, a rebound in the rupee and renewed foreign investor buying offered some support. Global markets also saw declines, particularly in technology shares, while oil prices advanced due to geopolitical tensions.",
            "pubDate": "2025-12-18T04:41:44.868875"
        },
        {
            "title": "Meesho shares rally 8%, double from IPO price in just 7 sessions. What’s driving the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-rally-8-double-from-ipo-price-in-just-7-sessions-whats-driving-the-surge/articleshow/126050096.cms",
            "description": "Meesho shares have surged to a new record high, gaining 110% since their IPO. The company's market capitalization now exceeds Rs 1 lakh crore. International brokerage UBS initiated coverage with a Buy rating, predicting strong growth in Net Merchandise Value. This rally follows a successful IPO that saw significant demand from investors.",
            "pubDate": "2025-12-18T04:41:44.868978"
        },
        {
            "title": "TCS shares rise as co eyes global AI leadership. Check target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-as-co-eyes-global-ai-leadership-check-target-price/articleshow/126050017.cms",
            "description": "TCS shares: The company laid out an ambitious plan to become the world’s largest AI-led technology services firm. At its Analyst Day, TCS detailed a shift from traditional digital services to AI-centric enterprise transformation, anchored around a five-pillar strategy covering internal AI adoption, AI-driven services, future-ready talent, real-world client use cases, and ecosystem expansion.",
            "pubDate": "2025-12-18T04:41:44.869081"
        },
        {
            "title": "Sensex to cross 90,000 in 2026? What top brokerages predict in ET Markets poll",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-to-cross-90000-in-2026-what-top-brokerages-predict-in-et-markets-poll/articleshow/126049931.cms",
            "description": "Indian equities are poised for a blockbuster 2026, with a poll of 13 brokerages predicting the Sensex will surpass 90,000. This optimism stems from expected Fed rate cuts, accelerating earnings, and a potential reversal of foreign selloffs, with many anticipating foreign investor inflows.",
            "pubDate": "2025-12-18T04:41:44.869178"
        },
        {
            "title": "KSH International IPO Day 3: Check GMP trend, subscription update and key details. Should you subscribe?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ksh-international-ipo-day-3-check-gmp-trend-subscription-update-and-key-details-should-you-subscribe/articleshow/126049887.cms",
            "description": "The Rs 710-crore KSH International IPO entered its final day with muted investor response, as the grey market premium slipped back to zero. Subscription stood at 26% by Day 2, with retail interest relatively better, while NII participation remained weak and QIBs stayed on the sidelines.",
            "pubDate": "2025-12-18T04:41:44.869275"
        },
        {
            "title": "Sammaan Capital among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sammaan-capital-among-5-fampo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126049810.cms",
            "description": "As of December 17, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 6% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-18T04:41:44.869411"
        },
        {
            "title": "Titagarh Rail shares in focus on Rs 273-crore Indian Railways order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titagarh-rail-shares-in-focus-on-rs-273-crore-indian-railways-order-for-62-maintenance-vehicles/articleshow/126049719.cms",
            "description": "Titagarh Rail Systems secured a significant Rs 273.24 crore rail maintenance project from the Ministry of Railways for 62 Rail Borne Maintenance Vehicles. This contract, covering the entire lifecycle of the specialized machines, marks the company's expansion into integrated rail safety solutions. Despite a recent Q2FY26 dip, the company maintains a robust order book.",
            "pubDate": "2025-12-18T04:41:44.869514"
        },
        {
            "title": "Kaynes Technology and 6 other stocks close crossing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-and-6-other-stocks-close-crossing-below-vwap/slideshow/126049776.cms",
            "description": "On December 17, several stocks from the Nifty500 universe closed significantly below their VWAP, based on data from StockEdge.com. A close below VWAP suggests the stock traded at higher levels during the session but ended weaker, indicating increased selling pressure and the emergence of a short-term bearish trend.",
            "pubDate": "2025-12-18T04:41:44.869609"
        },
        {
            "title": "Vedanta demerger: Citi sees value as 5-way split approaches, debt stays in check",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-demerger-citi-sees-value-as-5-way-split-approaches-debt-stays-in-check/articleshow/126049651.cms",
            "description": "Vedanta’s plan to split into five listed, pure-play companies is moving closer to execution after tribunal approval, with Citi arguing the demerger could unlock value by narrowing the conglomerate discount. While key approvals and asset transfers are still pending, the brokerage says parent-level debt remains manageable and sees upside from aluminium prices, cost efficiencies and volume growth as the breakup advances toward its March 2026 target.",
            "pubDate": "2025-12-18T04:41:44.869706"
        },
        {
            "title": "Akzo Nobel shares in focus after Goldman Sachs buys Rs 106 crore worth stake in bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/akzo-nobel-shares-in-focus-after-goldman-sachs-buys-rs-106-crore-worth-stake-in-bulk-deal/articleshow/126049548.cms",
            "description": "Akzo Nobel India shares: Goldman Sachs bought shares worth ₹106 crore through a bulk deal, while promoter Imperial Chemical Industries sold a much larger stake worth ₹1,296 crore. The heavy promoter selling dragged the stock down over 11% in Wednesday’s session, despite Goldman’s purchase of about 3.36 lakh shares via its India equity portfolio.",
            "pubDate": "2025-12-18T04:41:44.869802"
        },
        {
            "title": "APL Apollo Tubes among 5 midcap stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-bajaj-auto-and-3-other-stocks-showing-bullish-rsi-upswing/slideshow/126049983.cms",
            "description": "On December 17, in the NSE midcap segment, five stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-12-18T04:41:44.870005"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs maintains buy on L&T; Motilal Oswal initiates coverage on Crompton Greaves Consumer Electricals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-maintains-buy-on-lt-motilal-oswal-initiates-coverage-on-crompton-greaves-consumer-electricals/articleshow/126050585.cms",
            "description": "Brokerages remain bullish on select large- and mid-cap stocks, citing strong earnings visibility and long-term growth drivers. Goldman Sachs reiterated a Buy on L&T, Nuvama maintained a positive view on TCS amid AI-led recovery hopes, while Motilal Oswal initiated coverage on Crompton Greaves Consumer Electricals with a Buy, pointing to a sharp earnings rebound and margin expansion potential.",
            "pubDate": "2025-12-18T04:58:52.785039"
        },
        {
            "title": "Fast Capital, Smart Dilution: Why QIPs are the go-to route for listed companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fast-capital-smart-dilution-why-qips-are-the-go-to-route-for-listed-companies/articleshow/126051282.cms",
            "description": "Qualified Institutional Placements have emerged as a key fundraising route in India, enabling listed companies to raise capital quickly from institutional investors. QIPs signal strategic intent, balance-sheet strengthening and growth readiness, while offering market-linked pricing, regulatory oversight and valuable insights for institutions and high-net-worth investors tracking capital flows.",
            "pubDate": "2025-12-18T05:44:46.335218"
        },
        {
            "title": "Explained: Why AMC stocks rallied up to 7% despite Sebi cutting total expense ratio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-amc-stocks-rallied-up-to-7-despite-sebi-cutting-total-expense-ratio/articleshow/126050934.cms",
            "description": "AMC and wealth management stocks saw a sharp uptick on Thursday after Sebi’s final expense ratio framework proved less harsh than feared. Investors cheered lower-than-expected TER cuts, the exclusion of GST from base expenses, and limited brokerage fee reductions, easing profit concerns for firms such as HDFC AMC, Nippon Life India AMC, and Nuvama Wealth.",
            "pubDate": "2025-12-18T05:44:46.335367"
        }
    ]
}