{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-28T01:41:34.229062",
    "items": [
        {
            "title": "Asian stocks mixed; dollar weakens before Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-dollar-weakens-before-fed-rate-decision/articleshow/127665577.cms",
            "description": "Asian currencies strengthened as the dollar weakened to a four-year low, driven by investor caution over unpredictable US policymaking. The dollar's decline accelerated after President Trump expressed indifference to its fall, fueling speculation about coordinated intervention. This backdrop precedes the Fed's interest-rate decision and a crucial week for megacap tech earnings.",
            "pubDate": "2026-01-28T01:41:25.422244"
        },
        {
            "title": "Stocks in news: Vodafone Idea, Hindustan Zinc, Vedanta, Marico, Vishal Mega Mart, Maruti and L&T",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vodafone-idea-hindustan-zinc-vedanta-marico-vishal-mega-mart-maruti-and-lt/articleshow/127638166.cms",
            "description": "Indian benchmark indices closed mixed on Tuesday, with the Nifty gaining on financial, IT, and metal stocks while the Sensex saw pressure from auto and FMCG. Several companies like Vodafone Idea, Vedanta, Marico, and Maruti Suzuki are in focus today due to their recent financial results and corporate actions.",
            "pubDate": "2026-01-28T01:41:25.422351"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127638401.cms",
            "description": "Indian stock indices Nifty and Sensex closed higher on Tuesday, driven by gains in financials, IT, and metals, despite selling in auto and FMCG sectors. The Nifty experienced a 300-point swing during the monthly expiry session. Analysts suggest a 'sell-on-rise' strategy until Nifty decisively breaks above 25,500.",
            "pubDate": "2026-01-28T01:41:25.422538"
        },
        {
            "title": "Auto companies fall on fear of more EU imports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-companies-fall-on-fear-of-more-eu-imports/articleshow/127663821.cms",
            "description": "Indian auto stocks experienced a decline following reports of potential tariff reductions on EU-imported vehicles as part of a free trade agreement. While some manufacturers like Mahindra & Mahindra and Hyundai saw sharper drops due to their presence in higher-priced segments, analysts believe the near-term impact will be limited, with the luxury segment being the primary area affected.",
            "pubDate": "2026-01-28T01:41:25.422633"
        },
        {
            "title": "RBI, European body ink MoU to end clearing house standoff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-european-body-ink-mou-to-end-clearing-house-standoff/articleshow/127663698.cms",
            "description": "The Reserve Bank of India and the European Securities and Markets Authority have signed a memorandum of understanding, resolving a two-year dispute over supervisory oversight of India's central clearing agencies. This agreement facilitates cooperation and information exchange, paving the way for European recognition of Indian clearing houses and potentially enhancing European access to India's financial markets.",
            "pubDate": "2026-01-28T01:41:25.422729"
        },
        {
            "title": "Shapoorji Pallonji Group looks to raise up to $2.5 billion to refinance debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shapoorji-pallonji-group-looks-to-raise-up-to-2-5-billion-to-refinance-debt/articleshow/127664250.cms",
            "description": "The proposed fundraise will be used to refinance a dollar bond backed by shares of Tata Sons, held through group entity Goswami Infratech, due to mature in April. The new transaction is expected to mirror the structure of the earlier deal, with Tata Sons shares continuing as collateral.",
            "pubDate": "2026-01-28T01:41:25.422936"
        },
        {
            "title": "RBI's 'core company' tag puts many promoter entities in a quandary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbis-core-company-tag-puts-many-promoter-entities-in-a-quandary/articleshow/127664159.cms",
            "description": "Corporate entities are navigating a fresh mandate from the Reserve Bank of India, which has reclassified holding and strategic investment firms as Core Investment Companies. This new label comes with a wave of rigorous regulations that many corporations are eager to sidestep, arguing that their revenue streams stem from non-financial sectors rather than financial endeavors.",
            "pubDate": "2026-01-28T01:41:25.423026"
        },
        {
            "title": "PSBs shun low yields, high costs to protect margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psbs-shun-low-yields-high-costs-to-protect-margins/articleshow/127664103.cms",
            "description": "Seven out of eight public sector banks that released quarterly results so far held on to or improved margins from the previous three months, helping them maintain profitability despite a challenging macro environment.",
            "pubDate": "2026-01-28T01:41:25.423118"
        },
        {
            "title": "RBI dividend may rise to Rs 3L-cr in FY27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-dividend-may-rise-to-rs-3l-cr-in-fy27/articleshow/127664025.cms",
            "description": "Estimates broadly peg the dividend to be around ₹3 lakh crore, compared with ₹2.7 lakh crore last year. RBI dividends have provided a significant boost to the government's non-tax revenues in recent years.",
            "pubDate": "2026-01-28T01:41:25.423301"
        },
        {
            "title": "Credit card spends bounce back in Dec, numbers also rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-card-spends-bounce-back-in-dec-numbers-also-rise/articleshow/127663073.cms",
            "description": "Credit card usage in Mumbai saw an 8% rebound last month, reaching ₹2.05 lakh crore due to seasonal demand and year-end spending. Net new card additions hit a three-month high of over 900,000, boosting the total active cards to 115.7 million. Analysts anticipate steady spending momentum, supported by ongoing consumption trends and festive demand.",
            "pubDate": "2026-01-28T01:41:25.423481"
        }
    ]
}