{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-02T05:18:47.864285",
    "items": [
        {
            "title": "Kotak Mahindra Bank shares rally over 2% on upgrades from both Jefferies and Citi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-rally-over-2-on-upgrades-from-both-jefferies-and-citi/articleshow/116871989.cms",
            "description": "Kotak Mahindra Bank shares rose 2.6% after Citi and Jefferies upgraded the stock to “buy,” with target prices of Rs 2,070 and Rs 2,120, citing strong loan growth, improving delinquency, and potential upside catalysts.",
            "pubDate": "2025-01-02T04:51:38.603660"
        },
        {
            "title": "Stock Radar: Campus Activewear breaks out of Inverse Head & Shoulders pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-campus-activewear-breaks-out-of-inverse-head-shoulders-pattern-time-to-buy/articleshow/116858115.cms",
            "description": "Campus Activewear stock peaked at Rs 371 on September 25, 2024, but dropped over 13% to Rs 322 by December 31. It found support above the 200-DMA in October and December, forming an Inverse Head & Shoulders pattern. A breakout from this bullish pattern signals a potential reversal to an uptrend.",
            "pubDate": "2025-01-02T04:51:38.603780"
        },
        {
            "title": "Street Favourites! 10 largecaps that analysts expect to soar by 67%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/street-favourites-10-largecaps-that-analysts-expect-to-soar-by-67/slideshow/116871451.cms",
            "description": "Brokerages remain optimistic about select largecap stocks across key sectors like banking, auto, and insurance. Trendlyne data shows that 10 BSE 100 index stocks, including Axis Bank, IndusInd Bank, Tata Motors, and SBI have high analyst ratings and can deliver up to 67%. Here's a list of these stocks:",
            "pubDate": "2025-01-02T04:51:38.603895"
        },
        {
            "title": "Stocks to buy today for 2025: Citi upgrades Kotak Mahindra Bank to buy; Investec sees 26% upside in NTPC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-for-2025-citi-upgrades-kotak-mahindra-bank-to-buy-investec-sees-26-upside-in-ntpc/articleshow/116871175.cms",
            "description": "Leading brokerage firms have upgraded their outlook for Kotak Mahindra Bank and NTPC for 2025. Citi has raised its rating on Kotak Mahindra Bank to 'Buy', with a target price of Rs 2,070, driven by strong loan growth and improving delinquency trends. Investec has maintained a 'Buy' rating on NTPC with a target price of Rs 421, seeing recent stock correction as a buying opportunity, especially as NTPC expands its renewable energy portfolio.",
            "pubDate": "2025-01-02T04:51:38.604002"
        },
        {
            "title": "Will the stock market crash in 2025? Watch out for these 6 risk factors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-the-stock-market-crash-in-2025-watch-out-for-these-6-risk-factors/articleshow/116871098.cms",
            "description": "The stock market in 2025 may face several risks such as earnings pressure, geopolitical tensions, trade frictions, and rate adjustments by the US Federal Reserve. Issues like smallcap and midcap market froth and the Chinese economic recovery could also impact market dynamics. Investors should be prepared for potential corrections and pressures on earnings growth.",
            "pubDate": "2025-01-02T04:51:38.604100"
        },
        {
            "title": "Financial, IT stocks lift Sensex over 350 points higher, Nifty tops 23,850",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/financial-it-stocks-lift-sensex-over-100-points-higher-nifty-tops-23750/articleshow/116870403.cms",
            "description": "Indian benchmark equity indices opened higher driven by gains in financial, auto, and IT stocks ahead of the quarterly earnings season. The BSE Sensex and Nifty50 showed early gains, with Tata Motors, Maruti Suzuki, and Mahindra & Mahindra leading the charge on the back of strong sales figures.",
            "pubDate": "2025-01-02T04:51:38.604219"
        },
        {
            "title": "These 5 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/116871027.cms",
            "description": "As of January 1, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-01-02T04:51:38.604321"
        },
        {
            "title": "10 stocks showing RSI Trending Up on January 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-stocks-showing-rsi-trending-up-on-january-1/slideshow/116870944.cms",
            "description": "On January 1, 10 stocks from the Nifty200 pack appeared in the RSI Trending Up scan, according to the stockedge.com data. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-01-02T04:51:38.604417"
        },
        {
            "title": "Breakout Stocks: How to trade Jubilant FoodWorks, Muthoot Finance & Laurus Labs on Thursday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-jubilant-foodworks-muthoot-finance-laurus-labs-on-thursday/articleshow/116870647.cms",
            "description": "Stocks that reached fresh highs included Jubilant FoodWorks, which rose nearly 3%, Muthoot Finance, which gained almost 4%, and Laurus Labs, which closed with more than a 2% increase on Wednesday.",
            "pubDate": "2025-01-02T04:51:38.604516"
        },
        {
            "title": "Stocks to buy today: M&M, Voltas among top 6 trading ideas for 2 January 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-mm-voltas-among-top-6-trading-ideas-for-2-january-2025/articleshow/116870545.cms",
            "description": "Indian market may consolidate on Thursday with Nifty futures gaining 0.42% to close at 23,907 on Wednesday. Options data indicates a broader trading range between 23,200 to 24,300 zones. An immediate range is predicted between 23,500 to 24,000 levels. Expert recommendations for short-term trades include United Spirits, M&M, Voltas, Coromandel International, Apollo Hospitals, and Jubilant FoodWorks.",
            "pubDate": "2025-01-02T04:51:38.604614"
        },
        {
            "title": "Reliance Power shares in focus after arm Sasan Power repays $150 million debt to IIFCL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-in-focus-after-arm-sasan-power-repays-150-million-debt-to-iifcl/articleshow/116870486.cms",
            "description": "Reliance Power's Sasan Power repaid $150 million debt, improving debt metrics, liquidity, and credit rating. It operates a 3,960 MW plant supplying power at Rs 1.54/unit to 14 DISCOMs. Reliance Power raised Rs 1,525 crore for growth in the renewable energy sector.",
            "pubDate": "2025-01-02T04:51:38.604710"
        },
        {
            "title": "CSB Bank shares climb 7% after strong Q3 performance: Deposits up 22%, advances climb 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/csb-bank-shares-in-focus-after-strong-q3-performance-deposits-up-22-advances-climb-26/articleshow/116870475.cms",
            "description": "Total deposits rose by 22.17% YoY to Rs 33,406 crore, driven by a 28.10% YoY increase in term deposits. Gross advances grew by 26.45%, and gold loan advances surged by 36.28%. Despite a small increase in net profit, the stock's average target price indicates a 27% upside.",
            "pubDate": "2025-01-02T04:51:38.604810"
        },
        {
            "title": "Supreme Power Equipment shares rally 2% on securing Rs 3.6 crore order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/supreme-power-equipment-stock-in-focus-on-securing-rs-3-6-crore-order/articleshow/116870222.cms",
            "description": "Shares of Supreme Power Equipment rose 2.3% on the NSE after securing a Rs 3.63 crore order from TRANTRANSCO. The company, a leading manufacturer of power transformers, will execute the order in three months. This significant order is expected to boost revenue and strengthen their relationship with TRANTRANSCO.",
            "pubDate": "2025-01-02T04:51:38.604905"
        },
        {
            "title": "Maruti Suzuki shares in focus as December total production volumes jump 30% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-shares-in-focus-as-december-total-production-volumes-jump-30-yoy/articleshow/116870263.cms",
            "description": "Maruti Suzuki shares may see increased attention after the company reported a 30.25% YoY rise in December production. Passenger vehicles saw a 30.16% increase, while the Super Carry model posted a 39.20% growth. Models like Alto, S-Presso, and utility vehicles experienced remarkable gains. The stock closed 3.26% higher at Rs 11,221.20 on the BSE.",
            "pubDate": "2025-01-02T04:51:38.605005"
        },
        {
            "title": "Bullish Momentum: 4 stocks with White Marubozu Pattern on January 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-4-stocks-with-white-marubozu-pattern-on-january-1/slideshow/116870162.cms",
            "description": "On January 1, four stocks from the NSE midcap pack came to the bullish scanner of \"White Marubozu\", according tostockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-01-02T04:51:38.605105"
        },
        {
            "title": "3 stocks closed crossing above VWAP on January 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/3-stocks-closed-crossing-above-vwap-on-january-1/slideshow/116869967.cms",
            "description": "On January 1, the closing prices of three stocks from the Nifty500 pack rallied over 1.5% relative to the VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that it is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors, potentially indicating positive sentiment in the market.",
            "pubDate": "2025-01-02T04:51:38.605220"
        },
        {
            "title": "Ashok Leyland shares jump 3% as December sales grow 5% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-jump-3-as-december-sales-grow-5-yoy/articleshow/116872962.cms",
            "description": "Ashok Leyland shares rose 3% after posting a 5% YoY increase in December sales, though cumulative sales fell 2%. M&HCV segment saw growth, with shares gaining 28.7% in the last year.",
            "pubDate": "2025-01-02T05:18:45.648746"
        },
        {
            "title": "HDFC Bank, Samvardhana Motherson International among 5 stocks with short covering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-samvardhana-motherson-international-among-5-stocks-with-short-covering/slideshow/116872843.cms",
            "description": "Short covering happens when traders buy back shares they previously sold short, often due to a shift in market sentiment or new information. This usually results in a decrease in open interest and can drive the stock price higher. In Thursday's trading session, five stocks saw short covering. Here's the list:",
            "pubDate": "2025-01-02T05:18:45.648878"
        },
        {
            "title": "Bajaj Finserv, IRFC among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-irfc-among-5-stocks-with-long-buildup/slideshow/116872696.cms",
            "description": "A long buildup occurs when open interest and trading volumes increase alongside a rise in the underlying stock price in the Futures and Options segment, signaling a bullish market trend. In Thursday's trading session, five stocks saw fresh long positions. Here’s the list:",
            "pubDate": "2025-01-02T05:18:45.648986"
        },
        {
            "title": "Gujarat Toolroom shares hit 5% upper circuit on plans to consider 5:1 bonus share issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-toolroom-shares-hit-5-upper-circuit-on-plans-to-consider-51-bonus-share-issue/articleshow/116872436.cms",
            "description": "Gujarat Toolroom shares surged 5% to Rs 18.08 after announcing a 5:1 bonus share issue in its upcoming board meeting. This would be the company's first-ever bonus issue, subject to shareholder approval.",
            "pubDate": "2025-01-02T05:18:45.649096"
        }
    ]
}