{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-06T02:52:20.296672",
    "items": [
        {
            "title": "Trump Media reports $19 mln loss in third quarter on TV streaming costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trump-media-reports-19-mln-loss-in-third-quarter-on-tv-streaming-costs/articleshow/114998215.cms",
            "description": "Trump Media & Technology Group faced a loss of $19.2 million in the third quarter. The company attributed this to legal fees and costs associated with its TV streaming deal. The company spent $12.1 million on legal fees related to acquiring TV streaming technology and its SPAC deal. Despite the loss, shares of the company rose slightly.",
            "pubDate": "2024-11-06T02:52:15.476523"
        },
        {
            "title": "Q2 results today: Tata Steel, Apollo Hospitals among 98 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-tata-steel-apollo-hospitals-among-98-companies-to-announce-earnings-on-wednesday/articleshow/114998164.cms",
            "description": "Get ready for a busy day in the Indian stock market. 63 companies will reveal their July-September earnings today.  Keep an eye on major players like Power Grid and Tata Steel.  Apollo Hospitals is expected to report strong numbers. Tata Steel might face challenges due to declining realizations.  Stay tuned for the detailed financial results and expert analysis.",
            "pubDate": "2024-11-06T02:52:15.476640"
        },
        {
            "title": "JK Tyres Q2 net falls 42% on weak demand, high natural rubber prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jk-tyres-q2-net-falls-42-on-weak-demand-high-natural-rubber-prices/articleshow/114997978.cms",
            "description": "JK Tyre & Industries' consolidated net profit plummeted by 42% in the September quarter, primarily due to a downturn in the commercial vehicle sector and a surge in natural rubber prices. Despite implementing price hikes, the company experienced a decline in revenue and margins.",
            "pubDate": "2024-11-06T02:52:15.476743"
        }
    ]
}