{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-19T05:19:23.752904",
    "items": [
        {
            "title": "Market Trading Guide: Top stock recommendations for Monday with up to 8% upside scope",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-top-stock-recommendations-for-monday-with-up-to-8-upside-scope/slideshow/124682431.cms",
            "description": "India’s benchmark indices Nifty and Sensex ended with strong gains on Friday, hitting their 52-week highs led by FMCG, auto, and bank stocks. The sentiment around Nifty remains upbeat as the index moved above its four-month consolidation range.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities, said that large-cap stocks clearly outperformed on Friday, leaving behind midcap and smallcap stocks — a classic bull market scenario. In the early phase of a classic bull run, largecaps usually lead the rally, followed by midcap and smallcap companies, he said. “Technically, Nifty looks strong for a decent upside from here, and a ‘buy on dips’ strategy might prove effective. On the lower end, meaningful support is placed at 25,500, while resistance is seen at 25,850–26,000,” De added. Here are 2 stock recommendations for Monday:",
            "pubDate": "2025-10-19T04:42:41.360947"
        },
        {
            "title": "Festive cheer: 10 smallcap stocks rallied up to 42% in pre-Diwali buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/festive-cheer-10-smallcap-stocks-rallied-up-to-42-in-pre-diwali-buzz/slideshow/124682416.cms",
            "description": "A few of India’s smallcap stocks rose in the pre-Diwali rally even as the broader market consolidated. Here are the top 10 names that surged by up to 42% last week.",
            "pubDate": "2025-10-19T04:42:41.361080"
        },
        {
            "title": "Sensex surges 1,900 points in 3 days. What’s in store for investors this Diwali?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-surges-1900-points-in-3-days-whats-in-store-for-investors-this-diwali/articleshow/124682117.cms",
            "description": "India's stock market is delivering the ultimate festive gift. With Nifty scaling fresh 52-week highs and the Sensex rocketing over 1,900 points in just three sessions, investors are entering the holiday week riding a wave of renewed confidence.",
            "pubDate": "2025-10-19T04:42:41.361193"
        },
        {
            "title": "Dussehra to Diwali: 6 penny stocks skyrocket up to 65%. Did you miss festive rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dussehra-to-diwali-6-penny-stocks-skyrocket-up-to-65-did-you-miss-festive-rally/slideshow/124682571.cms",
            "description": "As festive lights brighten the markets, six penny stocks have emerged as shining stars, soaring between 35% and 65% in just over two weeks — from Dussehra to Diwali. This pre-Diwali rally reflects investor optimism, bullish sentiment, and a hunt for value in the microcap space. These top performers were identified using a targeted screening approach that focused on stocks with a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a recent trading volume of at least 5 lakh shares. This strategy is designed to highlight low-priced, actively traded small-cap stocks demonstrating strong upward momentum. (Data Source: ACE Equity)",
            "pubDate": "2025-10-19T05:19:22.955388"
        }
    ]
}