{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-16T06:56:51.019155",
    "items": [
        {
            "title": "Reliance Industries Q2 results preview: O2C, Jio to power 11% profit growth; retail seen lagging",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q2-results-preview-o2c-jio-to-power-11-profit-growth-retail-seen-lagging/articleshow/124595484.cms",
            "description": "Reliance Industries is poised for an 11% year-on-year profit increase in Q2FY26, driven by strong performance in its Oil-to-Chemicals and telecom segments. While retail growth is expected to moderate slightly, Jio's subscriber momentum and ARPU uptick will sustain its steady growth trajectory.",
            "pubDate": "2025-10-16T05:13:34.267367"
        },
        {
            "title": "Jio Financial Q2 results today: Shares in bullish setup with potential 9% upside. 5 key things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q2-results-today-shares-in-bullish-setup-with-potential-9-upside-5-key-things-to-track/articleshow/124595383.cms",
            "description": "Jio Financial Services shares are gaining momentum. Analysts expect strong Q2 FY26 results. The stock is consolidating above Rs 300-Rs 310. Investors will watch profit and revenue growth. Consumer business performance and the BlackRock partnership are key. Technically, the stock is in a bullish setup.",
            "pubDate": "2025-10-16T05:13:34.267484"
        },
        {
            "title": "Angel One shares rally 4% as Q2 profit soars 85% QoQ to Rs 212 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/angel-one-shares-in-focus-as-q2-profit-slumps-50-yoy-to-rs-212-crore/articleshow/124594789.cms",
            "description": "In a surprising turn of events, Angel One's shares soared following a report of sequential profit growth. Nonetheless, their year-on-year earnings took a hit, largely influenced by new regulations that have transformed the landscape of derivatives trading.",
            "pubDate": "2025-10-16T05:13:34.267587"
        },
        {
            "title": "GST impact caps HDFC Life’s Q2 profit growth at 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gst-impact-weighs-on-hdfc-lifes-q2-profit-growth-up-3/articleshow/124594440.cms",
            "description": "HDFC Life Insurance saw a profit rise of 3.27% in the July-September quarter of FY26. Net premium income grew over 13%. A one-time GST impact affected profits. The company expects this drag to fade by year-end. Management expenses increased. Persistency rates saw a decline. HDFC Life plans to raise Rs 750 crore to boost its solvency ratio.",
            "pubDate": "2025-10-16T05:13:34.267688"
        },
        {
            "title": "Nuvoco Vistas reports strong Q2 performance with 62% EBITDA surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nuvoco-vistas-reports-strong-q2-performance-with-62-ebitda-surge/articleshow/124592992.cms",
            "description": "Nuvoco Vistas reported a profit of Rs 36.43 crore for the September quarter. This marks a significant turnaround from a loss in the same period last year. The company's earnings before interest, tax, depreciation, and amortisation surged by 62%. Revenue also saw an 8% year-on-year increase. Nuvoco Vistas is expanding its production capacity to 35 million tonnes by FY27.",
            "pubDate": "2025-10-16T05:13:34.267800"
        },
        {
            "title": "Axis Bank reports 26% drop in Q2 net profit amid one-time provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-reports-26-drop-in-q2-net-profit-amid-one-time-provisions/articleshow/124592933.cms",
            "description": "Axis Bank reported a 26% drop in September-quarter net profit to ₹5,090 crore, primarily due to a one-time ₹1,231 crore standard asset provision for discontinued crop loan variants. Despite this, net interest income rose 2% year-on-year to ₹13,745 crore, with the bank optimistic about GST cuts and retail loan growth.",
            "pubDate": "2025-10-16T05:13:34.267912"
        },
        {
            "title": "Nestle India Q2 Results: Cons PAT declines 17% YoY to Rs 743 crore,  but revenue rises 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-india-q2-results-standalone-pat-declines-24-yoy-to-rs-753-crore-but-revenue-rises-10/articleshow/124597433.cms",
            "description": "Nestle India Q2 Results: ​​The revenue for Q2 FY26 stood at Rs 5,643.61 crore, compared with Rs 5,104 crore in the same quarter of the previous financial year.",
            "pubDate": "2025-10-16T06:56:50.087188"
        }
    ]
}