{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-21T00:44:17.147905",
    "items": [
        {
            "title": "India story: Time for a basket of stocks? 26 stocks which probably have highest correlation with India’s growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-story-time-for-a-basket-of-stocks-26-stocks-which-probably-have-highest-correlation-with-indias-growth/articleshow/121302827.cms",
            "description": "If probability is the most important thing in the stock market, then possibility is a close second. And a combination of the two reflects the reality of returns. That said, if you are in the market as an investor, you have to be a believer in the India story. As an economy, India is bound to grow. And as it grows, which are the stocks that will reflect that growth story? A whole basket of them. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks, along with detailed company analysis focusing on five key components – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2025-05-21T00:43:56.210800"
        },
        {
            "title": "NSEL Crisis: 92% of traders approve one-time settlement scheme",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsel-crisis-92-of-traders-approve-one-time-settlement-scheme/articleshow/121302707.cms",
            "description": "The NSEL payment crisis began in July 2013 when the exchange defaulted on 5,600 crore owed to around 13,000 investors. It had offered contracts that involved buying and selling commodities with fixed returns, but most trades were not backed by the actual commodity.",
            "pubDate": "2025-05-21T00:43:56.210961"
        },
        {
            "title": "5 stocks post high EBITDA growth in March quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-stocks-post-high-ebitda-growth-in-march-quarter/slideshow/121297004.cms",
            "description": "",
            "pubDate": "2025-05-21T00:43:56.211071"
        },
        {
            "title": "Indices decline over 1% amid Covid-19 surge and foreign inflow concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indices-decline-over-1-amid-covid-19-surge-and-foreign-inflow-concerns/articleshow/121302657.cms",
            "description": "Indian benchmarks experienced a decline of over 1% on Tuesday, driven by uncertainty regarding near-term market prospects and profit-booking after a recent rally. Ebbing foreign inflows and a surge in Covid-19 cases across India and Asia further contributed to the cautious market sentiment. Traders are also adding short positions, suggesting limited upside potential in the near future.",
            "pubDate": "2025-05-21T00:43:56.211180"
        },
        {
            "title": "Will drone stocks continue to soar after recent military conflict?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-drone-stocks-continue-to-soar-after-recent-military-conflict/articleshow/121302449.cms",
            "description": "Since the Pahalgam attack on April 22, Paras Defence and Space Technologies, Ideaforge Technology and Zen Technologies have soared 30-50%, amid a broader euphoria among defence-related stocks.",
            "pubDate": "2025-05-21T00:43:56.211282"
        },
        {
            "title": "Stock Radar: Breakout from inverse Head & Shoulder pattern on daily charts makes Supreme Industries an attractive buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-breakout-from-inverse-head-shoulder-pattern-on-daily-charts-makes-supreme-industries-an-attractive-buy/articleshow/121289409.cms",
            "description": "Supreme Industries stock shows potential for upward movement. The stock broke out from an inverse head and shoulder pattern. Experts suggest buying the stock. The target price is Rs 4,300 in the next 1-2 months. The stock closed at Rs 3,842 on May 19, 2025. Technical indicators suggest a bullish trend. SMC Global Securities recommends accumulating the stock.",
            "pubDate": "2025-05-21T00:43:56.211383"
        },
        {
            "title": "Credit growth may slow in FY26 as lenders focus more on secured loans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-growth-may-slow-in-fy26-as-lenders-focus-more-on-secured-loans/articleshow/121302802.cms",
            "description": "Fitch Ratings anticipates slow loan growth for banks in fiscal years 25 and 26. This follows two years of strong growth. Banks are expected to prioritize secured retail loans. Housing and vehicle loans will likely increase. Unsecured loans may decrease due to regulations. Declining interest rates could affect bank profitability. Reserve Bank of India's liquidity measures might offer some relief.",
            "pubDate": "2025-05-21T00:43:56.211475"
        },
        {
            "title": "Star Health to focus on retail in bid to grow premiums",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/star-health-to-focus-on-retail-in-bid-to-grow-premiums/articleshow/121302815.cms",
            "description": "Star Health Insurance aims for substantial premium growth, targeting ₹30,000 crore in three years while improving profitability by lowering the combined ratio to 97%. The company is prioritizing its retail business and limiting group insurance exposure, focusing on SMEs. To manage medical inflation, Star Health is negotiating with hospitals and implementing premium adjustments, rewarding healthy policyholders with discounts.",
            "pubDate": "2025-05-21T00:43:56.211566"
        },
        {
            "title": "InsuranceDekho set to merge with RenewBuy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurancedekho-set-to-merge-with-renewbuy/articleshow/121302783.cms",
            "description": "InsuranceDekho and RenewBuy have merged through a share swap. The deal values the combined entity at ₹7,400 crore. Ankit Agrawal of InsuranceDekho will likely become the CEO. RenewBuy's investors will receive shares in InsuranceDekho. The merged company will be among India's top three insurance distributors. Their combined premium book will be ₹6,000 crore. The deal awaits regulatory approvals.",
            "pubDate": "2025-05-21T00:43:56.211656"
        },
        {
            "title": "These 9 banking stocks can give more than 26% returns in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-banking-stocks-can-give-more-than-26-returns-in-1-year-according-to-analysts/articleshow/121298147.cms",
            "description": "Yes, on Tuesday, it was banking stocks that led the market decline. But if you look at their overall performance over a period of time, they have been outperformers. As they are heavily owned by FIIs, they come under pressure when selling increases. That, however, does change the reality that their balance sheets are far better placed than they were just three years ago. And in the case of some banks, the painful process of valuation readjustment is also over. Time to take a closer look at these stocks.",
            "pubDate": "2025-05-21T00:43:56.211754"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/121297347.cms",
            "description": "Indian markets fell sharply on Tuesday, with Sensex down 873 points and Nifty losing 261 points, amid weak global cues, profit booking, and cautious investor sentiment driven by US fiscal uncertainty and India-US trade concerns.",
            "pubDate": "2025-05-21T00:43:56.211874"
        },
        {
            "title": "Market Trading Guide: City Union Bank, 1 smallcap stock may rally up to 4% in immediate term. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-city-union-bank-1-smallcap-stock-may-rally-up-to-4-in-immediate-term-heres-why/slideshow/121296909.cms",
            "description": "Indian markets fell sharply on Tuesday led by selling pressure in bank and auto stocks as they recorded their third consecutive fall. While the short-term trend remains strong, there is a possibility of a deeper pullback toward the 21-day EMA on the daily timeframe. Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that the negative divergence on the daily RSI has added to the bearish sentiment. “If Nifty sustains below 24,700, the correction could extend further, potentially towards 24,300. However, if the index moves back above 24,700, it may signal a return to a consolidation phase,” he said.Here are 2 stock recommendations for Wednesday:",
            "pubDate": "2025-05-21T00:43:56.211979"
        },
        {
            "title": "Ugro Capital plans to raise Rs 1,315 crore via convertible debentures and rights issue of shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ugro-capital-plans-to-raise-rs-1315-crore-via-convertible-debentures-and-rights-issue-of-shares/articleshow/121296775.cms",
            "description": "Ugro Capital will raise up to ₹1,315 crore through a mix of CCDs and a rights issue to strengthen its lending business. Samena Capital committed ₹500 crore, becoming a key institutional investor. Terms of the rights issue are pending.",
            "pubDate": "2025-05-21T00:43:56.212077"
        },
        {
            "title": "Two Trades for Today: A housing finance major for over 9% surge, an MNC electronics services stock for close to 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-housing-finance-major-for-over-9-surge-an-mnc-electronics-services-stock-for-close-to-6-gain/articleshow/121296577.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-05-21T00:43:56.212171"
        },
        {
            "title": "United Spirits Q4 results: Johnnie Walker maker reports 75% YoY jump in cons PAT to Rs 421 crore, declares Rs 8/share dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/united-spirits-q4-results-johnnie-walker-maker-reports-75-yoy-jump-in-cons-pat-to-rs-421-crore-declares-rs-8/share-dividend/articleshow/121296262.cms",
            "description": "United Spirits posted a 75% YoY rise in Q4FY25 net profit to ₹421 crore, with EBITDA up 38% and NSV up 10%. Despite weak demand, the company maintained strong profitability and declared ₹8 final dividend.",
            "pubDate": "2025-05-21T00:43:56.212263"
        },
        {
            "title": "Equities seen outperforming in FY26 with 12–15% returns: Check key triggers, risks & strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/equities-seen-outperforming-in-fy26-with-1215-returns-check-key-triggers-risks-strategy/articleshow/121296057.cms",
            "description": "Equities may outshine other assets in FY26, with Nifty expected to return 12–15%, supported by 6.2–6.5% GDP growth, strong domestic demand, stable inflation, and returning FII flows, despite global trade and geopolitical uncertainties.",
            "pubDate": "2025-05-21T00:43:56.212355"
        }
    ]
}