{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-28T02:49:53.405398",
    "items": [
        {
            "title": "Can Fin's growth story finds new homes in the North",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-fins-growth-story-finds-new-homes-in-the-north/articleshow/125627583.cms",
            "description": "The surge in Can Fin Homes' stock prices reflects its successful strategy to extend operations outside southern India. As the company spreads its wings, it expects a substantial increase in its asset management growth. Recent reports indicate a sharp rise in loan disbursements, backed by strong asset quality and controlled NPAs.",
            "pubDate": "2025-11-28T02:49:44.808037"
        },
        {
            "title": "Gift Nifty trades on flat note; here's the trading setup for the day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-trades-on-flat-note-here-the-trading-setup-for-the-day/articleshow/125626931.cms",
            "description": "Indian markets reached new record highs on Thursday. Global markets showed strong performance, boosting domestic sentiment. Analysts identified 26,300 as a key resistance level. A break above this could lead to further gains. The India VIX, a fear gauge, declined. Foreign investors were net sellers, while domestic institutional investors were net buyers. The rupee weakened against the US dollar.",
            "pubDate": "2025-11-28T02:49:44.808161"
        },
        {
            "title": "Global stocks hold steady after four-day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-hold-steady-after-four-day-rally/articleshow/125627215.cms",
            "description": "Global equities held firm, buoyed by expectations of faster Federal Reserve rate cuts and a return of risk appetite, with Bitcoin surging. Markets anticipate a year-end rally, supported by a positive macro outlook and decent corporate earnings. Tech shares led gains in Asia, while German equities rose on takeover interest.",
            "pubDate": "2025-11-28T02:49:44.808371"
        },
        {
            "title": "Analysts see bullish trend intact as Nifty hits record high. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/analysts-see-bullish-trend-intact-as-nifty-hits-record-high-what-should-investors-do/articleshow/125627166.cms",
            "description": "Nifty hit a fresh intraday record, with analysts expecting the bullish trend to continue towards 26,500. Traders are advised to hold existing positions and focus on outperforming sectors like banking and financials. Strategies like buying at-the-money call options or bull-call spreads are suggested for potential gains.",
            "pubDate": "2025-11-28T02:49:44.808469"
        },
        {
            "title": "Nifty breaks a 14-month lull, yet Silver and Gold returns dominate D-Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-breaks-a-14-month-lull-yet-silver-and-gold-returns-dominate-d-street/articleshow/125627095.cms",
            "description": "After a 14-month period of underperformance compared to global peers, India's Nifty index has reached a new all-time high. During this time, silver and gold emerged as top-performing assets, while specific Indian sectoral indices like Capital Markets, PSU Bank, and Defence also saw significant gains.",
            "pubDate": "2025-11-28T02:49:44.808563"
        },
        {
            "title": "D-Street scales new peaks after 14 months as FPI selling cools, US-India deal eyed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-scales-new-peaks-after-14-months-as-fpi-selling-cools-us-india-deal-eyed/articleshow/125627051.cms",
            "description": "Indian stock markets reached new heights on Thursday, with the Sensex and Nifty crossing previous records. This surge follows a 14-month period of consolidation. Investors are now looking towards a potential US-India trade deal and a decrease in foreign investor selling to fuel further market gains. Analysts suggest focusing on large-cap stocks for potential upside.",
            "pubDate": "2025-11-28T02:49:44.808660"
        },
        {
            "title": "Asian stocks ebb as global rally loses momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-ebb-as-global-rally-loses-momentum/articleshow/125627007.cms",
            "description": "Asian stocks showed signs of losing momentum Friday, with indexes opening lower in South Korea and Japan, while global equities remained flat. Investors are closely watching Chinese stocks after JPMorgan upgraded its recommendation, and are also focused on the yen's stability amid steady Tokyo inflation and potential Bank of Japan rate hikes.",
            "pubDate": "2025-11-28T02:49:44.808752"
        },
        {
            "title": "Stocks in news: Bandhan Bank, Lenskart, LG India, Adani Enterprises, Wipro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-bandhan-bank-lenskart-lg-india-adani-enterprises-wipro/articleshow/125626885.cms",
            "description": "Markets reached a new record high on Thursday, buoyed by positive global sentiment, expectations of interest rate cuts, and falling crude oil prices. Several companies, including Bandhan Bank, Lenskart, and Adani Enterprises, are in focus due to significant business developments and strategic moves.",
            "pubDate": "2025-11-28T02:49:44.808846"
        }
    ]
}