{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-01T07:08:36.216646",
    "items": [
        {
            "title": "Japan's Nikkei rises nearly 2%, defence stocks shine as Ishiba confirmed as PM",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-nearly-2-defence-stocks-shine-as-ishiba-confirmed-as-pm/articleshow/113841121.cms",
            "description": "Japan's Nikkei share index rises nearly 2%, driven by gains in defence stocks following Shigeru Ishiba's confirmation as prime minister. Defence firms and exporters, such as Kawasaki Heavy Industries and Toyota, experience significant boosts due to new cabinet appointments and a weaker yen.",
            "pubDate": "2024-10-01T07:08:14.316773"
        },
        {
            "title": "Will Vedanta shares ride the metal sector rally after 130% returns in a year? Experts explain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-vedanta-shares-ride-the-metal-sector-rally-after-130-returns-in-a-year-experts-explain/articleshow/113841024.cms",
            "description": "Vedanta shares saw significant gains, rising 130% over the past year, partly due to China's economic measures. The stock recently broke resistance levels and is trading above short-term averages. Experts suggest the stock could rise further, targeting Rs 530-550, with Rs 490 acting as key support. Vedanta closed at Rs 512.55 on Monday.",
            "pubDate": "2024-10-01T07:08:14.316954"
        },
        {
            "title": "Hot Stock Pick! InCred Equities sees over 20% upside in HDFC Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stock-pick-incred-equities-sees-over-20-upside-in-hdfc-bank/slideshow/113838411.cms",
            "description": "HDFC Bank, part of the private banking space, might have remained rangebound in the last 3 months but is well on track to hit fresh record highs above Rs 2,000-2,100 levels.InCred Equities in a recent report retained its ADD rating on HDFC Bank with a target price of Rs 2150 which translates into an upside of over 22% from Rs 1752 recorded on 27th September 2024.",
            "pubDate": "2024-10-01T07:08:14.317078"
        },
        {
            "title": "Welspun Corp shares surge 4%, hit 52-week high after securing Rs 2,400 crore US order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/welspun-corp-shares-surge-4-hit-52-week-high-after-securing-rs-2400-crore-us-order/articleshow/113840063.cms",
            "description": "Welspun Corp share price surged 4% to a 52-week high of Rs 795 on BSE following the announcement of a major order worth Rs 2,400 crore in the United States. The company stated it received this significant order for the supply of Coated HSAW Pipes for a natural gas pipeline project. Execution of the order is planned for FY25 and FY26.",
            "pubDate": "2024-10-01T07:08:14.317236"
        },
        {
            "title": "SpiceJet, IndiGo shares rally up to 6% after ATF price cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-indigo-shares-rally-up-to-6-after-atf-price-cut/articleshow/113839919.cms",
            "description": "The ATF prices have been cut to Rs 87,597 per kg in Delhi, down from Rs 93,480 per kg earlier. The price reduction will help ease the burden on airlines for whom fuel makes up 40% of the airlines’ operating costs.",
            "pubDate": "2024-10-01T07:08:14.317343"
        },
        {
            "title": "Investec initiates 'Buy' rating on Aadhar Housing Finance, projects 28% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investec-initiates-buy-rating-on-aadhar-housing-finance-projects-28-upside/articleshow/113838573.cms",
            "description": "In the report, Investec noted that Aadhar is the largest and most diversified housing finance company in India. The company's dual underwriting model enhances its operational efficiency and risk management capabilities, allowing it to cater to a broader customer base effectively.",
            "pubDate": "2024-10-01T07:08:14.317448"
        },
        {
            "title": "Corrections will come and go. Focus on owning the correct business: 5 mid-cap stocks from different sectors with an upside potential of up to 41%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corrections-will-come-and-go-focus-on-owning-the-correct-business-5-mid-cap-stocks-from-different-sectors-with-an-upside-potential-of-up-to-41/articleshow/113837506.cms",
            "description": "A close to 300-point fall in the Nifty might appear to be a big one. But look at it differently – it is just a 1% decline. And that kind of move is common. The problem is that every market move tends to be amplified when valuations are high. This is because of the fear that a correction might spill over into the mid-cap segment – where the interest of a majority of retail investors is concentrated. Two more such sharp cuts and the street will be divided into two kinds of investors. The first will justify buying wrong stocks by billing themselves “long-term investors”. The rest, genuine long-term investors, will remain focused on buying the correct business. Now what is a “correct business”? Simple: One with a track record of growth; a company that does not require constant doses of capital; and where not only is income generated, it is shared with minority investors.",
            "pubDate": "2024-10-01T07:08:14.317546"
        },
        {
            "title": "Tech Mahindra shares zoom 4% after CLSA upgrades stock to outperform, hikes TP to Rs 1,749",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-rallies-4-as-clsa-upgrades-stock-to-outperform-target-price-at-rs-1749/articleshow/113837357.cms",
            "description": "Shares of Tech Mahindra surged 4.2% to Rs 1,642.20 on the BSE after CLSA upgraded the stock to 'outperform' from 'hold' with a target price of Rs 1,749. The upgrade follows recent price correction and early signs of EBIT margin improvement, despite lackluster order bookings.",
            "pubDate": "2024-10-01T07:08:14.317646"
        },
        {
            "title": "Hot Stock Pick! ICICI Securities sees up to 30% upside in Adani Energy Solutions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stock-pick-icici-securities-sees-up-to-30-upside-in-adani-energy-solutions/slideshow/113837432.cms",
            "description": "ICICI Securities initiated coverage on Adani Energy Solutions (AESL) with a buy rating and a target price of Rs 1,318 which translates into an upside of over 30% from Rs 1,013 recorded on 27th September 2024.AESL is the largest private transmission company, operating one of the largest private DISCOMs and has emerged as the 2nd largest player in smart meters.",
            "pubDate": "2024-10-01T07:08:14.317740"
        },
        {
            "title": "M&M shares rise 1.5% following 16% growth in September sales, 24% surge in SUV sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-shares-rise-1-5-following-16-growth-in-september-sales-24-surge-in-suv-sales/articleshow/113836939.cms",
            "description": "Mahindra & Mahindra shares rose 1.5% after reporting a 16% increase in auto sales and a 24% growth in SUV sales for September 2024, with total sales reaching 87,839 vehicles.",
            "pubDate": "2024-10-01T07:08:14.317838"
        },
        {
            "title": "Swiggy vs Zomato: Who is winning the financial race?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-vs-zomato-who-is-winning-the-financial-race/slideshow/113836792.cms",
            "description": "The IPO of Swiggy has been cleared by the market regulator and the issue could hit the public market anytime. Meanwhile, the IPO has also thrown some spotlight on its competitor and listed peer Zomato. Given such intense scrutiny, here's a comparison of financials of both these companies in the last three fiscal years. [Source: Annual reports, Company reports] Note: Brackets indicate loss",
            "pubDate": "2024-10-01T07:08:14.317949"
        },
        {
            "title": "Stock Radar: HDFC Bank makes a U-turn after retesting July highs. Should you buy the dip in October?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-hdfc-bank-makes-a-u-turn-after-retesting-july-highs-should-you-buy-the-dip-in-october/articleshow/113814375.cms",
            "description": "HDFC Bank Ltd, a major private sector bank, faced selling pressure after a breakout in September 2024. Despite reaching an intraday high of Rs 1787.90, it remains above crucial support levels. Experts suggest short-term traders consider buying for a potential rebound toward July highs. The stock's performance aligns with market volatility.",
            "pubDate": "2024-10-01T07:08:14.318051"
        },
        {
            "title": "Piramal Pharma stock in focus on $80 million expansion plan for Kentucky injectables facility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/piramal-pharma-stock-in-focus-on-80-million-expansion-plan-for-kentucky-injectables-facility/articleshow/113836059.cms",
            "description": "Piramal Pharma Solutions, is investing $80 million to expand its Lexington facility, doubling capacity by Q1 2027 to meet growing injectables demand, supporting its ADC manufacturing program.",
            "pubDate": "2024-10-01T07:08:14.318149"
        },
        {
            "title": "Chinese bazooka pulls FIIs away from Nifty, test retail investor's faith",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinese-bazooka-pull-fiis-away-from-nifty-test-retail-investors-faith/articleshow/113835865.cms",
            "description": "Emerging market investors are shifting their focus from India to China due to Beijing's significant economic stimulus measures. The Chinese stock market has surged dramatically, causing FIIs to withdraw from Indian markets. Analysts believe the trend could continue, impacting Indian market liquidity and performance.",
            "pubDate": "2024-10-01T07:08:14.318246"
        },
        {
            "title": "Stocks to buy today: GAIL, IOC among top 6 trading ideas for October 1, 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-gail-ioc-among-top-6-trading-ideas-for-october-1-2024/articleshow/113835742.cms",
            "description": "The Indian market may consolidate on Tuesday amid mixed global cues. Nifty futures closed down 1.35% at 25,990. Options data shows a broad range between 25,400 to 26,300, with key levels at 25,850. Analysts expect weakness if Nifty stays below 25,850, with resistance at 25,950 and 26,150.",
            "pubDate": "2024-10-01T07:08:14.318344"
        },
        {
            "title": "Hot Stocks: Brokerage views on PB Fintech, Kaynes and Aadhar Housing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerage-views-on-pb-fintech-kaynes-and-aadhar-housing/articleshow/113835481.cms",
            "description": "Jefferies has reiterated its buy rating on PB Fintech, setting a target price of Rs 1,800. The company’s management plans a one-time investment of up to $100 million for a 20-35% stake in a new healthcare venture, addressing concerns about maintaining its asset-light strategy. PB Fintech remains a top pick for India's growing insurance market, with its core business continuing to experience strong growth.",
            "pubDate": "2024-10-01T07:08:14.318442"
        }
    ]
}