{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-21T13:30:59.356004",
    "items": [
        {
            "title": "Trump’s $100,000 H-1B visa fee among 7 key triggers that will steer D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-100000-h-1b-visa-fee-among-7-key-triggers-for-d-st-this-week/articleshow/124023729.cms",
            "description": "Markets brace for the impact of US President Trump’s $100,000 annual H-1B visa fee as investors watch India–US trade talks, domestic economic data, and US market trends. While FIIs remain cautious amid currency volatility, DIIs are supporting stability. Technical indicators suggest a positive bias, though short-term consolidation is likely near key resistance levels.",
            "pubDate": "2025-09-21T04:21:35.554195"
        },
        {
            "title": "H-1B fee deepens sell-off fears for already battered Indian IT stocks. What to expect on Monday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/h-1b-fee-deepens-sell-off-fears-for-already-battered-indian-it-stocks-what-to-expect-on-monday/articleshow/124023691.cms",
            "description": "Indian IT stocks came under pressure after US President Donald Trump announced a steep hike in H-1B visa fees to $100,000 per year. While the increase applies only to fresh applications, it has rattled investors given that over 70% of H-1B holders are Indians. ADRs of leading IT firms plunged immediately, underscoring the sector’s vulnerability.",
            "pubDate": "2025-09-21T04:21:35.554328"
        },
        {
            "title": "Top 19 high-conviction stocks from Choice Broking offer up to 35% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-19-high-conviction-stocks-from-choice-broking-offer-up-to-35-upside/slideshow/124024067.cms",
            "description": "The Indian equity markets continue to show resilience, supported by strong domestic inflows, stable macroeconomic indicators, and pro-consumption regulatory measures.While valuations remain elevated in certain pockets, select stocks still offer meaningful upside, particularly in sectors with structural growth drivers. In this context, Choice Broking has identified 19 high-conviction investment ideas across nine sectors, with upside potential of up to 35% from current levels.",
            "pubDate": "2025-09-21T05:09:59.424303"
        },
        {
            "title": "Navratri 2025: Nine nights of shakti, planetary power and how astrological energies shift wealth, markets and mindset",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/navratri-2025-nine-nights-of-shakti-planetary-power-and-how-astrological-energies-shift-wealth-markets-and-mindset/articleshow/124025353.cms",
            "description": "Navratri 2025 offers a cosmic moment for investors to reassess portfolios and align investments with long-term goals. Experts advise reviewing SIPs, rebalancing away from overheated sectors, avoiding festive FOMO trades, and staying disciplined. With equity, debt, and gold allocation in check, investors can harness the nine-night energy for steady wealth creation rather than short-term gains.",
            "pubDate": "2025-09-21T07:34:54.021416"
        },
        {
            "title": "Nifty bluechip PSU stock giving bank FD-beating 7% dividend yield. Time to change tracks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-bluechip-psu-stock-giving-bank-fd-beating-7-dividend-yield-time-to-change-tracks/articleshow/124025073.cms",
            "description": "Coal India (CIL) offers a 7% dividend yield, outperforming bank FDs, making it attractive for income-focused investors. While near-term headwinds include high inventories, competition, and regulatory risks, analysts highlight its defensive qualities, strong market position, and potential for moderate capital appreciation. The ₹450 target price suggests upside, positioning CIL as a stable, dividend-driven investment amid long-term energy transition challenges.",
            "pubDate": "2025-09-21T07:34:54.021534"
        },
        {
            "title": "25 IPOs opening this week to keep investors busy. GMPs hover between 5-42%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/25-ipos-opening-this-week-to-keep-investors-busy-gmps-hover-between-5-42/slideshow/124025045.cms",
            "description": "The IPO market is set for one of its busiest weeks this year, with nearly 25 mainboard and SME issues hitting the Street. Together, these offerings are looking to raise close to Rs 6,300 crore, led by big-ticket names across sectors from broking and recycling to electricals and digital services.",
            "pubDate": "2025-09-21T07:34:54.021630"
        },
        {
            "title": "Defence & PSU banks on a tear: How long can the rally last?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-psu-banks-on-a-tear-how-long-can-the-rally-last/articleshow/124024947.cms",
            "description": "Defence and PSU bank stocks drive market outperformance, though defence shows signs of fatigue. Analysts expect PSU banks to sustain momentum, while smallcaps eye breakout. VIX lows hint stability but caution lingers.",
            "pubDate": "2025-09-21T07:34:54.021724"
        },
        {
            "title": "Piramal Enterprises sets record date for merger; shareholders to get Piramal Finance shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/piramal-enterprises-sets-record-date-for-merger-shareholders-to-get-piramal-finance-shares/articleshow/124024458.cms",
            "description": "Piramal Enterprises Ltd (PEL) will merge with Piramal Finance Ltd (PFL), with September 23 as the record date. PEL shareholders will receive PFL shares on a 1:1 basis, and PEL shares will cease trading from the record date. The merger consolidates the group’s financial services operations under PFL, aligning with RBI regulations and enabling operational efficiencies, broader product offerings, and improved shareholder value.",
            "pubDate": "2025-09-21T07:34:54.021820"
        },
        {
            "title": "Mcap of seven of top-10 most valued firms jumps by Rs 1.18 lakh cr; SBI, Airtel biggest winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-seven-of-top-10-most-valued-firms-jumps-by-rs-1-18-lakh-cr-sbi-airtel-biggest-winners/articleshow/124024393.cms",
            "description": "The combined market valuation of seven of the top-10 most valued firms jumped by Rs 1,18,328.29 crore last week, with State Bank of India and Bharti Airtel emerging as the biggest gainers, amid an optimistic trend in equities.",
            "pubDate": "2025-09-21T07:34:54.021922"
        },
        {
            "title": "7 penny stocks surge up to 55% in just 5 days. Did you invest in any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-penny-stocks-surge-up-to-55-in-just-5-days-did-you-invest-in-any/slideshow/124024240.cms",
            "description": "Over the past 1-week, seven penny stocks have posted impressive gains, rising between 25% and 55%. These standout performers were identified through a focused screening strategy that targeted stocks with a market capitalization under Rs 1,000 crore, a share price below Rs 20, and a recent trading volume of at least 5 lakh shares. The goal of this approach is to spotlight low-priced, actively traded small-cap stocks showing strong bullish momentum. (Data Source: ACE Equity)",
            "pubDate": "2025-09-21T07:34:54.022018"
        },
        {
            "title": "GST and Market Sentiment: Can policy simplification reduce investment volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-and-market-sentiment-can-policy-simplification-reduce-investment-volatility/articleshow/124026336.cms",
            "description": "India’s GST 2.0 reform introduces a simplified two-rate structure — 5% for essentials and 18% for aspirational goods, with luxury/sin taxed at 40%. The move aims to boost consumption, ease compliance, and correct duty distortions. Analysts expect benefits for FMCG, cement, insurance, healthcare, and agriculture, alongside stronger private capex, improved earnings momentum, and potential GDP uplift of 0.5%.",
            "pubDate": "2025-09-21T10:00:13.145274"
        },
        {
            "title": "Abu Dhabi Investment Portfolio: 2 defence stocks surge over 50% in FY26 so far",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/abu-dhabi-investment-portfolio-2-defence-stocks-surge-over-50-in-fy26-so-far/slideshow/124026302.cms",
            "description": "The equity portfolio of the Abu Dhabi Investment Authority (ADIA), managed through its global funds, has seen a significant 18% increase in value over the past six months — rising from Rs 3,774 crore in March to Rs 4,477 crore as of September 19. The portfolio had shares in 28 publicly listed Indian companies, collectively worth over Rs 4,477 crore.",
            "pubDate": "2025-09-21T10:00:13.145398"
        },
        {
            "title": "Learn to Earn: ET Prime Special Series - Part 1 - Understanding what the auditors are trying to tell you as an investor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/learn-to-earn-et-prime-special-series-part-1-understanding-what-the-auditors-are-trying-to-tell-you-as-an-investor/articleshow/124025987.cms",
            "description": "A key difference between institutional and retail investors is that the former study annual reports and the finer points in those documents, while the latter ignores them. Now, Indian annual reports are complex documents, literally Greek to many, and so most people do not read them. Some parts are so technical that even the best of investors cannot read them. One such is what the auditor is saying about a company. Why is this important? Because what the auditor says, often buried under piles of data points, provides clues about the quality of the company, the processes it follows, whether it is trying to hide anything. In this series, we will try to make things like this as simple as possible. If you are seriously interested in knowing about companies and the stock market, then read on.",
            "pubDate": "2025-09-21T10:00:13.145500"
        },
        {
            "title": "Wealth managers are wealth creators! 5 asset management stocks that soared up to 1,000% in 5 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-managers-are-wealth-creators-5-asset-management-stocks-that-soared-up-to-1000-in-5-years/slideshow/124026006.cms",
            "description": "India’s growing appetite for equities, mutual funds, and alternative assets has turned wealth management into one of the fastest-growing sectors in financial services. Asset managers and wealth advisory firms are not just managing money for clients but also delivering outsized returns for their own shareholders.Here are five listed wealth and asset management firms that have created staggering investor wealth over the past few years.",
            "pubDate": "2025-09-21T10:00:13.145602"
        },
        {
            "title": "Cheers to premiumisation! These 4 alcohol stocks can rally up to 18%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cheers-to-premiumisation-these-4-alcohol-stocks-can-rally-up-to-18-do-you-own-any/articleshow/124025743.cms",
            "description": "India’s spirits market is emerging as a high-growth consumer sector, driven by premiumisation, which boosts both topline and margins. While overall industry growth is mid-to-high single digits, the prestige and above (P&A) segment—led by scotch and white spirits growing at 15–20% CAGR—is expanding rapidly. Indian players and multinationals alike are strengthening premium portfolios and launching new offerings.",
            "pubDate": "2025-09-21T10:00:13.145703"
        },
        {
            "title": "Dividend yield: Both investors & traders can use it in volatile times: 5 stocks with the right mix of dividend yield & upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-yield-both-investors-traders-can-use-it-in-volatile-times-5-stocks-with-the-right-mix-of-dividend-yield-upside-potential/articleshow/124025591.cms",
            "description": "In stock trading and investing, dividend yield is a somewhat overlooked metric. Most traders focus purely on price charts, momentum, and news flow. But it is useful even to traders. How? Let's take an example:  Hindustan Unilever (the stock is not in our list) rarely yields above 1%. If it did approach, say, 2% due to a sharp stock correction, it would likely be a strong value signal, indicating that, for the first time in years, it’s cheap relative to its dividend payouts. There are some steps to be followed which will probably help people use this matrix both while investing and trading. By following these steps, you will be using dividend yield as a contrarian indicator. It’s almost like having an insider’s gauge on valuation.",
            "pubDate": "2025-09-21T10:00:13.145805"
        },
        {
            "title": "Market timing at play: Sept 21 & 24 flagged as crucial reversal dates for Nifty, says Harshubh Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-timing-at-play-sept-21-24-flagged-as-crucial-reversal-dates-for-nifty-says-harshubh-shah/articleshow/124026798.cms",
            "description": "Indian equities extended gains for a third consecutive week, with the Nifty50 rising 0.8% by September 19, 2025, despite net FII outflows of ₹10,962 crore. Positive global cues, optimism around India–US trade talks, and the US Fed’s 25 bps rate cut supported the rally. Key support-resistance levels and intraday time clusters indicate potential short-term opportunities and trend reversals.",
            "pubDate": "2025-09-21T10:42:25.342125"
        },
        {
            "title": "The quarterly earnings and guidance curse: Is chasing short-term profits quietly sabotaging India's future",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-quarterly-earnings-and-guidance-curse-is-chasing-short-term-profits-quietly-sabotaging-indias-future/articleshow/124026614.cms",
            "description": "Quarterly earnings reporting, intended to ensure transparency, is increasingly undermining long-term innovation. High compliance costs, management time, and pressure to meet short-term targets force companies to cut R&D budgets, creating a “tragedy of the commons” for national growth. Global trends show alternatives work, yet India persists with the old system, benefiting short-term traders over long-term investors.",
            "pubDate": "2025-09-21T10:42:25.342259"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/124027591.cms",
            "description": "Indian equities ended lower on Friday, with the Sensex down 387.73 points (0.47%) at 82,626.23 and the Nifty 50 slipping 96.55 points (0.38%) to 25,327.05, snapping a three-day winning streak. Analysts noted profit booking amid Fed rate cut hopes and U.S.-India trade progress, with PSU banks, metals, and pharma outperforming, while IT, FMCG, and private banking lagged.",
            "pubDate": "2025-09-21T11:54:36.485637"
        },
        {
            "title": "Two Trades for Today: Two real estate firms; one a large-cap for a 5.35% gain, another a mid-cap for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-two-real-estate-firms-one-a-large-cap-for-a-5-35-gain-another-a-mid-cap-for-almost-7-rise/articleshow/124028432.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-21T13:30:58.650558"
        }
    ]
}