{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-04T21:34:25.941951",
    "items": [
        {
            "title": "Bosch Q1 Results: Net profit surges over twofold to Rs 1,115 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bosch-q1-results-net-profit-surges-over-twofold-to-rs-1115-crore/articleshow/123099262.cms",
            "description": "Auto component maker Bosch Ltd on Monday reported an over twofold jump in its consolidated net profit to Rs 1,115 crore for the first quarter ended June 30, 2025, aided by one-time income due to the transfer of a business vertical.",
            "pubDate": "2025-08-04T21:34:13.724444"
        },
        {
            "title": "Aditya Birla Capital Q1 Results: Profit rises 10% to Rs 835 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/aditya-birla-capital-q1-results-profit-rises-10-to-rs-835-crore/articleshow/123099114.cms",
            "description": "Aditya Birla Capital Ltd on Monday reported a 10 per cent rise in profit to Rs 835 crore on a consolidated basis for the first quarter ended June 2025.",
            "pubDate": "2025-08-04T21:34:13.724564"
        },
        {
            "title": "Q3 boost for June-listed Siemens Energy: Profit shoots up 80% to Rs 263 crore, revenue rises 20% on new orders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-boost-for-june-listed-siemens-energy-profit-shoots-up-80-to-rs-263-crore-revenue-rises-20-on-new-orders/articleshow/123098652.cms",
            "description": "Siemens Energy India reported an 80% YoY jump in Q3FY26 net profit to Rs 263 crore, with revenue up 20% at Rs 1,785 crore. Strong domestic and export orders drove performance. New orders surged 94%, and the firm announced a Rs 280 crore investment to expand manufacturing in Aurangabad.",
            "pubDate": "2025-08-04T21:34:13.724674"
        },
        {
            "title": "DLF reports 19% YoY growth in Q1 net profit at Rs 766 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dlf-reports-19-yoy-growth-in-q1-net-profit-at-rs-766-crore/articleshow/123098432.cms",
            "description": "DLF reported net profit of Rs 766 crore during Q1FY26, Y-o-Y growth of 19% as it reported sales booking of Rs 11,425 crore, a y-o-y growth of 78%.",
            "pubDate": "2025-08-04T21:34:13.724775"
        },
        {
            "title": "Godfrey Phillips Q1 Results: Net profit jumps 56% to Rs 356 crore, to issue 2:1 bonus shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/godfrey-phillips-india-q1-results-net-profit-jumps-56-to-rs-356-crore/articleshow/123097875.cms",
            "description": "Cigarette maker Godfrey Phillips India Ltd on Monday reported a 56 per cent jump in consolidated net profit at Rs 356.28 crore in the first quarter ended June 2025, riding on higher sales.",
            "pubDate": "2025-08-04T21:34:13.724875"
        },
        {
            "title": "Bharti Airtel Q1 Results Preview: Brokerages see up to 198% YoY PAT growth on subscriber gains, stable ARPU. 6 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bharti-airtel-q1-results-preview-brokerages-see-up-to-198-yoy-pat-growth-on-subscriber-gains-stable-arpu-6-things-to-watch-out-for/articleshow/123096869.cms",
            "description": "Bharti Airtel is set to post solid Q1 FY26 results on August 5, driven by subscriber growth, stable ARPU, and Africa momentum. Analysts expect double-digit YoY growth in revenue, EBITDA, and PAT, despite varying quarterly forecasts.",
            "pubDate": "2025-08-04T21:34:13.724999"
        },
        {
            "title": "DLF Q1 Results: Cons PAT rises 18% YoY to Rs 763 crore; revenue soars 99%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dlf-q1-results-cons-pat-rises-18-yoy-to-rs-763-crore-revenue-soars-99/articleshow/123095387.cms",
            "description": "DLF reported an 18% YoY increase in consolidated net profit, reaching Rs 763 crore for the June quarter, driven by a 99% surge in revenue to Rs 2,716 crore. New sales bookings significantly grew by 78% YoY to Rs 11,425 crore, fueled by the launch of the DLF Privana ecosystem.",
            "pubDate": "2025-08-04T21:34:13.725100"
        },
        {
            "title": "Marico Q1 Results: Cons net profit rises 9% YoY to Rs 504 crore; revenue up 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/marico-q1-results-cons-net-profit-rises-9-yoy-to-rs-504-crore-revenue-up-23/articleshow/123092722.cms",
            "description": "Marico posted a 9% YoY rise in Q1 FY26 net profit at Rs 504 crore, driven by strong international growth and price-led gains in India. Revenue surged 23% to Rs 3,259 crore, despite margin pressure from high input costs.",
            "pubDate": "2025-08-04T21:34:13.725196"
        },
        {
            "title": "E-scooter maker Ather Energy Q1 Results: Co narrows loss to Rs 178 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/e-scooter-maker-ather-energy-q1-results-co-narrows-loss-to-rs-178-crore/articleshow/123092036.cms",
            "description": "India's Ather Energy reported a narrower first-quarter loss on Monday, helped by higher demand for its e-scooters, particularly the best-selling \"Rizta\".",
            "pubDate": "2025-08-04T21:34:13.725290"
        },
        {
            "title": "Shree Cement Q1 Results: Net profit zooms 131% YoY to Rs 643 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shree-cement-q1-results-net-profit-zooms-131-yoy-to-rs-643-crore/articleshow/123091638.cms",
            "description": "Shree Cement's Q1 FY26 consolidated net profit soared 131% YoY to Rs 642.66 crore, driven by strong operating earnings growth and reduced expenses. Revenue saw a modest 3.1% increase, while EBITDA jumped 47%. Following the earnings release, Shree Cement's shares experienced a slight increase in trading.",
            "pubDate": "2025-08-04T21:34:13.725386"
        },
        {
            "title": "Adani Ports Q1 preview: PAT may jump up to 26% YoY, revenue to rise in double-digits on robust volumes. Check 4 likely takeaways",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-ports-q1-preview-pat-may-jump-up-to-26-yoy-revenue-to-rise-in-double-digits-on-robust-volumes-check-4-likely-takeaways/articleshow/123088932.cms",
            "description": "Adani Ports and Special Economic Zone (APSEZ) is set to release its Q1 earnings, anticipating strong results driven by volume growth and logistics contributions. Brokerages predict revenue increases between 14% and 28% year-over-year, with profit after tax potentially rising by 7–26%.",
            "pubDate": "2025-08-04T21:34:13.725479"
        }
    ]
}