{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-05T05:52:44.178670",
    "items": [
        {
            "title": "Cupid shares fall another 20%; Tourism Finance recovers strongly, jumps 15%. Here's what happened",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-shares-fall-another-20-tourism-finance-recovers-strongly-jumps-15-heres-what-happened/articleshow/126344620.cms",
            "description": "Cupid and TFCI saw divergent moves after both hit lower circuits on Friday. Cupid extended its slide despite management clarification, while TFCI rebounded on fresh buying, including Ekta Halwasiya’s block deal. Cupid highlighted record Q3FY26 performance and a strong order book, whereas TFCI announced plans to co-sponsor two AIFs.",
            "pubDate": "2026-01-05T05:21:06.206476"
        },
        {
            "title": "Hindustan Copper shares gain 10% in three trading sessions. What should investors do in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-gain-10-in-three-trading-sessions-what-should-investors-do-in-2026/articleshow/126344504.cms",
            "description": "Hindustan Copper shares jumped on January 5, tracking a nearly 3% rise in LME copper prices. The stock has gained 10% over three sessions. Experts say copper fundamentals remain strong, driven by AI, data centres and green energy demand, while supply risks from mine disruptions and labour unrest support prices.",
            "pubDate": "2026-01-05T05:21:06.206589"
        },
        {
            "title": "Maruti Suzuki India, L&T among 4 Nifty stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-india-lt-among-4-nifty-stocks-witness-5-year-swing-high-breakout/slideshow/126343805.cms",
            "description": "In the Nifty50 pack, four stocks witnessed a 5-year swing high at the close on January 2, indicating bullishness in the counters, according to technical scan data from StockEdge.A 5-year swing high marks the highest price a stock has reached over the past five years and serves as an important resistance level. While such moves are viewed as bullish, they differ from a 5-year breakout, which requires a decisive move beyond long-standing resistance.",
            "pubDate": "2026-01-05T05:21:06.206689"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/126344104.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2026-01-05T05:21:06.206804"
        },
        {
            "title": "KNR Construction, other road & highway stocks tumble up to 53% in 2025. Budget is both a hope and hurdle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/knr-construction-other-road-highway-stocks-tumble-up-to-53-in-2025-budget-is-both-a-hope-and-hurdle/articleshow/126344265.cms",
            "description": "Indian road and highway stocks are experiencing significant declines. Investor appetite is low due to a flat Budget 2025 capex and reduced market share for listed developers. Experts are advising caution for investors. Companies are facing revenue contraction and volatile profitability. The outlook suggests continued stress in the road construction sector.",
            "pubDate": "2026-01-05T05:21:06.206907"
        },
        {
            "title": "Sensex falls over 200 pts, Nifty below 26,300 as Venezuela risk tempers earnings optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-pts-nifty-below-26300-as-venezuela-risk-tempers-earnings-optimism/articleshow/126344076.cms",
            "description": "Indian equities experienced volatility on Monday, with the Sensex and Nifty fluctuating as investors balanced positive corporate earnings against escalating geopolitical risks. Early gains were tempered by concerns over U.S. military actions in Venezuela, leading to a market caught between domestic support and global uncertainty.",
            "pubDate": "2026-01-05T05:21:06.207004"
        },
        {
            "title": "Buy, Sell or Hold: Citi maintains a buy on Devyani International; remains cautious on Infosys, HCL Tech & Mphasis",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-a-buy-on-devyani-international-remains-cautious-on-infosys-hcl-tech-mphasis/articleshow/126344074.cms",
            "description": "Brokerage views on Indian equities remain mixed, with Citi maintaining a Buy on Devyani International amid merger-led synergies, Morgan Stanley flagging limited near-term upside for Coal India, and continued caution on major IT stocks due to sluggish growth and margin pressures.",
            "pubDate": "2026-01-05T05:21:06.207101"
        },
        {
            "title": "Hindustan Copper vs Hindustan Zinc: Which stock should you add in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-vs-hindustan-zinc-which-stock-should-you-add-in-2026/articleshow/126343965.cms",
            "description": "Investors face a choice between Hindustan Copper and Hindustan Zinc for 2026. Copper's electrification demand supports Hindustan Copper, while silver's surge benefits Hindustan Zinc. Experts note strong rallies but caution about stretched valuations. Hindustan Copper offers operational clarity, but volatility is a concern. Hindustan Zinc is a strong silver play, though much upside may be priced in.",
            "pubDate": "2026-01-05T05:21:06.207193"
        },
        {
            "title": "Nykaa shares surge 3% on Q3 business update. Here’s everything you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-shares-in-focus-on-q3-business-update-heres-everything-you-need-to-know/articleshow/126343945.cms",
            "description": "FSN E-Commerce Ventures, the company behind Nykaa, reported a positive business update for Q3 FY2026, leading to a spike in its share values. Anticipating vigorous growth in its Beauty category, the company is optimistic about accelerated NSV gains. Additionally, the Fashion sector is expected to show signs of revival.",
            "pubDate": "2026-01-05T05:21:06.207292"
        },
        {
            "title": "ITC shares in focus as stock hits 3-year low, brokerages downgrade after steep excise duty hike on cigarettes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-shares-in-focus-as-stock-hits-3-year-low-brokerages-downgrade-after-steep-excise-duty-hike-on-cigarettes/articleshow/126343941.cms",
            "description": "ITC shares slid to a three-year low after a sharp tobacco tax hike triggered widespread brokerage downgrades. Analysts warn that higher excise and GST rates could force steep price increases, hurt cigarette volumes, and compress margins, prompting target cuts and cautious outlooks despite ITC’s diversified FMCG presence.",
            "pubDate": "2026-01-05T05:21:06.207388"
        },
        {
            "title": "Bajaj Finance shares in focus after Q3 update signals steady momentum as customer base, AUM climb",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-shares-in-focus-after-q3-update-signals-steady-momentum-as-customer-base-aum-climb/articleshow/126343925.cms",
            "description": "Bajaj Finance shares are set to be in focus after the lender’s December-quarter business update showed steady growth in customers, loan bookings and assets under management, reinforcing confidence after a strong September-quarter earnings performance.",
            "pubDate": "2026-01-05T05:21:06.207486"
        },
        {
            "title": "MCX stock & the metals mania: Volatility is winning but how much upside is really left?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-stock-the-metals-mania-volatility-is-winning-but-how-much-upside-is-really-left/articleshow/126343919.cms",
            "description": "Multi Commodity Exchange of India Ltd (MCX) shares have surged, driven by persistent commodity volatility rather than just price increases. Analysts emphasize that trading volumes, not commodity prices, fuel MCX's earnings, with operating leverage kicking in when activity remains elevated. The sustainability of this volatility dividend and its impact on MCX's valuation are key investor concerns.",
            "pubDate": "2026-01-05T05:21:06.207580"
        },
        {
            "title": "ONGC may receive $500 million of unpaid dividends if US lifts sanctions on Venezuelan oil",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-may-receive-500-million-of-unpaid-dividends-if-us-lifts-sanctions-on-venezuelan-oil/articleshow/126343883.cms",
            "description": "ONGC could unlock about US$500 million in unpaid dividends from its Venezuelan assets if US-led restructuring eases sanctions, Jefferies said. Recovery would bolster cash flows, balance sheet strength and investor sentiment, adding to robust profitability and valuation comfort, while reviving optionality from stalled Venezuelan projects.",
            "pubDate": "2026-01-05T05:21:06.207674"
        },
        {
            "title": "US-Venezuela tensions: Here’s how crude, gold, dollar are reacting on Monday morning",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-venezuela-tensions-heres-how-crude-gold-dollar-are-reacting-on-monday-morning/articleshow/126343855.cms",
            "description": "Global markets opened in 2026 on edge after a U.S. military operation led to the capture of Venezuela’s President Nicolas Maduro. The escalation has heightened geopolitical risk, triggering volatility across crude oil, precious metals, currencies and equities, as investors reassess supply risks, safe-haven demand and near-term market direction.",
            "pubDate": "2026-01-05T05:21:06.207786"
        },
        {
            "title": "RIL hits record high, ONGC and oil stocks rise up to 2% after Trump’s Venezuela move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-reliance-and-other-oil-linked-stocks-in-focus-after-u-s-raids-venezuela/articleshow/126343701.cms",
            "description": "Reliance Industries and other oil-linked stocks surged following a US military raid in Venezuela, reigniting geopolitical risks. ONGC, with stakes in Venezuelan projects, is expected to benefit from potential recovery of over $500 million in unpaid dividends, as highlighted by Jefferies.",
            "pubDate": "2026-01-05T05:21:06.207886"
        },
        {
            "title": "Swiggy among 7 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-among-7-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126343733.cms",
            "description": "On January 2, futures open interest rose sharply across seven F&O stocks, contributing to a cumulative increase of over 12% compared with the previous session, according to derivatives data. A surge in futures OI indicates a build-up of active contracts, suggesting fresh positioning or expansion of existing positions and rising trader participation.",
            "pubDate": "2026-01-05T05:21:06.207981"
        },
        {
            "title": "NHPC shares rally 10% in 5 days ahead of Rs 2,000 crore fundraising plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nhpc-shares-rally-10-in-5-days-ahead-of-rs-2000-crore-fundraising-plan/articleshow/126345324.cms",
            "description": "NHPC shares extended gains for a fifth straight session, rising over 10% in five days, supported by plans to raise Rs 2,000 crore through bond issuance and strong technical indicators.",
            "pubDate": "2026-01-05T05:52:42.310625"
        },
        {
            "title": "IDBI Bank shares slip 4% despite 12% YoY rise in total business in Q3 FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idbi-bank-shares-slip-4-despite-12-yoy-rise-in-total-business-in-q3-fy26/articleshow/126345251.cms",
            "description": "IDBI Bank shares slipped despite a strong December-quarter update. The bank reported a 12% year-on-year rise in total business to Rs 5.46 lakh crore, supported by healthy growth in deposits and credit.",
            "pubDate": "2026-01-05T05:52:42.310739"
        },
        {
            "title": "Bandhan Bank shares rise nearly 4% after December-quarter loans grow 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bandhan-bank-shares-rise-nearly-4-after-december-quarter-loans-grow-10/articleshow/126345194.cms",
            "description": "Bandhan Bank's shares surged following a positive business update, with loans and advances growing 10% year-on-year to Rs 1.45 lakh crore. While total deposits saw an 11.1% increase, a slight quarter-on-quarter dip and a declining CASA ratio were noted. Improved asset quality, with collection efficiency at 98.1%, provided investor comfort.",
            "pubDate": "2026-01-05T05:52:42.310836"
        }
    ]
}