{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-26T05:01:07.310379",
    "items": [
        {
            "title": "'Violent' price spike rocks gas traders' bad winter bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/violent-price-spike-rocks-gas-traders-bad-winter-bets/articleshow/127519887.cms",
            "description": "US and European gas traders wrongly predicted a mild winter. Now, a severe cold snap in America has sent natural gas prices soaring. This surge impacts global markets, with Asian buyers potentially priced out. Tankers are rerouting to Europe. Traders are in panic mode as pipelines face freezing risks, threatening supply amid high demand.",
            "pubDate": "2026-01-26T02:27:40.118251"
        },
        {
            "title": "Greenko Energy raises Rs 4,800 crore from NaBFID",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/greenko-energy-raises-rs-4800-crore-from-nabfid/articleshow/127519573.cms",
            "description": "Greenko Energy Holdings secured ₹4,800 crore from NaBFID. This funding will retire dollar bonds maturing soon. The loan is for 38 special purpose vehicles with 1 GW renewable capacity. Greenko plans to use the funds for bond redemption this week. The company has a net installed capacity of 11 GW across India. Fitch recently downgraded Greenko's rating citing project delays.",
            "pubDate": "2026-01-26T02:27:40.118411"
        },
        {
            "title": "Nifty eyes relief rally on tariff hopes, FIIs remain a drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-eyes-relief-rally-on-tariff-hopes-fiis-remain-a-drag/articleshow/127518921.cms",
            "description": "Markets anticipate a rebound early in the shortened week following news of potential tariff removal on India. Despite oversold conditions, a sustained bounce hinges on reduced foreign institutional selling. Analysts identify key support and resistance zones, with a durable sentiment improvement requiring the index to reclaim higher bands.",
            "pubDate": "2026-01-26T02:27:40.118611"
        },
        {
            "title": "Market on high alert for Yen intervention",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-on-high-alert-for-yen-intervention/articleshow/127518736.cms",
            "description": "Traders are on high alert for potential Japanese government intervention to curb the yen's recent decline, with speculation fueled by reports of the Federal Reserve Bank of New York contacting financial institutions about the exchange rate. This move, potentially with US backing, follows a warning from Prime Minister Sanae Takaichi about abnormal yen movements.",
            "pubDate": "2026-01-26T02:27:40.118705"
        },
        {
            "title": "Stock market holiday 2026: Are BSE, NSE closed today on January 26 for Republic Day?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-2026-are-bse-nse-closed-today-on-january-26-for-republic-day/articleshow/127481989.cms",
            "description": "Indian stock markets, including NSE and BSE, are closed today, January 26, for Republic Day. Trading will resume on Tuesday, January 27. This marks the second holiday of the year, with 16 closures scheduled for 2026 due to various national and religious observances.",
            "pubDate": "2026-01-26T02:27:40.118803"
        },
        {
            "title": "Foreign banks can go deep; there is no dearth of space: Care Ratings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-banks-can-go-deep-there-is-no-dearth-of-space-care-ratings/articleshow/127519678.cms",
            "description": "The UK, France, and China show high bank credit-to-GDP ratios. This suggests substantial lending to businesses, individuals, and across borders. Germany and Japan also demonstrate high levels of credit penetration, aligning with financial systems that rely heavily on banks.",
            "pubDate": "2026-01-26T02:27:40.118900"
        },
        {
            "title": "Microfinance sector shows signs of recovery as NPAs stabilise in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/microfinance-sector-shows-signs-of-recovery-as-npas-stabilise-in-q3/articleshow/127517938.cms",
            "description": "Microfinance lenders are showing signs of recovery after a prolonged bad loan cycle. Leading institutions like Bandhan Bank, Ujjivan Small Finance Bank, and CreditAccess Grameen reported stable non-performing assets and improved margins. This performance suggests a normalization of business, offering relief to stakeholders and indicating a positive outlook for the sector.",
            "pubDate": "2026-01-26T02:27:40.118997"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/127525043.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2026-01-26T05:01:03.425259"
        },
        {
            "title": "Union Budget expectations, Q3 earnings, 6 other factors that may shape this week’s action on D-St",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-budget-expectations-q3-earnings-6-other-factors-that-may-shape-this-weeks-action-on-d-st/articleshow/127522962.cms",
            "description": "The sell-off was broad-based, with all sectoral indices finishing lower and midcap and smallcap stocks seeing notable wealth erosion.",
            "pubDate": "2026-01-26T05:01:03.425371"
        },
        {
            "title": "Budget 2026: Why market may shift from broad rallies to stock-specific bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-why-market-may-shift-from-broad-rallies-to-stock-specific-bets/articleshow/127522154.cms",
            "description": "A key shift we expect is transition in policy emphasis from stimulating consumption to enabling production, reflecting a broader economic pivot from a ‘Buy India’ approach to a ‘Build India’ agenda.",
            "pubDate": "2026-01-26T05:01:03.425472"
        },
        {
            "title": "NBFCs let it pass through as funding costs increase",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfcs-let-it-pass-through-as-funding-costs-increase/articleshow/127520850.cms",
            "description": "Retail loan pricing at some NBFCs has risen, offsetting recent repo rate cuts due to climbing borrowing costs. Experts note that while many maintain rates, some are passing higher funding expenses to customers via increased lending rates or fees. The spread between NBFC and corporate borrowing costs has widened significantly.",
            "pubDate": "2026-01-26T05:01:03.425587"
        },
        {
            "title": "Yen surges as intervention risks lurk, gold surpasses $5,000/oz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yen-surges-as-intervention-risks-lurk-gold-surpasses-5000/oz/articleshow/127520647.cms",
            "description": "Gold surged past $5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, ‍while markets remained on tenterhooks after a rout ​in bonds and violent spikes in the yen.",
            "pubDate": "2026-01-26T05:01:03.425687"
        }
    ]
}