{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-11T17:14:00.672864",
    "items": [
        {
            "title": "Suzlon Energy Q1 preview: PAT may jump up to 58% YoY, revenue to surge 65% on strong execution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/suzlon-energy-q1-preview-pat-may-jump-up-to-58-yoy-revenue-to-surge-65-on-strong-execution/articleshow/123234365.cms",
            "description": "Suzlon Energy’s Q1 earnings are expected to show 55–58% YoY profit growth and ~60% revenue rise on robust wind turbine execution, though margins may stay flat at 17–18% amid seasonal slowdown",
            "pubDate": "2025-08-11T11:59:35.758749"
        },
        {
            "title": "June quarter results review: Sectors show mixed performance amid subdued demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/june-quarter-results-review-sectors-show-mixed-performance-amid-subdued-demand/articleshow/123225300.cms",
            "description": "June quarter results show mixed performance across sectors. Automobiles, banking, and IT faced demand challenges. Cement, metals, and pharma saw gains. Mahindra and Mahindra excelled in automobiles. Public sector banks maintained asset quality. Ultratech reduced production costs. Infosys and HCL Technologies revised revenue guidance. Reliance Industries reported strong operating profit. Sector performance varied due to diverse economic factors.",
            "pubDate": "2025-08-11T11:59:35.758890"
        },
        {
            "title": "JM Financial Q1 profit jumps 166 pc to Rs 454 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jm-financial-q1-profit-jumps-166-pc-to-rs-454-crore/articleshow/123240214.cms",
            "description": "JM Financial on Monday reported a 166 per cent rise in consolidated net profit to Rs 454 crore for the June quarter of FY26.",
            "pubDate": "2025-08-11T17:13:58.845596"
        },
        {
            "title": "Muthoot Microfin returns to profit despite sharp year-on-year drop",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/muthoot-microfin-returns-to-profit-despite-sharp-year-on-year-drop/articleshow/123239695.cms",
            "description": "Muthoot Microfin posted a Rs 6.2 crore Q1 profit after last quarter’s loss, down 95% YoY. GNPA rose to 4.85%, provisions increased, but collection efficiency improved, avoiding management overlay.",
            "pubDate": "2025-08-11T17:13:58.845726"
        },
        {
            "title": "Bata India Q1 Results: Net profit plunges 70% to Rs 52 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bata-india-q1-results-net-profit-plunges-70-to-rs-52-crore/articleshow/123239019.cms",
            "description": "Footwear maker Bata India Ltd on Monday reported a 70 per cent decline in consolidated net profit to Rs 52 crore in the first quarter ended June 30, 2025, impacted by higher expenses amid sluggish consumption momentum and a high base effect.",
            "pubDate": "2025-08-11T17:13:58.845836"
        }
    ]
}