{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-24T04:49:02.337332",
    "items": [
        {
            "title": "Sebi bans First Overseas Capital for two years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bans-first-overseas-capital-for-two-years/articleshow/124774160.cms",
            "description": "Sebi has banned First Overseas Capital from the securities market and new IPO mandates for two years, imposing a ₹20 lakh fine. The regulator found the merchant banker violated norms by not maintaining adequate net worth, exceeding underwriting limits, and engaging in non-securities business. These actions followed an inspection revealing multiple regulatory breaches.",
            "pubDate": "2025-10-24T00:40:43.910267"
        },
        {
            "title": "Stocks in news: ITC Hotels, Dr Reddy's, SBI Life, Hero MotoCorp, Vedanta",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-itc-hotels-dr-reddys-sbi-life-hero-motocorp-vedanta/articleshow/124768458.cms",
            "description": "Markets traded volatile on Thursday, ending nearly unchanged after early gains were erased by profit-taking in heavyweight stocks. Analysts suggest a short-term consolidation phase is likely, with Nifty holding above 25,600 considered healthy. Several companies, including Vedanta, Hero MotoCorp, and Colgate-Palmolive, are in focus due to investment plans, international expansion, and Q2 results.",
            "pubDate": "2025-10-24T00:40:43.910395"
        },
        {
            "title": "Trade pact possibilities boost Indian export stocks amid market rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trade-pact-possibilities-boost-indian-export-stocks-amid-market-rally/articleshow/124774129.cms",
            "description": "Indian exporters, particularly in IT and textiles, saw a significant surge on Thursday following reports of an impending India-US trade pact. This potential deal could drastically lower US tariffs on Indian goods, boosting export prospects.",
            "pubDate": "2025-10-24T00:40:43.910613"
        },
        {
            "title": "Indices rise for sixth consecutive day amid US trade deal optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indices-rise-for-sixth-consecutive-day-amid-us-trade-deal-optimism/articleshow/124774053.cms",
            "description": "Indian stock markets closed higher for the sixth consecutive day. Gains were fueled by positive reports on trade negotiations between India and the US. Information Technology stocks saw a significant rise. While Reliance Industries shares declined, the overall market sentiment remained optimistic. Investors are awaiting concrete outcomes from the trade deal discussions.",
            "pubDate": "2025-10-24T00:40:43.910735"
        },
        {
            "title": "Stock Radar: SBI hits fresh record highs in October 2025; will the rally continue in November?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-sbi-hits-fresh-record-highs-in-october-2025-will-the-rally-continue-in-november/articleshow/124759086.cms",
            "description": "State Bank of India has broken out of a consolidation range, hitting fresh highs and suggesting further rally potential. Experts recommend buying on dips towards Rs 900 for targets above Rs 1,000 in the next 1-2 months, citing bullish technical indicators and outperformance in the PSU banking sector.",
            "pubDate": "2025-10-24T00:40:43.910837"
        },
        {
            "title": "RBI proposes to mandate UTI for all OTC derivative transactions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-proposes-to-mandate-uti-for-all-otc-derivative-transactions/articleshow/124774143.cms",
            "description": "The Reserve Bank of India is shaking up the financial landscape with a groundbreaking rule coming into effect next fiscal year. Beginning then, all over-the-counter derivative trades related to rupee interest rates and foreign exchange currencies will need a Unique Transaction Identifier. This identifier is designed to offer regulators better insights into transaction trends and market health.",
            "pubDate": "2025-10-24T00:40:43.911801"
        },
        {
            "title": "6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124776673.cms",
            "description": "As of October 23, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 9% compared to the previous trade. A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-24T04:40:57.787685"
        },
        {
            "title": "Infosys, TCS and 3 other stocks that show bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-tcs-and-3-other-stocks-that-show-bullish-rsi-upswing/slideshow/124776494.cms",
            "description": "On October 23, five largecap stocks on the NSE were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" indicates that the Relative Strength Index (RSI) values are increasing, suggesting a strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify opportunities for buying.",
            "pubDate": "2025-10-24T04:40:57.787818"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley maintains Equal-Weight on Bharat Forge; Citi raises target price on Hindustan Unilever",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-maintains-equal-weight-on-bharat-forge-citi-raises-target-price-on-hindustan-unilever/articleshow/124776175.cms",
            "description": "Brokerages show mixed views on consumer and manufacturing stocks; HUL and Colgate retain Buy ratings with revised targets, while Bharat Forge faces international headwinds despite strong defence orders boosting near-term prospects.",
            "pubDate": "2025-10-24T04:40:57.787935"
        },
        {
            "title": "HUL shares decline 5% as brokerages turn cautious post Q2 show. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-decline-5-as-brokerages-turn-cautious-post-q2-show-should-you-buy-sell-or-hold/articleshow/124776197.cms",
            "description": "HUL shares fell after Q2 FY26 net profit rose 3.6% to Rs 2,685 crore, mainly due to a one-off tax gain, while brokers flagged margin pressures and subdued operational performance.",
            "pubDate": "2025-10-24T04:40:57.788058"
        },
        {
            "title": "Sensex slips over 100 pts, Nifty below 25,900 as doubts cloud US-India trade deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-100-pts-nifty-below-25900-as-doubts-cloud-us-india-trade-deal/articleshow/124776163.cms",
            "description": "Indian stock markets opened on a subdued note this Friday. The Sensex and Nifty saw a slight dip after reaching near record highs. The rally from Thursday lost momentum as optimism about a US-India trade deal waned. The Indian government did not confirm reports of an imminent agreement. Markets are now awaiting further developments.",
            "pubDate": "2025-10-24T04:40:57.788171"
        },
        {
            "title": "Late starter Mukesh Ambani crashes quick commerce party. Can Reliance disrupt Blinkit, Swiggy, Zepto's 10-minute game?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/late-starter-mukesh-ambani-crashes-quick-commerce-party-can-reliance-disrupt-blinkit-swiggy-zeptos-10-minute-game/articleshow/124776152.cms",
            "description": "Reliance Retail has entered India’s 10-minute delivery race with JioMart, leveraging 3,000 stores as delivery hubs and 600 dark stores in top cities. The platform added 5.8 million customers in one quarter, recording 42% sequential growth and a 200% YoY jump in daily orders, signaling a major push into quick commerce and intensified competition with Blinkit, Zepto, and Swiggy Instamart.",
            "pubDate": "2025-10-24T04:40:57.788279"
        },
        {
            "title": "Premier Energies, Syrma SGS shares in focus on JV to acquire KSolare Energy for Rs 170 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-syrma-sgs-shares-in-focus-on-jv-to-acquire-ksolare-energy-for-rs-170-crore/articleshow/124776102.cms",
            "description": "Premier Energies and Syrma SGS Technologies will be in focus on October 24 after announcing a joint acquisition of Pune-based solar inverter maker KSolare Energy for Rs 170 crore. Premier Energies will take a 51% stake and Syrma SGS 49%, with KSolare becoming a subsidiary of Premier Energies. The deal is expected to close within 90 days, subject to approvals.",
            "pubDate": "2025-10-24T04:40:57.788383"
        },
        {
            "title": "Hero MotoCorp shares in focus on entering UK market with MotoGB partnership",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-on-entering-uk-market-with-motogb-partnership/articleshow/124776043.cms",
            "description": "Hero MotoCorp shares: The company enters the UK market, launching its Euro 5+ Hunk 440 motorcycle through a partnership with MotoGB, marking its 51st global market.",
            "pubDate": "2025-10-24T04:40:57.788481"
        },
        {
            "title": "BDL, BML & other defence stocks rally up to 4% after DAC clears Rs 79,000 crore capital acquisition proposals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-hal-bdl-other-defence-stocks-in-focus-after-dac-clears-rs-79000-crore-capital-acquisition-proposals/articleshow/124775995.cms",
            "description": "Defence stocks rallied as the Defence Acquisition Council approved capital acquisition proposals worth approximately Rs 79,000 crore for the Indian Army, Navy, and Air Force. These approvals aim to bolster India's defence preparedness with advanced weapons systems, mobility platforms, and surveillance equipment across all domains.",
            "pubDate": "2025-10-24T04:40:57.788576"
        },
        {
            "title": "Oil India, ONGC, BPCL, other oil-sensitive stocks in focus as US sanctions on Russia send crude prices soaring",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-india-ongc-bpcl-other-oil-sensitive-stocks-in-focus-as-us-sanctions-on-russia-send-crude-prices-soaring/articleshow/124775912.cms",
            "description": "Shares of oil and gas firms including Oil India, ONGC, Indian Oil, and BPCL are in focus after crude oil surged over 5% overnight, heading for its strongest weekly gain since mid-June. The rally followed U.S. sanctions on Russia’s top oil producers, raising supply concerns. Analysts cite OPEC+ meetings and U.S.-India talks on Russian oil as key near-term factors.",
            "pubDate": "2025-10-24T04:40:57.788679"
        },
        {
            "title": "Vodafone Idea among 4 stocks flashing bullish signals, hinting at possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-among-4-stocks-flashing-bullish-signals-hinting-at-possible-uptrend/slideshow/124775875.cms",
            "description": "On October 23, among NSE stocks with a market capitalization of over Rs 10,000 crore, four stocks appeared on the bullish scanner with a “White Marubozu” pattern, according to StockEdge's technical scan data.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest of the period and the closing price is the highest, represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow. This indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers controlled the market from open to close, often using the pattern to make informed decisions on future price movements.",
            "pubDate": "2025-10-24T04:40:57.788777"
        },
        {
            "title": "Nifty rally fuels renewed optimism; analysts eye 30,800 as medium-term target",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-rally-fuels-renewed-optimism-analysts-eye-30800-as-medium-term-target/articleshow/124775841.cms",
            "description": "The Nifty 50 and Sensex touched near-record highs, fueled by festive-season optimism, supportive policies, and expectations of robust corporate earnings. Positive FII inflows and optimism around a potential India–U.S. trade deal further boosted sentiment. Technical analysts highlight bullish breakouts, including a Cup and Handle pattern, pointing to medium-term Nifty targets of 30,800, though near-term volatility cannot be ruled out.",
            "pubDate": "2025-10-24T04:40:57.788875"
        },
        {
            "title": "BGR Energy, GM Breweries among 7 stocks witnessing 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bgr-energy-gm-breweries-among-7-stocks-witnessing-5-year-swing-high-breakouts/slideshow/124775817.cms",
            "description": "In the NSE list of stocks with a market capitalisation of over Rs 1,000 crore, six counters hit their 5-year swing highs at the close on October 23, signalling bullish momentum, according to data from StockEdge's technical scan.A 5-year swing high marks the highest price a stock has reached within a five-year period. This level often acts as a key resistance zone where prices have previously struggled to break through. Reaching this point is typically viewed as a bullish signal, suggesting potential for further upside. However, it differs from a 5-year breakout, which occurs when the stock decisively surpasses that resistance level.Stocks hitting 5-year swing highs:",
            "pubDate": "2025-10-24T04:40:57.788972"
        },
        {
            "title": "Colgate-Palmolive shares slide 4% after Q2 profit falls 17% YoY, brokerages trim target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/colgate-palmolive-shares-in-focus-after-q2-net-profit-falls-17-yoy/articleshow/124775431.cms",
            "description": "In a challenging turn of events, Colgate-Palmolive India's shares took a hit as the company reported a 17% decline in net profit for the September quarter, alongside a drop in revenue. The decline was attributed to recent changes in the Goods and Services Tax rates affecting oral care products.",
            "pubDate": "2025-10-24T04:40:57.789087"
        },
        {
            "title": "Positive Breakout: These 10 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-cross-above-their-200-dmas/slideshow/124774821.cms",
            "description": "In the Nifty500 pack, 10 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 23, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-24T04:40:57.789185"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Dalmia Bharat, RIL among 5 stocks that could give 15-69% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-dalmia-bharat-ril-among-5-stocks-that-could-give-15-69-return/slideshow/124774747.cms",
            "description": "Brokerages remain optimistic on select names across sectors, highlighting opportunities in cement, engineering, renewables, energy, and specialty chemicals for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-24T04:40:57.789281"
        },
        {
            "title": "Auto parts boom ahead: 10 stocks to ride India’s $200 billion component market by 2030",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-parts-boom-ahead-10-stocks-to-ride-indias-200-billion-component-market-by-2030/slideshow/124776794.cms",
            "description": "India’s auto component industry is gearing up for a high-growth run, projected to expand at an 18% CAGR to $200 billion by 2030, driven by robust domestic demand, exports, and EV adoption. Analysts say several listed suppliers are well-positioned to benefit from this cycle. Here are 10 stocks with the highest upside potential, according to Trendlyne.",
            "pubDate": "2025-10-24T04:49:01.097990"
        },
        {
            "title": "Hitachi Energy among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hitachi-energy-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124776673.cms",
            "description": "As of October 23, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 9% compared to the previous trade. A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-24T04:49:01.098112"
        }
    ]
}