{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-01T14:49:45.173898",
    "items": [
        {
            "title": "Ambuja Cements net profit jumps to Rs 970 crore on record sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ambuja-cements-net-profit-jumps-to-rs-970-crore-on-record-sales/articleshow/123032508.cms",
            "description": "Ambuja Cements, owned by the Adani Group, reported a 24% on-year jump in consolidated net profit, reaching ₹970 crore, driven by record sales volume and revenue exceeding ₹10,000 crore. Despite strong performance, the bottom line fell short of market expectations, leading to a share price decline. The company's market share also improved, supported by increased production capacity.",
            "pubDate": "2025-08-01T01:52:17.502705"
        },
        {
            "title": "HUL surges 3.5% on strong Q1 show, margin recovery in sight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hul-surges-3-5-on-strong-q1-show-margin-recovery-in-sight/articleshow/123031982.cms",
            "description": "Hindustan Unilever's stock rose 3.5% after reporting June quarter results that exceeded expectations, despite a slight dip in Ebitda margin due to increased advertising. Sales volume grew by 4%, with underlying sales growth reaching 5%. The company anticipates sustained business momentum, driven by price increases and stable input costs, expecting Ebitda margins to remain between 22% and 23%.",
            "pubDate": "2025-08-01T01:52:17.502838"
        },
        {
            "title": "Godrej Properties Q1 net profit up 15% to Rs 600 crore, total income down 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/godrej-properties-q1-net-profit-up-15-to-rs-600-crore-total-income-down-3/articleshow/123040267.cms",
            "description": "Godrej Properties posted a 15% YoY rise in Q1 net profit to ₹600 crore, even as income declined 3%. Sales dipped 18%, but collections grew 22%. The company added five projects and achieved 57% of its annual business development target.",
            "pubDate": "2025-08-01T10:19:59.658920"
        },
        {
            "title": "Adani Power Q1 Results: Cons PAT drops 15% YoY to Rs 3,305 crore; revenue down 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-power-q1-results-cons-profit-drops-15-yoy-to-rs-3305-crore-revenue-slides-6/articleshow/123038019.cms",
            "description": "Adani Power Q1 Results: Adani Power announced its Q1 FY26 results. The company's net profit witnessed a decrease. Revenue also experienced a dip compared to the previous year. Lower tariff realization and higher expenses impacted profit. Revenue decline was due to imported coal prices. Installed capacity increased, but plant load factor decreased. The company approved a stock split.",
            "pubDate": "2025-08-01T10:19:59.659063"
        },
        {
            "title": "One MobiKwik Systems Q1 Results: loss widens to Rs 42 crore; revenue declines 21% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/one-mobikwik-systems-q1-results-loss-widens-to-rs-42-crore-revenue-declines-21-yoy/articleshow/123037915.cms",
            "description": "One MobiKwik Systems reported a widened consolidated loss of Rs 41.9 crore in Q1 FY26, despite a revenue of Rs 271.3 crore. The company utilized Rs 214 crore from its IPO funds for business growth and R&D. MobiKwik achieved its highest-ever quarterly payments GMV at Rs 38,388.2 crore, with a user base of 180.2 million.",
            "pubDate": "2025-08-01T10:19:59.659172"
        },
        {
            "title": "ITC Q1 Results: Cons PAT rises 3% YoY to Rs 5,244 crore, revenue jumps 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-q1-results-cons-pat-rises-3-yoy-to-rs-5244-crore-revenue-jumps-19/articleshow/123043815.cms",
            "description": "ITC Q1 Results: FMCG major ITC reported a 3% year-on-year increase in its consolidated net profit for the June quarter at Rs 5,244 crore on Friday, compared to Rs 5,092 crore in the year-ago period. The profit after tax (PAT) is attributable to the owners of the company.",
            "pubDate": "2025-08-01T14:49:43.663547"
        },
        {
            "title": "Tata Power Q1 Results: Cons PAT rises 9% YoY to Rs 1,060 crore, revenue up 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-power-q1-results-cons-pat-rises-9-yoy-to-rs-1060-crore-revenue-up-4/articleshow/123042418.cms",
            "description": "Tata Power Q1 Results: Tata Power on Friday reported a 9% growth in its Q1 consolidated net profit to Rs 1,060 crore compared to Rs 970 crore in the year ago period. The profit after tax (PAT) is attributable to the equity holders of the company.",
            "pubDate": "2025-08-01T14:49:43.663673"
        }
    ]
}