{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-11T17:44:01.231225",
    "items": [
        {
            "title": "ONGC Q2 profit down 18% on low oil price, to pay Rs 6/share dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ongc-q2-profit-down-18-on-low-oil-price-to-pay-rs-6/share-dividend/articleshow/125237723.cms",
            "description": "Oil and Natural Gas Corp. saw its quarterly profit drop 18 percent. This decline is attributed to lower oil prices. The company announced an interim dividend for shareholders. ONGC is also investing in renewable energy and entering the ethane transportation business through new joint ventures. Crude oil production saw a slight increase.",
            "pubDate": "2025-11-11T02:43:21.205949"
        },
        {
            "title": "Bajaj Finance profit surges 23% in September quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finance-profit-surges-23-in-september-quarter/articleshow/125237353.cms",
            "description": "Bajaj Finance reported a 23% yearly increase in consolidated net profit to ₹4,948 crore for the July-September quarter, driven by a 22% rise in net interest income and a 26% surge in new loans booked. The NBFC's assets under management grew 24% to ₹4.6 lakh crore, with a mild deterioration in asset quality to 1.2%.",
            "pubDate": "2025-11-11T02:43:21.206086"
        },
        {
            "title": "BLS International Q2 Results: PAT jumps 27% to Rs 186 crore, revenue soars 49%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bls-international-q2-results-pat-jumps-27-to-rs-186-crore-revenue-soars-49/articleshow/125251127.cms",
            "description": "BLS International reported Rs 737 crore in Q2 FY26 revenue, up 49% YoY, and Rs 186 crore profit, up 27%. It secured key contracts from UIDAI and India’s MEA, expanding operations globally.",
            "pubDate": "2025-11-11T13:53:07.285318"
        },
        {
            "title": "Ikea India sales grows 6% YoY to Rs 1,860 crore, eyes profitability in 2 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ikea-india-sales-grows-6-yoy-to-rs-1860-crore-eyes-profitability-in-2-year/articleshow/125250949.cms",
            "description": "Ikea India reported 6% YoY sales growth to Rs 1,860.8 crore in FY25 and 12% EBITDA growth, targeting profitability within two years amid expanding online and North India presence.",
            "pubDate": "2025-11-11T13:53:07.285463"
        },
        {
            "title": "BSE Q2 Results: Cons PAT soars 61% YoY to Rs 558 crore, revenue surges 44%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bse-q2-results-cons-pat-soars-61-yoy-to-rs-558-crore-revenue-surges-44/articleshow/125250126.cms",
            "description": "BSE Q2 Results:  BSE reported a significant 61% year-on-year growth in its consolidated Q2 net profit, reaching Rs 558 crore. Revenue from operations also surged by 44% to Rs 1,068 crore. Sequentially, the company saw a 3.5% increase in profit and a 12% rise in topline.",
            "pubDate": "2025-11-11T13:53:07.285569"
        },
        {
            "title": "Hindustan Copper Q2 Results: Profit grows 85% to Rs 186 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindustan-copper-q2-results-profit-grows-85-to-rs-186-crore/articleshow/125249191.cms",
            "description": "Hindustan Copper on Tuesday posted around 85 per cent rise in consolidated net profit at Rs 186.02 crore for September quarter FY26, on account of increased income.",
            "pubDate": "2025-11-11T13:53:07.285673"
        },
        {
            "title": "Bajaj Finserv Q2 Results: Cons profit rises 7% YoY to Rs 2,244 crore, revenue jumps 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finserv-q2-results-cons-profit-rises-7-yoy-to-rs-2244-crore-revenue-up-11/articleshow/125244474.cms",
            "description": "Bajaj Finserv Q2 Results: The company’s revenue from operations rose 11% year-on-year to ₹37,403 crore in the quarter under review, compared with ₹33,704 crore in the same period last year.",
            "pubDate": "2025-11-11T13:53:07.285771"
        },
        {
            "title": "SoftBank Group posts $16.6 billion Q2 profit on OpenAI gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/softbank-group-posts-16-6-billion-q2-profit-on-openai-gains/articleshow/125243560.cms",
            "description": "Japan's SoftBank Group has announced a remarkable net profit of 2.5 trillion yen for the July-September quarter, driven significantly by its stake in OpenAI, the creator of ChatGPT. This marks their third consecutive profitable quarter, with investment gains from the Vision Fund soaring.",
            "pubDate": "2025-11-11T13:53:07.285870"
        },
        {
            "title": "Asian Paints Q2 Preview: Revenue seen flat, profit subdued as extended rains hit demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/asian-paints-q2-preview-revenue-seen-flat-profit-subdued-as-extended-rains-hit-demand/articleshow/125241805.cms",
            "description": "Asian Paints is expected to post a muted Q2 performance as extended monsoons and weak demand hurt sales. Revenue is likely to stay flat year-on-year, while profit may rise just 1%. Lower raw material costs should cushion margins, but higher trade spends and an unfavourable product mix may limit upside, say analysts.",
            "pubDate": "2025-11-11T13:53:07.285964"
        },
        {
            "title": "Tata Steel Q2 Preview: Revenue may rise 2% YoY; low base to lift profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steel-q2-preview-revenue-may-rise-2-yoy-low-base-to-lift-profit/articleshow/125241479.cms",
            "description": "Tata Steel is likely to post a sharp rebound in profit for Q2 FY26, aided by lower input costs and higher domestic volumes, even as steel prices remain weak. Analysts expect a 2% rise in revenue and nearly 270% jump in profit year-on-year, driven by India operations offsetting European weakness.",
            "pubDate": "2025-11-11T13:53:07.286057"
        },
        {
            "title": "Welspun Enterprises Q2 Results: Net profit grows to Rs 98 crore; company to raise Rs 1,000 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/welspun-enterprises-q2-results-net-profit-grows-to-rs-98-crore-company-to-raise-rs-1000-cr/articleshow/125252370.cms",
            "description": "Welspun Enterprises on Tuesday said it has posted a 59 per cent rise in consolidated net profit at Rs 98.08 crore in September quarter of FY26, aided by reduced expenses, and the company looks to raise Rs 1,000 crore to fund growth.",
            "pubDate": "2025-11-11T16:39:44.224462"
        },
        {
            "title": "PC Jeweller Q2 Results: Profit rises 17% to Rs 210 crore, revenue soars 63%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pc-jeweller-q2-results-profit-rises-17-to-rs-210-crore-revenue-soars-63/articleshow/125252001.cms",
            "description": "PC Jeweller Ltd on Tuesday reported a 17 per cent increase in its consolidated net profit to Rs 209.54 crore for the quarter ended September.",
            "pubDate": "2025-11-11T16:39:44.224595"
        },
        {
            "title": "Awfis Q2 Results: Profit plunges 59% to Rs 16 crore on high base effect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/awfis-q2-results-profit-plunges-59-to-rs-16-crore-on-high-base-effect/articleshow/125251793.cms",
            "description": "Realty firm Awfis Space Solutions Ltd on Tuesday reported a 59 per cent decline in its consolidated profit to Rs 15.97 crore in the latest September quarter on a high base effect.",
            "pubDate": "2025-11-11T16:39:44.224702"
        },
        {
            "title": "Bikaji Foods Q2 Results: Profit rises 13% to Rs 78 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bikaji-foods-q2-results-profit-rises-13-to-rs-78-crore/articleshow/125251747.cms",
            "description": "Snacks manufacturer Bikaji Foods International Ltd on Tuesday reported 13.5 per cent increase in consolidated net profit at Rs 77.67 crore for the second quarter ended September 2025.",
            "pubDate": "2025-11-11T16:39:44.224806"
        },
        {
            "title": "ESAF Small Finance Bank posts 5th straight quarterly loss as NPAs surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/esaf-small-finance-bank-posts-5th-straight-quarterly-loss-as-npas-surge/articleshow/125251514.cms",
            "description": "ESAF Small Finance Bank reported a Rs 116 crore net loss in Q2, an improvement from the previous year's Rs 190 crore loss, marking its fifth consecutive quarterly deficit. The bank's gross non-performing assets rose to 8.54%, despite lower provisions. Income from operations also declined.",
            "pubDate": "2025-11-11T16:39:44.224911"
        },
        {
            "title": "Biocon Q2 Results: Profit soars 428% YoY to Rs 85 crore on strong biosimilar and generics growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/biocon-q2-results-profit-soars-428-yoy-to-rs-85-crore-on-strong-biosimilar-and-generics-growth/articleshow/125253698.cms",
            "description": "Biocon Group reported a strong Q2 FY26 with a 20% year-on-year increase in operating revenue to Rs 4,296 crore, driven by biosimilars and generics. Net profit surged 428% to Rs 85 crore, boosted by debt settlement and strategic partnerships for affordable insulin access in the US. The company also inaugurated its first US OSD manufacturing facility and commenced Semaglutide filings.",
            "pubDate": "2025-11-11T17:44:00.600855"
        }
    ]
}