{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-15T04:15:01.315173",
    "items": [
        {
            "title": "Prodocs Solutions shares to debut today. Check GMP and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prodocs-solutions-shares-to-debut-today-check-gmp-and-other-details/articleshow/125968794.cms",
            "description": "Prodocs Solutions is set for its BSE SME debut with a muted grey market premium, suggesting a flat listing at its IPO price of Rs 138. The Rs 27.60 crore IPO saw moderate subscription, with non-institutional investors showing the strongest demand.",
            "pubDate": "2025-12-15T01:55:28.853231"
        },
        {
            "title": "KV Toys India IPO listing today. Here's what GMP suggests",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kv-toys-india-ipo-listing-today-heres-what-gmp-suggests/articleshow/125968780.cms",
            "description": "KV Toys India is set for its stock market debut. Grey market indicators suggest a strong listing. The company's IPO saw massive investor interest, with subscriptions exceeding expectations. This reflects aggressive participation from investors seeking listing gains. KV Toys India operates in toy manufacturing and sales. The company has shown a financial turnaround. All eyes are on the listing performance.",
            "pubDate": "2025-12-15T01:55:28.853370"
        },
        {
            "title": "Riddhi Display Equipments shares to list today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/riddhi-display-equipments-shares-to-list-today-heres-what-gmp-indicates/articleshow/125968771.cms",
            "description": "Riddhi Display Equipments is set to list on the BSE SME platform with a cautious outlook, as indicated by a zero grey market premium. The Rs 24.68 crore IPO, which saw strong retail investor interest, aims to fund working capital and general corporate needs.",
            "pubDate": "2025-12-15T01:55:28.853481"
        },
        {
            "title": "Asian stocks slip as traders reduce exposure ahead of central bank meetings, key data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fall-on-tech-concerns-bitcoin-slips/articleshow/125968624.cms",
            "description": "Asian markets opened lower as concerns over technology company earnings and massive AI spending sapped risk sentiment. South Korea, a key AI player, saw a significant slump, mirroring Wall Street's tech-led decline. Investors are debating AI exposure amid skepticism about valuations and the technology's ultimate consumer adoption.",
            "pubDate": "2025-12-15T01:55:28.853596"
        },
        {
            "title": "Honk Kong, India fuel blockbuster year for Asia fundraising",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honk-kong-india-fuel-blockbuster-year-for-asia-fundraising/articleshow/125968587.cms",
            "description": "Hong Kong's stock market has experienced a remarkable turnaround. Share sales have surged, making it Asia's leading fundraising hub. This boom is fueled by Chinese companies seeking global expansion. India, mainland China, and Japan also saw strong dealmaking. Despite global challenges, Hong Kong's market shows robust activity. Investors are now focusing on quality deals.",
            "pubDate": "2025-12-15T01:55:28.853698"
        },
        {
            "title": "Asia's rich drive a $200-billion revival in complex equity notes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asias-rich-drive-a-200-billion-revival-in-complex-equity-notes/articleshow/125968574.cms",
            "description": "Wealthy Asian investors are pouring record funds into complex stock products. Issuance of these products linked to Hong Kong and Singapore equities has surged significantly this year. Accumulators and fixed-coupon notes are particularly popular. This trend coincides with a surge in Asian equities driven by artificial intelligence. These instruments offer controlled stock exposure, though complexity can amplify losses.",
            "pubDate": "2025-12-15T01:55:28.853800"
        },
        {
            "title": "Stocks in news: Wipro, Dr Reddy's, Tata Steel, Tejas Networks, SAIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-wipro-dr-reddys-tata-steel-tejas-networks-sail/articleshow/125963290.cms",
            "description": "Indian markets saw a rebound on Friday, driven by positive global sentiment. Key companies like Wipro, Dr Reddy's, Tata Steel, and SAIL are in focus due to recent developments. Godrej Properties is expanding in Hyderabad. Nestle India appointed a new HR head. Tata Steel plans capacity expansion. SAIL reported sales growth. Tejas Networks secured contracts for rural broadband.",
            "pubDate": "2025-12-15T01:55:28.853897"
        },
        {
            "title": "GIFT Nifty down 90 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125963317.cms",
            "description": "Markets ended the week in negative territory amid mixed domestic and global cues, with selling pressure intensifying before a late rebound. The upcoming week will see the release of key domestic data including WPI inflation and trade balance figures, alongside flash PMI readings. Foreign portfolio investors were net sellers, while domestic institutional investors bought shares.",
            "pubDate": "2025-12-15T01:55:28.854010"
        },
        {
            "title": "A break above 26,300 key for next Nifty rally: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-break-above-26300-key-for-next-nifty-rally-analysts/articleshow/125968526.cms",
            "description": "Nifty has stabilized near recent highs, consolidating after a rebound from the 25,700 zone. The index faces resistance at 26,050–26,300, with a decisive move above this level potentially leading to a rally towards 26,350–26,500. Immediate support is seen at 25,900.",
            "pubDate": "2025-12-15T01:55:28.854107"
        },
        {
            "title": "At $18.4 billion, FPI equity sales hit new record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-18-4-billion-fpi-equity-sales-hit-new-record/articleshow/125968517.cms",
            "description": "Foreign investors are selling Indian stocks at a record pace this year. They have offloaded $18.4 billion in equities, surpassing the previous high. While primary market inflows have slowed, secondary market sales have reached an all-time peak. Domestic funds, however, continue to invest consistently in local equities.",
            "pubDate": "2025-12-15T01:55:28.854202"
        },
        {
            "title": "Mutual fund fee revamp, simplified IPO disclosures on Sebi Board agenda",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cost-efficiency-in-mind-mf-fees-under-review/articleshow/125968445.cms",
            "description": "Sebi's board will discuss revamping mutual fund fee structures to enhance transparency and cost-efficiency for investors. Proposals include reducing total expense ratios and brokerage fees, alongside simplifying IPO disclosures and easing pre-IPO lock-in rules. The regulator aims to make investment more accessible and affordable for the public.",
            "pubDate": "2025-12-15T01:55:28.854293"
        },
        {
            "title": "Mizuho looks to wrap up Avendus acquisition this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mizuho-looks-to-wrap-up-avendus-acquisition-this-week/articleshow/125968485.cms",
            "description": "Board of the homegrown investment bank is scheduled to meet on Tuesday to okay transaction valuing I-banker at Rs 5,900 crore. KKR looks to make 3.5x rupee return from 9 year old investment.",
            "pubDate": "2025-12-15T01:55:28.854383"
        },
        {
            "title": "Vi may get 4-5 years of AGR dues moratorium; dues could be halved",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vi-may-get-4-5-years-of-agr-dues-moratorium-dues-could-be-halved/articleshow/125968470.cms",
            "description": "Under the current schedule, Vi needs to pay more than ₹18,000 crore next March as the first instalment after the end of a moratorium on AGR payments the government had given to telcos in 2021. This was not interest-free, resulting in the arrears increasing every year.",
            "pubDate": "2025-12-15T01:55:28.854476"
        },
        {
            "title": "Lending rates moving lower to raise pressure on bank NIMs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lending-rates-moving-lower-to-raise-pressure-on-bank-nims/articleshow/125968403.cms",
            "description": "Bankers said the move will delay margin recovery since they cannot cut deposit rates sharply due to stiff competition from alternative investment avenues such as mutual funds.",
            "pubDate": "2025-12-15T01:55:28.854664"
        },
        {
            "title": "How Motilal Oswal used Warren Buffett’s formula to deliver 55x growth and a 2-stock jackpot",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-motilal-oswal-used-warren-buffetts-formula-to-deliver-55x-growth-and-a-2-stock-jackpot/articleshow/125970221.cms",
            "description": "Motilal Oswal Financial Services has built a Rs 9,000-crore treasury, doubling every two years, inspired by Warren Buffett's Berkshire Hathaway. This strategy, a contrarian shift in FY15, has become a powerful second growth engine, enabling 31% decadal operating profit CAGR without external equity. The firm achieved multibagger returns in AU Small Finance Bank and the unlisted National Stock Exchange (NSE).",
            "pubDate": "2025-12-15T04:14:46.860691"
        },
        {
            "title": "Wipro shares in focus following strategic AI partnerships with Google Cloud, Microsoft",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-in-focus-following-strategic-ai-partnerships-with-google-cloud-microsoft/articleshow/125970224.cms",
            "description": "Wipro shares are expected to see movement following significant AI partnerships. The company is enhancing enterprise AI adoption with Google Cloud's Gemini Enterprise and Microsoft's AI tools. These collaborations aim to transform businesses into early AI adopters, boosting productivity and innovation across various sectors. Wipro is also upskilling its workforce to leverage these advanced technologies.",
            "pubDate": "2025-12-15T04:14:46.860806"
        },
        {
            "title": "Positive Breakout: These 14 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-14-stocks-cross-above-their-200-dmas/slideshow/125968951.cms",
            "description": "In the Nifty500 pack, 14 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 12, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-15T04:14:46.860907"
        },
        {
            "title": "BEL shares in focus on securing Rs 776 crore worth defence orders in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-on-securing-rs-776-crore-worth-defence-orders-in-a-month/articleshow/125970180.cms",
            "description": "Bharat Electronics Limited (BEL) is set to be in focus after announcing new defence orders worth Rs 776 crore. These orders, received since November 14, 2025, include indigenous Counter Unmanned Aerial Systems (SAKSHAM), Software Defined Radios, and Anti-Drone Systems, signaling continued growth in the company's order book.",
            "pubDate": "2025-12-15T04:14:46.861007"
        },
        {
            "title": "From Cyient to TCS, 49 IT stocks see FII selling amid year-long slump. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-cyient-to-tcs-49-it-stocks-see-fii-selling-amid-year-long-slump-do-you-own-any/articleshow/125970165.cms",
            "description": "Foreign investors have been selling Indian IT stocks for the past year. This has caused many IT companies to see their share prices fall. However, some market experts believe valuations are now attractive. They expect sentiment to improve soon. This could be helped by a US Federal Reserve rate cut. The Indian rupee's softness is also a factor.",
            "pubDate": "2025-12-15T04:14:46.861107"
        },
        {
            "title": "Sensex falls over 350 points, Nifty below 25,950 as foreign outflows keep D-St on edge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-350-points-nifty-below-25950-as-foreign-outflows-keep-d-st-on-edge/articleshow/125970155.cms",
            "description": "Indian equities commenced the week on a subdued note, with both the Sensex and Nifty experiencing declines. This downturn followed a two-session rally, primarily driven by ongoing foreign investor selling and persistent uncertainty surrounding a potential U.S. trade deal, which dampened investor risk appetite.",
            "pubDate": "2025-12-15T04:14:46.861201"
        },
        {
            "title": "Adani Green shares jump over 1% after SEBI drops insider trading case related to SB Energy deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-shares-jump-over-1-after-sebi-drops-insider-trading-case-related-to-sb-energy-deal/articleshow/125970140.cms",
            "description": "Adani Green Energy shares rose after SEBI dropped insider trading charges against Pranav Adani, Kunal Shah, and Nrupal Shah. The regulator found that trades occurred after acquisition information was publicly available, rendering UPSI allegations unsustainable. No penalties were imposed.",
            "pubDate": "2025-12-15T04:14:46.861299"
        },
        {
            "title": "Vodafone Idea shares jump 3% to new 52-week high amid likely government relief on Rs 83,000 cr AGR dues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-jump-3-to-new-52-week-high-amid-likely-government-relief-on-rs-83000-cr-agr-dues/articleshow/125970060.cms",
            "description": "Vodafone Idea shares: The government is likely to extend a 4–5 year interest-free moratorium on over Rs 83,000 crore of AGR dues, easing financial stress and improving near-term liquidity.",
            "pubDate": "2025-12-15T04:14:46.861395"
        },
        {
            "title": "Brigade Enterprises shares fall 2% after Income Tax search at company premises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brigade-enterprises-shares-in-focus-after-income-tax-search-at-company-premises/articleshow/125969474.cms",
            "description": "Brigade Enterprises shares dropped after the Income Tax Department conducted search operations. The searches concluded recently. The company stated its operations are unaffected. Analysts maintain a strong buy rating with a significant target price. The company recently acquired land in Hyderabad. Brigade Enterprises reported strong September quarter results with increased profit and revenue.",
            "pubDate": "2025-12-15T04:14:46.861489"
        },
        {
            "title": "KEC International shares surge 5% on bagging its biggest T&D order. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kec-international-shares-in-focus-on-bagging-its-biggest-td-order-check-details/articleshow/125969403.cms",
            "description": "Shares of KEC International surged following the announcement of fresh orders amounting to Rs 1,150 crore. The transmission and distribution division clinched its biggest domestic deal to date, significantly enhancing KEC's foothold in the power infrastructure sector. With year-to-date orders exceeding Rs 18,000 crore, this robust performance stands in stark contrast to recent declines in the stock market.",
            "pubDate": "2025-12-15T04:14:46.861581"
        },
        {
            "title": "Stocks to buy for 2026: Lloyds Metals, Tata Steel among 5 stocks that could give double digit returns in next 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-lloyds-metals-tata-steel-among-5-stocks-that-could-give-double-digit-returns-in-next-1-year/slideshow/125968861.cms",
            "description": "Brokerage sentiment remains broadly positive across a diverse set of companies, with analysts highlighting strong upside potential driven by sectoral tailwinds, robust earnings outlook, and improving fundamentals.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-15T04:14:46.861689"
        }
    ]
}