{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-27T06:27:15.690703",
    "items": [
        {
            "title": "Nifty indices rejig: Zomato, Jio Financial to see $822 million inflows as BPCL, Britannia exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-indices-rejig-zomato-jio-financial-to-see-822-million-inflows-as-bpcl-britannia-exit/articleshow/119577848.cms",
            "description": "The reshuffle, coinciding with Nifty's derivatives expiry, will result in Bharat Petroleum Corp Ltd (BPCL) and Britannia Industries Ltd exiting the index, causing significant outflows, while Grasim Industries and Bajaj Finance will undergo weightage adjustments.",
            "pubDate": "2025-03-27T06:26:56.876085"
        },
        {
            "title": "BSE shares climb 6% as company mulls bonus share issuance on March 30",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-climb-6-as-company-mulls-bonus-share-issuance-on-march-30/articleshow/119576870.cms",
            "description": "BSE shares surged nearly 6%, reaching Rs 4,730.30 on the NSE after the exchange announced a board meeting on March 30 to consider a bonus share proposal. If approved, this would be BSE’s second bonus issue in three years, following the issuance of two bonus shares for every one held by investors in March 2022.",
            "pubDate": "2025-03-27T06:26:56.876208"
        },
        {
            "title": "Bharti Airtel, DLF among 7 stocks that earned upgrades in last 1 month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-dlf-among-7-stocks-that-earned-upgrades-in-last-1-month/slideshow/119575286.cms",
            "description": "Several brokerages have upgraded the target prices of various stocks over the past month. According to Trendlyne data, Bharti Airtel, Manappuram Finance, DLF, Federal Bank, and Jubilant Foodworks have received up to three analysts' target price upgrades in the last month. Here is a list of these stocks:",
            "pubDate": "2025-03-27T06:26:56.876312"
        },
        {
            "title": "Pharma stocks slip up to 3% as uncertainties loom around Trump tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-stocks-slip-up-to-3-as-uncertainties-loom-around-trump-tariffs/articleshow/119576424.cms",
            "description": "Shares of Aurobindo Pharmaceuticals dropped 2% to a day's low of Rs 1,132.75, while Ipca Laboratories fell 2.7% to Rs 1,403.95. Sun Pharmaceuticals and Dr. Reddy’s Laboratories saw a 1.7% decline each.",
            "pubDate": "2025-03-27T06:26:56.876441"
        },
        {
            "title": "JB Chemicals shares dive 7% after 90 lakh shares change hands in block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jb-chemicals-shares-dive-7-after-90-lakh-shares-change-hands-in-block-deal/articleshow/119573673.cms",
            "description": "JB Chemicals fell 7.4% as 90 lakh shares changed hands in a block deal, with KKR reportedly selling a 5.78% stake. The offer price was Rs 1,625 per share. The stock has declined 14.84% YTD but showed recent recovery.",
            "pubDate": "2025-03-27T06:26:56.876545"
        },
        {
            "title": "Max Financial shares surge over 2% after Rs 399 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/max-financial-shares-surge-over-2-after-rs-399-crore-block-deal/articleshow/119573395.cms",
            "description": "Max Financial Services rose 2.5% after a Rs 399 crore block deal. Max Ventures plans to sell a 1.59% stake for Rs 611.6 crore. The company reported a 62.3% profit drop, while net interest income surged. Technical indicators show neutral momentum.",
            "pubDate": "2025-03-27T06:26:56.876652"
        },
        {
            "title": "Stocks to buy today: Macquarie initiates coverage on Trent with an outperform rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-macquarie-initiates-coverage-on-trent-with-an-outperform-rating/articleshow/119573180.cms",
            "description": "Macquarie has started coverage on Trent with an \"Outperform\" rating, highlighting the company's leadership in the value-to-mid-premium fashion retail sector and its strong financial performance.",
            "pubDate": "2025-03-27T06:26:56.876752"
        },
        {
            "title": "Auto stocks crack up to 7% on Trump tariffs; Tata Motors, Samvardhana Motherson top laggards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-stocks-crack-up-to-7-on-trump-tariffs-tata-motors-samvardhana-motherson-top-laggards/articleshow/119573066.cms",
            "description": "The Nifty Auto index dropped by 1.6%, trading at 21,385, with 14 stocks in the red and just one stock in the green. Bharat Forge, Ashok Leyland, Balkrishna Industries, Eicher Motors, Bajaj Auto, Apollo Tyres, MRF, TVS Motor Company, Mahindra & Mahindra, Maruti Suzuki, and Hero MotoCorp saw declines ranging from 3% to 0.2%. Exide Industries showed a slight increase in early trading.",
            "pubDate": "2025-03-27T06:26:56.876850"
        },
        {
            "title": "Sensex jumps over 400 pts, Nifty above 23,550; PSU banks shine, auto pack bleeds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-250-pts-nifty-above-23500-psu-banks-shine-auto-pack-bleeds/articleshow/119572115.cms",
            "description": "Indian benchmark indices Sensex and Nifty 50 rebounded on Thursday after an early dip caused by concerns over US tariffs on auto imports. The IT sector provided support, while the auto sector lagged due to the new import tariffs. Market volatility is expected due to global trade uncertainties.",
            "pubDate": "2025-03-27T06:26:56.876946"
        },
        {
            "title": "These 3 stocks showing RSI Trending Up on March 26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-3-stocks-showing-rsi-trending-up-on-march-26/slideshow/119572400.cms",
            "description": "On March 26, three stocks from the Nifty200 pack were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-03-27T06:26:56.877051"
        },
        {
            "title": "Stocks to buy today: Trent, Marico among top 10 trading ideas for 27 March 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-trent-marico-among-top-10-trading-ideas-for-27-march-2025/articleshow/119572210.cms",
            "description": "The Indian market is expected to consolidate on Thursday, with the Nifty futures closing down 0.81% on Wednesday. Despite a slight pullback after last week’s rally, experts suggest a range-bound trading between 23,000 to 24,000. Several stock recommendations have been provided by market experts for short-term traders, with a focus on specific F&O and cash market stocks.",
            "pubDate": "2025-03-27T06:26:56.877154"
        },
        {
            "title": "Waaree Renewable shares in focus on securing Rs 232 cr solar EPC contract",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-shares-in-focus-on-securing-rs-232-cr-solar-epc-contract/articleshow/119572058.cms",
            "description": "Waaree RTL confirmed that it has been awarded a contract by Waaree Energies Limited, its promoter group entity. The project involves Engineering, Procurement, and Construction (EPC) work for a Ground Mount Solar Power Project with a total capacity of 170 MW AC / 255 MW DC, including Operation and Maintenance (O&M) on a turnkey basis.",
            "pubDate": "2025-03-27T06:26:56.877253"
        },
        {
            "title": "These 4 stocks dropped below VWAP on March 26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-stocks-dropped-below-vwap-on-march-26/slideshow/119571934.cms",
            "description": "On March 26, the closing prices of four stocks from Nifty500 dropped by more than 1.5% relative to the VWAP (Volume Weighted Average Price), and a shift below the VWAP suggests a potential bearish trend, according to stockedge.com's technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.",
            "pubDate": "2025-03-27T06:26:56.877348"
        },
        {
            "title": "These 3 stocks rose above VWAP on March 26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-3-stocks-rose-above-vwap-on-march-26/slideshow/119571755.cms",
            "description": "On March 26, the closing prices of three stocks in Nifty500 pack rallied about 1% relative to the VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-03-27T06:26:56.877457"
        },
        {
            "title": "Ashok Leyland shares in focus as UK EV unit considers to shutdown plant",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-in-focus-as-uk-ev-unit-considers-to-shutdown-plant/articleshow/119571592.cms",
            "description": "Ashok Leyland shares: The Chennai-based automaker announced on Wednesday that a prolonged economic downturn in the British bus industry, along with a slower-than-anticipated shift to electric vehicles (EVs) in public transport, has hindered growth, leading the company to consider shutting down operations at its Sherburn facility.",
            "pubDate": "2025-03-27T06:26:56.877561"
        },
        {
            "title": "Autos lead Asian market losses after Trump's latest tariffs salvo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/autos-lead-asian-market-losses-after-trumps-latest-tariffs-salvo/articleshow/119571444.cms",
            "description": "Donald Trump's announcement of a 25% tariff on all imported vehicles and parts rattled Asian markets, causing significant drops in major automakers' shares. The tariffs, set to begin on April 3, targeted foreign-made cars and key auto parts, with Japan and Canada expressing regret. Trump's hardline trade policies fuel fears of a global recession.",
            "pubDate": "2025-03-27T06:26:56.877653"
        }
    ]
}