{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-29T16:52:27.404377",
    "items": [
        {
            "title": "India's market boom faces new test: Can regulators protect investor trust amid foreign short-seller attacks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-market-boom-faces-new-test-can-regulators-protect-investor-trust-amid-foreign-short-seller-attacks/articleshow/124892046.cms",
            "description": "India's stock market is undergoing a significant transformation, democratizing access for millions of new investors. While this fuels capital formation, it also exposes them to unprecedented vulnerabilities like deep fakes and foreign short-seller attacks. Regulators and courts are stepping up to protect domestic investors, but the market's resilience hinges on adapting to rapid information flow and manipulation.",
            "pubDate": "2025-10-29T06:58:40.693528"
        },
        {
            "title": "Blue Dart Express shares rally 13%. What’s driving the frenzy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blue-dart-express-shares-rally-13-whats-driving-the-frenzy/articleshow/124891923.cms",
            "description": "Blue Dart Express shares jumped 13% to Rs 6,249 after the logistics major reported a 29.5% YoY rise in Q2 net profit to Rs 81 crore, driven by higher shipment volumes and improved efficiency. Revenue rose 7% to Rs 1,549.3 crore, while EBITDA grew 15.6%, with margins expanding to 16.3% from 15.1% last year.",
            "pubDate": "2025-10-29T06:58:40.693658"
        },
        {
            "title": "Bessent pushes Japan to tighten policy, curb Yen volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bessent-pushes-japan-to-tighten-policy-curb-yen-volatility/slideshow/124889502.cms",
            "description": "U.S. Treasury Secretary Scott Bessent has called on Japan’s government to give the Bank of Japan (BOJ) room to raise interest rates, warning against policies that keep the yen excessively weak through prolonged low borrowing costs. His remarks signal growing U.S. concern over Japan’s monetary stance and its global currency implications. (Source: Reuters)",
            "pubDate": "2025-10-29T06:58:40.693768"
        },
        {
            "title": "JSW Steel shares rise 3%, up 7% in 4 sessions. What’s behind the renewed buying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-steel-shares-rise-3-up-7-in-4-sessions-whats-behind-the-renewed-buying/articleshow/124891706.cms",
            "description": "Shares of JSW Steel rose over 3% to Rs 1,224 after the company reported a 307% YoY surge in Q2 profit to Rs 1,646 crore, driven by higher volumes and lower input costs. Adjusted EBITDA jumped 39% YoY, while exports nearly doubled. Despite strong operational performance, InCred maintained a Reduce rating, citing stretched valuations and leverage concerns.",
            "pubDate": "2025-10-29T06:58:40.693876"
        },
        {
            "title": "Suzlon Energy shares rise over 4% as new CFO appointment cheers investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-shares-rise-over-4-as-new-cfo-appointment-cheers-investors/articleshow/124891183.cms",
            "description": "Suzlon Energy shares jumped 4.5% after appointing Rahul Jain as CFO from December 15 2025. His two-decade finance experience is expected to strengthen the company’s leadership and strategic growth.",
            "pubDate": "2025-10-29T06:58:40.693984"
        },
        {
            "title": "More tailwinds than headwinds: 4 tyre stocks and 1 stock from its supply chain, with upside potential from 7 to 65% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/more-tailwinds-than-headwinds-4-tyre-stocks-and-1-stock-from-its-supply-chain-with-upside-potential-from-7-to-65-in-1-year/articleshow/124890752.cms",
            "description": "Auto companies had, or probably are still having, the best of festive seasons. Now, what is an auto company? It is the producer of a product that is a collection of components brought together by efficient supply chain management. And part of that supply chain are tyre companies. But tyre companies themselves have a supply chain that provides them with a key component that is as crucial to their product as natural rubber.",
            "pubDate": "2025-10-29T06:58:40.694083"
        },
        {
            "title": "Indian Oil shares rally 4% to record high. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-oil-shares-rally-4-to-record-high-what-should-investors-do/articleshow/124890048.cms",
            "description": "Indian Oil Corp shares hit a 52-week high after strong Q2 results driven by robust refining margins and revenue growth. Brokerages remain divided, citing steady outlook but caution over debt.",
            "pubDate": "2025-10-29T06:58:40.694181"
        },
        {
            "title": "Fed meeting outcome today: What to expect & 5 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-meeting-outcome-today-what-to-expect-5-things-to-watch-out-for/articleshow/124890144.cms",
            "description": "The US Federal Reserve concludes its policy meeting today. Markets widely expect a 25 basis point rate cut. This move aims to support the economy amid a cooling labor market. Investors will watch for clues on future rate cuts and the Fed's economic outlook. The Fed Chair's comments will shape expectations for the coming year.",
            "pubDate": "2025-10-29T06:58:40.694275"
        },
        {
            "title": "CAMS shares fall 7% as Q2 profit dips 6% YoY despite record revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cams-shares-fall-7-as-q2-profit-dips-6-yoy-despite-record-revenue/articleshow/124890079.cms",
            "description": "Shares of CAMS fell up to 6.6% to Rs 3,718.40 on the BSE after the company reported a 5.7% YoY drop in Q2 FY26 PAT to Rs 113.94 crore. However, revenue hit a record Rs 376.74 crore, up 3.2% YoY and 6.4% QoQ, supported by robust growth in both mutual fund and non-mutual fund businesses.",
            "pubDate": "2025-10-29T06:58:40.694389"
        },
        {
            "title": "DCM Shriram shares rally 8% as Q2 net profit jumps 153% to Rs 159 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dcm-shriram-shares-rally-8-as-q2-net-profit-jumps-153-to-rs-159-crore/articleshow/124889896.cms",
            "description": "Shares of DCM Shriram surged 8% to Rs 1,409 after the company reported a 153% YoY rise in net profit to Rs 159 crore for Q2FY26. Revenue grew 11% to Rs 3,272 crore, driven by strong performance in the chemicals, vinyl, and agri segments, prompting an interim dividend of 180%.",
            "pubDate": "2025-10-29T06:58:40.694490"
        },
        {
            "title": "Tata Steel shares gain 3%, hit 52-week high. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-gain-3-hit-52-week-high-what-should-investors-do/articleshow/124889866.cms",
            "description": "Tata Steel shares hit a 52-week high of Rs 187, rising 3% on Wednesday and extending their rally for a sixth straight session. The uptrend follows bullish calls from brokerages, including Motilal Oswal, which upgraded the stock to Buy with a target of Rs 210, citing improving realizations, operating efficiencies, and strong domestic demand.",
            "pubDate": "2025-10-29T06:58:40.694587"
        },
        {
            "title": "Growth bets: Brokerages see 5 stocks offering up to 41% upside after strong Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/growth-bets-brokerages-see-5-stocks-offering-up-to-41-upside-after-strong-q2-results/slideshow/124888989.cms",
            "description": "Brokerages have turned selectively positive across analytics, banking, insurance, energy, and industrial names after these companies reported healthy Q2 earnings, highlighting a mix of improving growth visibility and margin discipline.",
            "pubDate": "2025-10-29T06:58:40.694680"
        },
        {
            "title": "HDFC AMC, other AMC & capital market stocks crack up to 10% on Sebi’s MF fee revamp plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-other-amc-capital-market-stocks-crack-up-to-10-on-sebis-mf-fee-revamp-plan/articleshow/124888867.cms",
            "description": "Shares of major AMCs and capital market firms slumped up to 10% on Wednesday after SEBI proposed a major revamp of mutual fund fee structures. HDFC AMC fell 6.4%, Nippon Life India AMC 7%, and Nuvama Wealth 9%, as investors reacted to potential cuts in expense ratios and brokerage commissions under the new proposal.",
            "pubDate": "2025-10-29T06:58:40.694775"
        },
        {
            "title": "Sunil Singhania’s Rs 2,700 crore-portfolio gets new look; adds 6 new stocks in Q2. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sunil-singhanias-rs-2700-crore-portfolio-gets-new-look-adds-6-new-stocks-in-q2-do-you-own-any/articleshow/124888775.cms",
            "description": "Ace investor Sunil Singhania's Abakkus Asset Management has reshuffled its Rs 2,700 crore portfolio, adding six new stocks including All Time Plastics and Suven Life Sciences. The fund also reduced holdings in Sarda Energy & Minerals, Ion Exchange, and Rupa & Company during the September quarter.",
            "pubDate": "2025-10-29T06:58:40.694871"
        },
        {
            "title": "Nvidia–Nokia partnership marks new phase in global tech collaboration",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nvidianokia-partnership-marks-new-phase-in-global-tech-collaboration/slideshow/124889180.cms",
            "description": "Nvidia will invest $1 billion to acquire a 2.9% stake in Nokia, marking a strategic collaboration aimed at advancing artificial intelligence and data centre technologies. The partnership signals a major step toward building AI-driven telecom infrastructure and next-generation 6G networks. (Source: Reuters)",
            "pubDate": "2025-10-29T06:58:40.694967"
        },
        {
            "title": "Dolly Khanna reshuffles Rs 500 crore portfolio, adds to 5 smallcap bets. Here’s what her Q2 trades reveal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dolly-khanna-reshuffles-rs-500-crore-portfolio-adds-to-5-smallcap-bets-heres-what-her-q2-trades-reveal/articleshow/124888499.cms",
            "description": "Veteran investor Dolly Khanna has reshuffled her Rs 500 crore portfolio, adding to five small-cap stocks including Mangalore Chemicals and Coffee Day Enterprises. Her trades signal selective optimism in India's industrial and fertilizer sectors, with a contrarian bet on Coffee Day's revival potential.",
            "pubDate": "2025-10-29T06:58:40.695061"
        },
        {
            "title": "Jefferies warns Sebi’s mutual fund fee cuts could shave up to 10% off AMC profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-warns-sebis-mutual-fund-fee-cuts-could-shave-up-to-10-off-amc-profits/articleshow/124894818.cms",
            "description": "Jefferies warned that Sebi’s proposed mutual fund fee revamp could trim AMC profits by up to 10% from FY27. The brokerage said cuts to exit load charges, brokerage fees, and total expense ratios may pressure earnings at top players like HDFC AMC and Nippon Life AMC.",
            "pubDate": "2025-10-29T08:50:31.169807"
        },
        {
            "title": "Govt of Singapore’s India portfolio: 12 stocks rally up to 60% in 2025 so far. Do you hold any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/govt-of-singapores-india-portfolio-12-stocks-rally-up-to-60-in-2025-so-far-do-you-hold-any/slideshow/124894533.cms",
            "description": "The Government of Singapore (GoS) holds stakes in 57 BSE-listed Indian companies, with a total portfolio value of about Rs 2,00,185 crore as of October 29, 2025. In CY25, 12 of these stocks have rallied over 25%, while others such as Varun Beverages, Triveni Turbine, Kalyan Jewellers India, International Gemmological Institute (India), and PG Electroplast, have slipped 25–42%, underscoring a mixed performance trend. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-10-29T08:50:31.169947"
        },
        {
            "title": "MCX issues post-incident statement after trading gateway disruption, operations now normal after shift to DR site",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-issues-post-incident-statement-after-trading-gateway-disruption-operations-now-normal-after-shift-to-dr-site/articleshow/124893937.cms",
            "description": "MCX on Wednesday issued a post-incident statement confirming normal trading operations after a disruption caused by a trading gateway issue in the previous session. The exchange said it has implemented corrective measures, is reviewing its systems for stronger resilience, and will inform participants before shifting back from the DR site.",
            "pubDate": "2025-10-29T08:50:31.170068"
        },
        {
            "title": "SBI Mutual Fund invests Rs 100 crore in Lenskart in pre IPO-round",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-mutual-fund-invests-rs-100-crore-in-lenskart-in-pre-ipo-round/articleshow/124892253.cms",
            "description": "SBI Mutual Fund has invested Rs 100 crore in Lenskart. This investment comes before the eyewear retailer's upcoming Initial Public Offering. Lenskart's IPO is scheduled to open on October 31, 2025. The company plans to use the funds for expansion and to strengthen its technology. Existing investors are also participating in pre-IPO transactions.",
            "pubDate": "2025-10-29T08:50:31.170179"
        },
        {
            "title": "Newgen Software shares rally 16% in 2 days as Q2 PAT jumps 16% YoY; ICICI Sec upgrades stock to ‘Hold’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/newgen-software-shares-rally-16-in-2-days-as-q2-pat-jumps-16-yoy-icici-sec-upgrades-stock-to-hold/articleshow/124892189.cms",
            "description": "Newgen Software shares jumped 16% in two sessions to ₹896.35 after reporting a 16% YoY rise in Q2 profit to ₹82 crore and an 11% revenue growth to ₹401 crore. ICICI Securities upgraded the stock to ‘Hold’, citing improved margins and steady performance.",
            "pubDate": "2025-10-29T08:50:31.170290"
        },
        {
            "title": "Chennai Petroleum Corporation among 5 stocks that rose above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chennai-petroleum-corporation-among-5-stocks-that-rose-above-vwap/slideshow/124892179.cms",
            "description": "On October 28, the closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to Stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors, potentially indicating positive sentiment in the market.",
            "pubDate": "2025-10-29T08:50:31.170396"
        },
        {
            "title": "SAIL shares surge 8% to record high ahead of Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sail-shares-surge-8-to-record-high-ahead-of-q2-results-should-you-buy-sell-or-hold/articleshow/124895723.cms",
            "description": "Shares of SAIL surged 8.2% to a 52-week high of Rs 143.20 ahead of its Q2FY26 results, buoyed by optimism in metal stocks. Analysts highlighted strong technical indicators and bullish momentum, with traders eyeing targets of Rs 145–150. The stock has gained 24% in 2025 and 317% over five years.",
            "pubDate": "2025-10-29T10:13:01.859002"
        },
        {
            "title": "Adani Group stocks explode, adding Rs 48,550 crore in a single day. What’s powering the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-explode-adding-rs-48550-crore-in-a-single-day-whats-powering-the-rally/articleshow/124892629.cms",
            "description": "Adani Group stocks surged on Wednesday, adding ₹48,550 crore in market value as strong Q2 earnings from Adani Green Energy and Adani Total Gas fueled broad gains across the conglomerate. Adani Green’s shares jumped 14%, boosting its market cap by ₹14,464 crore after posting a 111% YoY profit surge to ₹583 crore, driven by new capacity additions in Gujarat and Rajasthan.",
            "pubDate": "2025-10-29T10:13:01.859411"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/124909089.cms",
            "description": "Can we at this point say that valuations are fairly priced in the mid-cap segment? The answer is no. Does it mean that you should avoid the segment altogether? The answer is again no. Over the next few quarters, stock price trends and the absolute value of stock prices will be impacted by the fundamentals of the sector as well as valuations. The fundamentals are currently improving for some industries thanks to the GST rate rationalisation. And in others, the cyclical slowdown is getting over.",
            "pubDate": "2025-10-29T16:52:12.092342"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/124908737.cms",
            "description": "The Indian market ended higher on Wednesday, with the Sensex and Nifty closing less than 1% shy of record highs, as investors positioned for an expected U.S. Federal Reserve rate cut and optimism over a potential U.S.-China trade truce buoyed sentiment.",
            "pubDate": "2025-10-29T16:52:12.092632"
        },
        {
            "title": "Laurus Labs, Indian Bank among 8 stocks to hit 52-week highs & gain up to 19% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/laurus-labs-indian-bank-among-8-stocks-to-hit-52-week-highs-amp-gain-up-to-19-in-a-month/slideshow/124900987.cms",
            "description": "On Wednesday, the benchmark Sensex advanced by about 369 points, closing at 84,997. During the session, eight stocks from the BSE Midcap Index touched their 52-week highs, marking their strongest levels in a year. Such breakouts are typically viewed by traders and investors as bullish indicators, signaling strong upward momentum and the possibility of further appreciation.",
            "pubDate": "2025-10-29T16:52:12.092742"
        },
        {
            "title": "Goldman Sachs, Morgan Stanley buy Aditya Birla Capital stake in Rs 819 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-morgan-stanley-buy-aditya-birla-capital-stake-in-rs-819-crore-block-deal/articleshow/124906522.cms",
            "description": "Aditya Birla Capital witnessed an ₹819 crore block deal as Advent International’s Jomei Investments sold 2.66 crore shares. Global and domestic institutions, including Goldman Sachs, Morgan Stanley, HDFC Life, and Norges Bank, emerged as key buyers, signalling strong investor confidence.",
            "pubDate": "2025-10-29T16:52:12.092846"
        },
        {
            "title": "ET Prime Special Series: Multibagger or IBC - Part 30:  One foot in cars, another in appliances. Will it work for this auto ancillary firm?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-prime-special-series-multibagger-or-ibc-part-30-one-foot-in-cars-another-in-appliances-will-it-work-for-this-auto-ancillary-firm/articleshow/124905252.cms",
            "description": "Every industry has its silent contributors, firms that power larger systems without seeking the spotlight. This company belongs to that category. Its products rarely carry brand labels, yet they move the mechanisms behind everyday machines. Success is measured not by consumer recall, but by trust within the value chain. Born in the early 1990s during India’s industrial opening, this auto ancillary has quietly navigated three decades of change from foreign collaborations to local capability, from mechanical parts to precision systems. Over time, it moved beyond a single line of business, building parallel verticals to balance cyclicality in the automotive trade. This series on auto ancillary companies works with the assumption that, from the whole set of auto ancillary companies, some multibagger stocks will emerge. And some companies in this space risk going bankrupt.",
            "pubDate": "2025-10-29T16:52:12.092947"
        },
        {
            "title": "Two Trades for Today: An energy major for a 6.3% gain, a mid-cap consumer goods stock for close to 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-energy-major-for-a-6-3-gain-a-mid-cap-consumer-goods-stock-for-close-to-7-rise/articleshow/124904469.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-29T16:52:12.093053"
        },
        {
            "title": "US stocks trade at record levels; Fed rate decision in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-at-near-record-levels-fed-rate-decision-in-focus/articleshow/124903790.cms",
            "description": "Stock markets hit record highs Wednesday thanks to optimism over US trade deals, the AI sector and an expected interest-rate cut by the US Federal Reserve.",
            "pubDate": "2025-10-29T16:52:12.093153"
        },
        {
            "title": "Chipmaker Nvidia becomes world's first $5 trillion company",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chipmaker-nvidia-becomes-worlds-first-5-trillion-company/articleshow/124903501.cms",
            "description": "Nvidia has become the first company to reach a $5 trillion valuation, driven by the booming artificial intelligence sector. This milestone highlights the significant technological shift, though concerns about an AI bubble persist. The chipmaker's rapid stock growth is fueled by immense demand for its products, with recent disclosures of substantial chip orders and strategic partnerships underscoring its dominant position.",
            "pubDate": "2025-10-29T16:52:12.093252"
        },
        {
            "title": "Solex Energy targets Rs 500 crore QIP: Chairman",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/solex-energy-targets-rs-500-crore-qip-chairman/articleshow/124901605.cms",
            "description": "Solex Energy plans to raise ₹500 crore via QIP and ₹1,000 crore in debt to fund a ₹1,400 crore expansion, including a 2.2 GW solar cell plant and 2.5 GW module capacity addition, aiming for 10 GW by 2030.",
            "pubDate": "2025-10-29T16:52:12.093353"
        },
        {
            "title": "Stock Radar: Godawari Power witnesses profit taking after hitting record high in September; should you buy the dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-godawari-power-witnesses-profit-taking-after-hitting-record-high-in-september-should-you-buy-the-dip/articleshow/124896828.cms",
            "description": "Godawari Power & Ispat Ltd experienced profit-taking after reaching a record high in September but is now showing signs of renewed momentum. Experts suggest buying on dips for a potential target of Rs 295 in the coming weeks, citing strong technical indicators and a breakout from a consolidation phase.",
            "pubDate": "2025-10-29T16:52:12.093449"
        },
        {
            "title": "Decision Day Guide: Fed set to cut rates, but unlikely to give added signal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/decision-day-guide-fed-set-to-cut-rates-but-unlikely-to-give-added-signal/articleshow/124898754.cms",
            "description": "The Federal Reserve is expected to cut interest rates by 25 basis points this week amid internal divisions over inflation and growth risks. Chair Jerome Powell is likely to remain cautious in his remarks, offering little guidance on future policy amid uncertain data and rising debate over ending quantitative tightening.",
            "pubDate": "2025-10-29T16:52:12.093568"
        },
        {
            "title": "Robert Kiyosaki says emotional IQ, not brains, makes people rich. Predicts Bitcoin hitting $200K this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/robert-kiyosaki-says-emotional-iq-not-brains-makes-people-rich-predicts-bitcoin-hitting-200k-this-year/articleshow/124897301.cms",
            "description": "Robert Kiyosaki reaffirmed his bullish stance on Bitcoin, predicting it could hit $200,000 this year. He attributed wealth differences to emotional intelligence, arguing fear keeps people poor and EQ outweighs IQ.",
            "pubDate": "2025-10-29T16:52:12.093663"
        },
        {
            "title": "Market Wrap: Sensex settles 369 pts higher, Nifty tops 26,000 as Fed rate cut hopes, US-China deal lift mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-settles-369-pts-higher-nifty-tops-26000-as-fed-rate-cut-hopes-us-china-deal-lift-mood/articleshow/124897227.cms",
            "description": "Indian equities neared record highs on Wednesday, driven by anticipation of a U.S. Federal Reserve rate cut and optimism surrounding a potential U.S.-China trade truce. The Sensex and Nifty saw gains, with metals, oil and gas, and energy sectors leading the advance. Investors are now awaiting the Fed's policy outcome and U.S. tech earnings.",
            "pubDate": "2025-10-29T16:52:12.093757"
        },
        {
            "title": "Fed meeting outcome today: What to expect & 5 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-meeting-outcome-today-what-to-expect-5-things-to-watch-out-for/articleshow/124897136.cms",
            "description": "The US Federal Reserve concludes its policy meeting today. Markets widely expect a 25 basis point rate cut. This move aims to support the economy amid a cooling labor market. Investors will watch for clues on future rate cuts and the Fed's economic outlook. The Fed Chair's comments will shape expectations for the coming year.",
            "pubDate": "2025-10-29T16:52:12.093850"
        }
    ]
}