{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-17T14:32:31.745762",
    "items": [
        {
            "title": "Wall Street ends lower as investors turn cautious ahead of Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-as-investors-turn-cautious-ahead-of-fed-rate-decision/articleshow/123933246.cms",
            "description": "Wall Street witnessed a decline in its main stock indexes on Tuesday. This happened amid anticipation of a possible interest rate cut by the Federal Reserve. Investors are expecting a 25 basis-point cut. Retail sales data showed an increase in August. Webtoon Entertainment saw a surge after a deal with Disney.",
            "pubDate": "2025-09-17T02:16:39.365285"
        },
        {
            "title": "Religare Broking: Aurobindo Pharma poised for next leg of rally after consolidation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/religare-broking-aurobindo-pharma-poised-for-next-leg-of-rally-after-consolidation/videoshow/123920768.cms",
            "description": "“We are seeing a mixed trend within the pharma space, and Auropharma is currently sitting on the sidelines while hovering in a consolidation base. Traders can buy for a target of Rs 1300 in the next 1-2 months,” Ajit Mishra – SVP, Research, Religare Broking Ltd, said.",
            "pubDate": "2025-09-17T02:16:39.365417"
        },
        {
            "title": "Asian stocks slip as investors await Fed decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-slip-as-investors-await-fed-decision/articleshow/123933029.cms",
            "description": "Asian stock markets saw a slight dip as investors are cautious. Everyone is waiting for the United States Federal Reserve's interest-rate decision. Shares in Japan and South Korea decreased. Gold prices are holding steady. Attention is also on a Japanese government bond auction. Investors are keen to understand the future direction of interest rates.",
            "pubDate": "2025-09-17T02:16:39.365627"
        },
        {
            "title": "Stocks in news: Apollo Tyres, Akzo Nobel, Dr Reddy's, Mahindra Lifespace, Coal India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-apollo-tyres-akzo-nobel-dr-reddys-mahindra-lifespace-coal-india/articleshow/123933003.cms",
            "description": "Indian markets saw gains, with Apollo Tyres becoming the Indian cricket team's jersey sponsor. JSW Paints will acquire a stake in Akzo Nobel India, while Dr. Reddy's launched a new molecule for gastrointestinal issues. Mahindra Lifespace is set to redevelop housing societies, and Coal India has been named the preferred bidder for a rare earth element exploration block.",
            "pubDate": "2025-09-17T02:16:39.365728"
        },
        {
            "title": "Hexaware Tech rises on likely US rate cut, weak rupee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hexaware-tech-rises-on-likely-us-rate-cut-weak-rupee/articleshow/123932909.cms",
            "description": "Hexaware Technologies' stock has recently seen gains, driven by a weaker rupee and anticipated US interest rate cuts potentially boosting IT spending. Despite a modest revenue growth in the June quarter due to client spending reductions, the company is improving profitability through increased offshore revenue and employee utilization.",
            "pubDate": "2025-09-17T02:16:39.365827"
        },
        {
            "title": "GIFT Nifty up 55 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123926132.cms",
            "description": "Indian equity markets saw gains on Tuesday. Investors are optimistic before the US Federal Reserve decision. Analysts foresee a gradual market rise. Trade developments and the Fed rate cut are key. Immediate support is at 25,050. India VIX fell. FIIs were net buyers. The Rupee strengthened against the US dollar. FIIs reduced their net short positions in the futures market.",
            "pubDate": "2025-09-17T02:16:39.365930"
        },
        {
            "title": "ESAF SFB plans Rs 300-500 crore capital infusion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/esaf-sfb-plans-rs-300-500-crore-capital-infusion/articleshow/123932894.cms",
            "description": "ESAF Small Finance Bank is set to raise ₹300-500 crore in tier-1 capital, anticipating a business turnaround from the third quarter. The bank aims to bolster its capital adequacy ratio and fund expansion plans. A board meeting is scheduled for September 20 to finalize the fundraising details, including the instrument and modalities.",
            "pubDate": "2025-09-17T02:16:39.366062"
        },
        {
            "title": "Is the rally in small-cap solvent extraction stocks sustainable?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-rally-in-small-cap-solvent-extraction-stocks-sustainable/articleshow/123932839.cms",
            "description": "Small-cap solvent extraction companies have seen significant gains due to high edible oil demand, ethanol blending, and supportive policies. However, analysts now advise caution, noting that valuations may be exceeding fundamentals. Risks like raw material price volatility and supply challenges could lead to corrections, suggesting investors consider booking profits or waiting for better entry points.",
            "pubDate": "2025-09-17T02:16:39.366158"
        },
        {
            "title": "India Inc turns to non-bank routes for nearly half of FY25 funding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-turns-to-non-bank-routes-for-nearly-half-of-fy25-funding/articleshow/123932789.cms",
            "description": "Corporate India is increasingly diversifying its funding sources, with nearly half of the resources raised in FY25 coming from non-banking channels like equity markets and NBFC loans. While the total financial resources to the corporate sector saw a modest increase, bank credit demand declined, influenced by strong equity market performance and cautious lending.",
            "pubDate": "2025-09-17T02:16:39.368168"
        },
        {
            "title": "India's VIX slips to lifetime lows, traders see limited near-term risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-vix-slips-to-lifetime-lows-traders-see-limited-near-term-risks/articleshow/123932747.cms",
            "description": "India's VIX index has plummeted to record lows, indicating reduced market volatility and increased investor confidence ahead of the US Federal Reserve's policy meeting. While this suggests a period of market stability, analysts caution against potential complacency, as low VIX readings can mask underlying risks and unexpected market corrections. Institutional investors are positioning for limited near-term movement.",
            "pubDate": "2025-09-17T02:16:39.368270"
        },
        {
            "title": "Adani to invest Rs 30,000 crore more in ports business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-to-invest-rs-30000-crore-more-in-ports-business/articleshow/123932871.cms",
            "description": "Adani Ports plans a ₹30,000 crore expansion over two years, primarily targeting Mundra, Dhamra, and Vizhinjam ports to achieve a one billion tonne cargo handling target by 2030. The investment spans ports, logistics, renewables, and marine services, with a focus on berth and terminal expansion.",
            "pubDate": "2025-09-17T02:16:39.368461"
        },
        {
            "title": "Redington among 7 stocks that closed above VWAP on Sept 16",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-among-7-stocks-that-closed-above-vwap-on-sept-16/slideshow/123934660.cms",
            "description": "On September 16, the closing prices of seven Nifty500 stocks ended more than 1% above their VWAP (Volume Weighted Average Price), indicating a potential bullish trend, according to technical scan data from stockedge.com.A close above VWAP means the stock ended the day higher than its average volume-weighted trading price, often interpreted by traders as a bullish signal reflecting positive market sentiment.",
            "pubDate": "2025-09-17T03:55:16.706075"
        },
        {
            "title": "Blue Dart Express shares in focus after Rs 420 crore GST demand notice to subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blue-dart-express-shares-in-focus-after-rs-420-crore-gst-demand-notice-to-subsidiary/articleshow/123934548.cms",
            "description": "Blue Dart share price: Blue Dart Express’ subsidiary, Blue Dart Aviation, received a GST demand notice of around Rs 420 crore for alleged misclassification of taxes and ineligible Input Tax Credit for FY21-22 and FY22-23. The company has been asked to respond within 30 days",
            "pubDate": "2025-09-17T03:55:16.706208"
        },
        {
            "title": "BEL shares in focus after bagging fresh orders worth Rs 712 crore in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-after-bagging-fresh-orders-worth-rs-712-crore-in-september/articleshow/123934497.cms",
            "description": "Bharat Electronics Limited (BEL) has secured fresh orders worth Rs 712 crore since September 1, 2025, spanning IT infrastructure, cybersecurity, ESM systems, blockchain solutions, and communication equipment. The Navratna PSU said the inflow adds to its robust project pipeline. BEL shares have surged over 38% in the past year, closing at Rs 402.80 on Tuesday.",
            "pubDate": "2025-09-17T03:55:16.706317"
        },
        {
            "title": "Suzlon Energy, NCC and 5 other F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-ncc-and-5-other-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123934452.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack as of September 16, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-17T03:55:16.706423"
        },
        {
            "title": "Akzo Nobel shares in focus after CCI clears JSW Paints’ 75% stake acquisition proposal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/akzo-nobel-shares-in-focus-after-cci-clears-jsw-paints-75-stake-acquisition-proposal/articleshow/123934328.cms",
            "description": "Akzo Nobel I share price: The Competition Commission of India has approved JSW Paints’ Rs 12,915 crore deal to acquire up to 75% stake in Akzo Nobel India, maker of Dulux paints. The acquisition will position JSW Paints as the fourth-largest player in India’s decorative paints market.",
            "pubDate": "2025-09-17T03:55:16.706527"
        },
        {
            "title": "Coal India shares rise 2% after emerging as preferred bidder for REE block in Andhra Pradesh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-shares-in-focus-after-emerging-as-preferred-bidder-for-ree-block-in-andhra-pradesh/articleshow/123934120.cms",
            "description": "Coal India share price: Coal India was declared the preferred bidder for the Ontillu-Chandragiri Rare Earth Element (REE) Exploration Block by the Ministry of Mines. The move marks the PSU's strategic entry into rare earth exploration, crucial for electronics, defence, and renewable energy sectors.",
            "pubDate": "2025-09-17T03:55:16.706629"
        },
        {
            "title": "Kotak Mahindra Bank, NTPC among 5 stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-ntpc-among-5-stocks-showing-rsi-trending-up/slideshow/123934074.cms",
            "description": "Five stocks from the Nifty50 were highlighted in the RSI Trending Up scan on September 16, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-17T03:55:16.706733"
        },
        {
            "title": "Amber Enterprises, Maruti Suzuki among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amber-enterprises-maruti-suzuki-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/123933947.cms",
            "description": "In the Nifty500 segment, six stocks witnessed a 5-year swing high at the close on September 16, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-17T03:55:16.706859"
        },
        {
            "title": "Hindustan Copper, Shakti Pumps among 40 dividend plays approach record date tomorrow. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shakti-pumps-among-40-dividend-plays-approach-record-date-tomorrow-last-day-to-buy/articleshow/123933838.cms",
            "description": "Investors eyeing dividend payouts should act today, September 17th, to buy shares of Hindustan Copper, SJVN, and Shakti Pumps (India). These companies have set September 18, 2025, as the record date for dividend eligibility.",
            "pubDate": "2025-09-17T03:55:16.706959"
        },
        {
            "title": "Last day to buy shares of Kesar Enterprises, Zydus Wellness ahead of stock split record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-kesar-enterprises-zydus-wellness-ahead-of-stock-split-record-date/articleshow/123933789.cms",
            "description": "Attention investors, today is the last day to buy shares of Kesar Enterprises and Zydus Wellness to qualify for their stock splits. The record date is September 18, 2025. Kesar Enterprises will split its shares from Rupees 10 to Rupees 1. Zydus Wellness will split its shares from Rupees 10 to Rupees 2.",
            "pubDate": "2025-09-17T03:55:16.707058"
        },
        {
            "title": "Stocks to buy in 2025 for long term: ICICI Bank, SBI among 5 stocks that could give 18-38% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-icici-bank-sbi-among-5-stocks-that-could-give-18-38-return/slideshow/123933656.cms",
            "description": "Brokerages remain optimistic on select frontline banks, metals, and real estate stocks, rolling out fresh Buy calls with meaningful upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-17T03:55:16.707152"
        },
        {
            "title": "Galaxy Medicare IPO: Subdued GMP, moderate subscription ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/galaxy-medicare-ipo-subdued-gmp-moderate-subscription-ahead-of-listing/articleshow/123933493.cms",
            "description": "Bhubaneswar-based Galaxy Medicare, a medical device manufacturer, is set to debut on the NSE SME platform on September 17, following its Rs 22 crore IPO. Subscribed 1.83 times overall, the IPO saw strong retail participation. Galaxy Medicare, known for its wide range of medical products, reported revenues of Rs 40.27 crore in FY25.",
            "pubDate": "2025-09-17T03:55:16.707246"
        },
        {
            "title": "Jay Ambe Supermarkets IPO listing today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jay-ambe-supermarkets-ipo-listing-today-heres-what-gmp-indicates/articleshow/123933475.cms",
            "description": "Gujarat-based Jay Ambe Supermarkets is debuting in the market today after a successful IPO, oversubscribed 64.13 times. Retail interest was particularly strong. Despite a modest GMP, a listing around Rs 85–86 is anticipated. Founded in 2020, the company operates 17 stores under the “City Square Mart” brand. IPO funds will fuel expansion, including purchasing a store and funding new locations.",
            "pubDate": "2025-09-17T03:55:16.707339"
        },
        {
            "title": "Positive Breakout: These 7 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-7-stocks-close-cross-above-their-200-dmas/slideshow/123933463.cms",
            "description": "The closing prices of 16 stocks from the Nifty500 pack crossed above their 200 DMA (Daily Moving Averages) on September 16. Among these, we have highlighted the top 7 that recorded gains exceeding 1.5%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-17T03:55:16.707440"
        },
        {
            "title": "Urban Company shares zoom over 8% after robust listing gains. What should investors do now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-zoom-over-8-after-robust-listing-gains-what-should-investors-do-now/articleshow/123935378.cms",
            "description": "Urban Company had a strong stock market debut. Shares listed at a premium and continued to rise. The IPO was oversubscribed, showing investor confidence. The company offers various home services and plans to expand. Revenue increased significantly in FY25. Experts advise caution due to high valuations. Some suggest booking partial profits and holding the rest.",
            "pubDate": "2025-09-17T05:01:02.748725"
        },
        {
            "title": "​Implications of semi-annual reporting for US capital markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/implications-of-semi-annual-reporting-for-us-capital-markets/slideshow/123935638.cms",
            "description": "Donald Trump has called for U.S. companies to move away from quarterly reporting and adopt six-monthly updates instead. This proposal has received cautious support from international investors, who see an opportunity to encourage businesses to focus more on long-term sustainability issues. (Source: Reuters)",
            "pubDate": "2025-09-17T05:01:02.748853"
        },
        {
            "title": "Shringar House of Mangalsutra shares list at 14% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shringar-house-of-mangalsutra-shares-list-at-14-premium-over-ipo-price/articleshow/123935369.cms",
            "description": "Shringar House of Mangalsutra made a strong debut on the stock exchanges. Shares listed at a premium after its IPO. The IPO saw huge investor demand. It was subscribed over 60 times. The company is a leading Mangalsutra designer and manufacturer. It serves big clients like Titan and Reliance Retail. Shringar House has a wide range of products.",
            "pubDate": "2025-09-17T05:01:02.748958"
        },
        {
            "title": "Dev Accelerator shares list flat at IPO price of Rs 61 on NSE, BSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dev-accelerator-shares-list-flat-at-ipo-price-of-rs-61-on-bse-nse/articleshow/123935122.cms",
            "description": "Dev Accelerator, a flex space operator, had a muted market debut with shares listing around the IPO price of Rs 61. Despite healthy investor interest and strong revenue growth, concerns remain about profitability and client concentration. The company aims to capitalize on the expanding flex workspace market in India, but faces execution and leverage risks as it expands.",
            "pubDate": "2025-09-17T05:01:02.749075"
        },
        {
            "title": "Urban Company shares make a stellar debut, list at 58% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-make-a-stellar-debut-list-at-58-premium-over-ipo-price/articleshow/123934833.cms",
            "description": "Urban Company share price: Urban Company's IPO made a strong debut, listing at a significant premium due to high demand from institutional and retail investors. The company plans to use the IPO proceeds to enhance technology, expand services, and grow geographically. Analysts suggest holding the stock for long-term gains, citing Urban Company's strong market position and growth potential in the tech-enabled home services sector.",
            "pubDate": "2025-09-17T05:01:02.749179"
        },
        {
            "title": "US Fed set to cut rates by 25 bps today, Nifty bulls await FII U-turn",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-set-to-cut-rates-by-25-bps-today-nifty-bulls-await-fii-u-turn/articleshow/123935102.cms",
            "description": "The US Federal Reserve is expected to cut rates. Markets anticipate this move. Investors are watching for clues about the US central bank's approach to a slowing labor market and inflation. Foreign institutional investor flows in India may depend on the policy signal from Washington. Nifty 50 closed positively.",
            "pubDate": "2025-09-17T05:01:02.749276"
        },
        {
            "title": "HCL Technologies shares in focus after India launch of AI-first MarTech platform Unica+",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-technologies-shares-in-focus-after-india-launch-of-ai-first-martech-platform-unica/articleshow/123934974.cms",
            "description": "HCL Technologies’ software arm has launched HCL Unica+ in India, an AI-first MarTech platform designed for the Intelligence Economy. Aimed at tackling the challenges of India’s diverse, multi-lingual market, the platform enables brands to engage with over 800 million internet users. It focuses on delivering hyper-personalized interactions to build trust in an attention-scarce digital landscape.",
            "pubDate": "2025-09-17T05:01:02.749377"
        },
        {
            "title": "GMR Airports, Cyient among 8 stocks showing bullish White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmr-airports-cyient-among-8-stocks-showing-bullish-white-marubozu-pattern/slideshow/123934949.cms",
            "description": "On September 16, eight Nifty500 stocks triggered the bullish “White Marubozu” scanner, according to stockedge.com’s technical scan data.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest and the closing price is the highest for the given period.Depicted by a long white (or green) candlestick with no upper shadow and a small or absent lower shadow, it reflects strong buying pressure throughout the session. Traders view it as a signal that buyers dominated from open to close, often using the pattern to guide future trading decisions.",
            "pubDate": "2025-09-17T05:01:02.749485"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama initiates coverage on Eureka Forbes; Religare Broking positive on REC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-initiates-coverage-on-eureka-forbes-religare-broking-positive-on-rec/articleshow/123934845.cms",
            "description": "Brokerages stay bullish: Nuvama starts Eureka Forbes with Buy (20% upside), Motilal Oswal reaffirms Biocon Buy (13% upside), Religare Broking positive on REC Ltd (22% upside) citing strong growth drivers.",
            "pubDate": "2025-09-17T05:01:02.749582"
        },
        {
            "title": "Sensex climbs 300 pts, Nifty tops 25,300 on US trade talk progress, Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-climbs-150-pts-nifty-tops-25300-on-us-trade-talk-progress-fed-rate-cut-hopes/articleshow/123934615.cms",
            "description": "Indian benchmark indices Sensex and Nifty began positively on Wednesday, fueled by financial and automotive sectors. This surge followed the government's optimistic remarks on trade discussions with the US and anticipation of a Federal Reserve interest rate cut. The S&P BSE Sensex climbed by 0.21%, while the NSE Nifty increased by 0.24% at the opening.",
            "pubDate": "2025-09-17T05:01:02.749709"
        },
        {
            "title": "Mobikwik shares drop 2% after Rs 40 crore fraud, probe underway",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mobikwik-shares-in-focus-after-rs-40-crore-fraud-probe-underway/articleshow/123934753.cms",
            "description": "Mobikwik shares: The digital payments company lost about ₹40 crore in a suspected fraud caused by a system glitch that allowed nearly 5 lakh UPI transactions to bypass balance checks and PIN verification over two days.",
            "pubDate": "2025-09-17T05:01:02.749810"
        },
        {
            "title": "DreamFolks shares hit 5% lower circuit after exiting domestic lounge business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dreamfolks-services-shares-in-focus-on-domestic-lounge-aggregation-business-exit/articleshow/123934721.cms",
            "description": "DreamFolks Services shares: The company has immediately exited the domestic airport lounges business, calling the impact material, but will continue other services and global lounges while working on alternate offerings for clients.",
            "pubDate": "2025-09-17T05:01:02.749905"
        },
        {
            "title": "Eureka Forbes shares up 2% as Nuvama Institutional Equities initiates coverage with Buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eureka-forbes-shares-up-2-as-nuvama-institutional-equities-initiates-coverage-with-buy-rating/articleshow/123935826.cms",
            "description": "Eureka Forbes shares experienced a surge following Nuvama Institutional Equities initiating coverage with a 'Buy' rating, projecting a 20% upside. The brokerage highlights the company's dominant market share in water purifiers and vacuum cleaners, alongside a strong after-sales service network.",
            "pubDate": "2025-09-17T05:24:15.171781"
        },
        {
            "title": "Redington shares surge 5%, up nearly 25% in just 2 sessions. What’s fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-shares-surge-5-up-nearly-25-in-just-2-sessions-whats-fuelling-the-rally/articleshow/123935776.cms",
            "description": "Redington Limited's shares are up because of the upcoming iPhone 17 sales. Pre-orders are happening now, and sales start on September 19. The stock has increased significantly in two days. Redington handles the supply chain for Apple products. The company reported profit and revenue growth in the first quarter. However, technical indicators suggest a possible near-term pullback.",
            "pubDate": "2025-09-17T05:24:15.171902"
        },
        {
            "title": "Euro Pratik Sales IPO Day 2: GMP at 2.5%, subscribed 47%. Should You Bid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/euro-pratik-sales-ipo-day-2-gmp-at-2-5-subscribed-47-should-you-bid/articleshow/123935717.cms",
            "description": "Euro Pratik Sales IPO witnessed 47% subscription on its second day, driven by strong NII interest at 91%. The grey market premium saw a slight uptick to 2.5%. The IPO, a complete offer for sale, is priced between Rs 235-247. The company, a leading wall panel brand with robust financials and international presence, aims to list on September 23, 2025.",
            "pubDate": "2025-09-17T05:24:15.172103"
        },
        {
            "title": "Betting on 5 stocks as metals shine; GST boost to discretionary spending: Nandish Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/betting-on-5-stocks-as-metals-shine-gst-boost-to-discretionary-spending-nandish-shah/articleshow/123936168.cms",
            "description": "Motilal Oswal’s Nandish Shah bets on NMDC, JSW Steel, Tata Steel, Vedanta, and Hindalco as metals rally. GST cuts and easing inflation are expected to revive discretionary demand, boosting consumption-focused sectors.",
            "pubDate": "2025-09-17T05:45:15.815042"
        },
        {
            "title": "Short-Term vs Long-Term Yields: What’s Driving the Curve",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/short-term-vs-long-term-yields-whats-driving-the-curve/slideshow/123936308.cms",
            "description": "The Treasury yield curve could steepen as investors demand higher compensation for perceived fiscal and political risks. Rising pressure from President Trump on the U.S. Federal Reserve is affecting investor confidence in the institution’s authority. (Source: Reuters)",
            "pubDate": "2025-09-17T05:45:15.815171"
        },
        {
            "title": "HDFC Bank top pick for Jefferies, target price set at Rs 1,200",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-top-pick-for-jefferies-target-price-set-at-rs-1200/articleshow/123938227.cms",
            "description": "HDFC Bank continues to be the top pick for global brokerage Jefferies, which has retained its BUY call with a target price of Rs 1,200. The bank’s improving loan growth, stable asset quality, and operational efficiencies are seen as key drivers for earnings and valuation. The ADR target price is set at $92.",
            "pubDate": "2025-09-17T07:19:54.884614"
        },
        {
            "title": "Fed’s rate decision in focus as Trump–Modi diplomacy brings unexpected boost to sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-rate-decision-in-focus-as-trumpmodi-diplomacy-brings-unexpected-boost-to-sentiment/articleshow/123938134.cms",
            "description": "Global markets await the Fed's interest rate decision, with expectations of a cut influencing market sentiment. Despite recent gains mirroring U.S. equities, Indian markets may experience a period of consolidation due to slow GDP growth. Experts advise a balanced portfolio with a significant allocation to financials, while acknowledging the cyclical nature of global markets.",
            "pubDate": "2025-09-17T07:19:54.884748"
        },
        {
            "title": "Wall Street braces for potential tariff overturn",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-braces-for-potential-tariff-overturn/slideshow/123937670.cms",
            "description": "Wall Street is preparing for potential market turbulence as the Supreme Court reviews the constitutionality of tariffs imposed under President Trump. Analysts warn that a ruling overturning the tariff regime could disrupt Corporate America and raise questions about fiscal stability. (Source: Reuters)",
            "pubDate": "2025-09-17T07:19:54.884863"
        },
        {
            "title": "NSDL gets ‘Neutral’ rating as Motilal Oswal initiates coverage, sees 8% downside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsdl-gets-neutral-rating-as-motilal-oswal-initiates-coverage-sees-8-downside/articleshow/123937382.cms",
            "description": "Motilal Oswal initiated coverage on NSDL with a 'Neutral' rating, setting a target price of Rs 1,200. While acknowledging NSDL's strong market position and growth potential in India's expanding capital markets, the brokerage suggests the current stock price largely reflects these positives.",
            "pubDate": "2025-09-17T07:19:54.884992"
        },
        {
            "title": "Shringar House of Mangalsutra shares slide over 2% after listing at premium. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shringar-house-of-mangalsutra-shares-slide-over-2-after-listing-at-premium-should-you-buy-sell-or-hold/articleshow/123937293.cms",
            "description": "Shares of Shringar House of Mangalsutra eased over 2% after debuting at a nearly 14% premium earlier in the session. Analysts recommend booking partial profits while holding the rest. The jewellery maker is a key player in India’s organised Mangalsutra market with a strong B2B presence.",
            "pubDate": "2025-09-17T07:19:54.885105"
        },
        {
            "title": "US-India trade talks offer hope, but investors should stay guarded: David Roche",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-india-trade-talks-offer-hope-but-investors-should-stay-guarded-david-roche/articleshow/123937229.cms",
            "description": "US and India are having trade discussions. David Roche suggests caution. He thinks the US is eager for a deal. Trump uses tariffs as leverage. Oil tariff is important to watch. Removing the oil tariff would be the first sign of progress. Capital flows depend on the Fed and US asset views. Risks remain in the trade talks.",
            "pubDate": "2025-09-17T07:19:54.885205"
        },
        {
            "title": "Rs 14 crore to Rs 390 crore! Facebook's early investor strikes gold again, this time with Urban Company IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-14-crore-to-rs-390-crore-facebooks-early-investor-strikes-gold-again-this-time-with-urban-company-ipo/articleshow/123937117.cms",
            "description": "Accel’s early investment in Urban Company turned Rs 14.3 crore into a Rs 390 crore payout after the home services platform debuted with a 57.5% premium over its Rs 103 IPO.  Accel first backed the home services startup over a decade ago, buying shares at an average price of Rs 3.77 apiece. The firm still holds shares valued at over Rs 1,100 crore.",
            "pubDate": "2025-09-17T07:19:54.885301"
        },
        {
            "title": "Festive season, tariffs in focus as investors monitor market trajectory",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/festive-season-tariffs-in-focus-as-investors-monitor-market-trajectory/articleshow/123936983.cms",
            "description": "The Indian market shows optimism due to GST changes and GDP data. Investors are watching consumption trends and corporate results. Market expert Karthik Kumar says GST restructuring is positive. Future market direction depends on consumption and external factors. He notes the market is structurally positive long-term. Festival season spending, tariffs, and earnings will be monitored.",
            "pubDate": "2025-09-17T07:19:54.885393"
        },
        {
            "title": "Mutual funds and ETFs are for losers, says Rich Dad Poor Dad author Robert Kiyosaki. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-and-etfs-are-for-losers-says-rich-dad-poor-dad-author-robert-kiyosaki-heres-why/articleshow/123936866.cms",
            "description": "Robert Kiyosaki criticises mutual funds and ETFs, calling them “for losers,” while welcoming Trump’s executive order allowing 401(k) investors to access alternative assets like gold, silver, Bitcoin, real estate, and private equity, which he says will increase the value of his preferred investments.",
            "pubDate": "2025-09-17T07:19:54.885490"
        },
        {
            "title": "Prosus doubles stake in Urban Company ahead of $1.8 billion IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prosus-doubles-stake-in-urban-company-ahead-of-1-8-billion-ipo/articleshow/123936757.cms",
            "description": "Prosus NV, fueled by its Tencent success, has significantly increased its stake in Urban Co. to 7.35% ahead of its IPO, investing $139 million. Urban Co.'s Mumbai trading debut surged by 74%, valuing the company at $2.8 billion, with the IPO being heavily oversubscribed. Prosus anticipates benefiting from the growth of Indian consumer-focused businesses.",
            "pubDate": "2025-09-17T07:19:54.885588"
        },
        {
            "title": "Dev Accelerator shares jump 5% after flat debut at IPO price. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dev-accelerator-shares-jump-5-after-flat-debut-at-ipo-price-should-you-buy-sell-or-hold/articleshow/123936681.cms",
            "description": "Shares of Dev Accelerator made a muted debut on Wednesday, September 17, listing at Rs 61.30 on the NSE, slightly above the Rs 61 IPO price, and later rose 5% to Rs 64.02. The Rs 143-crore IPO saw healthy investor interest, though the grey market premium remained modest. Analysts warn valuations are rich, recommending caution and a wait-and-watch approach.",
            "pubDate": "2025-09-17T07:19:54.885682"
        },
        {
            "title": "Short-term vs long-term yields: What’s driving the curve",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/short-term-vs-long-term-yields-whats-driving-the-curve/slideshow/123937023.cms",
            "description": "The Treasury yield curve could steepen as investors demand higher compensation for perceived fiscal and political risks. Rising pressure from President Trump on the U.S. Federal Reserve is affecting investor confidence in the institution’s authority. (Source: Reuters)",
            "pubDate": "2025-09-17T07:19:54.885773"
        },
        {
            "title": "Mukesh Ambani planning Reliance Retail IPO: 5 things investors should watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukesh-ambani-planning-reliance-retail-ipo-5-things-investors-should-watch-out-for/slideshow/123936599.cms",
            "description": "Mukesh Ambani is reportedly planning a blockbuster IPO for Reliance Retail in 2027, a year after the planned listing of Reliance Jio. The retail arm of Reliance Industries could be valued at nearly $200 billion at the time of its listing. This highly anticipated IPO is expected to be one of the largest in India's history, attracting global investor attention. Here are 5 things investors should watch out for",
            "pubDate": "2025-09-17T07:19:54.885864"
        },
        {
            "title": "Markets near fresh highs as FIIs eye India again; betting on high-beta sectors: Siddharth Vora",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-near-fresh-highs-as-fiis-eye-india-again-betting-on-high-beta-sectors-siddharth-vora/articleshow/123936393.cms",
            "description": "Siddharth Vora of PL Asset Management expresses strong optimism for Indian stock market's short- and medium-term growth, citing improved global trade conditions and robust domestic fundamentals. He anticipates a potential market surge driven by high-beta sectors like materials and financials, along with the expected return of foreign institutional investors and benefits from potential US Federal Reserve rate cuts.",
            "pubDate": "2025-09-17T07:19:54.885973"
        },
        {
            "title": "Hong Kong stocks climb to four-year high on AI optimism, TikTok deal progress",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hong-kong-stocks-climb-to-four-year-high-on-ai-optimism-tiktok-deal-progress/articleshow/123938687.cms",
            "description": "Hong Kong stocks hit a four-year high, driven by tech companies. Confidence in China's AI and a potential TikTok deal boosted the market. Mainland Chinese stocks also saw gains. Tech giants like Baidu and Alibaba surged. Developments in China's AI infrastructure and new AI models are noteworthy. Alibaba and Baidu are using internally designed chips.",
            "pubDate": "2025-09-17T07:39:59.612270"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Spread in Nifty for gains from bullish view to factor in market volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-for-gains-from-bullish-view-to-factor-in-market-volatility/articleshow/123938659.cms",
            "description": "The Nifty index displayed a strong bullish trend on Tuesday, breaking out in early trading and maintaining momentum to close near 25,260. Chandan Taparia of Motilal Oswal suggests holding above 25,150 for further gains towards 25,500, noting key support levels. Derivatives data indicates a trading range between 24,800 and 25,600.",
            "pubDate": "2025-09-17T07:39:59.612416"
        },
        {
            "title": "Belrise Industries shares soar 6% as Investec initiates coverage with 'Buy' rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/belrise-industries-shares-soar-6-as-investec-initiates-coverage-with-buy-rating/articleshow/123938374.cms",
            "description": "Belrise Industries shares rose sharply after Investec initiated coverage with a Buy rating and Rs 185 target. The 2W-focused auto ancillary is expanding OEM ties, entering 4W, defence, and solar segments, with analysts forecasting 30% PAT CAGR over FY25-28 despite risks from EV adoption and commodity volatility.",
            "pubDate": "2025-09-17T07:39:59.612642"
        },
        {
            "title": "Cochin Shipyard, GRSE and other defence stocks rally up to 8%. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cochin-shipyard-grse-and-other-defence-stocks-rally-up-to-8-heres-why/articleshow/123938313.cms",
            "description": "Indian defence stocks are on a roll, fueled by a potential Rs 2 lakh crore Rafale fighter jet deal and long-term growth optimism. Cochin Shipyard and GRSE surged, while HAL and Mazagon Dock also saw gains. Analysts are bullish on the sector's future, driven by government initiatives, but caution against stretched valuations and execution challenges.",
            "pubDate": "2025-09-17T07:39:59.612744"
        },
        {
            "title": "Chris Wood of Jefferies has a warning for investors chasing AI stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chris-wood-of-jefferies-has-a-warning-for-investors-chasing-ai-stocks/articleshow/123940876.cms",
            "description": "Jefferies’ Chris Wood warned that Wall Street’s AI-driven rally could end in a “massive overinvestment bust” as hyperscalers ramp up $350 billion in AI capex. He cautioned that stretched valuations and retail-driven buying may trigger a sharp correction once sentiment shifts.",
            "pubDate": "2025-09-17T09:46:02.589931"
        },
        {
            "title": "Markets in Focus: Dipan Mehta highlights stocks to watch amid corporate moves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-in-focus-dipan-mehta-highlights-stocks-to-watch-amid-corporate-moves/articleshow/123940484.cms",
            "description": "Investors focus on Vedanta’s demerger, DreamFolks’ setback, and GST-driven auto demand. L&T shows resilience, Reliance faces near-term limits, highlighting mixed short-term risks and long-term value opportunities across sectors.",
            "pubDate": "2025-09-17T09:46:02.590059"
        },
        {
            "title": "Paytm, Eternal among 12 Nifty India Digital stocks that rose up to 80% in just 6 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-eternal-among-12-nifty-india-digital-stocks-that-rose-up-to-80-in-just-6-months/slideshow/123940196.cms",
            "description": "Over the past six months, the Nifty India Digital Index gained 18%, outpacing the Nifty 50’s 13%. Sixteen stocks in the index delivered double-digit returns, with 12 rising 20–80%, highlighting strong investor appetite for high-growth, tech-driven companies.Leading the rally was One97 Communications (Paytm), which surged over 80% in just half a year. Eternal and Intellect Design Arena followed closely, each climbing nearly 60%, fueled by optimism around India’s accelerating digital transformation. However, it wasn’t smooth sailing for all. Traditional IT majors – TCS, Infosys, and Wipro – lagged behind, posting losses of 3–10% and underperforming both the digital index and the broader market. (Source: ACE Equity)",
            "pubDate": "2025-09-17T09:46:02.590164"
        },
        {
            "title": "If both gold and stocks are rallying, does it mean trouble for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/if-both-gold-and-stocks-are-rallying-does-it-mean-trouble-for-investors/articleshow/123940383.cms",
            "description": "Both stocks and gold are rallying ahead of the Fed’s rate decision, signalling cautious optimism. Investors are hedging with gold despite record-high equities, reflecting concerns over global debt, currency volatility, and potential market turbulence in the coming months.",
            "pubDate": "2025-09-17T09:46:02.590262"
        },
        {
            "title": "Be bullish, but be prepared for volatility: 6 mid-cap stocks from different sectors with upside potential of up to 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/be-bullish-but-be-prepared-for-volatility-6-mid-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-30/articleshow/123939655.cms",
            "description": "Although details are not available, the day-long “discussions” between US and Indian negotiators on the way forward to formalise a trade pact has been described as “positive” by both sides. That, and the call by US President Trump to wish PM Modi on his birthday has improved sentiment in the market. But remember: No deal is done till it is actually done. This was not, after all, an official round of negotiations; it was a step to get both sides to the table again. And with Trump, one can never be 100% certain what he will say tomorrow. So, be bullish. But also be cautious and selective when picking up stocks on the market.",
            "pubDate": "2025-09-17T09:46:02.590367"
        },
        {
            "title": "Prestige Estates shares rise 2%, extend gains to 3rd session as Nomura initiates coverage with buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prestige-estates-shares-rise-2-extend-gains-to-3rd-session-as-nomura-initiates-coverage-with-buy-rating/articleshow/123939722.cms",
            "description": "Shares of Prestige Estates rallied as much as 2.3% to their day’s high of Rs 1,663 per share on the NSE after Nomura initiated coverage on the counter with a Buy rating and a target price of Rs 1,900, implying a nearly 17% upside from the last closing price of Rs 1,625. With today’s gain, the stock is up for the third consecutive session.",
            "pubDate": "2025-09-17T09:46:02.590467"
        },
        {
            "title": "MCX shares soar 5% after Sebi chairman’s comments. Here’s what triggered the move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-soar-5-after-sebi-chairmans-comments-heres-what-triggered-the-move/articleshow/123939226.cms",
            "description": "MCX shares rose sharply after Sebi Chairman Tuhin Kanta Pandey signalled plans to let banks, pension funds, and FPIs participate in commodity trading. The move is expected to deepen markets, boost liquidity, and drive higher institutional participation in exchanges like MCX.",
            "pubDate": "2025-09-17T09:46:02.590563"
        },
        {
            "title": "Infosys ₹18,000 Cr buyback explained: Biggest share buyback ever in Indian IT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-18000-cr-buyback-explained-biggest-share-buyback-ever-in-indian-it/videoshow/123947385.cms",
            "description": "Infosys has announced a massive ₹18,000 crore buyback – its 5th in 8 years. Is this a smart move to reward investors or a sign of slowing innovation in Indian IT? We break down what this means for shareholders, R&D spending, AI bets, and Infosys’s future growth. Watch till the end to know if Infosys is creating long-term value or just short-term gains",
            "pubDate": "2025-09-17T13:39:00.840748"
        },
        {
            "title": "Fed rate cut to mark pivot toward job market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-rate-cut-to-mark-pivot-toward-job-market/articleshow/123946934.cms",
            "description": "The US Federal Reserve is expected to cut interest rates by 25 bps on Wednesday to support a weakening labor market, balancing tariff-driven inflation concerns, political pressure, and internal policy disagreements on employment and growth outlook.",
            "pubDate": "2025-09-17T13:39:00.840888"
        },
        {
            "title": "Tata Steel among 7 stocks that hit 52-week high; rally up to 22% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-among-7-stocks-that-hit-52-week-high-rally-up-to-22-in-a-month/slideshow/123945131.cms",
            "description": "On Wednesday, the benchmark Sensex surged approximately 313 points to close at 82,693. Driven by a broader market rally, seven stocks from the BSE 200 index touched their 52-week highs, marking the highest levels in the past year. Traders and investors often view such breakouts as bullish signals, indicating strong upward momentum and the potential for further gains.",
            "pubDate": "2025-09-17T13:39:00.841000"
        },
        {
            "title": "Sebi for allowing banks, insurers, pension funds to invest in non-agri commodity derivatives: Chief Tuhin Kanta Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-for-allowing-banks-insurers-pension-funds-to-invest-in-non-agri-commodity-derivatives-chief-tuhin-kanta-pandey/articleshow/123946258.cms",
            "description": "Sebi will \"engage\" with the government to allow banks, insurance companies and pension funds to invest in non-agriculture commodity derivative markets, its chairman Tuhin Kanta Pandey said on Wednesday.",
            "pubDate": "2025-09-17T13:39:00.841099"
        },
        {
            "title": "Indiabulls AMC, others settle AIF rules violations case with Sebi, pay Rs 1.43 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indiabulls-amc-others-settle-aif-rules-violations-case-with-sebi-pay-rs-1-43-cr/articleshow/123945260.cms",
            "description": "Erstwhile Indiabulls Asset Management Company (now known as Groww AMC), its schemes and former officials on Wednesday settled a case with Sebi pertaining to alleged violations of alternative investment fund rules after collectively paying Rs 1.43 crore.",
            "pubDate": "2025-09-17T13:39:00.841195"
        },
        {
            "title": "Nifty outlook: Jefferies’ Mahesh Nandurkar sees 8–9% returns, range-bound market ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-outlook-jefferies-mahesh-nandurkar-sees-89-returns-range-bound-market-ahead/articleshow/123944808.cms",
            "description": "Indian markets are expected to remain range-bound with 8–9% Nifty returns over the next year, says Jefferies’ Mahesh Nandurkar. Strong domestic inflows support downside, but equity supply and weak FPI participation cap significant upside, keeping consolidation intact.",
            "pubDate": "2025-09-17T13:39:00.841292"
        },
        {
            "title": "Stock Radar: Aditya Birla Capital stock hits fresh record high in September 2025; will the rally continue?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-aditya-birla-capital-stock-hits-fresh-record-high-in-september-2025-will-the-rally-continue/articleshow/123934480.cms",
            "description": "Aditya Birla Capital Ltd. achieved a fresh record high in September, signaling a continuation of its upward trajectory. Experts suggest a buying opportunity for short-term traders, targeting Rs 335 within 1-2 months. The stock's breakout on monthly charts after eight years, coupled with positive technical indicators, reinforces a bullish outlook, supported by strong price development and retested breakout levels.",
            "pubDate": "2025-09-17T13:39:00.841387"
        },
        {
            "title": "Paytm and 5 other midcap stocks with high P/E ratio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-and-5-other-midcap-stocks-with-high-p/e-ratio/slideshow/123943899.cms",
            "description": "A P/E ratio above 200 indicates that a company’s stock price is rising significantly faster than its earnings. This is calculated using the latest end-of-day price and trailing twelve months (TTM) earnings per share. From the NSE midcap segment, we have highlighted the top six stocks with the highest TTM P/E ratios, based on a valuation scan by Stockedge.com.While a high P/E suggests strong growth expectations from investors, it can also signal overvaluation or speculative buying. It is important to assess the company's fundamentals and market conditions for a more accurate evaluation.",
            "pubDate": "2025-09-17T13:39:00.841483"
        },
        {
            "title": "​Gainers & Losers: Urban Company, Vedanta among 8 stocks that hogged limelight on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-urban-company-vedanta-among-8-stocks-that-hogged-limelight-on-wednesday/slideshow/123943480.cms",
            "description": "",
            "pubDate": "2025-09-17T13:39:00.841575"
        },
        {
            "title": "Vedanta shares drop 4% as govt reportedly doubles down against demerger plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-drop-4-as-govt-reportedly-doubles-down-against-demerger-plan/articleshow/123942639.cms",
            "description": "Metal major Vedanta's shares fell nearly 4% on Wednesday to hit the day's low of Rs 471 after its demerger plans received another setback. The government reportedly doubled down its objection, accusing the proposed demerger scheme of being a tactic to hinder the recovery of its dues.",
            "pubDate": "2025-09-17T13:39:00.841669"
        },
        {
            "title": "Trump’s tariffs may backfire, AI boom could bust: Christopher Wood on US, China, and India strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-tariffs-may-backfire-ai-boom-could-bust-christopher-wood-on-us-china-and-india-strategy/articleshow/123942335.cms",
            "description": "Investors focus on Vedanta’s demerger, DreamFolks’ setback, and GST-driven auto demand. L&T shows resilience, Reliance faces near-term limits, highlighting mixed short-term risks and long-term value opportunities across sectors.",
            "pubDate": "2025-09-17T13:39:00.841758"
        },
        {
            "title": "Market Wrap: Sensex climbs over 310 points, Nifty tops 25,330 on India-U.S. trade talk progress, Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-climbs-over-310-points-nifty-tops-25330-on-india-u-s-trade-talk-progress-fed-rate-cut-hopes/articleshow/123942309.cms",
            "description": "Indian stocks finished higher Wednesday, with the Sensex and Nifty rising for a second straight session, lifted by optimism around progress in India-U.S. trade talks and expectations that the Federal Reserve will trim interest rates later in the day.",
            "pubDate": "2025-09-17T13:39:00.841879"
        },
        {
            "title": "India’s $3.5 trillion gold holdings show it’s far from a ‘dead economy’: Gurmeet Chadha",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-3-5-trillion-gold-holdings-show-its-far-from-a-dead-economy-gurmeet-chadha/articleshow/123942161.cms",
            "description": "India’s massive gold holdings, totaling nearly $3.5 trillion across households, RBI, and religious institutions, highlight its economic resilience. Gurmeet Chadha countered the “dead economy” tag amid global uncertainties, citing robust Q1 FY26 GDP growth of 7.8% and strong domestic consumption, services, and manufacturing, underscoring India’s sustained financial strength.",
            "pubDate": "2025-09-17T13:39:00.841980"
        },
        {
            "title": "SBI shares surge 4% after public lender divests 13.19% stake in Yes Bank to Japan's SMBC for Rs 8,889 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-divests-13-19-stake-in-yes-bank-to-japans-smbc-for-rs-8889-crore/articleshow/123941545.cms",
            "description": "State Bank of India (SBI) has divested its 13.19% stake in Yes Bank to Japan’s Sumitomo Mitsui Banking Corporation (SMBC) for Rs 8,889 crore at Rs 21.50 per share, following approvals from the RBI and Competition Commission of India (CCI). As part of the RBI’s ‘Reconstruction Scheme 2020’, a consortium of eight banks led by SBI executed equity commitments in Yes Bank.",
            "pubDate": "2025-09-17T13:39:00.842075"
        },
        {
            "title": "US stocks tick flat ahead of Fed's policy decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-flat-ahead-of-feds-policy-decision/articleshow/123947419.cms",
            "description": "Wall Street is pausing in anticipation of the Federal Reserve's expected interest rate cut announcement. The S&P 500 remains near its record high, while the Dow sees gains led by Workday's surge after Elliott Investment Management's stake. Investors are keenly awaiting the Fed's commentary on future rate adjustments amid concerns about a slowing job market and persistent inflation.",
            "pubDate": "2025-09-17T14:32:31.095224"
        }
    ]
}