{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-23T19:46:29.857128",
    "items": [
        {
            "title": "KFin Technologies Q3 Results: Profit rises 35% to Rs 90 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kfin-technologies-q3-results-profit-rises-35-to-rs-90-crore/articleshow/117490831.cms",
            "description": "KFin Technologies Ltd on Thursday reported a 35 per cent year-on-year surge in profit after tax to Rs 90.18 crore for three months ended December 2024.",
            "pubDate": "2025-01-23T13:56:55.257942"
        },
        {
            "title": "HPCL Q3 Results: Cons PAT skyrockets 257% YoY to Rs 2,544 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hpcl-q3-results-cons-pat-jumps-257-yoy-to-rs-2544-crore/articleshow/117489882.cms",
            "description": "Hindustan Petroleum Corporation (HPCL) reported a substantial year-on-year net profit growth of 257% for the December quarter, reaching Rs 2,544 crore. HPCL attributed this growth to robust physical performance, operational efficiencies, and improved margins.",
            "pubDate": "2025-01-23T13:56:55.258078"
        },
        {
            "title": "UltraTech posts lower-than-expected fall in profit, shares surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-posts-lower-than-expected-fall-in-profit-shares-surge/articleshow/117489554.cms",
            "description": "UltraTech Cement's December quarter profit dropped 17% year-on-year to ₹1,470 crore, outperforming expectations. Sales volume grew 10.5%, revenue rose 3%, while cost reductions partly offset weak realizations. Shares surged nearly 7% post-results announcement.",
            "pubDate": "2025-01-23T13:56:55.258189"
        },
        {
            "title": "Syngene Q3 Results: Net profit rose 18% YoY to Rs 131 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/syngene-q3-results-net-profit-rose-18-to-rs-131-crore/articleshow/117489353.cms",
            "description": "Syngene reported 18% YoY growth in Q3FY25 net profit. Revenue rose 11% YoY. EBITDA margin improved to 31.4%. Company expects single-digit revenue growth and flat profit after tax for FY25.",
            "pubDate": "2025-01-23T13:56:55.258292"
        },
        {
            "title": "Dr Reddy's Labs Q3 Results: Cons PAT rises 2% YoY to Rs 1,413 crore, revenue up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-lab-q3-results-cons-pat-jumps-2-yoy-to-rs-1413-crore-revenue-up-16/articleshow/117487968.cms",
            "description": "Dr Reddy's Labs Q3 Results: Dr Reddy's Laboratories on Thursday reported a 2% year-on-year growth in its December quarter consolidated net profit at Rs 1,413 crore versus Rs 1,379 crore posted in the year ago period.",
            "pubDate": "2025-01-23T13:56:55.258393"
        },
        {
            "title": "Zee Ent Q3 Results: PAT soars 180% YoY to Rs 164 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zee-ent-q3-results-pat-soars-180-yoy-to-rs-164-crore/articleshow/117484210.cms",
            "description": "ZEE Entertainment Enterprises (ZEEL) reported a 180% YoY growth in net profit to Rs 164 crore in Q3, despite a 3% YoY revenue decline to Rs 1,979 crore. Advertising revenue improved 4% QoQ but declined 8% YoY. Subscription revenues rose 7% YoY to Rs 982 crore.",
            "pubDate": "2025-01-23T13:56:55.258514"
        },
        {
            "title": "Adani Energy Q3 Results: Cons PAT zooms 73% YoY to Rs 562 crore, revenue rises 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-energy-q3-results-cons-pat-zooms-73-yoy-to-rs-562-crore-revenue-rises-28/articleshow/117484223.cms",
            "description": "Adani Energy Q3 Results: The quarterly revenue from operations rose 28% YoY to Rs 5,830 crore from Rs 4,563 crore but dropped 6% sequentially from Rs 6,184 crore in Q2FY25. Meanwhile, the bottom line fell 17% sequentially to Rs 675 crore, reflecting a decline compared to the July-September 2024 quarter, despite strong annual growth in revenue performance.",
            "pubDate": "2025-01-23T13:56:55.258621"
        },
        {
            "title": "Hyundai Motor Q4 Results: Profit falls 17% as discounts weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hyundai-motor-q4-results-profit-falls-17-as-discounts-weigh/articleshow/117483397.cms",
            "description": "South Korea's Hyundai Motor reported on Thursday a 17% fall in fourth-quarter operating profit, declining more than analysts estimated, as it spent more on promotions in a slowing car market.",
            "pubDate": "2025-01-23T13:56:55.258713"
        },
        {
            "title": "UltraTech Cement Q3 Results: PAT falls 17% YoY to Rs 1,469 crore but beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-q3-results-pat-falls-17-yoy-to-rs-1469-crore-but-beats-estimates/articleshow/117482311.cms",
            "description": "UltraTech Cement Q3 Results:  Revenue from operations rose by a marginal 3% YoY to Rs 17,193 crore. Despite the profit decline, it exceeded the Street estimate of Rs 1,195 crore, while revenues also surpassed expectations of Rs 16,854 crore. UltraTech reported 73% capacity utilization for the quarter, with domestic sales volume up 10% YoY. Energy costs dropped 13% YoY due to lower fuel prices.",
            "pubDate": "2025-01-23T13:56:55.258809"
        },
        {
            "title": "IndiGo Q3 Preview: PAT may fall 25% YoY on AoG-related costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-q3-preview-pat-may-fall-25-yoy-on-aog-related-costs/articleshow/117481920.cms",
            "description": "JM Financial expects IndiGo's margins to improve sequentially, supported by lower fuel prices and double-digit ASK growth per company guidance. While YoY yields may moderate, sequential growth is anticipated. Increased capacity, seasonal tailwinds, and an improving AOG situation are likely to boost the company's earnings trajectory.",
            "pubDate": "2025-01-23T13:56:55.258908"
        },
        {
            "title": "JSW Steel Q3 Preview: PAT may fall by up to 87% YoY on lower HRC realisations, revenue decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q3-preview-pat-may-fall-by-up-to-87-yoy-on-lower-hrc-realisations-revenue-decline/articleshow/117480247.cms",
            "description": "JSW Steel’s Q3 revenue is estimated between Rs 38,581 crore and Rs 41,750 crore, factoring in projections from Nuvama, Elara, and Kotak Institutional Equities. Nuvama predicts the steepest PAT fall, while Kotak offers conservative estimates. Nomura cut its 3QFY25 EBITDA forecast by 21%, citing weaker volumes and HRC prices. Elara and Kotak expect significant YoY topline declines.",
            "pubDate": "2025-01-23T13:56:55.259008"
        },
        {
            "title": "On tighter credit rein, HDFC Bank profits inch up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/on-tighter-credit-rein-hdfc-bank-profits-inch-up-2/articleshow/117472629.cms",
            "description": "HDFC Bank reports a 2% rise in net profit for the December quarter to ₹16,736 crore. The bank deliberately slowed loan disbursals to prevent its credit-to-deposit ratio from worsening. The profit exceeded Bloomberg's consensus estimates, and the bank plans to align its growth with the industry next year and exceed it by FY27.",
            "pubDate": "2025-01-23T13:56:55.259106"
        },
        {
            "title": "HUL grows revenue basket by 2%, raises red flag over slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hul-grows-revenue-basket-by-2-raises-red-flag-over-slump/articleshow/117472456.cms",
            "description": "The country's largest fast-moving consumer goods (FMCG) company, whose performance is considered a proxy for broader consumer sentiment in India, grappled with falling revenue in the personal care business, along with slower growth in its beauty division, where it competes with a flurry of new-age online brands.",
            "pubDate": "2025-01-23T13:56:55.259208"
        },
        {
            "title": "HDB Financial's Q3 net drops 27% on provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdb-financials-q3-net-drops-27-on-provisions/articleshow/117471268.cms",
            "description": "Financing costs increased 31% year-on-year to ₹1,645 crore during the quarter. Provisions on bad loans increased to ₹636 crore from ₹283 crore a year ago as the bank sought cover for rising non-performing assets (NPAs). Net interest margin (NIM) dropped to 7.5% from 7.7% a year ago.",
            "pubDate": "2025-01-23T13:56:55.259305"
        },
        {
            "title": "Pidilite Industries Q3 Results: Profit rises 9% to Rs 557 crore, revenue up 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pidilite-industries-q3-results-profit-rises-9-to-rs-557-crore-revenue-up-8/articleshow/117463381.cms",
            "description": "Pidilite Industries reported a 9% YoY increase in Q3FY25 net profit to ₹557 crore, with revenue rising 8% to ₹3,369 crore. Gross margins improved due to lower input costs.",
            "pubDate": "2025-01-23T13:56:55.259392"
        },
        {
            "title": "Tips Music Q3 net jumps 27% to Rs 44 crore, Rs 3/share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tips-music-q3-net-jumps-27-to-rs-44-crore-rs-3/share-dividend-announced/articleshow/117463326.cms",
            "description": "Tips Music reported a 27% YoY net profit growth to ₹44.2 crore in Q3FY25, supported by a 20% revenue rise. Strong digital performance and global collaborations fueled growth, with YouTube views increasing 17% YoY.",
            "pubDate": "2025-01-23T13:56:55.259506"
        },
        {
            "title": "Indus Towers Q3 Results: Profit shoots up 160% to Rs 4,003 crore on tower additions, Vi payments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indus-towers-q3-results-profit-shoots-up-160-to-rs-4003-crore-on-tower-additions-vi-payments/articleshow/117493953.cms",
            "description": "Indus Towers reported a 160% on-year jump in net profits at Rs 4,003 crore in the fiscal third quarter, on the back of strong tower additions, and significant collections of overdues from Vodafone Idea, which is one of its major customers.",
            "pubDate": "2025-01-23T19:46:21.988042"
        },
        {
            "title": "United Spirits Q3 Results: Net profit down 4% at Rs 335 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/united-spirits-q3-results-net-profit-down-4-at-rs-335-crore/articleshow/117493722.cms",
            "description": "United Spirits Ltd on Thursday reported a 4.3 per cent decline in consolidated net profit at Rs 335 crore in the December quarter, impacted by higher expenses and severance costs related to a closed unit.",
            "pubDate": "2025-01-23T19:46:21.988166"
        },
        {
            "title": "Mankind Pharma net profit drops 16% to Rs 385 crore in Q3FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mankind-pharma-net-profit-drops-16-to-rs-385-crore-in-q3fy25/articleshow/117493506.cms",
            "description": "Mankind Pharma's Q3 FY25 net profit declined 16% YoY to ₹385 crore despite a 24% revenue increase to ₹3,230 crore. Domestic revenues rose 17%, exports more than doubled, and consumer health grew 30%.",
            "pubDate": "2025-01-23T19:46:21.988272"
        },
        {
            "title": "Suryoday Small Finance Bank Q3 Results: Profit slumps 42% to Rs 33 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/suryoday-small-finance-bank-q3-results-profit-slumps-42-to-rs-33-crore/articleshow/117493300.cms",
            "description": "Suryoday Small Finance Bank reported a 42% YoY drop in Q3 FY25 net profit to ₹33.3 crore due to higher expenses and worsening asset quality, despite 25.8% growth in gross advances.",
            "pubDate": "2025-01-23T19:46:21.988393"
        },
        {
            "title": "Dr Reddy's net profit rises 2% to Rs 1,413 crore in Q3FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-net-profit-rises-2-to-rs-1413-crore-in-q3fy25/articleshow/117493230.cms",
            "description": "Dr. Reddy's reported a 2% YoY profit increase to ₹1,413 crore in Q3 FY25, with revenue rising 16% to ₹8,359 crore. North America sales grew 1% YoY despite sequential declines.",
            "pubDate": "2025-01-23T19:46:21.988496"
        },
        {
            "title": "MMT posts a profit of $27 million in Q3, revenue at $ 267.4 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mmt-posts-a-profit-of-27-million-in-q3-revenue-at-267-4-million/articleshow/117493033.cms",
            "description": "MakeMyTrip posted a Q3 FY25 profit of $27M, up from $24M last year, with revenues rising 26.2% to $267.4M. Strong growth in gross bookings, international outbound, and operating profit drove performance.",
            "pubDate": "2025-01-23T19:46:21.988598"
        },
        {
            "title": "Mankind Pharma Q3 Results: Profit falls 16% to Rs 384 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mankind-pharma-q3-results-profit-falls-16-to-rs-384-crore/articleshow/117492224.cms",
            "description": "Mankind Pharma on Thursday said its consolidated net profit declined 16.5 per cent to Rs 384 crore in the third quarter ended December 31, 2024. The company had reported a net profit of Rs 460 crore for the October-December period of last fiscal.",
            "pubDate": "2025-01-23T19:46:21.988698"
        },
        {
            "title": "Spandana Sphoorty Financial suffers 2nd quarterly loss, breaches borrowing covenants, regulatory norm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spandana-sphoorty-financial-suffers-2nd-quarterly-loss-breaches-borrowing-covenants-regulatory-norm/articleshow/117491937.cms",
            "description": "Spandana Sphoorty Financial posted a ₹440 crore net loss in Q3 FY24, its second consecutive quarterly loss, driven by ₹626 crore bad loan write-offs and higher provisions. Regulatory exemptions and lender discussions continue amid covenant breaches.",
            "pubDate": "2025-01-23T19:46:21.988795"
        },
        {
            "title": "Adani Green Q3 Results: Cons PAT jumps 85% YoY to Rs 474 crore, revenue rises 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-green-q3-results-cons-pat-jumps-85-yoy-to-rs-474-crore-revenue-rises-2/articleshow/117491810.cms",
            "description": "Adani Green Q3 Results:  The company's operational revenue reached Rs 2,365 crore in the quarter, a 2.3% rise compared to the Rs 2,311 crore generated in the same quarter of the previous financial year.",
            "pubDate": "2025-01-23T19:46:21.988893"
        }
    ]
}