{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-10T13:17:18.777236",
    "items": [
        {
            "title": "Tejas Networks Q3 Results: Cons loss widens to Rs 196 crore, revenue sinks 88% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tejas-networks-q3-results-cons-loss-widens-to-rs-196-crore-revenue-sinks-88-yoy/articleshow/126447501.cms",
            "description": "Tejas Networks reported a Rs 196.55 crore loss in Q2, impacted by an 88% revenue drop and a significant BSNL order deferral. Despite a large inventory, the company secured private 5G wins and PLI incentives, signaling future growth potential amidst current financial challenges.",
            "pubDate": "2026-01-10T04:58:29.345923"
        },
        {
            "title": "IREDA Q3 Results: PAT jumps 15% YoY to Rs 1,381 crore, revenue up 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ireda-q3-results-pat-jumps-15-yoy-to-rs-1381-crore-revenue-up-28/articleshow/126447604.cms",
            "description": "IREDA posted a 15.4% YoY rise in Q3 FY26 PAT at Rs 1,381 crore, with revenue up 28.2% to Rs 6,042 crore. Loan sanctions jumped 29% YoY to Rs 40,100 crore, while disbursements rose 44% to Rs 24,903 crore. Strong domestic borrowings and diversified clean energy lending underpin robust growth and execution visibility.",
            "pubDate": "2026-01-10T05:23:11.708810"
        },
        {
            "title": "DMart Q3 Results: Cons profit jumps 18% YoY to Rs 856 crore, revenue up 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dmart-q3-results-avenue-supermarts-reports-18-yoy-jump-in-profit-at-rs-856-crore-revenue-up-13/articleshow/126452236.cms",
            "description": "Avenue Supermarts, the parent of DMart, posted strong Q3 FY26 numbers with consolidated PAT rising 18.3% YoY to Rs 855.92 crore, compared to Rs 723.72 crore a year earlier. Revenue from operations grew 13.3% YoY to Rs 18,100.88 crore, up from Rs 15,972.55 crore in the same quarter last fiscal.",
            "pubDate": "2026-01-10T13:17:18.006065"
        }
    ]
}