{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-20T11:12:12.370315",
    "items": [
        {
            "title": "Reliance Infrastructure, Reliance Power shares rally over 10% in 2 days. Here’s what moved the Anil Ambani stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infrastructure-reliance-power-shares-rally-over-10-in-2-days-heres-what-moved-the-anil-ambani-stocks/articleshow/123401435.cms",
            "description": "Reliance Infrastructure and Reliance Power shares surged over 10% in two days after project wins boosted sentiment. Reliance Infra bagged an NHPC solar-plus-BESS project, while Reliance Power entered a Bhutan JV, strengthening their clean energy pipeline to over 3 GW solar and 3.5 GWh storage.",
            "pubDate": "2025-08-20T05:53:00.229719"
        },
        {
            "title": "Investors bet on September US rate cut, bigger easing urged",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-bet-on-september-us-rate-cut-bigger-easing-urged/slideshow/123401221.cms",
            "description": "U.S. Treasury Secretary Scott Bessent said revenues from President Trump’s sweeping tariffs will be significantly higher than his earlier estimate of $300 billion. He made it clear that the priority will be to use these funds to pay down the federal debt first, rather than distributing rebate checks to Americans. (Source: Reuters)",
            "pubDate": "2025-08-20T05:53:00.229837"
        },
        {
            "title": "Trump turns up heat on Powell ahead of Jackson hole",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-turns-up-heat-on-powell-ahead-of-jackson-hole/slideshow/123401060.cms",
            "description": "Donald Trump has renewed his attack on Federal Reserve Chair Jerome Powell, accusing him of “hurting” the housing industry. Trump repeated his call for a big interest rate cut, arguing that inflation is not a concern and that the economy is signaling the need for major easing. (Source: Reuters)",
            "pubDate": "2025-08-20T05:53:00.229947"
        },
        {
            "title": "As IRFC shares sink 50% from peak, why scaling crucial resistance could be a tall order?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-irfc-shares-sink-50-from-peak-why-scaling-crucial-resistance-could-be-a-tall-order/articleshow/123400110.cms",
            "description": "IRFC shares have significantly declined, falling 50% from their peak despite a double-digit increase in Q1 net profit. Technical analysis indicates a weak setup, with the stock struggling below the critical Rs 130 resistance level. Experts suggest reclaiming this level will be challenging, reflecting a broader downturn in railway stocks.",
            "pubDate": "2025-08-20T05:53:00.230047"
        },
        {
            "title": "Canva begins employee stock sale at $42 billion valuation, Bloomberg News reports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canva-begins-employee-stock-sale-at-42-billion-valuation-bloomberg-news-reports/articleshow/123399913.cms",
            "description": "Canva has launched an employee stock sale at a $42 billion valuation, according to Bloomberg.",
            "pubDate": "2025-08-20T05:53:00.230160"
        },
        {
            "title": "Intel’s $24 billion rally sends valuation to dot-com levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/intels-24-billion-rally-sends-valuation-to-dot-com-levels/articleshow/123399828.cms",
            "description": "Intel's stock has surged recently due to potential government equity and SoftBank investment, reaching valuation levels not seen since the dot-com era. While optimism surrounds CEO Lip-Bu Tan's turnaround efforts, concerns linger about the company's long-term profitability and technological competitiveness. Analysts remain cautious, citing an overvalued stock and uncertain future prospects.",
            "pubDate": "2025-08-20T05:53:00.230256"
        },
        {
            "title": "Vikram Solar, Mangal Electrical among 7 hot IPOs this week. Which one tops the GMP charts?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikram-solar-mangal-electrical-among-7-hot-ipos-this-week-which-one-tops-the-gmp-charts/slideshow/123399895.cms",
            "description": "In this IPO-heavy week, 5 mainboard initial public offerings (IPOs) and two SME issues are on the anvil. While 4 mainboards opened on Tuesday, one opens today. In the SME segment, Studio LSD will close today while ARC Insulation & Insulators IPO will open on Thursday, August 21. Here is a sneak peek into their grey market premiums (GMPs) ahead of the opening and who is winning the race so far. GMP is the premium (or discount) at which an IPO’s shares are traded unofficially before their official listing on the stock exchange, they are dynamic and subject to change.",
            "pubDate": "2025-08-20T05:53:00.230352"
        },
        {
            "title": "Mukesh Ambani wants to double RIL size by FY30. What it means for 44 lakh shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukesh-ambani-wants-to-double-ril-size-by-fy30-what-it-means-for-44-lakh-shareholders/articleshow/123399728.cms",
            "description": "Mukesh Ambani aims to double Reliance Industries by FY30, potentially re-rating the stock for 44 lakh shareholders. RIL shares have already surged this year. The upcoming AGM on August 29 is crucial for strategic announcements. Jio and Retail are expected to drive growth. New energy is a key pillar. Investment banks back this transformation. Investors await further details.",
            "pubDate": "2025-08-20T05:53:00.230444"
        },
        {
            "title": "Aditya Infotech shares rise over 2% after 46% YoY surge in Q1 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-infotech-shares-rise-over-2-after-46-yoy-surge-in-q1-pat/articleshow/123399676.cms",
            "description": "Aditya Infotech reported a strong set of numbers for Q1FY26, posting a 46% year-on-year jump in profit after tax (PAT) at Rs 32.88 crore, compared with Rs 22.51 crore in the year-ago quarter. Revenue from operations rose 16.3% YoY to Rs 740.03 crore from Rs 636.02 crore.",
            "pubDate": "2025-08-20T05:53:00.230542"
        },
        {
            "title": "Ola Electric shares rally 18% in 2 days. Analysts say Rs 57 within reach; should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-have-halved-in-2025-analysts-say-rs-57-is-within-reach-should-you-buy/articleshow/123399567.cms",
            "description": "Ola Electric share price rebounded this week, rallying 18% after a significant slide. Investors are weighing potential GST reforms that could favor conventional cars against signs of renewed momentum for the EV maker. Despite weak financials, some analysts see bottom formation, with technical indicators suggesting a possible further recovery.",
            "pubDate": "2025-08-20T05:53:00.230640"
        },
        {
            "title": "Sensex jumps over 100 pts, Nifty tops 25,000 ; IT stocks rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-100-pts-nifty-slips-below-25000-as-banks-drag-ahead-of-fed-symposium/articleshow/123399207.cms",
            "description": "Indian markets initially declined due to HDFC Bank and State Bank of India's performance, mirroring a tech selloff on Wall Street. However, indices recovered, influenced by expectations of GST reforms and potential demand boosts in various sectors.",
            "pubDate": "2025-08-20T05:53:00.230733"
        },
        {
            "title": "UltraTech Cement shares in focus as company set to hit 200 MTPA capacity ahead of schedule",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ultratech-cement-shares-in-focus-as-company-set-to-hit-200-mtpa-capacity-ahead-of-schedule/articleshow/123399494.cms",
            "description": "UltraTech Cement shares are likely to be in focus after Chairman Kumar Mangalam Birla said the company will cross the 200 MTPA capacity milestone by the end of this fiscal, a year ahead of its FY27 target. With strong organic expansion and acquisitions, UltraTech is set to strengthen its leadership as India’s infrastructure growth accelerates.",
            "pubDate": "2025-08-20T05:53:00.230827"
        },
        {
            "title": "Ramco Cements shares in focus as company sees revenue doubling in 4–5 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ramco-cements-shares-in-focus-as-company-sees-revenue-doubling-in-45-years/articleshow/123399434.cms",
            "description": "Ramco Cements has set an ambitious target to double its revenue to ₹16,000 crore within the next 4–5 years, backed by a ₹2,000 crore push from its new construction chemicals brand and expansion of cement production capacity to 30 MTPA by mid-2026. The company will invest ₹1,000 crore in this capacity addition, CEO A V Dharmakrishnan said.",
            "pubDate": "2025-08-20T05:53:00.230922"
        },
        {
            "title": "Nazara Tech, Delta Corp shares slide up to 7% as Cabinet clears online gaming regulation bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-technologies-shares-in-focus-as-cabinet-clears-online-gaming-regulation-bill/articleshow/123399386.cms",
            "description": "Shares of Nazara Technologies and Delta Corp experienced a decline following the Union Cabinet's approval of a bill to regulate online gaming platforms. The legislation addresses mental health concerns, money laundering risks, and fraudulent transactions within the digital gaming industry. Investors are closely monitoring Nazara Technologies as the bill is expected to reshape the regulatory landscape for the sector.",
            "pubDate": "2025-08-20T05:53:00.231015"
        },
        {
            "title": "IIFL Finance, Chennai Petroleum, Reliance Power among 7 stocks with White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iifl-finance-chennai-petroleum-reliance-power-among-7-stocks-with-white-marubozu-pattern/slideshow/123399336.cms",
            "description": "On August 19, 14 stocks from the Nifty 500 pack appeared in the bullish \"White Marubozu\" scanner, according to technical scan data from StockEdge.com. We have highlighted the top seven stocks from the list. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-08-20T05:53:00.231124"
        },
        {
            "title": "Westlife Foodworld, Raymond among 7 stocks that rose above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/westlife-foodworld-raymond-among-7-stocks-that-rose-above-vwap/slideshow/123399228.cms",
            "description": "On August 19, the closing prices of seven stocks in the Nifty500 pack rallied over 2% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-20T05:53:00.231217"
        },
        {
            "title": "Citadel Securities expands team in India after Jane Street saga",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citadel-securities-expands-team-in-india-after-jane-street-saga/articleshow/123402424.cms",
            "description": "Citadel Securities is expanding its Indian operations by hiring options trader Prajual Maheshwari, signaling confidence in the South Asian market despite recent regulatory scrutiny. The firm aims to recruit more traders and senior staff for its Gurugram office, which already handles cash equities and derivatives.",
            "pubDate": "2025-08-20T06:45:11.473499"
        },
        {
            "title": "Balancing Risks and Rewards: Fed official calls for embracing crypto",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balancing-risks-and-rewards-fed-official-calls-for-embracing-crypto/slideshow/123402208.cms",
            "description": "Federal Reserve Vice Chair for Supervision Michelle Bowman suggested that central bank staff should be allowed to hold small amounts of crypto products. She argued that direct experience with digital assets would improve their ability to regulate the sector effectively. (Source: Reuters)",
            "pubDate": "2025-08-20T06:45:11.473619"
        },
        {
            "title": "Stocks to Buy | Autos, chemicals and fertilisers poised to benefit fromGST reforms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-autos-chemicals-and-fertilisers-poised-to-benefit-from-gst-reforms/slideshow/123401938.cms",
            "description": "Alok Agarwal, in an interview with ET Now, said that the Nifty has touched the 25,000 mark, lifted by the government’s decision to rationalise GST rates. He explained that this move is being seen as a much-needed fiscal stimulus to boost consumption across the economy. According to him, with the RBI already taking steps on the monetary side and earlier reforms on direct taxes and regulations, the latest GST change provides the missing push on the fiscal front, creating a more balanced policy support for growth.",
            "pubDate": "2025-08-20T06:45:11.473724"
        },
        {
            "title": "Regaal Resources shares slip 7% after strong D-Street debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/regaal-resources-shares-slip-7-after-strong-d-street-debut/articleshow/123401672.cms",
            "description": "Regaal Resources shares: The stock debuted at ₹141.80 on the BSE, a 39% premium to its IPO price of ₹102, and at ₹141 on the NSE, marking a 38.2% gain. However, the initial surge lost steam as the shares slipped to an intraday low of ₹131.9 on the BSE.",
            "pubDate": "2025-08-20T06:45:11.473821"
        },
        {
            "title": "Reliance Jio annual report: Jefferies finds 8 key takeaways",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-jio-annual-report-jefferies-finds-8-key-takeaways/articleshow/123402711.cms",
            "description": "Reliance Jio focuses on 5G expansion, broadband penetration, and enterprise growth. Jio turned free cash flow positive. Revenues from external clients increased significantly. Jefferies notes that tariff interventions are needed to sustain margins. High capitalized costs impact near-term profitability. Jio benefits from 5G adoption and fiber connectivity. The company aims to scale its enterprise business with IoT and AI solutions.",
            "pubDate": "2025-08-20T06:58:01.096597"
        },
        {
            "title": "DMart shares zoom 14% in 7 sessions; analysts see further upside. Check the latest target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dmart-shares-zoom-14-in-7-sessions-analysts-see-further-upside-check-the-latest-target-price/articleshow/123404192.cms",
            "description": "Shares of Avenue Supermarts surged 13.8% in seven sessions, hitting Rs 4,725 after breaking key resistance. Analysts highlight bullish momentum, strong volumes, and support at Rs 4,500. Resistance lies at Rs 4,800, with upside potential toward Rs 4,900–5,250 if momentum sustains above Rs 4,600.",
            "pubDate": "2025-08-20T07:51:44.040553"
        },
        {
            "title": "Is Rs 4 crore enough for retirement corpus? Gurmeet Chadha gives simple calculation metric",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-rs-4-crore-enough-for-retirement-corpus-gurmeet-chadha-gives-simple-calculation-metric/articleshow/123403882.cms",
            "description": "Market expert Gurmeet Chadha simplifies retirement planning with a formula linking financial independence to expenses. He suggests a corpus where 6% annual returns cover monthly costs. For Rs 2 lakh monthly spending, Rs 4 crore suffices. He stresses realistic expense estimation and highlights balancing wealth creation with life enjoyment.",
            "pubDate": "2025-08-20T07:51:44.040679"
        },
        {
            "title": "Despite weak market, 8 microcap stocks attract over 50 MF schemes; 2 deliver stellar returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-weak-market-8-microcap-stocks-attract-over-50-mf-schemes-2-deliver-stellar-returns/slideshow/123403614.cms",
            "description": "Even in the volatile world of microcap investing, mutual funds have shown surprising confidence. Over the past year, the Nifty Microcap Index slipped 3.5%, yet funds continued to bet on select names. As of July 2025, eight microcap companies featured in the portfolios of over 50 mutual fund schemes, signaling institutional conviction despite the weak market. Leading the pack is Gabriel India, which surged 132% in one year and is held by 55 schemes with Rs 2,297 crore invested. Not all stocks, however, matched this performance. Of the eight, four delivered gains between 20% and 130%, while the rest ended in the red — underscoring the divide between lofty expectations and actual outcomes. (Source: ACE Equity)",
            "pubDate": "2025-08-20T07:51:44.040784"
        },
        {
            "title": "Earnings recovery ahead, FY26 could see double-digit growth:Shibani Sircar Kurian",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-recovery-ahead-fy26-could-see-double-digit-growthshibani-sircar-kurian/slideshow/123403339.cms",
            "description": "Shibani Sircar Kurian in an interview to ET Now said that the rural economy is showing encouraging signs of recovery. A favourable monsoon has supported agricultural output, and data indicates that rural demand is steadily rising. She adds that with the festive season approaching, this improvement in consumption is expected to gather more momentum.",
            "pubDate": "2025-08-20T07:51:44.040899"
        },
        {
            "title": "Vijay Kedia-owned SME stock jumps 16% in 2 days as unit eyes Nasdaq IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-owned-sme-stock-jumps-16-in-2-days-as-unit-eyes-nasdaq-ipo/articleshow/123406268.cms",
            "description": "Tac Infosec shares surged following its U.S. subsidiary, CyberScope's, announcement of a planned Nasdaq IPO, a first for an India-listed cybersecurity firm. Veteran investor Vijay Kedia, holding a significant 14.6% stake, has seen his investment appreciate. The stock's performance shows short-term strength but longer-term weakness, with mixed technical indicators.",
            "pubDate": "2025-08-20T09:35:52.644985"
        },
        {
            "title": "China stocks close at 10-year high on fund inflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-close-at-10-year-high-on-fund-inflows/articleshow/123406009.cms",
            "description": "China stocks rose to their highest level since 2015 on Wednesday, extending a rally fuelled by a rotation of funds into equities amid easing trade tensions and Beijing's crackdown on excessive competition.",
            "pubDate": "2025-08-20T09:35:52.645109"
        },
        {
            "title": "Vedanta shares slip 3% after reports of govt objection to demerger, Sebi's warning",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-slip-3-after-reports-of-govts-objection-to-demerger-plan-sebis-warning/articleshow/123405924.cms",
            "description": "Vedanta shares slipped on Wednesday after NCLT deferred its demerger hearing to September 17, following serious objections from the Centre over alleged non-disclosure of key details. Sebi had previously issued a warning, and the Supreme Court rejected the company’s plea on Talwandi Sabo benefits.",
            "pubDate": "2025-08-20T09:35:52.645325"
        },
        {
            "title": "Auto stocks rally 25–50% in FY26 so far: Is it time to shift gears?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-stocks-rally-2550-in-fy26-so-far-is-it-time-to-shift-gears/articleshow/123405246.cms",
            "description": "In FY26 so far, 11 stocks within the BSE Auto Index have delivered double-digit gains, with eight names — such as Hyundai Motor India, Bosch, UNO Minda, Hero MotoCorp, TVS Motor, Ashok Leyland, MRF, and Mahindra & Mahindra — soaring between 25% and 50%.",
            "pubDate": "2025-08-20T09:35:52.645425"
        },
        {
            "title": "GST rate cut: 4 auto stocks which Nomura believes have biggest upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-rate-cut-4-auto-stocks-which-nomura-believes-have-biggest-upside-potential/articleshow/123405038.cms",
            "description": "A potential GST cut on automobiles could spark a rally in auto stocks, with Mahindra & Mahindra, Maruti Suzuki, Ashok Leyland, and TVS Motor seen as key beneficiaries, Nomura said. The brokerage’s scenario analysis suggests upside across all cases, highlighting margin gains and demand boost potential, though Maruti’s near-term outlook remains Neutral pending clarity on the tax cut.",
            "pubDate": "2025-08-20T09:35:52.645525"
        },
        {
            "title": "European equities retreat from 5-month high as tech, defence shares drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-equities-retreat-from-5-month-high-as-tech-defence-shares-drag/articleshow/123404802.cms",
            "description": "European equities slipped on Wednesday, retreating from a five-month closing high in the previous session, after tech stocks tracked dour performances of their Wall Street peers and as the defence sector faced pressure for a second day.",
            "pubDate": "2025-08-20T09:35:52.645616"
        },
        {
            "title": "Japan's Nikkei falls for second day on lower chip shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-for-second-day-on-lower-chip-shares/articleshow/123404760.cms",
            "description": "Japan's Nikkei share average slid for a second day on Wednesday, coming off of record highs, dragged lower by chip-related companies.",
            "pubDate": "2025-08-20T09:35:52.645725"
        },
        {
            "title": "GST rationalization: You don't become irrational; 10 stocks, from two sectors, some may get more, some less, some nothing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-rationalization-you-dont-become-irrational-10-stocks-from-two-sectors-some-may-get-more-some-less-some-nothing/articleshow/123404383.cms",
            "description": "Stocks of some consumer-facing sectors have rallied in the past three days. The reason: A coming cut in GST rates will spur demand. On the face of it, there is nothing wrong with this assumption. The laws of economics say that lower taxes mean lower prices and lower prices mean higher demand. However, take the case of air-conditioners. If prices are cut next month, it does not mean an immediate demand spurt. Yes, it may have an impact by next summer. But if the summer is late and mild like this year, demand will be impacted. So, the impact of any GST rate cut comes with many ifs and buts. Similarly, there are sectors where the response needs to be rational rather than emotional. More than anything else, demand elasticity is the big factor when looking at GST.",
            "pubDate": "2025-08-20T09:35:52.645822"
        },
        {
            "title": "Market Wrap: Sensex rises 213 points, Nifty tops 25,000 in 5-day winning run ahead of US Fed symposium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-rises-213-points-nifty-tops-25000-in-5-day-winning-run-ahead-of-us-fed-symposium/articleshow/123407589.cms",
            "description": "Indian benchmark indices Sensex and Nifty extended their winning streak to a fifth session Wednesday, lifted by IT shares, as investors looked ahead to the Federal Reserve’s Jackson Hole symposium later this week.",
            "pubDate": "2025-08-20T10:35:37.203332"
        },
        {
            "title": "Turnaround Story: 9 stocks shift from loss to profit in June '25 quarter YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/turnaround-story-9-stocks-shift-from-loss-to-profit-in-june-25-quarter-yoy/slideshow/123407406.cms",
            "description": "",
            "pubDate": "2025-08-20T10:35:37.203453"
        },
        {
            "title": "Sebi allows Sanjiv Bhasin to trade again after Rs 1 crore deposit following SAT order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-allows-sanjiv-bhasin-to-trade-again-after-rs-1-crore-deposit-following-sat-order/articleshow/123406786.cms",
            "description": "Sebi has de-frozen Sanjiv Bhasin’s trading and demat accounts after he deposited Rs 1 crore, complying with SAT’s directive. The former IIFL director remains under investigation for alleged stock manipulation involving profit-making trades before media recommendations.",
            "pubDate": "2025-08-20T10:35:37.203563"
        },
        {
            "title": "Focus on core business and ignore the rest: 5 small-caps from different sectors with upside potential of up to 48%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/focus-on-core-business-and-ignore-the-rest-5-small-caps-from-different-sectors-with-upside-potential-of-up-to-48/articleshow/123407020.cms",
            "description": "While the proposed GST rationalization has changed sentiment on the street, it has not changed two things. One: High valuations. Two: Possible headwinds some parts of the economy will face if the tariff tantrum continues. In the last three sessions, sentiment has been pretty much opposite to what it was a couple of weeks back when we were in the midst of the Q1 earnings season. Now, this sentiment may change if there is no progress on the India-US trade talks and the additional tariff is imposed on August 27. So, sentiment can sometimes change faster than President Trump’s mood. But businesses have operating matrices that do not change often. And that is what matters in the long run.",
            "pubDate": "2025-08-20T10:55:40.856734"
        },
        {
            "title": "Maruti Suzuki, Ultratech Cement among 8 stocks that hit 52-week high; rally up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-ultratech-cement-among-8-stocks-that-hit-52-week-high-rally-up-to-25-in-a-month/slideshow/123408565.cms",
            "description": "On Wednesday, the benchmark Sensex rose by approximately 213 points to settle at 81,857. Driven by a broad-based market rally, eight stocks from the BSE 200 index reached their 52-week highs, marking their highest levels in the past year. These breakouts are often viewed by traders and investors as bullish signals, indicating strong upward momentum and the possibility of further gains.",
            "pubDate": "2025-08-20T11:12:11.582359"
        }
    ]
}