{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-18T04:31:49.413587",
    "items": [
        {
            "title": "12 penny stocks rally up to 589% in FY26 so far; 6 turn multibaggers. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-penny-stocks-rally-up-to-589-in-fy26-so-far-6-turn-multibaggers-do-you-own-any/slideshow/126637121.cms",
            "description": "So far in FY26, 12 penny stocks have posted sharp gains, with returns ranging from 40% to as high as 589%. Notably, six of them have emerged as multibaggers. These standout performers were selected based on specific criteria: a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares. This analysis focuses on identifying low-priced, actively traded micro-cap stocks that demonstrate strong upward momentum. (Data Source: ACE Equity).Penny stocks often attract attention due to their low entry price and the potential for explosive growth. But while the rewards can be impressive, the risks are equally high. These stocks typically carry low liquidity, high volatility, and limited financial transparency. Investors should proceed with caution as success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2026-01-18T04:31:47.587207"
        },
        {
            "title": "Top picks: 3 stocks to buy this week that can give returns of up to 19% in short term. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-picks-3-stocks-to-buy-this-week-that-can-give-returns-of-up-to-19-in-short-term-do-you-own-any/slideshow/126636918.cms",
            "description": "As the festival of lights nears, leading brokerages have unveiled their Diwali 2025 smallcap picks, featuring 15 stocks that could shine in the year ahead. With improving domestic demand, policy push for manufacturing, and easing rate outlook, analysts expect select smallcaps to deliver strong returns -- some offering as much as 120% potential upside from current levels.",
            "pubDate": "2026-01-18T04:31:47.587371"
        },
        {
            "title": "Q3 earnings, US-Iran conflict & FII action among 9 factors to move D-St this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q3-earnings-us-iran-conflict-fii-action-among-9-factors-to-move-d-st-this-week/articleshow/126636772.cms",
            "description": "Markets are poised for a volatile week influenced by Q3 earnings, with over 230 companies set to announce results. Geopolitical tensions between the US and Iran are expected to weigh on global sentiment, while FII outflows continue. Technical indicators suggest a consolidative bias with immediate support at 25,550–25,600.",
            "pubDate": "2026-01-18T04:31:47.587478"
        }
    ]
}