{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-24T19:24:09.872779",
    "items": [
        {
            "title": "NTPC Q2 Results: Net profit grows 14% to Rs 5,380 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ntpc-net-profit-grows-14-pc-to-rs-5380-crore-in-jul-sep-qtr/articleshow/114554561.cms",
            "description": "The Board of Directors also approved the first interim dividend of Rs 2.50 on the face value of paid-up equity shares of Rs 10 each for the financial year 2024-25. The date of payment/dispatch of the dividend will be 18 November 2024.",
            "pubDate": "2024-10-24T19:23:48.828992"
        },
        {
            "title": "ITC Q2 Results: PAT grows 3% to Rs 5,078 crore, revenue rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-q2-results-pat-grows-3-to-rs-5078-crore-revenue-rises-16/articleshow/114554416.cms",
            "description": "ITC’s Q2 revenue was ahead of street estimates while net profit was in line with the expectations. Nuvama Institutional Equities said ITC’s cigarette sales volume grew by 3.3% yoy last quarter which too was ahead of street estimates.",
            "pubDate": "2024-10-24T19:23:48.829131"
        },
        {
            "title": "Dixon Tech Q2 Results: Profit skyrockets 265% to Rs 412 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dixon-tech-q2-results-profit-skyrockets-265-to-rs-412-crore/articleshow/114554261.cms",
            "description": "In the second fiscal quarter, Dixon Technologies announced it will divest its entire 50% stake in the joint venture company AIL Dixon to Aditya Infotech through a transfer of 95 lakh equity shares of the JV. The one-time exceptional gain came from this transaction.",
            "pubDate": "2024-10-24T19:23:48.829241"
        },
        {
            "title": "DCB Bank Q2 Results: Profit jumps 23% to Rs 155 crore, NII up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dcb-bank-q2-results-profit-jumps-23-to-rs-155-crore-nii-up-7/articleshow/114553858.cms",
            "description": "While advances grew 19 percent year-on-year and deposit grew 20 percent year-on-year. The bank’s gross non-performing assets ratio as on September30, 2024 was at 3.29 percent compared to 3.36 percent as of end September 2023.",
            "pubDate": "2024-10-24T19:23:48.829346"
        },
        {
            "title": "Suryoday Small Finance Bank Q2 Results: Profit declines 10% to Rs 45 crore on higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/suryoday-small-finance-bank-q2-results-profit-declines-10-to-rs-45-crore-on-higher-provisions/articleshow/114553772.cms",
            "description": "Higher provisions pulled down Suryoday Small Finance Bank's net profit by 10% in the September quarter at Rs 45.4 crore as compared with Rs 50.3 crore in the year-ago period.",
            "pubDate": "2024-10-24T19:23:48.829448"
        },
        {
            "title": "JSW Energy Q2 Results: Net profit up marginally at Rs 853 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-energy-q2-results-net-profit-up-marginally-at-rs-853-crore/articleshow/114552321.cms",
            "description": "JSW Energy on Thursday reported a marginal rise in its consolidated net profit at Rs 853 crore for the September 2024 quarter. \"Profit After Tax (PAT) was up marginally at Rs 853 crore vis-a-vis Rs 850 crore in the same period last year,\" a company statement said",
            "pubDate": "2024-10-24T19:23:48.829551"
        },
        {
            "title": "ITC Q2 Results: Profit rises 2% YoY to Rs 4,993 crore, revenue jumps 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-q2-results-profit-rises-2-yoy-to-rs-4993-crore-revenue-jumps-15/articleshow/114548381.cms",
            "description": "ITC Q2 Results: Revenue from operations grew 15% YoY to Rs 22,282 crore in the reporting period. Profit fell slightly short of ET Now Poll estimates of Rs 5,079 crore, while revenue exceeded expectations. The cigarette-to-hotels conglomerate posted an EBITDA of Rs 6,335 crore for the July-September 2024 quarter, with margins at 32.8%.",
            "pubDate": "2024-10-24T19:23:48.829665"
        },
        {
            "title": "Capital Small Finance Bank Q2 Results: Profit zooms 37% to Rs 33.3 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/capital-small-finance-bank-q2-results-profit-zooms-37-to-rs-33-3-crore/articleshow/114552093.cms",
            "description": "Capital Small Finance Bank reported a 37% rise in net profit at Rs 33.3 crore for the second quarter of the fiscal as against Rs 24.3 crore in the year ago quarter.",
            "pubDate": "2024-10-24T19:23:48.829765"
        },
        {
            "title": "Petronet LNG Q2 Results: Profit rises 4% to Rs 848 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/petronet-lng-q2-results-profit-rises-4-to-rs-848-crore/articleshow/114551172.cms",
            "description": "Revenue also rose 4% to Rs 13,022 crore. The profit, however, fell 26% compared to the April-June quarter as the power sector’s demand for liquefied natural gas (LNG) fell with falling temperatures in the second quarter.",
            "pubDate": "2024-10-24T19:23:48.829865"
        },
        {
            "title": "Indian Energy Exchange Q2 Results: Net profit rises 25% to Rs 108.32 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-energy-exchange-q2-results-net-profit-rises-25-to-rs-108-32-crore/articleshow/114550897.cms",
            "description": "Indian Energy Exchange (IEX) on Thursday posted over 25 per cent rise in consolidated net profit at Rs 108.32 crore for the quarter ended September 30, 2024 compared to the year-ago period mainly due to higher revenues",
            "pubDate": "2024-10-24T19:23:48.829959"
        },
        {
            "title": "United Breweries Q2 Results: Net profit zooms 23% to Rs 132.33 crore, revenue up 13% to Rs 4,743.56 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/united-breweries-q2-results-net-profit-zooms-23-to-rs-132-33-crore-revenue-up-13-to-rs-4743-56-cr/articleshow/114550805.cms",
            "description": "Beer maker United Breweries Ltd on Thursday reported an increase of 23.47 per cent in consolidated net profit at Rs 132.33 crore in the second quarter ended September 30, 2024, on better volumes.",
            "pubDate": "2024-10-24T19:23:48.830056"
        },
        {
            "title": "Radico Khaitan Q2 Results: Net profit rises 24% to Rs 80 crore; revenue up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/radico-khaitan-q2-results-net-profit-rises-24-to-rs-80-crore-revenue-up-9/articleshow/114550459.cms",
            "description": "Liquor maker Radico Khaitan on Thursday reported a 24.41 per cent rise in its consolidated net profit to Rs 80.66 crore for the second quarter ended September 2024, led by growth from its premium segment.",
            "pubDate": "2024-10-24T19:23:48.830157"
        },
        {
            "title": "LT Foods Q2 Results: Profit dips 4% on higher costs despite revenue growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-foods-q2-results-profit-dips-4-on-higher-costs-despite-revenue-growth/articleshow/114550361.cms",
            "description": "LT Foods, owner of basmati rice brands Daawat and Royal, on Thursday reported a 4.22 per cent drop in net profit for the September 2024 quarter as higher expenses offset revenue growth amid global shipping disruptions. The company's consolidated net profit fell to Rs 150.61 crore in the second quarter ended September 30 from Rs 157.26 crore a year earlier, according to a regulatory filing.",
            "pubDate": "2024-10-24T19:23:48.830253"
        },
        {
            "title": "Godrej Consumer Q2 Results: Net profit rises 13% to Rs 491 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/godrej-consumer-q2-results-net-profit-rises-13-to-rs-491-crore/articleshow/114549497.cms",
            "description": "FMCG major Godrej Consumer Products Ltd on Thursday reported a 13.52 per cent rise in its consolidated net profit to Rs 491.31 crore in the September quarter, helped by volume growth in the domestic market and Indonesia.",
            "pubDate": "2024-10-24T19:23:48.830353"
        },
        {
            "title": "Aster DM Healthcare Q2 Results: Co posts net profit of Rs 106 crore vs Rs 15 crore loss YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/aster-dm-healthcare-q2-results-co-posts-net-profit-of-rs-106-crore-vs-rs-15-crore-loss-yoy/articleshow/114549249.cms",
            "description": "Aster DM Healthcare on Thursday reported a consolidated net profit of Rs 106 crore in the September quarter. The company reported a net loss of Rs 15 crore in the July-September quarter of last fiscal.",
            "pubDate": "2024-10-24T19:23:48.830445"
        },
        {
            "title": "Westlife Foodworld Q2 Results: PAT falls 98% to Rs 35.78 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/westlife-foodworld-q2-results-pat-falls-98-to-rs-35-78-lakh/articleshow/114549198.cms",
            "description": "Westlife Foodworld Ltd, owner-operator of McDonald's restaurants across West and South India, on Thursday, reported a 98.4 per cent decline in consolidated profit after tax at Rs 35.78 lakh for the second quarter ended September 2024, impacted by higher expenses and subdued in-store business.",
            "pubDate": "2024-10-24T19:23:48.830536"
        }
    ]
}