{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-29T08:54:13.951233",
    "items": [
        {
            "title": "Q3 results today: ITC, Paytm among 140 companies to report earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-itc-paytm-among-140-companies-to-report-earnings-on-thursday/articleshow/127749980.cms",
            "description": "Indian companies are releasing their December quarter results. ITC expects steady but mixed performance. Swiggy anticipates strong revenue growth but wider losses due to investments. Paytm is projected to report another profitable quarter with healthy revenue and margin expansion. Investors are watching these key announcements closely.",
            "pubDate": "2026-01-29T02:23:20.091614"
        },
        {
            "title": "Canara Bank Q3 Results: Profit rises 26% YoY to Rs 5,155 crore; NII up 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/canara-bank-q3-results-profit-rises-26-yoy-to-rs-5155-crore-nii-up-6/articleshow/127763919.cms",
            "description": "Canara Bank Q3 Results: Canara Bank posted a strong operational performance in the quarter, with operating profit rising 16% year-on-year to Rs 9,119 crore. Business growth remained healthy, as global business, deposits and advances each grew 13%. Credit expansion was driven by retail, agriculture and MSME segments, with retail loans up 31%.",
            "pubDate": "2026-01-29T08:02:16.877797"
        },
        {
            "title": "Adani Power Q3 Results: Cons profit falls 19% YoY to Rs 2,480 crore, revenue down 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-power-q3-results-cons-profit-falls-19-yoy-to-rs-2480-crore-revenue-down-9/articleshow/127766470.cms",
            "description": "Adani Power has announced its December quarter results. The company's consolidated net profit saw a significant 19% increase. This rise in profit is a positive development for the energy giant. However, revenue from operations experienced a slight decrease. Investors will be watching closely for future performance trends.",
            "pubDate": "2026-01-29T08:54:13.230177"
        }
    ]
}