{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-06T14:35:33.354491",
    "items": [
        {
            "title": "Nykaa Q2 Preview: Strong festive demand and margin gains to lift earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-q2-preview-strong-festive-demand-and-margin-gains-to-lift-earnings/articleshow/125124422.cms",
            "description": "Nykaa is expected to post strong Q2FY26 results with 25–27% YoY revenue growth, led by festive demand, robust beauty segment performance, and improving fashion margins. Analysts see EBITDA margin expansion and a sharp profit surge driven by premiumisation, cost control, and improved operating leverage.",
            "pubDate": "2025-11-06T07:11:49.825286"
        },
        {
            "title": "Bajaj Auto Q2 Preview: PAT may rise 16% YoY as exports and premium mix drive gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q2-preview-pat-may-rise-16-yoy-as-exports-and-premium-mix-drive-gains/articleshow/125124315.cms",
            "description": "Bajaj Auto is poised for a strong Q2FY26, with PAT projected to rise 16% year-on-year. This growth is fueled by a significant export recovery, particularly in Africa and Latin America, alongside a richer product mix and favorable currency movements. Despite subdued domestic demand, premium motorcycles and three-wheelers are expected to bolster margins and drive double-digit revenue growth.",
            "pubDate": "2025-11-06T07:11:49.825409"
        },
        {
            "title": "Ola Electric Q2 Results: Cons loss narrows to Rs 418 crore YoY, revenue plunges 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ola-electric-q2-results-cons-loss-narrows-to-rs-418-crore-yoy-revenue-falls-43/articleshow/125123540.cms",
            "description": "Ola Electric Q2 Results:  Ola Electric Mobility reported a narrowed consolidated loss of Rs 418 crore in Q2 FY26, an improvement from Rs 495 crore in the prior year. However, its consolidated revenue from operations saw a significant 43% year-on-year decline, falling to Rs 690 crore from Rs 1,214 crore in Q2 FY25.",
            "pubDate": "2025-11-06T07:11:49.825515"
        },
        {
            "title": "Apollo Hospitals Q2 Results: PAT rises 26% YoY to Rs 477 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-q2-results-pat-rises-26-yoy-to-rs-477-crore/articleshow/125136057.cms",
            "description": "Apollo Hospitals Enterprise reported a strong Q2FY26 with a 26% YoY rise in profit after tax to Rs 477 crore, driven by broad-based growth across healthcare, diagnostics, and digital verticals. Consolidated revenue increased 13% to Rs 6,304 crore, supported by steady patient volumes and margin improvements.",
            "pubDate": "2025-11-06T14:35:31.010503"
        },
        {
            "title": "LIC Q2 Results FY26: Cons PAT jumps 31% YoY to Rs 10,098 crore, net premium income grows 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-q2-results-cons-pat-jumps-31-yoy-to-rs-10098-crore-net-premium-income-grows-5/articleshow/125133025.cms",
            "description": "LIC Q2 Results 2025: Life Insurance Corporation of India (LIC) on Thursday reported a 31% YoY growth in its consolidated Q2 net profit at Rs 10,098 crore versus Rs 7,728 crore in the year ago period.",
            "pubDate": "2025-11-06T14:35:31.010631"
        },
        {
            "title": "Bajaj Housing Q2 Results: PAT jumps 18% YoY to Rs 643 crore, NII up 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-housing-q2-results-pat-jumps-18-yoy-to-rs-643-crore-nii-up-14/articleshow/125132334.cms",
            "description": "Bajaj Housing Finance reported an 18% year-on-year net profit growth to Rs 643 crore in the September-ended quarter, with revenue rising 14% to Rs 2,755 crore. The company saw a 34% jump in net interest income to Rs 956 crore, while Assets Under Management grew 24% to Rs 2.27 lakh crore.",
            "pubDate": "2025-11-06T14:35:31.010737"
        },
        {
            "title": "Trent Q2 Preview: Store expansion to power revenue growth up to 21% YoY. 5 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trent-q2-preview-store-expansion-to-power-revenue-growth-up-to-21-yoy-5-things-to-watch-out-for/articleshow/125131464.cms",
            "description": "Tata Group’s Trent is expected to report 17–21% YoY revenue growth and up to 33% profit rise in Q2, driven by aggressive store expansion across Zudio and Westside formats, cost efficiencies, and steady margins despite festive-driven sequential softness.",
            "pubDate": "2025-11-06T14:35:31.010831"
        }
    ]
}