{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-23T10:54:40.782962",
    "items": [
        {
            "title": "Stock Radar: 30% rally in a month! Inox Green stock hits fresh record high; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-30-rally-in-a-month-inox-green-stock-hits-fresh-record-high-check-target-stop-loss/articleshow/124703086.cms",
            "description": "Inox Green Ltd stock has broken out from a year-long consolidation, reaching new record highs. Experts suggest buying opportunities for short-term traders with targets of Rs 290-300. The stock has shown significant rallies in recent weeks and months. Analysts see a strong uptrend and recommend buying on dips. A protective stop-loss is advised at Rs 242.",
            "pubDate": "2025-10-23T00:42:57.494936"
        },
        {
            "title": "Infosys promoters opt out of Rs 18,000 crore share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-promoters-opt-out-of-rs-18000-crore-share-buyback/articleshow/124750360.cms",
            "description": "Infosys promoters, including co-founders like Narayan Murthy and Nandan Nilekani, will not participate in the company's Rs 18,000 crore share buyback. This decision will lead to a slight increase in their shareholding percentage and could impact their voting rights. The buyback aims to return surplus funds to shareholders and enhance long-term value by reducing the equity base.",
            "pubDate": "2025-10-23T00:42:57.495063"
        },
        {
            "title": "Small finance banks seek doubling of cap on loan size to ₹50 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/small-finance-banks-seek-doubling-of-cap-on-loan-size-to-50-lakh/articleshow/124750325.cms",
            "description": "Small finance banks have approached the Reserve Bank of India with key requests. They want the regulator to ease a rule requiring half their loans to be under ₹25 lakh. They also seek permission to participate in co-lending arrangements. These changes aim to help SFBs expand their reach and serve more businesses, particularly MSMEs.",
            "pubDate": "2025-10-23T00:42:57.495273"
        },
        {
            "title": "ITC Hotels, Swiggy among 7 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-swiggy-among-7-stocks-showing-bullish-rsi-upswing/slideshow/124752144.cms",
            "description": "On October 21, seven stocks in the Nifty500 pack were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. An uptrend signal occurs when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) is rising, suggesting strengthening momentum in the stock’s price. This can signal potential upward movement and help traders identify buying opportunities.",
            "pubDate": "2025-10-23T03:43:40.440784"
        },
        {
            "title": "BEL shares in focus on securing Rs 633 crore order from Cochin Shipyard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-on-securing-rs-633-crore-order-from-cochin-shipyard/articleshow/124752069.cms",
            "description": "Shares of Bharat Electronics Limited (BEL) are expected to draw attention on October 23 following a Rs 633 crore order from Cochin Shipyard Limited. The order, disclosed in a regulatory filing, involves the supply of sensors, weapon systems, fire control systems, and communication equipment, reinforcing BEL’s role in strategic defense manufacturing.",
            "pubDate": "2025-10-23T03:43:40.440917"
        },
        {
            "title": "Ceat and 4 other stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ceat-and-4-other-stocks-witness-5-year-swing-high-breakouts/slideshow/124752042.cms",
            "description": "In the Nifty500 pack, five stocks recorded a 5-year swing high at the close on October 21, suggesting bullishness, according to StockEdge.com’s technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where prices have historically struggled to move beyond. It may be seen as a bullish signal, indicating potential further upward movement. However, this differs from a 5-year breakout, which occurs when a stock’s price surpasses a key resistance level that has held for five years or more.",
            "pubDate": "2025-10-23T03:43:40.441035"
        },
        {
            "title": "FIIs dump Infosys and TCS, but mutual funds make bold contra bets on IT stocks. Who will win?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-dump-infosys-and-tcs-but-mutual-funds-make-bold-contra-bets-on-it-stocks-who-will-win/articleshow/124751548.cms",
            "description": "As FIIs exit India’s IT sector, mutual funds are stepping in. Foreign investors pared stakes in eight of the top 10 IT stocks, including Infosys, TCS, HCL Tech, and Tech Mahindra, during the September quarter. Domestic fund managers, however, bought nine out of ten, with Persistent Systems, Tech Mahindra, and Coforge seeing the sharpest divergence in holdings.",
            "pubDate": "2025-10-23T03:43:40.441145"
        },
        {
            "title": "Infosys shares in focus after promoters opt out of Rs 18,000 crore share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-after-promoters-opt-out-of-rs-18000-crore-share-buyback/articleshow/124751478.cms",
            "description": "Infosys' Rs 18,000 crore share buyback is drawing attention as promoters, including founders, will not participate. This move, offering a 19% premium, will slightly increase promoter stake to 13.37%. The company continues its capital return policy, marking its fourth buyback since 2017, aiming to distribute surplus funds to shareholders.",
            "pubDate": "2025-10-23T03:43:40.441287"
        },
        {
            "title": "Stocks to buy in 2025 for long term: REC, DCB Bank are among 5 stocks that could give 12-39% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-rec-dcb-bank-are-among-5-stocks-that-could-give-12-39-return/slideshow/124751380.cms",
            "description": "Brokerages remain bullish on select financial names, highlighting their strong growth prospects and improving fundamentals.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-23T03:43:40.441392"
        },
        {
            "title": "Tata Motors shares in focus on delivering over 1 lakh vehicles during festive season",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-on-delivering-over-1-lakh-vehicles-during-festive-season/articleshow/124751241.cms",
            "description": "Tata Motors is set for a busy trading day after announcing a significant festive season sales surge. The company delivered over 1 lakh vehicles between Navratri and Diwali, a 33% year-on-year increase, driven by strong demand for its SUV range and electric vehicles. This performance sets a positive tone for the remainder of the fiscal year.",
            "pubDate": "2025-10-23T03:43:40.441492"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/124751196.cms",
            "description": "In the Nifty500 pack, nine stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 21, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-23T03:43:40.441593"
        },
        {
            "title": "Wall Street ends lower on mixed earnings, revived US-China trade tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-on-mixed-earnings-revived-us-china-trade-tensions/articleshow/124751038.cms",
            "description": "Wall Street dipped as mixed earnings, notably Netflix's miss, and potential U.S. export curbs on China-bound tech goods soured investor mood. Tech and communication stocks led the decline. Despite some disappointing corporate results, overall earnings season remains strong, with many companies exceeding expectations, though those faltering face investor impatience.",
            "pubDate": "2025-10-23T03:43:40.441689"
        },
        {
            "title": "Asian stocks decline following choppy US session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-decline-following-choppy-us-session/articleshow/124750479.cms",
            "description": "Asian markets opened lower after a volatile session on Wall Street. Japan and South Korea saw significant drops. Tech stocks faced pressure from company outlooks and earnings. Trade tensions between the US and China resurfaced. Oil prices jumped on new US sanctions. Retail momentum trades experienced sharp losses. US companies are showing strong earnings this quarter.",
            "pubDate": "2025-10-23T03:43:40.441798"
        },
        {
            "title": "GIFT Nifty up 330 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124744457.cms",
            "description": "Muhurat Trading saw cautious optimism as the Sensex rose to 84,600 and Nifty neared 25,900, with IT, banking, auto, and pharma leading gains. Analysts anticipate Nifty improvement from current levels, supported by a forward P/E slightly above its average. The India VIX fell, indicating reduced market fear.",
            "pubDate": "2025-10-23T03:43:40.441896"
        },
        {
            "title": "Stocks in news: HUL, Jain Resource Recycling, Ola Electric, Tata Motors, Torrent Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hul-jain-resource-recycling-ola-electric-tata-motors-torrent-pharma/articleshow/124744404.cms",
            "description": "Indian markets closed marginally higher after a strong start in the Muhurat trading session. Investors are now focused on upcoming earnings, global interest rates, and crude oil prices. Several companies like HUL, Jain Resource Recycling, Ola Electric, Tata Motors PV, and Torrent Pharma are in the spotlight due to significant news developments.",
            "pubDate": "2025-10-23T03:43:40.441996"
        },
        {
            "title": "FYERS becomes first platform to offer SIF to retail investors; will integrate, Quant, Edelweiss, SBI on platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fyers-becomes-first-platform-to-offer-sif-to-retail-investors-will-integrate-quant-edelweiss-sbi-on-platform/articleshow/124759891.cms",
            "description": "Bengaluru-based brokerage FYERS has introduced Specialized Investment Funds (SIFs) on its platform, becoming the first stockbroking platform in India to make these SEBI-regulated products available to retail investors.",
            "pubDate": "2025-10-23T10:54:21.727845"
        },
        {
            "title": "SBI General Insurance surpasses industry growth with 11% rise in H1FY26, GWP at Rs 7,376 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-general-insurance-surpasses-industry-growth-with-11-rise-in-h1fy26-gwp-at-rs-7376-cr/articleshow/124759268.cms",
            "description": "SBI General Insurance reports strong H1 FY26 growth with Rs 7,376 crore GWP, rising market share, robust PAT of Rs 422 crore, improved solvency, and strong performance across health, motor, and personal accident segments.",
            "pubDate": "2025-10-23T10:54:21.728001"
        },
        {
            "title": "FIIs, promoters reduce holdings in 11 smallcaps; prices rise up to 87% in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-promoters-reduce-holdings-in-11-smallcaps-prices-rise-up-to-87-in-fy26/slideshow/124757288.cms",
            "description": "Investors often track promoters and large institutional players like FIIs to gauge market sentiment, and when both begin trimming holdings, it usually warrants attention. In the September quarter, FIIs and promoters reduced stakes in nearly 70 smallcap companies compared to the previous quarter. At first glance, this might appear as a red flag. Yet, in a surprising twist, many of these stocks have delivered strong gains in FY26, with a dozen surging 25%–87% in just the first seven months. (Data Source: ACE Equity)",
            "pubDate": "2025-10-23T10:54:21.728117"
        },
        {
            "title": "RIL shares drop over 2% from day's high on reports of likely halt in oil imports from Russia's Rosneft",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-drop-over-2-from-days-high-on-reports-of-likely-halt-in-oil-imports-from-russias-rosneft/articleshow/124759555.cms",
            "description": "Reliance Industries shares dropped 2.3% from their day's high to Rs 1,448.10 on the NSE following a media report indicating a halt in oil imports from Russian oil major Rosneft. The company's market capitalization also fell below the Rs 20 lakh crore mark amid high trading volumes.",
            "pubDate": "2025-10-23T10:54:21.728230"
        },
        {
            "title": "Vodafone Idea shares surge over 10% in 3 days. What's driving the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-surge-over-10-in-3-days-whats-driving-the-rally/articleshow/124759106.cms",
            "description": "Vodafone Idea shares surged 6.5% to ₹9.01, extending a three-day rally amid optimism over its indigenous 4G-5G rollout and anticipation ahead of the Supreme Court’s AGR case hearing on October 27.",
            "pubDate": "2025-10-23T10:54:21.728339"
        },
        {
            "title": "Gold-stocks jugalbandi: Ruchir Sharma explains why both are booming in a world flooded with liquidity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-stocks-jugalbandi-ruchir-sharma-explains-why-both-are-booming-in-a-world-flooded-with-liquidity/articleshow/124758044.cms",
            "description": "Gold and stocks are simultaneously rallying, a rare phenomenon attributed to a global flood of liquidity from pandemic-era stimulus. This excess money is fueling momentum trades across asset classes, with individual investors increasingly participating. While gold has recently seen a pullback due to profit-taking and easing tensions, equities continue their upward trajectory, driven by strong fundamentals and policy support.",
            "pubDate": "2025-10-23T10:54:21.728446"
        },
        {
            "title": "1,300% rally in 4 days! Wall Street gets new meme stock to rekindle GameStop memories",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/1300-rally-in-4-days-wall-street-gets-new-meme-stock-to-rekindle-gamestop-memories/articleshow/124757862.cms",
            "description": "Beyond Meat shares soared over 1,300% in four days, driven by a social media frenzy reminiscent of GameStop. The rally followed Walmart’s expansion announcement and inclusion in the Roundhill Meme Stock ETF, triggering volatility as short sellers scrambled and retail traders piled in.",
            "pubDate": "2025-10-23T10:54:21.728546"
        },
        {
            "title": "Titan shares jump 2% to new 52-week high following UBS upgrade, target price hike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-shares-jump-2-to-new-52-week-high-following-ubs-upgrade-target-price-hike/articleshow/124757802.cms",
            "description": "Titan shares rose to their 52-week high after UBS upgraded the stock to ‘Buy’ and raised its target to Rs 4,700. The brokerage cited strong brand equity, attractive valuation, strategic pricing, and potential earnings rebound as key drivers for further upside.",
            "pubDate": "2025-10-23T10:54:21.728647"
        },
        {
            "title": "BOJ sees signs of overheating in Japan's stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-sees-signs-of-overheating-in-japans-stock-market/articleshow/124757475.cms",
            "description": "Japan's stock market is showing early signs of overheating, the central bank said on Thursday, warning of the risk that uncertainty over U.S. trade policy could cause sharp corrections and hit financial institutions.",
            "pubDate": "2025-10-23T10:54:21.728750"
        },
        {
            "title": "European shares tick higher on corporate earnings boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-tick-higher-on-corporate-earnings-boost/articleshow/124757301.cms",
            "description": "European shares edged higher on Thursday as a wave of positive corporate earnings boosted sentiment, while investors awaited trade developments between the United States and China.",
            "pubDate": "2025-10-23T10:54:21.728848"
        },
        {
            "title": "For those looking to invest for more than 1 year: 5 large- and mid-caps from different sectors with upside potential of up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-those-looking-to-invest-for-more-than-1-year-5-large-and-mid-caps-from-different-sectors-with-upside-potential-of-up-to-40/articleshow/124757086.cms",
            "description": "In the last few years, there are many stocks whose market capitalisation has moved higher and they can now be classified as large-caps. This includes some recently-listed companies. Take a deeper look at certain aspects of their businesses. You will find some of these stocks are from sectors which are being discovered and are getting re-rated as if they are still mid-cap stocks. Having exposure to them might appear to be risky, but for investors looking to take fresh or more exposure to the stock market, the long runway of growth these sectors have is a positive. And an experienced management is an added plus.",
            "pubDate": "2025-10-23T10:54:21.728970"
        },
        {
            "title": "HUL shares rise 3% as Q2 net profit beats Street estimates; firm declares a dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-rise-3-as-q2-net-profit-beats-street-estimates-firm-declares-a-dividend/articleshow/124757077.cms",
            "description": "Hindustan Unilever shares rose 3% after reporting Q2 FY26 results that beat Street estimates. Consolidated net profit increased 3.6% to Rs 2,685 crore, supported by a one-off tax gain. Revenue grew marginally, EBITDA slightly declined, and the board declared an interim dividend of Rs 19 per share.",
            "pubDate": "2025-10-23T10:54:21.729089"
        },
        {
            "title": "Dixon Technologies shares crack 7% in 4 sessions despite strong Q2. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-shares-crack-7-in-4-sessions-despite-strong-q2-what-should-investors-do/articleshow/124756893.cms",
            "description": "Dixon Technologies’ shares slipped, extending a four-session 7% drop despite reporting strong Q2 results, including a 72% rise in net profit to Rs 670 crore and 29% revenue growth to Rs 14,855 crore.",
            "pubDate": "2025-10-23T10:54:21.729190"
        },
        {
            "title": "F&O Radar| Deploy Broken Wing in Grasim to gain advantage from bullish outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-broken-wing-in-grasim-to-gain-advantage-from-bullish-outlook/articleshow/124756746.cms",
            "description": "Grasim shares trade near Rs 2,900, showing bullish momentum with strong technical support and breakout potential above Rs 2,920. Analysts suggest deploying a Broken Wing Butterfly options strategy to benefit from the upward trend while managing risk and taking advantage of renewed buying interest.",
            "pubDate": "2025-10-23T10:54:21.729286"
        },
        {
            "title": "Japan's Nikkei ends lower on profit-booking from Takaichi rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-on-profit-booking-from-takaichi-rally/articleshow/124755877.cms",
            "description": "On Thursday, Japan's Nikkei index faced a notable decline as investors opted to cash in on profits following a recent surge. The market had earlier benefitted from the optimism surrounding Sanae Takaichi's election as prime minister, but fears regarding US-China trade tensions have dampened the mood.",
            "pubDate": "2025-10-23T10:54:21.729380"
        },
        {
            "title": "Post-Diwali reality check: Are gold and silver prices about to cool off?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/post-diwali-reality-check-are-gold-and-silver-prices-about-to-cool-off/articleshow/124755666.cms",
            "description": "Global gold plunges toward $4,000 while MCX futures rise 2% amid rupee weakness, festive demand, and safe-haven interest; technical indicators signal a corrective phase, with further downside expected.",
            "pubDate": "2025-10-23T10:54:21.729478"
        }
    ]
}