{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-12T00:49:48.709228",
    "items": [
        {
            "title": "After asset quality hit, small finance banks to sharpen risk controls for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-asset-quality-hit-small-finance-banks-to-sharpen-risk-controls-for-2026/articleshow/126473364.cms",
            "description": "Small finance banks are strengthening their risk management. They plan to reduce unsecured loans and boost secured lending like vehicle and housing loans. Credit guarantee schemes will cover more microfinance loans. This strategy aims to prevent asset quality issues. Banks like ESAF, Suryoday, Ujjivan, and Utkarsh are implementing these changes to ensure stability and growth.",
            "pubDate": "2026-01-12T00:49:46.034135"
        },
        {
            "title": "Nifty in a bear hug, needs to break above 26,100 levels: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-in-a-bear-hug-needs-to-break-above-26100-levels-analysts/articleshow/126473318.cms",
            "description": "Indian equity markets face a bearish outlook as the Nifty breaks key supports. Analysts predict further declines, with the Nifty potentially testing the 25,300 to 25,350 levels. Sentiment is unlikely to improve without a strong rebound above 26,100. Investors are advised to adopt a sell-on-rise strategy.",
            "pubDate": "2026-01-12T00:49:46.034261"
        },
        {
            "title": "Stocks in news: TCS, HCL Tech, DMart, ICICI Lombard, RIL, Lemon Tree Hotels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-hcl-tech-dmart-icici-lombard-ril-lemon-tree-hotels/articleshow/126467395.cms",
            "description": "Markets extended their decline on Friday, mirroring weak global cues and disrupting the Nifty's short-term up move. Several companies like TCS, HCL Tech, and RIL are in focus due to Q3 results and significant investment announcements, including Adani Group's Rs 1.5 lakh crore commitment in Kutch.",
            "pubDate": "2026-01-12T00:49:46.034474"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126467426.cms",
            "description": "Indian equity benchmarks extended their losing streak for the fifth consecutive session, closing lower amid weak global cues and geopolitical tensions. Today, Q3 earnings from TCS and HCL Tech will be in focus, alongside potential US trade policy commentary. The market sentiment appears decisively negative, with the India VIX rising.",
            "pubDate": "2026-01-12T00:49:46.034573"
        },
        {
            "title": "Credit demand zooms as policy eases, outstanding bank credit crossed Rs 200 lakh cr for the first time on Dec 31, 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-demand-zooms-as-policy-eases-outstanding-bank-credit-crossed-rs-200-lakh-cr-for-the-first-time-on-dec-31-2025/articleshow/126473384.cms",
            "description": "India's credit demand is surging. Lower taxes and supportive monetary policy are fueling investment. Outstanding bank credit has crossed a major milestone. This growth surpasses projections, indicating a strong economic rebound. Auto loans, small and mid-sized companies, and home loans are key drivers. Investment intentions are translating into spending, creating a positive environment.",
            "pubDate": "2026-01-12T00:49:46.034766"
        }
    ]
}