{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-31T09:27:35.654623",
    "items": [
        {
            "title": "For long-term investors: Trump or tariffs are problems with shelf life; focus on business. 10 large-caps with upside potential of up to 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-long-term-investors-trump-or-tariffs-are-problems-with-shelf-life-focus-on-business-10-large-caps-with-upside-potential-of-up-to-24/articleshow/123609410.cms",
            "description": "Volatility is back on the front page, and you may hear more about it next week. Fresh tariff headlines from the US, a bout of valuation anxiety at home, and the usual chorus of “this time is different” have turned the screens red and the mood bearish. If you’ve been investing in the stock market for more than a few monsoons, though, you’ve watched this movie before. But investing is not like movies which get over in three hours max. Investing is about the underlying value of good businesses which do not get distorted by statements or headline hoggers.",
            "pubDate": "2025-08-31T03:36:33.681427"
        },
        {
            "title": "Pharma sector: Reasons to look at it beyond the tariff exemption. 7 pharma stocks with an upside potential of up to 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-sector-reasons-to-look-at-it-beyond-the-tariff-exemption-7-pharma-stocks-with-an-upside-potential-of-up-to-43/articleshow/123612748.cms",
            "description": "Along with semiconductors, electronics and IT, pharma is another sector exempt from the Trump tariffs. Still, as the broader indices declined after the imposition of two rounds of tariffs, with the latest of 25% kicking in on August 27, pharma stocks have also seen drops over the past month. Now, is this an opportunity, given that the sector is exempt? Perhaps. Because, one does not know what President Trump may do in the future. But the pharma sector merits a closer look for reasons other than being exempt from tariffs. For, in the last 20 years, companies in this sector, because of some inherent advantages, have been able to deliver. And going forward, there is a high probability that these tailwinds will increase.",
            "pubDate": "2025-08-31T08:40:33.089273"
        },
        {
            "title": "Rs 35,000 crore FII selloff in August. Can GST reforms, tariff relief and a strong GDP print turn the tide?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-35000-crore-fii-selloff-in-august-can-gst-reforms-tariff-relief-and-a-strong-gdp-print-turn-the-tide/articleshow/123612943.cms",
            "description": "Foreign institutional investors withdrew Rs 34,993 crore from Indian equities in August, the sharpest monthly selloff of 2025, driven by U.S. tariffs and weak earnings. Financials and IT led sectoral outflows. Despite strong GDP growth at 7.8%, India has slipped in EM fund preferences. Analysts expect GST reforms and policy signals to revive FII sentiment.",
            "pubDate": "2025-08-31T08:40:33.089389"
        },
        {
            "title": "Market Trading Guide: 2 stocks to buy on Monday with up to 13% upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-2-stocks-to-buy-on-monday-with-up-to-13-upside-potential/slideshow/123612878.cms",
            "description": "Indian benchmark indices moved in a tight range on Friday but slipped into the red, weighed down by Reliance Industries (RIL), with HDFC Bank and Infosys adding to the drag. Nifty slipped further below the 100 EMA mark on the daily chart, confirming a deeper bearish trend. Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said that the RSI has entered a bearish crossover, indicating sustained weakness. “In the short term, the trend may remain weak, potentially dragging the Nifty towards the 200 DMA placed at 24,071. On the lower end, support is placed at 24,400/24,150, while on the higher end, resistance is seen at 24,650. A “sell on rise” strategy remains preferable as long as the index stays below 24,850,\" De said.Here are 2 stock recommendations for Monday:",
            "pubDate": "2025-08-31T08:40:33.089488"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-St action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-st-action-on-monday/articleshow/123612567.cms",
            "description": "Indian markets ended lower for a third consecutive session on Friday, dragged by Reliance Industries and concerns over steep U.S. tariffs. The Sensex fell 271 points and Nifty lost 74 points. Weak global cues, bearish technical signals, and cautious sentiment weighed on trading. Heavy turnover was seen in stocks like Ola Electric and RIL, while broader market breadth remained negative.",
            "pubDate": "2025-08-31T08:40:33.089591"
        },
        {
            "title": "These 9 penny stocks plunge up to 25% in just 4 trading sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-penny-stocks-plunge-up-to-25-in-just-4-trading-sessions/slideshow/123612290.cms",
            "description": "In the past week, nine penny stocks witnessed sharp declines ranging from 10% to 25%. These laggards were identified through a screening process that focused on stocks with a market capitalization below ₹1,000 crore, a share price under ₹20, and a minimum recent trading volume of 5 lakh shares. The approach highlights low-priced, actively traded penny stocks that saw significant downside movement. (Data Source: ACE Equity). Note: Due to a market holiday last week, there were only four trading sessions.",
            "pubDate": "2025-08-31T08:40:33.089711"
        },
        {
            "title": "Rs 2.24 lakh crore wiped off from 8 of top-10 most valued firms; Reliance, HDFC Bank lead losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-2-24-lakh-crore-wiped-off-from-8-of-top-10-most-valued-firms-reliance-hdfc-bank-lead-losses/articleshow/123611606.cms",
            "description": "The combined market valuation of eight of the top-10 most valued firms eroded by Rs 2,24,630.45 crore last week, with Reliance Industries and HDFC Bank taking the biggest hit, in-line with a bearish trend in equities.",
            "pubDate": "2025-08-31T08:40:33.089812"
        },
        {
            "title": "Ola Electric shares rally 14% this week. Analysts see Rs 70 on the horizon despite risks. Should you buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-rally-14-this-week-analysts-see-rs-70-on-the-horizon-despite-risks-should-you-buy-now/articleshow/123611121.cms",
            "description": "Ola Electric’s shares surged 14% after securing Production Linked Incentive (PLI) certification for its Gen 3 scooters, boosting margins and profitability prospects. Despite this, market share has slipped amid stiff competition and supply issues. Analysts note healthy technical signals but caution on short-term pullbacks. Ola aims for growth with new models and targets EBITDA breakeven by Q2 FY26.",
            "pubDate": "2025-08-31T08:40:33.089906"
        },
        {
            "title": "GST meeting, expiry shift and auto sales data among 11 factors that’ll steer D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-council-meeting-expiry-shift-and-auto-sales-data-among-11-factors-thatll-steer-d-street-this-week/articleshow/123610747.cms",
            "description": "Indian benchmark indices closed the holiday-shortened week 1.8% lower amid US tariff worries. On Friday, Nifty declined 0.3%, ending at 24,426.85. The new derivatives series began on a muted note, with the market in a corrective phase and Nifty approaching a key support zone of 24,250–24,350, while banking stocks near critical technical support.",
            "pubDate": "2025-08-31T08:40:33.089996"
        },
        {
            "title": "September seasonality favours bears: Nifty down 6 of last 10 years; where to invest now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/september-seasonality-favours-bears-nifty-down-6-of-last-10-years-where-to-invest-now/articleshow/123613693.cms",
            "description": "Nifty seasonality in September has leaned bearish, slipping in six of the past ten years as FII selling weighed on sentiment. Despite steady DII buying in September, volatility persists. Historical performance highlights sector rotation, with a cautious technical view guiding investment strategy for the month.",
            "pubDate": "2025-08-31T09:27:35.049022"
        }
    ]
}