{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-22T11:10:19.871259",
    "items": [
        {
            "title": "Asian shares rise as Japan rallies, dollar gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-rise-as-japan-rallies-dollar-gains/articleshow/124035302.cms",
            "description": "Asian markets saw gains, led by Japan, after its central bank addressed ETF concerns. Australian and South Korean shares also increased. US equity futures showed mixed performance amid H-1B visa fee worries. Trump touted progress on China issues. Wall Street reached new highs, fueled by rate cut prospects. Focus shifts to China's loan rates and upcoming economic data.",
            "pubDate": "2025-09-22T01:43:31.759716"
        },
        {
            "title": "Stocks in news: TCS, Infosys, Wipro, YES Bank, Shipping Corp, GRSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-infosys-wipro-yes-bank-shipping-corp-grse/articleshow/124030421.cms",
            "description": "Indian equities rose for the third week due to positive domestic and global cues, including optimism about India-US trade talks and a potential US Federal Reserve rate cut. However, concerns arose from Trump's H-1B visa policy. YES Bank gained confidence from SMBC's stake purchase, while IT stocks faced pressure. NTPC aims to secure uranium assets, and ONGC plans offshore drilling.",
            "pubDate": "2025-09-22T01:43:31.759838"
        },
        {
            "title": "Can Indian markets sustain their rise despite high valuations and global uncertainties?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-indian-markets-sustain-their-rise-despite-high-valuations-and-global-uncertainties/articleshow/124035226.cms",
            "description": "Despite global economic concerns, Indian stock markets are nearing record highs. Sensex and Nifty are close to peak levels. Domestic liquidity is driving the market. Foreign selling has receded. Investors are cautious due to high valuations and trade tensions. Some investors are shifting towards gold. Market participants are unsure about the sustainability of the rally.",
            "pubDate": "2025-09-22T01:43:31.760049"
        },
        {
            "title": "RBI sets up new panel to update, streamline financial regulations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-sets-up-new-panel-to-update-streamline-financial-regulations/articleshow/124035211.cms",
            "description": "Reserve Bank of India establishes a Regulatory Review Cell. This cell will streamline regulatory changes. It will also quicken the review process. Financial institutions can now flag redundant rules. They can also provide feedback on dated regulations. An advisory group, led by State Bank of India MD Rana Ashutosh Kumar Singh, will channel industry feedback.",
            "pubDate": "2025-09-22T01:43:31.760150"
        },
        {
            "title": "GIFT Nifty down 120 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124030478.cms",
            "description": "Indian equities experienced a slight dip on Friday after a three-day rally, as selling pressure emerged. However, analysts maintain a positive outlook, anticipating a consumption boost from upcoming GST rate cuts and Navratri festivities. The rupee strengthened, while FIIs remained net short in the futures market.",
            "pubDate": "2025-09-22T01:43:31.760248"
        },
        {
            "title": "Nifty faces stiff resistance as US visa concerns weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-faces-stiff-resistance-as-us-visa-concerns-weigh/articleshow/124035107.cms",
            "description": "Nifty extended its winning streak, surpassing a key resistance level, but analysts foresee challenges around 25,500-25,670. Despite potential headwinds from US visa policy changes impacting the IT sector, technical indicators suggest a bullish outlook. Experts advise traders to capitalize on dips, highlighting Samman Capital and Piramal Pharma as potential buys with specific targets and stop-loss levels.",
            "pubDate": "2025-09-22T01:43:31.760344"
        },
        {
            "title": "Will Trump's H-1B visa fee hike sink Indian IT stocks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-trumps-h-1b-visa-fee-hike-sink-indian-it-stocks/articleshow/124035081.cms",
            "description": "Indian IT stocks are expected to face a sell-off following President Trump's increase in H-1B visa costs, potentially impacting profitability and prompting companies to rethink hiring strategies. While larger firms may manage, mid-tier companies heavily reliant on new visas could experience a sharper impact.",
            "pubDate": "2025-09-22T01:43:31.760437"
        },
        {
            "title": "Consumer services, IT, power see sharp FII outflows in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/consumer-services-it-power-see-sharp-fii-outflows-in-september/articleshow/124032126.cms",
            "description": "Foreign investors turned net sellers in the first half of September, offloading shares in consumer services, IT, and power sectors due to concerns over profitability and rising costs. Financial services saw renewed interest, driven by attractive valuations in state-owned lenders. Automobiles, capital goods, and metals & mining also attracted inflows, but overall, foreign investors remained cautious amid global uncertainty.",
            "pubDate": "2025-09-22T01:43:31.760656"
        },
        {
            "title": "Anand Rathi brings second IPO after delivering 1,000% return from wealth business. Can the goodwill work?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anand-rathi-brings-second-ipo-after-delivering-1000-return-from-wealth-business-can-the-goodwill-work/articleshow/124037710.cms",
            "description": "Anand Rathi Group launches its second IPO, Anand Rathi Share and Stock Brokers, after the success of its wealth management company. The wealth arm delivered nearly 1,000% return to investors. The new IPO aims to raise Rs 745 crore. The brokerage arm's revenue and profit have also shown significant growth.",
            "pubDate": "2025-09-22T04:53:46.661940"
        },
        {
            "title": "Trump names Murdochs, Dell, Ellison in potential TikTok US deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-names-murdochs-dell-ellison-in-potential-tiktok-us-deal/slideshow/124037667.cms",
            "description": "President Donald Trump revealed that several prominent U.S. billionaires could be part of a potential deal to take control of TikTok. He named Rupert Murdoch, Lachlan Murdoch, Michael Dell, and Larry Ellison as likely participants, describing them as “American patriots” who would do a great job managing the platform.(Source: AP)",
            "pubDate": "2025-09-22T04:53:46.662066"
        },
        {
            "title": "GK Energy IPO Day 2: Check GMP, subscription status, key details. Should you apply?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gk-energy-ipo-day-2-check-gmp-subscription-status-key-details-should-you-apply/articleshow/124037419.cms",
            "description": "On Day 2, GK Energy IPO is quoting at a 13% grey market premium over its ₹153 issue price, easing from 22% on Day 1.",
            "pubDate": "2025-09-22T04:53:46.662171"
        },
        {
            "title": "Adani Power shares crash 80% in just one day! Is that true?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-crash-80-in-just-one-day-is-that-true/articleshow/124037379.cms",
            "description": "Adani Power shares slipped to Rs 147 on Monday after trading ex-split following a 1:5 stock sub-division. The decline is purely optical, as the overall value of holdings remains unchanged. The company had reported a consolidated June-quarter profit of Rs 8,759 crore, and Morgan Stanley initiated coverage with an overweight rating, projecting a 41.9 GW portfolio by FY32.",
            "pubDate": "2025-09-22T04:53:46.662271"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124037093.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-09-22T04:53:46.662368"
        },
        {
            "title": "GST Bachat Utsav begins but investors have already made money. Is the auto & consumer rally over?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-bachat-utsav-begins-but-investors-have-already-made-money-is-the-auto-consumer-rally-over/articleshow/124037234.cms",
            "description": "The GST Bachat Utsav starts today. Investors in auto and consumer stocks have already profited since the GST reform announcement. Nifty Auto index rose significantly. Maruti Suzuki and Eicher Motors shares increased. Experts suggest that GST rationalization is a structural demand driver. Auto and consumer sectors may still offer opportunities. Focus shifts to FMCG, retail, and auto ancillary stocks.",
            "pubDate": "2025-09-22T04:53:46.662473"
        },
        {
            "title": "Can you afford to buy IT stocks after Trump's H-1B cost? Analyst targets project up to 17% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-you-afford-to-buy-it-stocks-after-trumps-h-1b-cost-analyst-targets-project-up-to-17-upside/slideshow/124037252.cms",
            "description": "IT stocks are back in the spotlight after a turbulent week marked by Trump’s H-1B fee announcement. Despite near-term volatility, average analyst target prices in Trendlyne show decent upsides for leading names such as TCS, Infosys, and HCL Tech, while staying cautious on LTIMindtree.",
            "pubDate": "2025-09-22T04:53:46.662568"
        },
        {
            "title": "Sensex falls over 150 pts, Nifty below 25,300 after US H-1B visa fee shock hits IT stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-cracks-over-300-pts-nifty-below-25300-after-us-visa-fee-shock-hits-it-sector/articleshow/124036849.cms",
            "description": "Indian stocks experienced a decline at the opening on Monday, reversing gains from the previous session. IT stocks were the primary contributors to the downturn, triggered by the U.S.'s significant increase in H-1B visa costs to $100,000.",
            "pubDate": "2025-09-22T04:53:46.662666"
        },
        {
            "title": "Anant Raj among 7 stocks that rose above VWAP on September 19",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anant-raj-among-7-stocks-that-rose-above-vwap-on-september-19/slideshow/124037000.cms",
            "description": "On September 19, the closing prices of seven stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-09-22T04:53:46.662778"
        },
        {
            "title": "HUDCO shares in focus after MoU with NBCC for construction projects",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hudco-shares-in-focus-after-mou-with-nbcc-for-construction-projects/articleshow/124036920.cms",
            "description": "HUDCO shares: HUDCO has signed an MoU with NBCC to execute four construction projects in UP, Haryana, Gujarat, and Delhi, including commercial, institutional, office, and residential developments.",
            "pubDate": "2025-09-22T04:53:46.662875"
        },
        {
            "title": "$100,000 H-1B visa fee shock: How it could hit Indian IT giants & reconfigure tech outsourcing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/100000-h-1b-visa-fee-shock-how-it-could-hit-indian-it-giants-reconfigure-tech-outsourcing/articleshow/124036890.cms",
            "description": "Indian IT companies face a challenge with the new US H-1B visa fee. This fee could impact their profit margins. Companies are planning to adapt by hiring more local workers in the US. They may also shift work to other countries like Canada and India. Analysts remain cautiously optimistic about the sector's ability to adjust.",
            "pubDate": "2025-09-22T04:53:46.662966"
        },
        {
            "title": "Netweb Technologies India shares in focus on order win worth Rs 450 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-india-shares-in-focus-on-order-win-worth-rs-450-crore/articleshow/124036748.cms",
            "description": "Netweb Tech share price: Netweb Technologies secured a Rs 450 crore order for Tyrone AI GPU-accelerated systems, boosting India’s AI infrastructure under the IndiaAI Mission. The company reported 102% revenue growth, 127% EBITDA rise, and a net cash position of Rs 47.5 crore, highlighting strong AI-led expansion.",
            "pubDate": "2025-09-22T04:53:46.663057"
        },
        {
            "title": "Kaynes Tech, Eternal among 8 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-tech-eternal-among-8-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124036802.cms",
            "description": "As of September 19, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-22T04:53:46.663147"
        },
        {
            "title": "TCS, Wipro, Tech Mahindra & other IT stocks plunge up to 6% after Trump's H-1B visa fee hike; Nifty IT index slumps 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-in-focus-after-trumps-h-1b-visa-fee-hike/articleshow/124036707.cms",
            "description": "Indian IT stocks like Tata Consultancy Services and Infosys faced a dip. This happened after the US increased H-1B visa fees. The move sparked concerns about the impact on the IT sector's profitability. Analysts suggest caution and portfolio adjustments. They also advise waiting for company commentary before investing. The sector had recently shown signs of recovery.",
            "pubDate": "2025-09-22T04:53:46.663240"
        },
        {
            "title": "Zydus Lifesciences shares in focus after Ahmedabad oncology unit gets USFDA EIR",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-after-ahmedabad-oncology-unit-gets-usfda-eir/articleshow/124036678.cms",
            "description": "Zydus Lifesciences got a USFDA clearance upgrade for its Ahmedabad oncology plant, moving from OAI to VAI status after a June inspection—a positive signal on compliance.",
            "pubDate": "2025-09-22T04:53:46.663331"
        },
        {
            "title": "South Korean shares hit record high as Samsung Electronics jumps",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-hit-record-high-as-samsung-electronics-jumps/articleshow/124036330.cms",
            "description": "South Korean shares surged to a record high, fueled by investor optimism in the semiconductor industry, particularly benefiting Samsung Electronics and SK Hynix. The KOSPI benchmark rose significantly, driven by expectations of robust chip demand due to the artificial intelligence boom. Investors are closely watching Micron Technology's upcoming earnings for further insights into the sector's outlook.",
            "pubDate": "2025-09-22T04:53:46.663427"
        },
        {
            "title": "Trade truce, weak data shape China’s cautious monetary policy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trade-truce-weak-data-shape-chinas-cautious-monetary-policy/slideshow/124038370.cms",
            "description": "China kept its benchmark lending rates unchanged for the fourth consecutive month in September. This move was in line with market expectations following the central bank’s decision to hold the main policy rate steady last week (Source: Reuters).",
            "pubDate": "2025-09-22T05:42:20.216141"
        },
        {
            "title": "Garden Reach Shipbuilders shares surge 6% after signing 5 new MoUs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/garden-reach-shipbuilders-shares-surge-6-after-signing-5-new-mous/articleshow/124038204.cms",
            "description": "GRSE share price: Garden Reach Shipbuilders & Engineers (GRSE) signed five MoUs with key players in shipbuilding, ports, and infrastructure, targeting green vessels, ship repair, port development, multimodal logistics, and ropeway connectivity. These collaborations aim to boost India’s shipbuilding capacity under the Maritime Amrit Kaal vision.",
            "pubDate": "2025-09-22T05:42:20.216269"
        },
        {
            "title": "Netweb Technologies and 5 other stocks showing bullish White Marubozu signal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-and-5-other-stocks-showing-bullish-white-marubozu-signal/slideshow/124038042.cms",
            "description": "On September 19, in the NSE list of stocks with a market cap of Rs 10,000 crore, six stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-09-22T05:42:20.216379"
        },
        {
            "title": "Stocks to buy this week: Suzlon, Axis Bank, 6 more picks offer potential upside of up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-this-week-suzlon-axis-bank-6-more-picks-offer-potential-upside-of-up-to-28/slideshow/124037909.cms",
            "description": "Nifty ended the previous week with gains of 0.8% but the new week opens with two major triggers -- GST implementation kicks-in and US President Donald Trump's H1 B visa shocker. But Nifty charts show a bull candle with a higher high & higher low signaling continuation of the up move for the third week in a row, says Bajaj Broking, recommending buy on dips. ETMarkets has compiled 8 technical and fundamental stocks to buy this week for a potential upside of 28%. Take a look!",
            "pubDate": "2025-09-22T05:42:20.216506"
        },
        {
            "title": "TIMF Holdings, 360 ONE Funds invest Rs 140 cr in Rubicon Research ahead of IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/timf-holdings-360-one-funds-invest-rs-140-cr-in-rubicon-research-ahead-of-ipo/articleshow/124037808.cms",
            "description": "Rubicon Research secured Rs 140 crore from TIMF Holdings and 360 ONE funds before its IPO. General Atlantic Singapore RR Pte transferred shares in this deal. General Atlantic remains the majority shareholder. The company plans to launch its IPO by the end of this year. Proceeds will be used for debt repayment and acquisitions.",
            "pubDate": "2025-09-22T05:42:20.216616"
        },
        {
            "title": "F&O Radar| Deploy Iron Butterfly Spread in Nifty for gains from expectations of range-bound market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-iron-butterfly-spread-in-nifty-for-gains-from-expectations-of-range-bound-market/articleshow/124039756.cms",
            "description": "Nifty shows mixed signals with bullish weekly trends but short-term profit booking. Preeti K Chabra suggests a neutral Iron Butterfly Spread strategy at 25,350, capitalising on expected range-bound movement, while key supports and Fibonacci levels indicate potential consolidation for medium-term investors.",
            "pubDate": "2025-09-22T06:51:28.677738"
        },
        {
            "title": "Indian IT at crossroads: Cyclical pause or structural shift?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-it-at-crossroads-cyclical-pause-or-structural-shift/articleshow/124039686.cms",
            "description": "Technology services stocks are currently shorted globally. Investors flock to AI themes, overlooking IT services. The IT sector experienced deceleration, while hyperscalers grew. AI adoption is at the Proof of Concept stage. Indian IT has weathered transitions, adapting to new growth paths. AI's impact on IT services is expected to be modest. Enterprises struggle with AI implementation.",
            "pubDate": "2025-09-22T06:51:28.677852"
        },
        {
            "title": "Tech giants advise caution as H-1B fee sparks concern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-giants-advise-caution-as-h-1b-fee-sparks-concern/slideshow/124039490.cms",
            "description": "A new $100,000 fee for H-1B visas in the United States will go into effect. This fee is levied per petition and is a one-time charge. It does not apply to current visa holders re-entering the U.S. (Source: Reuters)",
            "pubDate": "2025-09-22T06:51:28.677951"
        },
        {
            "title": "GST cuts, low inflation to boost festive consumption; insurance emerges as long-term bet: Nitin Raheja, Julius Baer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-cuts-low-inflation-to-boost-festive-consumption-insurance-emerges-as-long-term-bet-nitin-raheja-julius-baer/articleshow/124039633.cms",
            "description": "Nitin Raheja of Julius Baer Wealth Advisors suggests that while GST rate cuts have spurred a rally in consumer stocks, the real impact will unfold long-term, driven by structural tailwinds. The upcoming festive season is crucial for gauging demand recovery, potentially boosting earnings into FY27.",
            "pubDate": "2025-09-22T06:51:28.678074"
        },
        {
            "title": "Rising H-1B costs pose short-term setback, but Indian IT’s long-term edge remains intact: Sandip Agarwal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-h-1b-costs-pose-short-term-setback-but-indian-its-long-term-edge-remains-intact-sandip-agarwal/articleshow/124039266.cms",
            "description": "Indian IT companies face near-term challenges due to increased H-1B visa costs, potentially impacting EBIT by 10%, according to industry veteran Sandip Agarwal. While acknowledging AI disruption and slowing growth, Agarwal anticipates long-term benefits from increased offshoring.",
            "pubDate": "2025-09-22T06:51:28.678179"
        },
        {
            "title": "Adani Green Energy shares surge 13% in 2 sessions. Jefferies forecasts 27% upside, here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-energy-shares-surge-13-in-2-sessions-jefferies-forecasts-27-upside-heres-why/articleshow/124039198.cms",
            "description": "Adani Green Energy's shares surged following SEBI's clearance regarding Hindenburg Research's allegations, boosting investor confidence. Jefferies raised the target price to Rs 1,300, citing significant upside potential and projecting substantial capacity additions. Supported by promoter infusion and long-term power purchase agreements, the company anticipates improved financial metrics and strong EBITDA growth, despite potential risks like execution delays.",
            "pubDate": "2025-09-22T06:51:28.678271"
        },
        {
            "title": "Adani Enterprises shares rally 9% in 2 days. Jefferies sees 15% upside, here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-shares-rally-9-in-2-days-jefferies-sees-15-upside-heres-why/articleshow/124038948.cms",
            "description": "Adani Enterprises shares are up following Sebi's clearance of stock manipulation allegations. This boosted investor confidence. Jefferies maintains a Buy rating, citing growth drivers like the Navi Mumbai International Airport. Green energy expansion also adds momentum. The regulatory clearance comes after Hindenburg's report triggered a sell-off. Despite the rally, the stock is still down over the past year.",
            "pubDate": "2025-09-22T06:51:28.678366"
        },
        {
            "title": "Quantum AMC’s Christy Mathai sees tailwinds for largecaps, bets on financials & IT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/quantum-amcs-christy-mathai-sees-tailwinds-for-largecaps-bets-on-financials-it/articleshow/124038518.cms",
            "description": "Quantum AMC’s Christy Mathai expects stronger earnings momentum for large-cap stocks, driven by GST cuts, tax reliefs, and improving liquidity. She favours financials, IT, and auto sectors, highlighting disciplined investing in well-governed companies trading below intrinsic value for long-term compounding.",
            "pubDate": "2025-09-22T06:51:28.678458"
        },
        {
            "title": "H-1B Fee Hike: IT sector braces for short-term margin pressure, says Kunal Bajaj",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/h-1b-fee-hike-it-sector-braces-for-short-term-margin-pressure-says-kunal-bajaj/articleshow/124040474.cms",
            "description": "India's IT sector faces challenges due to a steep H-1B visa fee hike, potentially impacting margins by 50-100 basis points and EPS by 2-4%. However, the industry's shift towards local hiring, offshore delivery, and the rise of Global Capability Centers (GCCs) are expected to mitigate the long-term effects. Larger firms like TCS and Infosys are better positioned to adapt.",
            "pubDate": "2025-09-22T07:32:12.489199"
        },
        {
            "title": "GQG sells Adani Power shares to SBI Fund, Citadel Securities in $250 million deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gqg-sells-adani-power-shares-to-sbi-fund-citadel-securities-in-250-million-deal/articleshow/124040321.cms",
            "description": "SBI Funds Management and Citadel Securities purchased Adani Power shares from GQG Partners in a significant deal. GQG Partners sold approximately 35 million shares. SBI Mutual acquired the majority of these shares. The sale occurred at a price range of 610 to 625 rupees per share. Adani Power's stock experienced a surge following this transaction.",
            "pubDate": "2025-09-22T07:32:12.489324"
        },
        {
            "title": "10 IPOs in a single day! GMPs reveal where big money could flow on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-ipos-in-a-single-day-gmps-reveal-where-big-money-could-flow-on-tuesday/slideshow/124040149.cms",
            "description": "September 23 will be one of the busiest days for India’s primary market, with 10 IPOs opening on the same day across mainboard and SME platforms. Grey market premiums (GMPs) already point to a few winners, giving investors early cues on where sentiment is strongest.",
            "pubDate": "2025-09-22T07:32:12.489433"
        },
        {
            "title": "Technical picks: Sammaan Capital among 3 stocks to buy for up to 13% return in short team",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-sammaan-capital-among-3-stocks-to-buy-for-up-to-13-return-in-short-team/slideshow/124039941.cms",
            "description": "Markets slipped on Friday after recent gains, ending marginally lower as profit-taking took center stage. With major events now behind us, the focus will shift to sectors likely to benefit from the recently announced GST reforms as the festive season begins. Additionally, any change in stance from FIIs in the cash market following the recent Fed rate cut will be closely monitored.",
            "pubDate": "2025-09-22T07:32:12.489531"
        },
        {
            "title": "Pace Digitek announces price band for its Rs 819 crore IPO. Check dates and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pace-digitek-announces-price-band-for-its-rs-819-crore-ipo-check-dates-and-other-details/articleshow/124046630.cms",
            "description": "Pace Digitek’s upcoming IPO, priced at Rs 208–219 per share, will raise Rs 819 crore to fund capital expenditure and corporate needs. The multi-sector company operates in telecom, energy, and ICT, with Bengaluru manufacturing units. FY25 profit rose 21%, supported by strong operations and diverse solutions across industries.",
            "pubDate": "2025-09-22T11:10:05.270560"
        },
        {
            "title": "IT stocks foot Rs 82,600 crore bill for $100,000 H-1B visa. Time to sell?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-foot-rs-82600-crore-bill-for-100000-h-1b-visa-time-to-sell/articleshow/124046524.cms",
            "description": "Indian IT stocks plunged up to 5% after Donald Trump hiked H-1B visa fees to $100,000, erasing Rs 82,600 crore market value. Analysts warn margin pressure, rising wages, and profitability risks could deepen challenges for software exporters.",
            "pubDate": "2025-09-22T11:10:05.270697"
        },
        {
            "title": "Retail trimmed, FIIs & MFs stepped in: 8 stocks surged up to 80% in Q2 so far — Are you in or out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-trimmed-fiis-amp-mfs-stepped-in-8-stocks-surged-up-to-80-in-q2-so-far-are-you-in-or-out/slideshow/124043751.cms",
            "description": "This year, the stock market saw an interesting twist — retail investors quietly stepped back, while large institutional investors stepped in, setting the stage for significant gains. During the June 2025 quarter, retail investors trimmed their exposure across several stocks compared to March. At the same time, Foreign Institutional Investors (FIIs) and Mutual Funds (MFs) didn’t hesitate as they decisively increased their positions in the same counters.About 157 stocks with a market cap over Rs 2,000 crore showed reduced retail holdings in Q1FY26, while institutional ownership quietly climbed. About 43 companies have already delivered strong double-digit price returns in the September quarter so far (July–September), and eight stocks in particular have skyrocketed 40–80% in the mentioned time period. (Data Source: ACE Equity)",
            "pubDate": "2025-09-22T11:10:05.270809"
        },
        {
            "title": "Swiggy needs $500 million fundraise, says JM Financial after downgrading stock to ‘Reduce’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-needs-500-million-fundraise-says-jm-financial-after-downgrading-stock-to-reduce/articleshow/124046366.cms",
            "description": "Swiggy shares fell 2.7% after JM Financial downgraded the stock to Reduce, citing a weakening balance sheet and rising competition in quick commerce. Despite revenue growth, cash reserves are declining, and Instamart faces expansion challenges. The brokerage advises a $500 million fundraise, with limited near-term upside for shareholders.",
            "pubDate": "2025-09-22T11:10:05.270915"
        },
        {
            "title": "India’s capex story stuck in neutral despite growth push: Jahangir Aziz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-capex-story-stuck-in-neutral-despite-growth-push-jahangir-aziz/articleshow/124046249.cms",
            "description": "Even as India’s economy shows strong signs of resilience on the back of consumption, government spending, and support from the Reserve Bank of India, concerns around capital expenditure (capex) remain unresolved. Jahangir Aziz, a noted economist, believes the problem runs far deeper than short-term cyclical issues.",
            "pubDate": "2025-09-22T11:10:05.271015"
        },
        {
            "title": "Market Wrap: Sensex drops 466 points, Nifty slips below 25,250 as U.S. visa fee hike hits IT stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-drops-466-points-nifty-slips-below-25250-as-u-s-visa-fee-hike-hits-it-stocks/articleshow/124045290.cms",
            "description": "Indian benchmark indices Sensex and Nifty retreated for a second session on Monday, with IT shares leading losses after United States sharply increased the one-time fee for H-1B visas to $100,000, delivering a fresh blow to a sector that had only just begun to stabilize.",
            "pubDate": "2025-09-22T11:10:05.271119"
        },
        {
            "title": "Tariff war clouds global growth as US faces legal and economic crossroads",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-war-clouds-global-growth-as-us-faces-legal-and-economic-crossroads/articleshow/124044458.cms",
            "description": "Global trade uncertainty persists as US tariffs face a Supreme Court ruling that could upend existing deals. Jahangir Aziz warns hidden economic pressures, inflation, and slowing consumption may emerge once tech strength fades.",
            "pubDate": "2025-09-22T11:10:05.271243"
        },
        {
            "title": "1.7 lakh crore boom in 2 days! Adani Group stocks market cap crosses Rs 15 lakh crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/1-7-lakh-crore-boom-in-2-days-adani-group-stocks-market-cap-crosses-rs-15-lakh-crore/articleshow/124043249.cms",
            "description": "Adani Group stocks added Rs 1.7 lakh crore to their combined market cap in two days, crossing Rs 15 lakh crore after Sebi cleared the Hindenburg allegations. Adani Power, Total Gas, Green Energy, and Energy Solutions led gains, with analysts now focusing on fundamentals and long-term growth prospects.",
            "pubDate": "2025-09-22T11:10:05.271343"
        },
        {
            "title": "Urban Company shares surge 9% amid high trading volume, extend rally to 86% over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-surge-9-amid-high-trading-volume-extend-rally-to-86-over-ipo-price/articleshow/124042949.cms",
            "description": "Urban Company shares jumped 9% intraday, taking gains to 86% over the issue price since listing. Analysts see it as a strong long-term structural story, citing leadership in online home services and robust investor demand, but advise a cautious “hold” or “wait and watch” approach.",
            "pubDate": "2025-09-22T11:10:05.271439"
        },
        {
            "title": "Adani Power shares rally 20% after first-ever stock split: 5 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-rally-20-after-first-ever-stock-split-5-reasons-why/articleshow/124042799.cms",
            "description": "Adani Power shares jumped 20% as they turned ex-split on Monday, after a 1:5 stock split aimed at boosting retail participation and liquidity. The move increases the number of shares without changing overall value or market cap.",
            "pubDate": "2025-09-22T11:10:05.271539"
        },
        {
            "title": "Ethanol push puts sugar industry in spotlight, says Sudip Bandyopadhyay",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ethanol-push-puts-sugar-industry-in-spotlight-says-sudip-bandyopadhyay/articleshow/124041782.cms",
            "description": "The sugar sector is back in focus as ethanol blending drives optimism. Experts say despite volatility from government policies and price controls, long-term investors could benefit. Eid Parry remains a preferred pick, offering exposure to Coromandel International and the sector’s structural growth story.",
            "pubDate": "2025-09-22T11:10:05.271644"
        },
        {
            "title": "Japan's Nikkei ends higher as concerns over BOJ's ETF sales ease",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-higher-as-concerns-over-bojs-etf-sales-ease/articleshow/124041576.cms",
            "description": "Japan's Nikkei ended nearly 1% higher on Monday, rebounding after a volatile last session, as concerns eased over the impact of the Bank of Japan's decision to sell its holdings of riskier assets.",
            "pubDate": "2025-09-22T11:10:05.271737"
        },
        {
            "title": "European shares flat as tech gains counter automaker losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-flat-as-tech-gains-counter-automaker-losses/articleshow/124041522.cms",
            "description": "European shares held steady on Monday as losses in automakers offset rising technology stocks, while investors awaited comments from a slew of Federal Reserve officials later in the day.",
            "pubDate": "2025-09-22T11:10:05.271828"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of up to 31% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-up-to-31-in-1-year/articleshow/124041401.cms",
            "description": "Till now, it was only goods that were under President Trump’s scanner. The H1-B visa fee hike, however, suggests he is ready to create trouble for service providers as well. To what extent, remains to be seen. While the visa issue will certainly be a headache for Indian IT companies, it is not exactly an existential threat. This may well impact the market, but the tailwind created by the lower GST rates, too, will have its impact. Again, to what extent, remains to be seen. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-09-22T11:10:05.271921"
        },
        {
            "title": "TCS or Infosys? Which IT company has the highest share of H-1B visa employees",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-or-infosys-which-it-company-has-the-highest-share-of-h-1b-visa-employees/articleshow/124041031.cms",
            "description": "Trump’s $100,000 H-1B fee will make sending Indian IT engineers to the US costly, hitting firms like Infosys, TCS, and Hexaware, which rely heavily on H-1B employees for US revenue.",
            "pubDate": "2025-09-22T11:10:05.272020"
        }
    ]
}