{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-14T17:12:17.971450",
    "items": [
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/117242675.cms",
            "description": "Indian headline indices broke a four-session losing streak due to gains in banks and auto stocks, despite pressure on IT stocks. The December CPI inflation eased to a four-month low, contributing to the positive market sentiment. Analysts highlighted the formation of a bullish Harami Cross pattern on the Nifty chart.",
            "pubDate": "2025-01-14T17:11:59.733136"
        },
        {
            "title": "Adani Energy Q3 Update: Co wins projects worth Rs 28,455 cr. Under-construction project pipeline at Rs 54,700 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-energy-q3-update-co-wins-projects-worth-rs-28455-cr-under-construction-project-pipeline-at-rs-54700-cr/articleshow/117242282.cms",
            "description": "Adani Energy Solutions secured transmission projects worth Rs 28,455 crore in the quarter ended December 31, 2024. This increased the company's under-construction project pipeline to Rs 54,700 crore. The company also reported a 3% year-on-year rise in total units sold for its distribution subsidiary AEML and significant progress in its smart metering business.",
            "pubDate": "2025-01-14T17:11:59.733269"
        },
        {
            "title": "Market Trading Guide: Maruti Suzuki, SBI Life are among 4 stock recommendations for Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-maruti-suzuki-sbi-life-are-among-4-stock-recommendations-for-wednesday/slideshow/117239048.cms",
            "description": "Indian frontline indices broke their four-session losing streak after banks and auto stocks chipped in to be counted following massive selling pressure in IT stocks. The mood was upbeat also because the December CPI inflation eased to its four-month low of 5.22%. While the S&P BSE Sensex settled at 76,499.63, gaining by 169.62 points or 0.22%, the broader Nifty closed at 23,176.05, higher by 90.10 points or 0.39%.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities called the day's trade as choppy as he decoded the Nifty chart highlighting the formation of a bullish Harami Cross pattern. \"A bullish Harami pattern, especially after a significant correction, often signals a potential short-term recovery. The Nifty appears positive for the short term as long as it remains above 23,135. On the upside, it could move towards 23,400, and a decisive move above 23,400 may lead to higher levels,\" De said.",
            "pubDate": "2025-01-14T17:11:59.733376"
        },
        {
            "title": "Profitable growth will be crucial for Mobikwik stock to keep ticking",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/profitable-growth-will-be-crucial-for-mobikwik-stock-to-keep-ticking/articleshow/117241687.cms",
            "description": "One MobiKwik's stock dropped by nearly 13% after reporting increased customer acquisition costs, fixed costs, and user incentives, resulting in net losses for the second straight quarter. The company saw growth in GMV and users but faces challenges in maintaining profitability, alongside an inflated stock price since its listing.",
            "pubDate": "2025-01-14T17:11:59.733478"
        },
        {
            "title": "US stocks rise after softer-than-expected producer price data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-after-softer-than-expected-producer-price-data/articleshow/117241303.cms",
            "description": "Wall Street indexes increased as the producer inflation report came in softer than expected. Investors believe this could impact the Federal Reserve's monetary policy this year. Gains were led by consumer discretionary stocks. Key upcoming events include the consumer price index report and quarterly earnings from major banks. Trump's potential policies may also influence future market trends.",
            "pubDate": "2025-01-14T17:11:59.733580"
        },
        {
            "title": "Sebi proposes mandatory dematerialisation of securities in case of stock split, consolidation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-mandatory-dematerialisation-of-securities-in-case-of-stock-split-consolidation/articleshow/117239498.cms",
            "description": "If an investor lacks a demat account, the issuer company will be obligated to open a separate demat account with a suitable ownership ledger (suspense escrow account) to manage such securities. This move aims to amend the existing SEBI (LODR) Regulations, 2015, according to the market regulator's proposal.",
            "pubDate": "2025-01-14T17:11:59.733678"
        },
        {
            "title": "Tech View: 23,350 key hurdle for Nifty; weak trend persists. How to trade on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-23350-key-hurdle-for-nifty-weak-trend-persists-how-to-trade-on-wednesday/articleshow/117239463.cms",
            "description": "The daily chart continues to display a negative pattern with lower tops and bottoms, indicating a potentially further downward trend. The current upside bounce could lead to another lower-top formation in the short term. If Nifty moves higher, it could face a strong resistance at the recent down gap from January 13 around the 23,350 levels. According to Nagaraj Shetti of HDFC Securities, the near-term trend remains weak, and the bounce could present a sell-on-rise opportunity near 23,350, with immediate support at 23,050 levels.",
            "pubDate": "2025-01-14T17:11:59.733776"
        },
        {
            "title": "Two Sharp with ET: Sensex ends losing streak, Rupee hits record low, China’s export curbs strain EVs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-sensex-ends-losing-streak-rupee-hits-record-low-chinas-export-curbs-strain-evs/videoshow/117238958.cms",
            "description": "This episode of \"Two Sharp with ET\" covers three key developments. After consecutive losses, Sensex finally breaks its losing streak, closing in the green. Midcaps see strong buying, led by PSU Banks, Metals, and Auto stocks. The Indian Rupee slides to a historic low of ₹86.63/USD, driven by strong crude prices, weak FII inflows, and a robust Dollar Index. India's electronics, solar, and EV sectors face disruptions as China restricts exports of high-tech machinery. Nisha Poddar explains.",
            "pubDate": "2025-01-14T17:11:59.733895"
        },
        {
            "title": "Breakout Stocks: How to trade Adani Power, Adani Energy and Adani Total Gas on Wednesday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-adani-power-adani-energy-and-adani-total-gas-on-wednesday/slideshow/117238028.cms",
            "description": "The Indian market closed in the green on Tuesday after falling for 4 consecutive sessions in a row. The BSE Sensex rose more than 160 points while the Nifty50 closed above 23,100 levels.",
            "pubDate": "2025-01-14T17:11:59.733994"
        },
        {
            "title": "PSU bank stocks rally up to 18%. What's the good news?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-bank-stocks-rally-up-to-18-whats-the-good-news/articleshow/117235952.cms",
            "description": "Punjab & Sind Bank, Indian Overseas Bank, UCO Bank, Central Bank, and Bank of Maharashtra have received approval to raise Rs 2,000 crore each, with fund-raising starting in small tranches from Q4, ET Now reported. Additionally, the government has directed DIPAM to divest stakes in five PSU banks through the offer-for-sale route.",
            "pubDate": "2025-01-14T17:11:59.734095"
        },
        {
            "title": "Sandeep Tandon on critical short-term events that may impact market sentiments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sandeep-tandon-on-critical-short-term-events-that-may-impact-market-sentiments/slideshow/117235281.cms",
            "description": "Sandeep Tandon believes stocks that were once favourites like Bajaj Finance, Divi’s, Reliance, and Aditya Birla Group could make a comeback in the next rally. This raises the question: What will happen to current market leaders such as PSUs, energy, and capex stocks?",
            "pubDate": "2025-01-14T17:11:59.734191"
        },
        {
            "title": "Adani Ports, Bharti Airtel among 5 key additions to Bernstein India model portfolio; HDFC Bank, RIL excluded",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-bharti-airtel-among-5-key-additions-to-bernstein-india-model-portfolio-hdfc-bank-ril-excluded/slideshow/117234664.cms",
            "description": "Brokerage firm Bernstein has made key changes to its India model portfolio, adding five new stocks and removing four. Among the prominent additions are Adani Ports, Bharti Airtel, and IndusInd Bank, while HDFC Bank and Reliance Industries have been excluded.",
            "pubDate": "2025-01-14T17:11:59.734286"
        },
        {
            "title": "Market Wrap: D-Street breaks 4-day losing streak, Sensex ends 169 points up, Nifty above 23,150",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-street-breaks-4-day-losing-streaks-sensex-ends-169-points-up-nifty-above-23100/articleshow/117234329.cms",
            "description": "After a 4-day losing streak, Indian benchmark indices turned positive on Tuesday, supported by PSU Banks, metals, and auto stocks. The Sensex and Nifty rose marginally, with the Nifty PSU Bank and Metal indices surging while the IT sector lagged.",
            "pubDate": "2025-01-14T17:11:59.734386"
        },
        {
            "title": "LIC, MRF among 4 large & mid-cap stocks that hit 52-week lows on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-mrf-among-4-large-mid-cap-stocks-that-hit-52-week-lows-on-tuesday/slideshow/117234273.cms",
            "description": "Indian equity benchmarks rose on Tuesday after closing at seven-month lows in the previous session amid a sharp fall in the rupee and worries over domestic earnings. However, four large and mid-cap stocks from the Nifty 500 index hit 52-week lows. Here’s the list:",
            "pubDate": "2025-01-14T17:11:59.734478"
        },
        {
            "title": "Be bullish, but apply more macro checks and balances: 6 mid-cap stocks from different sectors with an upside potential of up to 49%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/be-bullish-but-apply-more-macro-checks-and-balances-6-mid-cap-stocks-from-different-sectors-with-an-upside-potential-of-up-to-49/articleshow/117233462.cms",
            "description": "This is a corrective phase sparked by fears of a slowdown in earnings. And it is now accompanied by two major headwinds: One, rising oil prices; and two, higher US bond yields. In this scenario, you can well question the logic of looking at mid-caps stocks. So ask yourself this question: Will all the things bothering the market change the business outlook of the company whose stock you want to buy? Consider this: For oil companies that import oil and sell only in the domestic market, the rising rupee is an issue. But for oil companies that import oil, refine it, and then export it, it is much less of an issue. So, while the markets are volatile, try to understand the dynamics of the businesses underlying stocks and decide accordingly.",
            "pubDate": "2025-01-14T17:11:59.734569"
        },
        {
            "title": "European shares gain some ground as government bond yields ease",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-gain-some-ground-as-government-bond-yields-ease/articleshow/117232919.cms",
            "description": "European shares rebound after two days of losses, led by gains in automobile and mining stocks. The pan-European STOXX 600 index rose 0.6%. French Prime Minister Francois Bayrou's speech on pension reforms is the key event of the day. JD Sports Fashion and BP faced declines due to lower profit forecast and refining margins.",
            "pubDate": "2025-01-14T17:11:59.734659"
        }
    ]
}