{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-12T09:33:07.649752",
    "items": [
        {
            "title": "Why did Bajaj Finserv's stock plunge despite an increase in Q2 profit?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/why-did-bajaj-finservs-stock-plunge-despite-an-increase-in-q2-profit/articleshow/125262376.cms",
            "description": "Bajaj Finserv reported a 8% rise in Q2 net profit to ₹2,244 crore, but its lending arm, Bajaj Finance, saw its stock slump over 6%. This decline was triggered by a cautious outlook for future expansion and increased credit costs. Bajaj Finance also moderated its FY26 growth forecast. Meanwhile, Bajaj Allianz General Insurance posted a 5% profit increase.",
            "pubDate": "2025-11-12T03:49:10.931841"
        },
        {
            "title": "Hero MotoCorp Q2 Preview: Festive demand, richer product mix could drive 16% profit growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hero-motocorp-q2-preview-festive-demand-richer-product-mix-could-drive-16-profit-growth/articleshow/125270094.cms",
            "description": "Hero MotoCorp is expected to post strong Q2 results, driven by festive demand, volume recovery, and a richer product mix. Brokerages project double-digit growth in revenue and profit, aided by higher ASPs, stable input costs, and improved margins. Analysts remain upbeat on Hero’s festive momentum and EV strategy.",
            "pubDate": "2025-11-12T09:33:06.046687"
        },
        {
            "title": "Info Edge Q2 Results: Cons PAT soars 1,260% YoY to Rs 316 crore on one-time gain, revenue rises 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/info-edge-q2-results-cons-pat-soars-1260-yoy-to-rs-316-crore-on-one-time-gain-revenue-rises-15/articleshow/125269999.cms",
            "description": "Info Edge reported a 7% sequential growth in PAT to Rs 296 crore for Q1FY26, with topline up 2%. The company's standalone revenue increased 14% YoY to Rs 746 crore in Q2FY26, driven by steady billing growth across its recruitment and non-recruitment businesses. Operating profit rose 6.5% YoY to Rs 268 crore.",
            "pubDate": "2025-11-12T09:33:06.046815"
        }
    ]
}