{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-25T05:46:28.461204",
    "items": [
        {
            "title": "Chemical companies may post 5-10% revenue growth in Q1 amid tariff concerns, weaker rupee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/chemical-companies-to-post-5-10-revenue-growth-in-q1-amid-tariff-concerns-weaker-rupee/articleshow/122892007.cms",
            "description": "Chemical companies are projected to experience revenue growth of 5-10% in the June 2025 quarter, fueled by increased order intake anticipating US tariffs and a weaker rupee boosting exports. Lower raw material prices are expected to protect margins. However, Chinese competition and geopolitical risks create a complex environment, with investors closely monitoring volume sustainability and pricing power.",
            "pubDate": "2025-07-25T03:09:52.359942"
        },
        {
            "title": "Bajaj Finance net up 22% in Q1, but provisions rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finance-net-up-22-in-q1-but-provisions-rise/articleshow/122891962.cms",
            "description": "Bajaj Finance reported a 22% surge in standalone net profit, reaching ₹4,133 crore for the June quarter, driven by robust loan growth. Despite this, provisions for bad loans increased by 24% to ₹2,078 crore, reflecting a slight weakening in asset quality. Anup Saha's resignation as managing director, just three months after his appointment, adds to the recent developments.",
            "pubDate": "2025-07-25T03:09:52.360080"
        },
        {
            "title": "Intel Earnings: Chipmaker to cut jobs as Q3 loss forecast deepens",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/intel-earnings-chipmaker-to-cut-jobs-as-q3-loss-forecast-deepens/articleshow/122896728.cms",
            "description": "Intel plans to reduce its workforce to 75,000 by year-end, a significant decrease from 99,500 in 2024, causing shares to jump despite a projected steeper third-quarter loss. While sales are expected to surpass estimates, CEO Lip-Bu Tan is leading a turnaround, focusing on new chipmaking processes and streamlining operations. The company's second-quarter revenue was flat, ending a sales decline streak.",
            "pubDate": "2025-07-25T05:46:27.724931"
        }
    ]
}