{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-27T04:11:57.238498",
    "items": [
        {
            "title": "Be contrarian: Just ‘hold’ the right stocks & outlive Trump. 11 stocks from different sectors which fit the bill for a long-term investor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/be-contrarian-just-hold-the-right-stocks-outlive-trump-11-stocks-from-different-sectors-which-fit-the-bill-for-a-long-term-investor/articleshow/124174403.cms",
            "description": "For all those rattled by volatility, here’s a history lesson. 2008: The global financial crisis crushes risk assets. 2013: The “taper tantrum” punishes emerging market currencies and equities; domestic panic about current account deficits and inflation make quality stocks look dangerous. Late 2016: Demonetization. March 2020: Covid slams markets in weeks. 2022: Ukraine war triggers another bout of fear. The pattern is clear: Shocks arrive, stock prices wobble, strong businesses adjust, and time repairs the damage. The bottom line: Crises create noise, but strong businesses not only survive, but grow. And investors who hold on to good stocks are the ones who make money.",
            "pubDate": "2025-09-27T03:35:05.338684"
        },
        {
            "title": "Pharma Index Down 2%, but Selloff could be an 'Exaggeration'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-index-down-2-but-selloff-could-be-an-exaggeration/articleshow/124176271.cms",
            "description": "Nifty's Pharma index saw a decline after US President Trump announced a 100 percent tariff on branded drugs from October 1. Analysts noted India's limited exposure to patented drugs in the US market. Most Indian firms focus on generic medicines, which are not affected by the new tariff. Major Indian players also operate manufacturing facilities within the United States.",
            "pubDate": "2025-09-27T04:11:54.214979"
        },
        {
            "title": "Bears capture spooked D-Street for 6th session running",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bears-capture-spooked-d-street-for-6th-session-running/articleshow/124176223.cms",
            "description": "Indian equity indices extended their longest losing streak in FY26 for a sixth consecutive session, driven by new US tariffs on drugs and trucks, increased H-1B visa fees, and Accenture's cautious outlook. This battered investor sentiment, leading to broad-based selling across sectors and a surging fear gauge. The rupee also traded near its record low.",
            "pubDate": "2025-09-27T04:11:54.215098"
        },
        {
            "title": "US stocks end higher after as-expected inflation data; S&P 500, Nasdaq post weekly declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-ends-higher-after-as-expected-inflation-data-sp-500-nasdaq-post-weekly-declines/articleshow/124176133.cms",
            "description": "US stocks closed higher Friday on expected inflation data, yet posted weekly losses, ending winning streaks for S&P 500 and Nasdaq. Investors are weighing the Federal Reserve's future rate cuts against a stronger economy and upcoming earnings season. New tariffs and mixed signals from Fed officials added to market uncertainty, with key employment data due next week.",
            "pubDate": "2025-09-27T04:11:54.215305"
        },
        {
            "title": "Wall Street Week Ahead: Investors look to jobs data to support rate-cut path, pricey stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-look-to-jobs-data-to-support-rate-cut-path-pricey-stock-market/articleshow/124176113.cms",
            "description": "Next week's U.S. jobs data holds significance for markets. It needs to indicate a cooling labor market. This supports further interest rate cuts. It must not trigger recession concerns. The Federal Reserve plans more rate reductions this year. High stock valuations create market vulnerability. A potential government shutdown also looms.",
            "pubDate": "2025-09-27T04:11:54.215398"
        }
    ]
}