{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-17T03:13:59.955038",
    "items": [
        {
            "title": "RBL Bank among 4 F&O stocks with sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-among-4-fo-stocks-with-sharp-rise-in-futures-open-interest/slideshow/124619144.cms",
            "description": "As of October 16, nine stocks in the NSE F&O pack saw a notable surge in futures open interest, contributing to a total increase of over 11% compared with the previous trade. A significant rise in futures open interest indicates substantial growth in the number of active, unexpired futures contracts for a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions in the futures market.",
            "pubDate": "2025-10-17T03:13:37.546448"
        },
        {
            "title": "BLS International, Cyient and 3 others close above VWAP, hinting at bullish trend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bls-international-cyient-and-3-others-close-above-vwap-hinting-at-bullish-trend/slideshow/124619057.cms",
            "description": "On October 16, the closing prices of five stocks in the Nifty500 pack rallied over 1.5% relative to their VWAP (Volume Weighted Average Price), according to StockEdge.com’s technical scan data. A shift above the VWAP suggests a potential bullish trend.When the closing price rises above the VWAP, it indicates that the stock closed higher than the average price at which it traded throughout the day, with the average weighted by trading volume. This is often interpreted by traders and investors as a bullish signal, potentially reflecting positive market sentiment.",
            "pubDate": "2025-10-17T03:13:37.546632"
        },
        {
            "title": "Oberoi Realty and 7 other stocks show bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oberoi-realty-and-7-other-stocks-show-bullish-rsi-upswing/slideshow/124618888.cms",
            "description": "On October 16, eight stocks from the Nifty200 pack that gained over 2% were featured in the RSI Trending Up scan, based on data from StockEdge.com.An uptrend signal is generated when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) values are rising, suggesting strengthening momentum in a stock’s price. This can point to potential upward movement and may help traders identify buying opportunities.",
            "pubDate": "2025-10-17T03:13:37.546772"
        },
        {
            "title": "Infosys shares in focus after Q2 PAT jumps 13% YoY, ADRs fall 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-after-q2-pat-jumps-13-yoy-adrs-fall-2/articleshow/124618738.cms",
            "description": "Infosys reported a 13% YoY increase in net profit to Rs 7,364 crore for Q2 FY26, with revenue rising 9% YoY to Rs 44,490 crore. The IT major also declared an interim dividend of Rs 23 per share and revised its FY26 revenue guidance upwards. Brokerage firm Nuvama maintained a 'Buy' rating, citing strong revenue growth in constant currency terms.",
            "pubDate": "2025-10-17T03:13:37.546915"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/124618653.cms",
            "description": "In the Nifty500 pack, 11 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 16, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-17T03:13:37.547054"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Bharat Dynamics, Axis Bank among 5 stocks that could give 11-32% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-bharat-dynamics-axis-bank-among-5-stocks-that-could-give-11-32-return/slideshow/124618599.cms",
            "description": "Brokerages have turned optimistic on select stocks across sectors, highlighting robust growth prospects, strong earnings visibility, and expanding market opportunities.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-17T03:13:37.547150"
        },
        {
            "title": "Zee Entertainment shares in focus after Q2 PAT plunges 63% YoY, Nuvama revises target downwards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zee-entertainment-shares-in-focus-after-q2-pat-plunges-63-yoy-nuvama-revises-target-downwards/articleshow/124618535.cms",
            "description": "Zee Entertainment Enterprises announced its second-quarter financial results for FY26. The company saw a significant drop in net profit and revenue. Advertising revenue declined due to reduced spending. Subscription revenue showed growth. Brokerage firm Nuvama revised the stock's target price downwards. Earnings per share estimates were also cut.",
            "pubDate": "2025-10-17T03:13:37.547237"
        },
        {
            "title": "Anantam Highways InvIT IPO: GMP flat ahead of Friday debut despite decent subscription",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anantam-highways-invit-ipo-gmp-flat-ahead-of-friday-debut-despite-decent-subscription/articleshow/124618510.cms",
            "description": "Anantam Highways InvIT is set to list today. The grey market shows no premium, suggesting a listing near its issue price. The Rs 400 crore issue saw strong demand, subscribed 5.62 times. Investors are drawn to its stable road projects and yield potential. Proceeds will aid debt repayment. Post-listing performance hinges on yield distribution and financial disclosures.",
            "pubDate": "2025-10-17T03:13:37.547326"
        },
        {
            "title": "Sihora Industries IPO listing today: No GMP buzz ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sihora-industries-ipo-listing-today-no-gmp-buzz-ahead-of-debut/articleshow/124618499.cms",
            "description": "Sihora Industries' debut on the BSE SME platform is met with a flat grey market premium, indicating a listing near its issue price of Rs 66. The Rs 10.56 crore IPO saw lukewarm investor response, subscribed only 1.27 times overall.",
            "pubDate": "2025-10-17T03:13:37.547413"
        },
        {
            "title": "Shlokka Dyes shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shlokka-dyes-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/124618480.cms",
            "description": "Shlokka Dyes is set to list on the BSE SME platform. The grey market suggests a flat debut, with the stock expected to trade near its issue price. The company's Rs 57.79 crore IPO saw muted investor interest. Shlokka Dyes manufactures reactive dyes and pigments for various industries. Its financials show strong growth.",
            "pubDate": "2025-10-17T03:13:37.547501"
        },
        {
            "title": "Last day to buy Tech Mahindra shares before record date for Rs 15 interim dividend. Check all details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-tech-mahindra-shares-before-record-date-for-rs-15-interim-dividend-check-all-details/articleshow/124618455.cms",
            "description": "Investors seeking Tech Mahindra's interim dividend must buy shares by today, October 17. The company declared a dividend of Rs 15 per share. Eligibility is determined by the record date of October 21, 2025. The dividend payment is scheduled for November 12, 2025. Rama Phosphates also offers an interim dividend with a similar ex-dividend date.",
            "pubDate": "2025-10-17T03:13:37.547609"
        },
        {
            "title": "SK Minerals IPO: Grey market signals 4% gain ahead of Friday listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sk-minerals-ipo-grey-market-signals-4-gain-ahead-of-friday-listing/articleshow/124618431.cms",
            "description": "SK Minerals and Additives is set to list on the BSE SME platform on Friday. The stock shows a 4% grey market premium, suggesting a mild listing gain. The company's IPO saw decent investor participation, with strong demand from non-institutional investors. SK Minerals manufactures industrial minerals and specialty chemicals.",
            "pubDate": "2025-10-17T03:13:37.547706"
        },
        {
            "title": "Asian shares dip after credit woes hit Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-dip-after-credit-woes-hit-wall-street/articleshow/124617994.cms",
            "description": "Asian shares declined Friday as US bank bad loans and credit market concerns dampened investor sentiment. Gold and silver hit record highs amid US economic fears and US-China tensions. The Bank of Japan signaled continued tightening, while the White House is set to ease auto tariffs.",
            "pubDate": "2025-10-17T03:13:37.547795"
        },
        {
            "title": "GIFT Nifty down 25 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124610625.cms",
            "description": "Indian equities surged on Thursday, with Nifty advancing 262 points, driven by expectations of a domestic earnings rebound and renewed foreign inflows. The broad-based rally was supported by strong Q2 results and improving sentiment, with analysts anticipating further upward movement as the earnings season progresses.",
            "pubDate": "2025-10-17T03:13:37.547888"
        },
        {
            "title": "Stocks in news: RIL, Infosys, Wipro, Jio Financial, Tata Steel",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-infosys-wipro-jio-financial-tata-steel/articleshow/124610560.cms",
            "description": "Indian markets saw a strong rally on Thursday, with the Nifty 50 surpassing 25,600, driven by domestic earnings recovery optimism and positive global cues. Key companies like RIL, Infosys, and Wipro reported their second-quarter results, influencing trading activity. Analysts suggest a \"buy on dips\" strategy amidst sectoral rotation.",
            "pubDate": "2025-10-17T03:13:37.548114"
        },
        {
            "title": "Fitch upgrades outlook on IIFL Finance to positive",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fitch-upgrades-outlook-on-iifl-finance-to-positive/articleshow/124617869.cms",
            "description": "Fitch Ratings has upgraded IIFL Finance's outlook to positive from stable, affirming its 'B+' senior secured debt rating. The agency anticipates improvements in the company's credit profile over the next two years, including asset quality and funding diversity, following the lifting of RBI restrictions on gold loans.",
            "pubDate": "2025-10-17T03:13:37.548196"
        }
    ]
}