{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-29T00:59:48.215366",
    "items": [
        {
            "title": "Stocks in news: PNB, IndiGo, Sigachi Industries, Coal India, Coforge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-pnb-indigo-sigachi-industries-coal-india-coforge/articleshow/126222281.cms",
            "description": "Indian markets saw a slight dip, continuing their consolidation phase. Trading activity remained subdued due to low volumes. However, specific company news is creating opportunities. PNB reported a large fraud. IndiGo's market share decreased. Coal India appointed a new CEO. Vedanta received a conditional nod for drilling. Sigachi Industries' MD and CEO was remanded.",
            "pubDate": "2025-12-29T00:59:39.977223"
        },
        {
            "title": "Global stocks hold near record, silver at all-time high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-hold-near-record-silver-at-all-time-high/articleshow/126222247.cms",
            "description": "Global stocks hovered near record highs amid light trading, while silver surged to a new peak, extending a historic year-end rally. Equities saw gains in Australia, with modest declines anticipated in Japan. Investors are closely watching AI trends and Federal Reserve interest rate decisions for future market direction.",
            "pubDate": "2025-12-29T00:59:39.977358"
        },
        {
            "title": "Will Encora acquisition cement Coforge’s AI leadership in healthcare and hi-tech?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-encora-acquisition-cement-coforges-ai-leadership-in-healthcare-and-hi-tech/articleshow/126222169.cms",
            "description": "Coforge is acquiring California-based Encora for $2.35 billion, bolstering its AI capabilities in healthcare and hi-tech, and expanding its US market presence. This strategic move aims to position Coforge for future growth, with the combined entity projected to significantly increase revenue and potentially become India's seventh-largest software exporter.",
            "pubDate": "2025-12-29T00:59:39.977572"
        },
        {
            "title": "Nifty faces 26,200 hurdle; indicators flag uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-faces-26200-hurdle-indicators-flag-uncertainty/articleshow/126222095.cms",
            "description": "Nifty 50 is consolidating near all-time highs, facing resistance at 26,200, indicating near-term indecision. Analysts suggest range-bound trade with sector-specific opportunities, while Bank Nifty shows signs of potential profit-booking. Experts recommend specific stock bets like Lupin and Varun Beverages for potential gains.",
            "pubDate": "2025-12-29T00:59:39.977676"
        },
        {
            "title": "Bandhan Bank sells Rs 3,212 crore microfinance bad loans to ARCIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bandhan-bank-sells-rs-3212-crore-microfinance-bad-loans-to-arcil/articleshow/126222128.cms",
            "description": "Bandhan Bank has sold a ₹3,212 crore microfinance non-performing loan portfolio to ARCIL for ₹578 crore. This sale followed a Swiss Challenge process. The bank also initiated a process to sell an additional ₹3,720 crore in loans. These actions come as the bank's asset quality faced pressure from the microfinance segment.",
            "pubDate": "2025-12-29T00:59:39.977872"
        },
        {
            "title": "Finance ministry to take a relook at crop insurance plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/finance-ministry-to-take-a-relook-at-crop-insurance-plan/articleshow/126222120.cms",
            "description": "The finance ministry is reviewing the Pradhan Mantri Fasal Bima Yojana's cup-and-cap model. This comes as crop insurance business declines, with premium collections expected to fall significantly. Large states are shifting to the cup-and-cap model, which limits insurer risk and profitability. The review aims to ensure the scheme's long-term sustainability and effective farmer coverage.",
            "pubDate": "2025-12-29T00:59:39.977964"
        },
        {
            "title": "Banks urge RBI to extend trade relief measures beyond December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-urge-rbi-to-extend-trade-relief-measures-beyond-december/articleshow/126222033.cms",
            "description": "Banks are asking the Reserve Bank of India for more time on loan relief for exporters. The current scheme ends this month. Exporters face ongoing challenges from global trade issues. Banks believe the real impact of these issues will be seen next quarter. An extension would offer a crucial safety net for exporters.",
            "pubDate": "2025-12-29T00:59:39.978064"
        }
    ]
}