{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-13T03:18:20.872056",
    "items": [
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126494969.cms",
            "description": "Indian equity benchmarks rebounded from Monday's lows, closing in positive territory. Analysts anticipate a sideways market with stock-specific movements as the earnings season commences. The Nifty faces resistance around 26000-26100, with support at 25650, while India VIX saw a 4% increase.",
            "pubDate": "2026-01-13T01:41:19.109729"
        },
        {
            "title": "Stocks in news: TCS, HCL Tech, Ola Electric, RIL, Just Dial",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-hcl-tech-ola-electric-ril-just-dial/articleshow/126494943.cms",
            "description": "Markets closed positively despite volatility, with IT majors TCS and HCL Tech reporting profit declines in their December quarter results. Ola Electric launched its first battery energy storage system, Shakti, while Indian Hotels secured trademark registration for the 'Taj' sonic sound. L&T will fully acquire L&T Sapura Shipping, and Reliance Industries confirmed its battery storage manufacturing plans remain on track.",
            "pubDate": "2026-01-13T01:41:19.109860"
        },
        {
            "title": "Asian shares rise on valuations, dollar declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-rise-on-valuations-dollar-declines/articleshow/126494912.cms",
            "description": "Asian shares surged to near record highs, outperforming the S&P 500 as investors shifted focus beyond US markets due to cheaper valuations and unpredictable US foreign policy. Concerns over the Federal Reserve's independence and upcoming US inflation data present key risks this week.",
            "pubDate": "2026-01-13T01:41:19.109990"
        },
        {
            "title": "Domestic markets bounce back after US ambassador calms trade jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/domestic-markets-bounce-back-after-us-ambassador-calms-trade-jitters/articleshow/126494860.cms",
            "description": "Indian stock markets bounced back on Monday, ending a five-day decline. This recovery followed assurances from the US ambassador regarding upcoming trade discussions. Markets had previously fallen due to concerns over potential US tariffs. The Nifty and Sensex both saw gains, recovering from earlier lows. Analysts suggest ongoing trade talks and the upcoming budget will influence market direction.",
            "pubDate": "2026-01-13T01:41:19.110099"
        },
        {
            "title": "Bajaj Housing raises Rs 509 crore via NCDs at 7.10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-raises-rs-509-crore-via-ncds-at-7-10/articleshow/126494762.cms",
            "description": "Bajaj Housing Finance has successfully raised ₹509 crore through non-convertible debentures. This move follows a period of strong business growth for the company. Their assets under management saw a significant increase of 23% year-on-year. The mortgage lender also reported a substantial rise in disbursements during the third quarter, indicating robust performance and expansion in their operations.",
            "pubDate": "2026-01-13T01:41:19.110204"
        },
        {
            "title": "NSE shares surge after IPO clouds seem to clear",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-shares-surge-after-ipo-clouds-seem-to-clear/articleshow/126494736.cms",
            "description": "National Stock Exchange shares climbed past ₹2,000. This surge followed SEBI chief's comments on an upcoming IPO clearance. Investor interest has rekindled. NSE shares saw increased demand and trading volumes. The exchange's IPO is expected soon. This development has boosted sentiment for the unlisted stock.",
            "pubDate": "2026-01-13T01:41:19.110301"
        },
        {
            "title": "'India can be global AI use case capital': MeitY secy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-can-be-global-ai-use-case-capital-meity-secy/articleshow/126494754.cms",
            "description": "India is set to become a global hub for AI applications. The country will foster its own AI infrastructure, including large language models and data centers. This initiative aligns with the goal of democratizing AI resources. India's role as a trusted partner in value chains is recognized. Discussions on global AI policy will take place at an upcoming summit.",
            "pubDate": "2026-01-13T01:41:19.110492"
        },
        {
            "title": "Banks bank on cash recyclers in new ATM cycle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-bank-on-cash-recyclers-in-new-atm-cycle/articleshow/126494796.cms",
            "description": "Indian banks are set to deploy nearly 17,350 ATMs in the coming months. A significant majority of these will be advanced cash recyclers. This move signals a shift towards modern technology for better efficiency and lower costs. Banks are prioritizing smarter machines that reduce cash handling needs and improve service availability.",
            "pubDate": "2026-01-13T01:41:19.110587"
        },
        {
            "title": "Shriram-MUFG deal may test rules on non-compete fee for promoters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-mufg-deal-may-test-rules-on-non-compete-fee-for-promoters/articleshow/126494747.cms",
            "description": "The non-compete payment —amounting nearly 5% of the deal value—is intended to prevent Shriram Ownership Trust (SOT), the promoter entity, from launching a rival lending business under the Shriram brand or any other name.",
            "pubDate": "2026-01-13T01:41:19.110683"
        },
        {
            "title": "Distribution costs weigh on value of insurance products",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/distribution-costs-weigh-on-value-of-insurance-products/articleshow/126494800.cms",
            "description": "Insurance product value is shrinking due to high commissions and operating expenses. Experts highlight concerns with credit-linked life, non-linked, motor third-party, and retail health policies. Despite tax reforms, these costs impact customer returns. Industry growth has stagnated while expenses climb. A committee is now examining distribution costs.",
            "pubDate": "2026-01-13T01:41:19.110778"
        },
        {
            "title": "IFCI, IREDA among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ifci-ireda-among-5-stocks-showing-bullish-rsi-upswing/slideshow/126495937.cms",
            "description": "On January 12, five stocks from the Nifty500 universe featured in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from lower levels is considered an uptrend signal, reflecting strengthening price momentum and growing bullish interest, often tracked by traders to spot potential buying opportunities.",
            "pubDate": "2026-01-13T03:18:13.962543"
        },
        {
            "title": "Anand Rathi shares in focus as Q3 net profit jumps 30% to Rs 100 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anand-rathi-shares-in-focus-as-q3-net-profit-jumps-30-to-rs-100-crore/articleshow/126495830.cms",
            "description": "Anand Rathi Wealth shares are in focus after a strong December quarter. The company reported a 30% rise in net profit to Rs 100 crore and a 25% jump in revenue to Rs 306 crore. Assets Under Management grew 30% to Rs 99,008 crore. The firm added new clients and saw healthy inflows, demonstrating steady growth.",
            "pubDate": "2026-01-13T03:18:13.962654"
        },
        {
            "title": "China examines foreign ETF trades after Jane Street India probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-examines-foreign-etf-trades-after-jane-street-india-probe/articleshow/126495827.cms",
            "description": "China is examining how foreign firms like Jane Street Group operate in its large ETF market. Regulators want to understand trading activities. This comes after India accused Jane Street of market manipulation. UBS has paused some trades from Jane Street. China's stock market is sensitive to performance. Foreign firms are increasingly active in China's growing ETF sector.",
            "pubDate": "2026-01-13T03:18:13.962748"
        },
        {
            "title": "Positive Breakout: These 14 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-14-stocks-cross-above-their-200-dmas/slideshow/126495314.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1000 crore, 14 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on January 12, 2026, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2026-01-13T03:18:13.962851"
        },
        {
            "title": "Stocks to buy in 2026: Lemon Tree, Avenue Supermarts among 5 stocks that could give 14-30% return in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-lemon-tree-avenue-supermarts-among-5-stocks-that-could-give-14-30-return-in-long-term/slideshow/126495266.cms",
            "description": "Brokerages remain constructive on select Indian stocks, highlighting opportunities across retail, IT services, power, hospitality, and energy trading amid evolving market conditions.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-13T03:18:13.962947"
        },
        {
            "title": "Kotak Mahindra Bank 5:1 stock split: What shareholders need to know before ex-date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-51-stock-split-what-shareholders-need-to-know-before-ex-date/articleshow/126495192.cms",
            "description": "Kotak Mahindra Bank shareholders must buy shares by today to benefit from the upcoming 5:1 stock split. The bank has set January 14, 2026, as the record date. This move will increase share count fivefold, adjusting the price per share proportionally. Additionally, Anup Kumar Saha joins as Whole-time Director, bringing extensive experience in consumer banking and digital transformation.",
            "pubDate": "2026-01-13T03:18:13.963047"
        }
    ]
}