{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-01T05:14:29.182565",
    "items": [
        {
            "title": "IndusInd Q3 profit falls 39% on higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-q3-profit-falls-39-on-higher-provisions/articleshow/117808285.cms",
            "description": "The bank's provisions increased 87% to ₹1,744 crore as gross non performing assets (NPA) rose to 2.25% in the quarter ended December 2024, from 1.92% in the same time a year ago. Net NPA was at 0.68%, from 0.57% a year ago.",
            "pubDate": "2025-02-01T05:14:09.904894"
        },
        {
            "title": "ONGC Q3 profit drops 17% on lower oil prices; standalone oil & gas production up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ongc-q3-profit-drops-17-on-lower-oil-prices-standalone-oil-gas-production-up/articleshow/117797230.cms",
            "description": "Oil and Natural Gas Corp (ONGC) has reported a 17% decline in third-quarter profit on a drop in oil prices and higher depreciation.",
            "pubDate": "2025-02-01T05:14:09.905013"
        },
        {
            "title": "Karnataka Bank Q3 results: Profit falls 14% to Rs 284 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/karnataka-bank-q3-results-profit-falls-14-to-rs-284-crore/articleshow/117795321.cms",
            "description": "Karnataka Bank’s Q3 net profit declined 14.3% YoY to ₹284 crore due to lower earnings. Operating profit fell 20%, while net interest margin dropped to 3.02%. Asset quality improved as NPAs reduced, and advances grew 11.6% YoY.",
            "pubDate": "2025-02-01T05:14:09.905124"
        },
        {
            "title": "ONGC Q3 Results: Cons PAT falls 19% YoY to Rs 8,622 crore; Rs 5 per share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ongc-q3-results-cons-pat-falls-19-yoy-to-rs-8622-crore-rs-5-per-share-dividend-announced/articleshow/117794623.cms",
            "description": "ONGC Q3 Results: Oil & Natural Gas Commission (ONGC) on Friday reported a 19% year-on-year fall in its December quarter consolidated net profit at Rs 8,622 crore versus Rs 10,703 crore posted in the year ago period. It was below ET Now poll of Rs 9,700 crore.",
            "pubDate": "2025-02-01T05:14:09.905223"
        },
        {
            "title": "Equitas Small Finance Bank Q3 Results: Profit down 67% to Rs 66 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/equitas-small-finance-bank-q3-results-profit-down-67-to-rs-66-crore/articleshow/117794631.cms",
            "description": "Higher provisions pulled Equitas Small Finance Bank's third quarter net profit down 67% at Rs 66 crore as against Rs 202 crore in the year-ago period.",
            "pubDate": "2025-02-01T05:14:09.905324"
        },
        {
            "title": "Bandhan Bank Q3 Results: PAT slumps 42% to 426 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bandhan-bank-q3-results-pat-slumps-42-to-426-crore/articleshow/117794586.cms",
            "description": "Bandhan Bank Q3 Results: Bandhan Bank’s Q3 net profit fell 42% YoY to ₹426 crore due to higher provisions and expenses. Fresh slippages in microfinance increased, though bad loan write-offs helped reduce NPA ratios. Operating profit rose 22%, but provisions surged 101%.",
            "pubDate": "2025-02-01T05:14:09.905421"
        },
        {
            "title": "Sun Pharma net profit jumps 15% to Rs 2,903 crore in Q3FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sun-pharma-net-profit-jumps-15-to-rs-2903-crore-in-q3fy25/articleshow/117791129.cms",
            "description": "Sun Pharma's Q3FY25 net profit rose 15% YoY to ₹2,903 crore, driven by strong domestic and global specialty sales. Revenue grew 10.5%, while EBITDA surged 15.3% with improved margins. The company faces ongoing legal proceedings in the U.S.",
            "pubDate": "2025-02-01T05:14:09.905515"
        },
        {
            "title": "IndusInd Bank Q3 Results: Standalone PAT declines 39% YoY to Rs 1,401 crore, but beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-q3-results-pat-jumps-39-yoy-to-rs-1401-crore-beats-estimates/articleshow/117786578.cms",
            "description": "IndusInd Bank Q3 Results: IndusInd Bank's Q3FY25 interest earnings rose 11% YoY to Rs 12,801 crore. Net interest income stood at Rs 5,228 crore, down from Rs 5,296 crore in Q3FY24. Net interest margins declined to 3.93% from 4.29% in Q3FY24 and 4.08% in Q2FY25.",
            "pubDate": "2025-02-01T05:14:09.905613"
        },
        {
            "title": "Sun Pharma Q3 Results: PAT advances 15% YoY to Rs 2,903 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sun-pharma-q3-results-pat-advances-15-yoy-to-rs-2903-crore-beats-estimates/articleshow/117784712.cms",
            "description": "Sun Pharma Q3 Results: The company has also declared an interim dividend of Rs 10.5 per share for the financial year 2024-25.",
            "pubDate": "2025-02-01T05:14:09.905707"
        },
        {
            "title": "Upstox FY24 revenue up 25% to Rs 1,311 crore, net profit at Rs 190 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/upstox-fy24-revenue-up-25-to-rs-1311-crore-net-profit-at-rs-190-crore/articleshow/117808702.cms",
            "description": "Upstox competes with the likes of Groww and Zerodha. It had around 2.8 million active traders as of November 2024, according to data from the National Stock Exchange. Overall, the company said it has around 170 million registered users, with 85% coming from tier-two and -three locations.",
            "pubDate": "2025-02-01T05:14:09.905813"
        },
        {
            "title": "Marico Q3 Results: PAT rises 4% YoY to Rs 399 crore, revenue jumps 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/marico-q3-results-pat-rises-4-yoy-to-rs-399-crore-revenue-jumps-15/articleshow/117783303.cms",
            "description": "Marico Ltd posted a 4% YoY rise in Q3 net profit to ₹399 crore, with revenue up 15% to ₹2,794 crore. EBITDA grew 4%, but margins declined due to rising input costs. India business saw 6% volume growth.",
            "pubDate": "2025-02-01T05:14:09.905906"
        },
        {
            "title": "Vedanta Q3 Results: Cons PAT jumps 76% YoY to Rs 3,547 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-q3-results-cons-pat-soars-76-yoy-to-rs-3547-crore/articleshow/117782979.cms",
            "description": "Vedanta Q3 Results: Revenue from operations grew 10% YoY to Rs 38,526 crore in Q3. Consolidated EBITDA surged 30% to Rs 11,284 crore, while margins improved 517 bps to 34%. Revenue growth during the quarter was driven by favourable market prices and higher premiums.",
            "pubDate": "2025-02-01T05:14:09.905999"
        },
        {
            "title": "PNB Q3 Results: PAT soars 103% YoY to Rs 4,508 crore, stock surges 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-q3-results-pat-soars-103-yoy-to-rs-4508-crore-stock-surges-5/articleshow/117779682.cms",
            "description": "PNB Q3 Results:  The private lender's Q3FY25 interest earnings rose 15% to Rs 31,340 crore from Rs 27,287 crore a year ago. Announced during market hours, the news drove PNB shares up 5% to a high of Rs 101.13 on the NSE.",
            "pubDate": "2025-02-01T05:14:09.906096"
        },
        {
            "title": "Nestle India Q3 Results: Cons PAT rises 5% YoY to Rs 688 crore, dividend declared at Rs 14.25/share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-india-q3-results-cons-pat-rises-5-yoy-to-rs-688-crore-dividend-declared-at-rs-14-25/share/articleshow/117775531.cms",
            "description": "Nestle India Q3 Results: Nestle India reported a 5% YoY increase in net profit to Rs 688.01 crore for the December 2024 quarter, with revenue rising 3.9% to Rs 4,779.73 crore. The beverages segment, led by Nescafé, contributed significantly to growth, while the company continues to expand its manufacturing capacity.",
            "pubDate": "2025-02-01T05:14:09.906191"
        },
        {
            "title": "Q3 results today: Vedanta, Nestle among 134 companies to announce earnings on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-vedanta-nestle-among-134-companies-to-announce-earnings-on-friday/articleshow/117765158.cms",
            "description": "The third quarter earnings results will be announced by 134 companies, with key players such as Nestle India, IndusInd Bank, Sun Pharma, ONGC, Vedanta, and Marico in focus. Nestle's profits are expected to show marginal growth, while IndusInd Bank may see a significant decline in PAT due to slower loan growth and rising slippages.",
            "pubDate": "2025-02-01T05:14:09.906283"
        },
        {
            "title": "Samsung sees limited first-quarter earnings growth due to weak chips business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/samsung-sees-limited-first-quarter-earnings-growth-due-to-weak-chips-business/articleshow/117764818.cms",
            "description": "Samsung Electronics forecasts limited earnings growth in Q1 2025 due to weak memory chip market conditions, despite efforts to supply high-end chips to Nvidia. The company expects memory market demand to recover from Q2 2025. Samsung's Q4 2024 operating profit was 6.5 trillion won, impacted by declines in mobile phone business and chip division performance.",
            "pubDate": "2025-02-01T05:14:09.906369"
        }
    ]
}