{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-30T23:21:39.866362",
    "items": [
        {
            "title": "IndiGo profit falls sharply on geopolitical tension, Air India crash",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-profit-falls-sharply-on-geopolitical-tension-air-india-crash/articleshow/123001927.cms",
            "description": "IndiGo reported a 20% YoY fall in Q1FY26 profit to ₹2,176.3 crore, hit by flight restrictions and weak sentiment post an Air India crash. Despite revenue growth and 60% domestic market share, lower yields and fare cuts dented margins.",
            "pubDate": "2025-07-30T15:52:17.656728"
        },
        {
            "title": "Piramal Enterprises Q1 Results: Net profit surges 52% to Rs 276 crore on improved margins, lower credit costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/piramal-enterprises-q1-results-net-profit-surges-52-to-rs-276-crore-on-improved-margins-lower-credit-costs/articleshow/123000750.cms",
            "description": "Piramal Enterprises reported a 52% rise in consolidated Q1 net profit to Rs 276 crore, driven by lower credit costs and a 37% surge in retail loan AUM. While standalone profit dropped, the company's retail focus and improving margins signal positive momentum ahead.",
            "pubDate": "2025-07-30T15:52:17.656871"
        },
        {
            "title": "HSBC India profit rises 17% in first six months of 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hsbc-india-profit-rises-17-in-first-six-months-of-2025/articleshow/123000309.cms",
            "description": "HSBC reported a 17% rise in H1 2025 profit before tax in India, driven by strong corporate and institutional banking growth. India is now HSBC’s third-largest global profit contributor after Hong Kong and the UK, surpassing China and Canada.",
            "pubDate": "2025-07-30T15:52:17.656990"
        },
        {
            "title": "Tata Steel Q1 Results: Cons PAT surges 116% YoY to Rs 2,078 crore despite 3% revenue fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steel-q1-results-cons-pat-surges-116-yoy-to-rs-2078-crore-despite-3-revenue-fall/articleshow/122999182.cms",
            "description": "Tata Steel Q1 Results: Tata Steel's Q1 consolidated net profit surged 116% year-on-year to ₹2,078 crore, surpassing Street estimates, though revenue dipped 3% to ₹53,178 crore. EBITDA improved both sequentially and year-on-year, bolstered by strategic initiatives.",
            "pubDate": "2025-07-30T15:52:17.657095"
        },
        {
            "title": "Mahindra & Mahindra Q1 Results: Cons PAT jumps 24% YoY to Rs 4,083 crore, revenue grows 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mahindra-mahindra-q1-results-cons-pat-jumps-24-yoy-to-rs-4083-crore-revenue-grows-23/articleshow/122997938.cms",
            "description": "Mahindra & Mahindra Q1 Results: Mahindra & Mahindra (M&M) on Wednesday reported a 24% year-on-year growth in its Q1FY26 consolidated net profit at Rs 4,083 crore versus Rs 3,283 crore in the year ago period.",
            "pubDate": "2025-07-30T15:52:17.657195"
        },
        {
            "title": "InterGlobe Aviation Q1 Results: Indigo's cons PAT falls 20% YoY to Rs 2,176 crore; revenue up 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/interglobe-aviation-q1-results-indigos-cons-pat-falls-20-yoy-to-rs-2176-crore-revenue-up-5/articleshow/122996429.cms",
            "description": "Indigo Q1 Results: InterGlobe Aviation, which operates budget airline Indigo, reported a 20% year-on-year fall in its consolidated net profit for the June quarter at Rs 2,176 crore on Wednesday, compared to Rs 2,729 crore in the year-ago period.",
            "pubDate": "2025-07-30T15:52:17.657300"
        },
        {
            "title": "Power Grid Q1 Results: Cons profit falls 2.5% YoY to Rs 3,630 crore, revenue up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/power-grid-q1-results-cons-profit-falls-2-5-yoy-to-rs-3630-crore-revenue-up-2/articleshow/122994745.cms",
            "description": "Power Grid Corporation of India's consolidated profit witnessed a slight decrease in the first quarter. The company reported revenue from operations with a marginal rise. Total expenses for the quarter increased. The transmission segment saw a slight dip in revenue. However, the consultancy and telecom segments experienced significant revenue surges. Shares traded lower following the Q1 results announcement.",
            "pubDate": "2025-07-30T15:52:17.657399"
        },
        {
            "title": "Mahindra & Mahindra advances Q1 earnings announcement from Thursday to today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mahindra-mahindra-prepones-q1-earnings-from-thursday-to-today-heres-what-to-expect/articleshow/122994396.cms",
            "description": "Mahindra & Mahindra (M&M) has rescheduled its Q1FY26 results announcement to today, July 30th, 2025, instead of the previously planned July 31st. The company cited \"certain exigencies\" as the reason for this revision in their filing to the exchanges. The board meeting will now consider and approve the unaudited financial results for the quarter ending June 30th, 2025.",
            "pubDate": "2025-07-30T15:52:17.657491"
        },
        {
            "title": "Hyundai Motor India Q1 Results: Cons profit declines 8% YoY to Rs 1,369 cr, revenue slips 5.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hyundai-motor-q1-results-cons-profit-declines-8-yoy-to-rs-1369-revenue-slips-5-5/articleshow/122994264.cms",
            "description": "Hyundai Motor India reported a consolidated net profit of Rs 1,369.23 crore for the first quarter ended June 30, 2025, marking an 8% year-on-year decline. Revenue also slipped by 5.5% to Rs 16,179.61 crore compared to the previous year. Following the announcement, Hyundai Motor India's shares traded nearly 1% lower at Rs 2,081.40 on the BSE.",
            "pubDate": "2025-07-30T15:52:17.657580"
        },
        {
            "title": "Swiggy Q1 Preview: Losses may widen YoY despite up to 56% jump in revenue on Instamart push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swiggy-q1-preview-losses-may-widen-yoy-despite-up-to-56-jump-in-revenue-on-instamart-push/articleshow/122993906.cms",
            "description": "Swiggy's Q1FY26 earnings, due Thursday, are projected to reveal increased revenue but continued net losses, according to brokerages. Instamart's rapid growth is overshadowed by substantial EBITDA losses, estimated at ₹850 crore by Kotak. While food delivery shows steady progress, Instamart's profitability and competitive pressures from Zomato remain key concerns for investors.",
            "pubDate": "2025-07-30T15:52:17.657676"
        },
        {
            "title": "PNB Q1 Results: Standalone PAT falls 48% YoY to Rs 1,675 cr on one-time tax expense; total income rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-q1-results-standalone-net-profit-falls-48-yoy-to-rs-1675-crore/articleshow/122993873.cms",
            "description": "PNB Q1 Results: Punjab National Bank reported a standalone net profit of Rs 1,675 crore for the June quarter, a 48% year-on-year decline due to a one-time tax expense. Despite the profit drop, total income increased by 15.7% to Rs 37,232 crore. Asset quality showed slight improvement, with gross and net non-performing assets easing marginally.",
            "pubDate": "2025-07-30T15:52:17.657771"
        },
        {
            "title": "HUL Q1 Preview: PAT likely to dip 1% YoY; muted demand to weigh on margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hul-q1-preview-pat-likely-to-dip-1-yoy-muted-demand-to-weigh-on-margins/articleshow/122991794.cms",
            "description": "Hindustan Unilever Ltd is anticipated to reveal a modest performance for the June quarter, with profit after tax expected to slightly decrease. Revenue is projected to experience moderate growth, while volume recovery is underway, profitability faces challenges from promotional activities and deflation in the home care sector.",
            "pubDate": "2025-07-30T15:52:17.657882"
        },
        {
            "title": "Maruti Suzuki Q1 Preview: Profit may dip 16% YoY on weak volumes, margin pressure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q1-preview-profit-may-dip-16-yoy-on-weak-volumes-margin-pressure/articleshow/122990814.cms",
            "description": "Maruti Suzuki's Q1 FY26 is projected to show a profit decline of 16% YoY, with revenue up by a mere 2%, impacted by weak domestic sales and unfavorable product mix. Despite export growth, lower UV share and sequential volume decline put pressure on margins. Investors are keenly awaiting management's insights on demand, rural recovery, and new model launches.",
            "pubDate": "2025-07-30T15:52:17.657978"
        },
        {
            "title": "NSE June quarter PAT jumps 10% QoQ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nse-june-quarter-pat-jumps-10-qoq/articleshow/122985454.cms",
            "description": "The National Stock Exchange (NSE) announced strong financial results. The consolidated profit after tax reached ₹2,924 crore in the June quarter. This represents a 10% increase compared to the January-March quarter. Revenue from operations also saw a rise, climbing 7% to ₹4,032 crore. The growth was fueled by increased trading volumes in both the cash market and derivatives segments.",
            "pubDate": "2025-07-30T15:52:17.658078"
        },
        {
            "title": "India's top nine private banks report 2.7% profit growth in Q1 amid economic challenges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indias-top-nine-private-banks-report-2-7-profit-growth-in-q1-amid-economic-challenges/articleshow/122985213.cms",
            "description": "India's top private banks saw a slowdown in profit growth. Combined net profit reached ₹43,641 crore in the June quarter. This is a 2.7% increase, lower than the previous year. Sluggish credit and deposit growth impacted performance. Treasury gains helped support profitability. Some banks like Axis Bank and Kotak Mahindra Bank experienced subdued results.",
            "pubDate": "2025-07-30T15:52:17.658177"
        },
        {
            "title": "NTPC Q1 Results: Cons PAT rises 11% YoY to Rs 6,108 crore, revenue falls 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ntpc-q1-results-cons-pat-rises-11-yoy-to-rs-6108-crore-revenue-falls-3/articleshow/122979564.cms",
            "description": "NTPC reported an 11% YoY rise in Q1FY26 net profit to Rs 6,108 crore, despite a 3% decline in revenue. Profit and revenue fell sequentially. The board set September 4 as the record date for a Rs 3.35/share final dividend.",
            "pubDate": "2025-07-30T15:52:17.658270"
        },
        {
            "title": "Hyundai Motors India reports 8% decline in June quarter net profit at Rs 1,369 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hyundai-motors-india-reports-8-decline-in-june-quarter-net-profit-at-rs-1369-crore/articleshow/123002340.cms",
            "description": "Hyundai Motor India's net profit fell by 8% to Rs 1,369.23 crore in the first quarter. Revenue also decreased by 5%. Export volumes increased by 13%, offsetting weak domestic growth. Rural sales contributed significantly. The company started engine production in Pune. They anticipate a recovery in domestic demand due to monsoon and festive season. Hyundai shares closed down by 0.",
            "pubDate": "2025-07-30T17:52:03.205013"
        },
        {
            "title": "Mahindra & Mahindra posts 24% rise in net profit as market share expands in auto and farm segments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mahindra-mahindra-posts-24-rise-in-net-profit-as-market-share-expands-in-auto-and-farm-segments/articleshow/123004306.cms",
            "description": "Mahindra & Mahindra reported a robust 24% increase in consolidated net profit, reaching ₹4,083 crore, driven by strong performances in its auto and farm sectors. The company experienced significant market share gains in SUVs and tractors, with overall revenue expanding by 22% to ₹45,529 crore.",
            "pubDate": "2025-07-30T23:21:37.765121"
        },
        {
            "title": "Tata Steel more than doubles June quarter profit of Rs 2,007 crore despite sales volume decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steel-more-than-doubles-june-quarter-profit-of-rs-2007-crore-despite-sales-volume-decline/articleshow/123004241.cms",
            "description": "Tata Steel's net profit more than doubled to Rs 2,007.36 crore in the June quarter, driven by reduced losses in the UK and improved profitability in India. While consolidated sales volumes declined, higher steel realisations and cost transformation programs contributed to a 10% rise in EBITDA.",
            "pubDate": "2025-07-30T23:21:37.765250"
        },
        {
            "title": "Indus Towers Q1 Results: Profit falls 9% YoY to Rs 1,737 crore amid rising expenses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indus-towers-q1-results-profit-falls-9-yoy-to-rs-1737-crore-amid-rising-expenses/articleshow/123004175.cms",
            "description": "Indus Towers reported a 9.8% on-year drop in Q1 net profit to Rs 1,737 crore, impacted by rising expenses despite a write-back of provisions from Vodafone Idea. Revenue increased by 9.1% to Rs 8,058 crore, with growth in new towers and co-locations. The company is cautiously monitoring Vodafone Idea's financial stability.",
            "pubDate": "2025-07-30T23:21:37.765358"
        }
    ]
}