{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-10T21:43:10.205357",
    "items": [
        {
            "title": "Ahead of Market: 10 things that will decide stock action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-friday/articleshow/114126316.cms",
            "description": "Indian indices closed slightly higher on Thursday, with financial stocks gaining and IT shares declining. However, higher-than-expected US inflation data may negatively impact Friday's trade. Analysts predict a sideways trend with support at 24,950-24,900 and resistance at 25,150-25,400.",
            "pubDate": "2024-10-10T21:42:53.062805"
        },
        {
            "title": "Market Trading Guide: Smallcap Usha Martin, 2 more stocks are recommendations for Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-smallcap-usha-martin-2-more-stocks-are-recommendations-for-friday/slideshow/114125962.cms",
            "description": "Indian headline indices opened higher on Thursday, buoyed by global cues hinting at more US rate cuts, but ended the day near its lows after failing to sustain gains. They were weighed down by the pharma, IT and healthcare stocks. The Nifty50 index closed at 24,998.5, down by 0.07% or 16.5 points while the Sensex ended 0.18% higher at 81,611.4, up by 144 points.The index remained largely sideways throughout the day as the 25,000 level was mostly held, Rupak De, Senior Technical Analyst at LKP Securities. said, commenting on the day's action. Decoding the Nifty chart structure, De said that Nifty has been failing to reclaim 50-EMA for the last two days which indicates prevailing weakness. \"On the lower end, support is placed at 24,950–24,900. A fall below 24,900 could trigger a correction toward 24,750–24,700. On the other hand, resistance is seen at 25,150, and a move above this level could push the index towards 25,350–25,400 in the short term,\" De said.Here are 3 stock recommendations for Friday:",
            "pubDate": "2024-10-10T21:42:53.062915"
        },
        {
            "title": "Goldman Sachs sells ideaForge shares worth Rs 43 crore via block deal. Citi buyer at Rs 44 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-sells-ideaforge-shares-worth-rs-43-crore-via-block-deal-citi-buyer-at-rs-44-crore/articleshow/114125417.cms",
            "description": "Goldman Sachs sold 6.5 lakh shares in Ideaforge Technology for Rs 43 crore, while Citigroup bought 6.65 lakh shares for Rs 44 crore. Ideaforge shares ended down 1% at Rs 678. It is a vertically integrated company that designs, develops, and manufactures UAVs.",
            "pubDate": "2024-10-10T21:42:53.063041"
        },
        {
            "title": "Sebi extends deadline to implement direct pay-out of securities to clients' demat a/c to Nov 11",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-extends-deadline-to-implement-direct-pay-out-of-securities-to-clients-demat-a/c-to-nov-11/articleshow/114124644.cms",
            "description": "Markets regulator Sebi on Thursday extended the deadline to implement guidelines mandating the direct pay-out of securities to clients' demat accounts to November 11. This rule was originally set to take effect on October 14.",
            "pubDate": "2024-10-10T21:42:53.063143"
        },
        {
            "title": "US stocks open lower after higher-than-expected CPI data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-after-higher-than-expected-cpi-data/articleshow/114124337.cms",
            "description": "Wall Street's main indexes fell at the open on Thursday, after data showed U.S. inflation was higher than expected in September, keeping the Federal Reserve on track to ease interest rates by 25 basis points at its next meeting.",
            "pubDate": "2024-10-10T21:42:53.063236"
        },
        {
            "title": "These 7 healthcare stocks hit 52-week highs, rallied up to 12% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-healthcare-stocks-hit-52-week-highs-rallied-up-to-12-in-a-month/slideshow/114124493.cms",
            "description": "On Thursday, India’s benchmark index, the Sensex, gained about 144 points, closing at 81,611. During this surge, seven stocks from the BSE healthcare index reached their 52-week highs. A 52-week high represents the highest price a stock has reached in the past year, providing valuable insights for traders and investors to evaluate its current value and forecast future potential.",
            "pubDate": "2024-10-10T21:42:53.063334"
        },
        {
            "title": "Tech Mahindra, Birlasoft among 5 stocks with long unwinding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-birlasoft-among-5-stocks-with-long-unwinding/slideshow/114123010.cms",
            "description": "Long unwinding refers to the selling of positions or stocks owned for a longer period either to book profit or to exit it in anticipation of impending bearishness. In Thursday's trading session, five stocks witnessed a long unwinding. Here's the list:",
            "pubDate": "2024-10-10T21:42:53.063430"
        },
        {
            "title": "Bank of Baroda, IRCTC among 5 stocks with short covering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-baroda-irctc-among-5-stocks-with-short-covering/slideshow/114122862.cms",
            "description": "Short covering happens when traders buy back shares they previously sold short, often due to a shift in market sentiment or new information. This usually results in a decrease in open interest and can drive the stock price higher. In Thursday's trading session, five stocks saw short covering. Here's the list:",
            "pubDate": "2024-10-10T21:42:53.063523"
        },
        {
            "title": "Tech view: Bears in control of market, Nifty forms inside day candle. How to trade tomorrow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-bears-in-control-of-market-nifty-forms-inside-day-candle-how-to-trade-tomorrow/articleshow/114122431.cms",
            "description": "Nifty formed an inside day pattern, indicating sideways movement. Bears are in control, using pullback rallies to create short positions. Support at 24,950-25,000 and 24,750. Resistance at 25,100 and 25,250-275. Analysts suggest buying on dips, with a stop loss at 24,800.",
            "pubDate": "2024-10-10T21:42:53.063611"
        },
        {
            "title": "VMS TMT files DRHP with SEBI for fundraising via IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vms-tmt-files-drhp-with-sebi-for-fundraising-via-ipo/articleshow/114121725.cms",
            "description": "VMS TMT filed draft prospectus for IPO to raise funds for solar power plant, working capital, debt repayment, and general corporate purposes. Proceeds will also be used for backward integration and diversification into MS pipes.",
            "pubDate": "2024-10-10T21:42:53.063703"
        },
        {
            "title": "Breakout Stocks: How to trade Gujarat Fluorochemicals, HCL Technologies and Tech Mahindra on Friday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-gujarat-fluorochemicals-hcl-technologies-and-tech-mahindra-on-friday/slideshow/114121304.cms",
            "description": "Indian market witnessed selling pressure at higher levels on Thursday. The S&P BSE Sensex rose 144 points while the Nifty50 closed at 24,998, just below the 25,000 mark.",
            "pubDate": "2024-10-10T21:42:53.063793"
        },
        {
            "title": "JM Financial initiates coverage on 2 general insurance stocks, signalling upside potential up to 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-initiates-coverage-on-2-general-insurance-stocks-signalling-upside-potential-up-to-32/articleshow/114120728.cms",
            "description": "JM Financial initiated coverage on ICICI Lombard and Star Health with buy ratings. Target prices were set at Rs 2,400 and Rs 750, respectively. The brokerage firm expects strong growth potential and return ratios for both companies.",
            "pubDate": "2024-10-10T21:42:53.063884"
        },
        {
            "title": "TCS declares second interim dividend of Rs 10/share, sets October 18 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-declares-second-interim-dividend-of-rs-10/share-sets-october-18-as-record-date/articleshow/114119904.cms",
            "description": "Tata Consultancy Services (TCS) has declared a second interim dividend of Rs 10 per share, payable on November 5, 2024, with a record date of October 18, 2024. The announcement followed the release of Q2FY25 earnings, showing a 5% YoY increase in consolidated net profit to Rs 11,909 crore, falling short of analyst estimates.",
            "pubDate": "2024-10-10T21:42:53.063976"
        },
        {
            "title": "India has lost a pioneer, but not his legacy: BSE on Ratan Tata's death",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-has-lost-a-pioneer-but-not-his-legacy-bse-on-ratan-tatas-death/articleshow/114119527.cms",
            "description": "Leading stock exchange BSE on Thursday acknowledged Ratan Tata's lasting influence on the nation's business landscape, saying \"India has lost a pioneer, but not his legacy.\" In its condolence message on the death of Tata, BSE highlighted the industrialist's unparalleled contribution to Indian industry, noting that his visionary leadership continues to serve as an inspiration.",
            "pubDate": "2024-10-10T21:42:53.064064"
        },
        {
            "title": "Market Wrap: Sensex, Nifty rise led by banking stocks; investors eye inflation data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-nifty-rise-led-by-banking-stocks-investors-eye-inflation-data/articleshow/114119166.cms",
            "description": "Sensex closed with a 0.18% gain led by banking stocks amid optimism over potential U.S. rate cuts. Key gainers included Kotak Bank and HDFC Bank. Star Health dropped 2% following a cyberattack disclosure, while VA Tech Wabag rose 5% on securing orders from Reliance Industries.",
            "pubDate": "2024-10-10T21:42:53.064157"
        },
        {
            "title": "Headwind of rising input cost, yes. But the bigger picture of strong demand is intact. 5 tyre stocks with an upside potential of up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/headwind-of-rising-input-cost-yes-but-the-bigger-picture-of-strong-demand-is-intact-5-tyre-stocks-with-an-upside-potential-of-up-to-28/articleshow/114118310.cms",
            "description": "In the last few days, the prices of natural rubber have witnessed a sharp increase. This was not unexpected. Parts of Southeast Asia saw weather disturbances that led to a disruptions in production. Also there has been an increase in demand for natural rubber. These developments will raise questions about the margins of tyre companies. Will they come under pressure? Surely, yes. But does this mean these businesses are not worth owning? The answer: Probably no. This is a cycle which keeps repeating itself and the industry has evolved and matured in the last 10 years.",
            "pubDate": "2024-10-10T21:42:53.064244"
        }
    ]
}