{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-26T13:55:39.322326",
    "items": [
        {
            "title": "36 companies doubled their sales and PAT in a disappointing Q2 earnings season",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/36-companies-doubled-their-sales-and-pat-in-a-disappointing-q2-earnings-season/articleshow/115681335.cms",
            "description": "Despite a lackluster Q2 earnings season, 36 companies defied the trend, doubling both sales and profits.  Some achieved growth in the thousands of percentage points, driven by strong demand in sectors like pharma and realty.  Analysts remain optimistic about a stronger second half of FY25, citing festive demand and rural recovery.",
            "pubDate": "2024-11-26T13:55:37.556630"
        },
        {
            "title": "Q2 earnings shocker: 36 BSE 500 companies report over 50% profit plunge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-earnings-shocker-36-bse-500-companies-report-over-50-profit-plunge/articleshow/115679751.cms",
            "description": "The September quarter earnings season proved disastrous for India Inc, with 36 BSE 500 companies reporting over 50% profit plunges. Analysts warn the market will react negatively to the continued poor performance, particularly in sectors like auto and banking, where weak consumption demand is evident.",
            "pubDate": "2024-11-26T13:55:37.556756"
        },
        {
            "title": "India Inc's interest cover weakens with slipping top & bottom lines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-incs-interest-cover-weakens-in-q2-amid-slowing-revenue-profit-growth/articleshow/115629973.cms",
            "description": "Indian companies faced a decline in interest coverage ratio to 4.8% in the September quarter. This was due to rising interest costs and slower growth in operating profit. Interest costs surged by 7.2% year-on-year, while revenue growth slowed down to 4.9%. Higher working capital requirements and increased borrowings further impacted the ratio.",
            "pubDate": "2024-11-26T13:55:37.556857"
        }
    ]
}