{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-23T10:17:39.826565",
    "items": [
        {
            "title": "​Retail holding drops QoQ in 5 defence stocks in September quarter; BEL and HAL in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-holding-drops-qoq-in-5-defence-stocks-in-september-quarter-bel-and-hal-in-focus/slideshow/125515753.cms",
            "description": "While retail investors’ appetite for defence stocks remained strong in the September quarter, with ownership rising in 13 out of 18 stocks in the Nifty India Defence Index, five counters saw a decline in retail shareholding. Data Patterns reported the sharpest drop, followed by PSU majors Bharat Electronics Ltd (BEL) and Hindustan Aeronautics Ltd (HAL), along with Cyient DLM and Bharat Forge.",
            "pubDate": "2025-11-23T05:32:28.049039"
        },
        {
            "title": "​12 penny stocks crash up to 65% in a month. Are you holding any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-penny-stocks-crash-up-to-65-in-a-month-are-you-holding-any/slideshow/125515621.cms",
            "description": "Over the past month, 12 penny stocks have recorded steep losses, falling between 20% and 65%. These laggards were identified through a focused screening process that considered companies with a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum trading volume of 5 lakh shares in the recent period. The aim was to highlight low-priced, actively traded penny stocks that have witnessed sharp declines. (Data Source: ACE Equity)While penny stocks often entice investors with low entry prices and the prospect of quick gains, they carry significant risks. Their low liquidity, high volatility and limited disclosures make them prone to manipulation and sudden crashes. Without a clear strategy and strict risk controls, investors may incur substantial losses.",
            "pubDate": "2025-11-23T05:32:28.049164"
        },
        {
            "title": "Will Nifty finally cross 26,277? 6 triggers that could break the 421-day deadlock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-nifty-finally-cross-26277-six-triggers-that-could-break-the-421-day-deadlock/articleshow/125515374.cms",
            "description": "Nifty gained 0.6% for the week, briefly approaching its record high of 26,277 before ending Friday lower at 26,068.15. Analysts expect the index to be guided largely by global cues in the coming week, with no major domestic data releases. Sensitivity to global markets, currency movements and FII flows is expected to remain high as investors look for a breakout above record levels.Nifty gained 0.6% for the week, briefly approaching its record high of 26,277 before ending Friday lower at 26,068.15. Analysts expect the index to be guided largely by global cues in the coming week, with no major domestic data releases. Sensitivity to global markets, currency movements and FII flows is expected to remain high as investors look for a breakout above record levels",
            "pubDate": "2025-11-23T05:32:28.049252"
        },
        {
            "title": "IndiGo set to join Sensex in December rejig as Tata Motors’ PV arm makes way",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-set-to-join-sensex-in-december-rejig-as-tata-motors-pv-arm-makes-way/articleshow/125515914.cms",
            "description": "InterGlobe Aviation, the parent of IndiGo, will enter the 30-stock Sensex from December 22, replacing Tata Motors Passenger Vehicles following its recent demerger. BSE Index Services announced the overhaul as part of a wider reconstitution across major indices, with changes also set for the BSE 100, Sensex 50 and Sensex Next 50, prompting portfolio realignments by index-tracking funds",
            "pubDate": "2025-11-23T05:44:09.996209"
        },
        {
            "title": "Nifty eyes all-time high as rupee crashes to lifetime low: Can bulls survive the currency storm?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-eyes-all-time-high-as-rupee-crashes-to-lifetime-low-can-bulls-survive-the-currency-storm/articleshow/125516469.cms",
            "description": "India’s equity market faces a critical juncture as the Nifty nears its record high, just 210 points away, while the rupee plunges to a lifetime low near 89.5. Friday saw foreign investors turn net sellers and forex volatility spike, with the steepest daily rupee fall since May. The coming sessions will test the resilience of India’s equity rally.",
            "pubDate": "2025-11-23T07:19:13.104001"
        },
        {
            "title": "​Top picks: 3 stocks to buy this week that can give returns of up to 11% in short term. Do you own any?​",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-picks-3-stocks-to-buy-this-week-that-can-give-returns-of-up-to-11-in-short-term-do-you-own-any/slideshow/125516459.cms",
            "description": "Domestic brokerage firm Axis Securities has identified three stocks with strong technical setups for the week, highlighting opportunities amid the market’s recent volatility. The brokerage says these counters show a favourable risk–reward profile and could offer short-term trading upside.",
            "pubDate": "2025-11-23T07:19:13.104129"
        },
        {
            "title": "Dividend radar: PFC’s 4.4% yield tops the list as Ingersoll-Rand, four other stocks go ex-dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-radar-pfcs-4-4-yield-tops-the-list-as-ingersoll-rand-four-other-stocks-go-ex-dividend/slideshow/125516355.cms",
            "description": "At least six stocks will be in focus this week as their shares will trade ex-dividend. These include Ingersoll-Rand (India), Power Finance Corporation (PFC), Shyamkamal Investments, AK Capital Services, Meera Industries, and Nile. Check full details:",
            "pubDate": "2025-11-23T07:19:13.104237"
        },
        {
            "title": "Global oil prices under pressure: What’s driving the decline and what lies ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-oil-prices-under-pressure-whats-driving-the-decline-and-what-lies-ahead/articleshow/125517638.cms",
            "description": "Global oil markets have entered a bearish phase, with U.S. crude sliding below $60 per barrel, down over 20% from January highs. Surging U.S. output, gradual unwinding of OPEC+ cuts, and tepid demand—especially in China—have created persistent oversupply. With inventories at multi-year highs, near-term prices are expected to remain under pressure, while structural factors cap any sustained rallies in 2026.Global oil markets have entered a bearish phase, with U.S. crude sliding below $60 per barrel, down over 20% from January highs. Surging U.S. output, gradual unwinding of OPEC+ cuts, and tepid demand—especially in China—have created persistent oversupply. With inventories at multi-year highs, near-term prices are expected to remain under pressure, while structural factors cap any sustained rallies in 2026",
            "pubDate": "2025-11-23T08:58:25.843744"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms surges Rs 1.28 lakh cr; RIL, Airtel biggest gainers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-surges-rs-1-28-lakh-cr-ril-airtel-biggest-gainers/articleshow/125517544.cms",
            "description": "While Reliance Industries, HDFC Bank, Bharti Airtel, Tata Consultancy Services (TCS), State Bank of India, Infosys and Hindustan Unilever were the gainers, Bajaj Finance, Life Insurance Corporation of India (LIC) and ICICI Bank faced erosion in their valuation",
            "pubDate": "2025-11-23T08:58:25.843876"
        },
        {
            "title": "​Market Trading Guide: Buy RIL, Max Financial & 2 other stocks on Monday for up to 10% near-term gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-ril-max-financial-amp-2-other-stocks-on-monday-for-up-to-10-near-term-gains/slideshow/125517236.cms",
            "description": "India’s benchmark index Nifty ended lower on Friday amid a global sell-off and rupee weakness. Selling pressure was broad-based, with financials, metals, and realty stocks hit the hardest. The index has also slipped below the 21 EMA on the hourly chart, indicating potential further weakness in the coming sessions.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities, said a bearish Harami pattern formed on Nifty’s hourly chart on Thursday, leading to a sharp decline over the last two days. “The hourly RSI is in a bearish crossover and continues to fall. Sentiment may remain challenging for bulls in the near term, as the decline could extend towards the 25,920–25,900 zone. On the higher side, resistance is placed at 26,166; a move above this level may improve sentiment,” De added.Here are four stock recommendations for Monday:",
            "pubDate": "2025-11-23T08:58:25.843981"
        },
        {
            "title": "Quiet winner of GST rate rationalisation. Time to think regional? 4 dairy sector stocks, 3 with an upside potential of up to 46%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/quiet-winner-of-gst-rate-rationalisation-time-to-think-regional-4-dairy-sector-stocks-3-with-an-upside-potential-of-up-to-46/articleshow/125517202.cms",
            "description": "At first glance, the impact of GST rate rationalisation looks like small change. But for some players in the organised sector, the impact could be transformational. Historically, larger players suffered a tax arbitrage disadvantage compared to the unorganised market, much of which operated outside the GST net. With rates now lower or zero on dairy items, the playing field has been levelled. The result? Organised players are now in a stronger position to compete on price and expand their share in a market long dominated by local dairies. And now institutional investors have started to show interest in these stocks",
            "pubDate": "2025-11-23T08:58:25.844101"
        },
        {
            "title": "20 crore Demat accounts and counting: Inside India’s retail investing transformation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/20-crore-demat-accounts-and-counting-inside-indias-retail-investing-transformation/articleshow/125517942.cms",
            "description": "In 2025, India’s retail investing landscape transformed dramatically, with demat accounts nearing 21 crore and monthly SIP contributions crossing Rs. 29,500 crore. Technology, geographic expansion, and domestic investor confidence drove participation, even amid foreign outflows and market volatility. Despite derivative losses and global uncertainties, regulatory reforms and increased financial literacy strengthened the ecosystem, marking a pivotal year for long-term wealth creation and the \"Equitization of Savings\"",
            "pubDate": "2025-11-23T09:57:30.535952"
        },
        {
            "title": "Berkshire's unusually modern bet on Alphabet forces a fresh look at Warren Buffett’s playbook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshires-unusually-modern-bet-on-alphabet-forces-a-fresh-look-at-warren-buffetts-playbook/articleshow/125518300.cms",
            "description": "Berkshire Hathaway’s Alphabet stake has surged $415 million in just a week, reaching nearly $5.35 billion as shares climbed 8.4%. The move has reignited debate over whether the traditionally cautious firm is warming to high-risk, AI-driven growth. Alphabet’s rally was boosted by Berkshire’s disclosure and positive reception of Google’s new Gemini 3 AI model, even as other tech stocks lagged.",
            "pubDate": "2025-11-23T10:17:38.008717"
        },
        {
            "title": "Robert Kiyosaki says the crash is here and his pick to survive it is silver",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/robert-kiyosaki-says-the-crash-is-here-and-his-pick-to-survive-it-is-silver/articleshow/125518246.cms",
            "description": "Robert Kiyosaki, author of Rich Dad Poor Dad, has warned that the “biggest crash in history” has begun, affecting the U.S., Europe, and Asia. He advised investors to seek refuge in gold, silver, Bitcoin, and Ethereum, highlighting silver as his top pick. Kiyosaki said the crash he predicted in 2013 has now arrived.",
            "pubDate": "2025-11-23T10:17:38.008834"
        }
    ]
}