{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-07T03:57:18.349461",
    "items": [
        {
            "title": "Power Grid shares to approach ex-date for Rs 4.5 per share interim dividend. Last chance to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-grid-shares-to-approach-ex-date-for-rs-4-5-per-share-interim-dividend-last-chance-to-buy/articleshow/125148084.cms",
            "description": "Investors have a final chance today to buy Power Grid Corporation of India shares for a Rs 4.50 interim dividend. The stock will trade ex-dividend from November 10. This dividend is for the financial year 2025-26. Eligible shareholders will receive the payout on December 1. Other companies also have ex-dividend dates soon.",
            "pubDate": "2025-11-07T02:49:18.203526"
        },
        {
            "title": "Japan's Nikkei drops 2% as tech shares track US peers lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-drops-2-as-tech-shares-track-us-peers-lower/articleshow/125147787.cms",
            "description": "Japan's Nikkei index experienced a significant weekly decline, its largest since April, driven by a sell-off in heavyweight tech stocks mirroring U.S. market trends. Concerns over stretched valuations and disappointing corporate earnings impacted major players like SoftBank and Advantest. Despite a strong October rally, a cautious market sentiment emerged, with investors now closely watching upcoming company results for direction.",
            "pubDate": "2025-11-07T02:49:18.203644"
        },
        {
            "title": "Gift Nifty drops over 50 pts; here's the trading setup for the day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-drops-over-50-pts-heres-the-trading-setup-for-the-day/articleshow/125147603.cms",
            "description": "Indian stock markets closed lower on Thursday. Early gains faded as investors booked profits. Analysts suggest the market is in a consolidation phase with a negative outlook. Key support levels are being watched closely. Global markets showed mixed movements. Foreign investors were net sellers, while domestic investors bought shares. The Indian Rupee saw a slight appreciation against the US dollar.",
            "pubDate": "2025-11-07T02:49:18.203746"
        },
        {
            "title": "US Stocks fall with tech shares; sterling up as BoE keeps rates unchanged",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-fall-with-tech-shares-sterling-up-as-boe-keeps-rates-unchanged/articleshow/125147591.cms",
            "description": "Global markets experienced a downturn Thursday, with tech and consumer stocks leading the decline. The British pound strengthened as the Bank of England held interest rates steady. U.S. chipmaker Qualcomm saw its shares fall on future product concerns. Investors are closely watching corporate earnings, U.S. government shutdown impacts, and trade tariff developments.",
            "pubDate": "2025-11-07T02:49:18.203839"
        },
        {
            "title": "Adani Enterprises to spread Rs 25,000-cr rights issue over 4 tranches",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-to-spread-rs-25000-cr-rights-issue-over-4-tranches/articleshow/125147510.cms",
            "description": "Adani Enterprises is set to launch its largest fundraising yet, a ₹25,000 crore rights issue. This will be spread over six to eight months in four tranches. The company plans to use a significant portion to repay loans from its promoters. This move will free up capital for future debt. The rights issue details are expected soon.",
            "pubDate": "2025-11-07T02:49:18.203936"
        },
        {
            "title": "Fortis, Siemens, Paytm and GE Vernova join MSCI India index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fortis-siemens-paytm-and-ge-vernova-join-msci-india-index/articleshow/125147482.cms",
            "description": "MSCI has updated its global indices. Fortis Healthcare, GE Vernova T&D India, Paytm, and Siemens Energy India are now part of the Global Standard Index. This move is expected to bring substantial investment into these stocks. Changes also affect the India Small Cap Index. Several companies will see their index weights adjusted, influencing fund movements.",
            "pubDate": "2025-11-07T02:49:18.204031"
        },
        {
            "title": "LIC Q2 net rises 31% on business growth, higher margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-q2-net-rises-31-on-business-growth-higher-margins/articleshow/125147417.cms",
            "description": "Life Insurance Corp, or LIC, saw its September quarter profit jump 31% to over ₹10,000 crore. This growth was fueled by its core business and improved margins. While premium growth faced a temporary dip due to GST benefits, LIC anticipates a strong second half. The company is focusing on profitable products and passing on GST benefits to customers.",
            "pubDate": "2025-11-07T02:49:18.204139"
        },
        {
            "title": "Sebi plans smoother IPO listings, rationalise offer documents",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-plans-smoother-ipo-listings-rationalise-offer-documents/articleshow/125147362.cms",
            "description": "The Securities and Exchange Board of India (Sebi) is set to simplify IPO processes by reducing offer document summary content and streamlining procedures for companies with pre-IPO pledged shares. Chairman Tuhin Kanta Pandey stated these changes aim to encourage informed investor feedback and prevent listing delays.",
            "pubDate": "2025-11-07T02:49:18.204228"
        },
        {
            "title": "Stocks in news: Infosys, Apollo Hospitals, Airtel, Nykaa, Bajaj Housing, Trent",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-apollo-hospitals-airtel-nykaa-bajaj-housing-trent/articleshow/125147322.cms",
            "description": "Indian markets saw a slight dip on Thursday. Key companies like Infosys, Apollo Hospitals, and Airtel are in focus due to corporate news and earnings. Infosys announced its record date for a large share buyback. Apollo Hospitals reported strong profit growth. LIC also posted a significant rise in net profit. Singtel plans to sell a stake in Bharti Airtel.",
            "pubDate": "2025-11-07T02:49:18.204320"
        },
        {
            "title": "Asian stocks dip after volatile US day, bonds ease",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-dip-after-volatile-us-day-bonds-ease/articleshow/125147289.cms",
            "description": "Markets are reacting to private data as economic figures are scarce due to the US government shutdown. Job cuts are rising, particularly in technology and warehousing. Concerns about high tech valuations are also unsettling investors. Meanwhile, Federal Reserve officials are weighing inflation risks against labor market strength. Oil prices are seeing increased supply.",
            "pubDate": "2025-11-07T02:49:18.204410"
        },
        {
            "title": "Elon Musk's $1 trillion Tesla pay plan wins shareholder approval",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musks-1-trillion-tesla-pay-plan-wins-shareholder-approval/articleshow/125147804.cms",
            "description": "Tesla shareholders overwhelmingly approved Elon Musk's record-breaking $878 billion pay package, endorsing his ambitious AI and robotics vision. The vote allows Musk to pursue self-driving cars, a robotaxi network, and humanoid robots, despite concerns over his political rhetoric and potential conflicts with his xAI startup. This approval is seen as crucial for Tesla's future valuation and Musk's continued leadership.",
            "pubDate": "2025-11-07T02:49:18.204495"
        },
        {
            "title": "Zydus Lifesciences to raise Rs 5,000 cr via equity; Q2 profit up 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-to-raise-rs-5000-cr-via-equity-q2-profit-up-38/articleshow/125140600.cms",
            "description": "Zydus Lifesciences plans to raise Rs 5,000 crore via share sales. This move aims to reduce debt and boost future expansion. Funds will support R&D, international market growth, and new specialty product launches. The company reported strong profit and revenue growth in the second quarter.",
            "pubDate": "2025-11-07T02:49:18.204586"
        },
        {
            "title": "Infosys shares in focus as board fixes Nov 14 record date for Rs 18,000 cr share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-as-board-fixes-nov-14-record-date-for-rs-18000-cr-share-buyback/articleshow/125148991.cms",
            "description": "Infosys shares are under scrutiny as the record date for its Rs 18,000 crore share buyback approaches on November 14. This marks the company's largest buyback ever, despite recent stock underperformance. The IT giant reported strong Q2 FY26 results with a 13% net profit increase and revised revenue guidance upwards.",
            "pubDate": "2025-11-07T03:57:09.550515"
        },
        {
            "title": "Stock Radar: HPCL hits fresh record high in November 2025; should you book profits or buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-hpcl-hits-fresh-record-high-in-november-2025-should-you-book-profits-or-buy/articleshow/125148957.cms",
            "description": "Hindustan Petroleum Corporation (HPCL) has surged to a record high in November, and technical charts suggest the momentum may continue. Experts advise short-term traders to buy on dips, targeting Rs 500–540 over the next 3–4 weeks. The stock has broken out of its long-term resistance zone of 450–460, supported by strong sectoral buying in OMCs and a steadily rising price base.",
            "pubDate": "2025-11-07T03:57:09.550636"
        },
        {
            "title": "Blue Star among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blue-star-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/125148834.cms",
            "description": "As of November 6, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% compared to the previous trade. A significant uptick in futures open interest indicates substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-11-07T03:57:09.550739"
        },
        {
            "title": "LIC shares in focus after Q2 profit surges 31% YoY; Citi projects 50% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-shares-in-focus-after-q2-profit-surges-31-yoy-citi-projects-50-upside/articleshow/125148907.cms",
            "description": "Life Insurance Corporation of India's profit rose 31 percent year-on-year in the July-September quarter. This strong performance has led global brokerage Citi to predict a 50 percent upside for the stock. Citi maintains a 'Buy' rating, citing product mix realignment and improving margins. The company's net premium income also saw a rise.",
            "pubDate": "2025-11-07T03:57:09.550847"
        },
        {
            "title": "Bharti Airtel shares in focus as Singtel likely to offload 0.8% stake worth Rs 10,300 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-shares-in-focus-as-singtel-likely-to-offload-0-8-stake-worth-rs-10300-crore-block-deal/articleshow/125148784.cms",
            "description": "Bharti Airtel is in focus as Singtel plans a block deal to sell 0.8% stake (~Rs 10,300 crore) at a 3.1% discount. The sale follows previous stake reductions and strong Q2 performance, with 6% QoQ EBITDA growth and Rs 14,600 crore free cash flow. Analysts cite premiumisation, a possible tariff hike, and African operations as drivers, maintaining a “Buy” rating.",
            "pubDate": "2025-11-07T03:57:09.551144"
        },
        {
            "title": "Redington among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-among-6-stocks-showing-bullish-rsi-upswing/slideshow/125148802.cms",
            "description": "On November 6, in the Nifty500 pack, six stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI Trending Up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-07T03:57:09.551248"
        },
        {
            "title": "Negative Breakout: These 11 stocks close below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-11-stocks-close-below-their-200-dmas/slideshow/125148724.cms",
            "description": "In the Nifty200 pack, 11 stocks' closing prices fell below their 200 DMA (Daily Moving Average) on November 6, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-11-07T03:57:09.551342"
        }
    ]
}