{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-05T06:58:43.640416",
    "items": [
        {
            "title": "Understanding the impact of float on your investment strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/understanding-the-impact-of-float-on-your-investment-strategy/articleshow/120005849.cms",
            "description": "A stock's float, the number of shares available for public trading, significantly influences its performance. High float stocks offer stability and lower volatility, suitable for risk-averse investors. Low float stocks feature higher price volatility and potential returns but come with greater risks. Understanding these dynamics helps investors navigate the stock market effectively.",
            "pubDate": "2025-04-05T06:58:22.644679"
        },
        {
            "title": "Trump tariff hunt eyes India's last stock market refuge but it won't be an easy kill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-tariff-hunt-eyes-indias-last-stock-market-refuge-but-it-wont-be-an-easy-kill/articleshow/120003412.cms",
            "description": "Indian pharmaceutical stocks took a hit as Trump's threat of imposing tariffs on pharma imports spooked investors. Despite India's strong presence in the US generics market, potential tariffs may increase costs for US consumers and create supply chain challenges.",
            "pubDate": "2025-04-05T06:58:22.644798"
        },
        {
            "title": "Prestige Estates Projects, Lupin among 7 small & midcap stocks that can rally up to 63%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prestige-estates-projects-lupin-among-7-small-midcap-stocks-that-can-rally-up-to-63/slideshow/120002213.cms",
            "description": "Domestic brokerage firm Axis Securities is optimistic about several small and midcap stocks, predicting potential rallies of up to 63%. These include Prestige Estates Projects, Lupin, Dalmia Bharat, Max Healthcare Institute and APL Apollo Tubes.Here's a list of 7 small & midcap stocks that can rally up to 63%, according to Axis Securities:",
            "pubDate": "2025-04-05T06:58:22.644898"
        },
        {
            "title": "Berkshire refutes false claims linking Buffett to Trump-endorsed economic strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-refutes-false-claims-linking-buffett-to-trump-endorsed-economic-strategy/articleshow/120002980.cms",
            "description": "Berkshire Hathaway has issued an official statement refuting false claims on social media that Warren Buffett endorsed certain investment products and political candidates, including former President Donald Trump. The company emphasized that Buffett does not endorse financial instruments or political figures, countering misinformation from a viral video.",
            "pubDate": "2025-04-05T06:58:22.645108"
        },
        {
            "title": "Smallcaps show mixed trend in muted start for FY25 with 23 double-digit declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcaps-show-mixed-trend-in-muted-start-for-fy25-with-23-double-digit-declines/articleshow/120001829.cms",
            "description": "The new fiscal year starts with mixed results in the Indian market, as 23 smallcap stocks fall double digits, while 54 gain similarly. Factors like US tariffs and global trade uncertainties weigh heavily. Investors remain cautious, focusing on upcoming corporate earnings and macro indicators.",
            "pubDate": "2025-04-05T06:58:22.645215"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/120001484.cms",
            "description": "Global investors are uneasy due to Trump's tariffs, which have sparked fears of a U.S. recession and disrupted markets. The tariffs have hit major trading partners, with significant impact expected from potential retaliations by the EU and China. A crucial U.S. earnings season is approaching, and investors are watching for signs of inflation moderation and economic recovery.",
            "pubDate": "2025-04-05T06:58:22.645308"
        },
        {
            "title": "Trump Sounds Defiant Note as Tariffs Roil Markets Again",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-sounds-defiant-note-as-tariffs-roil-markets-again/articleshow/120001419.cms",
            "description": "President Trump's announcement of global tariffs has triggered swift retaliation from China, which plans to impose a 34% tariff on U.S. goods, including agricultural products. Financial markets have reacted negatively, with substantial declines in the S&P 500 and Nasdaq. Economic concerns are rising, with the Federal Reserve predicting higher inflation and slower growth, while Trump remains defiant about his strategy.",
            "pubDate": "2025-04-05T06:58:22.645399"
        },
        {
            "title": "Berkshire dismisses 'false' reports on Buffett comments after Trump shares video",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-dismisses-false-reports-on-buffett-comments-after-trump-shares-video/articleshow/120001367.cms",
            "description": "Berkshire Hathaway debunked social media rumors that Warren Buffett supports Donald Trump's economic moves. The company stressed that Buffett has not made any statements about the economy recently. This clarification came after a false video spread online. Trump's recent global tariffs have impacted stock prices. Buffett emphasized the importance of addressing misinformation quickly.",
            "pubDate": "2025-04-05T06:58:22.645489"
        },
        {
            "title": "TRADING DAY-Trump tariffs wipe $5 trillion off Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trading-day-trump-tariffs-wipe-5-trillion-off-wall-street/articleshow/120001219.cms",
            "description": "This week witnessed a significant downturn in the global economy as U.S. President Trump's tariff hike triggered fears of a recession. Equities lost $5 trillion, and the Nasdaq entered a bear market. Federal Reserve Chair Powell hinted at rate cuts, but investor confidence remained low. Global trade tensions likely to escalate further, impacting markets worldwide.",
            "pubDate": "2025-04-05T06:58:22.645578"
        },
        {
            "title": "Financial markets face fear, shellshock as global trade war looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/financial-markets-face-fear-shellshock-as-global-trade-war-looms/articleshow/120001155.cms",
            "description": "Global financial markets experienced a significant downturn due to President Trump's tariffs, causing Wall Street's fear levels to reach a five-year high. Investors worried about a potential recession as trillions were wiped off stock market values. The selloff affected various asset classes, with U.S. stock markets dropping sharply, influenced by China's countermeasures and economic uncertainty.",
            "pubDate": "2025-04-05T06:58:22.645688"
        },
        {
            "title": "Hedge funds, ETFs dump over $40 billion in stocks after Trump tariff shock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hedge-funds-etfs-dump-over-40-billion-in-stocks-after-trump-tariff-shock/articleshow/120001065.cms",
            "description": "Global hedge funds and leveraged ETFs unloaded over $40 billion in stocks after President Trump's announcement of higher tariffs. The S&P 500 has lost more than $4 trillion in market value. Volatility targeting portfolios and macro systematic strategies contributed to the selloff, with long/short hedge funds turning the most bearish since 2011.",
            "pubDate": "2025-04-05T06:58:22.645779"
        },
        {
            "title": "Wall Street Week Ahead: Shell-shocked markets brace for more tariff tumult",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-shell-shocked-markets-brace-for-more-tariff-tumult/articleshow/120001028.cms",
            "description": "Tariff-stunned markets faced turmoil with Trump's tariffs shaking global asset prices. The S&P 500 recorded its biggest weekly drop since March 2020, while the Nasdaq Composite entered a bear market. Investors fear a global recession, with the U.S.-China trade battle escalating. Upcoming earnings reports and inflation data may further influence market outlook amid uncertainties.",
            "pubDate": "2025-04-05T06:58:22.645867"
        },
        {
            "title": "Trump tariff tailspin worsens, Nasdaq confirms in bear market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-tariff-tailspin-worsens-nasdaq-confirms-in-bear-market/articleshow/119999557.cms",
            "description": "The Dow Jones Industrial Average, S&P 500 and the Nasdaq Composite posted their largest two-day declines since the emerging coronavirus caused global panic during U.S. President Donald Trump's first term. For Thursday and Friday, the Dow was down 9.3%, the S&P 500 10.5% and the Nasdaq 11.4%.",
            "pubDate": "2025-04-05T06:58:22.645955"
        },
        {
            "title": "'Waterfall' decline base case risk to US market: Chris Wood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waterfall-decline-base-case-risk-to-us-market-chris-wood/articleshow/119999009.cms",
            "description": "He said April 2-when Donald Trump announced the imposition of tariffs on imports into the US-is an 'impoverishment' day, not a 'liberation' day, as termed by President Trump. On Thursday, Wall Street posted its worst day since 2020 in response to the announcement of worldwide tariffs the previous night.",
            "pubDate": "2025-04-05T06:58:22.646045"
        },
        {
            "title": "BofA Securities cautious on richly-valued Indian stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bofa-securities-cautious-on-richly-valued-indian-stocks/articleshow/119998936.cms",
            "description": "Bank of America Securities remains cautious about the valuation of Indian equities due to US reciprocal tariffs impacting all trading partners. With an expected sub-7% return for the Nifty in 2025 and potential declines in small and mid-cap stocks, the brokerage favors domestic cyclical industries over globally-linked ones.",
            "pubDate": "2025-04-05T06:58:22.646131"
        },
        {
            "title": "That Sinking Feeling: Stocks swoon as tariff reality hits investors hard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/that-sinking-feeling-stocks-swoon-as-tariff-reality-hits-investors-hard/articleshow/119998733.cms",
            "description": "NSE Nifty fell 1.5%, or 345.65 points, to finish at 22,904.45. BSE Sensex dropped 1.2%, or 930.67 points, to 75,364.69. The slump wiped out ₹10 lakh crore in market value Friday.",
            "pubDate": "2025-04-05T06:58:22.646226"
        }
    ]
}