{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-19T11:51:46.334735",
    "items": [
        {
            "title": "Zomato Q3 Results Preview: Revenue may jump 66% YoY; rapid store additions to aid Blinkit growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zomato-q3-results-preview-revenue-may-jump-66-yoy-rapid-store-additions-to-aid-blinkit-growth/articleshow/117368989.cms",
            "description": "Zomato is expected to report strong Q3FY25 growth, with a 66% YoY revenue increase, driven by food delivery and Blinkit’s expansion. Blinkit revenues are projected to surge 110% YoY due to store additions. However, the consolidated EBITDA margin may see a 60bps QoQ contraction due to increased competition in quick commerce.",
            "pubDate": "2025-01-19T11:50:45.383014"
        },
        {
            "title": "Q3 results this week: HDFC Bank, IndiGo, HUL, Paytm among 246 companies to announce earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-this-week-hdfc-bank-indigo-hul-paytm-among-246-companies-to-announce-earnings/articleshow/117367031.cms",
            "description": "The third-quarter earnings season is in full swing, with 246 companies set to announce their results this week. Key earnings to watch include HDFC Bank, Paytm, Zomato, HUL, ICICI Bank, and others. Results will be declared across various sectors including banking, auto, pharma, and cement, with announcements scheduled between January 20-24.",
            "pubDate": "2025-01-19T11:50:45.383142"
        },
        {
            "title": "Can Fin Homes Q3 net up 6% at Rs 212 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-fin-homes-q3-net-up-6-at-rs-212-crore/articleshow/117366158.cms",
            "description": "Mortgage lender Can Fin Homes on Saturday reported a 6% year-on-year rise in net profit at ₹212 crore for the quarter ending December 2024. The lender had posted a net profit of ₹200 crore in the year-ago period.",
            "pubDate": "2025-01-19T11:50:45.383250"
        },
        {
            "title": "Kotak Bank Q3 net profit rises 10% on steady interest income growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-bank-q3-net-profit-rises-10-on-steady-interest-income-growth/articleshow/117366128.cms",
            "description": "Kotak Mahindra Bank reported a 10% rise in December quarter net profit to ₹3,305 crore from the year earlier on the back of steady interest income growth.",
            "pubDate": "2025-01-19T11:50:45.383354"
        },
        {
            "title": "RBL Bank Q3 profit slumps 86% amid micro finance loan challenges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rbl-bank-q3-profit-slumps-86-amid-micro-finance-loan-challenges/articleshow/117356124.cms",
            "description": "RBL Bank's net profit plummeted 86% to Rs 33 crore in Q3 FY24, mainly due to a Rs 414 crore provision for potential losses in its microfinance loans. Additional stress from unsecured lending segments and high net slippages in the credit card portfolio further impacted profitability.",
            "pubDate": "2025-01-19T11:50:45.383455"
        },
        {
            "title": "Kotak Bank Q3 Results: PAT grows 10% YoY to Rs 3,305 crore, NII up 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-bank-q3-results-pat-grows-10-yoy-to-rs-3305-crore-interest-income-jumps-14/articleshow/117350719.cms",
            "description": "Kotak Bank Q3 Results: India’s third largest private bank by market capitalisation Kotak Mahindra Bank on Saturday reported a 10% jump in its December quarter net profit at Rs 3,305 crore versus Rs 3,005 crore reported in the year ago period.",
            "pubDate": "2025-01-19T11:50:45.383569"
        },
        {
            "title": "RBL Bank Q3 Results: PAT falls 86% YoY to Rs 33 crore, NII up 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rbl-bank-q3-results-pat-falls-86-yoy-to-rs-33-crore-interest-income-up-11/articleshow/117350593.cms",
            "description": "RBL Bank Q3 results: Private lender RBL Bank on Saturday reported an 86% fall in its December quarter standalone net profit at Rs 33 crore versus Rs 233 crore reported in the year ago period.",
            "pubDate": "2025-01-19T11:50:45.383717"
        },
        {
            "title": "ICICI Lombard Q3 Net Jumps 67.9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-lombard-q3-net-jumps-67-9/articleshow/117347583.cms",
            "description": "ICICI Lombard General Insurance has reported a significant 67.9% rise in net profit for Q3 FY25, reaching ₹724 crore. The increase is partly due to a substantial 155% rise in capital gains. GDPI saw a slight decline of 0.3%, but adjusted growth was 4.8%. The combined ratio improved to 102.7%.",
            "pubDate": "2025-01-19T11:50:45.383818"
        },
        {
            "title": "Jio’s Q3 results may have disappointed, but home broadband is thriving",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jios-q3-results-may-have-disappointed-but-home-broadband-is-thriving/articleshow/117347214.cms",
            "description": "Reliance Jio's Q3FY25 earnings missed expectations due to muted user additions, modest ARPU growth, and higher costs. However, Jio's home broadband business showed strong growth, particularly with its 5G-based FWA services. Enterprise services also saw significant growth in government contracts.",
            "pubDate": "2025-01-19T11:50:45.383930"
        },
        {
            "title": "Land sale gain lifts Tech Mahindra net profit 92% higher",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/land-sale-gain-lifts-tech-mahindra-net-92/articleshow/117340612.cms",
            "description": "Profit was driven by a one-time land sale gain, rupee depreciation and improved rate of deal wins in its key verticals of banking, financial services & insurance (BFSI) and hi-tech & media.",
            "pubDate": "2025-01-19T11:50:45.384032"
        },
        {
            "title": "Wipro Q3 net profit rises 4.5% QoQ to Rs 3,354 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q3-net-profit-rises-4-5-qoq-to-rs-3354-crore-beats-estimates/videoshow/117337853.cms",
            "description": "Wipro Ltd reported a 4.5 percent quarter-on-quarter increase in consolidated net profit to Rs 3,354 crore for the quarter ended December 31, 2024, surpassing analysts’ expectations. The IT major's Q3 FY25 revenue remained flat at Rs 22,319 crore, growing 0.1 percent sequentially.",
            "pubDate": "2025-01-19T11:50:45.384126"
        },
        {
            "title": "Indian Hotels Company Q3 Results: PAT jumps 33% YoY to Rs 633 crore, revenue rises 29%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-hotels-company-q3-results-pat-jumps-33-yoy-to-rs-633-crore-revenue-rises-29/articleshow/117336221.cms",
            "description": "Tata Group-backed IHCL reports a 33% increase in profit after tax for the quarter ended December with revenues up by 29%. The company has set a new growth benchmark with 55 signings and 20 openings this fiscal. IHCL aims to reach 700 hotels by 2030.",
            "pubDate": "2025-01-19T11:50:45.384228"
        },
        {
            "title": "Rallis India Q3 Results: Net profit dips by 54% to Rs 11 crore, revenue declines 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rallis-india-q3-results-net-profit-dips-by-54-to-rs-11-crore-revenue-declines-12/articleshow/117335934.cms",
            "description": "Rallis India, a Tata Enterprise, experienced a 54.16% decline in net profit to Rs 11 crore for Q3 ended December 31, 2024. Revenue fell by 12.70% to Rs 522 crore. Domestic volume grew amid competition, but exports dropped 38%. Specialty solutions and seeds showed growth.",
            "pubDate": "2025-01-19T11:50:45.384324"
        },
        {
            "title": "Jio Financial Q3 Results: PAT remains flat YoY at Rs 295 crore, revenue rises 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q3-results-pat-plunges-57-qoq-to-rs-295-crore-on-37-revenue-decline/articleshow/117332404.cms",
            "description": "Jio Financial Q3 Results: The Mukesh Ambani-led company reported a total revenue of Rs 438 crore in Q3FY25, marking a 6% increase from Rs 414 crore in the same quarter last year. Net profit dropped 57% QoQ compared to Rs 689 crore in Q2FY25, driven by a 37% sequential revenue decline. Revenue for the July-September quarter was Rs 693 crore.",
            "pubDate": "2025-01-19T11:50:45.384414"
        },
        {
            "title": "ICICI Lombard Q3 Results:  PAT jumps 68% YoY to Rs 724 crore, total income grows 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-lombard-q3-results-pat-jumps-68-yoy-to-rs-724-crore-total-income-grows-17/articleshow/117334353.cms",
            "description": "ICICI Lombard Q3 Results: On a sequential basis, the net profit grew by 4.4% to Rs 694 crore in Q3FY25, while revenue rose 0.55% from Rs 5,004 crore in Q2FY25. Gross direct premium income (GDPI) stood at Rs 6,214 crore, a 0.3% decline compared to Rs 6,230 crore in Q3FY24, contrasting with the industry’s growth of 9.5% during the same period.",
            "pubDate": "2025-01-19T11:50:45.384508"
        },
        {
            "title": "Indian Hotels Q3 Results: PAT climbs 23% YoY to Rs 582 crore, revenue up 29%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-hotels-company-q3-results-pat-climbs-23-yoy-to-rs-582-crore/articleshow/117333297.cms",
            "description": "Indian Hotels Company (IHCL) reported a 23% YoY profit growth to ₹582 crore and 29% revenue growth in Q3 FY25, driven by its air and institutional catering business and expanded property portfolio.",
            "pubDate": "2025-01-19T11:50:45.384601"
        }
    ]
}