{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-09T05:33:37.248252",
    "items": [
        {
            "title": "Japan's Nikkei crosses 44,000 for first time on trade, stimulus optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-crosses-44000-for-first-time-on-trade-stimulus-optimism/articleshow/123777242.cms",
            "description": "Nikkei in Japan surpasses 44,000 for the first time. Trade optimism and stimulus hopes boosted market sentiment. U.S. tariffs on Japanese autos are set to decrease. Shigeru Ishiba resigned and Sanae Takaichi is running for leadership. Semiconductor shares saw a rally. Advantest and other chip-related companies experienced significant gains. Sony also showed positive movement in the market.",
            "pubDate": "2025-09-09T03:40:24.065675"
        },
        {
            "title": "Hudco shares in focus after Rs 11,300 crore MoU with Nagpur Metro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hudco-shares-in-focus-after-rs-11300-crore-mou-with-nagpur-metro/articleshow/123777233.cms",
            "description": "Housing & Urban Development Corporation (Hudco) signed a non-binding MoU with Nagpur Metropolitan Region Development Authority (NMRDA) to provide up to Rs 11,300 crore for metro, housing, and infrastructure projects over five years. The pact, attended by Maharashtra CM Devendra Fadnavis, also covers consultancy and capacity-building support. Analysts expect the deal to strengthen Hudco’s long-term lending portfolio.",
            "pubDate": "2025-09-09T03:40:24.065793"
        },
        {
            "title": "Ashok Leyland, Tata Motors among 5 stocks with White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-tata-motors-among-5-stocks-with-white-marubozu-pattern/slideshow/123777194.cms",
            "description": "On September 8, five stocks from the Nifty500 pack appeared on the bullish “White Marubozu” scanner, according to technical scan data from stockedge.com.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for a given period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, the pattern signals strong buying pressure throughout the session. Traders often interpret it as a sign that buyers dominated from open to close, using it as an input for future trading decisions.Stocks on the White Marubozu scanner:",
            "pubDate": "2025-09-09T03:40:24.065897"
        },
        {
            "title": "Voltamp Transformers shares in focus as promoter plans 7% equity stake sale via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/voltamp-transformers-shares-in-focus-as-promoter-plans-7-equity-stake-sale-via-block-deal/articleshow/123777063.cms",
            "description": "Media reports suggest that Voltamp Transformers promoter Kunjal Patel will sell up to 7% equity via a $67 million block deal at a floor price of Rs 7,600 per share, potentially altering promoter holdings and attracting institutional interest.",
            "pubDate": "2025-09-09T03:40:24.066003"
        },
        {
            "title": "Godrej Consumer Products shares in focus on Rs 250 crore investment in Indonesia manufacturing facility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-products-shares-in-focus-on-rs-250-crore-investment-in-indonesia-manufacturing-facility/articleshow/123776825.cms",
            "description": "Godrej Consumer share price: Godrej Consumer Products has announced a Rs 250 crore investment in a new Indonesia facility. The expansion, set to boost the company's Home and Personal Care capacity by 15% over 18–36 months, underlines GCPL’s confidence in its Southeast Asia growth story.",
            "pubDate": "2025-09-09T03:40:24.066103"
        },
        {
            "title": "Infosys shares in focus as board to consider buyback proposal in upcoming board meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-as-board-to-consider-buyback-proposal-in-upcoming-board-meeting/articleshow/123776792.cms",
            "description": "Infosys share price: Infosys board is set to consider a buyback proposal on September 11. The move comes after a 25% stock slide in a year, aiming to boost investor confidence amid weak IT sector sentiment, muted growth guidance, and global headwinds.",
            "pubDate": "2025-09-09T03:40:24.066201"
        },
        {
            "title": "RailTel shares in focus after securing multiple work orders worth over Rs 700 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railtel-shares-in-focus-after-securing-multiple-work-orders-worth-over-rs-700-crore/articleshow/123776759.cms",
            "description": "RailTel share price: RailTel has secured orders worth over Rs 700 crore from the Bihar Education Project Council. The contracts include Smart Classrooms, ICT Labs, ISM Labs, and teaching materials across government schools, aimed at boosting digital education and bridging the learning gap.",
            "pubDate": "2025-09-09T03:40:24.066316"
        },
        {
            "title": "Nasdaq ends at record as markets eye interest rate relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-ends-at-record-as-markets-eye-interest-rate-relief/articleshow/123776655.cms",
            "description": "US equity indices surged, with the Nasdaq reaching a new record, fueled by anticipation of Federal Reserve interest rate cuts following benign inflation data. Sam Stovall of CFRA Research noted growing investor confidence in lower rates.",
            "pubDate": "2025-09-09T03:40:24.066413"
        },
        {
            "title": "At multi-year highs: Maruti, JSW Steel among 8 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-maruti-jsw-steel-among-8-stocks-witness-5-year-swing-high-breakout/slideshow/123776647.cms",
            "description": "In the Nifty200 pack, eight stocks witnessed a 5-year swing high at the close on September 8, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-09T03:40:24.066507"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Samvardhana Motherson, CEAT among 5 stocks that could give 16-41% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-samvardhana-motherson-ceat-among-5-stocks-that-could-give-16-41-return/slideshow/123776564.cms",
            "description": "Brokerages remain positive on select stocks, highlighting strong upside potential across sectors.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-09T03:40:24.066602"
        },
        {
            "title": "Positive Breakout: These 8 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/123776426.cms",
            "description": "In the Nifty200 pack, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on September 8, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-09T03:40:24.066693"
        },
        {
            "title": "Auto ancillaries in focus: Motilal Oswal bets on Apollo Tyres for short-term gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-ancillaries-in-focus-motilal-oswal-bets-on-apollo-tyres-for-short-term-gains/videoshow/123768692.cms",
            "description": "“We like Apollo Tyre stock as the technical structure of this stock seems very strong. The stock has given breakout from its falling trendline resistance with high volumes. Traders can buy for a target of Rs 530 in the near term,” Ruchit Jayantilal Jain, VP, Head – Equity Technical Research at Motilal Oswal Financial Services Limited, said.",
            "pubDate": "2025-09-09T03:40:24.066784"
        },
        {
            "title": "Time to increase risk-quotient? Optimistic & pessimistic statements don’t matter. 7 mid-caps with upside potential of over 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-increase-risk-quotient-optimistic-pessimistic-statements-dont-matter-7-mid-caps-with-upside-potential-of-over-26/articleshow/123776048.cms",
            "description": "Imagine a situation from, say, a decade back. The Union budget is announced. The government cuts excise duty across the board (there is no GST at that time). It also provides a massive tax relief to the middle class. How would the market react? Without a doubt, it would react very positively. Why? Because the excise cut would spur demand and help corporates. The tax cut would give more disposable income to the middle class. Now, the current government has done the same thing. The only difference is that it has not been done in a single budget, but in two budgets. One of which will get implemented on September 22.",
            "pubDate": "2025-09-09T03:40:24.066874"
        },
        {
            "title": "Jane Street faces off with India market regulator in court",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-faces-off-with-india-market-regulator-in-court/articleshow/123776082.cms",
            "description": "Jane Street Group is appealing a SEBI order accusing them of manipulative practices in India's derivatives market. The firm claims SEBI is withholding crucial documents needed for their defense, seeking a halt to regulatory action. The case has significant implications for global quantitative firms operating in India, as the court will consider whether SEBI is obstructing Jane Street's defense.",
            "pubDate": "2025-09-09T03:40:24.066968"
        },
        {
            "title": "Asian stocks rise to track US optimism on Fed cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-to-track-us-optimism-on-fed-cuts/articleshow/123776023.cms",
            "description": "Asian stocks experienced gains on Tuesday, mirroring Wall Street's positive sentiment fueled by anticipation of Federal Reserve rate cuts. Japan and South Korea saw morning trading increases, while Australia's equities dipped. This follows increased expectations of US rate cuts, boosting stocks near record highs.",
            "pubDate": "2025-09-09T03:40:24.067061"
        },
        {
            "title": "Stocks in news: Infosys, Hero MotoCorp, Coal India, Hudco, Voltamp Transformers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-hero-motocorp-coal-india-hudco-voltamp-transformers/articleshow/123770140.cms",
            "description": "The week saw markets open strong but close with moderate gains. Infosys will consider a buyback on September 11. Hudco is set to fund Nagpur Metro with Rs 11,300 crore. TVS Motor will pass on GST cut benefits. PCBL Chemical plans a capacity boost. Coal India explores data centers in old mines.",
            "pubDate": "2025-09-09T03:40:24.067151"
        },
        {
            "title": "Two billion-dollar disruptions, one Reliance: Can Mukesh Ambani deliver?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-billion-dollar-disruptions-one-reliance-can-mukesh-ambani-deliver/articleshow/123777735.cms",
            "description": "Mukesh Ambani's Reliance Industries is embarking on ambitious ventures in AI and FMCG, aiming for significant growth. Reliance Intelligence, a joint venture with Meta and Google, seeks to dominate India's AI landscape. Simultaneously, Reliance Consumer Products targets a staggering ₹1 lakh crore revenue within five years, challenging established FMCG players through strategic acquisitions and brand building.",
            "pubDate": "2025-09-09T04:28:48.617023"
        },
        {
            "title": "Sensex up over 250 pts, Nifty50 above 24,850 on Infosys buyback plans, banks rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-over-300-pts-nifty50-above-24800-on-infosys-buyback-plans-banks-rally/articleshow/123777593.cms",
            "description": "Indian benchmark indices Sensex and Nifty initiated trading on a positive note, fueled by Infosys' potential share buyback. Gains in banking and consumer discretionary stocks further bolstered the market. Optimism surrounding anticipated GST cuts and growing expectations of a U.S. rate cut this month also contributed to the upward momentum.",
            "pubDate": "2025-09-09T04:28:48.617169"
        },
        {
            "title": "Maruti Suzuki, HCL Tech among 8 F&O stocks with sharp OI build-up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-hcl-tech-among-8-fo-stocks-with-sharp-oi-build-up/slideshow/123777454.cms",
            "description": "As of September 8, futures open interest (OI) saw a notable surge in eight stocks from the NSE F&O pack, contributing to a total increase of over 5% compared with the previous session. A significant rise in futures OI indicates growth in the number of active, unexpired contracts for a security. This trend reflects greater participation, with traders either initiating new positions or expanding existing ones.",
            "pubDate": "2025-09-09T04:28:48.617278"
        },
        {
            "title": "SML Isuzu shares in focus as August sales nosedive 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sml-isuzu-shares-in-focus-as-august-sales-nosedive-15/articleshow/123777308.cms",
            "description": "SML Isuzu may be in focus on September 9 after reporting a 15% drop in August sales to 815 units and exports halving to 27, even as production rose 7% to 1,045 units. The update comes as the commercial vehicle maker prepares to rebrand as SML Mahindra, pending shareholder and regulatory approvals.",
            "pubDate": "2025-09-09T04:28:48.617378"
        },
        {
            "title": "Amanta Healthcare shares list at 7% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amanta-healthcare-shares-list-at-7-premium-over-ipo-price/articleshow/123778057.cms",
            "description": "Amanta Healthcare shares: Amanta Healthcare shares debuted with a premium, listing at Rs 135 on NSE and Rs 134 on BSE against an issue price of Rs 126. The Rs 126 crore IPO, a fresh issue, will fund expansion, including a new SteriPort line. Despite strong demand and oversubscription, analysts consider the IPO \"fully priced,\" citing a high price-to-earnings ratio.",
            "pubDate": "2025-09-09T04:43:20.653243"
        },
        {
            "title": "Hindalco, TVS Motor among 5 stocks to buy today for upside of up to 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindalco-tvs-motor-among-5-stocks-to-buy-today-for-upside-of-up-to-17/slideshow/123778051.cms",
            "description": "Indian headline index Nifty ended with minor gains and only a decisive breakout above the 25,000 can determine the direction, says Ajit Mishra, SVP - Research at Religare Broking as he sees support at 24,400–24,600. The D-Street is expected to see sector and stock specific action. ETMarkets has compiled a list of 5 technical and fundamental picks recommended by top brokerages to buy today. Take a look!",
            "pubDate": "2025-09-09T04:43:20.653374"
        },
        {
            "title": "Goel Construction shares surge 5% after listing with 15% premium on BSE SME platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goel-construction-shares-surge-5-after-listing-with-15-premium-on-bse-sme-platform/articleshow/123778718.cms",
            "description": "Goel Construction shares debuted strongly on the BSE SME platform, opening at a 15% premium of Rs 302.50. The IPO witnessed significant investor interest, being oversubscribed across all categories. The company, specializing in industrial and infrastructure projects, reported substantial revenue and profit growth in FY25, supported by a robust order book.",
            "pubDate": "2025-09-09T05:33:29.718414"
        },
        {
            "title": "Infosys buyback makes IT stocks break 5-day losing streak. Should you buy or sell?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-buyback-makes-it-stocks-break-5-day-losing-streak-should-you-buy-or-sell/articleshow/123778689.cms",
            "description": "Indian IT stocks rebounded after a five-day slump, spurred by Infosys' announcement of a potential share buyback on September 11. The Nifty IT index rose by 2%, with Infosys leading gains.",
            "pubDate": "2025-09-09T05:33:29.718551"
        },
        {
            "title": "Nasdaq to Pioneer Tokenised Securities Trading in US",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-to-pioneer-tokenised-securities-trading-in-us/slideshow/123778524.cms",
            "description": "Nasdaq is collaborating with U.S. regulators to introduce trading of tokenised securities. If approved, this would be the first instance of tokenised assets being traded on a major U.S. stock exchange. The move also represents a significant step toward integrating blockchain-based settlement into the national market system. (Source: Reuters)",
            "pubDate": "2025-09-09T05:33:29.718658"
        },
        {
            "title": "Buy, Sell or Hold: Citi maintains sell on Wipro; Antique sees over 50% upside in Ujjivan Small Finance Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-sell-on-wipro-antique-sees-over-50-upside-in-ujjivan-small-finance-bank/articleshow/123778607.cms",
            "description": "Brokerages gave mixed calls on key stocks. Citi maintained a Sell on Wipro, citing weak discretionary spending and competitive dynamics. Nuvama reiterated a Buy on Century Plyboards with a higher target, while Antique sees over 50% upside in Ujjivan Small Finance Bank.",
            "pubDate": "2025-09-09T05:33:29.718761"
        },
        {
            "title": "Hong Kong shares hit 4-year highs buoyed by US rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hk-shares-hit-4-year-highs-buoyed-by-us-rate-cut-bets/articleshow/123778399.cms",
            "description": "Hong Kong stocks hit four-year highs on Fed rate cut hopes, with the Hang Seng up 0.8%, while mainland markets fell as SMIC slumped 9% after an acquisition deal, dragging tech shares. Gold miners gained on rising prices, and Hong Kong property shares surged.",
            "pubDate": "2025-09-09T05:33:29.718877"
        },
        {
            "title": "Samvardhana Motherson among 4 stocks showing RSI Trending Up on September 8",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/samvardhana-motherson-among-4-stocks-showing-rsi-trending-up-on-september-8/slideshow/123778339.cms",
            "description": "Four stocks from the NSE large cap pack were highlighted in the RSI Trending Up scan on September 8, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-09T05:33:29.718978"
        },
        {
            "title": "SpiceJet shares jump 4% after airline completes $24 million payment to Credit Suisse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-jump-4-after-airline-completes-24-million-payment-to-credit-suisse/articleshow/123778223.cms",
            "description": "SpiceJet shares rose sharply after the airline completed a $24 million (approx. Rs 200 crore) payment to Credit Suisse, closing a long-standing liability. The full settlement strengthens its balance sheet, boosts investor confidence, and marks a key step in its turnaround efforts.",
            "pubDate": "2025-09-09T05:33:29.719073"
        },
        {
            "title": "Glenmark shares gain 2% as firm receives $700 million upfront payment from AbbVie deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/glenmark-shares-gain-2-as-firm-receives-700-million-upfront-payment-from-abbvie-deal/articleshow/123778187.cms",
            "description": "Glenmark Pharmaceuticals' shares surged following its subsidiary's $700 million upfront payment from AbbVie for an exclusive licensing agreement concerning IGI's lead drug candidate, ISB 2001. The deal grants AbbVie rights in key markets, while Glenmark retains commercialization in emerging regions.",
            "pubDate": "2025-09-09T05:33:29.719170"
        }
    ]
}