{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-10T13:41:48.550314",
    "items": [
        {
            "title": "D-Street sees worst week since September 2025 amid tariff fears, FPI selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-sees-worst-week-since-september-2025-amid-tariff-fears-fpi-selling/articleshow/126447161.cms",
            "description": "The Indian stock market has been on a downward trend, recording losses for the fifth straight day. Investors are pulling back on their portfolios in light of impending US job statistics and a critical Supreme Court verdict on tariffs.",
            "pubDate": "2026-01-10T05:23:09.391426"
        },
        {
            "title": "Sebi approves 5 IPOs including that of Kissht and Alcobrew Distilleries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-approves-5-ipos-including-that-of-kissht-and-alcobrew-distilleries/articleshow/126447022.cms",
            "description": "Sebi has approved five IPOs across sectors including digital lending, alcoholic beverages, textiles and precision engineering. Major issuers include Kissht, Alcobrew Distilleries, Aastha Spintex, Indo MIM and Kusumgar, signalling a strong and diverse primary market pipeline.",
            "pubDate": "2026-01-10T05:23:09.391554"
        },
        {
            "title": "Swiggy, Infosys among 17 stocks in BNP Paribas' top buy ideas for 2026. Check list here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-infosys-among-17-stocks-in-bnp-paribas-top-buy-ideas-for-2026-check-list-here/slideshow/126447880.cms",
            "description": "BNP Paribas expects 2026 to be a stronger year for Indian equities, with the Nifty 50 seen delivering mid-teens returns and a December 2026 target of 29,500, driven largely by earnings growth rather than valuation re-rating. The brokerage is more constructive on large caps and domestic-oriented sectors such as banks, autos, telecom and consumer staples, citing policy support, improving earnings visibility and resilient domestic flows. Here are the brokerage's top buy ideas for 2026:",
            "pubDate": "2026-01-10T05:41:11.681997"
        },
        {
            "title": "Concurrent Losers: 12 stocks decline for five consecutive sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-losers-12-stocks-decline-for-five-consecutive-sessions/slideshow/126448089.cms",
            "description": "Over the five trading sessions ending January 9, the Sensex benchmark slipped 2.55%, or 2,186 points, settling at 83,576.24, with declines recorded in each of the five sessions. Reflecting broader market weakness, around 12 stocks from the BSE 100 index fell consistently throughout the week, posting cumulative losses of approximately 3% to 9%. (Data Source: ACE Equity)",
            "pubDate": "2026-01-10T05:59:12.303329"
        },
        {
            "title": "TCS, Kotak Bank among 8 stocks nearing ex-dates for bonus, dividend, and stock split. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-kotak-bank-among-8-stocks-nearing-ex-dates-for-bonus-dividend-and-stock-split-do-you-own-any/slideshow/126448545.cms",
            "description": "Corporate actions such as stock splits, bonus issues, and dividends continue to be key events that influence short-term market dynamics. While these moves don’t alter a company’s underlying fundamentals, they often increase liquidity, bring in more retail participation, and sometimes act as triggers for price action.Over the coming week, several companies have lined up notable corporate actions—from splits that lower the entry price to bonus issues that reward long-term holders, and dividends that deliver direct returns. The following slides outline these events, their effective dates, and details as per StockEdge data:",
            "pubDate": "2026-01-10T06:35:11.772250"
        },
        {
            "title": "India’s defence order pipeline hits record levels; Astra Microwave, Bharat Dynamics top buys",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-defence-order-pipeline-hits-record-levels-astra-microwave-bharat-dynamics-top-buys/articleshow/126448195.cms",
            "description": "India's defence manufacturing sector sees enhanced medium-term visibility due to accelerated capital acquisition approvals, with FY26 year-to-date clearances nearly double the annual outlay.  This robust pipeline, spanning diverse military needs and emphasizing integrated systems, de-risks future order inflows for the sector over the next two to four years.",
            "pubDate": "2026-01-10T06:35:11.772373"
        },
        {
            "title": "Moody’s affirms Shriram Finance’s Ba1 rating, outlook revised to positive after MUFG Bank investment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/moodys-affirms-shriram-finances-ba1-rating-outlook-revised-to-positive-after-mufg-bank-investment/articleshow/126448765.cms",
            "description": "Moody’s has affirmed Shriram Finance’s Ba1 rating and revised its outlook to positive following MUFG Bank’s planned $4.4 billion investment for a 20% stake. The capital infusion is expected to strengthen SFL’s capitalisation, funding access, and profitability, positioning it among India’s highest-capitalised non-banking finance companies.",
            "pubDate": "2026-01-10T07:13:21.422793"
        },
        {
            "title": "Retail investors bet big on these 12 smallcaps; stocks rally up to 65% in FY26, Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-bet-big-on-these-12-smallcaps-stocks-rally-up-to-65-in-fy26-do-you-own-any/slideshow/126448815.cms",
            "description": "As the December quarter earnings unfold, shareholding data for nearly 170 smallcap companies is coming to light. While more filings are expected in the coming weeks, early data already tells an intriguing story. We tracked small-cap stocks where retail investors—resident individuals holding up to Rs 2 lakh—have steadily increased stakes over the last three quarters of FY26. After filtering, 34 stocks made the cut.",
            "pubDate": "2026-01-10T07:13:21.422904"
        },
        {
            "title": "Europe stocks close at record as Glencore jumps on Rio Tinto interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/europe-stocks-close-at-record-as-glencore-jumps-on-rio-tinto-interest/articleshow/126449122.cms",
            "description": "European stock markets reached a new peak on Friday. Glencore's significant jump fueled the rise. Technology stocks also performed strongly, marking their best week in almost two years. This rebound shows investor resilience despite global concerns. Defence stocks saw notable weekly gains. The US jobs report indicated cooling growth, reinforcing expectations of steady interest rates.",
            "pubDate": "2026-01-10T07:30:31.970872"
        },
        {
            "title": "F&O Talk | Nifty cracks after new high: Is this the start of a deeper fall? Sudeep Shah answers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-talk-nifty-cracks-after-new-high-is-this-the-start-of-a-deeper-fall-sudeep-shah-answers/articleshow/126450308.cms",
            "description": "Markets witnessed one of the sharpest weekly declines in recent months as global risks and heavy selling dragged indices lower. Technical expert Sudeep Shah explains whether this move signals deeper correction and outlines key levels, sector strategies and near-term market triggers.",
            "pubDate": "2026-01-10T09:16:45.606208"
        },
        {
            "title": "Buy right in 2026 & sit quietly till early 2029: 12 large-cap stocks from different sectors with upside potential of up to 33%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-right-in-2026-sit-quietly-till-early-2029-12-large-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-33/articleshow/126452171.cms",
            "description": "Stock brokers and mutual funds show returns in different time frames. YTD, six months, or one, three, and five years are the usual options. When we discuss returns, it is usually a one-year time frame that is looked at. Now, here’s a suggestion: Change the perspective from one to three years for not just returns, but for everything related to the stock market. Money to be invested, for three years; minimum period of SIP, three years. Reason: The way things are shaping up, the next three years are going to be volatile. And the best way to deal with volatility is to think deeper, act slower, and keep a long-term perspective.",
            "pubDate": "2026-01-10T12:40:00.849711"
        },
        {
            "title": "Dalal Street Week Ahead: With momentum fading, can Nifty defend 25,300?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-week-ahead-with-momentum-fading-can-nifty-defend-25300/articleshow/126452239.cms",
            "description": "Nifty broke below its 500-point trading range, ending the week down 2.45% amid global uncertainty and a spike in volatility. Technical indicators signal weakening momentum, with support at 25,500–25,300 crucial. Sectoral trends show Services, Pharma, Infra and BFSI outperforming, while FMCG, Energy and Realty lag on relative strength.",
            "pubDate": "2026-01-10T12:40:00.849832"
        },
        {
            "title": "How 2026 is shaping up for Indian investors? Gurmeet Chadha shares his asset class view",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-2026-is-shaping-up-for-indian-investors-gurmeet-chadha-shares-his-asset-class-view/articleshow/126453344.cms",
            "description": "As global macro conditions shift, investors are rethinking asset allocation for 2026. Gurmeet Chadha of Complete Circle Consultants highlights constructive prospects for Indian equities, caution on silver, moderation in global AI-led trades, and potential outperformance in long-duration bonds, supported by fiscal strength and likely inclusion in the global bond index.",
            "pubDate": "2026-01-10T13:41:47.965385"
        }
    ]
}