{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-25T17:36:31.415637",
    "items": [
        {
            "title": "Listed startups get a delivery of reality: It's hot on the Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/listed-startups-get-a-delivery-of-reality-its-hot-on-the-street/articleshow/118542856.cms",
            "description": "The tide is expected to turn for some of the companies including Swiggy and Mobkwik over the next few quarters. ETIG offers a snapshot of key takeaways from the recently concluded results season for each of these startups.",
            "pubDate": "2025-02-25T17:36:24.140167"
        },
        {
            "title": "Buffett's Berkshire posts record profit on insurance, investments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/buffetts-berkshire-posts-record-profit-on-insurance-investments/articleshow/118481927.cms",
            "description": "Operating profit surged 27% to $47.44 billion in 2024, up from $37.35 billion in the previous year. The fourth quarter set a record, with operating profit soaring 71% to $14.53 billion ($1,010 per Class A share), driven by strong insurance gains and foreign currency benefits, compared to $8.48 billion a year earlier.",
            "pubDate": "2025-02-25T17:36:24.140296"
        },
        {
            "title": "StanC profit before tax takes a hit on higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/stanc-profit-before-tax-takes-a-hit-on-higher-provisions/articleshow/118469139.cms",
            "description": "Standard Chartered Bank reported a modest 3% increase in profit before tax in India for 2024, driven by higher fee and trading income despite a decline in net interest income. However, a surge in provision costs significantly impacted profit growth, and the bank's India loan book shrank slightly.",
            "pubDate": "2025-02-25T17:36:24.140400"
        },
        {
            "title": "Provision rise drags down StanC 2024 India profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/provision-rise-drags-standard-chartereds-q3-profit-growth-in-india/articleshow/118456456.cms",
            "description": "Standard Chartered's India profit before tax rose just 3% to $308 million in 2024, impacted by a 1.5x rise in provisions. Despite a 10% operating income increase, net interest income declined, while trading and fee income helped offset losses.",
            "pubDate": "2025-02-25T17:36:24.140503"
        },
        {
            "title": "Alibaba Q3 Results: Co beats revenue estimates on strong year-end shopping sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/alibaba-q3-results-co-beats-revenue-estimates-on-strong-year-end-shopping-sales/articleshow/118418231.cms",
            "description": "China's Alibaba Group Holding on Wednesday topped Wall Street expectations for third-quarter revenue, on strong year-end shopping sales and the success of its strategy to attract cost-conscious consumers.",
            "pubDate": "2025-02-25T17:36:24.140607"
        },
        {
            "title": "Bharti Telecom's Q3FY25 net loss widened due to higher finance costs linked to Airtel share buys: Singtel",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bharti-telecoms-q3fy25-net-loss-widened-due-to-higher-finance-costs-linked-to-airtel-share-buys-singtel/articleshow/118383098.cms",
            "description": "Singapore Telecommunications: Bharti Telecom’s net loss widened in Q3 FY25 due to higher finance costs from additional borrowings to acquire more Airtel shares. Singapore-based Singtel, which owns 49.44% of Bharti Telecom, reported a negative pre-tax contribution from the company. Singtel’s overall net profit rose 22%, driven by stronger contributions from Bharti Airtel and Airtel Africa.",
            "pubDate": "2025-02-25T17:36:24.140708"
        }
    ]
}