{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-17T16:58:52.177767",
    "items": [
        {
            "title": "HC discharges Gautam Adani, Rajesh Adani in market regulations 'violation' case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hc-discharges-gautam-adani-rajesh-adani-in-market-regulations-violation-case/articleshow/119114154.cms",
            "description": "The Bombay High Court on Monday discharged Adani Enterprises Ltd, group Chairman Gautam Adani and MD Rajesh Adani from a case of alleged violations of market regulations involving Rs 388 crore, saying no case of cheating or criminal conspiracy was made out.",
            "pubDate": "2025-03-17T10:49:42.127190"
        },
        {
            "title": "Market Wrap: Sensex ends 341 points higher, Nifty over 22,500 led by banks, auto stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-ends-341-points-up-nifty-gains-over-100-points-led-by-banks-auto-stocks/articleshow/119113609.cms",
            "description": "Indian benchmark indices ended in the green today (Monday, March 17) led by gains in bank and auto stocks while individually ICICI Bank and Axis Bank called the shots. Favaourable global cues also helped bulls consolidate their position.",
            "pubDate": "2025-03-17T10:49:42.127319"
        },
        {
            "title": "These 9 stocks added by over 20 MFs in February – see how they fared in CY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-stocks-added-by-over-20-mfs-in-february-see-how-they-fared-in-cy25/slideshow/119108206.cms",
            "description": "In February 2025, mutual funds (MFs) continued to have a positive outlook on Indian equities, despite market volatility and weakness, reflected in their net investments of about Rs 47,933 crore. According to an ETMarkets analysis, nine stocks were included in the portfolios of over 20 MFs in February 2025, compared to January 2025. Of these, four stocks have posted positive returns in CY25 so far, while five have underperformed. (Data Source: ACE MF | ACE Equity)",
            "pubDate": "2025-03-17T10:49:42.127450"
        },
        {
            "title": "European shares little changed on trade war jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-little-changed-on-trade-war-jitters/articleshow/119109741.cms",
            "description": "European shares were largely unchanged on Monday as investors started the new trading week with slight caution around the escalating trade war, while focus remained on the week's upcoming parliamentary vote on Germany's debt reform deal.",
            "pubDate": "2025-03-17T10:49:42.127661"
        },
        {
            "title": "JM Financial sees 38% upside in Varun Beverages, says correction overdone, reaffirms Buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-sees-38-upside-in-varun-beverages-says-correction-overdone-reaffirms-buy-rating/articleshow/119108738.cms",
            "description": "JM Financial maintains a 'Buy' on Varun Beverages with a Rs 675 target, citing strong domestic and international growth drivers. Despite competition from Campa, PepsiCo, and Coca-Cola retain dominance. The company plans Rs 2,000 crore capex for expansion, including Africa.",
            "pubDate": "2025-03-17T10:49:42.127899"
        },
        {
            "title": "Japan's Nikkei ends higher as Wall Street surge boosts sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-higher-as-wall-street-surge-boosts-sentiment/articleshow/119107324.cms",
            "description": "Japan's Nikkei share average increased almost 1% on Monday, boosted by last week's significant gains in U.S. stocks and a U.S. Congressional decision that avoided a government shutdown. Notable gains were seen in semiconductor and defense stocks as investors adjusted their strategies based on improved market sentiment.",
            "pubDate": "2025-03-17T10:49:42.127996"
        },
        {
            "title": "When mini liquor bottles and single cigarette sales speak, economists hear recession warning",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/when-mini-liquor-bottles-and-single-cigarette-sales-speak-economists-hear-recession-warning/articleshow/119107290.cms",
            "description": "Economists describe a recession as a \"substantial downturn in economic activity\" lasting several months, typically characterized by a decline in GDP, higher unemployment, and reduced industrial output.",
            "pubDate": "2025-03-17T10:49:42.128094"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and an upside potential of up to 42%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-an-upside-potential-of-up-to-42/articleshow/119106961.cms",
            "description": "As the market shows signs of recovery, here are some points to consider before taking any decision based on the short-term movement of indices. Volatility is not going anywhere anytime soon. But volatility is an opportunity if you are able to do just two things: First, buy quality stocks, and for the long term. Second, focus on the business you are going to own. Buy the right business, even if expensive, and you will see returns over the long term. Our selected stocks today depict a strong upward trajectory in their overall average score, which is based on five key pillars – earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-03-17T10:49:42.128188"
        },
        {
            "title": "FY25 heading for worst ever equity selloff amid weakening rupee, sustained FPI secondary selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fy25-heading-for-worst-ever-equity-selloff-amid-weakening-rupee-sustained-fpi-secondary-selling/articleshow/119106691.cms",
            "description": "Foreign portfolio investors (FPIs) have sold Rs 1.5 lakh crore worth of equities in FY25, marking the worst annual selloff in rupee terms. Despite sustained outflows, domestic funds invested a record Rs 4.7 lakh crore, driven by strong retail participation.",
            "pubDate": "2025-03-17T10:49:42.128284"
        },
        {
            "title": "SBI, NMDC among 10 stocks that can rally up to 38%. Time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-nmdc-among-10-stocks-that-can-rally-up-to-38-time-to-buy/slideshow/119106475.cms",
            "description": "The Indian equity markets have been on a downward streak due to concerns over valuations, particularly in the mid and small-cap sectors, global uncertainties stemming from President Trump’s tariff threats, and, most significantly, a slowing economy.Amid this, domestic brokerage firm LKP Securities highlighted that a sharp sell-off has lowered Nifty 50's CY2025 PE to 18.8x, presenting an attractive opportunity. Technically, Nifty has dropped 17% in five months, pushing the RSI (14) to 22—a level last seen during COVID-19—indicating deeply oversold conditions and high rebound potential. Given this backdrop, LKP Securities has identified 10 large and large-midcap companies poised for gains of up to 38%.",
            "pubDate": "2025-03-17T10:49:42.128399"
        },
        {
            "title": "Berkshire raises stakes in five Japanese trading houses to near 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-raises-stakes-in-five-japanese-trading-houses-to-near-10/articleshow/119106121.cms",
            "description": "Warren Buffett's Berkshire Hathaway has expanded its investments in five leading Japanese trading houses, increasing its stakes in Mitsui, Mitsubishi, Sumitomo, Itochu, and Marubeni. These trading firms, known as 'sogo shosha,' handle various materials, products, and food, and provide key logistical support. This move follows an agreement to moderately increase Berkshire's ownership limits in these firms.",
            "pubDate": "2025-03-17T10:49:42.128494"
        },
        {
            "title": "AIF Tracker: Vivriti AMC, Northern Arc AMC record over 10% return in February 2025 for crorepati investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aif-tracker-vivriti-amc-northern-arc-amc-record-over-10-return-in-february-2025-for-crorepati-investors/articleshow/119106074.cms",
            "description": "In February 2025, 13% of alternative investment funds (AIFs) reported positive returns, with Vivriti AMC and Northern Arc AMC among the top performers. Category II funds dominated, reflecting a mix of equity and debt investments. Meanwhile, most Category III AIFs, focused on short-term trading, showed negative returns.",
            "pubDate": "2025-03-17T10:49:42.128591"
        },
        {
            "title": "BPCL, Dabur among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bpcl-dabur-among-5-stocks-with-short-buildup/slideshow/119105953.cms",
            "description": "A short buildup occurs when open interest and trading volumes rise, accompanied by a decrease in the stock price in the Futures and Options segment. This suggests that traders are anticipating further price declines and are establishing short positions. In Monday's trading session, five stocks saw notable short positions. Here's the list:",
            "pubDate": "2025-03-17T10:49:42.128686"
        },
        {
            "title": "Stocks to Buy |  Manish Sonthalia on top investment themes for FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-manish-sonthalia-on-top-investment-themes-for-fy26/slideshow/119105738.cms",
            "description": "Market Expert Manish Sonthalia in an interview to ET Now said that the most negative factors are already priced into the market. The US dollar is expected to depreciate, boosting commodities and emerging markets like India. The Indian equity market is likely near its bottom, with consumption as the key theme for FY26.",
            "pubDate": "2025-03-17T10:49:42.128780"
        },
        {
            "title": "Stocks to Buy | Stock Picking Over Market Trends: Rahul Shah’s Investment Strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-stock-picking-over-market-trends-rahul-shahs-investment-strategy/slideshow/119103159.cms",
            "description": "Market Expert Rahul Shah in an interview to ET Now said that the market has experienced a cool-off following a steep correction. However, a base is being formed before the next takeoff. He highlights that the market is shifting from a broad-based rally to a more stock-specific movement, making selective stock-picking essential for investors.",
            "pubDate": "2025-03-17T10:49:42.128874"
        },
        {
            "title": "For investors with ability to understand risk & reward: 5 mid-cap stocks from different sectors with upside potential of up to 44%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-ability-to-understand-risk-reward-5-mid-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-44/articleshow/119115202.cms",
            "description": "If one were to assume that the street has a higher probability of being bullish than bearish, one thing which investors should focus on is committing fewer mistakes in this phase of recovery. Mistakes are an integral part of the learning curve on the stock market. But there are mistakes, and there are silly mistakes. Avoid or minimize the latter. How? Because it is mid-cap stocks that have got battered in the last two months, it is probably tough to think of them rationally. But it is important to do so if you want to make that extra bit of return for which all the risk is taken.",
            "pubDate": "2025-03-17T11:13:17.360675"
        },
        {
            "title": "Gainers & Losers: Ola Electric, Volats among 6 stocks in action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-ola-electric-volats-among-6-stocks-in-action-on-monday/slideshow/119114773.cms",
            "description": "",
            "pubDate": "2025-03-17T11:13:17.360797"
        },
        {
            "title": "PC Jeweller board approves allotment of 51.7 crore shares to 14 banks for settling Rs 1,510 crore debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pc-jeweller-board-approves-allotment-of-51-7-crore-shares-to-14-banks-for-settling-rs-1510-crore-debt/articleshow/119125348.cms",
            "description": "PC Jeweller Ltd has approved the issuance of 51.71 crore shares to a consortium of 14 banks to settle a debt of Rs 1,510 crore. The shares are priced at Rs 29.20 each under a Joint Settlement Agreement. The new shares will have the same rights as existing ones.",
            "pubDate": "2025-03-17T16:58:32.927140"
        },
        {
            "title": "Religare Enterprises to approach Burmans for fund infusion, commissions governance review",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/religare-enterprises-to-approach-burmans-for-fund-infusion-commissions-governance-review/articleshow/119124702.cms",
            "description": "Religare Enterprises' board seeks urgent funding from new promoters, the Burman Group, to bridge a cash flow gap. A governance review of REL and its subsidiaries has been commissioned, with Trilegal and Grant Thornton Bharat LLP leading the assessment.",
            "pubDate": "2025-03-17T16:58:32.927260"
        },
        {
            "title": "Breakout Stocks: How to trade Avanti Feeds, SRF and Kotak Mahindra Bank that hit fresh 52-week high?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-avanti-feeds-srf-and-kotak-mahindra-bank-that-hit-fresh-52-week-high/slideshow/119124123.cms",
            "description": "Indian markets snapped a 5-day losing streak to close in the green. The BSE Sensex was up more than 300 points while the Nifty50 closed above 22,500.",
            "pubDate": "2025-03-17T16:58:32.927369"
        },
        {
            "title": "Baskar Babu buys 1.5 lakh equity shares of Suryoday SFB, promoter holding rises to 22.44%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/baskar-babu-buys-1-5-lakh-equity-shares-of-suryoday-sfb-promoter-holding-rises-to-22-44/articleshow/119124404.cms",
            "description": "Baskar Babu Ramachandran, the promoter and managing director of Suryoday Bank, has raised his holding in the bank to 5.18% from 5.04% earlier, with the purchase of 1.5 lakh equity shares through open market operations.",
            "pubDate": "2025-03-17T16:58:32.927469"
        },
        {
            "title": "Investments in Vedanta 5 years ago would be worth 4.7 times now: Chairman Anil Agarwal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investments-in-vedanta-5-years-ago-would-be-worth-4-7-times-now-chairman-anil-agarwal/articleshow/119122965.cms",
            "description": "Vedanta Chairman Anil Agarwal highlighted that investments in the company over the past five years have grown 4.7 times, driven by capital appreciation and an 81% dividend yield. The mining giant plans to demerge its businesses, unlocking further value for shareholders.",
            "pubDate": "2025-03-17T16:58:32.927568"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/119122869.cms",
            "description": "Indian markets closed higher on Monday, led by financial and healthcare stocks. Analysts anticipate range-bound movement amid tariff uncertainties, with investor focus on upcoming FED and BOJ meetings for economic cues.",
            "pubDate": "2025-03-17T16:58:32.927668"
        },
        {
            "title": "Sebi resolves nearly 5,000 complaints through SCORES in February",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-resolves-nearly-5000-complaints-through-scores-in-february/articleshow/119122661.cms",
            "description": "Capital markets regulator Sebi on Monday said it has disposed of 4,986 complaints in February through its grievance redressal facilitation SCORES platform.",
            "pubDate": "2025-03-17T16:58:32.927763"
        },
        {
            "title": "Rupee ends stronger for third day in a row, closes at 86.80 vs US dollar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rupee-ends-stronger-for-third-day-in-a-row-closes-at-86-80-vs-us-dollar/articleshow/119122301.cms",
            "description": "The rupee strengthened by 20 paise against the dollar, closing at 86.80, driven by inflows. However, experts warn that sustained inflows are needed to maintain stability.",
            "pubDate": "2025-03-17T16:58:32.927874"
        },
        {
            "title": "Market Trading Guide: HUDCO, ICICI Bank are among 5 stock recommendations for Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-hudco-icici-bank-are-among-5-stock-recommendations-for-tuesday/slideshow/119122068.cms",
            "description": "India’ headline indices ended in the green on Monday as favourable global cues gave a headstart to the domestic markets. The gains were ed by banks and auto stocks. Individually ICICI Bank and Axis Bank were the biggest contributors. While the S&P BSE Sensex settled at 74,169.95, up by 341.04 points or 0.46%, the broader Nifty closed at 22,508.75, higher by 111.55 points or 0.5%.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that the Nifty has been forming a symmetrical triangle pattern on the hourly chart, which is a continuation pattern. For the past three days, Nifty has largely remained within the range of 22,350–22,550, he added. \"A decisive move above 22,550 could trigger a meaningful rally in the short term. Conversely, a decisive fall below 22,350 could weaken sentiment in the short term,\" De said.Here are 5 stock recommendations for Tuesday:",
            "pubDate": "2025-03-17T16:58:32.927970"
        },
        {
            "title": "Two Sharp with ET: FIIs keep selling in March; US big tech stocks cheapest in months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-fiis-keep-selling-in-march-us-big-tech-stocks-cheapest-in-months/videoshow/119121400.cms",
            "description": "Foreign investors continue their massive sell-off in Indian equities, with FPIs offloading over ₹1.42 lakh crore in 2025. In March alone, they pulled out over ₹30,000 crore, while domestic institutional investors (DIIs) remained net buyers. Meanwhile, US Big Tech stocks have hit their lowest levels in months. The Magnificent Seven (Apple, Microsoft, Nvidia, Alphabet, Amazon, Meta, Tesla) are at their lowest valuations since September 2024. The S&P 500 has dropped 10% from its peak, sparking debate—Is this a buying opportunity? Meghna Chadha with the complete analysis on Two Sharp with ET.",
            "pubDate": "2025-03-17T16:58:32.928064"
        },
        {
            "title": "Banking sector outlook 2025: Suresh Ganapathy’s perspective on growth and valuations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banking-sector-outlook-2025-suresh-ganapathys-perspective-on-growth-and-valuations/slideshow/119120700.cms",
            "description": "Suresh Ganapathy, MD, Macquarie Capital, shares his insights on the Indian banking sector, highlighting its resilience amid global uncertainty. He sees stable credit growth, attractive valuations, and easing liquidity as key drivers for banks and NBFCs, with private sector banks and retail-focused lenders leading the next phase of growth.",
            "pubDate": "2025-03-17T16:58:32.928155"
        },
        {
            "title": "US stocks ticked higher after latest economic data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-after-latest-economic-data/articleshow/119120417.cms",
            "description": "US stocks are steadier this Monday but concerns persist with the Federal Reserve's upcoming interest rate decision and ongoing trade tensions. The S&P 500, Dow Jones Industrial Average, and Nasdaq saw slight upticks. Treasury yields fluctuated, reflecting mixed economic confidence. European and Asian markets rose, with positive factory data from China sparking optimism.",
            "pubDate": "2025-03-17T16:58:32.928244"
        },
        {
            "title": "Buy or Sell | Jyotivardhan Jaipuria’s investment insights across key sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-or-sell-jyotivardhan-jaipurias-investment-insights-across-key-sectors/slideshow/119120347.cms",
            "description": "Jyotivardhan Jaipuria shares his perspective on the Indian stock market, highlighting sectoral opportunities and risks. He sees value in banking stocks due to attractive valuations, prefers pharma over IT, remains cautious on metals, and favors consumer discretionary over FMCG. He also identifies key investment themes for 2025.",
            "pubDate": "2025-03-17T16:58:32.928335"
        },
        {
            "title": "Shalimar Paints: 34 entities settle takeover norms violation case with Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shalimar-paints-34-entities-settle-takeover-norms-violation-case-with-sebi/articleshow/119119212.cms",
            "description": "As many as 34 entities have settled proceedings related to alleged violations of 'takeover' norms in the matter of Shalimar Paints Ltd with markets regulator Sebi on payment of Rs 3.04 lakh.",
            "pubDate": "2025-03-17T16:58:32.928434"
        },
        {
            "title": "What is a common success mantra of stock traders? Zerodha's Nithin Kamath's take",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-is-a-common-success-mantra-of-stock-traders-zerodhas-nithin-kamaths-take/articleshow/119118839.cms",
            "description": "Nithin Kamath: Zerodha CEO Nithin Kamath emphasized risk management as key to trading success, especially in volatile markets. He shared insights from Jerry Parker, stressing reducing positions in downturns and allowing winning trades to run for long-term profitability.",
            "pubDate": "2025-03-17T16:58:32.928530"
        },
        {
            "title": "These 6 smallcap stocks hit 52-week highs, rallied up to 87% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-smallcap-stocks-hit-52-week-highs-rallied-up-to-87-in-a-month/slideshow/119117757.cms",
            "description": "",
            "pubDate": "2025-03-17T16:58:32.928620"
        }
    ]
}