{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-30T02:03:51.131247",
    "items": [
        {
            "title": "GIFT Nifty down 55 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127788699.cms",
            "description": "Indian equity markets closed mixed on Thursday, buoyed by pre-Budget anticipation and positive sentiment surrounding the India-EU free trade agreement. Analysts anticipate a rangebound market with stock-specific movements dominating ahead of the Budget announcement. The rupee hit an all-time closing low against the dollar.",
            "pubDate": "2026-01-30T02:03:44.692727"
        },
        {
            "title": "Stocks in news: Meesho, ITC, Paytm, Nestle, Vedanta, Tata Consumer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-meesho-itc-paytm-nestle-vedanta-tata-consumer/articleshow/127788682.cms",
            "description": "Indian markets saw a slight rise on Thursday amidst mixed signals. Key companies like Paytm and ITC released their third-quarter financial results. Paytm reported a significant profit jump, while ITC's profit remained flat. Tata Motors experienced a profit decline. Other companies like Vedanta and Tata Consumer are also in focus due to corporate developments.",
            "pubDate": "2026-01-30T02:03:44.692857"
        },
        {
            "title": "US stock futures fall on Apple warning, gold up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-futures-fall-on-apple-warning-gold-up/articleshow/127788649.cms",
            "description": "US equity futures declined as Apple warned of margin pressures, fueling concerns about AI investment returns. Gold and silver saw gains, while Asian shares edged higher. Investors are increasingly wary of the timing and profitability of massive tech spending on artificial intelligence.",
            "pubDate": "2026-01-30T02:03:44.693036"
        },
        {
            "title": "Foreign investors rejig offshore structures to satisfy Indian tax rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-investors-rejig-offshore-structures-to-satisfy-indian-tax-rules/articleshow/127788529.cms",
            "description": "Foreign investors are bolstering offshore arms with tangible operations to demonstrate substance, following a Supreme Court ruling that denied tax benefits to entities lacking it. Measures include appointing local directors and hiring office space to prove these entities are not merely paper companies designed to evade Indian taxes.",
            "pubDate": "2026-01-30T02:03:44.693215"
        },
        {
            "title": "Adani Group plans up to 1.5 billion yen fundraising from Japan after rating upgrade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-plans-up-to-1-5-billion-yen-fundraising-from-japan-after-rating-upgrade/articleshow/127788457.cms",
            "description": "Adani Group is set to borrow between $1 billion and $1.5 billion in Japanese yen. This move follows credit upgrades from a Japanese rating agency. The funds will be raised over the next 12 to 18 months. This will increase Adani's access to long-term capital from Japan. Japanese investors offer long maturities, benefiting infrastructure-heavy groups.",
            "pubDate": "2026-01-30T02:03:44.693590"
        }
    ]
}