{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-14T10:49:52.653990",
    "items": [
        {
            "title": "FII activity, India-US trade deal among 5 key cues that could set the tone for D-St this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-activity-india-us-trade-deal-among-5-key-cues-that-could-set-the-tone-for-d-st-this-week/articleshow/125957193.cms",
            "description": "Key factors will shape the stock market this week. Domestic data releases like WPI inflation and trade balance are expected. Progress on the India-US trade deal is also a focus. Technical indicators suggest Nifty needs to hold support levels. FII selling continues, while DII buying provides some stability. Currency movements will also be watched closely.",
            "pubDate": "2025-12-14T04:22:39.941193"
        },
        {
            "title": "Fresh delivery: Swiggy raises Rs 10,000 cr via QIP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fresh-delivery-swiggy-raises-10kcr-via-qip/articleshow/125957160.cms",
            "description": "In a significant step towards enhancing its market position, food delivery giant Swiggy has raised Rs 10,000 crore through a savvy institutional placement. This capital injection is poised to strengthen its fundamental operations and propel the growth trajectory of Instamart, its rapid commerce division.",
            "pubDate": "2025-12-14T04:22:39.941302"
        },
        {
            "title": "10 Nifty500 stocks with upside potential of up to 50%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-nifty500-stocks-with-upside-potential-of-up-to-50-do-you-own-any/slideshow/125958050.cms",
            "description": "Analyst forecasts go beyond mere numbers; they offer a strategic lens into future market potential. For investors on the lookout for the next breakout opportunity, certain Nifty500 stocks stand out as compelling picks. Consensus estimates from Trendlyne indicate that many Nifty500 stocks have the potential to deliver significant returns over the coming 12 months.",
            "pubDate": "2025-12-14T05:51:06.540263"
        },
        {
            "title": "Corona Remedies and Wakefit Innovations to list tomorrow; GMP suggests sharp upside for pharma play",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corona-remedies-and-wakefit-innovations-to-list-tomorrow-gmp-suggests-sharp-upside-for-pharma-play/articleshow/125957953.cms",
            "description": "Corona Remedies and Wakefit Innovations are set to list amid divergent grey market signals. Corona Remedies commands strong listing expectations backed by robust subscriptions and profitability, while Wakefit’s muted GMP reflects cautious sentiment towards consumer-facing growth businesses, highlighting current investor preference for earnings visibility and consistency.",
            "pubDate": "2025-12-14T05:51:06.540385"
        },
        {
            "title": "India’s wealth creation hits record Rs 148 trillion. Who led and what to learn?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-wealth-creation-hits-record-rs-148-trillion-who-led-and-what-to-learn/slideshow/125957921.cms",
            "description": "The Motilal Oswal 30th Annual Wealth Creation Study (2020–2025) analyses the top 100 companies in India that have created the most wealth for investors over the last five years. Wealth creation is measured by the increase in market capitalisation, adjusted for corporate actions such as mergers, demergers, buybacks, capital issuance, and dividends.",
            "pubDate": "2025-12-14T05:51:06.540488"
        },
        {
            "title": "10 penny stocks rally up to 515% in FY26 so far, 6 turn multibaggers — Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-penny-stocks-rally-up-to-515-in-fy26-so-far-6-turn-multibaggers-do-you-own-any/slideshow/125957683.cms",
            "description": "So far in FY26, 10 penny stocks have risen sharply, delivering returns ranging from 25% to 515%. Notably, six of these have turned into multibaggers. These standout performers were selected based on specific criteria: market capitalisation below Rs 1,000 crore, share price under Rs 20, and minimum recent trading volume of 5 lakh shares. This strategy focuses on identifying low-priced, actively traded micro-cap stocks demonstrating strong upward momentum. (Data Source: ACE Equity).Penny stocks often attract attention due to their low entry price and the potential for explosive growth. But while the rewards can be impressive, the risks are equally high. These stocks typically carry low liquidity, high volatility, and limited financial transparency. Investors should proceed with caution —success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2025-12-14T05:51:06.540611"
        },
        {
            "title": "Axis Securities names Vedanta among top 3 technical picks, sees up to 11% upside in 3–4 weeks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-names-vedanta-among-top-3-technical-picks-sees-up-to-11-upside-in-34-weeks/slideshow/125957418.cms",
            "description": "Markets remained volatile and ended the week in negative territory, weighed down by a mix of domestic and global cues. Throughout most of the week, investor sentiment stayed subdued and weakened further as selling pressure intensified. However, a late rebound in the final trading sessions helped contain the overall downside.Despite this marginal recovery, the overall tone remained cautious. Persistent foreign fund outflows and a sharp depreciation in the rupee significantly impacted investor confidence. Against this backdrop, technical analysts at Axis Securities have identified a few stocks that could offer potential trading opportunities based on chart patterns and momentum indicators, for a holding period of 3-4 weeks:",
            "pubDate": "2025-12-14T05:51:06.540713"
        },
        {
            "title": "Foreign investors sold Indian shares at Rs 145 crore every trading hour in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-investors-sold-indian-shares-at-rs-145-crore-every-trading-hour-in-2025/articleshow/125958162.cms",
            "description": "Foreign investors have sold over Rs 2.23 lakh crore in 2025, yet domestic institutions and SIP flows have absorbed the shock. Despite heavy FII selling, Indian equity markets remain resilient, supported by consistent retail participation and strong earnings prospects.",
            "pubDate": "2025-12-14T06:32:43.394115"
        },
        {
            "title": "Fermenta Biotech, Stallion India among 10 smallcaps jumped up to 27% in just 5 days. Did you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fermenta-biotech-stallion-india-among-10-smallcaps-jumped-up-to-27-in-just-5-days-did-you-own/slideshow/125958425.cms",
            "description": "A sharp rally swept through some of the stocks in the small-cap space over the past five trading sessions, with select stocks posting gains of up to 27% in just a week.",
            "pubDate": "2025-12-14T06:52:51.366215"
        },
        {
            "title": "ICICI Prudential AMC, SBI MF biggest investors in Rs 10,000 crore fundraise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-amc-sbi-mf-biggest-investors-in-rs-10000-crore-fundraise/articleshow/125958628.cms",
            "description": "Swiggy’s Rs 10,000 crore QIP saw strong domestic institutional participation, with ICICI Prudential AMC, SBI Mutual Fund and Aditya Birla Sun Life Mutual Fund together cornering over 37% of the issue. The fundraising strengthens Swiggy’s balance sheet to support quick commerce expansion and long-term growth plans.",
            "pubDate": "2025-12-14T07:24:38.321112"
        },
        {
            "title": "Mcap of 8 of 10 most valued firms erodes by Rs 79,129 cr; Bajaj Finance, ICICI Bank hit hard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-8-of-10-most-valued-firms-erodes-by-rs-79129-cr-bajaj-finance-icici-bank-hit-hard/articleshow/125958770.cms",
            "description": "The combined market valuation of eight of the top-10 most valued domestic firms eroded by Rs 79,129.21 crore last week, with Bajaj Finance and ICICI Bank taking the biggest hit, amid a largely bearish trend in equities.",
            "pubDate": "2025-12-14T07:36:23.318245"
        },
        {
            "title": "Two Trades for Today: An insurance aggregator for a 4.4% gain; a  large-cap aluminium maker stock for an almost 6% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-insurance-aggregator-for-a-4-4-gain-a-large-cap-aluminium-maker-stock-for-an-almost-6-upmove/articleshow/125958701.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-14T07:36:23.318364"
        },
        {
            "title": "Dividend yield for traders: There is more to it than meets the eye, especially in volatile times. 9 stocks to look at",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-yield-for-traders-there-is-more-to-it-than-meets-the-eye-especially-in-volatile-times-9-stocks-to-look-at/articleshow/125959058.cms",
            "description": "Let's start with an example to set the context. Between 2019 and 2025, Infosys went through every mood the market could conjure: Covid crash, tech booms, interest-rate swings, rupee volatility, and now the threat of AI. All this is on the fundamental side, and one could have taken a call whether to buy or sell the stock based on the fundamentals alone. There is, however, another side of the story: During this period, Infosys’ dividend payout kept rising steadily: From ₹21.5 in FY19 to ₹43 in FY25. For traders (who don't usually look at dividend payouts), there is a way to use this information to increase the probability of getting a trade, especially on the long side, right. Please note: Infosys is not in our list today.",
            "pubDate": "2025-12-14T08:56:52.708980"
        },
        {
            "title": "FPIs withdraw Rs 17,955 cr from Indian equities in Dec; total outflow at Rs 1.6 lakh cr in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-withdraw-rs-17955-cr-from-indian-equities-in-dec-total-outflow-at-rs-1-6-lakh-cr-in-2025/articleshow/125959074.cms",
            "description": "Foreign investors pulled out Rs 17,955 crore (USD 2 billion) from Indian equities in the first two weeks of this month, taking the total outflow to Rs 1.6 lakh crore (USD 18.4 billion) in 2025.",
            "pubDate": "2025-12-14T08:56:52.709106"
        },
        {
            "title": "After a tough 2025, are Nifty bulls ready for a strong 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-a-tough-2025-are-nifty-bulls-ready-for-a-strong-2026/articleshow/125959037.cms",
            "description": "India’s macro slowdown through FY25 is giving way to a policy-led recovery as rate cuts, liquidity easing, and GST reforms revive demand. Earnings momentum is turning, supporting expectations of a stronger equity market in 2026, led by consumer discretionary, autos and select growth sectors.",
            "pubDate": "2025-12-14T08:56:52.709310"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/125960498.cms",
            "description": "Indian equity benchmarks ended the week marginally lower amid sustained FII outflows and US-India trade uncertainty, though sentiment improved after a US Fed rate cut. The Nifty reclaimed key technical levels, while autos and metals led gains. Global cues, currency moves and earnings outlook remain crucial.",
            "pubDate": "2025-12-14T10:49:51.770807"
        }
    ]
}