{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-13T23:44:06.974840",
    "items": [
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126494969.cms",
            "description": "Indian equity benchmarks rebounded from Monday's lows, closing in positive territory. Analysts anticipate a sideways market with stock-specific movements as the earnings season commences. The Nifty faces resistance around 26000-26100, with support at 25650, while India VIX saw a 4% increase.",
            "pubDate": "2026-01-13T01:41:19.109729"
        },
        {
            "title": "Stocks in news: TCS, HCL Tech, Ola Electric, RIL, Just Dial",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-hcl-tech-ola-electric-ril-just-dial/articleshow/126494943.cms",
            "description": "Markets closed positively despite volatility, with IT majors TCS and HCL Tech reporting profit declines in their December quarter results. Ola Electric launched its first battery energy storage system, Shakti, while Indian Hotels secured trademark registration for the 'Taj' sonic sound. L&T will fully acquire L&T Sapura Shipping, and Reliance Industries confirmed its battery storage manufacturing plans remain on track.",
            "pubDate": "2026-01-13T01:41:19.109860"
        },
        {
            "title": "Asian shares rise on valuations, dollar declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-rise-on-valuations-dollar-declines/articleshow/126494912.cms",
            "description": "Asian shares surged to near record highs, outperforming the S&P 500 as investors shifted focus beyond US markets due to cheaper valuations and unpredictable US foreign policy. Concerns over the Federal Reserve's independence and upcoming US inflation data present key risks this week.",
            "pubDate": "2026-01-13T01:41:19.109990"
        },
        {
            "title": "Domestic markets bounce back after US ambassador calms trade jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/domestic-markets-bounce-back-after-us-ambassador-calms-trade-jitters/articleshow/126494860.cms",
            "description": "Indian stock markets bounced back on Monday, ending a five-day decline. This recovery followed assurances from the US ambassador regarding upcoming trade discussions. Markets had previously fallen due to concerns over potential US tariffs. The Nifty and Sensex both saw gains, recovering from earlier lows. Analysts suggest ongoing trade talks and the upcoming budget will influence market direction.",
            "pubDate": "2026-01-13T01:41:19.110099"
        },
        {
            "title": "Bajaj Housing raises Rs 509 crore via NCDs at 7.10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-raises-rs-509-crore-via-ncds-at-7-10/articleshow/126494762.cms",
            "description": "Bajaj Housing Finance has successfully raised ₹509 crore through non-convertible debentures. This move follows a period of strong business growth for the company. Their assets under management saw a significant increase of 23% year-on-year. The mortgage lender also reported a substantial rise in disbursements during the third quarter, indicating robust performance and expansion in their operations.",
            "pubDate": "2026-01-13T01:41:19.110204"
        },
        {
            "title": "NSE shares surge after IPO clouds seem to clear",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-shares-surge-after-ipo-clouds-seem-to-clear/articleshow/126494736.cms",
            "description": "National Stock Exchange shares climbed past ₹2,000. This surge followed SEBI chief's comments on an upcoming IPO clearance. Investor interest has rekindled. NSE shares saw increased demand and trading volumes. The exchange's IPO is expected soon. This development has boosted sentiment for the unlisted stock.",
            "pubDate": "2026-01-13T01:41:19.110301"
        },
        {
            "title": "'India can be global AI use case capital': MeitY secy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-can-be-global-ai-use-case-capital-meity-secy/articleshow/126494754.cms",
            "description": "India is set to become a global hub for AI applications. The country will foster its own AI infrastructure, including large language models and data centers. This initiative aligns with the goal of democratizing AI resources. India's role as a trusted partner in value chains is recognized. Discussions on global AI policy will take place at an upcoming summit.",
            "pubDate": "2026-01-13T01:41:19.110492"
        },
        {
            "title": "Banks bank on cash recyclers in new ATM cycle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-bank-on-cash-recyclers-in-new-atm-cycle/articleshow/126494796.cms",
            "description": "Indian banks are set to deploy nearly 17,350 ATMs in the coming months. A significant majority of these will be advanced cash recyclers. This move signals a shift towards modern technology for better efficiency and lower costs. Banks are prioritizing smarter machines that reduce cash handling needs and improve service availability.",
            "pubDate": "2026-01-13T01:41:19.110587"
        },
        {
            "title": "Shriram-MUFG deal may test rules on non-compete fee for promoters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-mufg-deal-may-test-rules-on-non-compete-fee-for-promoters/articleshow/126494747.cms",
            "description": "The non-compete payment —amounting nearly 5% of the deal value—is intended to prevent Shriram Ownership Trust (SOT), the promoter entity, from launching a rival lending business under the Shriram brand or any other name.",
            "pubDate": "2026-01-13T01:41:19.110683"
        },
        {
            "title": "Distribution costs weigh on value of insurance products",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/distribution-costs-weigh-on-value-of-insurance-products/articleshow/126494800.cms",
            "description": "Insurance product value is shrinking due to high commissions and operating expenses. Experts highlight concerns with credit-linked life, non-linked, motor third-party, and retail health policies. Despite tax reforms, these costs impact customer returns. Industry growth has stagnated while expenses climb. A committee is now examining distribution costs.",
            "pubDate": "2026-01-13T01:41:19.110778"
        },
        {
            "title": "IFCI, IREDA among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ifci-ireda-among-5-stocks-showing-bullish-rsi-upswing/slideshow/126495937.cms",
            "description": "On January 12, five stocks from the Nifty500 universe featured in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from lower levels is considered an uptrend signal, reflecting strengthening price momentum and growing bullish interest, often tracked by traders to spot potential buying opportunities.",
            "pubDate": "2026-01-13T03:18:13.962543"
        },
        {
            "title": "Anand Rathi shares in focus as Q3 net profit jumps 30% to Rs 100 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anand-rathi-shares-in-focus-as-q3-net-profit-jumps-30-to-rs-100-crore/articleshow/126495830.cms",
            "description": "Anand Rathi Wealth shares are in focus after a strong December quarter. The company reported a 30% rise in net profit to Rs 100 crore and a 25% jump in revenue to Rs 306 crore. Assets Under Management grew 30% to Rs 99,008 crore. The firm added new clients and saw healthy inflows, demonstrating steady growth.",
            "pubDate": "2026-01-13T03:18:13.962654"
        },
        {
            "title": "China examines foreign ETF trades after Jane Street India probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-examines-foreign-etf-trades-after-jane-street-india-probe/articleshow/126495827.cms",
            "description": "China is examining how foreign firms like Jane Street Group operate in its large ETF market. Regulators want to understand trading activities. This comes after India accused Jane Street of market manipulation. UBS has paused some trades from Jane Street. China's stock market is sensitive to performance. Foreign firms are increasingly active in China's growing ETF sector.",
            "pubDate": "2026-01-13T03:18:13.962748"
        },
        {
            "title": "Positive Breakout: These 14 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-14-stocks-cross-above-their-200-dmas/slideshow/126495314.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1000 crore, 14 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on January 12, 2026, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2026-01-13T03:18:13.962851"
        },
        {
            "title": "Stocks to buy in 2026: Lemon Tree, Avenue Supermarts among 5 stocks that could give 14-30% return in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-lemon-tree-avenue-supermarts-among-5-stocks-that-could-give-14-30-return-in-long-term/slideshow/126495266.cms",
            "description": "Brokerages remain constructive on select Indian stocks, highlighting opportunities across retail, IT services, power, hospitality, and energy trading amid evolving market conditions.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-13T03:18:13.962947"
        },
        {
            "title": "Kotak Mahindra Bank 5:1 stock split: What shareholders need to know before ex-date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-51-stock-split-what-shareholders-need-to-know-before-ex-date/articleshow/126495192.cms",
            "description": "Kotak Mahindra Bank shareholders must buy shares by today to benefit from the upcoming 5:1 stock split. The bank has set January 14, 2026, as the record date. This move will increase share count fivefold, adjusting the price per share proportionally. Additionally, Anup Kumar Saha joins as Whole-time Director, bringing extensive experience in consumer banking and digital transformation.",
            "pubDate": "2026-01-13T03:18:13.963047"
        },
        {
            "title": "Sensex falls over 200 points led by FMCG, IT stocks; Nifty below 25,750",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-points-led-by-fmcg-it-stocks-nifty-below-25750/articleshow/126496397.cms",
            "description": "Indian equities reversed early gains, slipping into the red as optimism around US trade developments faded, overshadowed by losses in FMCG and IT stocks. Despite a broad-based advance in small and mid-cap indices, investor caution prevailed. Geopolitical developments and US trade policies continue to influence market sentiment.",
            "pubDate": "2026-01-13T05:15:37.254802"
        },
        {
            "title": "Groww shares rise nearly 5% in just two sessions. What’s triggering the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-rise-2-extend-gains-for-second-session-whats-triggering-the-rally/articleshow/126496614.cms",
            "description": "Billionbrains Garage Ventures shares rose after Kotak Institutional Equities initiated coverage with a Buy rating. The brokerage forecasts strong earnings growth for Groww in the coming years. This growth is expected from areas like marginal trading facility and commodities. Operating leverage and margin expansion are also anticipated. Groww's product-first approach and tech focus are key strengths.",
            "pubDate": "2026-01-13T05:15:37.254932"
        },
        {
            "title": "Premier Energies among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126496477.cms",
            "description": "As of January 12, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% compared with the previous trade. A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions in the futures market.",
            "pubDate": "2026-01-13T05:15:37.255035"
        },
        {
            "title": "Mukul Agrawal reshapes Rs 6,500-crore portfolio in Q3: Two new stocks, one exit. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-reshapes-rs-6500-crore-portfolio-in-q3-two-new-stocks-one-exit-do-you-own/articleshow/126496560.cms",
            "description": "Mukul Agrawal has updated his Rs 6,500-crore stock portfolio. He added Hindustan Construction and Sudeep Pharma. Agrawal reduced his stake in Monolithisch and likely exited Stanley Lifestyles. His portfolio includes several multibagger stocks from the past year. These include Osel Devices, Zelio E-Mobility, Monolithisch India, Zota Health Care, and ASM Technologies.",
            "pubDate": "2026-01-13T05:15:37.255135"
        },
        {
            "title": "Basmati rice exporters' shares in focus after Trump slaps 25% tariff on Iran-linked trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/basmati-rice-exporters-shares-in-focus-after-trump-slaps-25-tariff-on-iran-linked-trade/articleshow/126496417.cms",
            "description": "Indian basmati rice exporters like LT Foods and KRBL are under scrutiny following a US announcement of a 25% tariff on countries trading with Iran. This move, amid rising US-Iran tensions, could significantly impact Indian exporters who rely on Iran as a major buyer. The tariff's immediate effect raises concerns about potential trade disruptions and broader geopolitical fallout.",
            "pubDate": "2026-01-13T05:15:37.255236"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama raises target price on TCS post results; CLSA maintains outperform on HDFC Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-raises-target-price-on-tcs-post-results-clsa-maintains-outperform-on-hdfc-bank/articleshow/126496382.cms",
            "description": "Brokerage firms remain positive on select large-cap stocks, with Motilal Oswal reiterating Buy on Grasim Industries, Nuvama raising its target on TCS post Q3 results, and CLSA maintaining an Outperform rating on HDFC Bank amid valuation comfort and earnings visibility.",
            "pubDate": "2026-01-13T05:15:37.255336"
        },
        {
            "title": "109 stock picks from 8 brokerage firms! How many are there in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/109-stock-picks-from-8-brokerage-firms-how-many-are-there-in-your-portfolio/slideshow/126496350.cms",
            "description": "As companies gear up to announce their third-quarter earnings, brokerages are sharpening their stock calls across sectors, from banking and autos to cement, capital goods and consumption. ETMarkets has compiled 109 stock picks from leading global and domestic brokerage firms, spotlighting companies they believe are best placed to navigate near-term volatility and deliver growth as investors step into 2026.",
            "pubDate": "2026-01-13T05:15:37.255447"
        },
        {
            "title": "Ola Electric shares surge 3% as company rolls out first BESS product ‘Shakti’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-as-company-rolls-out-first-bess-product-shakti/articleshow/126496189.cms",
            "description": "Ola Electric shares: The company launched its first residential Battery Energy Storage System, Shakti, from its Krishnagiri Gigafactory, marking its entry into the residential BESS market. Powered by locally developed 4680 Bharat Cells, the product is India’s first of its kind and is designed to provide portable, on-demand energy solutions for households, farms, and businesses.",
            "pubDate": "2026-01-13T05:15:37.255551"
        },
        {
            "title": "Value buys? Worst-performing India market pushes 25 Nifty stocks below 5-year PE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/value-buys-worst-performing-india-market-pushes-25-nifty-stocks-below-5-year-pe/articleshow/126496147.cms",
            "description": "India's stock market faces challenges, with 25 major Nifty companies now trading below their five-year average price-to-earnings ratios. This valuation shift follows a period of global uncertainty and foreign investor selling. Investors are closely watching upcoming earnings reports to determine if growth justifies current valuations. Market volatility is expected to continue as global factors influence sentiment.",
            "pubDate": "2026-01-13T05:15:37.255642"
        },
        {
            "title": "TCS shares slip marginally after Q3 profit drops 14% YoY. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-as-q3-net-profit-drops-14-yoy-what-should-investors-do/articleshow/126496123.cms",
            "description": "Tata Consultancy Services reported a year-on-year decline in Q3FY26 profit despite steady revenue growth, driven by one-off costs and wage hikes. Brokerages remain cautious but constructive, citing stable margins, improving demand visibility and growing AI-led deal traction, while largely recommending a neutral-to-positive stance on the stock.",
            "pubDate": "2026-01-13T05:15:37.255735"
        },
        {
            "title": "HCL Tech shares jump nearly 2% after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-tech-shares-in-focus-after-q3-net-profit-declines-11-yoy-should-you-buy-sell-or-hold/articleshow/126496098.cms",
            "description": "HCL Tech shares: The IT services firm reported an 11% year-on-year decline in consolidated net profit to ₹4,076 crore in the December quarter, even as revenue grew strongly. Revenue from operations rose 13% YoY to ₹33,872 crore, while on a sequential basis profit fell nearly 4% and revenue increased 6% compared to the September quarter.",
            "pubDate": "2026-01-13T05:15:37.255828"
        },
        {
            "title": "Meesho shares in focus as firm enters logistics business, incorporates subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-in-focus-as-firm-enters-logistics-business-incorporates-subsidiary/articleshow/126496055.cms",
            "description": "Meesho is entering the logistics business by incorporating a new subsidiary. This move is expected to be a key driver for the company's future earnings. BofA Securities has initiated coverage with a Neutral rating, setting a price target of Rs 190. The stock is trading above its IPO price, showing investor interest. This expansion signals Meesho's strategic growth plans.",
            "pubDate": "2026-01-13T05:15:37.255921"
        },
        {
            "title": "Power Finance Corporation among 4 stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-finance-corporation-among-4-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126496059.cms",
            "description": "On January 12, four stocks from the NSE universe with a market capitalisation exceeding Rs 10,000 crore appeared on the bullish “White Marubozu” scanner, based on data from StockEdge.com. A White Marubozu is a bullish candlestick pattern formed when the opening price is the session low, and the closing price is the high.Depicted by a long white or green candlestick with no upper shadow and a small or non-existent lower shadow, the pattern reflects sustained buying pressure throughout the session. Traders often interpret it as a sign of strong buyer control and use it to assess potential future price direction.",
            "pubDate": "2026-01-13T05:15:37.256014"
        },
        {
            "title": "NLC India shares gain 3% as board approves subsidiary listing, interim dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nlc-india-shares-gain-3-as-board-approves-subsidiary-listing-interim-dividend/articleshow/126497532.cms",
            "description": "NLC India's shares surged following board approvals for its renewable energy arm's listing and a 36% interim dividend. The company plans to dilute up to 25% equity in NLC India Renewables Limited, aligning with national monetization goals.",
            "pubDate": "2026-01-13T05:43:14.884463"
        },
        {
            "title": "Meesho’s 129% post-IPO rally fizzles as stock slides 35% from peak amid valuation concerns. Buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meeshos-129-post-ipo-rally-fizzles-as-stock-slides-35-from-peak-amid-valuation-concerns-buy-sell-or-hold/articleshow/126497442.cms",
            "description": "Meesho’s sharp post-IPO rally has lost momentum as valuation concerns, lock-in expiry-related selling and cautious brokerage commentary weigh on the stock. While analysts flag limited near-term upside, the company’s strong user base, improving logistics efficiency, and differentiated e-commerce model continue to underpin its long-term business prospects.",
            "pubDate": "2026-01-13T05:43:14.884594"
        },
        {
            "title": "Buy or sell? What TCS, HCL Tech results mean for IT stocks after Rs 75,000 crore FII selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-or-sell-what-tcs-hcl-tech-results-mean-for-it-stocks-after-rs-75000-crore-fii-selloff/articleshow/126498262.cms",
            "description": "TCS posts mixed Q3 with margins under pressure, while HCL Technologies beats expectations with AI-driven growth. Sector sentiment is cautious after Rs 75,000-crore FII selloff, with brokerages suggesting stock-specific execution and AI traction will guide performance.",
            "pubDate": "2026-01-13T06:21:55.618433"
        },
        {
            "title": "IFCI shares surge 21% in two days amid heavy trading volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ifci-shares-surge-21-in-two-days-amid-heavy-trading-volumes/articleshow/126498187.cms",
            "description": "IFCI shares rallied sharply on heavy volumes, prompting an exchange query amid heightened investor activity. Strong recent gains, elevated valuations and positive technical indicators signal improving momentum, though mixed financial trends and supply-side risks warrant caution. The stock’s long-term performance remains robust despite short-term volatility.",
            "pubDate": "2026-01-13T06:21:55.618575"
        },
        {
            "title": "CLSA flags margin recovery ahead for HDFC Bank, predicts 27% headroom despite weak start to the year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/clsa-flags-margin-recovery-ahead-for-hdfc-bank-predicts-27-headroom-despite-weak-start-to-the-year/articleshow/126498955.cms",
            "description": "CLSA has reiterated its “Outperform” rating on HDFC Bank, setting a target price of ₹1,200 and implying over 27% upside from current levels despite recent stock weakness. The brokerage views concerns over deposit growth and margins as temporary and expects FY27 to be a bounce-back year.",
            "pubDate": "2026-01-13T06:53:46.432797"
        },
        {
            "title": "Good businesses outlive everyone, including many presidents: 10 mid-cap stocks from different sectors which fit the bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/good-businesses-outlive-everyone-including-many-presidents-10-mid-cap-stocks-from-different-sectors-which-fit-the-bill/articleshow/126498756.cms",
            "description": "It is now clear that the volatility quotient in the stock market will remain high for a while. At this point of time, there are more headwinds than tailwinds. From high valuations to geopolitical tensions to uncertainty over the India-US trade deal – all these are making the market jittery. If you are feeling despondent, remember this: Good businesses survive short- and even medium-term hiccups and grow. Today, we look at mid-cap stocks where the sector and company both have a clear growth path due to certain reasons and meet certain criteria on qualitative and quantitative benchmarks. So ignore the noise and focus on the business.",
            "pubDate": "2026-01-13T06:53:46.432930"
        },
        {
            "title": "Ixigo shares set for 30% upside? 4 reasons JM Financial upgraded stock to Buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ixigo-shares-set-for-30-upside-4-reasons-jm-financial-upgraded-stock-to-buy/articleshow/126498461.cms",
            "description": "Ixigo shares saw a significant jump after a brokerage upgrade. Analysts believe the stock is undervalued following a recent correction. Strong long-term growth drivers in India's travel sector are expected to benefit Ixigo. The company's expansion in hotels is also seen as a positive. Future growth rates are anticipated to normalize after a high base effect from past events.",
            "pubDate": "2026-01-13T06:53:46.433144"
        },
        {
            "title": "Ashish Kacholia-backed Balu Forge shares bounce back 13% after sharp YTD fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-balu-forge-shares-bounce-back-13-after-sharp-ytd-fall/articleshow/126499390.cms",
            "description": "Balu Forge Industries shares surged up to 13% intraday after the company clarified that a recent Income Tax Department search concluded without finding any incriminating documents or unaccounted assets. The company confirmed no impact on business operations, providing relief to investors, including ace investor Ashish Kacholia.",
            "pubDate": "2026-01-13T07:16:38.999596"
        },
        {
            "title": "Amagi Media Labs IPO Day 1: Subscribed just 4% in early hours. Check GMP and other key details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amagi-media-labs-ipo-day-1-subscribed-just-4-in-early-hours-check-gmp-and-other-key-details/articleshow/126499899.cms",
            "description": "Amagi Media Labs’ IPO opened to a muted response on Day 1, with overall subscription at just 4% in early trade. A modest grey market premium reflects cautious investor sentiment amid volatile markets and heightened scrutiny of tech valuations.",
            "pubDate": "2026-01-13T07:39:33.684407"
        },
        {
            "title": "PMS Tracker: Quant, fintech strategies lead December gains of up to 8%; Kotak, Aequitas among top performers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pms-tracker-quant-fintech-strategies-lead-december-gains-of-up-to-8-kotak-aequitas-among-top-performers/articleshow/126500198.cms",
            "description": "Quant, fintech and diversified PMS strategies topped December’s charts with gains of up to 8%, even as several small-cap and thematic portfolios saw steep declines. The month underscored sharp dispersion in India’s PMS market, with systematic and sector-focused approaches outperforming while small-cap strategies faced significant selling pressure.",
            "pubDate": "2026-01-13T07:50:55.536988"
        },
        {
            "title": "Sensex sheds over 900 pts from day’s peak, Nifty sinks 1%; Rs 3 lakh crore vanish. Here are 5 key factors behind the stock market decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-today-sensex-sheds-933-points-from-days-peak-nifty-slumps-1-rs-3-lakh-crore-vanish-5-key-factors-behind-the-drop/articleshow/126500415.cms",
            "description": "Indian equities saw a sharp intraday reversal on Tuesday as early gains evaporated, dragging the Sensex down 933 points from its peak and pushing the Nifty over 1% lower. Nearly Rs 3 lakh crore in market value was erased as selling intensified despite positive global cues and early IT earnings support.",
            "pubDate": "2026-01-13T08:32:52.293174"
        },
        {
            "title": "Mukul Agrawal’s newest stock bet is up 10% in just 2 sessions. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawals-newest-stock-bet-is-up-10-in-just-2-sessions-do-you-own/articleshow/126500960.cms",
            "description": "Despite pressure on smallcap stocks for most of 2025, Agrawal’s portfolio featured five multibagger names during the year, namely– Oseal Devices, Zelio E-Mobility, Monolithisch India, Zota Health Care, and ASM Technologies.",
            "pubDate": "2026-01-13T08:58:07.523510"
        },
        {
            "title": "India’s new labour codes could wipe out up to a fifth of IT profits, Jefferies warns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-new-labour-codes-could-wipe-out-up-to-a-fifth-of-it-profits-jefferies-warns/articleshow/126501714.cms",
            "description": "Jefferies warns India’s IT sector faces a sharp earnings hit from new labour codes, with December-quarter profits potentially falling 10–20%, margins pressured longer term, costs structurally rising, uneven company impact, and only selective stock buy recommendations remaining amid slowing demand.",
            "pubDate": "2026-01-13T09:28:48.344182"
        },
        {
            "title": "L&T shares drop 3% after reports flag potential cancellation of Kuwait oil projects",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-shares-drop-3-after-reports-flag-potential-cancellation-of-kuwait-oil-projects/articleshow/126501436.cms",
            "description": "Larsen & Toubro shares fell after reports said that Kuwait may cancel oil project tenders worth $8.7 billion. The decline followed news that Kuwait Oil Company is reviewing its capital expenditure after bids exceeded budget estimates, putting major tenders—where L&T was the lowest bidder for over $4.5 billion—at risk.",
            "pubDate": "2026-01-13T09:28:48.344307"
        },
        {
            "title": "Reliance Industries shares slip 2%, down 8% in 2026. Time to buy before Q3?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-slip-2-down-8-in-2026-time-to-buy-before-q3/articleshow/126501894.cms",
            "description": "Reliance Industries shares have seen a decline of over 8% in early 2026, reaching an intraday low of Rs 1,448. Technical analysts suggest this is a healthy consolidation within an uptrend, with strong support expected around Rs 1,380-1,440. Investors with a medium-to-long-term view may consider buying on dips.",
            "pubDate": "2026-01-13T09:50:11.022323"
        },
        {
            "title": "Unique Picks: 11 stocks held by a single MF scheme in December; surge up to 143% in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unique-picks-11-stocks-held-by-a-single-mf-scheme-in-december-surge-up-to-143-in-fy26/slideshow/126502781.cms",
            "description": "ETMarkets analysed mutual fund portfolios to identify stocks held exclusively by a single mutual fund scheme. In the initial screening for December 2025, 196 such stocks were found. The list was narrowed down to stocks with equity mutual fund holdings exceeding Rs 10 crore as of December 2025, resulting in a final shortlist of 31 stocks.",
            "pubDate": "2026-01-13T10:28:19.699211"
        },
        {
            "title": "Reliance Retail-owned stock tanks 10% as Q3 net profit plummets 97% to Rs 14 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-retail-owned-stock-tanks-10-as-q3-net-profit-plummets-97-to-rs-14-lakh/articleshow/126503374.cms",
            "description": "Lotus reported revenue from operations of Rs 142 crore for the quarter under review, down 14% from Rs 165 crore in the corresponding quarter of the previous fiscal year.",
            "pubDate": "2026-01-13T10:50:25.150196"
        },
        {
            "title": "Retail equity trading slows as SIPs, commodities hit new highs in December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-equity-trading-slows-as-sips-commodities-hit-new-highs-in-december/articleshow/126503318.cms",
            "description": "Retail equity trading slowed in December 2025, while SIP inflows and commodity market volumes hit record highs. Motilal Oswal notes that stable mutual fund flows, strong IPO activity and rising commodities participation continue to support India’s capital market ecosystem.",
            "pubDate": "2026-01-13T10:50:25.150322"
        },
        {
            "title": "Authum Investment among 7 stocks hit 52-week highs; gains up to 30% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/authum-investment-among-7-stocks-hit-52-week-highs-gains-up-to-30-in-a-month/slideshow/126504140.cms",
            "description": "Benchmark Sensex declined by 250 points to close at 83,628 on Tuesday. Despite the broader market’s weakness, seven stocks from the BSE 500 index touched fresh 52-week highs, marking their strongest levels in a year. Such breakouts generally reflect solid bullish momentum and may point to further upside in the near term.",
            "pubDate": "2026-01-13T11:50:32.906638"
        },
        {
            "title": "Valuation Watch: 10 large-cap stocks with sky-high PE ratios",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuation-watch-10-large-cap-stocks-with-sky-high-pe-ratios/slideshow/126505335.cms",
            "description": "A P/E ratio above 75 indicates that a company’s stock price is increasing significantly faster than its earnings. This is calculated using the latest end-of-day price and trailing twelve months (TTM) earnings per share. From the NSE large-cap pack, we have highlighted the top 10 stocks with the highest TTM P/E ratios, based on a valuation scan by Stockedge.com.While a high P/E suggests strong growth expectations from investors, it can also signal overvaluation or speculative buying. It's important to assess the company's fundamentals and market conditions for a more accurate evaluation.",
            "pubDate": "2026-01-13T13:31:26.401502"
        },
        {
            "title": "Two Trades for Today: An IT major for a 5.5% gain, a mid-cap NBFC stock for an almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-it-major-for-a-5-5-gain-a-mid-cap-nbfc-stock-for-an-almost-7-rise/articleshow/126507051.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-13T14:52:20.891172"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/126508634.cms",
            "description": "Indian equities ended lower after a sharp intraday reversal, as global trade concerns, rising crude prices, weak rupee, FII outflows and cautious earnings outlook erased early gains despite supportive inflation data and resilient small-cap performance.",
            "pubDate": "2026-01-13T15:57:08.868231"
        },
        {
            "title": "Market Trading Guide: PVR Inox among 4 stock recommendations for Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-pvr-inox-among-4-stock-recommendations-for-wednesday/slideshow/126508822.cms",
            "description": "Domestic equities experienced a downturn on Tuesday due to renewed concerns about potential US tariffs on countries trading with Iran, overshadowing the initial optimism from the newly appointed US ambassador's positive statements on the trade deal.\"Overall index in the current truncated week is likely to consolidate in the range of 26000-25,500 only a breakout or a breakdown will signal the next directional move,\" said Bajaj BrokingHere are 4 stock recommendations for Wednesday:",
            "pubDate": "2026-01-13T16:28:54.563974"
        },
        {
            "title": "Noise, nonsense & nuance till 2029: Staying with domestic-focused stocks a better option? 15 large-cap stocks with upside potential of up to 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/noise-nonsense-nuance-till-2029-staying-with-domestic-focused-stocks-a-better-option-15-large-cap-stocks-with-upside-potential-of-up-to-32/articleshow/126511587.cms",
            "description": "US President Trump is on a rampage, sparking real and tariff wars that are impacting the global markets, including India. In such times, the phrase \"home is where the heart is\" has taken on a new meaning for Indian investors. Given the volatile global environment, the case for looking at domestic-focused companies is no longer just a defensive play. It is a strategic imperative. So, which are the sectors that are not impacted by tariffs and wars?",
            "pubDate": "2026-01-13T18:37:30.250003"
        },
        {
            "title": "These 10 banking stocks can give more than 17% returns in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-banking-stocks-can-give-more-than-17-returns-in-1-year-according-to-analysts/articleshow/126512234.cms",
            "description": "Every sector has a key element. For banking, it is NPAs. They have been improving for quite some time, and numbers from a majority of banks have been better than expected on this parameter. In fact, this is probably the reason why banking stocks were relative outperformers in the long bear market. Will they be able to do it again in this phase of correction? Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks along with detailed company analysis focusing on five key components ,earnings, fundamentals, relative valuation, risk, and price momentum, to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2026-01-13T19:20:56.275118"
        },
        {
            "title": "Stock Radar: Chennai Petroleum Corporation stock showing signs of bottoming out after falling over 30% from highs; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-chennai-petroleum-corporation-stock-showing-signs-of-bottoming-out-after-falling-over-30-from-highs-time-to-buy/articleshow/126501899.cms",
            "description": "Chennai Petroleum Corporation stock is showing signs of recovery. It has stabilized above its 200-day moving average. Experts suggest buying the stock for potential gains in the coming weeks. The stock has formed a bullish pattern on charts. This indicates a possible upward movement. Traders can aim for targets between Rs 861 and Rs 948.",
            "pubDate": "2026-01-13T23:44:06.212152"
        }
    ]
}