{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-11T09:58:01.815123",
    "items": [
        {
            "title": "Adani Power shares in focus after Nagpur coal mine nod",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-in-focus-after-nagpur-coal-mine-nod/articleshow/123821087.cms",
            "description": "Adani Power is in focus after securing approval for an underground coal mine in Nagpur. This adds to investor excitement. The company also has a new hydroelectric project in Bhutan. Shareholders have approved Adani Power's first stock split. Analysts cite upcoming GST reforms as a potential boost. The stock is trading above key moving averages.",
            "pubDate": "2025-09-11T03:45:05.940577"
        },
        {
            "title": "Diwali rally watch: Is Trump the last piece of the puzzle for Nifty breakout?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-rally-watch-is-trump-the-last-piece-of-the-puzzle-for-nifty-breakout/articleshow/123821042.cms",
            "description": "Indian stock markets anticipate a potential breakout as Donald Trump signals a trade deal, potentially ending tariff standoffs. This, combined with expected earnings recovery in 2025, GST rate cuts, and anticipated Fed rate cuts, could trigger a significant Diwali rally. Analysts foresee positive impacts on BFSI, IT, and export-oriented sectors, potentially leading to substantial market gains.",
            "pubDate": "2025-09-11T03:45:05.940730"
        },
        {
            "title": "Poonawalla Fincorp, Divi's Labs among 7 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/poonawalla-fincorp-divis-labs-among-7-stocks-closed-crossing-above-vwap/slideshow/123820993.cms",
            "description": "On September 10, the closing prices of seven stocks in the Nifty500 pack rallied more than 1% above their VWAP (Volume Weighted Average Price). According to technical scan data from StockEdge, a close above the VWAP indicates a potential bullish trend.When the closing price rises above the VWAP, it means the stock closed higher than the average price at which it was traded throughout the day, with the average weighted by trading volume. Traders and investors often interpret this as a bullish signal, suggesting positive market sentiment.",
            "pubDate": "2025-09-11T03:45:05.940838"
        },
        {
            "title": "Oracle Financial Services, Trent among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-financial-services-trent-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123820707.cms",
            "description": "There was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as of September 10, as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-11T03:45:05.940941"
        },
        {
            "title": "At multi-year highs: Sundaram Finance, Cupid among 5 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-sundaram-finance-cupid-among-5-stocks-witness-5-year-swing-high-breakout/slideshow/123820619.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, five stocks witnessed a 5-year swing high at the close on September 10, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-11T03:45:05.941041"
        },
        {
            "title": "Bharat Electronics, SBI, HDFC Life among 8 Nifty stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-electronics-sbi-hdfc-life-among-8-nifty-stocks-showing-rsi-trending-up/slideshow/123820517.cms",
            "description": "Eight stocks from the the Nifty50 pack were highlighted in the RSI Trending Up scan on September 10, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-11T03:45:05.941140"
        },
        {
            "title": "Stocks to buy in 2025 for long term: HDFC Life, Berger Paints among 5 stocks that could give 17-26% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-hdfc-life-berger-paints-among-5-stocks-that-could-give-17-26-return/slideshow/123820411.cms",
            "description": "Brokerages remain upbeat on select stocks across insurance, healthcare, paints, and cement, highlighting strong growth prospects and attractive valuations.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-11T03:45:05.941233"
        },
        {
            "title": "Patanjali Foods shares in focus as stock turns ex-bonus for 2:1 issue on record date today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patanjali-foods-shares-in-focus-as-stock-turns-ex-bonus-for-21-issue-on-record-date-today/articleshow/123820229.cms",
            "description": "Patanjali Foods' shares turned ex-bonus on Thursday, September 11, following a 2:1 bonus issue. Shareholders who held the stock by Wednesday's close are eligible to receive two additional shares for each share owned. While the bonus issue expands holdings, the stock's performance has been mixed, with a year-long decline contrasting recent gains over the past three months.",
            "pubDate": "2025-09-11T03:45:05.941329"
        },
        {
            "title": "Dividend alert: Cochin Shipyard, GRSE among over 80 stocks in focus as they approach record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-alert-cochin-shipyard-grse-among-over-80-stocks-in-focus-as-they-approach-record-date/articleshow/123820213.cms",
            "description": "Cochin Shipyard and GRSE shares are in focus as today is the last day to buy them to qualify for dividends. The record date is September 12, 2025. Cochin Shipyard declared a 45% final dividend at Rs 2.25 per share, while GRSE announced a 49% final dividend at Rs 4.9 per share.",
            "pubDate": "2025-09-11T03:45:05.941423"
        },
        {
            "title": "Positive Breakout: These 9 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-close-cross-above-their-200-dmas/slideshow/123820202.cms",
            "description": "The closing prices of nine stocks from the Nifty200 pack crossed above their 200 DMA (Daily Moving Averages) on September 10, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-11T03:45:05.941516"
        },
        {
            "title": "JSW Cement shares in focus as 37 mn shares become free to trade. What lock-in expiry means for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-cement-shares-in-focus-as-37-mn-shares-become-free-to-trade-what-lock-in-expiry-means-for-investors/articleshow/123820150.cms",
            "description": "Attention traders! 37 million JSW Cement shares, representing 3% of equity and valued at $62 million, become available for trading today as the one-month shareholder lock-in period expires. This event, the largest among peers this month, is expected to increase liquidity but could also create downward pressure if investors choose to sell.",
            "pubDate": "2025-09-11T03:45:05.941609"
        },
        {
            "title": "Infosys shares in focus ahead of board meeting to approve share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-ahead-of-board-meeting-to-approve-share-buyback/articleshow/123820089.cms",
            "description": "Infosys board will meet today to discuss a share buyback. This comes as Infosys stock has not performed well. The stock has fallen nearly 25% in the past year. Investors are watching to see if the buyback will be a tender offer or open market. This would be Infosys' fifth buyback. FII selling has also impacted Indian IT stocks.",
            "pubDate": "2025-09-11T03:45:05.941724"
        },
        {
            "title": "S&P 500 and Nasdaq notch record-high closes as Oracle soars on AI optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-and-nasdaq-notch-record-high-closes-as-oracle-soars-on-ai-optimism/articleshow/123819869.cms",
            "description": "The S&P 500 and Nasdaq achieved record highs, fueled by Oracle's surge due to AI demand and encouraging inflation data, bolstering expectations of Federal Reserve interest rate cuts. AI-related chip stocks also rallied, while Apple declined. Investors are now awaiting consumer prices data for further inflation insights.",
            "pubDate": "2025-09-11T03:45:05.941823"
        },
        {
            "title": "SMC Global’s Shitij Gandhi: Accumulate Dr. Reddy’s for targets of Rs 1,360–1,365",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smc-globals-shitij-gandhi-accumulate-dr-reddys-for-targets-of-rs-13601365/videoshow/123813000.cms",
            "description": "“After weeks of consolidation, Dr. Reddy’s Laboratories' stock has delivered a strong technical breakout on the daily charts. Traders can buy for a target of Rs 1360 in the next 5-7 weeks,” Shitij Gandhi, Senior Technical Analyst, SMC Global Securities, said.",
            "pubDate": "2025-09-11T03:45:05.941916"
        },
        {
            "title": "Asian shares steady as US stocks climb on Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-steady-as-us-stocks-climb-into-cpi/articleshow/123819531.cms",
            "description": "Asian equities displayed mixed performance following Wall Street's rally, fueled by hopes of Federal Reserve rate cuts after a drop in producer prices. US futures saw slight gains as the S&P 500 reached a new record.",
            "pubDate": "2025-09-11T03:45:05.942007"
        },
        {
            "title": "IT stocks surge as Trump signals progress in US-India trade talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-surge-as-trump-signals-progress-in-us-india-trade-talks/articleshow/123819481.cms",
            "description": "IT stocks surged following positive comments from Donald Trump regarding US-India trade negotiations, easing concerns about potential tariffs. Optimism surrounding a possible US Federal Reserve rate cut and Infosys' share buyback further fueled the rally. Investors are anticipating more buybacks from other IT companies, contributing to the sector's positive momentum.",
            "pubDate": "2025-09-11T03:45:05.942101"
        },
        {
            "title": "Consumption will drive growth, not investments: Indranil Pan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/consumption-will-drive-growth-not-investments-indranil-pan/articleshow/123821826.cms",
            "description": "Fitch raised India’s FY26 GDP forecast to 6.9% on strong demand, GST changes, and potential rate cuts, while Yes Bank slightly increased its forecast to 6.6%. However, global trade tensions, crop damage, and weak urban consumption pose risks to growth.",
            "pubDate": "2025-09-11T04:52:29.023332"
        },
        {
            "title": "Urban Company IPO Day 2: Issue gets subscribed over 300%, GMP jumps 34%; Should you subscribe?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-ipo-day-2-issue-gets-subscribed-over-300-gmp-jumps-34-should-you-subscribe/articleshow/123821806.cms",
            "description": "Urban Company’s ₹1,900 crore IPO is seeing strong traction, with 3.13x subscription on Day 1 and a 34% GMP. Analysts view valuations as fully priced but recommend long-term subscription, citing strong brand equity, rapid growth, and leadership in India’s home services market.",
            "pubDate": "2025-09-11T04:52:29.023454"
        },
        {
            "title": "​Global bond markets wobble as debt concerns rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-bond-markets-wobble-as-debt-concerns-rise/slideshow/123821931.cms",
            "description": "Investor concern is rising as some of the world’s largest economies face increasing bond market stress. Many believe governments are not doing enough to reduce their high debt levels. Guy Miller, chief market strategist at Zurich Insurance Group, warns, “Government debt levels are simply too high and not enough has been done to tackle them.” (Source: Reuters)",
            "pubDate": "2025-09-11T04:52:29.023582"
        },
        {
            "title": "Patanjali Foods shares crash 67%! But that's just optical",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patanjali-foods-shares-crash-67-but-thats-just-optical/articleshow/123821759.cms",
            "description": "Patanjali Foods shares fell 66.7% on Thursday as the stock turned ex-bonus following a 2:1 bonus issue. The decline is a technical adjustment, with shareholder value and market capitalization unchanged. Investors now hold three shares instead of one, at a proportionally lower price. The move aims to boost liquidity and broaden retail participation.",
            "pubDate": "2025-09-11T04:52:29.023688"
        },
        {
            "title": "Reliance Industries shares in focus after new AI unit launch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-after-new-ai-unit-launch/articleshow/123821601.cms",
            "description": "Reliance Industries has launched Reliance Intelligence, a wholly-owned subsidiary, to spearhead its AI ambitions in India. This move, announced after market hours with RIL shares closing positively, follows Mukesh Ambani's vision to transform RIL into a deep-tech enterprise.",
            "pubDate": "2025-09-11T04:52:29.023788"
        },
        {
            "title": "Tata Motors shares in focus after JLR faces cybersecurity breach",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-after-jlr-faces-cybersecurity-breach/articleshow/123821561.cms",
            "description": "Tata Motors share price: Jaguar Land Rover, Tata Motors' British subsidiary, suffered a cybersecurity breach, causing production and sales delays. The incident adds to ongoing challenges, including slowing demand, launch delays, and a 63% decline in Q1 consolidated net profit.",
            "pubDate": "2025-09-11T04:52:29.023887"
        },
        {
            "title": "Buy, Sell or Hold: Nomura sees about 30% upside in GAIL India; Motilal Oswal recommends a buy call on Coal India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nomura-sees-about-30-upside-in-gail-india-motilal-oswal-recommends-a-buy-call-on-coal-india/articleshow/123821396.cms",
            "description": "Nomura backs GAIL India on tariff hike, petrochemical recovery; Motilal Oswal bullish on Cummins India’s demand outlook and Coal India’s long-term dominance despite near-term earnings pressure. Targets: Rs 225, Rs 4,500, Rs 450.",
            "pubDate": "2025-09-11T04:52:29.023983"
        },
        {
            "title": "Dr Reddy’s shares slip nearly 2% on investor concerns amid $50 million foray into anti-vertigo category",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-shares-in-focus-after-50-million-acquisition-for-entry-in-anti-vertigo-category/articleshow/123821403.cms",
            "description": "Dr. Reddy's Laboratories' shares experienced a slight dip following the announcement of their acquisition of Stugeron from Johnson & Johnson for $50.5 million. This strategic move aims to bolster Dr. Reddy's Central Nervous System portfolio and expand its presence in the anti-vertigo market across 18 markets in APAC and EMEA, with a focus on India and Vietnam.",
            "pubDate": "2025-09-11T04:52:29.024074"
        },
        {
            "title": "Sensex rises over 50 pts, Nifty50 above 24,950 on U.S.-India trade talk hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-100-pts-nifty-50-tops-25000-on-u-s-india-trade-talk-hopes/articleshow/123821267.cms",
            "description": "Indian stocks began trading on a positive note Thursday, marking the Nifty 50's seventh consecutive session of gains. This surge followed U.S. President Donald Trump's announcement of planned discussions with Prime Minister Narendra Modi to address trade tensions. The S&P BSE Sensex rose by 0.13%, while the NSE Nifty 50 increased by 0.",
            "pubDate": "2025-09-11T04:52:29.024171"
        },
        {
            "title": "Kotak Mahindra Bank shares in focus as Sumitomo exits with Rs 6,256 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-as-sumitomo-exits-with-rs-6256-crore-block-deal/articleshow/123821340.cms",
            "description": "Kotak Mahindra Bank shares: SMBC sold its entire 1.65% stake in Kotak Mahindra Bank for ₹6,256 crore through block deals, with major global and domestic investors like BlackRock, Goldman Sachs, and Abu Dhabi Investment Authority participating.",
            "pubDate": "2025-09-11T04:52:29.024269"
        },
        {
            "title": "Infosys to announce billion-dollar share buyback plan today. What to expect and will the stock rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-to-announce-billion-dollar-share-buyback-plan-today-what-to-expect-and-will-the-stock-rally/articleshow/123821195.cms",
            "description": "Infosys is set to announce a Rs 10,000–15,000 crore share buyback today, its fifth since listing. Analysts see potential short-term support and EPS boost, while Infosys' share price's 25% year-long decline and attractive valuations make this buyback closely watched by investors.",
            "pubDate": "2025-09-11T04:52:29.024365"
        },
        {
            "title": "Titan, Astral among 5 stocks where foreign brokerages see up to 25% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-astral-among-5-stocks-where-foreign-brokerages-see-up-to-25-upside/slideshow/123821145.cms",
            "description": "Global brokerages have recently initiated coverage on several Indian companies across consumer, financials, and industrials, spotting potential upsides of up to 25%. Here are the five stocks in focus.",
            "pubDate": "2025-09-11T04:52:29.024458"
        },
        {
            "title": "Japanese investment in foreign stocks hit 4-month high as Fed cut bets mount",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japanese-investment-in-foreign-stocks-hit-4-month-high-as-fed-cut-bets-mount/articleshow/123822454.cms",
            "description": "Japanese investors significantly increased their net investments in foreign stocks, reaching a four-month high, driven by expectations of a Federal Reserve interest rate cut in September. This surge followed a U.S. Labor Department report indicating a rise in the unemployment rate, fueling speculation of potential rate cuts. Meanwhile, local Japanese stocks experienced net foreign inflows, while foreigners sold long-term bonds.",
            "pubDate": "2025-09-11T05:22:45.023413"
        },
        {
            "title": "Japan, Taiwan shares set records on tech boost, Fed cut hope",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-taiwan-shares-set-records-on-tech-boost-fed-cut-hope/articleshow/123822417.cms",
            "description": "Asian markets surged, with Japanese and Taiwanese shares hitting record highs driven by tech rallies and optimism for U.S. interest rate cuts. Investors are keenly awaiting U.S. CPI data, anticipating a dovish stance from the Federal Reserve. Oil prices remained steady amid geopolitical tensions, while gold prices edged closer to record highs.",
            "pubDate": "2025-09-11T05:22:45.023538"
        },
        {
            "title": "OFSS shares soar 18% in two days on parent’s cloud push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ofss-shares-soar-18-in-two-days-on-parents-cloud-push/articleshow/123822405.cms",
            "description": "Shares of Oracle Financial Services Software (OFSS) surged 18.3% over two sessions, driven by strong cloud guidance and blockbuster performance from parent Oracle Corp. Investors expect Oracle Cloud Infrastructure’s growth to boost OFSS’s license and cloud revenues. Oracle’s ambitious expansion, AI initiatives, and multibillion-dollar deals have made it a top-performing tech stock of 2025, propelling Larry Ellison past Elon Musk in billionaire rankings.",
            "pubDate": "2025-09-11T05:22:45.023760"
        },
        {
            "title": "BEML shares rise 2% on reports of upgradation from Miniratna to Navratna status",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/beml-shares-rise-2-on-reports-of-upgradation-from-miniratna-to-navratna-status/articleshow/123823036.cms",
            "description": "BEML shares rose 2after reports suggested the state-run equipment maker may be upgraded from Miniratna to Navratna, granting greater financial and operational freedom. The stock trades above key SMAs despite disappointing June-quarter earnings and flat revenue performance.",
            "pubDate": "2025-09-11T05:51:58.571689"
        },
        {
            "title": "LIC shares fall 15% in a year, over 70% of portfolio stocks fall up to 70%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-shares-fall-15-in-a-year-over-70-of-portfolio-stocks-fall-up-to-70/articleshow/123822766.cms",
            "description": "LIC is facing a challenging year, with its shares down 15% and over 70% of its portfolio stocks in the red, some plunging as much as 74%. Despite the overall slump, select holdings like Tourism Finance Corporation and Laurus Labs have delivered strong gains.",
            "pubDate": "2025-09-11T05:51:58.571813"
        },
        {
            "title": "​ECB may hold interest rates steady amid political and trade risks​​",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecb-may-hold-interest-rates-steady-amid-political-and-trade-risks/slideshow/123822724.cms",
            "description": "The European Central Bank is expected to leave interest rates unchanged on Thursday as inflation remains close to its target. The ECB halved its key rate to 2% in the year to June but has been on hold since, citing a “good place” for the eurozone economy. However, uncertainties around trade and politics mean that further easing cannot be ruled out. (Source: Reuters)",
            "pubDate": "2025-09-11T05:51:58.571925"
        },
        {
            "title": "Oracle's $244 billion single-day rally as big as entire IT trinity of TCS, Infosys, HCL Tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracles-244-billion-single-day-rally-as-big-as-entire-it-trinity-of-tcs-infosys-hcl-tech/articleshow/123822680.cms",
            "description": "Oracle's shares surged by 36%, adding $244 billion to its market cap after projecting substantial cloud infrastructure revenue growth, potentially reaching $144 billion by fiscal 2030. This rally briefly elevated Larry Ellison's wealth, nearing Elon Musk's.",
            "pubDate": "2025-09-11T05:51:58.572027"
        },
        {
            "title": "Jupiter Wagons shares jump 6% after bagging Rs 113 crore order from Indian Railways",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-wagons-shares-jump-6-after-bagging-rs-113-crore-order-from-indian-railways/articleshow/123822574.cms",
            "description": "Jupiter Wagons shares surged nearly 6% to Rs 338 after securing a Rs 113 crore order from Indian Railways for 9,000 LHB axles. The contract boosts the company’s rail infrastructure presence, with analysts maintaining a “BUY” rating and positive short-term momentum indicators.",
            "pubDate": "2025-09-11T05:51:58.572135"
        },
        {
            "title": "Larry Ellison beats Elon Musk in billionaire's game. Is Oracle ready to dethrone Tesla from the world's top 10 list?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/larry-ellison-beats-elon-musk-in-billionaires-game-is-oracle-ready-to-dethrone-tesla-from-the-worlds-top-10-list/articleshow/123824343.cms",
            "description": "Larry Ellison, the Oracle founder, briefly surpassed Elon Musk to become the world's richest person. This happened after Oracle shares surged, increasing the company's market value significantly. Oracle's rise is due to promising forecasts for its cloud infrastructure revenue. The company has also secured major deals in the artificial intelligence sector. This shift highlights the dynamic nature of wealth rankings.",
            "pubDate": "2025-09-11T06:58:16.584126"
        },
        {
            "title": "Time to accumulate, not exit, tariff-hit stocks: Sunil Subramaniam",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-accumulate-not-exit-tariff-hit-stocks-sunil-subramaniam/articleshow/123824117.cms",
            "description": "Amidst U.S.-India trade uncertainties, Sundaram Mutual Fund's Sunil Subramaniam views Trump's tariff tactics as business maneuvers, not solely India-centric. He suggests India is a pawn in broader geopolitical plays, particularly concerning Russia and the EU. Despite initial FII selling, recent inflows and domestic portfolio shifts signal a positive market outlook.",
            "pubDate": "2025-09-11T06:58:16.584256"
        },
        {
            "title": "Fed poised to start interest-rate cuts next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-poised-to-start-interest-rate-cuts-next-week/slideshow/123823572.cms",
            "description": "Traders are predicting the Federal Reserve will start a series of interest-rate cuts next week and continue through the end of the year, following cooler-than-expected producer price inflation.",
            "pubDate": "2025-09-11T06:58:16.584363"
        },
        {
            "title": "US inflation eases; Fed may be forced to cut rates by 50 bps: Manish Singh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-inflation-eases-fed-may-be-forced-to-cut-rates-by-50-bps-manish-singh/articleshow/123824038.cms",
            "description": "US inflation eased as September PPI came in below expectations, strengthening the case for a 50-bps rate cut by the Federal Reserve. Market expert Manish Singh says disinflationary trends, normalised supply chains, and slower US GDP growth may prompt the Fed to act next week.",
            "pubDate": "2025-09-11T06:58:16.584467"
        },
        {
            "title": "Bajaj Housing Finance will give subpar returns, says Motilal Oswal: Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-finance-will-give-subpar-returns-says-motilal-oswal-heres-why/articleshow/123823887.cms",
            "description": "Motilal Oswal initiates coverage on Bajaj Housing Finance with a neutral rating. The brokerage anticipates moderate growth and subdued return ratios. Valuations appear stretched, trading significantly above the IPO price. AUM and profit are expected to rise, but at a slower pace. NIMs may face pressure. The financier has a granular loan book with good asset quality.",
            "pubDate": "2025-09-11T06:58:16.584572"
        },
        {
            "title": "Reliance Communications shares drop 2% on ‘fraud’ notice from Central Bank of India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-communications-shares-drop-2-on-fraud-notice-from-central-bank-of-india/articleshow/123823429.cms",
            "description": "Reliance Communications shares fell after receiving a show-cause notice from the Central Bank of India proposing to classify Rs 400 crore of loan accounts as “fraud” and report to the RBI. The company is under ongoing insolvency proceedings.",
            "pubDate": "2025-09-11T06:58:16.584700"
        },
        {
            "title": "SpiceJet shares snap 6-day losing streak. What’s behind the surge today?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-snap-6-day-losing-streak-whats-behind-the-surge-today/articleshow/123823203.cms",
            "description": "SpiceJet shares surged 5% to Rs 34.85, ending a six-day losing streak, after the airline reached a financial settlement with Carlyle Aviation Partners. The deal provides $79.6 million for engine maintenance, $9.9 million in cash, and equity worth $50 million, strengthening the balance sheet. The airline reported a Rs 234 crore net loss in Q1 FY2026 amid geopolitical and operational challenges.",
            "pubDate": "2025-09-11T06:58:16.584800"
        },
        {
            "title": "HAL shares rise over 1% on receiving third GE-404 engine from US for LCA Mark-1A",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-shares-rise-over-1-on-receiving-third-ge-404-engine-from-us-for-lca-mark-1a/articleshow/123824794.cms",
            "description": "Hindustan Aeronautics Ltd (HAL) shares surged following confirmation of progress in the LCA Tejas fighter jet engine procurement. The company is set to receive 12 GE-404 engines this fiscal year, keeping production on track.",
            "pubDate": "2025-09-11T07:30:40.795728"
        },
        {
            "title": "Market eyes festive rally as India-US trade talks spark optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-eyes-festive-rally-as-india-us-trade-talks-spark-optimism/articleshow/123825482.cms",
            "description": "Indian markets held gains Wednesday, with Nifty near 25,000, amid trade optimism and festive demand. Analysts say a favourable trade deal could boost sentiment, while corporate earnings remain key. The auto sector, including Hero MotoCorp and M&M, may benefit from GST resets and rising volumes.",
            "pubDate": "2025-09-11T07:47:14.885785"
        },
        {
            "title": "Are bulls back? Add diversification to being bullish & cautious: 6 large-caps from different sectors with upside potential of up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-bulls-back-add-diversification-to-being-bullish-cautious-6-large-caps-from-different-sectors-with-upside-potential-of-up-to-28/articleshow/123824663.cms",
            "description": "The markets love a good story, and renewed optimism around an India-US trade breakthrough is a great one. Hints of tariff compromises, smoother market access, and upbeat headlines can lift indices and compress risk premiums in a hurry. Traders should enjoy it; but investors should be careful with it. For portfolios that aim to grow over years, trade headlines are context, not thesis. The thesis still lives in earnings power, pricing, volumes, cost curves, balance-sheet strength, and, of course, that great story about India’s domestic growth.",
            "pubDate": "2025-09-11T07:47:14.885904"
        },
        {
            "title": "Market consolidation continues amid cautious investor sentiment; HAL, CG Power among top picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-consolidation-continues-amid-cautious-investor-sentiment-hal-cg-power-among-top-picks/articleshow/123827695.cms",
            "description": "Indian markets consolidated near the 25,000 mark as Nifty stayed range-bound. Rajesh Palviya highlighted strong call writing at 25,000, with breakouts likely to trigger rallies. Bank Nifty’s hurdle remains at 54,800, while HAL and CG Power show bullish setups.",
            "pubDate": "2025-09-11T09:57:40.622397"
        },
        {
            "title": "Autos consolidate, defence a long-term bet, IT valuations attractive: Amnish Aggarwal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/autos-consolidate-defence-a-long-term-bet-it-valuations-attractive-amnish-aggarwal/articleshow/123827666.cms",
            "description": "Indian markets are seeing sector rotations as investors weigh optimism from GST cuts and reforms against profit-taking. While autos and consumer stocks have surged 20–30%, near-term volatility is expected, though structural growth prospects remain positive.",
            "pubDate": "2025-09-11T09:57:40.622533"
        },
        {
            "title": "Unique Picks: 7 out of 10 stocks held by only one MF crash up to 50%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unique-picks-7-out-of-10-stocks-held-by-only-one-mf-crash-up-to-50-do-you-own-any/slideshow/123826524.cms",
            "description": "ETMarkets analyzed mutual fund portfolios to identify stocks that are uniquely held by one mutual fund scheme. The initial screening for August 2025 identified 201 such stocks. This list was further refined to include only those with equity mutual fund holdings valued at over Rs 10 crore as of August 2025, narrowing the selection down to 20 stocks.Data reveals that the majority of these stocks have delivered negative returns in 2025. We have highlighted the top 7 major losers, each of which have declined over 25% this year, along with the 3 top performers that have surged between 35% and 55%. (Data Source: ACE MF, ACE Equity).",
            "pubDate": "2025-09-11T09:57:40.622647"
        },
        {
            "title": "Vinit Sambre identifies semiconductors, energy and healthcare as high-potential growth sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vinit-sambre-identifies-semiconductors-energy-and-healthcare-as-high-potential-growth-sectors/articleshow/123827358.cms",
            "description": "Indian markets remain resilient despite global uncertainty, with Vinit Sambre highlighting emerging profit pools in semiconductors, energy transition, and healthcare. He sees these sectors as sustainable growth drivers, even amid high valuations and potential short-term volatility.",
            "pubDate": "2025-09-11T09:57:40.622746"
        },
        {
            "title": "European shares inch up with ECB interest rate verdict, US data in spotlight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-inch-up-with-ecb-interest-rate-verdict-us-data-in-spotlight/articleshow/123827147.cms",
            "description": "European stocks saw a slight increase. Investors are waiting for the European Central Bank's policy decision. They also await the U.S. inflation data. Defence stocks are up due to geopolitical tensions. The ECB is expected to maintain current interest rates. France's equities face a downgrade. Kering delays Valentino purchase. Covestro rose after ADNOC addresses EU concerns.",
            "pubDate": "2025-09-11T09:57:40.622850"
        },
        {
            "title": "Jefferies unveils 8 new buy calls, expands list to 25 stocks. Check full list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-unveils-8-new-buy-calls-expands-list-to-25-stocks-check-full-list/articleshow/123826960.cms",
            "description": "Jefferies has refreshed its equity strategy, adding 8 new stocks to its list of 25 top buy ideas from a universe of 223. The brokerage’s picks span sectors including banks, petrochemicals, IT, pharma, and real estate. Key names include Reliance Industries, Coforge, Adani Ports, HAL, HDFC Bank, ICICI Bank, and Bharti Airtel.",
            "pubDate": "2025-09-11T09:57:40.622955"
        },
        {
            "title": "Earnings strength likely to drive year-end rally: Matt Orton",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-strength-likely-to-drive-year-end-rally-matt-orton/articleshow/123826956.cms",
            "description": "Speaking to ET Now, Matt Orton said the numbers highlight a shift in risks. “I think the inflation data to come in is showing that perhaps the balance of risks is shifting a little bit more towards unemployment than on the inflationary front.",
            "pubDate": "2025-09-11T09:57:40.623055"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Ladder Spread in Nifty for potential gains from bullish stock placement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-ladder-spread-in-nifty-for-potential-gains-from-bullish-stock-placement/articleshow/123826927.cms",
            "description": "Lupin shares trade at Rs 1,979.70, showing early reversal signs and poised to break the falling trend line above Rs 2,000. Momentum indicators and options data support bullish momentum. Analysts suggest a Bull Call Ladder Spread strategy to capitalize on potential upside toward Rs 2,100–2,150, with strong support at Rs 1,900.",
            "pubDate": "2025-09-11T09:57:40.623173"
        },
        {
            "title": "Waaree Energies crosses Rs 1 lakh crore m-cap as shares surge 8%, hit fresh 52-wk high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-crosses-rs-1-lakh-crore-m-cap-as-shares-surge-8-hit-fresh-52-wk-high/articleshow/123826833.cms",
            "description": "Waaree Energies' market capitalisation surpassed Rs 1 lakh crore as its stock price soared 8% to a 52-week high on Thursday, driven by robust buying activity. The company's shares have delivered impressive returns, outperforming major indices and industry averages. This surge follows a strong Q1 performance, with an 89% increase in consolidated net profit and a 30% rise in revenue from operations.",
            "pubDate": "2025-09-11T09:57:40.623274"
        },
        {
            "title": "China shares close near 3-year high on AI optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-shares-close-near-3-year-high-on-ai-optimism/articleshow/123826823.cms",
            "description": "China stocks closed up on Thursday, hovering near its highest level in more than three years, as investors remained bullish on AI plays despite concerns over potential U.S. restrictions on Chinese innovative drugs.",
            "pubDate": "2025-09-11T09:57:40.623370"
        },
        {
            "title": "Sebi board to meet on Friday to consider regulatory reforms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-board-to-meet-on-friday-to-consider-regulatory-reforms/articleshow/123826695.cms",
            "description": "Other key items on the agenda included simplifying compliance for foreign portfolio investors (FPIs), relaxing the regulation for accredited investors in certain alternative investment funds (AIFs), expanding the scope of rating agencies' activities, and granting equity status to REITs and InvITs, they added.",
            "pubDate": "2025-09-11T09:57:40.623467"
        },
        {
            "title": "Waaree Energies crosses Rs 1 lakh crore m-cap as shares surge 8%, hit fresh 52-wk high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-crosses-rs-1-lakh-crore-m-cap-as-shares-surge-8-hit-fresh-52-wk-high/articleshow/123826680.cms",
            "description": "Waaree Energies’ market cap crossed ₹1 lakh crore after an 8% surge to a 52-week high, supported by strong buying and rising volumes. The stock has delivered 147% returns, outperforming broader market and industry indices.",
            "pubDate": "2025-09-11T09:57:40.623563"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Ladder Spread in Lupin for potential gains from bullish stock placement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-ladder-spread-in-nifty-for-potential-gains-from-bullish-stock-placement/articleshow/123825939.cms",
            "description": "Lupin shares trade at Rs 1,979.70, showing early reversal signs and poised to break the falling trend line above Rs 2,000. Momentum indicators and options data support bullish momentum. Analysts suggest a Bull Call Ladder Spread strategy to capitalize on potential upside toward Rs 2,100–2,150, with strong support at Rs 1,900.",
            "pubDate": "2025-09-11T09:57:40.623654"
        },
        {
            "title": "Explained: What Oracle's 36% rally means for OFSS shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-oracles-36-rally-means-for-ofss-shareholders/articleshow/123825637.cms",
            "description": "OFSS shares saw early gains following Oracle Corp’s historic 36% rally, but later gave up all profits after the company clarified no material developments impact its business. While Oracle’s AI-driven cloud growth sets a positive backdrop, OFSS’s performance remains tied to its own financial software operations and deal pipeline.",
            "pubDate": "2025-09-11T09:57:40.623770"
        },
        {
            "title": "At $88.5 billion, Larry Ellison made more money in 1 day than Gautam Adani's net worth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-88-5-billion-larry-ellison-made-more-money-in-1-day-than-gautam-adanis-net-worth/articleshow/123825562.cms",
            "description": "Larry Ellison's wealth surged by $88.5 billion on Wednesday, marking the largest single-day increase ever recorded by Bloomberg's Billionaires Index, driven by Oracle's stock rally. This surge, fueled by optimistic forecasts for cloud infrastructure revenue growth and significant AI-related contracts, briefly propelled Ellison past Elon Musk as the world's richest person. Oracle's market value soared, nearing the $1 trillion mark.",
            "pubDate": "2025-09-11T09:57:40.623864"
        },
        {
            "title": "BSE shares slump 8% in 2 days ahead of Sebi board meet; reports on weekly expiry curb weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-slump-7-in-2-days-ahead-of-sebi-board-meet-reports-on-weekly-expiry-curb-weigh/articleshow/123825524.cms",
            "description": "BSE shares fell for two days in a row ahead of Sebi’s board meet amid reports of a plan to curb weekly F&O expiries. Analysts caution that regulatory changes, including expiry shifts and open interest norms, may impact derivatives trading volumes and BSE’s earnings outlook.",
            "pubDate": "2025-09-11T09:57:40.623960"
        }
    ]
}