{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-19T12:41:20.208804",
    "items": [
        {
            "title": "Bank of England keeps rates steady, sees further loosening as jobs market weakens",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-england-keeps-rates-steady-sees-further-loosening-as-jobs-market-weakens/articleshow/121953229.cms",
            "description": "The Bank of England maintained interest rates at 4.25%, amidst concerns over a softening labour market and rising energy prices due to Middle East tensions. While a Reuters poll anticipated a 7-2 vote to hold, the Monetary Policy Committee decided 6-3. Governor Andrew Bailey indicated a gradual downward path for rates, emphasizing unpredictability and vigilance towards inflation.",
            "pubDate": "2025-06-19T11:33:17.697601"
        },
        {
            "title": "Explained! What Sebi's nod on co-investment within AIFs means for investors, fund managers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-sebis-nod-on-co-investment-within-aifs-means-for-investors-fund-managers/articleshow/121952303.cms",
            "description": "Market regulator Securities and Exchange Board of India (Sebi) on Wednesday approved a new framework allowing Category I and II Alternative Investment Funds (AIFs) to offer co-investment opportunities directly within the AIF structure.",
            "pubDate": "2025-06-19T11:33:17.697723"
        },
        {
            "title": "Ambanis bag top 3 spots in India’s under-40 wealth icons, Nikhil Kamath among top 10. Check full list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambanis-bag-top-3-spots-in-indias-under-40-wealth-icons-nikhil-kamath-among-top-10-check-full-list/slideshow/121952157.cms",
            "description": "India is witnessing a dynamic shift in its wealth landscape, led by a new generation of under-40 wealth creators. According to the inaugural ‘360 ONE Wealth Creators List’ launched by 360 ONE Wealth (WAM) in collaboration with CRISIL, over 2,000 Indian individuals have amassed wealth worth nearly Rs 100 trillion. These young business leaders are reshaping industries with their innovation and enterprise.This new generation of leaders remains actively involved in their businesses, with a significant share of their wealth tied to publicly listed companies. India has 143 active wealth creators under the age of 40, many of whom are pioneering digital-first business models. A majority of India’s first-generation entrepreneurs under the age of 40 have attained wealth by leveraging the digital economy to disrupt traditional business models. Here are the top 10 under-40 icons of India.",
            "pubDate": "2025-06-19T11:33:17.697830"
        },
        {
            "title": "Ashish Kacholia-backed smallcap stock jumps 18% on heavy trade volumes. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-smallcap-stock-jumps-18-on-heavy-trade-volumes-do-you-own/articleshow/121952210.cms",
            "description": "Shares of Aeroflex Industries climbed as much as 17.9% on Thursday to Rs 206.10 on the BSE, as heavy volumes and strong technical momentum powered a sharp rally in the smallcap stock backed by veteran investor Ashish Kacholia.",
            "pubDate": "2025-06-19T11:33:17.697933"
        },
        {
            "title": "Market Wrap: D-Street slips as hawkish Fed, Middle East tensions drag; Sensex down 83 pts, Nifty below 24,800",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-street-slips-as-hawkish-fed-middle-east-tensions-drag-sensex-down-83-pts-nifty-below-24800/articleshow/121952068.cms",
            "description": "Stock Market Highlights: Indian benchmark indices Sensex and Nifty closed lower on Thursday, dragged down by IT and financial stocks, as hawkish signals from the U.S. Federal Reserve and persistent Middle East tensions weighed on sentiment.",
            "pubDate": "2025-06-19T11:33:17.698033"
        },
        {
            "title": "Rich Dad, Poor Dad author Kiyosaki slams false prophets on YouTube, claims he saw 2025 crash coming years ago",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rich-dad-poor-dad-author-kiyosaki-slams-false-prophets-on-youtube-claims-he-saw-2025-crash-coming-years-ago/articleshow/121951821.cms",
            "description": "Robert Kiyosaki, the author of Rich Dad Poor Dad, predicts a global financial crisis. He blames artificial intelligence and inflation. Kiyosaki advises caution regarding mainstream financial advice. He suggests investing in silver, gold, and Bitcoin. Kiyosaki criticizes the U.S. abandonment of the gold standard. He encourages financial self-reliance. He also warns against 'false prophets' on YouTube and in schools.",
            "pubDate": "2025-06-19T11:33:17.698129"
        },
        {
            "title": "Swiggy shares rally 8% in 2 days; IIFL sees 46% upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-rally-8-in-2-days-iifl-sees-46-upside-potential/articleshow/121951363.cms",
            "description": "Swiggy's share price surged following a 'buy' rating from IIFL Capital, projecting a 46% upside. The brokerage emphasises Swiggy's improving execution in food delivery and the underappreciated potential of its quick commerce venture, Bolt.",
            "pubDate": "2025-06-19T11:33:17.698229"
        },
        {
            "title": "Metal stocks: Candidates for tactical and contrarian investing? 6 metal  stocks with an upside potential of up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metal-stocks-candidates-for-tactical-and-contrarian-investing-6-metal-stocks-with-an-upside-potential-of-up-to-39/articleshow/121950963.cms",
            "description": "Amidst geopolitical noise, the street is not paying much heed to the global economy, especially China. History teaches us that geopolitical developments do not dominate the street beyond a point. So, why talk about China at this juncture? Simple: It is the only large economy that has been under pressure for quite some time, with several attempts to revive it. History also tells us that the dragon can dance after taking some rest. It might hence be time to look at China with more optimism than pessimism. It may provide us with tactical investment opportunities for a few months or quarters.",
            "pubDate": "2025-06-19T11:33:17.698341"
        },
        {
            "title": "Israel’s TA-35 hits 52-week high as markets brush off Iran’s attack on stock exchange",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/israels-ta-35-hits-52-week-high-as-markets-brush-off-irans-attack-on-stock-exchange/articleshow/121950809.cms",
            "description": "Around 2 pm India time (11:24 am GMT+3 Israel time), the TA-35 index was trading at 2,810.45, up by 0.18% with 18 gainers and 17 declines in the 35-stock index.",
            "pubDate": "2025-06-19T11:33:17.698434"
        },
        {
            "title": "NaBFID plans debut overseas fund raise of up to $1 billion, official says",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nabfid-plans-debut-overseas-fund-raise-of-up-to-1-billion-official-says/articleshow/121950357.cms",
            "description": "National Bank for Financing Infrastructure and Development may raise funds overseas. The state-run lender considers borrowing up to $1 billion this fiscal year. This move aims to diversify funding sources. NaBFID has sanctioned loans worth over 2 trillion rupees till March. It targets loan sanctions of 1.2 trillion rupees by fiscal year-end.",
            "pubDate": "2025-06-19T11:33:17.698525"
        },
        {
            "title": "These 9 Nifty Microcap Index stocks trading below industry PE may rally up to 42%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-nifty-microcap-index-stocks-trading-below-industry-pe-may-rally-up-to-42/slideshow/121950337.cms",
            "description": "Low price-to-earnings (PE) ratio stocks are often viewed as value picks for long-term investors. According to data from Trendlyne, several Nifty Microcap 250 index stocks—including Gulf Oil Lubricants, Karnataka Bank, DCB Bank, and Shriram Pistons—are currently trading at valuations lower than their respective industry averages. Despite operating across diverse sectors, these stocks have the potential to deliver returns of up to 42%.",
            "pubDate": "2025-06-19T11:33:17.698623"
        },
        {
            "title": "Hemang Jani’s Stock Picks: Positive on Vedanta, cautious on Jio Fin & Vodafone Idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hemang-janis-stock-picks-positive-on-vedanta-cautious-on-jio-fin-amp-vodafone-idea/slideshow/121949956.cms",
            "description": "In an interview with ET Now, Hemang Jani said that the markets are undergoing a healthy time correction rather than showing signs of a breakdown. He emphasized that the fundamental structure remains strong, supported by a robust earnings outlook over the next two to three quarters. Regulatory developments are also favorable, and fund flows remain encouraging. While geopolitical tensions and a slight rise in crude oil prices create temporary uncertainty, he expects stability to return soon, making this pause nothing to worry about",
            "pubDate": "2025-06-19T11:33:17.698719"
        },
        {
            "title": "European shares dip as Middle East tensions, U.S. involvement fears weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-dip-as-middle-east-tensions-u-s-involvement-fears-weigh/articleshow/121949291.cms",
            "description": "European stock markets opened lower today, with the backdrop of escalating Middle Eastern conflicts casting a shadow over investor confidence. Speculation surrounding potential U.S. engagement in the region is adding to the unease. In contrast, the energy sector is thriving, riding high on increasing oil prices. Stora Enso stood out with a notable increase in its stock value.",
            "pubDate": "2025-06-19T11:33:17.698810"
        },
        {
            "title": "Vedanta shares fall over 3% after declaring first interim dividend for FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-fall-over-3-after-declaring-first-interim-dividend-for-fy26/articleshow/121949277.cms",
            "description": "Vedanta shares fell over 3% after declaring a Rs 7 interim dividend for FY26 and selling a 1.6% stake in Hindustan Zinc for Rs 3,028 crore. The company aims to use the proceeds to reduce debt ahead of its planned demerger. Despite a strong dividend track record, Vedanta stock has declined 10% over the past six months.",
            "pubDate": "2025-06-19T11:33:17.698909"
        },
        {
            "title": "Unique Picks: These 11 stocks held by only one MF scheme surge 15-30% in over a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unique-picks-these-11-stocks-held-by-only-one-mf-scheme-surge-15-30-in-over-a-month/slideshow/121949096.cms",
            "description": "ETMarkets analyse mutual fund portfolios to identify stocks exclusively held by a single scheme. The initial list, compiled in May 2025, included 137 such stocks. This was then refined to include only those with a market capitalisation above Rs 20 crore as of May 2025 and a share price return between 15% and 75% since the beginning of May. After applying these criteria, 11 stocks made the cut. Notably, three of them delivered gains of over 50% in just over a month. (Data Source: ACE MF, ACE Equity).",
            "pubDate": "2025-06-19T11:33:17.699002"
        },
        {
            "title": "Siemens Energy may see up to $180 million in outflows after MSCI exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siemens-energy-may-see-up-to-180-million-in-outflows-after-msci-exit/articleshow/121948616.cms",
            "description": "Global index provider MSCI will delete Siemens Energy India from its Global Standard Index (Large Cap segment), effective post-market close on June 20. The exit, Nuvama notes, could trigger “estimated passive outflow in the range of USD 170–180 million,” although the brokerage added that a more accurate estimate would be available once the stock begins trading.",
            "pubDate": "2025-06-19T11:33:17.699094"
        },
        {
            "title": "Aditya Birla Lifestyle Brands to list on BSE on June 23, post ABFRL demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-lifestyle-brands-to-list-on-bse-on-june-23-post-abfrl-demerger/articleshow/121954851.cms",
            "description": "Under the demerger plan, ABFRL has transferred its Madura Fashion & Lifestyle business to Aditya Birla Lifestyle Brands. Shareholders will receive one ABLBL share for each ABFRL share they hold, in addition to retaining their existing ABFRL shares.",
            "pubDate": "2025-06-19T12:41:18.460575"
        },
        {
            "title": "Eppeltone Engineers IPO subscribed 234 times, GMP robust at 47% on Day 3. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eppeltone-engineers-ipo-subscribed-234-times-gmp-robust-at-47-on-day-3-check-details/articleshow/121954163.cms",
            "description": "Eppeltone Engineers’ IPO saw overwhelming demand with 234x subscription on Day 3, led by retail investors. Shares command a 46.9% grey market premium ahead of NSE SME listing.",
            "pubDate": "2025-06-19T12:41:18.460704"
        },
        {
            "title": "Stock Radar: 20% rally in 3 months! This IT stock is likely to retest 6000 levels in next 4-5 months – time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-20-rally-in-3-months-this-it-stock-is-likely-to-retest-6000-levels-in-next-4-5-months-time-to-buy/articleshow/121935366.cms",
            "description": "LTIMindtree has shown a strong rally, reclaiming crucial moving averages and triggering buy signals. Experts suggest a target price of Rs 6,000 in the next 4-5 months, supported by bullish patterns like the inverse head and shoulders. Positive crossovers in EMA and Directional Moving Index further reinforce the uptrend, with a recommended stop loss at Rs 4,980.",
            "pubDate": "2025-06-19T12:41:18.460927"
        }
    ]
}