{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-17T17:22:27.373246",
    "items": [
        {
            "title": "RIL Q1 Results Preview: Asian Paints stake sale to trigger up to 88% YoY PAT growth. Check revenue, margin estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q1-results-preview-asian-paints-stake-sale-to-trigger-up-to-88-yoy-pat-growth-check-revenue-margin-estimates/articleshow/122617780.cms",
            "description": "Reliance Industries is projected to reveal a robust Q1 performance, fueled by the Asian Paints stake sale and strong showings in O2C, Digital, and Retail. While revenue trends are mixed, EBITDA is expected to rise across brokerages due to margin improvements in core verticals. E&P segment may experience a decline due to lower production.",
            "pubDate": "2025-07-17T07:20:52.211531"
        },
        {
            "title": "Jio Financial to announce Q1 results today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-to-announce-q1-results-today/articleshow/122606345.cms",
            "description": "Jio Financial Services is set to announce its Q1 earnings today, along with a presentation to analysts. Other key companies like Axis Bank, Wipro, and LTIMindtree will also release their results. Jio Financial's Q4 FY25 saw a marginal profit increase and revenue growth. Its mutual fund arm, Jio BlackRock, recently secured SEBI approval for five new index funds.",
            "pubDate": "2025-07-17T07:20:52.211682"
        },
        {
            "title": "Steel firms to see profit growth amid price hikes, cheaper coking coal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/steel-firms-to-see-profit-growth-amid-price-hikes-cheaper-coking-coal/articleshow/122603200.cms",
            "description": "Steelmakers are poised for a profit increase in the fiscal first quarter, driven by rebounding domestic steel prices and lower coking coal costs, despite an anticipated sales volume decline. Conversely, non-ferrous metal producers face a challenging quarter with projected revenue and EBITDA declines due to weaker commodity prices and softer volumes.",
            "pubDate": "2025-07-17T07:20:52.211796"
        },
        {
            "title": "Le Travenues reports Q1 profit at Rs 19 crore, revenue at Rs 314 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/le-travenues-reports-q1-profit-at-rs-19-crore-revenue-at-rs-314-crore/articleshow/122586104.cms",
            "description": "ixigo reported a strong Q1 FY26, with revenue up 73% to ₹314.5 crore and net profit rising 27% to ₹19 crore. GTV grew 55%, driven by flights and buses. The company's EBITDA increased by 69%. ixigo is focusing on AI-driven efficiencies and customer-centric approaches. Train bookings by Gen Z and solo female travelers saw significant growth.",
            "pubDate": "2025-07-17T07:20:52.211900"
        },
        {
            "title": "Angel One Q1 Results: Profit dips to at Rs 114 crore on derivative trading curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/angel-one-q1-results-profit-dips-to-at-rs-114-crore-on-derivative-trading-curbs/articleshow/122582346.cms",
            "description": "Indian brokerage Angel One on Wednesday posted a 61% fall in first-quarter profit, as tighter rules for equity derivatives trading in India weighed on retail activity, a key driver for the brokerage's earnings.",
            "pubDate": "2025-07-17T07:20:52.212003"
        },
        {
            "title": "ITC Hotels reports revenue of Rs 816 crore for Q1FY26, profit at Rs 134 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-hotels-reports-revenue-of-rs-816-crore-for-q1fy26-profit-at-rs-134-crore/articleshow/122578297.cms",
            "description": "ITC Hotels reported a 54% YoY rise in Q1 profit at Rs 134 crore and 16% revenue growth to Rs 816 crore. The board approved Rs 328 crore capex for a new Vizag hotel as the company targets aggressive expansion across India.",
            "pubDate": "2025-07-17T07:20:52.212106"
        },
        {
            "title": "L&T Tech Q1 Results: Cons PAT up marginally YoY, revenue surges 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-tech-q1-results-cons-pat-up-marginally-yoy-revenue-surges-16/articleshow/122575748.cms",
            "description": "LTTS Q1 results: L&T Technology Services reported a marginal 0.7% increase in its June quarter consolidated net profit at Rs 316 crore versus Rs 314 crore reported by the company in the year ago period.",
            "pubDate": "2025-07-17T07:20:52.212204"
        },
        {
            "title": "Tech Mahindra Q1 Results: Cons PAT surges 34% YoY to Rs 1,141 crore, misses Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q1-results-cons-pat-surges-34-yoy-to-rs-1141-crore-misses-street-estimates/articleshow/122573542.cms",
            "description": "Tech Mahindra Q1 Results: Tech Mahindra on Wednesday reported a 34% growth in its Q1FY26 consolidated net profit at Rs 1,141 crore versus Rs 851 crore in the year ago period. The profit is attributable to the owners of the company and is below Street's estimates Rs 1,211 crore.",
            "pubDate": "2025-07-17T07:20:52.212305"
        },
        {
            "title": "ITC Hotels Q1 Results: Cons PAT jumps 54% YoY to Rs 133 crore; revenue advances 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-hotels-q1-results-cons-pat-jumps-54-yoy-to-rs-133-crore-revenue-advances-15/articleshow/122566716.cms",
            "description": "ITC Hotels Q1 Results: Revenue from operations for the quarter stood at Rs 816 crore, up 15.5% from Rs 706 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-07-17T07:20:52.212401"
        },
        {
            "title": "Wipro Q1 Preview: PAT may rise 5-12% YoY; topline likely to remain muted. Key metrics to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q1-preview-pat-may-rise-5-12-yoy-topline-likely-to-remain-muted-key-metrics-to-track/articleshow/122565220.cms",
            "description": "Wipro is expected to post muted Q1FY26 revenue growth due to weak demand in Europe, while PAT may rise 5–12% year-on-year. Margins are likely stable, supported by cost control. Analysts focus on H2 guidance, deal ramp-ups and Europe’s performance as key triggers.",
            "pubDate": "2025-07-17T07:20:52.212499"
        },
        {
            "title": "Axis Bank Q1 Preview: Modest PAT and NII growth expected amid margin pressures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q1-preview-modest-pat-and-nii-growth-expected-amid-margin-pressures/articleshow/122561675.cms",
            "description": "Axis Bank's Q1FY26 earnings, due Thursday, are projected to show modest growth, with PAT and NII up by approximately 2% year-on-year. Loan growth is anticipated in the 7-8% range, but analysts are closely watching asset quality and margin trends.",
            "pubDate": "2025-07-17T07:20:52.212596"
        },
        {
            "title": "IHCL reports Q1 revenues of Rs 2,102 crore, PAT at Rs 296 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ihcl-reports-q1-revenues-of-rs-2102-crore-pat-at-rs-296-crore/articleshow/122656200.cms",
            "description": "Tata-backed Indian Hotels Company (IHCL) posted a 32% YoY revenue growth at ₹2,102 crore and 19% profit rise to ₹296 crore in Q1FY26. Strong performance continued despite global disruptions, aided by new signings, hotel openings, and robust segmental growth.",
            "pubDate": "2025-07-17T17:22:11.859245"
        },
        {
            "title": "Nuvoco Vistas Q1 profit surges to Rs 133 crore on higher sales, flat costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nuvoco-vistas-q1-profit-surges-to-rs-133-crore-on-higher-sales-flat-costs/articleshow/122653690.cms",
            "description": "Nuvoco Vistas reported a sharp jump in Q1FY26 profit to ₹133 crore from ₹2.84 crore a year ago, driven by 9% revenue growth and stable expenses. Cement sales hit 5.1 million tonnes and EBITDA reached ₹533 crore, the highest ever for Q1. The company also reduced debt significantly year-on-year, excluding new borrowings for the Vadraj acquisition.",
            "pubDate": "2025-07-17T17:22:11.859377"
        },
        {
            "title": "Tata Communications Q1 Results: Cons PAT falls 43% YoY to Rs 190 crore, revenue up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-communications-q1-results-cons-pat-falls-43-yoy-to-rs-190-crore-revenue-up-7/articleshow/122650095.cms",
            "description": "Tata Communications reported a 43% YoY drop in Q1FY26 net profit at Rs 190 crore. Revenue rose 7% to Rs 5,960 crore. Sequentially, profit plunged 82%, with mixed performance across key business segments like data, voice, and transformation services.",
            "pubDate": "2025-07-17T17:22:11.859490"
        },
        {
            "title": "Wipro ADR surges over 5% after Q1 profit grows 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-adr-surge-over-5-after-q1-profit-grows-11/articleshow/122648444.cms",
            "description": "Wipro ADRs rose over 5% as the company reported an 11% YoY increase in Q1FY26 net profit to ₹3,330 crore, exceeding Street estimates. Revenue grew 0.7% to ₹22,134 crore.",
            "pubDate": "2025-07-17T17:22:11.859621"
        },
        {
            "title": "Sterling and Wilson Q1 Results: Cons PAT skyrockets 680% YoY to Rs 39 crore, revenue soars 93%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sterling-and-wilson-q1-results-cons-pat-skyrockets-680-yoy-to-rs-39-crore-revenue-soars-93/articleshow/122646733.cms",
            "description": "Sterling and Wilson Renewable Energy reported a 680% YoY surge in Q1FY26 net profit to ₹39 crore, driven by a 93% revenue increase to ₹1,762 crore. EBITDA rose 176% YoY. Sequentially, profit and revenue dipped, but operational efficiency and execution remain strong.",
            "pubDate": "2025-07-17T17:22:11.859735"
        },
        {
            "title": "South Indian Bank Q1 profit rises 9.5% to Rs 322 crore despite surge in provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/south-indian-bank-q1-profit-rises-9-5-to-rs-322-crore-despite-surge-in-provisions/articleshow/122643006.cms",
            "description": "South Indian Bank reported a 9.5% YoY rise in Q1FY26 net profit to Rs 322 crore, aided by a 47% surge in non-core income. Despite nearly doubling provisions, the bank's pre-provision operating profit rose 32% and asset quality improved.",
            "pubDate": "2025-07-17T17:22:11.859840"
        },
        {
            "title": "Wipro Q1 Results: PAT rises 11% YoY to Rs 3,330 cr; dividend declared at Rs 5/share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q1-results-pat-rises-11-yoy-to-rs-3330-cr-dividend-declared-at-rs-5/share/videoshow/122641515.cms",
            "description": "Tech major Wipro on Thursday reported an 11% growth in its Q1FY26 consolidated net profit at Rs 3,330 crore, compared to Rs 3,003 crore in the year-ago period. The profit, attributable to the equity holders of the company, slightly exceeded Street estimates of Rs 3,233 crore. Wipro also announced an interim dividend of Rs 5 per share for the financial year 2025–26. It has set July 28 as the record date. The interim dividend will be paid on or before August 15, 2025.",
            "pubDate": "2025-07-17T17:22:11.859944"
        },
        {
            "title": "Indian Hotels Q1 Results: Tata Group-owned company reports 26% rise in net profit at Rs 329 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-group-owned-indian-hotels-q1-results-net-profit-rises-26-to-rs-329-crore/articleshow/122641344.cms",
            "description": "Tata Group-owned Indian Hotels Company Limited (IHCL) on Thursday reported a 26.56 per cent rise in its consolidated net profit to Rs 329.32 crore in the first quarter of FY26.",
            "pubDate": "2025-07-17T17:22:11.860042"
        },
        {
            "title": "Jio Financial Q1 Results: Cons PAT rises 3.8% YoY to Rs 325 crore, revenue shoots up 47%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q1-results-cons-pat-rises-3-8-yoy-to-rs-325-crore-revenue-shoots-up-47/articleshow/122640988.cms",
            "description": "Jio Financial Q1 Results: Jio Financial Services on Thursday reported a 3.8% growth in its Q1FY26 consolidated net profit at Rs 325 crore versus Rs 313 crore in the year ago period. The company's revenue from operations surged 47% at Rs 612 crore versus Rs 418 crore in the year ago period.",
            "pubDate": "2025-07-17T17:22:11.860140"
        },
        {
            "title": "LTIMindtree Q1 Results: Cons profit jumps 11% YoY to Rs 1,255 crore; revenue up 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ltimindtree-q1-results-cons-profit-jumps-11-yoy-to-rs-1255-crore-revenue-up-8/articleshow/122639510.cms",
            "description": "LTIMindtree Q1 Results: IT services company LTIMindtree on Thursday reported an 11% growth in its Q1FY26 consolidated net profit to 1,255 crore versus Rs 1,135 crore in the year ago period. The revenue from operations rose 8% at Rs 9,841 crore versus Rs 9,143 crore in the year ago period.",
            "pubDate": "2025-07-17T17:22:11.860237"
        },
        {
            "title": "HDFC AMC Q1 Results: Profit jumps 24% to Rs 748 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-amc-q1-results-profit-jumps-24-to-rs-748-crore/articleshow/122635977.cms",
            "description": "HDFC Asset Management Company (AMC) on Thursday reported a 24 per cent jump in profit after tax at Rs 748 crore in the three months ended June 2025.",
            "pubDate": "2025-07-17T17:22:11.860334"
        },
        {
            "title": "Axis Bank Q1 Results: Standalone PAT falls 4% YoY to Rs 5,806 crore, NII remains flat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q1-results-pat-falls-4-yoy-to-rs-5806-crore/articleshow/122633572.cms",
            "description": "Axis Bank Q1 Results: Private lender Axis Bank has reported a 4% fall in its standalone net profit at Rs 5,806 crore in the first quarter of FY26. The same stood at Rs 6,035 crore in the year-ago period.",
            "pubDate": "2025-07-17T17:22:11.860432"
        },
        {
            "title": "Wipro Q1 Results: Cons PAT rises 11% YoY to Rs 3,330 crore; dividend declared at Rs 5/share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q1-results-cons-pat-rises-11-yoy-at-rs-3330-crore-dividend-declared-at-rs-5/share/articleshow/122633953.cms",
            "description": "Wipro Q1 Results: The IT services company's revenue from operations rose marginally by 0.7% to Rs 22,134 crore, compared to Rs 21,963 crore in the year-ago period.",
            "pubDate": "2025-07-17T17:22:11.860528"
        },
        {
            "title": "Waaree Renewable Technologies Q1 Results: Net profit soars 205% to Rs 86 crore; revenue more than doubles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/waaree-renewable-technologies-q1-results-net-profit-soars-205-to-rs-86-crore-revenue-more-than-doubles/articleshow/122633718.cms",
            "description": "Waaree Renewable Technologies Q1 Results: The renewable energy company reported revenue from operations of ₹603.18 crore for the quarter ended June 2025, marking a 155% year-on-year surge from ₹236.35 crore in the same period last year. Sequentially, revenue rose 25.6% from ₹476.57 crore in the March 2025 quarter.",
            "pubDate": "2025-07-17T17:22:11.860645"
        },
        {
            "title": "Polycab Q1 Results: Cons PAT surges 50% YoY to Rs 592 crore; revenue jumps 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/polycab-q1-results-cons-pat-surges-50-yoy-to-rs-592-crore-revenue-jumps-26/articleshow/122630658.cms",
            "description": "Polycab India reported a robust 50% YoY increase in Q1FY26 net profit, reaching ₹592 crore, driven by strong performance in its Wires & Cables and Fast Moving Electrical Goods businesses. Revenue from operations also rose 26% YoY to ₹5,906 crore.",
            "pubDate": "2025-07-17T17:22:11.860744"
        }
    ]
}