{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-29T04:26:36.817021",
    "items": [
        {
            "title": "IndiGo shares in focus after DGCA extends lease for Turkish Airlines jets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-after-dgca-extends-lease-for-turkish-airlines-jets/articleshow/123575139.cms",
            "description": "IndiGo share price: DGCA has granted IndiGo a six-month extension to operate two leased Boeing 777 jets from Turkish Airlines under a damp lease, valid until February 28, 2026 . The regulator asked the airline to explore dry-lease alternatives and clarified that no further extensions will be granted.",
            "pubDate": "2025-08-29T03:00:48.658064"
        },
        {
            "title": "RBL Bank shares in focus after Societe Generale acquires shares worth Rs 79 crore via bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-after-societe-generale-acquires-shares-worth-rs-79-crore-via-bulk-deal/articleshow/123575053.cms",
            "description": "RBI Bank share price:  French lender Societe Generale executed a bulk deal in RBL Bank, purchasing over 31 lakh shares worth Rs 79 crore at an average price of Rs 250.57, while simultaneously offloading 1.29 lakh shares in another trade.",
            "pubDate": "2025-08-29T03:00:48.658180"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Adani Ports, Apollo Hospitals among 5 stocks that could give 12-29% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-adani-ports-apollo-hospitals-among-5-stocks-that-could-give-12-29-return/slideshow/123574907.cms",
            "description": "Brokerages have shared their latest stock recommendations across IT, ports, healthcare, metals, and auto ancillaries, highlighting potential upsides in the range of 12–29%.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-29T03:00:48.658279"
        },
        {
            "title": "RIL shares in focus ahead of AGM today. Here’s what investors, brokerages are expecting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-ahead-of-agm-today-heres-what-investors-brokerages-are-expecting/articleshow/123574963.cms",
            "description": "Reliance Industries' AGM is highly anticipated as 44 lakh shareholders await updates on IPO timelines for Jio and Retail, potentially unlocking significant value. Investors are keen on RIL's AI strategy, particularly the JioBrain platform, and progress in the new energy business, including solar and battery giga-factories. Brokerages maintain positive ratings, citing strong refining operations and attractive valuations.",
            "pubDate": "2025-08-29T03:00:48.658380"
        },
        {
            "title": "Last day to buy the shares of smallcap stock before stock split ex-date on Monday. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-the-shares-of-smallcap-stock-before-stock-split-ex-date-on-monday-check-details/articleshow/123574819.cms",
            "description": "Pavna Industries investors, note today is the last day to buy shares for the stock split eligibility. The company will subdivide shares from Rs 10 to Rs 1. September 1 is the ex-date. This split aims to enhance liquidity and make the stock affordable. Post-split, share count increases, but the holding value remains same.",
            "pubDate": "2025-08-29T03:00:48.658476"
        },
        {
            "title": "9 stocks to trade ex-dividend on Monday. Last chance to buy for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-stocks-to-trade-ex-dividend-on-monday-last-chance-to-buy-for-eligibility/articleshow/123574796.cms",
            "description": "Investors eyeing dividend payouts should note that today is the ex-dividend date for nine companies, including Alivus Life Sciences with a Rs 5 per share dividend. Other notable companies like Triveni Engineering and Triveni Turbine are also offering dividends. To be eligible for these payouts, investors must hold the stocks before today's trading close.",
            "pubDate": "2025-08-29T03:00:48.658571"
        },
        {
            "title": "ARC Insulation shares set for NSE SME debut. GMP signals strong debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/arc-insulation-shares-set-for-nse-sme-debut-gmp-signals-strong-debut/articleshow/123574768.cms",
            "description": "ARC Insulation and Insulators is set to debut on the NSE SME platform following a successful IPO that was oversubscribed 18.71 times. The company plans to utilize the Rs 41.19 crore raised for expansion, debt repayment, and working capital.",
            "pubDate": "2025-08-29T03:00:48.658661"
        },
        {
            "title": "S&P 500, Dow score record high closes as Nvidia results buttress AI rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-dow-score-record-high-closes-as-nvidia-results-buttress-ai-rally/articleshow/123574418.cms",
            "description": "The S&P 500 and Dow reached record highs, fueled by strong AI demand despite Nvidia's slightly underwhelming forecast due to Sino-U.S. trade concerns. Investors interpreted Nvidia's revenue surge as confirmation of robust AI spending, boosting other AI stocks.",
            "pubDate": "2025-08-29T03:00:48.658757"
        },
        {
            "title": "Asian stocks mixed as investors await key US inflation data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-as-investors-await-key-us-inflation-data/articleshow/123573800.cms",
            "description": "Asian equities showed mixed performance as investors awaited a key US inflation report. US stocks reached a new high after strong economic data eased recession fears but also fueled concerns about persistent inflation. The market anticipates potential Fed rate cuts, influenced by economic indicators and geopolitical factors like the Russia-Ukraine situation, impacting commodity prices.",
            "pubDate": "2025-08-29T03:00:48.658850"
        },
        {
            "title": "Stocks in news: RIL, IndiGo, ICICI Bank, TVS Motor, Infosys",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-indigo-icici-bank-tvs-motor-infosys/articleshow/123567833.cms",
            "description": "The markets declined on monthly expiry day. IndiGo's Gangwal family sold a stake. Reliance Industries will hold its AGM. ICICI Bank's compliance officer retired. TVS Motor faces EV volume issues due to magnet supply. Infosys partnered with Mastercard. Societe Generale acquired shares in RBL Bank. These developments are likely to influence trading.",
            "pubDate": "2025-08-29T03:00:48.658951"
        },
        {
            "title": "GIFT Nifty up 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123567858.cms",
            "description": "Nifty experienced a dip due to market reactions to imposed tariffs. Analysts anticipate that supportive policies will bolster domestic markets amidst global trade challenges. The rupee strengthened against the US dollar, influenced by a weaker dollar and lower crude oil prices. India VIX, a measure of market fear, saw a decrease.",
            "pubDate": "2025-08-29T03:00:48.659063"
        },
        {
            "title": "Cyrus Investments proposes withdrawal of Rs 100 crore dividend proceeds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cyrus-investments-proposes-withdrawal-of-rs-100-crore-dividend-proceeds/articleshow/123573677.cms",
            "description": "Cyrus Investments (CIPL) is seeking approval from its NCD holders to withdraw ₹100 crore from a portfolio holding company (PHC) deposit account. This withdrawal is part of the ₹216.8 crore dividend received in FY26. The remaining ₹116.8 crore, considered an excess dividend, will be transferred to a cash top-up account as per the debenture trust deed.",
            "pubDate": "2025-08-29T03:00:48.659161"
        },
        {
            "title": "Uno Minda shares surge 18% since August 6 following strong Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uno-minda-shares-surge-18-since-august-6-following-strong-q1-results/articleshow/123573541.cms",
            "description": "Uno Minda's shares soared to a record high following strong Q1 results, with gains of 18% since August 6. Limited exposure to US tariffs and strategic manufacturing locations globally have boosted investor confidence. The company is undertaking significant capital expenditure for growth and EV component manufacturing, alongside key management changes.",
            "pubDate": "2025-08-29T03:00:48.659255"
        },
        {
            "title": "India Inc doubles up on borrowing overseas after sovereign upgrade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-doubles-up-on-borrowing-overseas-after-sovereign-upgrade/articleshow/123573479.cms",
            "description": "Following India's sovereign rating upgrade by S&P, domestic firms like Credila and Muthoot Finance are actively pursuing offshore fundraising, aiming for over $2 billion. This move is expected to lower borrowing costs, though tax cuts and US tariffs introduce some risks. Market anticipates potential Fed rate cut may further influence fundraising strategies.",
            "pubDate": "2025-08-29T03:00:48.659348"
        },
        {
            "title": "Gangwal family trust sells 1.3% in IndiGo parent for Rs 2,933 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gangwal-family-trust-sells-1-3-in-indigo-parent-for-rs-2933-crore/articleshow/123573444.cms",
            "description": "Rakesh Gangwal's family trust divested a 1.3% stake in InterGlobe Aviation, IndiGo's parent company, for ₹2,933.4 crore through bulk deals. This sale is part of a phased exit strategy initiated after Gangwal stepped down from the board in February 2022. Shares of IndiGo closed lower following the transaction, though the stock has outperformed its benchmark index year-to-date.",
            "pubDate": "2025-08-29T03:00:48.659440"
        },
        {
            "title": "Boost for balance sheet: Japanese banking giant Sumitomo Mitsui lines up Rs 16,000 cr more for fitter Yes Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boost-for-balance-sheet-japanese-banking-giant-sumitomo-mitsui-lines-up-rs-16000-cr-more-for-fitter-yes-bank/articleshow/123574000.cms",
            "description": "Sumitomo Mitsui Banking Corp or SMBC will invest sixteen thousand crore rupees in Yes Bank. The investment will be through equity and debt. This will strengthen Yes Bank's balance sheet. SMBC will also acquire a twenty percent stake in the bank from existing shareholders. The deal awaits regulatory approvals. This move is expected to improve Yes Bank's financial standing.",
            "pubDate": "2025-08-29T03:00:48.659533"
        },
        {
            "title": "Hold equities, not cash; autos & largecap IT offer opportunities, says V Srivatsa",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hold-equities-not-cash-autos-largecap-it-offer-opportunities-says-v-srivatsa/articleshow/123576264.cms",
            "description": "In an ET Now interview, Srivatsa said that despite global challenges—especially risks from US growth, interest rates, and new tariffs—the Indian economy is displaying resilience. He added that domestic consumption appears to have bottomed out, supported by GST rationalisation and the recent corporate tax cuts, which should start yielding positive results in the coming quarters.",
            "pubDate": "2025-08-29T04:26:27.072581"
        },
        {
            "title": "Is your portfolio under attack from Trump’s tariffs? 5 critical moves to make right now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-your-portfolio-under-attack-from-trumps-tariffs-5-critical-moves-to-make-right-now/articleshow/123576187.cms",
            "description": "The US tariff hike to 50% on Indian goods is set to test export-heavy sectors like textiles, gems, and auto components, while pharma, IT, and domestic-focused industries remain resilient. Experts advise diversification, focus on strong balance sheets, and patience over panic. Analysts highlight banks, consumer plays, autos, and infrastructure as key stocks to watch near term.",
            "pubDate": "2025-08-29T04:26:27.072701"
        },
        {
            "title": "Buy, Sell or Hold: Kotak Institutional Equities upgrades Clean Science; Investec maintains sell call on Indigo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-kotak-institutional-equities-upgrades-clean-science-investec-maintains-sell-call-on-indigo/articleshow/123576087.cms",
            "description": "Brokerages gave mixed calls: Kotak upgraded Clean Science to Buy after correction, Investec kept a Sell on Indigo citing high valuations, while Nuvama maintained a Buy on Aditya Vision with a higher target on demand recovery and expansion plans.",
            "pubDate": "2025-08-29T04:26:27.072908"
        },
        {
            "title": "ITC, HDFC Bank lift Sensex 100 pts higher, Nifty above 24,500",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-150-pts-nifty-above-24500-as-ril-hdfc-bank-lead-gainers/articleshow/123575972.cms",
            "description": "The Indian benchmark indices Sensex and Nifty opened higher on Friday, led by advances in heavyweights Reliance Industries and HDFC Bank, though concerns over U.S. tariffs are expected to keep a cap on further gains.",
            "pubDate": "2025-08-29T04:26:27.073009"
        },
        {
            "title": "NSE proposes to roll out pre-open session for index, stock futures from December 8, following BSE’s move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-proposes-to-roll-out-pre-open-session-for-index-stock-futures-from-december-8-following-bses-move/articleshow/123575926.cms",
            "description": "The NSE’s update comes after a previous circular from the exchange, designed to improve trading ease and bolster risk oversight in equity derivatives.",
            "pubDate": "2025-08-29T04:26:27.073104"
        },
        {
            "title": "NTPC shares in focus on Rs 7,735 cr coal mining transfer plan to subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-shares-in-focus-on-rs-7735-cr-coal-mining-transfer-plan-to-subsidiary/articleshow/123575850.cms",
            "description": "Top-performing asset management companies (AMCs) may soon face a valuation check as rising competition, regulatory scrutiny, and elevated stock prices draw investor caution. While fund houses have delivered strong growth and outperformance, analysts warn that premium valuations leave little room for error. Any slowdown in inflows or margin pressure could trigger a reassessment of their lofty pricing.",
            "pubDate": "2025-08-29T04:26:27.073200"
        },
        {
            "title": "Fed governor calls for rate cut at September policy meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-governor-calls-for-rate-cut-at-september-policy-meeting/articleshow/123575806.cms",
            "description": "Federal Reserve Governor Christopher Waller urged the central bank to lower its key interest rate at the upcoming meeting, echoing President Trump's calls for monetary easing. Waller, a potential successor to Chairman Powell, advocated for a 25-basis-point cut to prevent labor market deterioration and achieve the two percent inflation target.",
            "pubDate": "2025-08-29T04:26:27.073293"
        },
        {
            "title": "Infosys shares in focus after partnering with Mastercard to boost cross-border payments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-after-partnering-with-mastercard-to-boost-cross-border-payments/articleshow/123575766.cms",
            "description": "Infosys has partnered with Mastercard to streamline cross-border payments, enabling faster, more secure onboarding for banks and boosting efficiency in payment integration.",
            "pubDate": "2025-08-29T04:26:27.073391"
        },
        {
            "title": "RIL AGM today: Will Reliance Industries shares break 4-year streak of letdowns?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-agm-today-will-reliance-industries-shares-break-4-year-streak-of-letdowns/articleshow/123575638.cms",
            "description": "Reliance Industries AGM 2025:  Reliance Industries’ AGMs have disappointed investors for four straight years, with shares slipping each time. Despite past hype around value-unlocking announcements, the 2024 meeting too failed to impress. Ahead of today’s AGM, expectations are muted, with brokerages suggesting this could finally leave room for a positive surprise if Mukesh Ambani delivers on growth cues across Jio, Retail, and New Energy.",
            "pubDate": "2025-08-29T04:26:27.073485"
        }
    ]
}