{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-27T11:52:51.009094",
    "items": [
        {
            "title": "Market Wrap: Banks, auto stocks lift Sensex 230 points, Nifty above 24,200",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-banks-auto-stocks-lift-sensex-230-points-nifty-above-24200/articleshow/115731344.cms",
            "description": "Markets closed higher, but Nifty saw mixed action with 25 stocks in the green and 25 in the red. Top gainers included Adani Enterprises, Adani Ports, Bharat Electronics, Trent, and NTPC, while Apollo Hospitals, Titan, Wipro, Shriram Finance, and Hindalco led the losers.",
            "pubDate": "2024-11-27T11:52:33.491180"
        },
        {
            "title": "InCred cuts Nifty50 blended index target to 25,327, upgrades pharma to overweight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/incred-cuts-nifty50-blended-index-target-to-25327-upgrades-pharma-to-overweight/articleshow/115728034.cms",
            "description": "InCred Equities cut Nifty50 target to 25,327, expecting a correction phase. The brokerage upgraded its stance on pharma stocks like Cipla, Ipca, and Alkem Laboratories. The IT, capital goods, and pharma sectors outperformed during the recent correction. The overall market sentiment remains cautious due to weak macroeconomic conditions and potential EPS downgrades.",
            "pubDate": "2024-11-27T11:52:33.491305"
        },
        {
            "title": "European shares slip amid Trump tariff woes, French lenders drop",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-slip-amid-trump-tariff-woes-french-lenders-drop/articleshow/115727573.cms",
            "description": "Europe's STOXX 600 dipped at the open on Wednesday, with automobile shares yet again feeling the heat from Trump's proposed trade tariffs, while a sharp fall in French lenders dragged down the country's benchmark index.",
            "pubDate": "2024-11-27T11:52:33.491406"
        },
        {
            "title": "Is the sustainable turnaround getting closer? 8 fertiliser stocks, 2 with buy recos, suited for risk-takers with long term perspective",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-sustainable-turnaround-getting-closer-8-fertiliser-stocks-2-with-buy-recos-suited-for-risk-takers-with-long-term-perspective/articleshow/115727155.cms",
            "description": "Amongst the key sectors like power and railways, government policies have successfully effected change in the real business conditions and, hence, valuations on the street have inched higher and even after all the recent correction they are higher than what they were before change got implemented. Similar efforts are being made for some time now in the fertilizer sector, but it is still work in progress. The fertilizer sector is, of course, a key sector. Not only as it impacts the lives of a large number of farmers, but also for two more reasons. One, because India imports a lot of fertilizers. And two, it is critical for food production and hence food inflation. So, a very important sector from all perspectives.",
            "pubDate": "2024-11-27T11:52:33.491503"
        },
        {
            "title": "NTPC Green Energy's m-cap crosses Rs 1 lakh crore mark on debut, stock jumps 9% post listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-green-energys-m-cap-crosses-rs-1-lakh-crore-mark-on-debut-stock-jumps-10-post-listing/articleshow/115726894.cms",
            "description": "The issue, open for subscription from November 19 to 22, was overall subscribed 2.42 times. The retail portion saw 3.44 times subscription, while the non-institutional investors (NIIs) segment fell short at 81%. The qualified institutional buyers (QIBs) category was subscribed 3.32 times.",
            "pubDate": "2024-11-27T11:52:33.491648"
        },
        {
            "title": "HDFC Bank shares trade near key resistance. What next after a breakout?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-trade-near-key-resistance-what-next-after-a-breakout/articleshow/115726531.cms",
            "description": "After hitting a new all-time high of Rs 1,810 on Tuesday, HDFC Bank shares have slipped and are now hovering around the Rs 1,800 mark. This level has historically been a key resistance zone, with the stock reversing from this region on several occasions.",
            "pubDate": "2024-11-27T11:52:33.491756"
        },
        {
            "title": "Citi initiates coverage on Ola Electric with Rs 90 target price. Here's what it said",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citi-initiates-coverage-on-ola-electric-with-rs-90-target-price-heres-what-it-said/articleshow/115726369.cms",
            "description": "Citi expressed a positive outlook on Ola, citing its diverse product portfolio, strong R&D efforts, extensive vertical integration (including Li-ion cell manufacturing), large-scale production capabilities, and upcoming motorcycles and E3Ws as potential volume drivers.",
            "pubDate": "2024-11-27T11:52:33.491851"
        },
        {
            "title": "Marriage made in heaven! How Rekha met Rakesh Jhunjhunwala",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/marriage-made-in-heaven-how-rekha-met-rakesh-jhunjhunwala/articleshow/115725805.cms",
            "description": "Rakesh Jhunjhunwala’s remarkable rise from Rs 5,000 to a fortune of Rs 40,000 crore is epitomized by Rare Enterprises, founded with his life partner, Rekha. Their partnership was sealed by fate after a serendipitous meeting.",
            "pubDate": "2024-11-27T11:52:33.491950"
        },
        {
            "title": "Japan's Nikkei ends lower on Trump's tariff pledge, stronger yen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-on-trumps-tariff-pledge-stronger-yen/articleshow/115724719.cms",
            "description": "Japan's Nikkei share average ended lower on Wednesday, with automakers leading the losses, amid concerns about the impact of U.S. President-elect Donald Trump's tariff pledges and a stronger yen.",
            "pubDate": "2024-11-27T11:52:33.492044"
        },
        {
            "title": "Gautam Adani faces no bribery charges: Adani Group",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gautam-adani-faces-no-bribery-charges-adani-group/articleshow/115724389.cms",
            "description": "Executives at Adani Green Energy, including Gautam Adani, face US charges. These relate to securities and wire fraud. Bribery charges under the FCPA were not filed. The company denies wrongdoing and plans a legal defense. The case involves allegations of a USD 265 million bribery scheme. This scheme aimed to secure solar power contracts in India.",
            "pubDate": "2024-11-27T11:52:33.492140"
        },
        {
            "title": "Kotak Equities downgrades NALCO to ‘reduce’, says risk-reward no longer attractive",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-equities-downgrades-nalco-to-reduce-says-risk-reward-no-longer-attractive/articleshow/115724092.cms",
            "description": "The domestic brokerage anticipates that alumina prices and spot earnings have peaked and expects a decline in alumina prices by CY2025E, potentially serving as a negative catalyst for NACL.",
            "pubDate": "2024-11-27T11:52:33.492238"
        },
        {
            "title": "Dolly Khanna-backed smallcap stock zooms 15% after JV wins multi-year orders worth Rs 475 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dolly-khanna-backed-smallcap-stock-zooms-15-after-jv-wins-multi-year-orders-worth-rs-475-crore/articleshow/115723087.cms",
            "description": "Talbros Automotive has secured orders totalling Rs 345 crore, including Rs 131 crore in exports, primarily to Europe. The heat shield segment accounts for Rs 245 crore, with orders from multiple OEMs, while the gasket division contributes the remaining Rs 100 crore.",
            "pubDate": "2024-11-27T11:52:33.492332"
        },
        {
            "title": "Hope floats! Decoding the impact of US elections on Dalal Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hope-floats-decoding-the-impact-of-us-elections-on-dalal-street/articleshow/115721797.cms",
            "description": "Indian markets are optimistic following the US election, anticipating pro-growth policies under President Trump.  Technological advancements, particularly in AI, are expected to benefit India.  A market correction driven by foreign investors presents opportunities for discerning domestic investors, especially in mid and small-cap stocks experiencing strong growth.",
            "pubDate": "2024-11-27T11:52:33.492423"
        },
        {
            "title": "Swiggy shares rally another 8% as brokerages back growth potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-rally-another-8-as-brokerages-back-growth-potential/articleshow/115721571.cms",
            "description": "Swiggy share price: Swiggy's stock rose 8.1% to Rs 499 after UBS initiated coverage with a \"Buy\" rating and Rs 515 target. Analysts highlight growth potential amid operational challenges and competition.",
            "pubDate": "2024-11-27T11:52:33.492519"
        },
        {
            "title": "Q2 review: 14 stocks in BSE PSU index rebound from 52-week lows, 5 turn multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-review-14-stocks-in-bse-psu-index-rebound-from-52-week-lows-5-turn-multibaggers/articleshow/115720368.cms",
            "description": "14 BSE PSU index stocks rebounded from 52-week lows after Q2FY25 earnings, with five emerging as multibaggers.  NALCO led profit growth, while Coal India's revenue surged.  The BJP's election results impacted performance, but some stocks like BEL and SBI remained positive. Analysts are bullish on select PSUs, particularly banks, citing undervaluation and growth potential.",
            "pubDate": "2024-11-27T11:52:33.492612"
        },
        {
            "title": "NTPC shares jump 2% after NTPC Green Energy’s listing today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-shares-jump-2-after-ntpc-green-energys-listing-today/articleshow/115720212.cms",
            "description": "NTPC shares rose 2.3%, while NTPC Green Energy debuted with a 3.25% premium. Experts recommend holding for long-term growth amid the company’s expansion into renewable energy and storage.",
            "pubDate": "2024-11-27T11:52:33.492709"
        }
    ]
}