{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-14T11:00:33.770558",
    "items": [
        {
            "title": "Q3 results today: Infosys, Groww among 25 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-infosys-groww-among-25-companies-to-announce-earnings-on-wednesday/articleshow/126515860.cms",
            "description": "Third quarter earnings season is here. Many companies, including Infosys and HDFC AMC, will reveal their results. Analysts anticipate mixed performances for these firms. Investors will closely watch company outlooks and management commentary. Key factors like deal pipelines and client spending will be under scrutiny. This period promises significant financial updates for the market.",
            "pubDate": "2026-01-14T03:54:02.710560"
        },
        {
            "title": "GST gains, higher investment income liven up ICICI Pru Life",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gst-gains-higher-investment-income-liven-up-icici-pru-life/articleshow/126515494.cms",
            "description": "ICICI Prudential Life Insurance saw a significant 20% jump in its third-quarter net profit, reaching ₹390 crore. This growth was fueled by robust investment income and better margins after recent GST reforms on life insurance products. The company's nine-month profit also climbed 24%. The value of new business margin improved, and assets under management grew.",
            "pubDate": "2026-01-14T03:54:02.710674"
        },
        {
            "title": "ICICI Lombard General Insurance Q3 PAT slips 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-lombard-general-insurance-q3-pat-slips-9/articleshow/126515478.cms",
            "description": "ICICI Lombard General Insurance saw its net profit drop by 9% in the December quarter. This decline was influenced by an increase in claims and a weaker underwriting performance. Despite this, the company's gross direct premium income grew by 13.3%. The combined ratio, a key profitability indicator, worsened.",
            "pubDate": "2026-01-14T03:54:02.710790"
        },
        {
            "title": "Groww Q3 Results: Cons net profit drops 28% YoY to Rs 547 crore, but revenue up 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/groww-parent-billionbrains-garage-ventures-q3-results-cons-net-profit-drops-28-yoy-to-rs-547-crore-but-revenue-jumps-25/articleshow/126520572.cms",
            "description": "Billionbrains Garage Ventures, parent of stockbroker Groww, reported a 27.8% YoY drop in Q3 FY26 consolidated net profit to Rs 546.93 crore. Revenue from operations rose 24.8% YoY to Rs 974.53 crore. The profit figure reflects earnings attributable to shareholders.",
            "pubDate": "2026-01-14T07:30:16.002354"
        },
        {
            "title": "HDFC AMC Q3 Results: Standalone profit jumps 20% YoY to Rs 770 crore; revenue up 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-amc-q3-results-standalone-profit-jumps-20-yoy-to-rs-770-crore-revenue-up-15/articleshow/126522729.cms",
            "description": "HDFC AMC Q3 Results: HDFC AMC announced a robust financial performance, with its third-quarter net profit surging 20% year-on-year to Rs 770 crore. Revenue from operations also saw a healthy 15% increase, reaching Rs 1,074 crore. For the nine months ending December, profit after tax climbed to Rs 2,236 crore, showcasing strong growth momentum.",
            "pubDate": "2026-01-14T09:45:05.297256"
        },
        {
            "title": "Infosys Q3 Results: PAT slips 2% YoY to Rs 6,654 crore; co raises FY26 revenue guidance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q3-results-pat-falls-2-yoy-to-rs-6654-crore-co-raises-fy26-revenue-guidance/articleshow/126524639.cms",
            "description": "Infosys Q3 Results: India's second largest IT services company on Wednesday reported a 2% year-on-year (YoY) decline in its consolidated net profit at Rs 6,654 crore in the third quarter, compared with Rs 6,806 crore in the last year quarter.",
            "pubDate": "2026-01-14T11:00:33.176485"
        }
    ]
}