{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-06T11:40:31.559182",
    "items": [
        {
            "title": "Wall Street Week Ahead: US Fed's internal split puts spotlight on Jerome Powell's rate guidance, dissents",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-feds-internal-split-puts-spotlight-on-jerome-powells-rate-guidance-dissents/articleshow/125799319.cms",
            "description": "The Federal Reserve's upcoming meeting is set to be highly debated. Policymakers are divided on an expected interest rate cut. Investors are watching closely for signals on the Fed's future policy direction and internal dynamics. Economic data has eased fears of labor market deterioration, fueling rate cut expectations. The market anticipates a quarter-point cut.",
            "pubDate": "2025-12-06T03:58:32.638835"
        },
        {
            "title": "Mint St doves let it fly even as India can’t catch a flight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mint-st-doves-let-it-fly-even-as-india-cant-catch-a-flight/articleshow/125799378.cms",
            "description": "Friday saw a remarkable uptick in Indian stock markets as the Reserve Bank of India decided to lower interest rates by 25 basis points. This strategic decision, along with signals of continued easing, infused confidence into investors. The Nifty and Sensex indices experienced a solid recovery, pushing past previous weekly dips.",
            "pubDate": "2025-12-06T04:24:00.399487"
        },
        {
            "title": "European stock clock weekly gains on ongoing Fed cut optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stock-clock-weekly-gains-on-ongoing-fed-cut-optimism/articleshow/125799727.cms",
            "description": "European shares closed the week with modest gains as investors digested a U.S. inflation report reinforcing expectations for a Federal Reserve rate cut next week. Autos, retail, and technology stocks led the gains, while Swiss Re and oil and gas lagged. Citigroup set a positive 2026 target for the STOXX 600.",
            "pubDate": "2025-12-06T04:40:34.280152"
        },
        {
            "title": "Stocks end higher, dollar set for second straight weekly loss as investors eye Fed cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-end-higher-dollar-set-for-second-straight-weekly-loss-as-investors-eye-fed-cut/articleshow/125799696.cms",
            "description": "Global shares advanced Friday as U.S. economic data reinforced expectations of a Federal Reserve rate cut next week, weakening the dollar and boosting gold. Wall Street indices closed higher, marking a second consecutive week of gains, with technology and communication services sectors leading. European markets remained largely unchanged, securing a modest weekly increase.",
            "pubDate": "2025-12-06T04:40:34.280261"
        },
        {
            "title": "US stocks close with slight gains as data keeps Fed cut expectations on track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-close-with-slight-gains-as-data-keeps-fed-cut-expectations-on-track/articleshow/125799676.cms",
            "description": "Indian markets saw a positive close on Friday. Investors are keenly watching for a Federal Reserve interest rate cut next week. Economic data released showed consumer spending rose and consumer sentiment improved. This has boosted hopes for a rate reduction. All eyes are now on the Fed meeting for policy hints.",
            "pubDate": "2025-12-06T04:40:34.280454"
        },
        {
            "title": "Indian rupee hits record low: What it means for commodity prices and the economy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-rupee-hits-record-low-what-it-means-for-commodity-prices-and-the-economy/articleshow/125800046.cms",
            "description": "The rupee’s plunge beyond ₹90 highlights India-specific pressures from FPI outflows, trade deficits and dollar demand. The slide threatens higher imported inflation, costlier commodities and wider external imbalances, even as domestic growth remains resilient amid global uncertainty.",
            "pubDate": "2025-12-06T05:37:45.495441"
        },
        {
            "title": "Gold is the new FDI: A blueprint to convert India's idle wealth into productive capital",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-is-the-new-fdi-a-blueprint-to-convert-indias-idle-wealth-into-productive-capital/articleshow/125801760.cms",
            "description": "India’s massive household gold holdings, worth $3.8 trillion, far exceed decades of FDI inflows. Redirecting even part of this unproductive wealth through proposed procurement and gold-bond schemes could ease trade deficits, boost capital formation, and lessen dependence on foreign investment.",
            "pubDate": "2025-12-06T07:28:13.153690"
        },
        {
            "title": "Abu Dhabi Investment Portfolio: 7 stocks surge up to 70% in FY26. 2 new Q2 bets revealed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/abu-dhabi-investment-portfolio-7-stocks-surge-up-to-70-in-fy26-2-new-q2-bets-revealed/slideshow/125801520.cms",
            "description": "The Abu Dhabi Investment Authority’s (ADIA) equity portfolio, managed through its global funds, has remained largely flat so far in FY26. The portfolio’s value inched up by 0.70%, rising from Rs 3,774 crore in March to Rs 3,801 crore as of December 5, 2025. The holdings span 25 publicly listed Indian companies.Despite the subdued overall growth, about 13 stocks have generated positive returns, with seven of them delivering impressive gains of 20% to 70% in FY26 to date. Conversely, five stocks have declined by 15% to 30% over the same period. We also highlighted two newly added stocks, CMS Info Systems and M B Engineering. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-12-06T07:28:13.153799"
        },
        {
            "title": "Gurmeet Chadha hails Russian Sberbank’s MF route into Indian equities, calls it a model for global expansion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gurmeet-chadha-hails-russian-sberbanks-mf-route-into-indian-equities-calls-it-a-model-for-global-expansion/articleshow/125801354.cms",
            "description": "Sberbank’s launch of a Nifty 50-linked mutual fund gives Russian investors direct access to Indian equities. Experts say the move can expand global capital inflows, enable similar partnerships with BRICS and other regions, and deepen India-Russia financial cooperation.",
            "pubDate": "2025-12-06T07:28:13.153893"
        },
        {
            "title": "Century Plyboards well-positioned for growth as MDF expansion and premium mix strengthen margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/century-plyboards-well-positioned-for-growth-as-mdf-expansion-and-premium-mix-strengthen-margins/articleshow/125800608.cms",
            "description": "India’s building products sector is stabilizing with stronger consumption, healthier pipelines, lower input volatility, and rising premiumization. Demand across wood panels, sanitaryware, tiles, and paints is improving as real estate, renovation cycles, and distribution networks strengthen, supporting a more sustained medium-term upcycle.",
            "pubDate": "2025-12-06T07:28:13.153986"
        },
        {
            "title": "SME SAR Televenture raises Rs 208 cr from Madhusudan Kela, promoter and others via issue of warrants",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sme-sar-televenture-raises-rs-208-cr-from-madhusudan-kela-promoter-and-others-via-issue-of-warrants/articleshow/125802714.cms",
            "description": "SAR Televenture has secured ₹208.46 crore through warrant issuance to investors including Madhusudan Kela’s fund, Choice Advisors, and promoters, boosting working capital, CAPEX needs, telecom infrastructure expansion, and readiness for large-scale 4G/5G projects.",
            "pubDate": "2025-12-06T09:31:44.872881"
        },
        {
            "title": "Concurrent Losers: 12 stocks decline for 5 consecutive sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-losers-12-stocks-decline-for-5-consecutive-sessions/slideshow/125802254.cms",
            "description": "Over the last five trading sessions ending December 5, the Sensex benchmark closed virtually unchanged, edging up just 6 points to 85,712. The index recorded losses in three of these five sessions. During this period, around 35 stocks within the BSE500 index posted consistent declines across all five sessions. From this group, we identified 12 stocks that dropped more than 7% over the same timeframe. (Data Source: ACE Equity)",
            "pubDate": "2025-12-06T09:31:44.873023"
        },
        {
            "title": "Market poised for next uptrend as growth revives: Ashi Anand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-poised-for-next-uptrend-as-growth-revives-ashi-anand/articleshow/125803688.cms",
            "description": "Ashi Anand says India’s 18-month market consolidation is easing as growth improves, earnings strengthen and sentiment turns optimistic. He favours domestic themes, banks and digital plays while remaining cautious on global cyclicals, pharma and IT amid valuation and macro uncertainties.",
            "pubDate": "2025-12-06T10:46:04.184125"
        },
        {
            "title": "Nifty ends flat as resistance holds; cautious optimism likely for coming week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-ends-flat-as-resistance-holds-cautious-optimism-likely-for-coming-week/articleshow/125804517.cms",
            "description": "Nifty traded range-bound, closing nearly flat despite an RBI rate cut, as resistance near 26,300 capped gains. Weak market breadth and muted broader indices signal caution, though the primary trend remains upward with selective sector strength.",
            "pubDate": "2025-12-06T11:40:29.806531"
        },
        {
            "title": "BSE PSU index rejig: RailTel gets entry, 4 stocks deboarded. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-psu-index-rejig-railtel-gets-entry-4-stocks-deboarded-do-you-own-any/slideshow/125804098.cms",
            "description": "In a major overhaul of BSE indices, BSE Index Services announced a rejig of 28 indices on Friday, which includes the BSE PSU index. Five changes were made to the index, including the inclusion of railway stock RailTel Corporation of India and the exclusion of four scrips viz. MMTC, ITI, Punjab & Sind Bank (PSB) and KIOCL. The changes are made semi-annually. The changes become effective December 22.",
            "pubDate": "2025-12-06T11:40:29.806657"
        },
        {
            "title": "Dec 22 index rejig: ITC Hotels, Reliance Power among 32 fresh additions to BSE 500. Check changes in SME, others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dec-22-index-rejig-itc-hotels-reliance-power-among-32-fresh-additions-to-bse-500-check-changes-in-sme-others/articleshow/125804035.cms",
            "description": "The BSE 500 index will undergo a significant overhaul from December 22, with 32 additions and 32 exits as part of the semi-annual reconstitution. Changes span 28 indices, affecting large, mid and small companies across sectors.",
            "pubDate": "2025-12-06T11:40:29.806770"
        }
    ]
}