{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-04T14:00:08.088565",
    "items": [
        {
            "title": "Big tech’s AI push and M&A revival set to drive surge in investment-grade debt issuance in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-techs-ai-push-and-ma-revival-set-to-drive-surge-in-investment-grade-debt-issuance-in-2026/articleshow/125758971.cms",
            "description": "Investment-grade debt issuance is set to surge in 2026 as Big Tech accelerates AI infrastructure spending and M&A activity rebounds. Top U.S. tech firms may require up to $100 billion in funding, while a swelling pipeline of corporate deals and renewed private-equity confidence is expected to further boost bond market activity.",
            "pubDate": "2025-12-04T05:47:11.428108"
        },
        {
            "title": "Trump’s Fed choice intensifies pressure on Treasury Secretary Bessent",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-fed-choice-intensifies-pressure-on-treasury-secretary-bessent/articleshow/125758364.cms",
            "description": "President Donald Trump is intensely focused on lowering interest rates. He has tasked Treasury Secretary Scott Bessent with finding a new Federal Reserve chair. Trump wants swift rate cuts to boost the economy. The selection process is crucial, with potential candidates signaling willingness to align with Trump's agenda. The chosen nominee faces pressure to deliver.",
            "pubDate": "2025-12-04T05:47:11.428234"
        },
        {
            "title": "15 IPOs to track in 8 days. GMPs hint at up to 41% listing gains for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/15-ipos-to-track-in-8-days-gmps-hint-at-up-to-41-listing-gains-for-investors/slideshow/125758114.cms",
            "description": "As many as 15 IPOs are on investors' radar, some of which have already opened for subscription. Grey market premiums signal strong interest for some marquee issues and muted for some other lesser known names. The highest GMP in the pack suggests potential gains of up to 41%, keeping both retail and HNI investors hooked as December momentum builds.",
            "pubDate": "2025-12-04T05:47:11.428348"
        },
        {
            "title": "Vidya Wires IPO Day 2: GMP trends, strong subscription. Should you apply?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vidya-wires-ipo-day-2-gmp-trends-strong-subscription-should-you-apply/articleshow/125758308.cms",
            "description": "Vidya Wires IPO: In the grey market, the IPO is quoting a ₹5 premium — about 9.6% above the upper price band — suggesting a possible listing near ₹57 per share. Investor sentiment remains upbeat, though the premium has eased from 11.54% earlier.",
            "pubDate": "2025-12-04T05:47:11.428474"
        },
        {
            "title": "Flight disruptions drag IndiGo 3% lower, stock slips for 5th straight session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/flight-disruptions-ground-indigo-shares-as-niftys-worst-intraday-performer-slides-3-slips-for-5th-session/articleshow/125758160.cms",
            "description": "IndiGo operator InterGlobe Aviation’s shares fell sharply after widespread flight disruptions crippled operations for two days, prompting a public apology from the airline. A mix of tech glitches, winter schedule changes, adverse weather, congestion, and new crew rostering rules hit punctuality, leading IndiGo to recalibrate schedules to stabilise operations over the next 48 hours.",
            "pubDate": "2025-12-04T05:47:11.428586"
        },
        {
            "title": "Pine Labs shares in focus as fintech posts first quarterly profit since listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pine-labs-shares-in-focus-as-fintech-posts-first-quarterly-profit-since-listing/articleshow/125757601.cms",
            "description": "Pine Labs shares: Pine Labs returned to profit in Q2FY26 with ₹6 crore in net earnings — its strongest performance yet and a turnaround from last year’s loss — alongside a 25% sequential growth in profit after tax.",
            "pubDate": "2025-12-04T05:47:11.428690"
        },
        {
            "title": "Vodafone Idea among five stocks flashing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-among-five-stocks-flashing-bullish-signals/slideshow/125757568.cms",
            "description": "On December 3, in the NSE list of stocks with a market cap of over Rs 1,000 crore, five stocks appeared on the bullish White Marubozu scanner, according to technical scan data from stockedge.com. A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest for the period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it signals strong buying pressure throughout the session. Traders view it as an indication that buyers remained firmly in control from open to close, often using this pattern to make informed decisions about potential future price movements.",
            "pubDate": "2025-12-04T05:47:11.428790"
        },
        {
            "title": "Sensex slips 100 pts, Nifty below 26,000 amid heavy FPI selling, weak rupee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-100-pts-nifty-below-26000-amid-heavy-fpi-selling-weak-rupee/articleshow/125757528.cms",
            "description": "Indian stocks opened lower on Thursday, extending a losing streak to a fifth session as foreign investors resumed heavy selling and the rupee hit a fresh record low. Investors are exercising caution ahead of the Reserve Bank of India's policy decision and guidance due Friday. The Sensex and Nifty both slipped in early trading.",
            "pubDate": "2025-12-04T05:47:11.428893"
        },
        {
            "title": "ICICI Bank, Swiggy and six others show bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-swiggy-and-six-others-show-bullish-rsi-upswing/slideshow/125757529.cms",
            "description": "On December 3, in the Nifty200 pack, six stocks appeared in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal is generated when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) is rising, suggesting strengthening momentum in the stock’s price. This may point to potential upward movement and is often used by traders to identify buying opportunities.",
            "pubDate": "2025-12-04T05:47:11.428991"
        },
        {
            "title": "Foreigners net buyers of Japanese stocks as bets of Fed rate cut ease tech valuation worries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreigners-net-buyers-of-japanese-stocks-as-bets-of-fed-rate-cut-ease-tech-valuation-worries/articleshow/125757374.cms",
            "description": "Foreign investors showed strong interest in Japanese stocks and bonds. They purchased technology and banking shares, anticipating Federal Reserve rate cuts and potential Bank of Japan rate hikes. This influx boosted Japanese equities, which are expected to see robust profit growth next year. Japanese investors, meanwhile, bought foreign stocks but sold foreign bonds.",
            "pubDate": "2025-12-04T05:47:11.429086"
        },
        {
            "title": "Biocon shares in focus ahead of board meeting, fundraising plans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-shares-in-focus-ahead-of-board-meeting-fundraising-plans/articleshow/125757360.cms",
            "description": "Biocon shares: Biocon’s Board will meet on Saturday, December 6, 2025, to decide on key proposals that could shape its growth and shareholder value. A major agenda item is a potential investment in its unlisted arm, Biocon Biologics either through cash or preferential allotment to boost its stake and support long-term expansion.",
            "pubDate": "2025-12-04T05:47:11.429182"
        },
        {
            "title": "IndiGo shares fall over 3% as DGCA launches probe into major service disruptions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/interglobe-aviation-shares-in-focus-as-dgca-launches-probe-into-major-service-disruptions/articleshow/125756878.cms",
            "description": "IndiGo faces a DGCA probe over widespread flight disruptions, with over 200 cancellations and hundreds of delays impacting passengers. The airline cites new pilot duty rules, tech glitches, and weather as causes. IndiGo is implementing schedule adjustments and offering passenger support. Shares saw a decline amid these operational challenges.",
            "pubDate": "2025-12-04T05:47:11.429277"
        },
        {
            "title": "NHPC shares in focus as unit 2 of 2,000-MW Subansiri project goes live",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nhpc-shares-in-focus-as-unit-2-of-2000-mw-subansiri-project-goes-live/articleshow/125756851.cms",
            "description": "NHPC shares are poised for investor attention after Unit 2 of its 2,000-MW Subansiri project successfully synchronized with the grid on December 2, 2025. This marks the first unit to supply power for testing, with Commercial Operation expected this month. The project promises significant clean energy generation, bolstering India's green goals.",
            "pubDate": "2025-12-04T05:47:11.429376"
        },
        {
            "title": "Positive Breakout: These 13 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-13-stocks-cross-above-their-200-dmas/slideshow/125756204.cms",
            "description": "In the NSE list of stocks with a market cap of Rs 1000 crore, 13 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 3, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-04T05:47:11.429489"
        },
        {
            "title": "Oil prices firm after Ukrainian strikes on Russian oil infrastructure, stalled peace talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-prices-firm-after-ukrainian-strikes-on-russian-oil-infrastructure-stalled-peace-talks/articleshow/125756037.cms",
            "description": "Oil prices edged higher as Ukrainian attacks on Russia's Druzhba pipeline and stalled peace talks hinted at potential supply disruptions. Despite these factors, weak global demand and oversupply concerns limited gains, with Fitch Ratings lowering its future oil price assumptions due to these market conditions.",
            "pubDate": "2025-12-04T05:47:11.429581"
        },
        {
            "title": "US stocks close higher as data keeps Fed rate cut expectations elevated",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-close-higher-as-data-keeps-fed-rate-cut-expectations-elevated/articleshow/125756012.cms",
            "description": "Indian markets surged as economic data fueled hopes for a Federal Reserve interest rate cut next week. Despite a dip in Microsoft shares, positive sentiment prevailed, with investors closely watching upcoming inflation and employment reports.  This optimism boosted small-cap stocks, signaling a potential shift towards a more dovish monetary policy.",
            "pubDate": "2025-12-04T05:47:11.429671"
        },
        {
            "title": "Meesho GMP hints at 45% listing pop, issue sees over 3 times subscription on Day 2. Should you bid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-gmp-hints-at-45-listing-pop-issue-sees-over-3-times-subscription-on-day-2-should-you-bid/articleshow/125760090.cms",
            "description": "Meesho’s ₹5,421 crore IPO has seen strong demand, subscribed over 3 times by Day 2, led by robust retail participation. Grey market trends point to a potential 40% listing premium, boosting expectations for one of the year’s most anticipated market debuts.",
            "pubDate": "2025-12-04T07:56:57.984231"
        },
        {
            "title": "Nifty poised for 11% returns in CY26, says BofA, explains why FIIs may return next year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-poised-for-11-returns-in-cy26-says-bofa-explains-why-fiis-may-return-next-year/articleshow/125762903.cms",
            "description": "BofA expects Nifty to deliver up to 11.4% returns by CY26 as earnings cuts ease, growth prospects improve and FII outflows may reverse. Largecaps are likely to outperform, while SMIDs offer selective opportunities but face sharper downside risks.",
            "pubDate": "2025-12-04T09:56:12.294487"
        },
        {
            "title": "For those with ability to stay invested for 2-3 years: 5 large-caps from different sectors with an upside potential of up to 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-those-with-ability-to-stay-invested-for-2-3-years-5-large-caps-from-different-sectors-with-an-upside-potential-of-up-to-38/articleshow/125762301.cms",
            "description": "The transformation in a sector has an impact beyond the sector itself. It can bring into focus a set of companies which may turn out to be surprise winners. It is, however, not easy to figure out some of these winners for a simple reason: On face it, they don't appear to be gaining from the transformation. But they do, indirectly. Also, it takes time for the correlation between the transforming sector and these companies to play out. So, if you are looking to invest money for the next two-three years in sectors where there is a change in the demand scenario and growth is assured, then keep these companies on their watchlist.",
            "pubDate": "2025-12-04T09:56:12.294609"
        },
        {
            "title": "Smallcap Shock: 9 firms post strong earnings, but stocks crash up to 68% in just 2 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-shock-9-firms-post-strong-earnings-but-stocks-crash-up-to-68-in-just-2-months/slideshow/125762734.cms",
            "description": "Despite a strong earnings season for India’s smallcaps, not all investors are cheering. Nine companies with solid profit margins have seen their stocks plunge 20%–68% since early October 2025.While 218 smallcaps posted margins above 10%, only 16 rewarded investors with 20%–40% gains. The rest show that robust fundamentals don’t always translate into rising share prices. (Data Source: ACE Equity)",
            "pubDate": "2025-12-04T09:56:12.294713"
        },
        {
            "title": "Bajaj Housing Finance shares slide 10% in 5 days. What’s spooking investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-finance-shares-slide-10-in-5-days-whats-spooking-investors/articleshow/125762240.cms",
            "description": "Bajaj Housing Finance shares have plunged nearly 10% in five days, sliding toward their IPO price as a large promoter stake sale spooked investors. The stock is down 35% from its December peak despite solid financial performance, raising concerns of further supply pressure.",
            "pubDate": "2025-12-04T09:56:12.294813"
        },
        {
            "title": "Indigo's problems on runway now extend to its charts. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigos-problems-on-runway-now-extend-to-its-charts-should-you-buy-sell-or-hold/articleshow/125763968.cms",
            "description": "IndiGo shares slid further after major flight disruptions, with technical indicators signalling persistent weakness. Analysts advise avoiding or selling the stock as it trades below key levels, facing resistance near ₹5,700 and risks of deeper downside despite upcoming Sensex inclusion.",
            "pubDate": "2025-12-04T10:19:31.237198"
        },
        {
            "title": "Market Wrap: Sensex adds 158 pts, Nifty above 26,000 as D-St snaps 4-day losing run",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-adds-158-pts-nifty-above-26000-as-d-st-snaps-4-day-losing-run/articleshow/125764551.cms",
            "description": "Indian stocks snapped a four-day slide on Thursday, with the Sensex and Nifty closing higher, primarily driven by IT shares. This advance occurred ahead of the Reserve Bank of India's policy decision, with IT stocks benefiting from a softer rupee and expectations of a U.S. rate cut. Financials, however, acted as a drag on the broader market.",
            "pubDate": "2025-12-04T10:43:48.013590"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125768270.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-04T14:00:05.005309"
        },
        {
            "title": "Two Trades for Today: An IT major for a 5.05% gain; a large-cap stock, also from the IT space, for an almost 5% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-it-major-for-a-5-05-gain-a-large-cap-stock-also-from-the-it-space-for-an-almost-5-upmove/articleshow/125768114.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-04T14:00:05.005436"
        },
        {
            "title": "Asian Paints, Vedanta and 3 other stocks hit 52-week highs; gains up to 18% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-vedanta-and-3-other-stocks-hit-52-week-highs-gains-up-to-18-in-a-month/slideshow/125767117.cms",
            "description": "Benchmark Sensex rose 159 points to settle at 85,265 on Thursday. During the broader market rally, five BSE500 stocks reached their 52-week highs, hitting their strongest levels in a year. These breakouts are often seen as bullish signals by traders and investors, indicating robust momentum and the likelihood of additional short-term gains.",
            "pubDate": "2025-12-04T14:00:05.005547"
        },
        {
            "title": "FPIs withdraw Rs 13,121 cr in just 4 days; outflow reaches Rs 1.56 lakh cr in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-withdraw-rs-13121-cr-in-just-4-days-outflow-reaches-rs-1-56-lakh-cr-in-2025/articleshow/125768155.cms",
            "description": "Foreign investors have pulled out Rs 13,121 crore (USD 1.46 billion) from Indian equities in the first four days of December, taking the total outflow for 2025 to Rs 1.56 lakh crore (USD 17.8 billion), data from NSDL showed on Thursday.",
            "pubDate": "2025-12-04T14:00:05.005653"
        },
        {
            "title": "British American Tobacco plans to offload up to 15.3% stake in ITC Hotels via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/british-american-tobacco-plans-to-offload-up-to-15-3-stake-in-itc-hotels-via-block-deal/articleshow/125768033.cms",
            "description": "BAT announced that its wholly-owned subsidiaries, Tobacco Manufacturers (India) Limited, Myddleton Investment Company Limited and Rothmans International Enterprises Limited, intend to sell the issued ordinary share capital in ITC Hotels via block deals.",
            "pubDate": "2025-12-04T14:00:05.005775"
        }
    ]
}