{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-02T02:05:05.000899",
    "items": [
        {
            "title": "Daily Trading Desk: 2 trades for short-term gains; a specialty chemicals stock for almost 5% gain, a heavy engineering stock for over 6% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/daily-trading-desk-2-trades-for-short-term-gains-a-specialty-chemicals-stock-for-almost-5-gain-a-heavy-engineering-stock-for-over-6-upmove/articleshow/113861250.cms",
            "description": "Select stocks gain momentum even in volatile markets.",
            "pubDate": "2024-10-02T02:04:43.701799"
        },
        {
            "title": "These 8 bank stocks can give between 22 and 49% returns in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-8-bank-stocks-can-give-between-22-and-49-returns-in-1-year-according-to-analysts/articleshow/113860635.cms",
            "description": "It was a day of rapid developments. SEBI finally brought in the much-anticipated change in F&O rules. The US markets ended the day in the red. Middle East tensions deepened. And the Gift Nifty was trading with a cut of more than half a percent. There is thus a high probability that when the market opens for trade on Thursday, it will be another day of decline. If there is any institutional-based selling, then even bank stocks could come under pressure. If not, it is likely that it will be the banks that play a role in any recovery – as and when it takes place. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks along with detailed company analysis focusing on five key components – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2024-10-02T02:04:43.701938"
        },
        {
            "title": "These 6 healthcare stocks hit fresh 52-week highs; rallied up to 35% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-healthcare-stocks-hit-fresh-52-week-highs-rallied-up-to-35-in-a-month/slideshow/113858856.cms",
            "description": "On Tuesday, India's benchmark Sensex index closed slightly down, dropping around 33 points to settle at 84,266. Despite the flat market performance, six stocks within the BSE healthcare index hit their highest levels in the past year. A 52-week high is a key indicator, marking the peak price a stock has achieved over the last 12 months, offering valuable insights for traders and investors to assess current value and predict future price movements.",
            "pubDate": "2024-10-02T02:04:43.702036"
        },
        {
            "title": "Suzlon Energy gets warning letters from exchanges over non-compliance in disclosures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-receives-warning-letters-from-exchanges/articleshow/113859066.cms",
            "description": "Suzlon Energy has been issued an advisory cum warning letter from both the National Stock Exchange (NSE) and BSE Ltd, regarding non-compliance with the Securities and Exchange Board of India (SEBI) Listing Obligations and Disclosure Requirements.",
            "pubDate": "2024-10-02T02:04:43.702139"
        },
        {
            "title": "GIFT Nifty records all-time high monthly turnover of $100.7 billion in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-records-all-time-high-monthly-turnover-of-100-7-billion-in-september/articleshow/113857784.cms",
            "description": "GIFT Nifty achieved a new milestone with a monthly turnover of $100.7 billion in September 2024. This surpasses its previous record of $100.13 billion set in August 2024. This reflects the growing global interest and trust in GIFT Nifty as a benchmark for India's growth story. NSE IX, the exchange hosting GIFT Nifty, has seen a total cumulative volume of over 27.11 million contracts with total cumulative turnover of US $1.18 trillion till September 2024.",
            "pubDate": "2024-10-02T02:04:43.702237"
        },
        {
            "title": "F&O addiction: Sebi tightens Futures and Options trading rules effective Nov 20; check details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-addiction-sebi-tightens-futures-and-options-trading-rules-effective-nov-20-check-details-here/videoshow/113857722.cms",
            "description": "Markets regulator Sebi, on October 01, announced that it will start implementing a new framework to regulate the high-risk world of futures and options (F&O) by taking six measures, including increasing the contract size to Rs 15 lakh from Rs 5-10 lakh and limiting weekly expiries to one per exchange. The new rules come into effect in a graded manner beginning November 20. These rules are based on recommendations by an Expert Working Group (EWG) to strengthen the equity index derivatives framework. Watch the video to know more details.",
            "pubDate": "2024-10-02T02:04:43.702332"
        },
        {
            "title": "RBI releases report calling for changing MIBOR methodology, launch of new benchmark",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-releases-report-calling-for-changing-mibor-methodology-launch-of-new-benchmark/articleshow/113857584.cms",
            "description": "The Reserve Bank of India on Tuesday released a report recommending changes in methodology of the Mumbai Interbank Outright Rate (MIBOR) while proposing a change to a new secured money market benchmark for widely used derivative products.",
            "pubDate": "2024-10-02T02:04:43.702423"
        },
        {
            "title": "Sebi raises contract size for index derivatives to Rs 15 lakh, effective from Nov 20",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-raises-contract-size-for-index-derivatives-to-rs-15-lakh-effective-from-nov-20/articleshow/113856619.cms",
            "description": "To account for market growth, Sebi is raising the minimum contract size for index futures and options to Rs 15 lakh from the current Rs 5-10 lakh range. This change reflects the threefold increase in market values since the limit was last set in 2015.",
            "pubDate": "2024-10-02T02:04:43.702514"
        },
        {
            "title": "US stocks slip as investors await job openings data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-slip-as-investors-await-job-openings-data/articleshow/113855780.cms",
            "description": "Wall Street's main indexes slipped on Tuesday ahead of the first of multiple job reports this week, a day after Federal Reserve Chair Jerome Powell pushed back against market expectations for outsized interest rate cuts.",
            "pubDate": "2024-10-02T02:04:43.702604"
        },
        {
            "title": "Dabur Q2 update: Co to likely report mid-single digit decline in cons revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dabur-q2-update-co-to-likely-report-mid-single-digit-decline-in-cons-revenue/articleshow/113855509.cms",
            "description": "FMCG major Dabur India is expected to post a mid-single digit decline in consolidated revenue for the quarter ended September 30, 2024 amid correction in its India operations though the international business is expected to register double digit constant currency growth in topline, the company said in its quarterly update on Tuesday.",
            "pubDate": "2024-10-02T02:04:43.702729"
        },
        {
            "title": "Tech view: Nifty signals indecision, forms small candle. How to trade on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-signals-indecision-forms-small-candle-how-to-trade-on-thursday/articleshow/113855628.cms",
            "description": "Despite a small candle with an upper shadow appearing on Tuesday's market chart, Nagaraj Shetti of HDFC Securities observed a lack of strong selling activity to confirm this bearish indication. Essentially, the market showed a potential signal for downward movement, but traders didn't act on it aggressively, suggesting some uncertainty in the market.",
            "pubDate": "2024-10-02T02:04:43.702851"
        },
        {
            "title": "FPIs increase net flows in the secondary market in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-increase-net-flows-in-the-secondary-market-in-september/articleshow/113855374.cms",
            "description": "A strong net inflow by foreign portfolio investors (FPIs) in September has turned their total secondary market investment in Indian equities positive for the calendar year so far to $4,140.3 million (Rs 34,554 crore) compared with a net outflow of $1,417 million (negative Rs 11,998 crore) at the end of August.",
            "pubDate": "2024-10-02T02:04:43.702955"
        },
        {
            "title": "Sebi announces 6-step framework to get Indians rid of F&O addiction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-announces-6-step-framework-to-get-indians-rid-of-fo-addiction/articleshow/113854643.cms",
            "description": "To curb excessive speculation in the stock market, Sebi is tightening the rules for futures and options (F&O) trading. Starting November 20th,  the minimum amount needed to invest in index F&O contracts will increase significantly. Currently, investors can participate with as little as Rs 5-10 lakh. This threshold will be raised to Rs 15 lakh, making these contracts less accessible to smaller investors.  Sebi will also periodically adjust this minimum investment amount to ensure it stays between Rs 15 lakh and Rs 20 lakh.",
            "pubDate": "2024-10-02T02:04:43.703045"
        },
        {
            "title": "Typhoon Krathon shuts Taiwan’s $2.5 trillion stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/typhoon-krathon-shuts-taiwans-2-5-trillion-stock-market/articleshow/113854222.cms",
            "description": "Taiwan will close its stock market on Wednesday due to Super Typhoon Krathon. Schools and offices are also closed in many parts of Taiwan. Taiwan has been experiencing typhoons and has canceled flights, ship sailings, and some train services.",
            "pubDate": "2024-10-02T02:04:43.703134"
        },
        {
            "title": "Adani flagship’s $1.3 billion share sale said to start next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-flagships-1-3-billion-share-sale-said-to-start-next-week/articleshow/113853462.cms",
            "description": "Gautam Adani’s Adani Enterprises Ltd. plans a $1.3 billion share sale via a qualified institutional placement starting as early as Oct. 7. The move follows a short-seller's 2023 allegations of fraud, which led to a significant stock drop. The share issue aims to signal investor confidence and revive expansion efforts.",
            "pubDate": "2024-10-02T02:04:43.703226"
        },
        {
            "title": "Sebi issues Rs 1 crore demand notices to Venugopal Dhoot, 2 others for insider trading in Videocon shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-issues-nearly-rs-1-cr-demand-notices-to-venugopal-dhoot-2-others/articleshow/113851913.cms",
            "description": "Capital markets regulator Sebi has sent demand notices to industrialist Venugopal Dhoot and two other entities, asking them to pay nearly Rs 1.03 crore for insider trading activities in the shares of Videocon Industries.",
            "pubDate": "2024-10-02T02:04:43.703317"
        }
    ]
}