{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-09T08:48:55.225879",
    "items": [
        {
            "title": "FIIs sell consumer stocks despite GST2.0 boost to buy financials worth Rs 13,300 crore in October",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-sell-consumer-stocks-despite-gst2-0-boost-to-buy-financials-worth-rs-13300-crore-in-october/articleshow/125197491.cms",
            "description": "Foreign institutional investors (FIIs) offloaded consumer-centric stocks worth Rs 9,477 crore in October, even as they poured Rs 13,279 crore into the financial space, data from ACE Equity showed. Interestingly, the selling in consumer stocks came despite the rollout of GST 2.0, a tax reform aimed at boosting consumption.",
            "pubDate": "2025-11-09T05:58:30.318829"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms erodes by Rs 88,635 cr; Airtel, TCS biggest laggards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-erodes-by-rs-88635-cr-airtel-tcs-biggest-laggards/articleshow/125197465.cms",
            "description": "The combined market valuation of seven of the top-10 most valued firms eroded by Rs 88,635.28 crore in a holiday-shortened last week, with Bharti Airtel and Tata Consultancy Services taking the biggest hit, in line with the weak trend in equities.",
            "pubDate": "2025-11-09T05:58:30.318972"
        },
        {
            "title": "Axis Securities names 15 stocks as its top picks. How many do you have in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-names-15-stocks-as-its-top-picks-how-many-do-you-have-in-your-portfolio/slideshow/125197453.cms",
            "description": "Intro – Axis Securities’ latest Top Picks – November 2025 report highlights 15 stocks across large, mid, and smallcap segments that it believes are best positioned to deliver strong returns in the coming months. Backed by improving domestic liquidity, policy support, and rising consumption, these top picks span sectors such as financials, telecom, healthcare, industrials, and utilities—offering a balanced mix of defensives and cyclical opportunities for investors.",
            "pubDate": "2025-11-09T05:58:30.319077"
        },
        {
            "title": "Lenskart listing, Infosys buyback and FII trends among 7 factors to steer markets this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-listing-infosys-buyback-and-fii-trends-among-7-factors-to-steer-markets-this-week/articleshow/125196839.cms",
            "description": "Indian benchmark indices Nifty and the BSE Sensex ended with weekly declines of 0.9%, amid selling pressure in IT and consumer stocks.",
            "pubDate": "2025-11-09T05:58:30.319199"
        },
        {
            "title": "Plunge in Asia’s AI shares sows doubts over world-beating rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/plunge-in-asias-ai-shares-sows-doubts-over-world-beating-rally/articleshow/125196789.cms",
            "description": "The sudden slump in Asia’s technology shares last week has jolted investors, serving as a stark reminder that the world-beating rally in artificial intelligence and semiconductor stocks may be nearing a short-term crest.",
            "pubDate": "2025-11-09T05:58:30.319297"
        },
        {
            "title": "Lenskart shares to debut on Dalal Street tomorrow. What should investors expect?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-to-debut-on-dalal-street-tomorrow-what-should-investors-expect/articleshow/125198051.cms",
            "description": "Eyewear retailer Lenskart Solutions will make its much-awaited stock market debut on Monday, but investor euphoria has cooled sharply.",
            "pubDate": "2025-11-09T07:36:23.364077"
        },
        {
            "title": "Q2 earnings in last leg: Bajaj Finance, Asian Paints, BSE, LG among 2,400 companies to announce results this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-earnings-in-last-leg-bajaj-finance-asian-paints-bse-lg-among-2400-companies-to-announce-results-this-week/slideshow/125197748.cms",
            "description": "The second quarter earnings season is in its last leg and as many as 2,400 companies will announce their results next week. Some of the important names to track include Bajaj Finance, HAL, Asian Paints, Tata Steel, LG Electronics, BSE, Tata Motors PV among others. Below are the key earnings scheduled for next week.",
            "pubDate": "2025-11-09T07:36:23.364200"
        },
        {
            "title": "India's most underowned and overowned stocks: Where big money is crowded and where it's missing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-most-underowned-and-overowned-stocks-where-big-money-is-crowded-and-where-its-missing/articleshow/125197537.cms",
            "description": "Mutual funds have crowded into a handful of big names in 2025, with Axis Bank, Maruti Suzuki, SBI, ICICI Bank, and SBI Life among the most overowned stocks, each held far above their index weights.",
            "pubDate": "2025-11-09T07:36:23.364299"
        },
        {
            "title": "9 largecap stocks with up to 35% upside potential. Should you buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-largecap-stocks-with-up-to-35-upside-potential-should-you-buy-now/slideshow/125198749.cms",
            "description": "Analyst forecasts offer more than just numbers — they provide a strategic view of future market potential. For investors seeking the next big opportunity, a closer examination of BSE Large-Cap stocks highlights some promising contenders.Based on consensus estimates from Trendlyne, a number of large-cap stocks are projected to deliver strong returns over the next 12 months. This anticipated “upside” represents the average expected gain over the coming year, providing a data-driven benchmark for investors targeting high-potential large-cap opportunities. In this analysis, we spotlight nine standout large-cap stocks expected to deliver gains in the range of 25% to 35% in the year ahead.",
            "pubDate": "2025-11-09T08:48:52.885911"
        },
        {
            "title": "This auto ancillary stock eyes multi-month trend reversal. Here's a technical analysis",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-auto-ancillary-stock-eyes-multi-month-trend-reversal-heres-a-technical-analysis/articleshow/125198543.cms",
            "description": "Despite a weak start, the markets staged a remarkable recovery on Friday to end on a flat note. The Nifty saw a weak opening; it opened lower and drifted further to form the low point of the day in the first hour of the session.",
            "pubDate": "2025-11-09T08:48:52.886034"
        },
        {
            "title": "Mining Multibaggers: 11 penny stocks soared up to 600% in 6 months. Did you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mining-multibaggers-11-penny-stocks-soared-up-to-600-in-6-months-did-you-own-any/slideshow/125198492.cms",
            "description": "Over the past six months, 11 penny stocks have surged sharply, delivering returns ranging from 120% to as high as 600%. These standout performers were selected based on specific criteria: a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares. This strategy focuses on identifying low-priced, actively traded micro-cap stocks demonstrating strong upward momentum. (Data Source: ACE Equity).Penny stocks often attract attention due to their low entry price and the potential for explosive growth. But while the rewards can be impressive, the risks are equally high. These stocks typically carry low liquidity, high volatility, and limited financial transparency. Investors should proceed with caution —success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2025-11-09T08:48:52.886137"
        }
    ]
}