{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-26T03:43:32.731209",
    "items": [
        {
            "title": "South Korean shares set to snap 4-week rally on US tariff woes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-set-to-snap-4-week-rally-on-us-tariff-woes/articleshow/124141191.cms",
            "description": "South Korean shares experienced a significant slump on Friday, poised for their first weekly loss in five weeks, influenced by uncertainties surrounding trade negotiations with the U.S. and new tariffs imposed by President Trump. The Korean won weakened to its lowest level in over four months, while the benchmark bond yield increased.",
            "pubDate": "2025-09-26T02:39:42.589782"
        },
        {
            "title": "Negative Breakout: These 9 stocks close cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-9-stocks-close-cross-below-their-200-dmas/slideshow/124141166.cms",
            "description": "In the Nifty500 pack, 9 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on September 25, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders to determine a particular stock's overall trend. Take a look:",
            "pubDate": "2025-09-26T02:39:42.589911"
        },
        {
            "title": "Wall Street indexes finish lower, data raises uncertainty for rate-cut outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-finish-lower-data-raises-uncertainty-for-rate-cut-outlook/articleshow/124140853.cms",
            "description": "United States stock market saw a moderate dip. This happened because economic data created confusion about possible interest rate cuts by the Federal Reserve. Jobless claims decreased, but the economy grew faster than expected. Chicago Fed President expressed worry about cutting rates too quickly. Investors are now awaiting the Personal Consumption Expenditures price index.",
            "pubDate": "2025-09-26T02:39:42.590042"
        },
        {
            "title": "Technical breakout: Suprajit Engineering set for a fresh rally, says SMC Global",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-breakout-suprajit-engineering-set-for-a-fresh-rally-says-smc-global/videoshow/124120420.cms",
            "description": "“After spending weeks stuck in a tight range, Suprajit Engineering stock has finally broken above the consolidation phase. Traders can buy for a target of Rs 555 in the next 5-7 weeks,” Shitij Gandhi, Senior Technical Analyst, SMC Global Securities, said",
            "pubDate": "2025-09-26T02:39:42.590162"
        },
        {
            "title": "Asian stocks drop after Wall Street rally stalls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-drop-after-wall-street-rally-stalls/articleshow/124139480.cms",
            "description": "Asian stocks declined amid concerns over high Wall Street valuations, triggered by strong US economic data and mixed signals from Federal Reserve officials regarding potential rate cuts. The dollar strengthened, while the yen weakened. Investors are now closely watching the upcoming inflation report, which will influence the Fed's future policy decisions, adding to market uncertainty.",
            "pubDate": "2025-09-26T02:39:42.590262"
        },
        {
            "title": "Polycab India promoters sell shares worth Rs 1,739 crore in block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/polycab-india-promoters-sell-rs-1739-crore-worth-shares-in-block-deal/articleshow/124139191.cms",
            "description": "Promoters, including Nikhil Jaisinghani and Anil Jaisinghani, divested ₹1,739 crore worth of Polycab India shares through a block deal on the NSE, selling 23.32 lakh shares at ₹7,458 each. This sale reduced their collective stake from 48.7% to approximately 47.1%. Prominent buyers included JP Morgan Fund, Morgan Stanley Asia Singapore, and Kotak Mahindra Life.",
            "pubDate": "2025-09-26T02:39:42.590363"
        },
        {
            "title": "GIFT Nifty down 55 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124125306.cms",
            "description": "Indian stock markets saw a fifth day of losses. Nifty dipped below 25,000. Foreign fund outflows and US visa concerns impacted sentiment. Analysts foresee continued market pressure. They are watching global cues and India-US trade talks. India VIX rose, indicating market fear. Rupee settled slightly higher due to suspected RBI action. FIIs increased their net short positions.",
            "pubDate": "2025-09-26T02:39:42.590456"
        },
        {
            "title": "Stocks in news: Infosys, TCS, RIL, NTPC, BHEL, Maruti Suzuki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-tcs-ril-ntpc-bhel-maruti-suzuki/articleshow/124125200.cms",
            "description": "Indian markets faced pressure, extending losses amid persistent underperformance in key sectors and FII outflows. Reliance Consumer Products and Coca-Cola bottlers pledged ₹65,000 crore to boost food processing. NTPC will commence operations at its Nokh Solar Project, while ABB India invests ₹140 crore in its LV motors facility.",
            "pubDate": "2025-09-26T02:39:42.590553"
        },
        {
            "title": "Capital market payments via UPI down 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capital-market-payments-via-upi-down-22/articleshow/124138900.cms",
            "description": "UPI transactions for capital market investments experienced a 22% year-on-year decline in volume from June to August, totaling ₹1.51 lakh crore. This drop occurred as investors became cautious ahead of the new UPI payment framework aimed at curbing fraud, set to launch on October 1. The new system introduces a fund-blocking mechanism similar to ASBA.",
            "pubDate": "2025-09-26T02:39:42.590644"
        },
        {
            "title": "Could SEBI's potential clampdown on weekly contracts disrupt India's derivatives market?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/could-sebis-potential-clampdown-on-weekly-contracts-disrupt-indias-derivatives-market/articleshow/124138696.cms",
            "description": "Weekly derivatives contracts in India are under scrutiny. Securities and Exchange Board of India is considering potential curbs. This follows concerns about speculation by individual traders. Restrictions could impact market liquidity and trading volumes. Exchanges and brokers may face challenges. Market participants worry about higher hedging costs. The regulator aims to address systemic risk in the derivatives segment.",
            "pubDate": "2025-09-26T02:39:42.590741"
        },
        {
            "title": "Maruti Suzuki becomes world’s 8th most valuable carmaker, surpasses Ford, GM and Volkswagen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-becomes-worlds-8th-most-valuable-carmaker-surpasses-ford-gm-and-volkswagen/articleshow/124138296.cms",
            "description": "Maruti Suzuki India has ascended to become the world's eighth most valuable automaker, surpassing giants like Ford and General Motors. Fuelled by positive investor sentiment following tax reforms and a revamped GST regime, Maruti's market capitalization has soared to nearly $57.6 billion. The company's stock has rallied significantly, outperforming the Nifty Auto index, with foreign investors increasing their exposure.",
            "pubDate": "2025-09-26T02:39:42.590833"
        },
        {
            "title": "ET poll: Economists predict RBI to hold policy rates steady amid economic uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-poll-economists-predict-rbi-to-hold-policy-rates-steady-amid-economic-uncertainty/articleshow/124139314.cms",
            "description": "Economists anticipate the Reserve Bank of India (RBI) to maintain policy rates next week, despite potential for cuts, due to uncertainties from US tariffs and GST impacts. While some advocate for proactive rate cuts given low inflation, the majority prefers retaining options, awaiting clearer signs of economic slowdown and assessing the effects of recent GST reductions on inflation and growth.",
            "pubDate": "2025-09-26T02:39:42.590924"
        },
        {
            "title": "Stock Radar: Suprajit Engineering breaks out from an inverse Head & Shoulder pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-suprajit-engineering-breaks-out-from-an-inverse-head-shoulder-pattern-time-to-buy/articleshow/124113470.cms",
            "description": "Suprajit Engineering Ltd. has broken out from an inverse Head & Shoulder pattern, signaling a potential upward trend. Experts suggest short-term traders consider buying the stock, targeting Rs 560 within 1-2 months. The stock's recent rally, coupled with its position above key moving averages, reinforces the bullish outlook.",
            "pubDate": "2025-09-26T02:39:42.591038"
        },
        {
            "title": "NBFCs grab a bigger personal loan share amid bank caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfcs-grab-a-bigger-personal-loan-share-amid-bank-caution/articleshow/124138274.cms",
            "description": "Non-bank lenders are increasing their hold on the personal loan market. Data shows NBFCs' share in new personal loans has risen significantly. This growth is driven by fintech companies. Meanwhile, banks' share has decreased. The personal loan market is now over fifteen lakh crore rupees. NBFCs are more flexible, attracting borrowers banks might overlook.",
            "pubDate": "2025-09-26T02:39:42.591139"
        },
        {
            "title": "Digital payment norms revised, two-factor nod mandatory",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/digital-payment-norms-revised-two-factor-nod-mandatory/articleshow/124138670.cms",
            "description": "The Reserve Bank of India has announced new guidelines for digital payment security. Two-factor authentication will become mandatory for all transactions. Banks can now use biometrics and other methods for verification. Small-value transactions are exempt from strict authentication. These rules aim to boost security and will be effective from April 1, 2026.",
            "pubDate": "2025-09-26T02:39:42.591230"
        },
        {
            "title": "Credit card issuances soar to seven-month high in August",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-card-issuances-soar-to-seven-month-high-in-august/articleshow/124138641.cms",
            "description": "Credit card issuances in India reached a seven-month high in August, driven by lenders like HDFC Bank and Axis Bank preparing for increased festive season demand. Nearly 700,000 new cards were issued, bringing the total active cards to 112.3 million.",
            "pubDate": "2025-09-26T02:39:42.591329"
        },
        {
            "title": "Siddhi Cotspin IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siddhi-cotspin-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/124143256.cms",
            "description": "Siddhi Cotspin is set to debut on the market on September 26. The company's Rs 70 crore IPO saw moderate demand. The IPO was subscribed 4.2 times overall. Qualified institutional buyers drove demand. Siddhi Cotspin manufactures and sells cotton yarns. The company has reported steady growth. Revenue rose 25% to Rs 725 crore in FY25.",
            "pubDate": "2025-09-26T03:43:22.337253"
        },
        {
            "title": "Saatvik Green Energy shares to list today. GMP points to mild debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saatvik-green-energy-shares-to-list-today-gmp-points-to-mild-debut/articleshow/124143202.cms",
            "description": "Saatvik Green Energy will debut on the market on September 26. The company raised Rs 900 crore through its IPO. The IPO was subscribed 6.93 times overall. The company plans to use the funds to prepay borrowings. It will also fund a subsidiary’s debt repayment. Saatvik aims to set up a new solar PV module manufacturing facility in Odisha.",
            "pubDate": "2025-09-26T03:43:22.337366"
        },
        {
            "title": "TCS, TVS Motor among 7 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-tvs-motor-among-7-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124142870.cms",
            "description": "There was a notable surge in futures open interest for seven stocks in the NSE F&O pack on September 25, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-26T03:43:22.337464"
        },
        {
            "title": "GK Energy shares to debut today. GMP hints at modest listing gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gk-energy-shares-to-debut-today-gmp-hints-at-modest-listing-gains/articleshow/124143154.cms",
            "description": "GK Energy is set to list on the stock exchanges on September 26, following a highly successful IPO that was oversubscribed 93.6 times. The IPO price was Rs 153, and the grey market premium suggests a listing price of around Rs 165, potentially offering investors an 8% gain.",
            "pubDate": "2025-09-26T03:43:22.337557"
        },
        {
            "title": "Newgen Software, Gujarat Pipavav Port among 8 stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/newgen-software-gujarat-pipavav-port-among-8-stocks-showing-bullish-rsi-upswing/slideshow/124142528.cms",
            "description": "Eight stocks from the Nifty500 pack that gained over 1.5% were highlighted in the RSI Trending Up scan on September 25, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-26T03:43:22.337649"
        },
        {
            "title": "India’s options crackdown gives 150-year-old bourse surprise win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-options-crackdown-gives-150-year-old-bourse-surprise-win/articleshow/124141894.cms",
            "description": "BSE is gaining ground in India’s derivatives market after SEBI’s crackdown reshaped weekly expiries. By shifting its contracts to Thursdays, the 150-year-old exchange has captured traders’ attention, challenging NSE’s long-held dominance. While liquidity hurdles remain, BSE’s rising turnover on expiry days signals a shift in market dynamics that could redefine competition in derivatives trading.",
            "pubDate": "2025-09-26T03:43:22.337749"
        },
        {
            "title": "Nazara Technologies shares in focus on trading ex-bonus, ex-split today. Check how 10 shares turn into 40",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-technologies-shares-in-focus-on-trading-ex-bonus-ex-split-today-check-how-10-shares-turn-into-40/articleshow/124141777.cms",
            "description": "Nazara Technologies' shares are trading ex-bonus and ex-split today, following the announcement of a 1:1 bonus issue and a 1:2 stock split. This corporate action will effectively turn 10 shares into 40 for existing investors. While the company previously issued a bonus in June 2022, this marks its first-ever stock split.",
            "pubDate": "2025-09-26T03:43:22.337850"
        },
        {
            "title": "IT Stocks in focus as Accenture reports 7% revenue growth in Q4. Infosys, Wipro ADRs tumble up to 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-it-stocks-in-focus-as-accenture-reports-7-revenue-growth-in-q4-infosys-wipro-adrs-tumble-up-to-3/articleshow/124141287.cms",
            "description": "Accenture's Q4 results revealed $17.6 billion in revenue, a 7% year-on-year increase, with full-year revenue reaching $69.7 billion. Despite a dip in Accenture's shares, Indian IT ADRs, specifically Infosys and Wipro, saw modest gains in after-hours trading. The company also announced an $865 million restructuring program to focus on digital and AI services, reflecting industry-wide cost optimization efforts.",
            "pubDate": "2025-09-26T03:43:22.337965"
        }
    ]
}