{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-30T15:48:40.666966",
    "items": [
        {
            "title": "BHEL shares in focus after profit triples YoY in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-shares-in-focus-after-profit-triples-yoy-in-q2/articleshow/124931816.cms",
            "description": "Bharat Heavy Electricals Ltd (BHEL) reported a sharp turnaround in Q2 FY26 with a consolidated net profit of Rs 374.89 crore, up 253% YoY, compared to Rs 106.15 crore last year. Revenue rose 14% to Rs 7,512 crore, driven by strong growth in its power segment. The stock has gained steadily across all time frames.",
            "pubDate": "2025-10-30T03:37:28.466774"
        },
        {
            "title": "Chinese stocks climb to 10-year peak as Trump-Xi meet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinese-stocks-climb-to-10-year-peak-as-trump-xi-meeting-begins/articleshow/124931587.cms",
            "description": "Chinese stocks surged to a ten-year peak on Thursday. This rise occurred as Presidents Donald Trump and Xi Jinping commenced crucial talks. Investors are hopeful for a trade war truce. Early signs suggest easing tensions between the two global economic giants. Banking, insurance, and liquor sectors led the market gains. Hong Kong's Hang Seng Index also saw an increase.",
            "pubDate": "2025-10-30T03:37:28.466908"
        },
        {
            "title": "KFin Technologies, SAIL among 7 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kfin-technologies-sail-among-7-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/124931568.cms",
            "description": "As of October 29, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 11% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-30T03:37:28.467018"
        },
        {
            "title": "HEG, Indian Oil among 6 stocks that flash bullish signals, indicating a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/heg-indian-oil-among-6-stocks-that-flash-bullish-signals-indicating-a-possible-uptrend/slideshow/124931315.cms",
            "description": "On October 29, in the Nifty500 pack, six stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.\"",
            "pubDate": "2025-10-30T03:37:28.467123"
        },
        {
            "title": "NTPC, Adani Ports among 5 Nifty stocks that show bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-adani-ports-among-5-nifty-stocks-that-show-bullish-rsi-upswing/slideshow/124931121.cms",
            "description": "On October 29, in the Nifty50 pack, five stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-30T03:37:28.467226"
        },
        {
            "title": "Coforge, Laurus Labs among 7 stocks to go ex-dividend on Friday. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-laurus-labs-among-7-stocks-to-go-ex-dividend-on-friday-last-day-to-buy/articleshow/124930054.cms",
            "description": "Today is the final chance for investors to buy shares in Coforge and Laurus Labs for upcoming dividends. Their ex-dividend date is tomorrow, October 31. Shareholders on record today will receive interim dividends. Coforge offers Rs 4 per share. Laurus Labs provides Rs 0.8 per share.",
            "pubDate": "2025-10-30T03:37:28.467329"
        },
        {
            "title": "L&T shares in focus after 16% YoY rise in Q2 PAT, brokerages maintain positive outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-shares-in-focus-after-16-yoy-rise-in-q2-pat-brokerages-maintain-positive-outlook/articleshow/124929966.cms",
            "description": "Larsen & Toubro's Q2 FY25 net profit climbed 16% to Rs 3,926 crore, fueled by a 10% revenue jump to Rs 67,984 crore. The engineering giant secured Rs 1.15 lakh crore in new orders, a 45% surge, across diverse sectors. Brokerages like Morgan Stanley maintain an 'Overweight' rating, citing strong growth prospects.",
            "pubDate": "2025-10-30T03:37:28.467426"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Indus Tower, Go Digital among 5 stocks that could give 15-29% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-indus-tower-go-digital-among-5-stocks-that-could-give-15-29-return/slideshow/124929848.cms",
            "description": "Brokerages remain upbeat on select stocks across sectors, highlighting strong growth potential and attractive valuations.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-30T03:37:28.467545"
        },
        {
            "title": "Positive Breakout: These 10 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-cross-above-their-200-dmas/slideshow/124929689.cms",
            "description": "In the Nifty200 pack, 10 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 29, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-30T03:37:28.467642"
        },
        {
            "title": "Meta shares slide after company projects higher expenses for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meta-shares-slide-after-company-projects-higher-expenses-for-2026/articleshow/124928767.cms",
            "description": "Meta's stock declined after reporting strong Q3 results but forecasting significantly higher expenses in 2026 due to AI investments and talent acquisition. Despite the stock drop, analysts remain optimistic, viewing AI as a crucial growth engine for the company's advertising foundation. Meta also faces potential legal and regulatory challenges that could impact its financial performance.",
            "pubDate": "2025-10-30T03:37:28.467743"
        },
        {
            "title": "Dow ends down, S&P 500 flat as Powell says December rate cut far from assured",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-ends-down-sp-500-flat-as-powell-says-december-rate-cut-far-from-assured/articleshow/124928756.cms",
            "description": "The Federal Reserve cut interest rates by a quarter percentage point, but Fed Chair Jerome Powell signaled that a December cut is uncertain, leading the Dow lower and the S&P 500 flat. Nvidia reached a $5 trillion market value, boosting the Nasdaq to a record high, as strong earnings reports generally beat expectations.",
            "pubDate": "2025-10-30T03:37:28.467837"
        },
        {
            "title": "Asian stocks mixed as Powell cautious on rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-as-powell-cautious-on-rate-cut/articleshow/124927526.cms",
            "description": "Asian stocks showed mixed movement. Federal Reserve Chair Jerome Powell indicated that further interest rate cuts are not guaranteed. This led investors to adjust their expectations for easing. Markets are now awaiting policy signals from the Bank of Japan and the European Central Bank. Attention is also on the upcoming meeting between President Donald Trump and Xi Jinping concerning trade.",
            "pubDate": "2025-10-30T03:37:28.467931"
        },
        {
            "title": "Can Supreme Industries regain momentum after cutting FY26 growth guidance?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-supreme-industries-regain-momentum-after-cutting-fy26-growth-guidance/articleshow/124927276.cms",
            "description": "Supreme Industries' shares dipped following a revised FY26 volume growth guidance to 12-14% due to a tepid first half. Temporary headwinds from prolonged monsoons and slower government spending impacted demand, particularly in the plastic piping business. Despite near-term challenges, the company anticipates stronger demand and a gradual revival in the latter half of FY26.",
            "pubDate": "2025-10-30T03:37:28.468029"
        },
        {
            "title": "GIFT Nifty down 90 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124910654.cms",
            "description": "Indian equities rebounded on Wednesday, fueled by optimism surrounding a potential India-US trade deal and anticipation of the US Federal Reserve's policy decision. Analysts suggest that positive trade progress, upcoming earnings, and consistent FII inflows are likely to bolster near-term market sentiment.",
            "pubDate": "2025-10-30T03:37:28.468123"
        },
        {
            "title": "Stocks in news: ITC, Swiggy, L&T, Hero MotoCorp, Varun Beverages, Dr Reddy's",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-itc-swiggy-lt-hero-motocorp-varun-beverages-dr-reddys/articleshow/124910497.cms",
            "description": "Markets edged higher, anticipating the US Fed's policy outcome and a shift to corporate earnings. Analysts expect the uptrend to continue with Nifty eyeing record highs, advising a selective approach. Several companies like PB Fintech, L&T, and Hero MotoCorp are in focus due to strong Q2 results and expansion plans.",
            "pubDate": "2025-10-30T03:37:28.468222"
        },
        {
            "title": "Blackstone's warrant payment will advance if Federal Bank CAR dips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstones-warrant-payment-will-advance-if-federal-bank-car-dips/articleshow/124926947.cms",
            "description": "Blackstone may convert Federal Bank warrants early if capital adequacy drops below 13.5%, according to MD KVS Manian. The bank's current capital adequacy is 15.7%, but acquisitions could trigger this early conversion clause. Blackstone is set to acquire 9.99% in the bank for ₹6,197 crore.",
            "pubDate": "2025-10-30T03:37:28.468319"
        },
        {
            "title": "Sagility shares rise 10%, hit 52-week high as Q2 profit jumps 114% YoY to Rs 251 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sagility-shares-rise-10-hit-52-week-high-as-q2-profit-jumps-114-yoy-to-rs-251-crore/articleshow/124935059.cms",
            "description": "Shares of Sagility surged 10% to a 52-week high of Rs 56 on Thursday after the company reported strong Q2 FY26 earnings. Net profit more than doubled to Rs 251 crore from Rs 117 crore a year ago, while revenue rose 25% YoY to Rs 1,658 crore. Operating margin also improved to 25% from 23% last year.",
            "pubDate": "2025-10-30T05:17:12.274372"
        },
        {
            "title": "Bank of Japan holds rates, signals path for gradual hikes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-japan-holds-rates-signals-path-for-gradual-hikes/slideshow/124934991.cms",
            "description": "The Bank of Japan kept short-term interest rates unchanged at 0.5% on Thursday, maintaining its cautious stance on monetary policy. The central bank reiterated that it will continue to raise borrowing costs gradually if the economy performs in line with its projections. The move was widely expected by markets, reflecting the BOJ’s preference for a slow and steady approach to policy normalisation. (Source: Reuters)",
            "pubDate": "2025-10-30T05:17:12.274487"
        },
        {
            "title": "India's aerospace market to double in few years: 10 stocks to capture the $50 billion tailwind",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-aerospace-market-to-double-in-few-years-10-stocks-to-capture-the-50-billion-tailwind/slideshow/124934500.cms",
            "description": "The Indian aerospace market is taking off. From $27 billion in 2024, the market is expected to cross $54 billion by 2033, powered by Make-in-India, defence indigenisation, and rising exports. For investors, this decade could mark the emergence of a powerful aerospace supply-chain ecosystem — and several listed companies are positioned to benefit.",
            "pubDate": "2025-10-30T05:17:12.274579"
        },
        {
            "title": "Mukul Agrawal purchases 10 new stocks in Q2; ups stake in 5. How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-purchases-10-new-stocks-in-q2-ups-stake-in-5-how-many-do-you-own/articleshow/124934152.cms",
            "description": "Ace investor Mukul Agrawal significantly reshaped his Rs 7,500 crore portfolio in Q2, adding ten new stocks and increasing stakes in five others. His strategic investments, totaling around ₹400 crore, span diverse sectors including engineering, technology, renewable energy, and healthcare, reflecting a keen eye for emerging businesses.",
            "pubDate": "2025-10-30T05:17:12.274673"
        },
        {
            "title": "Microsoft’s $35 billion AI spending spree rattles investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/microsofts-35-billion-ai-spending-spree-rattles-investors/slideshow/124934341.cms",
            "description": "Microsoft’s massive AI infrastructure spending is surpassing Wall Street’s expectations, unsettling investors worried about costs. The company reported a record capital expenditure of nearly $35 billion for its fiscal first quarter and warned that spending will continue to rise, reversing earlier guidance. Shares fell nearly 4% in extended trading. (Source: Reuters)",
            "pubDate": "2025-10-30T05:17:12.274760"
        },
        {
            "title": "Nomura expects no more Fed rate cuts in 2025 after October easing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-expects-no-more-fed-rate-cuts-in-2025-after-october-easing/articleshow/124933713.cms",
            "description": "Nomura now anticipates the Federal Reserve will hold interest rates steady in December, reversing its prior expectation of a cut. This shift follows the Fed's recent quarter-point reduction aimed at supporting the job market. Nomura foresees three 25-basis point cuts in 2026, citing data that is unlikely to trigger renewed concerns about labor market deterioration.",
            "pubDate": "2025-10-30T05:17:12.274846"
        },
        {
            "title": "Infosys, Wipro, other IT stocks fall  as US Fed says December rate cut is far from guaranteed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-other-it-stocks-fall-as-us-fed-says-december-rate-cut-is-far-from-guaranteed/articleshow/124933610.cms",
            "description": "Indian IT stocks dipped on Thursday after the US Federal Reserve signaled that a December rate cut was not guaranteed. While the Fed delivered a 25 basis point cut on Wednesday, Chair Powell's cautious tone tempered market expectations. Cognizant's raised revenue guidance provided some support, though its net profit fell due to a tax outgo.",
            "pubDate": "2025-10-30T05:17:12.274932"
        },
        {
            "title": "Big Tech’s AI Bets: Mixed market reactions after Q3 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-techs-ai-bets-mixed-market-reactions-after-q3-earnings/slideshow/124933871.cms",
            "description": "Shares in three of the “Magnificent Seven” — Alphabet, Microsoft, and Meta — moved in different directions in after-hours trading after they released their third-quarter results. The earnings once again underscored how artificial intelligence continues to dominate Big Tech’s growth story and investor sentiment. (Source: Reuters)",
            "pubDate": "2025-10-30T05:17:12.275017"
        },
        {
            "title": "Rs 20,000 crore value? How Lenskart IPO could shift market gaze on Tata's quietest business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-20000-crore-value-how-lenskart-ipo-could-shift-market-gaze-on-tatas-quietest-business/articleshow/124933391.cms",
            "description": "Titan, a retail giant, once aimed to lead India's eyewear market but its division now lags significantly behind Lenskart. Lenskart's tech-driven, omnichannel approach has made it a dominant player, highlighting Titan's traditional retail model's limitations. The upcoming Lenskart IPO may force a re-evaluation of Titan's eyewear business.",
            "pubDate": "2025-10-30T05:17:12.275102"
        },
        {
            "title": "Nifty, Sensex near record high: Is your stock portfolio feeling left out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-sensex-near-record-high-is-your-stock-portfolio-feeling-left-out/articleshow/124932766.cms",
            "description": "While Nifty and Sensex near record highs, the broader market lags, with smallcaps still 6% from their peak. This rally is driven by select largecaps, particularly banks, while IT stocks struggle. Experts believe earnings derating is largely over, with small and mid-caps poised for faster growth, offering opportunities for patient investors.",
            "pubDate": "2025-10-30T05:17:12.275192"
        },
        {
            "title": "A $40 billion fund sees end to yearlong earnings cuts in India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-40-billion-fund-sees-end-to-yearlong-earnings-cuts-in-india/articleshow/124932687.cms",
            "description": "Axis Mutual Fund sees an end to India's earnings estimate downgrades.  Ashish Gupta, Chief Investment Officer, anticipates catalysts to boost earnings across key sectors.  Loan growth and potential tax cuts could benefit banks, consumption, and automobiles.  While valuations are high, earnings growth for the next financial year is projected to be robust and broad-based.",
            "pubDate": "2025-10-30T05:17:12.275272"
        },
        {
            "title": "Sensex slips over 500 pts, Nifty breaks below 26,900 as Fed signals rate-cut pause",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-300-pts-nifty-breaks-below-26000-as-fed-signals-rate-cut-pause/articleshow/124932456.cms",
            "description": "On Thursday, Indian stock markets began the day on a sour note, with both the Sensex and Nifty taking a dip in response to international market cues. The backdrop of a predicted interest rate reduction by the U.S. Federal Reserve, which hinted that this could be the final cut until 2025, understandably rattled investors. Furthermore, the ongoing U.S.",
            "pubDate": "2025-10-30T05:17:12.275367"
        },
        {
            "title": "US Fed delivers second rate cut with no promise of a third. What does it mean for Indian equities?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-delivers-second-rate-cut-with-no-promise-of-a-third-what-does-it-mean-for-indian-equities/articleshow/124932662.cms",
            "description": "The US Fed cut rates by 25 bps for a second straight meeting, lowering the benchmark range to 3.75–4% and ending its balance sheet runoff from December 1. Chair Jerome Powell cautioned against expecting another cut soon, signalling a data-driven approach as the Fed balances a cooling job market with persistent inflation risks.",
            "pubDate": "2025-10-30T05:17:12.275448"
        },
        {
            "title": "Buy, Sell or Hold: Elara recommends buy on Dr Reddy’s Laboratories; Goldman raises target on Varun Beverages",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-elara-recommends-buy-on-dr-reddys-laboratories-goldman-raises-target-on-varun-beverages/articleshow/124932473.cms",
            "description": "Brokerages remain positive on select large and mid-cap stocks, including Dr. Reddy’s, Coal India, and Varun Beverages, citing strong earnings visibility, temporary challenges, and long-term growth opportunities across key sectors.",
            "pubDate": "2025-10-30T05:17:12.275531"
        },
        {
            "title": "BOJ keeps rates steady at 0.5%, keeps future hikes in view",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-keeps-rates-steady-at-0-5-keeps-future-hikes-in-view/articleshow/124932423.cms",
            "description": "The Bank of Japan held interest rates steady at 0.5% but signaled readiness to hike further if economic projections align. Despite two board members dissenting for a hike, the BOJ slightly boosted its growth and inflation forecasts. Governor Ueda's upcoming briefing will be key for clues on future rate moves amid global economic uncertainties and domestic political considerations.",
            "pubDate": "2025-10-30T05:17:12.275613"
        },
        {
            "title": "Varun Beverages shares in focus on expansion plans, strong Q3 earnings. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/varun-beverages-shares-in-focus-on-expansion-plans-strong-q3-earnings-should-you-buy-sell-or-hold/articleshow/124932408.cms",
            "description": "Varun Beverages reported an 18.5% YoY rise in Q3 CY2025 profit to Rs 745 crore, supported by lower finance costs and higher other income, even as margins softened. The company also announced a strategic global expansion, entering the alcoholic beverages market in Africa through a Carlsberg partnership and setting up a new subsidiary in Kenya.",
            "pubDate": "2025-10-30T05:17:12.275696"
        },
        {
            "title": "Gainers & Losers: Canara Bank and Vodafone Idea among 7 stocks that moved most on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-canara-bank-and-vodafone-idea-among-7-stocks-that-moved-most-on-thursday/slideshow/124948679.cms",
            "description": "",
            "pubDate": "2025-10-30T11:37:08.884256"
        },
        {
            "title": "Sensex tumbles 592 points, Nifty below 25,900 as US Fed signals rate pause; 4 factors that dragged D-Street lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-tumbles-592-points-nifty-below-25900-as-us-fed-signals-rate-pause-4-factors-that-dragged-d-street-lower/articleshow/124947553.cms",
            "description": "Indian stocks declined on Thursday as the U.S. Federal Reserve cut interest rates but signaled a potential pause in further reductions for 2025. This move, coupled with uncertainty over the U.S. economic outlook due to the government shutdown, dampened investor sentiment and pressured emerging market equities.",
            "pubDate": "2025-10-30T11:37:08.884382"
        },
        {
            "title": "Shankar Sharma sees organised campaign against Lenskart. Explains why it is a steal vs Paytm, Zomato, others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shankar-sharma-sees-organised-campaign-against-lenskart-explains-why-it-is-a-steal-vs-paytm-zomato-others/articleshow/124946230.cms",
            "description": "Veteran investor Shankar Sharma defended Lenskart’s IPO valuation, calling it fair at ~10x sales versus other tech IPOs, while critics argue the eyewear firm’s market remains niche and limited.",
            "pubDate": "2025-10-30T11:37:08.884497"
        },
        {
            "title": "Canara Bank shares rise 4%, hit 52-week high as Q2 net profit jumps 19% to Rs 4,774 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canara-bank-shares-rise-4-hit-52-week-high-as-q2-net-profit-jumps-19-to-rs-4774-crore/articleshow/124945962.cms",
            "description": "Canara Bank shares surged 4% to a 52-week high after reporting a 19% YoY rise in Q2 FY26 net profit to ₹4,774 crore. Asset quality improved sharply, with GNPA falling to 2.35% and credit cost easing to 0.68%, reflecting strong operational efficiency and credit discipline.",
            "pubDate": "2025-10-30T11:37:08.884606"
        },
        {
            "title": "MTF - A bull market tool gaining momentum; yet a fraction of the global market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mtf-a-bull-market-tool-gaining-momentum-yet-a-fraction-of-the-global-market/articleshow/124943017.cms",
            "description": "Margin Trading Facility (MTF) is gaining traction in India, with its book growing to ₹1 trillion, driven by discount brokers and competitive interest rates. While offering controlled leverage and stock ownership, MTF remains a fraction of the market, indicating significant growth potential compared to global benchmarks.",
            "pubDate": "2025-10-30T11:37:08.884714"
        },
        {
            "title": "Ashish Kacholia invests Rs 10 cr in this smallcap co via preferential issue, stock zooms 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-invests-rs-10-cr-in-this-smallcap-co-via-preferential-issue-stock-zooms-5/articleshow/124945063.cms",
            "description": "Ace investor Ashish Kacholia has been allotted 52,632 shares of Knowledge Marine & Engineering Works at ₹1,900 per share, investing around ₹10 crore. The preferential issue raised ₹270 crore overall, increasing the company’s paid-up capital to ₹12.22 crore.",
            "pubDate": "2025-10-30T11:37:08.884818"
        },
        {
            "title": "Dolly Khanna’s portfolio revealed: 5 stocks soar up to 101%, but some are deep in red",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dolly-khannas-portfolio-revealed-5-stocks-soar-up-to-101-but-some-are-deep-in-red/slideshow/124945109.cms",
            "description": "The financial community closely monitors the investment moves of Dalal Street’s top investors. An analysis by ETMarkets of ace investor Dolly Khanna’s portfolio shows that she publicly holds around 11 stocks, collectively valued at approximately Rs 484 crore as of October 30, 2025, based on shareholding data from the September 2025 quarter. In terms of performance, about half of these stocks have delivered solid returns, rallying up to 101% in CY25, while the remaining ones have underperformed, declining between 10% and 40% over the same period. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-10-30T11:37:08.884917"
        },
        {
            "title": "One strength is must & enough to create wealth: 5 large-caps from different sectors with an upside potential of up to 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/one-strength-is-must-enough-to-create-wealth-5-large-caps-from-different-sectors-with-an-upside-potential-of-up-to-22/articleshow/124942324.cms",
            "description": "Irrespective of market conditions – bullish, bearish or volatile – there are some things which should be looked at very carefully when investing in any stock. The reason is simple: Market conditions change every day, week, and month. Business and operating conditions and the ability of the management does not change every day. And investing is about putting money in a business – a business which has some moat. It could be anything.",
            "pubDate": "2025-10-30T11:37:08.885018"
        },
        {
            "title": "Vijay Kedia-backed stock surges 13% on strong Q2; profit jumps 71% YoY, margins expand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-backed-stock-surges-13-on-strong-q2-profit-jumps-71-yoy-margins-expand/articleshow/124940433.cms",
            "description": "Shares of Vijay Kedia-backed Vaibhav Global surged 13% after the company posted strong Q2 FY26 results, driven by 10% revenue growth, a 71% jump in profit, and margin expansion to 10%. Robust digital sales, higher in-house brand contribution, and a strong balance sheet underpinned performance. The stock has gained nearly 30% in the past month.",
            "pubDate": "2025-10-30T11:37:08.885115"
        },
        {
            "title": "Vodafone Idea shares crash 12% as Supreme Court’s written order on AGR dashes big relief hopes. Is the comeback story falling apart?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-crash-12-as-supreme-courts-written-order-on-agr-dashes-big-relief-hopes-is-the-comeback-story-falling-apart/articleshow/124938485.cms",
            "description": "Vodafone Idea shares plunged over 12% after the Supreme Court’s written order on AGR dues limited relief to a smaller disputed amount, dashing hopes of a broader financial reprieve.",
            "pubDate": "2025-10-30T11:37:08.885234"
        },
        {
            "title": "Coal India shares rise even as Q2 PAT falls 30% YoY. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-shares-rise-even-as-q2-pat-falls-30-yoy-what-should-investors-do/articleshow/124938441.cms",
            "description": "Coal India reported a 30% YoY drop in Q2FY26 net profit to Rs 4,354 crore amid higher expenses and lower revenue. Despite weak performance, the firm announced a Rs 10.25 interim dividend. Brokerages remain divided, with Motilal Oswal recommending ‘Buy’, Elara suggesting ‘Accumulate’, and Choice Broking maintaining a ‘Sell’ view.",
            "pubDate": "2025-10-30T11:37:08.885336"
        },
        {
            "title": "Groww IPO: Top 5 early investors to pocket Rs 4,340 crore, set for up to 5,135% windfall as fintech unicorn readies for listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-ipo-promoters-to-pocket-rs-40-crore-set-for-up-to-4950-windfall-as-fintech-unicorn-readies-for-listing/articleshow/124938092.cms",
            "description": "Early backers of online brokerage Groww are set to realize substantial gains from its upcoming IPO, with investors like Peak XV Partners and Y Combinator collectively pocketing around Rs 4,340 crore. The fintech giant is preparing for one of India's most anticipated public offerings, aiming for an $8 billion valuation.",
            "pubDate": "2025-10-30T11:37:08.885430"
        },
        {
            "title": "Dr. Reddy’s Laboratories shares slide 6% on receiving non-compliance notice on Semaglutide filing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-laboratories-shares-slide-6-on-receiving-non-compliance-notice-on-semaglutide-filing/articleshow/124937553.cms",
            "description": "Dr. Reddy’s Laboratories shares declined over 5% after receiving a Notice of Non-Compliance from Canada’s Pharmaceutical Drugs Directorate for its Semaglutide Injection, though analysts see the issue as temporary.",
            "pubDate": "2025-10-30T11:37:08.885528"
        },
        {
            "title": "Ixigo parent Le Travenues Technology shares plunge 19% after reporting net loss in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ixigo-parent-le-travenues-technology-shares-plunge-19-after-reporting-net-loss-in-q2/articleshow/124936901.cms",
            "description": "Ixigo’s shares fell nearly 19% after reporting a Q2 net loss of Rs 3.4 crore, despite robust 37% revenue growth and higher margins. Prosus invested Rs 1,295 crore recently.",
            "pubDate": "2025-10-30T11:37:08.885624"
        },
        {
            "title": "HPCL shares rise 2% to hit fresh 52-week high as Q2 PAT skyrockets to Rs 3,859 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hpcl-shares-rise-2-to-hit-fresh-52-week-high-as-q2-pat-skyrockets-to-rs-3859-crore/articleshow/124935600.cms",
            "description": "Hindustan Petroleum Corporation Ltd (HPCL) shares hit a new 52-week high after reporting a stellar Q2 FY26 performance, with consolidated PAT soaring 2,598% YoY to Rs 3,859 crore. Strong refining margins, record throughput, and robust sales growth drove the performance. The board also announced an interim dividend of Rs 5 per share, with November 6 as the record date.",
            "pubDate": "2025-10-30T11:37:08.885718"
        },
        {
            "title": "Two Trades for Today: An IT services company for a 5.25% upmove, a realty sector stock for close to 5.1% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-it-services-company-for-a-5-25-upmove-a-realty-sector-stock-for-close-to-5-1-gain/articleshow/124959042.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-30T15:36:37.255766"
        },
        {
            "title": "Hyundai Motor India Q2 profit rises 14% to Rs 1,572 crore on strong exports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-q2-profit-rises-14-to-rs-1572-crore-on-strong-exports/articleshow/124957412.cms",
            "description": "Hyundai Motor India reported a 14.3% YoY rise in Q2 FY26 net profit to Rs 1,572.3 crore, driven by strong exports, robust SUV sales, and cost optimisation. Revenue grew 1.2% to Rs 17,460.8 crore, while EBITDA margins improved to 13.9%.",
            "pubDate": "2025-10-30T15:36:37.256044"
        },
        {
            "title": "Larsen & Toubro, Hindalco among 11 stocks that hit 52-week highs and gained up to 22% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/larsen-amp-toubro-hindalco-among-11-stocks-that-hit-52-week-highs-and-gained-up-to-22-in-a-month/slideshow/124955198.cms",
            "description": "On Thursday, the benchmark Sensex dropped about 593 points, closing at 84,404. Despite the market decline, 11 stocks from the BSE 100 Index reached their 52-week highs — their highest levels in a year. These breakouts are often viewed by traders and investors as bullish indicators, reflecting strong upward momentum and the possibility of further gains.",
            "pubDate": "2025-10-30T15:36:37.256278"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124957101.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-10-30T15:36:37.256489"
        },
        {
            "title": "RIL block deal: BofA buys over 2.9 lakh shares worth Rs 44 crore in Reliance Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-block-deal-bofa-buys-over-2-9-lakh-shares-worth-rs-44-crore-in-reliance-industries/articleshow/124957223.cms",
            "description": "Bank of America acquired a Rs 44 crore stake in Reliance Industries through a block deal at Rs 1,475.5 per share, slightly below market price. Meanwhile, RIL reported a 10% YoY profit rise to Rs 18,165 crore and announced free Google AI Pro access for Jio users.",
            "pubDate": "2025-10-30T15:36:37.256691"
        },
        {
            "title": "Shares of Facebook parent Meta dive 11% on disappointing results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meta-seeks-at-least-25-billion-from-bond-offering-bloomberg-reports/articleshow/124956244.cms",
            "description": "Shares of Facebook parent Meta plunged more than 11 percent early Thursday after third-quarter profits missed analyst expectations.",
            "pubDate": "2025-10-30T15:36:37.256872"
        },
        {
            "title": "Sebi extends timeline for new derivatives norms on Bank Nifty, Bankex, FinNifty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-allows-nifty-bank-to-be-restructured-by-march-2026/articleshow/124956110.cms",
            "description": "Sebi has extended the deadline for implementing new eligibility norms for derivatives on non-benchmark indices like Bank Nifty to October 30, 2025. This allows for a phased adjustment of constituent weights, with Bank Nifty rebalancing until March 31, 2026. Additionally, Sebi has postponed the timeline for Qualified Stock Brokers to implement optional T+0 settlement systems, acknowledging system readiness challenges.",
            "pubDate": "2025-10-30T15:36:37.257074"
        },
        {
            "title": "US stocks trade lower after mixed tech earnings, Fed comments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-after-mixed-tech-earnings-fed-comments/articleshow/124955503.cms",
            "description": "Wall Street's main stock indexes opened lower on Thursday after mixed earnings reports from large technology firms and comments from Federal Reserve Chair Jerome Powell sowed doubts about further rate cuts this year.",
            "pubDate": "2025-10-30T15:36:37.257247"
        },
        {
            "title": "UPDATE 3-Fox's ad strength fuels quarterly revenue growth, announces $1.5 billion share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/update-3-foxs-ad-strength-fuels-quarterly-revenue-growth-announces-1-5-billion-share-buyback/articleshow/124955243.cms",
            "description": "FOX-RESULTS/ (UPDATE 3, PIX)UPDATE 3-Fox's ad strength fuels quarterly revenue growth, announces $1.5 billion share buyback",
            "pubDate": "2025-10-30T15:36:37.257437"
        },
        {
            "title": "Sebi to give more time to QSBs for implementation of optional T+0 settlement cycle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-give-more-time-to-qsbs-for-implementation-of-optional-t0-settlement-cycle/articleshow/124954093.cms",
            "description": "Capital markets regulator Sebi on Thursday decided to extend the timeline for Qualified Stock Brokers (QSBs) for putting in place the necessary systems for implementation of optional T+0 settlement cycle.",
            "pubDate": "2025-10-30T15:36:37.257651"
        },
        {
            "title": "Swiggy mulls Rs 10,000 cr fund raise via QIP; board to meet on Nov 7 to take a call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-mulls-rs-10000-cr-fund-raise-via-qip-board-to-meet-on-nov-7-to-take-a-call/articleshow/124951796.cms",
            "description": "Swiggy is planning to raise Rs 10,000 crore through a qualified institutional placement to strengthen growth capital and strategic flexibility. The move comes amid intensifying competition and follows a wider quarterly loss of Rs 1,092 crore due to higher expenses.",
            "pubDate": "2025-10-30T15:36:37.257837"
        },
        {
            "title": "Market Trading Guide: Buy GMR Airports, Oil India on Friday for up to 10% upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-gmr-airports-oil-india-on-friday-for-up-to-10-upside-potential/slideshow/124959839.cms",
            "description": "India’s heartbeat index Nifty ended with cuts amid selling pressure in key sectors like banking, auto and IT. Bears remained at the helm as Nifty bulls stayed on the sidelines following a slightly less dovish Fed commentary. Commenting on the current Rupak De, Senior Technical Analyst at LKP Securities said that the short-term trend remains up, with the index trading well above its short-term moving average. “A minor extension of the correction cannot be ruled out. On Friday, if Nifty sustains below 25,900–25,950, it may test 25,800 or lower. On the other hand, a decisive move above 25,950 could provide much-needed strength to the bulls,” De said.Here are 4 stock recommendations for Friday:",
            "pubDate": "2025-10-30T15:48:40.038761"
        }
    ]
}