{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-10T13:31:02.376586",
    "items": [
        {
            "title": "Sebi gets power to directly remove false stock content",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-gets-power-to-directly-remove-false-stock-content/articleshow/125880023.cms",
            "description": "The Securities & Exchange Board of India (Sebi) has been empowered by the government to order social media platforms to remove unlawful stock-related content. This directive, issued by the finance ministry, aims to combat misleading information spread by financial influencers and other entities. The move addresses the growing concern over content scrutiny as millions invest in the stock market.",
            "pubDate": "2025-12-10T01:05:27.069603"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125873836.cms",
            "description": "Indian stock markets experienced a sharp downturn on Tuesday. The Nifty index fell by 120 points, reflecting ongoing market volatility. Foreign portfolio investors were net sellers, while domestic institutional investors bought shares. The Indian Rupee strengthened against the US dollar. Analysts suggest the market trend may remain weak in the short term.",
            "pubDate": "2025-12-10T01:05:27.069733"
        },
        {
            "title": "Stocks in news: IndiGo, JSW Energy, Nalco, Swiggy, Kaynes Tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indigo-jsw-energy-nalco-swiggy-kaynes-tech/articleshow/125873695.cms",
            "description": "Markets closed with a nearly 0.5% cut on weekly expiry day amidst mixed cues, with the benchmark index showing pressure while broader markets, especially mid- and small-caps, experienced significant erosion. Analysts suggest Nifty faces crucial support near 25,800, with a breakdown potentially leading to 25,650, while 26,000–26,200 acts as a hurdle.",
            "pubDate": "2025-12-10T01:05:27.069847"
        },
        {
            "title": "Amit Rathi offloads Anand Rathi Wealth shares worth Rs 560 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amit-rathi-offloads-anand-rathi-wealth-shares-worth-rs-560-cr/articleshow/125879949.cms",
            "description": "Amit Rathi divested shares of Anand Rathi Wealth valued at Rs 560 crore through a bulk deal on NSE. He sold 20 lakh shares at Rs 2,800.03 each, reducing his stake by 2.4%. The company's shares saw a marginal increase of 0.6% on Tuesday.",
            "pubDate": "2025-12-10T01:05:27.069946"
        },
        {
            "title": "Energy, telecom continue to draw foreign flows in Nov",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/energy-telecom-continue-to-draw-foreign-flows-in-nov/articleshow/125879911.cms",
            "description": "Foreign investors injected significant capital into India's energy and telecom sectors in the latter half of November, continuing a trend from earlier in the month and October. While telecom saw substantial inflows, the oil and gas sector also attracted considerable investment. Conversely, FMCG and automobile sectors experienced outflows as investors booked profits and re-evaluated high valuations.",
            "pubDate": "2025-12-10T01:05:27.070045"
        },
        {
            "title": "ARCs seek pass-through for alternative investment funds' security receipts income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/arcs-seek-pass-through-for-alternative-investment-funds-security-receipts-income/articleshow/125879974.cms",
            "description": "Asset reconstruction companies (ARCs) are on the frontlines, lobbying for a pass-through tax designation for alternative investment funds (AIFs) that invest in security receipts (SRs). They believe the current tax bracket of 42.74% is stifling potential investors, proposing instead that SR income be taxed directly in the hands of the end investors.",
            "pubDate": "2025-12-10T01:05:27.070268"
        },
        {
            "title": "RBI wants groups to untie their NBFC knots",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-wants-groups-to-untie-their-nbfc-knots/articleshow/125879964.cms",
            "description": "The Reserve Bank of India is urging large business groups to consolidate their non-banking finance and investment companies. This move aims to simplify structures for better risk assessment and regulatory oversight. Groups with multiple NBFCs, especially those with overlapping businesses, are being advised to merge entities.",
            "pubDate": "2025-12-10T01:05:27.070361"
        },
        {
            "title": "RBI governor Sanjay Malhotra urges banks to use tech and trim costs in easing cycle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-governor-sanjay-malhotra-urges-banks-to-use-tech-and-trim-costs-in-easing-cycle/articleshow/125879885.cms",
            "description": "RBI Governor Sanjay Malhotra met bank chief executives, emphasizing that rate cuts and technology adoption should lower costs and boost efficiency for sustainable growth and financial inclusion. He also urged banks to enhance digital fraud safeguards and improve customer service by reducing grievances and strengthening internal systems.",
            "pubDate": "2025-12-10T01:05:27.070455"
        },
        {
            "title": "BlackRock unit to invest Rs 3000 crore in Grasim Arm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-renewables-secures-up-to-3000-crore-investment-from-global-infrastructure-partners/articleshow/125879987.cms",
            "description": "Aditya Birla Renewables Limited (ABREN) secured up to ₹3,000 crore from Global Infrastructure Partners (GIP), now part of BlackRock. This significant investment values ABREN at approximately ₹14,600 crore and will fuel its expansion to over 10 GW of renewable energy capacity across India.",
            "pubDate": "2025-12-10T01:05:27.070734"
        },
        {
            "title": "Finance Ministry increases foreign investment limit in AU Small Finance Bank to 74%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/finance-ministry-increases-foreign-investment-limit-in-au-small-finance-bank-to-74/articleshow/125880032.cms",
            "description": "The Finance Ministry has raised the foreign investment cap in AU Small Finance Bank to 74% from 49%, requiring prior approval for FDI. This move aims to provide ample room for foreign investment through permissible channels. Foreign portfolio investors held 34.5% of the bank's shares as of September 30.",
            "pubDate": "2025-12-10T01:05:27.070830"
        },
        {
            "title": "India's worst smallcap crash in 7 years begs the question: Will 2026 be even worse?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-worst-smallcap-crash-in-7-years-begs-the-question-will-2026-be-even-worse/articleshow/125881971.cms",
            "description": "India's smallcap market experienced its worst crash in seven years, down 9.45% in 2025 after surging in prior years. This reversal stems from earnings disappointments, expensive valuations, and a liquidity shift towards safer largecaps, raising concerns for future returns.",
            "pubDate": "2025-12-10T04:23:54.116699"
        },
        {
            "title": "Sensex jumps 200 pts, Nifty above 25,850 ahead of Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-200-pts-nifty-above-25850-ahead-of-fed-rate-decision/articleshow/125881803.cms",
            "description": "Indian stock markets opened on a positive note today. The Sensex and Nifty have ended a two-day decline. Investors are proceeding with caution. This comes ahead of a significant U.S. Federal Reserve rate decision scheduled for later tonight. The markets are awaiting further direction.",
            "pubDate": "2025-12-10T04:23:54.116809"
        },
        {
            "title": "JSW Energy among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-energy-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/125881534.cms",
            "description": "On December 9, open interest increased noticeably across five F&O names, indicating a buildup in unexpired contracts. A rise in futures OI typically signals traders initiating fresh positions or widening existing exposure, often suggesting improving conviction over near-term price direction.",
            "pubDate": "2025-12-10T04:23:54.116916"
        },
        {
            "title": "Buy, Sell or Hold: Analysts spot multi-year growth drivers in RBL Bank, Neuland Laboratories and JSW Infrastructure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-analysts-spot-multi-year-growth-drivers-in-rbl-bank-neuland-laboratories-and-jsw-infrastructure/articleshow/125881766.cms",
            "description": "Brokerages are positive on RBL Bank, Neuland Laboratories, and JSW Infrastructure. Motilal Oswal sees strong growth for RBL Bank, driven by a potential Emirates NBD investment. Nuvama favors Neuland Laboratories for its growth in custom manufacturing and complex APIs. JSW Infrastructure's recent acquisitions are expected to boost earnings. These companies show strong growth potential.",
            "pubDate": "2025-12-10T04:23:54.117013"
        },
        {
            "title": "AU Small Finance Bank shares in focus as govt increases foreign investment limit to 74%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-bank-shares-in-focus-as-govt-increases-foreign-investment-limit-to-74/articleshow/125881660.cms",
            "description": "Shares of AU Small Finance Bank are set to remain in focus after the Ministry of Finance approved raising the foreign investment limit from 49% to 74%. The move allows greater foreign participation, enhancing capital-raising potential while ensuring regulatory compliance under FDI and FEMA rules. Shares closed 1.9% higher at Rs 971.10.",
            "pubDate": "2025-12-10T04:23:54.117109"
        },
        {
            "title": "Nalco, Dilip Buildcon shares in focus after securing Rs 423/ton, 25-year mining contract",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nalco-dilip-buildcon-shares-in-focus-after-securing-rs-423/ton-25-year-mining-contract/articleshow/125881604.cms",
            "description": "NALCO awarded a 25-year Mine Developer and Operator (MDO) contract for the Pottangi Bauxite Mines to Dilip Buildcon at a base charge of Rs 423 per ton; both companies' shares will be in focus. The project includes developing the mine, an Overland Conveyor Corridor (OLCC), and allied infrastructure. Dilip Buildcon secured the contract as the L-1 bidder.",
            "pubDate": "2025-12-10T04:23:54.117210"
        },
        {
            "title": "Delhivery and 5 other stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/delhivery-and-5-other-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/125881474.cms",
            "description": "On December 9, six stocks from the Nifty500 pack appeared on the bullish White Marubozu scanner, according to StockEdge’s technical scan data. A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest for the period and the closing price is the highest.The pattern, represented by a long white (or green) candlestick with no upper shadow and little to no lower shadow, signals strong buying pressure throughout the session. Traders often view it as an indication that buyers were in control from start to finish, using it to make informed decisions about potential future price movements.Stocks on the White Marubozu scanner:",
            "pubDate": "2025-12-10T04:23:54.117311"
        },
        {
            "title": "Hindustan Zinc shares rally over 4% as silver prices hit record high on US Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-as-silver-prices-hit-record-high-on-us-fed-rate-cut-hopes/articleshow/125881380.cms",
            "description": "Hindustan Zinc shares rose on Wednesday as silver prices scaled new highs. This surge is driven by expectations of continued monetary easing by the US Federal Reserve. Supply tightness in silver is also a factor. Lower interest rates generally benefit precious metals. Hindustan Zinc is India's only pure-play silver company. Its stock is sensitive to silver price movements.",
            "pubDate": "2025-12-10T04:23:54.117423"
        },
        {
            "title": "Adani Ports and SEZ among 4 large-cap stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-and-sez-among-4-large-cap-stocks-showing-bullish-rsi-upswing/slideshow/125881408.cms",
            "description": "On December 9, four large-cap stocks appeared in the RSI Trending Up scan on stockedge.com. An RSI moving above 50 indicates strengthening momentum and is often viewed as an early uptrend trigger, providing potential buying opportunities as price strength builds.",
            "pubDate": "2025-12-10T04:23:54.117518"
        },
        {
            "title": "Pine Labs shares in focus as subsidiary launches India’s first agentic bill payment experience on ChatGPT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pine-labs-shares-in-focus-as-subsidiary-launches-indias-first-agentic-bill-payment-experience-on-chatgpt/articleshow/125881050.cms",
            "description": "Pine Labs' Setu platform has launched an \"agentic\" bill-payment experience in India, aiming to automate bill tracking and settlement to reduce consumer friction. This new tool addresses concerns about incorrect charges and missed due dates by fetching bills, spotting anomalies, and managing payments within user-defined limits.",
            "pubDate": "2025-12-10T04:23:54.117611"
        },
        {
            "title": "IndiGo shares in focus as government orders airlines to cut flights by 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-as-government-orders-airlines-to-cut-flights-by-10/articleshow/125880663.cms",
            "description": "IndiGo faces a 10% flight cut by the government. This follows thousands of cancellations due to pilot shortages. The Directorate General of Civil Aviation mandated the reduction. Other airlines are asked to increase flights. Fare caps are in place for short-haul routes. IndiGo is working to improve operations and pilot capacity.",
            "pubDate": "2025-12-10T04:23:54.117703"
        },
        {
            "title": "Adani Green sees Rs 2,178-crore block deal; TotalEnergies likely the seller",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-shares-in-focus-as-totalenergies-set-to-offload-1-5-stake-via-block-deal/articleshow/125880644.cms",
            "description": "TotalEnergies is reportedly set to offload a 1.5% stake in Adani Green Energy Ltd (AGEL) via block deals on Wednesday, December 10. The transaction involves selling approximately 2.47 crore shares at a floor price of Rs 970, potentially raising nearly Rs 2,400 crore. Jefferies is brokering the deal, which is subject to market conditions and buyer interest.",
            "pubDate": "2025-12-10T04:23:54.117796"
        },
        {
            "title": "Stocks to buy for 2026: Elara Capital initiates coverage on Safari & VIP Industries; Shriram Pistons, Biocon long term buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-elara-capital-initiates-coverage-on-safari-vip-industries-shriram-pistons-biocon-long-term-buy/slideshow/125880609.cms",
            "description": "We have collated a list of recommendations from top brokerage firms from ETNow and other sources.",
            "pubDate": "2025-12-10T04:23:54.117887"
        },
        {
            "title": "Shri Kanha Stainless shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shri-kanha-stainless-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/125880529.cms",
            "description": "Shri Kanha Stainless will list on NSE SME on December 10. The IPO saw steady retail investor response. The company manufactures stainless steel strips for various industries. Strong financial performance is reported. IPO funds will support expansion and debt repayment. The listing is expected to be driven by company fundamentals and market sentiment.",
            "pubDate": "2025-12-10T04:23:54.117973"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/125880411.cms",
            "description": "In the Nifty500 pack, 11 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 9, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-10T04:23:54.118061"
        },
        {
            "title": "S&P 500 ends slightly down as investors await Fed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-ends-slightly-down-as-investors-await-fed/articleshow/125880347.cms",
            "description": "Indian markets watched global cues as the S&P 500 closed lower. Investors braced for a hawkish stance from the US Federal Reserve even as a rate cut was expected. JPMorgan Chase's forecast of higher expenses impacted the benchmark index. Meanwhile, Treasury yields rose, adding to market jitters ahead of the Fed's policy update.",
            "pubDate": "2025-12-10T04:23:54.118151"
        },
        {
            "title": "Jefferies adds 6 stocks for 2026 in latest portfolio revamp. How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-adds-6-stocks-for-2026-in-latest-portfolio-revamp-how-many-do-you-own/slideshow/125883121.cms",
            "description": "International brokerage firm Jefferies has overhauled its India model portfolio for 2026, executing a bunch of changes in recent months as it looks to lean harder into value, laggards and sectors where earnings momentum and valuations appear most favourable. Here are 6 stocks that it added to its portfolio.",
            "pubDate": "2025-12-10T05:30:02.157052"
        },
        {
            "title": "Record shutdown, mixed signals leave US markets on edge ahead of Fed call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/record-shutdown-mixed-signals-leave-us-markets-on-edge-ahead-of-fed-call/articleshow/125882989.cms",
            "description": "The Federal Reserve’s current meeting is shaping up as one of the most contentious in years, with markets heavily pricing in a rate cut amid divided policymakers. Investor uncertainty has been fueled by a record U.S. government shutdown, mixed Fed signals, and pressure from the Trump administration for lower borrowing costs.",
            "pubDate": "2025-12-10T05:30:02.157185"
        },
        {
            "title": "Meesho shares rally 7% after bumper debut. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-rally-7-after-bumper-debut-should-you-buy-sell-or-hold/articleshow/125882931.cms",
            "description": "Meesho delivered a blockbuster debut on Dalal Street, listing with a 46% premium and climbing as much as 7% on day one. With strong subscription momentum, heavy institutional demand and bullish analyst views, the stock’s surge has left investors weighing whether to book profits, stay invested or buy more. Analysts point to Meesho’s deep penetration in value-driven markets and improving economics, but warn of rising competition and profitability challenges. Here’s what you need to know before deciding whether to buy, sell or hold.",
            "pubDate": "2025-12-10T05:30:02.157298"
        },
        {
            "title": "Trump set to finalize Fed pick; Hassett, Warsh among top contenders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-set-to-finalize-fed-pick-hassett-warsh-among-top-contenders/articleshow/125882876.cms",
            "description": "Kevin Hassett is emerging as the leading contender to succeed Jerome Powell as U.S. Federal Reserve chair. The selection comes amid political pressure from President Trump for faster rate cuts. Hassett has signaled support for further monetary easing but noted adjustments may be needed if inflation rises sharply.",
            "pubDate": "2025-12-10T05:30:02.157399"
        },
        {
            "title": "Record high for Nifty, but 3 out of 5 stocks nowhere near record high. What’s the play for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/record-high-for-nifty-but-3-out-of-5-stocks-nowhere-near-record-high-whats-the-play-for-investors/articleshow/125882800.cms",
            "description": "Despite Nifty and Sensex hitting record highs in 2025, most investors aren’t celebrating. Three out of five NSE 500 stocks remain far below their peaks, exposing a sharply narrow rally driven by a handful of largecaps. Experts advise shifting toward quality largecaps and midcaps as smallcaps continue to underperform.",
            "pubDate": "2025-12-10T05:30:02.157507"
        },
        {
            "title": "Brokerages say IndiGo’s long-term story is intact, but do technicals signal otherwise?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brokerages-say-indigos-long-term-story-is-intact-but-do-technicals-signal-otherwise/articleshow/125882448.cms",
            "description": "IndiGo's stock is experiencing a sharp decline. Technical indicators suggest a bearish trend. However, brokerages remain optimistic about the airline's long-term prospects. They cite cost advantages and market dominance. IndiGo is working towards operational recovery. Investors are watching closely for stabilization or further downside.",
            "pubDate": "2025-12-10T05:30:02.157608"
        },
        {
            "title": "Vidya Wires shares list flat at Rs 52 on BSE and NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vidya-wires-shares-list-flat-at-rs-52-on-bse-and-nse/articleshow/125882353.cms",
            "description": "Vidya Wires shares listed flat on Wednesday. The company's IPO saw strong demand from retail and HNI investors. The Rs 300-crore IPO was priced at Rs 52 per share. Vidya Wires manufactures winding wires and conductivity products. The company is expanding its manufacturing capacity. Financials show steady revenue and profit growth.",
            "pubDate": "2025-12-10T05:30:02.157709"
        },
        {
            "title": "SpiceJet shares surge nearly 20% in 4 sessions. What’s fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-surge-nearly-20-in-4-sessions-whats-fuelling-the-rally-today/articleshow/125882087.cms",
            "description": "SpiceJet shares climbed significantly on Wednesday. This rise follows IndiGo's directive to reduce its flight schedule due to pilot shortages and operational issues. IndiGo's disruptions are expected to benefit competitors like SpiceJet by opening up demand. SpiceJet also announced the induction of two new Boeing aircraft, boosting its capacity.",
            "pubDate": "2025-12-10T05:30:02.157805"
        },
        {
            "title": "Aequs shares list at 13% premium over IPO price on bourses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aequs-shares-list-at-13-premium-over-issue-price-on-bourses/articleshow/125882107.cms",
            "description": "Aequs shares listed at a 12.9% premium on the bourses on Wednesday, reflecting strong investor appetite after the IPO’s robust subscription. Despite financial volatility and losses, analysts highlight Aequs’ integrated aerospace manufacturing ecosystem, long-term customer relationships and global footprint. Proceeds will largely repay debt, aiming to ease interest costs and support a clearer path to profitability.",
            "pubDate": "2025-12-10T05:30:02.157921"
        },
        {
            "title": "Meesho shares dazzle on debut, list at 46% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-dazzle-on-debut-list-at-46-premium-over-ipo-price/articleshow/125882102.cms",
            "description": "Meesho shares surged 46% on their Dalal Street debut, listing at a significant premium to their IPO price. The strong listing followed an overwhelming subscription response, with investors showing high conviction in the e-commerce marketplace's growth potential. Despite robust revenue growth, the company faces challenges with widening net losses and achieving sustained profitability.",
            "pubDate": "2025-12-10T05:30:02.158024"
        },
        {
            "title": "Trump set to finalise Fed pick; Hassett, Warsh among top contenders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-set-to-finalise-fed-pick-hassett-warsh-among-top-contenders/articleshow/125882134.cms",
            "description": "The White House is nearing a decision on the next Federal Reserve chair, with Kevin Hassett emerging as a frontrunner. Hassett's support for further interest rate cuts aligns with President Trump's agenda. The selection process occurs amidst political pressure on the Fed's independence and ongoing policy debates.",
            "pubDate": "2025-12-10T05:30:02.158114"
        },
        {
            "title": "Rs 23,000 crore in a month: How an Asia fund became silent winner in India's hottest IPO streak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-23000-crore-in-a-month-how-an-asia-fund-became-silent-winner-in-indias-hottest-ipo-streak/articleshow/125882069.cms",
            "description": "Peak XV Partners, formerly Sequoia India, is reaping significant rewards from India's recent IPO surge. Four key portfolio companies, including Groww and Pine Labs, generated nearly Rs 23,000 crore in listing value and substantial cash gains. This success highlights the firm's strategy of early, sustained investment in high-growth ventures, bolstering its distribution track record.",
            "pubDate": "2025-12-10T05:30:02.158212"
        },
        {
            "title": "Aequs shares gain 8% after listing at 13% premium over IPO price. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aequs-shares-gain-8-after-listing-at-13-premium-over-ipo-price-should-you-buy-sell-or-hold/articleshow/125883275.cms",
            "description": "Aequs shares rallied post-listing, extending initial gains after a strong IPO. Experts suggest a balanced strategy for allotted investors, recommending partial profit booking while holding for long-term upside. The company's integrated aerospace manufacturing and global customer base are key strengths, despite uneven financial performance.",
            "pubDate": "2025-12-10T05:45:58.417694"
        },
        {
            "title": "Tourism stocks' up to 46% crash in 6 months has two new villains - rupee & IndiGo. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tourism-stocks-up-to-46-crash-in-6-months-has-two-new-villains-rupee-indigo-what-should-investors-do/articleshow/125883565.cms",
            "description": "Tourism stocks have slumped up to 46% in six months, hit by rupee weakness and IndiGo’s flight disruptions. Analysts see the downturn as short-term, advising investors to stay selective, focus on strong sector leaders, and explore opportunities like Ixigo, while monitoring operational recovery and currency-related pressures.",
            "pubDate": "2025-12-10T06:17:35.350713"
        },
        {
            "title": "Ola Electric shares fall 60% in 2025 as FIIs trim holding, promoters pledge stake in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-fall-60-in-2025-as-fiis-trim-holding-promoters-pledge-stake-in-q2/articleshow/125883494.cms",
            "description": "Ola Electric's stock has seen a significant drop this year. Shares have fallen sharply, reaching a new low. Foreign investors have reduced their stake, while Indian mutual funds have increased theirs. The company continues to report losses and declining sales. Promoters have also pledged some of their shares.",
            "pubDate": "2025-12-10T06:17:35.350839"
        },
        {
            "title": "Fed braces for turbulent 2026 as leadership shake-up looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-braces-for-turbulent-2026-as-leadership-shake-up-looms/articleshow/125882876.cms",
            "description": "The Federal Reserve faces a turbulent 2026 with leadership changes, a shifting political climate, and increased scrutiny potentially challenging its independence. Key personnel decisions, including the naming of a new Chair and the outcome of Governor Lisa Cook's legal battle, will shape the central bank's direction. Regional Fed presidents are also under the spotlight as their reappointments approach.",
            "pubDate": "2025-12-10T06:17:35.351361"
        },
        {
            "title": "Japan's Topix index touches record high in tentative trade before Fed, BOJ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-topix-index-touches-record-high-in-tentative-trade-before-fed-boj/articleshow/125885294.cms",
            "description": "Japan's Topix stock index reached an unprecedented high on Wednesday before paring gains. Investors are closely watching central bank decisions in Japan and the United States. A weaker yen boosted Japanese automakers like Honda and Toyota. The market's direction hinges on the continuing depreciation of the yen.",
            "pubDate": "2025-12-10T07:34:11.017354"
        },
        {
            "title": "F&O Radar | Deploy Bear Put Spread in Nifty to play a volatile market amid bearish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bear-put-spread-in-nifty-to-play-a-volatile-market-amid-bearish-signals/articleshow/125885014.cms",
            "description": "Nifty remained weak, breaking 25,750 support and closing lower despite a brief recovery. Analysts see further downside while it trades below 25,900, with resistance near 26,000–26,150. Option data signals resistance overhead and support around 25,400–25,800. Experts recommend a Bear Put Spread strategy to benefit from expected short-term volatility and weakness.",
            "pubDate": "2025-12-10T07:34:11.017474"
        },
        {
            "title": "Australian shares edge lower as rate hike concerns loom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-edge-lower-as-rate-hike-concerns-loom/articleshow/125884701.cms",
            "description": "Australian shares closed marginally lower as caution over a higher-for-longer interest rate outlook and the upcoming U.S. Fed decision weighed on sentiment. Miners provided some support, but losses in financials, real estate, and technology sectors led the broader market down. Investors await the U.S. Federal Reserve's policy announcement for further direction.",
            "pubDate": "2025-12-10T07:34:11.017677"
        },
        {
            "title": "Vidya Wires shares gain 12% after flat market debut. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vidya-wires-shares-gain-12-after-flat-market-debut-what-should-investors-do/articleshow/125884655.cms",
            "description": "Vidya Wires shares surged 12% after a flat debut, listing at its IPO price of Rs 52. The Rs 300-crore IPO saw strong demand, with investors advised to hold for medium to long term, especially if capacity utilization and margins improve. The company benefits from growing power sector investments and a diversified product portfolio.",
            "pubDate": "2025-12-10T07:34:11.017776"
        },
        {
            "title": "Kaynes Technology shares slide 8% post one-day relief rally, now down 25% in a week. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-shares-slide-6-one-day-relief-rally-now-down-23-in-a-week-should-you-buy-sell-or-hold/articleshow/125884568.cms",
            "description": "Kaynes Technology slipped 8% on Wednesday, reversing yesterday’s brief rebound and extending a bruising week-long slide triggered by governance concerns and fresh caution from Kotak Securities. With the stock now down 25% in a week and 46% this year, investors are weighing whether the correction offers value or signals deeper structural risks, as analysts flag fragile technicals, elevated working capital and unresolved disclosure issues.",
            "pubDate": "2025-12-10T07:34:11.017874"
        },
        {
            "title": "US stock market in 2025: A volatile year led by tech and AI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-market-in-2025-a-volatile-year-led-by-tech-and-ai/articleshow/125884649.cms",
            "description": "The US stock market in 2025 experienced significant ups and downs. Technology and AI companies led the charge, driving major indices to strong year-end gains. Despite initial fears of trade wars, the market recovered quickly. Investors are advised to focus on diversification and long-term discipline as global trends continue to influence markets.",
            "pubDate": "2025-12-10T07:34:11.017970"
        },
        {
            "title": "Fed likely to cut interest rate by 25 bps in 2025’s final policy - what it means for Indian markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-likely-to-cut-interest-rate-by-25-bps-in-2025s-final-policy-what-it-means-for-indian-markets/articleshow/125884379.cms",
            "description": "The US Federal Reserve is widely expected to announce a 25 bps rate cut on Wednesday, its final policy decision of the year. Policymakers face the challenge of balancing a weakening labor market and tariff-driven inflation against a resilient economy, with key economic data delayed due to the government shutdown.",
            "pubDate": "2025-12-10T07:34:11.018066"
        },
        {
            "title": "Meesho shares get first rating post listing, analysts see 80% upside from IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-get-first-rating-post-listing-analysts-see-80-upside-from-ipo-price/articleshow/125884215.cms",
            "description": "Newly listed Meesho received its first analyst rating, with Choice Institutional Equities initiating coverage with a BUY call and Rs 200 target. The brokerage expects strong revenue growth, improving unit economics and a faster path to profitability, while highlighting COD dependence, logistics complexity and competitive pressure as key execution risks.",
            "pubDate": "2025-12-10T07:34:11.018175"
        },
        {
            "title": "European shares slip on caution ahead of Fed decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-slip-on-caution-ahead-of-fed-decision/articleshow/125886500.cms",
            "description": "European shares inched lower on Wednesday, as investors refrained from placing big bets ahead of the U.S. Federal Reserve's interest rate decision, while also parsing through a slate of corporate updates.",
            "pubDate": "2025-12-10T08:45:48.286319"
        },
        {
            "title": "Market Wrap: Sensex down 275 points, Nifty below 25,800 ahead of Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-down-275-points-nifty-below-25800-ahead-of-fed-rate-decision/articleshow/125888527.cms",
            "description": "The S&P BSE Sensex declined 275 points, or 0.32%, to end at 84,391.27, while the NSE Nifty 50 shed 82 points, or 0.32%, closing at 25,758.",
            "pubDate": "2025-12-10T10:45:53.987007"
        },
        {
            "title": "11 stocks surge over 50% in 3 months, 3 become multibaggers — Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-stocks-surge-over-50-in-3-months-3-become-multibaggers-do-you-own-any/slideshow/125888115.cms",
            "description": "Indian equities have been volatile over the past three months, with the benchmark index edging up 4.5%, midcaps staying flat and smallcaps slipping nearly 5%. Yet beneath the turbulence, 11 high-momentum stocks have surged more than 50%, including three that doubled investor wealth. The analysis filters for meaningful movers with market caps above Rs 2,500 crore and strong trading volumes.",
            "pubDate": "2025-12-10T10:45:53.987138"
        },
        {
            "title": "Chaos at airports is also a reflection of … : 11 stocks from the tourism & hospitality space with upside potential of up to 33%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chaos-at-airports-is-also-a-reflection-of-11-stocks-from-the-tourism-hospitality-space-with-upside-potential-of-up-to-33/articleshow/125886816.cms",
            "description": "Sometimes, unusual events give us a sense of the underlying situation in a sector. Yes, there is still chaos at airports because of the large-scale cancellations by Indigo due to pilot shortages sparked, ostensibly, by new norms set by the aviation regulator. While the debate about who is to blame will continue, does the chaos tell us something about the tourism and hospitality sector, whose larger ecosystem also includes airlines? Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks, along with detailed company analysis focusing on five key components – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2025-12-10T10:45:53.987242"
        },
        {
            "title": "US Fed FOMC Meeting: Powell's speech live time, date, expectations & where to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-fomc-meeting-powells-speech-live-time-date-expectations-where-to-watch/articleshow/125886797.cms",
            "description": "US Fed December 2025 Meet: The US Federal Reserve has begun its two-day policy meeting, with the rate decision due Wednesday. After a 25 bps cut in October that brought rates to 3.75%–4.00%, global markets are watching to see if the Fed continues easing, as any move will influence borrowing costs and capital flows worldwide.",
            "pubDate": "2025-12-10T10:45:53.987362"
        },
        {
            "title": "Temasek, top funds bid in Swiggy’s $1.1 billion share sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/temasek-top-funds-bid-in-swiggys-1-1-billion-share-sale/articleshow/125889218.cms",
            "description": "Global investors including Temasek and Capital Group, along with major Indian asset managers such as SBI MF, ICICI Prudential, and HDFC AMC, have placed bids to buy shares in Swiggy as the company seeks fresh funding a year after its listing. Other global players like Fidelity, BlackRock, and Nomura have also participated in the $1.1 billion offer.",
            "pubDate": "2025-12-10T10:57:38.171028"
        },
        {
            "title": "Stock Radar: Bharti Airtel stock down by about 4% from November 2025 highs; time to buy – what does history tell us?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-bharti-airtel-stock-down-by-about-4-from-november-2025-highs-time-to-buy-what-does-history-tell-us/articleshow/125867945.cms",
            "description": "Bharti Airtel stock shows potential for a rebound. Experts suggest short-term traders can buy for a possible rise towards 2,200 in the coming months. The stock has shown resilience, trading above key moving averages. Past patterns indicate a tendency to bottom out after corrections. Technical indicators reinforce a bullish outlook, suggesting an upward trajectory is likely.",
            "pubDate": "2025-12-10T11:44:11.257511"
        },
        {
            "title": "Kaynes Tech selloff spills to Dixon Tech, Amber, PG Electroplast as shares fall up to 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-tech-selloff-spills-to-dixon-tech-amber-pg-electroplast-as-shares-fall-up-to-9/articleshow/125889618.cms",
            "description": "Shares of EMS companies Dixon, Amber, and PG Electroplast declined sharply on Wednesday, tracking the fall in Kaynes Technology and extending the sector’s recent weakness. Dixon led the slide, plunging over 9% intraday—its biggest drop since January—before ending down more than 8%, with trading volumes surging to over triple the 20-day average.",
            "pubDate": "2025-12-10T11:44:11.257635"
        },
        {
            "title": "Looking for least expensive stocks? Here are top 5 with lowest price-to-earnings ratio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/looking-for-least-expensive-stocks-here-are-top-5-with-lowest-price-to-earnings-ratio/slideshow/125888342.cms",
            "description": "Are you searching for the least expensive stocks? Here are the top five stocks with the lowest price-to-earnings ratios, as reported by ETWealth. (Data as of December 4, 2025)",
            "pubDate": "2025-12-10T11:44:11.257741"
        },
        {
            "title": "Nifty can cross 32K in 2026 bull case scenario: Kotak Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-can-cross-32k-in-2026-bull-case-scenario-kotak-securities/articleshow/125889395.cms",
            "description": "In a recent note, domestic brokerage firm Kotak Securities has projected a bull case target of 32,032 for the Nifty 50 index by December 2026, suggesting meaningful upside potential from current levels, highlighting a preference for BFSI, and IT sectors, among others.",
            "pubDate": "2025-12-10T11:44:11.257837"
        },
        {
            "title": "AI bubble or euphoria? Howard Marks warns you not to bet the house on future",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-bubble-or-euphoria-howard-marks-warns-you-not-to-bet-the-house-on-future/articleshow/125890304.cms",
            "description": "Howard Marks says AI may be a transformational “inflection bubble,” urging investors to avoid going all-in or all-out. He highlights soaring valuations, circular financing, rising leverage, speculative behaviour and past bubble patterns, advising moderation, prudence and selective exposure amid massive uncertainty.",
            "pubDate": "2025-12-10T11:52:09.403255"
        },
        {
            "title": "US Fed expected to cut rates, but may signal a coming pause",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-expected-to-cut-rates-but-may-signal-a-coming-pause/articleshow/125891504.cms",
            "description": "The U.S. Federal Reserve is expected to cut interest rates on Wednesday as policymakers grapple with gaps in economic data caused by the recent government shutdown and work through competing views about the risks facing the economy.",
            "pubDate": "2025-12-10T13:31:00.457837"
        },
        {
            "title": "Adani Enterprises' Rs 25,000 cr rights issue gets strong response with 108% subscription",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-rs-25000-cr-rights-issue-gets-strong-response-with-108-subscription/articleshow/125891119.cms",
            "description": "Adani Enterprises’ Rs 25,000 crore rights issue closed with strong demand, ending at 108% subscription. The public portion was even stronger at 130% subscribed. Priced at Rs 1,800 per share, the issue will help the company reduce debt and fund capex across airports, data centres, green hydrogen and other growth businesses.",
            "pubDate": "2025-12-10T13:31:00.457965"
        },
        {
            "title": "Inox Wind, Dixon Tech, 7 other stocks hit 52-week lows & slip up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-dixon-tech-7-other-stocks-hit-52-week-lows-amp-slip-up-to-20-in-a-month/slideshow/125890881.cms",
            "description": "On Wednesday, the benchmark Sensex fell sharply by about 275 points, ending the session at 84,391. Amid this broader market decline, seven stocks from the BSE 500 index hit new 52-week lows. A 52-week low marks the lowest price at which a stock has traded over the past year and is often viewed by traders and investors as an important technical indicator for evaluating a stock’s current valuation and potential price movements.",
            "pubDate": "2025-12-10T13:31:00.458098"
        }
    ]
}