{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-21T05:10:00.315097",
    "items": [
        {
            "title": "Trump’s $100,000 H-1B visa fee among 7 key triggers that will steer D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-100000-h-1b-visa-fee-among-7-key-triggers-for-d-st-this-week/articleshow/124023729.cms",
            "description": "Markets brace for the impact of US President Trump’s $100,000 annual H-1B visa fee as investors watch India–US trade talks, domestic economic data, and US market trends. While FIIs remain cautious amid currency volatility, DIIs are supporting stability. Technical indicators suggest a positive bias, though short-term consolidation is likely near key resistance levels.",
            "pubDate": "2025-09-21T04:21:35.554195"
        },
        {
            "title": "H-1B fee deepens sell-off fears for already battered Indian IT stocks. What to expect on Monday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/h-1b-fee-deepens-sell-off-fears-for-already-battered-indian-it-stocks-what-to-expect-on-monday/articleshow/124023691.cms",
            "description": "Indian IT stocks came under pressure after US President Donald Trump announced a steep hike in H-1B visa fees to $100,000 per year. While the increase applies only to fresh applications, it has rattled investors given that over 70% of H-1B holders are Indians. ADRs of leading IT firms plunged immediately, underscoring the sector’s vulnerability.",
            "pubDate": "2025-09-21T04:21:35.554328"
        },
        {
            "title": "Top 19 high-conviction stocks from Choice Broking offer up to 35% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-19-high-conviction-stocks-from-choice-broking-offer-up-to-35-upside/slideshow/124024067.cms",
            "description": "The Indian equity markets continue to show resilience, supported by strong domestic inflows, stable macroeconomic indicators, and pro-consumption regulatory measures.While valuations remain elevated in certain pockets, select stocks still offer meaningful upside, particularly in sectors with structural growth drivers. In this context, Choice Broking has identified 19 high-conviction investment ideas across nine sectors, with upside potential of up to 35% from current levels.",
            "pubDate": "2025-09-21T05:09:59.424303"
        }
    ]
}