{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-06T14:27:22.639515",
    "items": [
        {
            "title": "APL Apollo Tubes among 5 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apl-apollo-tubes-among-5-stocks-closed-crossing-above-vwap/slideshow/126365017.cms",
            "description": "On January 5, the closing prices of five stocks in the Nifty 500 pack rallied by more than 1% relative to their VWAP (Volume Weighted Average Price). A move above VWAP suggests a potential bullish trend, according to StockEdge’s technical scan data.When a stock closes above its VWAP, it indicates the closing price is higher than the average price at which it traded during the session, weighted by volume. Traders often interpret this as a bullish signal, reflecting positive market sentiment and strengthening buying interest.",
            "pubDate": "2026-01-06T03:44:16.403617"
        },
        {
            "title": "Adani Ports shares in focus after reporting 9% YoY rise in cargo volumes for December 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-shares-in-focus-after-reporting-9-yoy-rise-in-cargo-volumes-for-december-2025/articleshow/126364819.cms",
            "description": "Adani Ports shares are likely to remain in focus following the company's report of steady growth in December cargo volumes, driven by strong container traffic. While logistics volumes showed mixed trends, year-to-date performance remained resilient. The stock has delivered solid annual returns, despite mild near-term pressure.",
            "pubDate": "2026-01-06T03:44:16.403752"
        },
        {
            "title": "Multibagger largecap stock that rose 132% in 2025 in focus after strong Q3 business update. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-largecap-stock-that-rose-132-in-2025-in-focus-after-strong-q3-business-update-do-you-own/articleshow/126364776.cms",
            "description": "L&T Finance shares are poised for attention following a strong Q3FY26 business update. The company reported robust retail disbursement growth of 49% year-on-year, reaching Rs 22,690 crore, and a 21% increase in its retail loan book to Rs 1,11,900 crore. This performance underscores the success of its retail-focused strategy.",
            "pubDate": "2026-01-06T03:44:16.403857"
        },
        {
            "title": "Trent shares in focus on posting 17% YoY increase in standalone revenue in Q3 update",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-shares-in-focus-on-posting-17-yoy-increase-in-standalone-revenue-in-q3-update/articleshow/126364785.cms",
            "description": "Trent shares are set to remain in focus after the Tata Group retailer reported a year-on-year rise in December-quarter revenue, supported by Zudio’s continued expansion. While long-term stock performance remains weak, recent gains and improving technical indicators suggest short-term recovery signs amid steady operational momentum.",
            "pubDate": "2026-01-06T03:44:16.403964"
        },
        {
            "title": "SAIL shares in focus as December sales hit record, rise 37% year-on-year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sail-shares-in-focus-as-december-sales-hit-record-rise-37-year-on-year/articleshow/126364693.cms",
            "description": "SAIL shares are in focus after the state-owned steelmaker posted its best-ever December sales, with volumes rising 37% year-on-year to 2.1 million tonnes, helped by strong domestic demand, higher exports and a supportive policy backdrop.",
            "pubDate": "2026-01-06T03:44:16.404071"
        },
        {
            "title": "Tourism Finance Corporation of India and 4 other stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tourism-finance-corporation-of-india-and-4-other-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126364620.cms",
            "description": "On January 5, five stocks from the NSE universe with a market capitalisation exceeding Rs 1,000 crore appeared on the bullish “White Marubozu” scanner, according to StockEdge’s technical scan data. A White Marubozu is a bullish candlestick pattern formed when the opening price is the session’s low and the closing price is the high.Depicted by a long white or green candlestick with no upper shadow and a small or non-existent lower shadow, the pattern highlights sustained buying pressure throughout the session. Traders often view it as a sign of strong buyer control and use it to assess potential future price direction.",
            "pubDate": "2026-01-06T03:44:16.404171"
        },
        {
            "title": "ICICI Bank among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-among-4-stocks-showing-bullish-rsi-upswing/slideshow/126364532.cms",
            "description": "On January 5, four stocks from the Nifty50 index featured in the RSI Trending Up scan, based on data from StockEdge. An RSI move above 50 from lower levels is considered an uptrend signal, indicating strengthening price momentum and growing bullish interest, often tracked by traders to spot potential buying opportunities.",
            "pubDate": "2026-01-06T03:44:16.404288"
        },
        {
            "title": "Kotak Mahindra Bank shares in focus after Q3 update shows 16% YoY growth in net advances",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-after-q3-update-shows-16-yoy-growth-in-net-advances/articleshow/126364450.cms",
            "description": "Kotak Mahindra Bank shares will be in focus after a strong operational update for the December 2025 quarter. Net advances rose 16% year-on-year to Rs 4.8 lakh crore. Total deposits also saw robust growth, increasing 15% year-on-year to Rs 5.43 lakh crore. CASA deposits showed a 12% annual rise.",
            "pubDate": "2026-01-06T03:44:16.404386"
        },
        {
            "title": "IndusInd Bank shares in focus after Q3 update reveals 13% YoY drop in advances",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-after-q3-update-reveals-13-yoy-drop-in-advances/articleshow/126364427.cms",
            "description": "IndusInd Bank's shares are in focus after its Q3 FY26 operational update. The bank reported a 13% year-on-year drop in its loan book for the December 2025 quarter. Deposits saw a sequential rise, but the low-cost CASA ratio continued to decline. This indicates a shift towards higher-yielding deposits. The bank's focus is on balance sheet stability amid subdued advance growth.",
            "pubDate": "2026-01-06T03:44:16.404483"
        },
        {
            "title": "Tata Motors PV shares in focus as JLR Q3 volumes slump after massive cyber attack",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-pv-shares-in-focus-as-jlr-q3-volumes-slump-after-massive-cyber-attack/articleshow/126364399.cms",
            "description": "Tata Motors Passenger Vehicles shares may see action. Jaguar Land Rover, its luxury arm, reported a significant drop in sales for the third quarter of FY26. A cyber attack last year disrupted production. The company also phased out old Jaguar models. Higher-priced vehicles still boosted the product mix. JLR expects operational issues to be temporary.",
            "pubDate": "2026-01-06T03:44:16.404580"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/126364054.cms",
            "description": "As of January 5, 2026, 15 Nifty500 stocks closed above their 200-day moving average (DMA). Of these, we have highlighted the top 11 that posted gains of more than 1%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2026-01-06T03:44:16.404684"
        },
        {
            "title": "Hatsun Agro: Top executive uploads draft Q3 results on WhatsApp status by mistake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hatsun-agro-top-executive-uploads-draft-q3-results-on-whatsapp-status-by-mistake/articleshow/126363981.cms",
            "description": "Hatsun Agro Product reported a corporate governance slip after draft financial data for the December quarter was accidentally shared on a senior executive's personal WhatsApp status. The figures, viewed by about 19 people including some insiders, were deleted within an hour. The company is conducting an internal inquiry and will report to exchanges.",
            "pubDate": "2026-01-06T03:44:16.404800"
        },
        {
            "title": "GIFT Nifty up 70 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126363723.cms",
            "description": "Indian markets saw a dip as Nifty closed lower due to profit booking in banking shares. Despite this, analysts anticipate a firm market with a positive outlook. Strong Q3 business updates and expectations of increased capital expenditure before the Union Budget are supporting this view. Global geopolitical developments may introduce some volatility.",
            "pubDate": "2026-01-06T03:44:16.404895"
        },
        {
            "title": "Stocks in news: HDFC Bank, Torrent Pharma, IndusInd Bank, Trent, ONGC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hdfc-bank-torrent-pharma-indusind-bank-trent-ongc/articleshow/126363704.cms",
            "description": "Indian markets saw a slight dip on Monday, with the Nifty closing near 26,250 after a volatile trading day. Several companies like HDFC Bank, Trent, and Adani Ports reported their third-quarter updates. IndusInd Bank showed mixed results, while Axis Bank and Kotak Mahindra Bank reported growth in advances and deposits. Adani Power received a Supreme Court verdict.",
            "pubDate": "2026-01-06T03:44:16.404989"
        },
        {
            "title": "Asian stocks rise to extend record global rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-to-extend-record-global-rally/articleshow/126363690.cms",
            "description": "Asian equities advanced Tuesday, extending a global record run as investors overlooked geopolitical tensions. Gold and silver pared gains after the US captured Venezuela's President, while Treasuries steadied. Analysts remain bullish on risk assets, anticipating stronger earnings growth and a revival of M&A.",
            "pubDate": "2026-01-06T03:44:16.405084"
        },
        {
            "title": "RBI asks NBFCs, HFCs to improve standards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-asks-nbfcs-hfcs-to-improve-standards/articleshow/126363591.cms",
            "description": "Reserve Bank of India Governor Sanjay Malhotra has called upon NBFCs and HFCs to bolster their underwriting practices and prioritize customer interests for sustained growth.  This directive came during a crucial meeting with top executives from these financial institutions, emphasizing the need for robust sector confidence. The discussion also involved key industry bodies.",
            "pubDate": "2026-01-06T03:44:16.405180"
        },
        {
            "title": "Buy, Sell, or Hold? Morgan Stanley stays bullish on Trent; Motilal Oswal begins coverage on Groww",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-stays-bullish-on-trent-motilal-oswal-begins-coverage-on-groww/articleshow/126365697.cms",
            "description": "Brokerages strike a cautiously optimistic tone on retail, broking and agri stocks, flagging selective opportunities amid near-term pressures. Morgan Stanley stays positive on Trent, Motilal Oswal turns bullish on Groww citing strong growth visibility, while Nuvama maintains a Buy on AWL Agri despite a weak quarter.",
            "pubDate": "2026-01-06T04:56:19.353258"
        },
        {
            "title": "5 IPOs opening this week. GMPs suggest up to 70% listing gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-ipos-opening-this-week-gmps-suggest-up-to-70-listing-gain/slideshow/126365931.cms",
            "description": "The IPO market is off to a steady start in the new year with 5 IPOs opening this week. Early grey market signals suggest strong investor interest in select names, with indications of listing gains of up to 70% in one marquee issue.",
            "pubDate": "2026-01-06T04:56:19.353365"
        },
        {
            "title": "Rs 13,000 crore gone! Why Trent shares crashed 8% despite 17% Q3 growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-13000-crore-gone-why-trent-shares-crashed-8-despite-17-q3-growth/articleshow/126365711.cms",
            "description": "Trent shares fell sharply on Tuesday, erasing Rs 13,000 crore in market value, as investors reacted to a sharp slowdown in growth metrics. Despite 17% revenue growth, weakening same-store sales and a sustained drop in revenue per square foot signalled deteriorating productivity, overshadowing the retailer’s aggressive expansion across Zudio and Westside.",
            "pubDate": "2026-01-06T04:56:19.353461"
        },
        {
            "title": "Kotak Bank, Trent among 5 Nifty stocks with highest EPS upgrades in December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-bank-trent-among-5-nifty-stocks-with-highest-eps-upgrades-in-december/slideshow/126365671.cms",
            "description": "The last year has been a mixed phase for the equity markets. Between December 2024 and December 2025, the Nifty delivered returns of 8.3%, even as earnings expectations weakened. FY26E and FY27E EPS estimates were cut by 7.8% and 6.5% over the past 12 months. However, December 2025 marked a small but important shift. EPS estimates for FY26E and FY27E rose 0.3% and 0.5% month-on-month, suggesting early signs of stabilisation. Against this backdrop, a handful of stocks stood out with clear upgrades. Source: JM Financial",
            "pubDate": "2026-01-06T04:56:19.353551"
        },
        {
            "title": "Hindustan Copper shares jump 4% to 52-week high as copper hits record levels. Can rally sustain in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-jump-4-to-52-week-high-as-copper-hits-record-levels-can-rally-sustain-in-2026/articleshow/126365526.cms",
            "description": "Hindustan Copper shares have reached a new 52-week high. Global copper prices are climbing, driven by anticipated US import tariffs. This situation is pushing US copper prices higher than those on the London Metal Exchange. Experts predict copper prices will remain strong, supported by demand from sectors like AI and electric vehicles.",
            "pubDate": "2026-01-06T04:56:19.353646"
        },
        {
            "title": "Nifty breaks record high twice in 40 days. Will this rally endure or fizzle out again?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-breaks-record-high-twice-in-40-days-will-this-rally-endure-or-fizzle-out-again/articleshow/126365556.cms",
            "description": "India's Nifty has hit record highs, driven by strong earnings, domestic demand, and improving balance sheets, a shift from previous liquidity-fueled rallies. Analysts believe this up-move is anchored in firmer fundamentals, with steady profit growth expected across key sectors. While valuations are debated, domestic money flow provides a cushion against volatile foreign investor sentiment.",
            "pubDate": "2026-01-06T04:56:19.353739"
        },
        {
            "title": "4 investment themes set to drive stock market in 2026 as FII flows eye comeback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/4-investment-themes-set-to-drive-stock-market-in-2026-as-fii-flows-eye-comeback/articleshow/126365341.cms",
            "description": "Indian equity markets anticipate a cautious revival in 2026, with FII flows expected to return and corporate earnings stabilizing. Analysts foresee a gradual upward trend driven by four key investment themes: Capex, Financials, Consumption, and Auto, as macro factors align for growth.",
            "pubDate": "2026-01-06T04:56:19.353829"
        },
        {
            "title": "Sensex falls over 350 pts, Nifty below 26,200 as US tariff worries offset Q3 updates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-300-pts-nifty-below-26200-as-d-st-hovers-near-record-highs/articleshow/126365124.cms",
            "description": "Indian equities opened lower on Tuesday, with the Sensex and Nifty retreating from record highs. Investors are assessing the potential impact of new U.S. tariffs while positive quarterly business updates continue to fuel hopes for an earnings recovery.",
            "pubDate": "2026-01-06T04:56:19.353917"
        },
        {
            "title": "Groww shares gain 3% as Motilal Oswal initiates coverage with Buy rating. Here are 4 reasons",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-gain-3-as-motilal-oswal-initiates-coverage-with-buy-rating-here-are-4-reasons/articleshow/126365264.cms",
            "description": "Billionbrains Garage Ventures, the parent of Groww, saw its shares rally after Motilal Oswal initiated coverage with a Buy rating. Analysts are bullish on Groww's market share gains in broking and derivatives. The company is expanding its affluent customer base and wealth management offerings. Robust financials and attractive valuations are also key factors.",
            "pubDate": "2026-01-06T04:56:19.354007"
        },
        {
            "title": "Premier Energies among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126365074.cms",
            "description": "On January 5, futures open interest rose sharply across five F&O stocks, contributing to a cumulative increase of over 13% compared with the previous session. A surge in futures open interest indicates a build-up of active contracts, suggesting fresh positioning or expansion of existing positions and rising trader participation.",
            "pubDate": "2026-01-06T04:56:19.354113"
        },
        {
            "title": "Best performing Tata stock of 2025 may also have a strong 2026. Here’s why analysts are bullish",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/best-performing-tata-stock-of-2025-may-also-have-a-strong-2026-heres-why-analysts-are-bullish/articleshow/126366602.cms",
            "description": "Tata Steel, one of 2025’s best-performing Tata Group stocks, may extend its gains in 2026 as analysts highlight strong domestic growth, rising India volumes, supportive tariffs, and a robust expansion pipeline. Despite European challenges, improving cash flows, deleveraging, and higher earnings estimates reinforce bullish sentiment heading into the new year.",
            "pubDate": "2026-01-06T05:44:47.351443"
        },
        {
            "title": "HDFC Bank shares fall 5% in 2 days after Q3 update. Should you buy this dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-fall-5-in-2-days-after-q3-update-should-you-buy-this-dip/articleshow/126366470.cms",
            "description": "HDFC Bank shares fell for a second straight day after its Q3FY26 business update. Despite healthy growth in advances and deposits, the stock was weighed down by weak market sentiment and worries over deposit traction.",
            "pubDate": "2026-01-06T05:44:47.351566"
        },
        {
            "title": "Ola Electric shares extend rally for a fourth session on turnaround hopes; up 27% in early 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-extend-rally-for-a-fourth-session-on-turnaround-hopes-up-27-in-early-2026/articleshow/126366419.cms",
            "description": "Ola Electric shares extended their rally for a fourth consecutive session, rising over 4% to Rs 45.87 on the NSE. The surge is driven by improving operational performance, strong December demand, and the rollout of the Hyperservice program, which boosted service efficiency and market share across major EV states.",
            "pubDate": "2026-01-06T05:44:47.351770"
        },
        {
            "title": "China stocks hit decade high as metals, financials rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-hit-decade-high-as-metals-financials-rally/articleshow/126366209.cms",
            "description": "China's stock markets reached over a decade high on Tuesday, driven by strong performance in non-ferrous metals and financials. Investor sentiment remains positive ahead of the Lunar New Year, with the Shanghai Composite Index hitting its highest point since July 2015. Tech stocks also extended gains, reflecting optimism for continued growth.",
            "pubDate": "2026-01-06T05:44:47.351884"
        },
        {
            "title": "Reliance Industries shares decline 4% amid heavy volumes, emerges as third-biggest drag on Nifty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-decline-4-amid-heavy-volumes-emerges-as-third-biggest-drag-on-nifty/articleshow/126366034.cms",
            "description": "Reliance Industries share price fell 3.7% on Tuesday, reaching an intraday low of Rs 1,518.30, amid a significant spike in trade volumes. The company stated it expects no Russian crude oil deliveries in January, denying a report about vessels heading to its refinery. This comes as US President Trump threatened tariffs on India if it doesn't curb Russian oil purchases.",
            "pubDate": "2026-01-06T05:44:47.351992"
        },
        {
            "title": "Waaree Energies shares slip 15% in 9 days. What's behind the slide?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-slip-15-in-9-days-whats-behind-the-slide/articleshow/126367320.cms",
            "description": "Waaree Energies shares fall 2.7% on ninth consecutive session as bearish charts dominate, despite Rs 1,003-crore fundraise for advanced battery expansion.",
            "pubDate": "2026-01-06T06:27:12.274475"
        },
        {
            "title": "Mid-tier IT firms set to outshine largecaps in Q3. Infosys in 10 stocks to buy, Wipro among 4 to sell",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mid-tier-it-firms-set-to-outshine-largecaps-in-q3-infosys-in-10-stocks-to-buy-wipro-among-4-to-sell/articleshow/126367115.cms",
            "description": "Mid-tier IT firms are set to outperform largecaps in Q3 as brokerages expect stronger sequential growth for players like Coforge, Persistent and LTIMindtree despite seasonal furloughs. While deal momentum in cloud, data and AI remains healthy, guidance suggests Infosys may raise its FY26 outlook, with Wipro staying subdued.",
            "pubDate": "2026-01-06T06:27:12.274593"
        },
        {
            "title": "Cupid shares zoom 11% after a sharp two-day fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-shares-bounce-back-11-after-two-day-25-decline/articleshow/126366729.cms",
            "description": "Cupid shares staged a strong recovery, bouncing back significantly after a recent steep correction. This rebound is attributed to short covering and renewed investor confidence in the company's long-term fundamentals. Cupid had previously clarified to stock exchanges that it was unaware of any undisclosed material events causing the unusual share price movement.",
            "pubDate": "2026-01-06T06:27:12.274783"
        },
        {
            "title": "Auto ancillary or EV auto ancillary? Clear distinction is key to finding a winner: 6 auto ancillary stocks with upside potential of up to 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-ancillary-or-ev-auto-ancillary-clear-distinction-is-key-to-finding-a-winner-6-auto-ancillary-stocks-with-upside-potential-of-up-to-24/articleshow/126367675.cms",
            "description": "Among auto-ancillaries, companies fall into four buckets. First, are those that read the writing on the wall early and began investing in EV-focused capabilities years ago, some even before their OEM customers firmed up their own plans. Second, those that moved later, largely because their customers were unsure about their EV roadmap and timelines. Third, those that simply misjudged the pace of transition and were caught off guard by how quickly EV adoption picked up. And fourth, firms for whom the shift is almost impossible to ride, because the components they make have little or no relevance in an EV world. Given this, there is, naturally, a realignment in the auto ancillary space.",
            "pubDate": "2026-01-06T06:57:17.457525"
        },
        {
            "title": "Gold vs stocks, Nifty targets and 10 other market myths debunked by DSP Mutual Fund",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-vs-stocks-nifty-targets-and-10-other-market-myths-debunked-by-dsp-mutual-fund/articleshow/126368503.cms",
            "description": "DSP Mutual Fund’s latest NETRA report debunks 12 widely held market myths, challenging assumptions around gold, equity returns, GDP growth, fund performance, index targets and SIP timing, and urges investors to rely on data, diversification and valuation discipline.",
            "pubDate": "2026-01-06T07:24:19.186706"
        },
        {
            "title": "Emkay upgrades Bajaj Auto shares to buy rating, sees 17% upside. Here’s why analysts are bullish",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emkay-upgrades-bajaj-auto-shares-to-buy-rating-sees-17-upside-heres-why-analysts-are-bullish/articleshow/126368441.cms",
            "description": "Bajaj Auto shares rose after Emkay upgraded the stock to Buy, citing strong growth prospects ahead. The brokerage set a target of Rs 11,100, implying 17% upside, with domestic brokers turning bullish after a muted 2025.",
            "pubDate": "2026-01-06T07:24:19.186842"
        },
        {
            "title": "NALCO shares hit record high, up 12% in 4 sessions. What’s behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nalco-shares-hit-record-high-up-12-in-4-sessions-whats-behind-the-surge/articleshow/126369669.cms",
            "description": "NALCO shares hit a record high after gaining 12% in four sessions, supported by a sharp rise in global aluminium prices and tightening supply conditions. Strong demand from construction, renewables and EV sectors, along with the company’s improving earnings and expansion plans, further boosted investor sentiment.",
            "pubDate": "2026-01-06T08:48:03.604912"
        },
        {
            "title": "Rekha Jhunjhunwala likely exits Canara Bank after taking home multibagger returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-likely-exits-canara-bank-after-taking-home-multibagger-returns/articleshow/126369410.cms",
            "description": "Rekha Jhunjhunwala has likely exited Canara Bank after her stake fell below 1% in Q3, ending a highly profitable multiyear investment. The move follows a sharp rally in the stock, which gained nearly 60% over the past year amid improving asset quality, strong credit growth and renewed investor interest in PSU banks.",
            "pubDate": "2026-01-06T08:48:03.605056"
        },
        {
            "title": "F&O Radar | Deploy Long Strangle in Nifty for gains amid rising IV, range-bound moves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-long-strangle-in-nifty-for-gains-amid-rising-iv-range-bound-moves/articleshow/126370323.cms",
            "description": "Nifty ended lower after hitting a lifetime high as profit booking emerged, with ICICI Securities’ Jay Thakkar flagging overbought signals, including a PCR above 1.6. With the 26,000–26,300 range in focus and India VIX climbing over 5.5% ahead of the Budget, volatility is expected to rise further, possibly pushing VIX toward 12%.﻿﻿﻿",
            "pubDate": "2026-01-06T09:02:50.693400"
        },
        {
            "title": "Japan's Nikkei marks a closing high on improving corporate profit outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-marks-a-closing-high-on-improving-corporate-profit-outlook/articleshow/126370299.cms",
            "description": "Japan's Nikkei share average marked ​a record closing high on Tuesday as ⁠the outlook for domestic company's profits improved.",
            "pubDate": "2026-01-06T09:02:50.693510"
        },
        {
            "title": "MF Picks: 13 smallcap stocks with strong profit margins rally up to 163%, 5 turn multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mf-picks-13-smallcap-stocks-with-strong-profit-margins-rally-up-to-163-5-turn-multibaggers/slideshow/126371355.cms",
            "description": "When mutual funds quietly increase their exposure to fundamentally strong companies, it often sends a signal worth tracking. We set out to follow this smart-money trail. To do so, we screened BSE small-cap companies that reported strong year-on-year sales and profit growth of over 10% in the September quarter, while sustaining healthy profit margins above 10%. We further narrowed the list to companies that saw a rise in mutual fund shareholding during the September quarter compared with the previous quarter, excluding banking and financial stocks.Applying these criteria to the BSE small-cap universe resulted in a pool of around 74 stocks. We then layered in price performance filters, which showed that about 47 of these stocks have already generated double-digit returns in FY26. From this subset, we identified 13 standout performers that have delivered price returns ranging between 50% and 162% in FY26 so far, with five stocks emerging as multibaggers. (Data Source: ACE Equity)",
            "pubDate": "2026-01-06T09:59:22.161295"
        },
        {
            "title": "Market Wrap: Sensex 376 pts, Nifty below 26,200 as HDFC Bank, Reliance drag Dalal Street lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-376-pts-nifty-below-26200-as-hdfc-bank-reliance-drag-dalal-street-lower/articleshow/126371479.cms",
            "description": "The BSE Sensex fell 376.28 points, or 0.44%, to close at 85,063.34, while the NSE Nifty 50 declined 71.6 points, or 0.27%, finishing the session at 26,178.70.",
            "pubDate": "2026-01-06T10:28:17.988107"
        },
        {
            "title": "IEX shares zoom 14% on hopes of relief in market coupling case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-zoom-14-on-hopes-of-relief-in-market-coupling-case/articleshow/126372019.cms",
            "description": "Indian Energy Exchange shares surged after APTEL raised concerns over CERC’s proposed market coupling rules, hinting at a possible rollback. The rally was supported by strong Q3 FY26 volume growth and softer power prices.",
            "pubDate": "2026-01-06T10:49:50.319937"
        },
        {
            "title": "Titan Company stock hits fresh record highs in January 2026; will the rally continue?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-company-stock-hits-fresh-record-highs-in-january-2026-will-the-rally-continue/articleshow/126350691.cms",
            "description": "Titan Company Ltd. broke out from a multi-year rounding bottom formation in November 2025 and is sustaining its upward trend. Experts suggest short-term traders can buy the stock for a target of Rs 4500 in the next couple of months, citing positive chart patterns and momentum.",
            "pubDate": "2026-01-06T11:46:07.363045"
        },
        {
            "title": "SAIL, L&T Finance among 10 midcap stocks hit 52-week highs; gains up to 27% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sail-lampt-finance-among-10-midcap-stocks-hit-52-week-highs-gains-up-to-27-in-a-month/slideshow/126373540.cms",
            "description": "On Tuesday, the benchmark Sensex dropped 376 points to close at 85,063. Despite the broader market decline, 10 BSE midcap stocks surged to fresh 52-week highs, marking their strongest levels in the past year. Such breakouts often reflect sustained bullish momentum and may point to further upside potential in the near term.",
            "pubDate": "2026-01-06T11:46:07.363163"
        },
        {
            "title": "These 10 midcap stocks with very high P/E ratios",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-midcap-stocks-with-very-high-p/e-ratios/slideshow/126374504.cms",
            "description": "A P/E ratio above 100 indicates that a company’s stock price is increasing significantly faster than its earnings. This is calculated using the latest end-of-day price and trailing twelve months (TTM) earnings per share. From the NSE midcap pack, we have highlighted the top 10 stocks with the highest TTM P/E ratios, based on a valuation scan by Stockedge.com.While a high P/E suggests strong growth expectations from investors, it can also signal overvaluation or speculative buying. It's important to assess the company's fundamentals and market conditions for a more accurate evaluation.",
            "pubDate": "2026-01-06T13:08:44.282633"
        },
        {
            "title": "Sebi proposes uniform 30-day lag for sharing, use of price data for education",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-uniform-30-day-lag-for-sharing-use-of-price-data-for-education/articleshow/126375667.cms",
            "description": "Sebi has proposed a uniform 30-day lag for sharing and using market price data for educational purposes, balancing data misuse concerns with content relevance, and invited public feedback by January 27, 2026.",
            "pubDate": "2026-01-06T13:59:39.212848"
        },
        {
            "title": "What Sebi’s 15% 'hard ceiling' on open interest means for broker growth, customers: Zerodha’s Nithin Kamath explains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-sebis-15-hard-ceiling-on-open-interest-means-for-broker-growth-customers-zerodhas-nithin-kamath-explains/articleshow/126376423.cms",
            "description": "Zerodha founder Nithin Kamath said SEBI’s 15% open interest cap restricts broker growth but protects consumers by limiting concentration risk, ensuring no single broker dominates markets while encouraging overall industry expansion.",
            "pubDate": "2026-01-06T14:27:21.782074"
        }
    ]
}