{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-11T14:01:17.425818",
    "items": [
        {
            "title": "BEL shares in focus on new order win worth Rs 792 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-on-new-order-win-worth-rs-792-crore/articleshow/125239130.cms",
            "description": "Bharat Electronics Ltd (BEL) shares are likely to be in focus after the defence PSU announced fresh orders worth Rs 792 crore, marking its second consecutive win. The orders cover defence networks, communication systems, drones, and radars. BEL has secured major contracts every month since September, reflecting strong execution momentum.",
            "pubDate": "2025-11-11T03:37:22.458856"
        },
        {
            "title": "Vodafone Idea shares in focus after Q2 loss narrows YoY, ARPU grows 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-after-q2-loss-narrows-yoy-arpu-grows-9/articleshow/125238630.cms",
            "description": "Vodafone Idea's net loss narrowed significantly in the September quarter of FY26, reaching Rs 5,524 crore. The telecom operator also saw its Average Revenue Per User (ARPU) climb to Rs 180, a healthy 8.7% year-on-year jump. Revenue from operations increased, and the company expanded its 4G/5G subscriber base, signaling positive momentum.",
            "pubDate": "2025-11-11T03:37:22.458995"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Bajaj Auto, NYKAA among 5 stocks that could give 10-25% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-bajaj-auto-nykaa-among-5-stocks-that-could-give-10-25-return/slideshow/125238229.cms",
            "description": "Brokerages remain constructive on select stocks across sectors, with a mix of Buy and Accumulate calls supported by earnings visibility and growth drivers.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-11T03:37:22.459102"
        },
        {
            "title": "Bajaj Finance shares in focus after 22% YoY surge in Q2 net profit. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-shares-in-focus-after-22-yoy-surge-in-q2-net-profit-should-you-buy-sell-or-hold/articleshow/125238598.cms",
            "description": "Bajaj Finance announced a 22% rise in its Q2FY26 net profit.  However, this result was slightly below market expectations.  Analysts have differing opinions.  Morgan Stanley maintains an 'Overweight' rating with a revised target price.  Bernstein, however, reiterates an 'Underperform' rating due to emerging stress in certain loan segments and rising credit costs.",
            "pubDate": "2025-11-11T03:37:22.459204"
        },
        {
            "title": "Home improvement stocks: Has business matured enough to be part of a long-term portfolio? 4 stocks, 3 with upside potential of over 49%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/home-improvement-stocks-has-business-matured-enough-to-be-part-of-a-long-term-portfolio-4-stocks-3-with-upside-potential-of-over-49/articleshow/125238164.cms",
            "description": "After coming into the limelight in 2020, most stocks related to the home improvement sector (from laminate and tile makers to several others) have been moving in a very broad range. A majority, in fact, underperformed in the bull run of 2023-24. But the fact also is that no sector stays at high valuations forever; neither does it stay under pressure for extended periods. Is three years of underperformance coming to an end? Will the GST rate cut give these companies the required push? Have valuations cooled to a level where you should think of having them in your long-term portfolio?",
            "pubDate": "2025-11-11T03:37:22.459306"
        },
        {
            "title": "Last day to buy shares of Sagility, Kaveri Seed among 6 companies to be eligible for upcoming dividends. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-sagility-kaveri-seed-among-6-companies-to-be-eligible-for-upcoming-dividends-do-you-own/articleshow/125238172.cms",
            "description": "Today, November 11, marks the final opportunity for investors to acquire shares in Sagility, Gujarat Pipavav Port, Kaveri Seed Company, and others to qualify for their upcoming dividend payouts. The ex-dividend date for these companies is November 12, meaning shares must be held by the close of today's trading session.",
            "pubDate": "2025-11-11T03:37:22.459411"
        },
        {
            "title": "Positive Breakout: These 8 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-cross-above-their-200-dmas/slideshow/125238037.cms",
            "description": "In the Nifty500 pack, eight stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on November 10, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-11-11T03:37:22.459521"
        },
        {
            "title": "Wall Street jumps, Nvidia and Palantir lead AI surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-jumps-nvidia-and-palantir-lead-ai-surge/articleshow/125237894.cms",
            "description": "Indian markets saw a strong rebound on Monday. Major technology and AI-related companies like Nvidia and Palantir experienced significant gains. This surge followed positive developments in Washington regarding the resolution of a prolonged government shutdown. Investors are showing renewed confidence in the tech sector, indicating a 'buy the dip' sentiment is active. The overall market sentiment is optimistic.",
            "pubDate": "2025-11-11T03:37:22.459615"
        },
        {
            "title": "'I am going quiet': Warren Buffett says will no longer write annual letters in a poignant note filled with grace",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/i-am-going-quiet-warren-buffett-says-will-no-longer-write-annual-letters-in-a-poignant-note-filled-with-grace/articleshow/125237750.cms",
            "description": "Warren Buffett is stepping back from writing Berkshire's annual letters after nearly six decades, opting for a quieter approach. He will continue to communicate with shareholders through his annual Thanksgiving message.  Long-time lieutenant Greg Abel is set to officially take over as Berkshire's chief executive by year-end, marking the end of an era.",
            "pubDate": "2025-11-11T03:37:22.459755"
        },
        {
            "title": "Asian stocks buoyed by plans to end US shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-buoyed-by-plans-to-end-us-shutdown/articleshow/125237506.cms",
            "description": "Asian stocks advanced for a second day as a US government shutdown resolution neared, boosting sentiment across markets. Commodities and cryptocurrencies rallied alongside equities, while Treasuries declined. The reopening is expected to restore crucial economic data, offering clarity on the Federal Reserve's policy path.",
            "pubDate": "2025-11-11T03:37:22.459870"
        },
        {
            "title": "WestBridge raises Star Health stake by $12 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/westbridge-raises-star-health-stake-by-12-million/articleshow/125237427.cms",
            "description": "WestBridge Capital has boosted its stake in Star Health and Allied Insurance with a $12 million investment, even as it navigates regulatory approval for a new general insurance venture, Kiwi. The private equity firm clarified its Star Health investment was disclosed to Irdai during Kiwi's licensing process, adhering to promoter guidelines.",
            "pubDate": "2025-11-11T03:37:22.459961"
        },
        {
            "title": "Stocks in news: Bajaj Finance, Vodafone Idea, Britannia, Ather Energy, Hero MotoCorp",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-bajaj-finance-vodafone-idea-britannia-ather-energy-hero-motocorp/articleshow/125228937.cms",
            "description": "In today's trade, shares of Bajaj Finance, Vodafone Idea, Britannia, Ather Energy, Hero MotoCorp among others will be in focus due to various news developments and second quarter results.",
            "pubDate": "2025-11-11T03:37:22.460056"
        },
        {
            "title": "GIFT Nifty up 40 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125229021.cms",
            "description": "Indian stock markets opened flat this week, boosted by positive Asian market signals. The IT sector played a significant role in this momentum. Analysts anticipate markets will trade within a defined range, influenced by global trends. Strong corporate earnings and progress in India-US trade talks could offer further upward movement.",
            "pubDate": "2025-11-11T03:37:22.460149"
        },
        {
            "title": "US private equity firm General Atlantic set to acquire 7% of Balaji Wafers for ₹2,500 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ga-set-to-acquire-7-of-balaji-wafers-for-282m/articleshow/125237433.cms",
            "description": "General Atlantic is close to acquiring a 7% stake in Balaji Wafers for ₹2,500 crore. This deal values the Gujarat-based snack maker at approximately ₹35,000 crore. Balaji Wafers founder Chandu Virani confirmed the negotiations are in the final stages. The company is a major player in the Indian salty snack market, ranking third nationally.",
            "pubDate": "2025-11-11T03:37:22.460238"
        },
        {
            "title": "Should investors bet on Lenskart after its muted debut on Dalal Street?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/should-investors-bet-on-lenskart-after-its-muted-debut-on-dalal-street/articleshow/125237278.cms",
            "description": "Lenskart Solutions debuted on Indian bourses with a 1.7% discount to its IPO price, listing at ₹395 against ₹402. Despite a strong IPO subscription, analysts advised caution due to high valuations, recommending investors monitor profitability for 2-3 quarters before fresh purchases.",
            "pubDate": "2025-11-11T03:37:22.460327"
        },
        {
            "title": "Indices rebound as IT stocks drive gains after three-day loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indices-rebound-as-it-stocks-drive-gains-after-three-day-loss/articleshow/125237244.cms",
            "description": "Indian stock markets saw a rebound on Monday, with IT stocks leading the gains. This recovery followed three days of losses. Analysts suggest the market may trade within a range due to a lack of new catalysts. Investors are shifting focus to IT stocks, finding them attractive. Foreign investors were net sellers, while domestic investors bought shares.",
            "pubDate": "2025-11-11T03:37:22.460415"
        },
        {
            "title": "Hindustan Aeronautics among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-aeronautics-among-6-stocks-showing-bullish-rsi-upswing/slideshow/125239429.cms",
            "description": "Six stocks from the NSE large-cap pack were highlighted in the RSI Trending Up scan on November 10, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-11T04:00:09.319446"
        },
        {
            "title": "From Zomato to Lenskart: 25 tech startup IPOs, 8 losers, 4 multibaggers, and one unending argument",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-zomato-to-lenskart-25-tech-startup-ipos-8-losers-4-multibaggers-and-one-unending-argument/articleshow/125239336.cms",
            "description": "India's tech startup IPOs have seen a mixed bag since 2021, with 25 companies listing and generating an average 42% gain. Despite debates over high valuations like Lenskart's, four multibaggers have emerged, while eight have become losers.",
            "pubDate": "2025-11-11T04:00:09.319580"
        },
        {
            "title": "Rekha Jhunjhunwala-backed Baazar Style Retail shares in focus after turning profitable YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-backed-baazar-style-retail-shares-in-focus-after-turning-profitable-yoy/articleshow/125239293.cms",
            "description": "Baazar Style Retail reported a sharp turnaround in Q2FY26 with a consolidated net profit of Rs 51 crore, compared to a loss last year. Revenue surged 71% year-on-year to Rs 532 crore, while PAT jumped over 2,400% sequentially. Total income rose to Rs 535 crore despite higher expenses. The value fashion retailer, backed by Rekha Jhunjhunwala, continues expanding its strong presence in Eastern India.",
            "pubDate": "2025-11-11T04:00:09.319695"
        },
        {
            "title": "​UNO Minda, Balrampur Chini among 8 stocks flashing bullish signals, indicating a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uno-minda-balrampur-chini-among-8-stocks-flashing-bullish-signals-indicating-a-possible-uptrend/slideshow/125239251.cms",
            "description": "Eight stocks from the Nifty500 pack appeared in the bullish scanner for the “White Marubozu” pattern on November 10, according to technical scan data from StockEdge.com. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.\"",
            "pubDate": "2025-11-11T04:00:09.319803"
        },
        {
            "title": "ONGC shares in focus as Q2 profit falls 18% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-shares-in-focus-as-q2-profit-falls-18-yoy/articleshow/125239164.cms",
            "description": "Oil and Natural Gas Corporation (ONGC) reported an 18% year-on-year decline in net profit for the July-September quarter, primarily due to lower oil prices. Despite this, the company declared an interim dividend and approved strategic investments in renewable energy and ethane transportation ventures.",
            "pubDate": "2025-11-11T04:00:09.319907"
        },
        {
            "title": "BofA initiates coverage on Adani Group bonds, says fundamentals solid",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bofa-initiates-coverage-on-adani-group-bonds-says-fundamentals-solid/articleshow/125243714.cms",
            "description": "Bank of America Global Research has initiated coverage on Adani Group's dollar bonds. They have given an 'Overweight' rating to select issuances. This is due to solid fundamentals and strong funding access. The group has shown operational resilience amid global scrutiny. Ratings agencies have maintained investment-grade ratings. Leverage is improving across key entities.",
            "pubDate": "2025-11-11T07:52:20.488985"
        },
        {
            "title": "Struggling to breathe in Delhi? 5 companies making air purifiers brokerages are bullish on",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/struggling-to-breathe-in-delhi-5-companies-making-air-purifiers-brokerages-are-bullish-on/articleshow/125243700.cms",
            "description": "With Delhi’s air quality deteriorating to the “severe” category (AQI 425) and Stage III of GRAP imposed, air purifier manufacturers have come into focus. As toxic smog grips North India, demand for air purification products is rising, potentially benefiting investors in this sector.",
            "pubDate": "2025-11-11T07:52:20.489098"
        },
        {
            "title": "Unique Picks: 10 stocks held by a single MF scheme; 3 turned multibaggers, Are you invested?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unique-picks-10-stocks-held-by-a-single-mf-scheme-3-turned-multibaggers-are-you-invested/slideshow/125242816.cms",
            "description": "ETMarkets examined mutual fund portfolios to pinpoint stocks held exclusively by a single mutual fund scheme. In the initial screening for October 2025, 197 such stocks were identified. This list was further refined to include only those with equity mutual fund holdings above Rs 10 crore as of October 2025, bringing the final selection down to 25 stocks.Data show that 10 of these 25 stocks have delivered returns of over 20% in FY26 so far. In fact, three of them have more than doubled investors’ wealth, posting price returns of 120%–300% in less than eight months of FY26. (Data Source: ACE MF, ACE Equity).",
            "pubDate": "2025-11-11T07:52:20.489196"
        },
        {
            "title": "SoftBank sells entire Nvidia stake for $5.8 billion in surprise move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/softbank-unloads-nvidia-stake-for-5-8-billion-in-surprise-move/articleshow/125243270.cms",
            "description": "SoftBank sold its Nvidia stake for $5.8 billion, contributing to a surprise ¥2.5 trillion net income. The company is aggressively investing in AI, with stakes in OpenAI and Oracle, and plans for a $30 billion investment in OpenAI and a $1 trillion AI manufacturing hub. Despite strong performance, concerns remain about AI company valuations and financing new ventures.",
            "pubDate": "2025-11-11T07:52:20.489279"
        },
        {
            "title": "Japan's Nikkei retreats as traders take profits after tech rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-retreats-as-traders-take-profits-after-tech-rally/articleshow/125243263.cms",
            "description": "Japan's Nikkei index reversed early gains, closing down 0.14% as investors cashed in on a tech rally. While AI shares initially surged, profit-taking dominated the afternoon session. SoftBank Group and Sony Group saw significant movements, with SoftBank announcing a stock split and strong profits after market close. The broader Topix managed a slight increase.",
            "pubDate": "2025-11-11T07:52:20.489359"
        },
        {
            "title": "Tata Motors Commercial Vehicles shares to list tomorrow. What should investors expect?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-commercial-vehicles-shares-to-list-tomorrow-what-should-investors-expect/articleshow/125242699.cms",
            "description": "Tata Motors Commercial Vehicles will debut on the NSE and BSE on November 12, following its demerger from Tata Motors. Analysts expect strong institutional participation and potential volatility, with fair value estimates ranging between Rs 300–470 amid optimism over the Iveco acquisition and CV sector growth.",
            "pubDate": "2025-11-11T07:52:20.489439"
        },
        {
            "title": "Neuberg Diagnostics said to eye $350 million India IPO in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/neuberg-diagnostics-said-to-eye-350-million-india-ipo-in-2026/articleshow/125242346.cms",
            "description": "Neuberg Diagnostics is reportedly planning a $350 million IPO next year, joining India's booming stock market. Founder GSK Velu also intends to list Trivitron Healthcare and Maxivision Eye Hospitals later. This move aligns with strong growth projections for India's diagnostics sector, driven by increasing chronic diseases and investor appetite.",
            "pubDate": "2025-11-11T07:52:20.489518"
        },
        {
            "title": "Wall Street’s AI-driven rally set to continue into 2026: UBS",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-streets-ai-driven-rally-set-to-continue-into-2026-ubs/slideshow/125242382.cms",
            "description": "The S&P 500 is nearing the 7,000-point mark, having closed at 6,728.80 last Friday. Investor optimism around AI, robust corporate profits, and expectations of falling interest rates have fueled the recent rally. (Source: Reuters)",
            "pubDate": "2025-11-11T07:52:20.489603"
        },
        {
            "title": "PFC shares slip 3% in 2 days after Q2 results despite moderate YoY profit growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pfc-shares-slip-3-in-2-days-after-q2-results-despite-moderate-yoy-profit-growth/articleshow/125242044.cms",
            "description": "PFC share price has seen a decline over 2 days after reporting Q2 FY26 results, as modest 2% profit growth failed to impress investors. While NII jumped 20% year-on-year and revenue rose 12%, sequential profit decline and weak sentiment kept the stock under pressure.",
            "pubDate": "2025-11-11T07:52:20.489683"
        },
        {
            "title": "Suzlon’s multibagger rally stalls despite soaring profits and P/E moderation as stock slips 30% from peak. What's ailing?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlons-multibagger-rally-stalls-despite-soaring-profits-and-p/e-moderation-as-stock-slips-30-from-peak-whats-ailing/articleshow/125241540.cms",
            "description": "Suzlon Energy's stock has stalled, slipping 30% from its peak despite soaring profits and a moderated P/E ratio. The company reported record Q2FY26 results with PAT surging 538% YoY, yet shares remain range-bound, underperforming benchmarks. Experts suggest the stock is fully priced, with limited upside potential in the short to medium term.",
            "pubDate": "2025-11-11T07:52:20.489761"
        },
        {
            "title": "Lenskart shares rise 3% on day 2 of trading after volatile debut. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-rise-3-on-day-2-of-trading-after-volatile-debut-should-you-buy-sell-or-hold/articleshow/125241447.cms",
            "description": "Lenskart shares rose on their second trading day after a volatile debut, leaving investors debating whether to buy, sell, or hold. Despite strong listing recovery and robust revenue growth, brokerages like Ambit Capital have turned cautious, citing steep valuations, thin margins, and delayed free cash flow visibility until FY28.",
            "pubDate": "2025-11-11T07:52:20.489840"
        },
        {
            "title": "NALCO shares zoom 12% in 2 days on strong Q2 earnings, brokerage optimism. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nalco-shares-zoom-12-in-2-days-on-strong-q2-earnings-brokerage-optimism-what-should-investors-do/articleshow/125241402.cms",
            "description": "NALCO shares saw a sharp uptick in two days after reporting strong Q2 results, with net profit up 37% YoY to Rs 1,430 crore. Brokerages including Axis Securities, PL Capital, and Emkay Global remain bullish, citing cost efficiency, expansion projects, and improving aluminium prices as key growth drivers.",
            "pubDate": "2025-11-11T07:52:20.489920"
        },
        {
            "title": "Infosys share buyback: What should investors do ahead of November 14 record date?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-share-buyback-what-should-investors-do-ahead-of-november-14-record-date/articleshow/125241330.cms",
            "description": "Infosys' share buyback, with a record date of November 14, is drawing investor attention. Shareholders approved the proposal, which is the company's largest ever. Experts suggest buying Infosys shares to capitalize on the buyback offer, anticipating short-term gains despite recent underperformance.",
            "pubDate": "2025-11-11T07:52:20.490001"
        },
        {
            "title": "GRSE shares rise 4%, up 8% in 2 sessions. What’s fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grse-shares-rise-4-up-8-in-2-sessions-whats-fuelling-the-rally/articleshow/125241294.cms",
            "description": "Garden Reach Shipbuilders and Engineers Ltd (GRSE) saw its stock surge by 4% to an intraday high of Rs 2,786 on November 11. This rise followed the defence shipbuilder's strong financial performance for Q2FY26 and H1FY26, with profit after tax jumping 57% year-on-year to Rs 154 crore in the quarter.",
            "pubDate": "2025-11-11T07:52:20.490080"
        },
        {
            "title": "Transformers and Rectifiers shares hit 10% lower circuit on weak Q2; stock down nearly 40% in 8 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/transformers-and-rectifiers-shares-hit-10-lower-circuit-on-weak-q2-stock-down-nearly-40-in-8-days/articleshow/125240831.cms",
            "description": "Transformers and Rectifiers India shares fell, extending their losing streak to eight sessions with a 40% slide overall. The decline followed weak Q2 results, as net profit dropped 20% year-on-year to ₹37.45 crore and EBITDA fell 19% to ₹65.44 crore, while revenue remained flat at ₹460 crore.",
            "pubDate": "2025-11-11T07:52:20.490166"
        },
        {
            "title": "Economic data set to resume as US government shutdown nears end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/economic-data-set-to-resume-as-us-government-shutdown-nears-end/slideshow/125240678.cms",
            "description": "Investors are breathing easier as the longest US government shutdown in history may finally be coming to an end. The US Senate has reached a compromise to reopen the government, helping restore market confidence. On Monday, stocks recouped some of last week’s losses as optimism returned. (Source: Reuters)",
            "pubDate": "2025-11-11T07:52:20.490243"
        },
        {
            "title": "97% Sebi enforcement orders since 2013 targeted trading-call providers: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/97-sebi-enforcement-orders-since-2013-targeted-trading-call-providers-report/articleshow/125245951.cms",
            "description": "An ARIA analysis shows that trading-call providers—both registered and unregistered—accounted for nearly 97% of Sebi’s enforcement orders under the Investment Advisers framework since 2013. Of 218 orders issued until March 2025, only six involved registered investment advisers, none of which led to investor losses. The findings highlight high compliance standards among genuine fiduciary advisers.",
            "pubDate": "2025-11-11T09:55:32.910161"
        },
        {
            "title": "Warren Buffett to retain major Berkshire stake until investors gain confidence in successor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-to-retain-major-berkshire-stake-until-investors-gain-confidence-in-successor/articleshow/125244874.cms",
            "description": "Warren Buffett, 95, announced he will step down as CEO of Berkshire Hathaway at the end of this year, with Greg Abel set to succeed him in January. In his annual Thanksgiving letter, Buffett said he will retain his Class A shares until investors gain confidence in Abel’s leadership.",
            "pubDate": "2025-11-11T09:55:32.910284"
        },
        {
            "title": "Warren Buffett's farewell letter: 5 important things that the Oracle of Omaha said",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffetts-farewell-letter-5-important-things-that-the-oracle-of-omaha-said/articleshow/125244819.cms",
            "description": "Warren Buffett bid farewell to Berkshire Hathaway shareholders, announcing his retirement and reflecting on a lifetime of success, luck, and partnership with Charlie Munger. At 95, he praised Omaha’s influence, shared lessons on humility and perseverance, and expressed full confidence in Greg Abel to carry forward Berkshire’s enduring legacy.",
            "pubDate": "2025-11-11T09:55:32.910504"
        },
        {
            "title": "Vijay Kedia-backed Atul Auto shares soar 14% after Q2 PAT jumps 70% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-backed-atul-auto-shares-soar-14-after-q2-pat-jumps-70-yoy/articleshow/125246204.cms",
            "description": "Shares of Vijay Kedia-backed Atul Auto surged rose sharply after the company posted a 70% year-on-year jump in Q2 net profit to Rs 9.2 crore. Revenue rose 10% to Rs 200 crore, driven by higher sales volumes and improved operational performance in its commercial three-wheeler segment.",
            "pubDate": "2025-11-11T10:16:07.639142"
        },
        {
            "title": "Gainers & Losers: Bajaj twins, Vijay Kedia stock among 7 that moved most on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-bajaj-twins-vijay-kedia-stock-among-7-that-moved-most-on-tuesday/slideshow/125247151.cms",
            "description": "",
            "pubDate": "2025-11-11T10:52:33.163018"
        },
        {
            "title": "Market Wrap: Sensex gains 336 pts, Nifty tops 25,690 on U.S. trade talks optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-gains-336-pts-nifty-tops-25690-on-u-s-trade-talks-optimism/articleshow/125246599.cms",
            "description": "Indian stock markets rallied on Tuesday, with both Sensex and Nifty closing higher after reversing early declines. Positive sentiment was fueled by hopes of a trade deal with Washington and the U.S. government's reopening. However, gains were tempered by a dip in financial stocks following Bajaj Finance's reduced growth forecast and pre-expiry jitters.",
            "pubDate": "2025-11-11T10:52:33.163174"
        },
        {
            "title": "Bihar exit polls point to big NDA win. How will Nifty react on Wednesday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bihar-exit-polls-point-to-big-nda-win-how-will-nifty-react-on-wednesday/articleshow/125251195.cms",
            "description": "Exit polls project a decisive NDA victory in Bihar, with BJP-JD(U) leading and Congress-RJD trailing. Analysts expect muted market reaction as results align with expectations, signaling policy stability and continuity ahead.",
            "pubDate": "2025-11-11T14:01:09.745083"
        },
        {
            "title": "Nithin Kamath says Robinhood makes Rs 1,300 crore from just instant withdrawals, calls US banking system 'broken'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nithin-kamath-says-robinhood-makes-rs-1300-crore-from-just-instant-withdrawals-calls-us-banking-system-broken/articleshow/125250288.cms",
            "description": "Zerodha’s Nithin Kamath compared India’s UPI-led payments ecosystem with the US, noting Robinhood earns Rs 1,300 crore yearly from instant withdrawal fees, highlighting India’s cost-free and efficient payment infrastructure.",
            "pubDate": "2025-11-11T14:01:09.745209"
        },
        {
            "title": "10 midcap stocks with strong net profit growth in September ’25 quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-midcap-stocks-with-strong-net-profit-growth-in-september-25-quarter/slideshow/125248787.cms",
            "description": "A quarterly high net profit growth on a year-over-year (YoY) basis indicates a company showing substantial improvement in profitability compared to the same quarter last year. Among the NSE Midcap stocks, the top 10 companies have reported quarterly net profit growth surpassing 200% YoY, according to stockedge.com's profitability scan data.",
            "pubDate": "2025-11-11T14:01:09.745310"
        },
        {
            "title": "NSE says its electricity futures emerge as key price benchmark in India’s power market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-says-its-electricity-futures-emerge-as-key-price-benchmark-in-indias-power-market/articleshow/125249834.cms",
            "description": "NSE’s electricity futures are emerging as a benchmark for power price discovery, with close alignment to physical market rates, enhancing transparency, efficiency, and integration in India’s evolving energy market.",
            "pubDate": "2025-11-11T14:01:09.745407"
        },
        {
            "title": "Two Trades for Today: A private sector defence player for a 5.9% upmove, a mid-cap refinery stock for almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-private-sector-defence-player-for-a-5-9-upmove-a-mid-cap-refinery-stock-for-almost-6-gain/articleshow/125249221.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-11T14:01:09.745550"
        },
        {
            "title": "UK's Vodafone to increase dividend for first time in 8 years, shares rise 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uks-vodafone-to-increase-dividend-for-first-time-in-8-years-shares-rise-5/articleshow/125249246.cms",
            "description": "Vodafone's shareholders will be rewarded with the first dividend increase in eight years after a return to growth in Germany helped the European mobile and broadband operator upgrade its earnings outlook.",
            "pubDate": "2025-11-11T14:01:09.745649"
        },
        {
            "title": "Stock Radar: Bank of Baroda stock hit fresh highs in November; breaks out from inverse head & shoulder pattern – time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-bank-of-baroda-stock-hit-fresh-highs-in-november-breaks-out-from-inverse-head-shoulder-pattern-time-to-buy/articleshow/125223709.cms",
            "description": "Bank of Baroda’s stock broke out from an inverse head and shoulders pattern, signalling bullish momentum. Experts expect the rally to continue, setting a near-term target of Rs 350.",
            "pubDate": "2025-11-11T14:01:09.745746"
        },
        {
            "title": "Torrent Pharma, Shriram Finance among 8 stocks that hit 52-week highs; gained up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/torrent-pharma-shriram-finance-among-8-stocks-that-hit-52-week-highs-gained-up-to-25-in-a-month/slideshow/125247818.cms",
            "description": "Benchmark Sensex rose by approximately 335 points on Tuesday, closing at 83,871. Amid the broader rally, eight stocks from the BSE 200 Index touched their 52-week highs, reaching their strongest levels in a year. Traders and investors often view such breakouts as bullish signals, reflecting strong upward momentum and the potential for further gains.",
            "pubDate": "2025-11-11T14:01:09.745842"
        }
    ]
}