{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-08T09:43:00.886721",
    "items": [
        {
            "title": "Modulus Appoints Sandeep Agarwal as Chief Executive",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/modulus-appoints-sandeep-agarwal-as-chief-executive/articleshow/126404551.cms",
            "description": "Modulus Alternatives has appointed Sandeep Agarwal as its new chief executive, effective January 1. Agarwal brings nearly 25 years of extensive experience in investment banking and private credit from prominent institutions like UBS AG, Credit Suisse, and JP Morgan. This strategic appointment is backed by the Centrum Group and Alok Agarwal, former CFO of Reliance Industries.",
            "pubDate": "2026-01-08T00:59:27.374446"
        },
        {
            "title": "Equity likely to return about 10-12% in 2026: ABSL MF",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/equity-likely-to-return-about-10-12-in-2026-absl-mf/articleshow/126404511.cms",
            "description": "Aditya Birla Sun Life Mutual Fund anticipates equity returns of 10-12% in 2026. Nifty companies are expected to see earnings growth in the low to mid-teens. Large-cap stocks are predicted to outperform mid and small-cap peers. The fund house is overweight on IT, FMCG, and materials. Harish Krishnan succeeds Mahesh Patil as CIO, equity.",
            "pubDate": "2026-01-08T00:59:27.374607"
        },
        {
            "title": "Strong Q3 sales and rising gold demand lift jewellery stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-q3-sales-and-rising-gold-demand-lift-jewellery-stocks/articleshow/126404487.cms",
            "description": "Gold jewellery stocks surged on Wednesday. Titan Company, Kalyan Jewellers India, and Senco Gold reported strong third-quarter sales. This positive market sentiment is expected to continue. Analysts point to rising gold prices and consistent sales growth as key drivers.  Titan's jewellery business grew 41% year-on-year. Senco's revenue was up 51%. Kalyan Jewellers saw consolidated revenue growth of approximately 42%.",
            "pubDate": "2026-01-08T00:59:27.374908"
        },
        {
            "title": "FPIs dump FMCG, Financial Services in second half of December; IT sees inflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-dump-fmcg-financial-services-in-second-half-of-dec-it-sees-inflows/articleshow/126404440.cms",
            "description": "Foreign investors divested ₹16,848 crore from Indian markets in the latter half of December. FMCG and financial services saw major outflows. However, the information technology sector attracted ₹4,457 crore in inflows, marking the first positive fortnight since June. This shift indicates a change in global investor sentiment towards Indian equities.",
            "pubDate": "2026-01-08T00:59:27.375050"
        },
        {
            "title": "PNB puts on the block ₹760 cr of bad loans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-puts-on-the-block-760-cr-of-bad-loans/articleshow/126404493.cms",
            "description": "Punjab National Bank is selling bad loans exceeding ₹760 crore, including significant exposures to Gammon India and Simbhaoli Sugars. This follows a larger sale attempt last week of ₹2,500 crore in non-performing assets. The bank aims to recover at least 40-50% of the identified ₹4,000-5,000 crore in bad loans.",
            "pubDate": "2026-01-08T00:59:27.375326"
        },
        {
            "title": "Nifty valuations frozen for a year but Q3 earnings season could finally break the spell",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-valuations-frozen-for-a-year-but-q3-earnings-season-could-finally-break-the-spell/articleshow/126406255.cms",
            "description": "India's Nifty50 has seen stagnant valuations for a year, but the upcoming Q3 earnings season could be a turning point. Analysts are divided, with some predicting a sharp rebound driven by banks, telecom, and metals, while others foresee continued soft earnings. The market is at an inflection point, with stock selection becoming crucial for potential gains.",
            "pubDate": "2026-01-08T04:02:03.485920"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama maintains a Hold on Indigo; Morgan Stanley recommends overweight on Aditya Birla Capital",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sell-or-hold-nuvama-maintains-a-hold-on-indigo-morgan-stanley-recommends-overweight-on-aditya-birla-capital/articleshow/126406189.cms",
            "description": "Brokerage firms remain selective on Indian equities. Nuvama maintains a Hold on IndiGo amid operational risks, while Morgan Stanley stays bullish on Aditya Birla Capital. Elara Securities highlights improving power demand with CESC, NLC India and NTPC as top picks.",
            "pubDate": "2026-01-08T04:02:03.486045"
        },
        {
            "title": "Cipla among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126406160.cms",
            "description": "On January 7, futures open interest rose notably across five F&O stocks, contributing to a cumulative increase of over 10% compared with the previous session. A rise in futures open interest points to a build-up of active contracts, suggesting fresh positioning or expansion of existing positions by traders.",
            "pubDate": "2026-01-08T04:02:03.486148"
        },
        {
            "title": "Sebi alleges BofA unit breached rules in 2024 AB Sun Life ‌AMC deal: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-alleges-bank-of-america-breached-rules-in-2024-stock-deal-document-shows/articleshow/126406099.cms",
            "description": "India's market regulator has accused a Bank of America unit of breaking insider trading rules. The bank's deal team allegedly shared confidential information with its broking and research arms. These teams then contacted potential investors about a share sale. The regulator found a failure in internal controls. The bank is seeking to settle the charges without admitting guilt.",
            "pubDate": "2026-01-08T04:02:03.486247"
        },
        {
            "title": "Lemon Tree shares in focus as firm denies media reports of Warburg Pincus acquiring stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lemon-tree-shares-in-focus-as-firm-denies-media-reports-of-warburg-pincus-acquiring-stake/articleshow/126406048.cms",
            "description": "Lemon Tree Hotels shares are under scrutiny after denying reports of a Warburg Pincus stake. The company clarified no ongoing discussions or agreements exist.  Previously, the stock rose on the speculation. Lemon Tree operates over 110 properties.  A new hotel in Tirupati was announced.  The stock saw modest gains in 2025 and is down in 2026.",
            "pubDate": "2026-01-08T04:02:03.486353"
        },
        {
            "title": "Saregama India among 4 stocks closed above VWAP, signalling bullish shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saregama-india-among-4-stocks-closed-above-vwap-signalling-bullish-shift/slideshow/126405990.cms",
            "description": "On January 7, the closing prices of four stocks in the Nifty500 pack rallied over 1.5% relative to their VWAP (Volume Weighted Average Price), and a move above the VWAP suggests a potential bullish trend, according to StockEdge.com’s technical scan data.When a stock closes above its VWAP, it indicates the price ended higher than the volume-weighted average traded during the session. This is mostly interpreted by traders as a sign of positive sentiment and strengthening buying interest.",
            "pubDate": "2026-01-08T04:02:03.486475"
        },
        {
            "title": "Adani Green shares in focus as unit signs captive hybrid power deal with Asahi India Glass",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-shares-in-focus-as-unit-signs-captive-hybrid-power-deal-with-asahi-india-glass/articleshow/126405945.cms",
            "description": "Adani Green Energy is set to be in focus after its step-down subsidiary signed agreements to supply 20.8 MW of solar-wind hybrid power to Asahi India Glass from its Khavda project in Gujarat, alongside an investment pact structured under captive power norms.",
            "pubDate": "2026-01-08T04:02:03.486575"
        },
        {
            "title": "KPIT Technologies, Torrent Pharma among 5 stocks showing bullish candlestick pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kpit-technologies-torrent-pharma-among-5-stocks-showing-bullish-candlestick-pattern/slideshow/126405943.cms",
            "description": "On January 7, five stocks from the Nifty200 pack featured in the bullish White Marubozu scanner, based on data from StockEdge.com. A White Marubozu forms when prices open at the day’s low and close at the high, signalling sustained buying pressure and strong bullish sentiment throughout the trading session.",
            "pubDate": "2026-01-08T04:02:03.486671"
        },
        {
            "title": "Angel One shares in focus on stock split, Q3 business update. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/angel-one-shares-will-be-in-focus-on-these-3-key-developments-heres-everything-you-need-to-know/articleshow/126405692.cms",
            "description": "Angel One shares will be in focus as the board meets January 15. They will consider a stock split and an interim dividend for FY26. This comes with the announcement of December quarter update. The company also released its December business update showing mixed trends in client acquisition and order volumes. Angel One shares have started 2026 with a gain.",
            "pubDate": "2026-01-08T04:02:03.486762"
        },
        {
            "title": "Tata Technologies among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-technologies-among-6-stocks-showing-bullish-rsi-upswing/slideshow/126405639.cms",
            "description": "On January 7, six stocks from the Nifty500 universe appeared in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from lower levels is considered an uptrend signal, reflecting strengthening price momentum and growing bullish interest, often tracked by traders to identify potential buying opportunities.",
            "pubDate": "2026-01-08T04:02:03.486864"
        },
        {
            "title": "Tata Steel shares in focus after company reports best-ever quarterly deliveries in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-in-focus-after-company-reports-best-ever-quarterly-deliveries-in-q3/articleshow/126405221.cms",
            "description": "Tata Steel reported its best-ever quarterly crude steel production and deliveries for Q3FY26, with production reaching 6.34 million tons, a 12% increase year-on-year and sequentially. Domestic deliveries also hit a record, crossing 6 million tons, driven by strong demand across key segments like Automotive and Branded Products.",
            "pubDate": "2026-01-08T04:02:03.486960"
        },
        {
            "title": "Stocks to buy in 2026: Century Plyboards, Astral among 5 stocks to buy for 1 year time horizon",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-century-plyboards-astral-among-5-stocks-to-buy-for-1-year-time-horizon/slideshow/126405056.cms",
            "description": "Brokerage recommendations on a basket of building materials, consumer, and quick-service restaurant stocks point to selective opportunities despite mixed sectoral conditions.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-08T04:02:03.487055"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/126405006.cms",
            "description": "In the Nifty500 pack, 11 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on January 07, 2026, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2026-01-08T04:02:03.487150"
        },
        {
            "title": "GIFT Nifty down 40 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126404716.cms",
            "description": "Indian equity markets experienced a marginal decline for the third consecutive session, influenced by global geopolitical tensions and ongoing FII outflows. Analysts anticipate a consolidation phase with profit-booking at higher levels, while sector-specific movements persist due to Q3 business updates.",
            "pubDate": "2026-01-08T04:02:03.487248"
        },
        {
            "title": "Stocks in news: Angel One, Tata Steel, Shriram Finance, IndiGo, Eternal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-angel-one-tata-steel-shriram-finance-indigo-eternal/articleshow/126404697.cms",
            "description": "Markets extended their corrective phase on Wednesday, with the Nifty nearing support levels. Several companies are in focus today due to significant news. Angel One's board will meet to consider a stock split and dividend, while Tata Steel reported its best-ever quarterly crude steel production. IndiGo faces scrutiny over flight cancellations, and Eternal received a GST demand order.",
            "pubDate": "2026-01-08T04:02:03.487340"
        },
        {
            "title": "Asian stocks fall as optimism fades, US bonds hold gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fall-as-optimism-fades-us-bonds-hold-gains/articleshow/126404678.cms",
            "description": "Asian markets saw a dip for the second day as a strong rally cooled. US Treasuries held their ground after gains. Samsung Electronics reported record profits but its stock fell. Mixed US economic data is influencing Federal Reserve rate cut expectations. Geopolitical concerns and economic outlook are also impacting markets.",
            "pubDate": "2026-01-08T04:02:03.487445"
        },
        {
            "title": "Thangamayil Jewellery shares jump 28% in just 3 sessions. What’s behind the sharp surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thangamayil-jewellery-shares-jump-28-in-just-3-sessions-whats-behind-the-sharp-surge/articleshow/126406528.cms",
            "description": "Thangamayil Jewellery shares saw a significant rise. This surge followed strong third-quarter business updates from rival companies. Titan Company and Senco Gold reported robust growth. Kalyan Jewellers also posted impressive revenue increases. Thangamayil itself had a strong turnaround in its September quarter results. This positive performance is driving investor interest.",
            "pubDate": "2026-01-08T04:47:08.449067"
        },
        {
            "title": "Coal India's five-year run creates Rs 1.8 lakh crore wealth for investors. Can Bharat Coking Coal match it?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-indias-five-year-run-creates-rs-1-8-lakh-crore-wealth-for-investors-can-bharat-coking-coal-match-it/articleshow/126406410.cms",
            "description": "Coal India's five-year run generated Rs 1.8 lakh crore in investor wealth, driven by commodity cycles and PSU re-rating. Now, its subsidiary Bharat Coking Coal (BCCL) seeks funds, aiming to replicate this success with its strategic coking coal assets and expansion plans.",
            "pubDate": "2026-01-08T04:47:08.449193"
        },
        {
            "title": "Shriram Finance shares in focus as board mulls Rs 39,618 crore funding from MUFG",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-shares-in-focus-as-board-mulls-rs-39618-crore-funding-from-mufg/articleshow/126406388.cms",
            "description": "Shriram Finance shares are in focus ahead of an EGM on January 14, where shareholders will vote on a Rs 39,618 crore capital infusion from Japan's MUFG Bank. The deal involves a 20% stake dilution via preferential allotment. Proxy advisors ISS and InGovern recommend voting in favor, citing fair pricing and safeguards.",
            "pubDate": "2026-01-08T04:47:08.449432"
        },
        {
            "title": "Infosys shares in focus following strategic AI partnership with Cognition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-following-strategic-ai-partnership-with-cognition/articleshow/126406317.cms",
            "description": "The integration of Infosys Topaz Fabric and Cognition’s autonomous engineering tech is expected to fast-track software development and modernisation.",
            "pubDate": "2026-01-08T04:47:08.449535"
        },
        {
            "title": "Sensex drops over 200 pts, Nifty below 26,150 amid tariff jitters and foreign selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-over-200-pts-nifty-below-26150-amid-tariff-jitters-and-foreign-selling/articleshow/126406230.cms",
            "description": "Indian equities opened lower on Thursday, with both the Sensex and Nifty extending a cautious trend for the fourth consecutive session. Concerns over U.S. tariffs and ongoing foreign fund outflows are weighing on the market, despite some positive sentiment from earnings growth.",
            "pubDate": "2026-01-08T04:47:08.449638"
        },
        {
            "title": "LG Electronics' three-month IPO anchor lock-in ends today, 1.5 cr additional shares now eligible for trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-electronics-three-month-anchor-lock-in-ends-today-1-5-cr-additional-shares-now-eligible-for-trade/articleshow/126406980.cms",
            "description": "LG Electronics India will be in focus as its three-month IPO anchor lock-in ends today, freeing 1.5 crore shares for trade. The stock remains 28% above its issue price, even as recent quarterly results showed weaker profitability. Analysts stay optimistic, citing strong brand positioning and long-term growth visibility.",
            "pubDate": "2026-01-08T05:02:55.543772"
        },
        {
            "title": "Adani Power, Tata Motors among 8 stocks with up to 72% upside as brokerages initiate coverage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-tata-motors-among-8-stocks-with-up-to-72-upside-as-brokerages-initiate-coverage/slideshow/126406934.cms",
            "description": "A host of domestic and global brokerages have initiated coverage on select Indian stocks across sectors such as broking, financials, IT, and auto. Analysts are bullish on major names such as Adani Power, Groww, Coforge, Tata Motors, and forecast an upside of up to 72% from current market levels. Here is a list of 8 stocks on which brokerages initiated coverage this week.",
            "pubDate": "2026-01-08T05:02:55.543897"
        },
        {
            "title": "Ahead of Q3, HDFC Securities recommends a buy on Infosys, HCL, 5 more IT stocks for up to 52% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-q3-hdfc-securities-recommends-a-buy-on-infosys-hcl-5-more-it-stocks-for-up-to-52-upside/slideshow/126406747.cms",
            "description": "The Indian IT services sector is heading into a seasonally weak Q3FY26, with tier-I players likely to post 0.6–2.1% QoQ constant-currency growth and mid-tier firms ranging from -1.8% to +3.4%, according to HDFC Securities. Furloughs and macro uncertainty are expected to weigh on near-term revenues. Despite these headwinds, the brokerage has identified seven buy-rated stocks, with upside potential of up to 52%.",
            "pubDate": "2026-01-08T05:02:55.544025"
        },
        {
            "title": "Hindustan Copper shares fall over 4% as copper prices retreat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-fall-over-4-as-copper-prices-retreat/articleshow/126407337.cms",
            "description": "Hindustan Copper shares fell sharply for a second session, tracking weakness in global copper prices after a strong rally. Profit-taking emerged as copper corrected from record highs, while elevated valuations and overbought technical indicators signalled near-term caution, despite the stock maintaining a positive broader trend and rising institutional interest.",
            "pubDate": "2026-01-08T05:34:49.156854"
        },
        {
            "title": "TVS Motor tops two-wheeler pack with 60% rally. How far can the fuel last?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-tops-two-wheeler-pack-with-60-rally-how-far-can-the-fuel-last/articleshow/126407126.cms",
            "description": "TVS Motor Company shares have surged 60% in the past year, outperforming peers and the Nifty index. With strong fundamentals and a supportive technical structure, brokerages anticipate further upside of up to 16%. The company's robust earnings growth and positive sales figures underpin this optimistic outlook.",
            "pubDate": "2026-01-08T05:34:49.156983"
        },
        {
            "title": "Jio IPO may re-rate Bharti Airtel, says Jefferies; raises target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-ipo-may-re-rate-bharti-airtel-says-jefferies-raises-target-price/articleshow/126407713.cms",
            "description": "Jefferies says Jio’s planned IPO in the first half of 2026 could act as a re-rating trigger for Bharti Airtel, aided by tariff hikes and a higher sector weight in indices. The brokerage has raised Bharti Airtel’s target price to Rs 2,760, implying 32% upside, and maintains it as its top pick in Indian telecom.",
            "pubDate": "2026-01-08T05:52:02.061502"
        },
        {
            "title": "HDFC Bank shares fall 4% in 4 sessions. Will Q3 results change the script?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-fall-4-in-4-sessions-will-q3-results-change-the-script/articleshow/126407511.cms",
            "description": "HDFC Bank shares saw a dip as investors await third-quarter results. Analysts predict steady balance-sheet growth. While margins may face some pressure, asset quality and cost discipline are expected to remain strong. The bank's expanding rural network is boosting market share. Investors will watch for priority sector lending compliance and borrowing repayment.",
            "pubDate": "2026-01-08T05:52:02.061627"
        },
        {
            "title": "Budget may tap oil windfall? JM Financial flags excise-duty risk for HPCL, BPCL, IOCL; backs Oil India, ONGC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-may-tap-oil-windfall-jm-financial-flags-excise-duty-risk-for-hpcl-bpcl-iocl-backs-oil-india-ongc/articleshow/126407733.cms",
            "description": "JM Financial advises caution on oil marketing companies (OMCs) like HPCL, IOCL, and BPCL due to potential excise duty hikes in the upcoming budget. The brokerage reiterates buy ratings on upstream producers Oil India and ONGC, citing attractive valuations and medium-term production growth potential amidst subdued crude prices.",
            "pubDate": "2026-01-08T05:59:32.554916"
        },
        {
            "title": "Indian top IT firms set for another tepid quarter on weak US demand, client spending",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-top-it-firms-set-for-another-tepid-quarter-on-weak-us-demand-client-spending/articleshow/126407753.cms",
            "description": "As Indian IT companies gear up for what is expected to be a slow quarter, weak demand from the U.S. continues to dampen tech spending. Market analysts project only slight increases in revenue and profits for leading firms. Nevertheless, the growing trend of AI integration and a potential resurgence in 2026 could provide a silver lining.",
            "pubDate": "2026-01-08T05:59:32.555037"
        },
        {
            "title": "Sensex tumbles 1,500 points in 4 days, Rs 7 lakh crore erased: Trump tariffs, 5 other reasons behind market sell-off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-tumbles-1500-points-in-4-days-rs-7-lakh-crore-erased-trump-tariffs-and-4-reasons-behind-market-sell-off/articleshow/126408655.cms",
            "description": "Why market is down today? Indian stock markets are experiencing a significant downturn. Benchmarks have fallen for four consecutive sessions. Investors are reacting to global geopolitical issues and potential U.S. tariffs. Corporate earnings reports are also mixed. This combination of factors is causing a broad market decline. The Sensex and Nifty 50 have both seen substantial losses.",
            "pubDate": "2026-01-08T07:32:08.495486"
        },
        {
            "title": "Kalyan Jewellers shares slip 1% despite 42% YoY revenue jump in Q3 update",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-jewellers-shares-slip-1-despite-42-yoy-revenue-jump-in-q3-update/articleshow/126408863.cms",
            "description": "Kalyan Jewellers’ shares slipped marginally on Thursday despite a strong Q3 update, with consolidated revenue surging 42% YoY on festive-driven demand. Same-store sales rose 27%, international revenue grew 36%, and Candere posted a 147% jump.",
            "pubDate": "2026-01-08T07:32:08.495606"
        },
        {
            "title": "NALCO shares retreat 6% after 4-day rally. Are metals losing momentum?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nalco-shares-retreat-6-after-4-day-rally-are-metals-losing-momentum/articleshow/126408237.cms",
            "description": "Shares of NALCO fell on Thursday, ending a four-day, 14% rally, as profit booking hit India’s metals sector. All 15 stocks on the Nifty Metal index traded lower amid cooling global commodity prices and stretched valuations.",
            "pubDate": "2026-01-08T07:32:08.495808"
        },
        {
            "title": "Japan's Nikkei slips a second day as AI, chemical shares give up gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slips-a-second-day-as-ai-chemical-shares-give-up-gains/articleshow/126409685.cms",
            "description": "Japan's Nikkei share average fell for a second day, impacted by profit-taking in AI stocks and escalating trade tensions with China. The Nikkei 225 dropped 1.6%, extending Wednesday's decline, as China launched an anti-dumping probe into Japanese chipmaking chemicals. SoftBank Group was a significant loser, sliding 7.6%.",
            "pubDate": "2026-01-08T07:46:23.161207"
        },
        {
            "title": "Export-heavy stocks bleed on Trump's 500% tariff signal; Gokaldas, Avanti crack up to 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/export-heavy-stocks-bleed-on-trumps-500-tariff-signal-gokaldas-avanti-crack-up-to-12/articleshow/126410040.cms",
            "description": "Export-oriented stocks fell sharply on Thursday as fresh US political signals stoked fears of extremely high import duties. Shares of seafood, textile, pharmaceutical, and metal companies dropped amid concerns that a proposed bipartisan Russia sanctions bill could raise tariffs on Russian imports to 500%, potentially affecting countries like India, China, and Brazil, triggering investor caution over global trade risks.",
            "pubDate": "2026-01-08T08:20:08.441890"
        },
        {
            "title": "Time to look & think beyond volatility: 6 large-caps stocks from different sectors with an upside potential of up to 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-look-think-beyond-volatility-6-large-caps-stocks-from-different-sectors-with-an-upside-potential-of-up-to-30/articleshow/126409886.cms",
            "description": "While the mood of the market has turned bullish, volatility is ever-present. So, it is best to be always ready for it. And there is a high probability that we might see more of it in the coming months. How does one prepare for volatility? One of the ways is to stay with large-cap stocks, especially those that have shown a streak of outperformance despite the downturn and volatility, even when other large caps came under pressure.",
            "pubDate": "2026-01-08T08:20:08.442018"
        },
        {
            "title": "F&O Radar | Laurus Labs signals strong bullish trend; how to play the upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-laurus-labs-signals-strong-bullish-trend-how-to-play-the-upside/articleshow/126409897.cms",
            "description": "Laurus Labs shares are surging, hitting a new all-time high near Rs 1,128.50. Analysts see strong bullish momentum, with the stock trading above key moving averages and a rising RSI. Immediate resistance is at Rs 1,150, with a potential rally towards Rs 1,233.",
            "pubDate": "2026-01-08T08:20:08.442220"
        },
        {
            "title": "Will BSE, NSE be closed on January 15 as Maharashtra declares civic poll holiday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-bse-nse-be-closed-on-january-15-as-maharashtra-declares-civic-poll-holiday/articleshow/126410428.cms",
            "description": "Maharashtra has declared January 15, 2026, a public holiday for civic polls, but it’s still unclear whether financial markets will remain open or closed on the day. The BSE, NSE and MCX have not announced a trading holiday. The date also coincides with the weekly expiry of Sensex derivatives, adding to market uncertainty.",
            "pubDate": "2026-01-08T08:49:06.316184"
        },
        {
            "title": "Hindustan Zinc shares tumble 10% in two days! Should investors buy this dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-tumble-10-in-two-days-should-investors-buy-this-dip/articleshow/126410474.cms",
            "description": "Hindustan Zinc shares fell up to 6.5% to Rs 588 on Thursday, extending a two-day decline that has erased 10% of its value, as silver prices dropped sharply by Rs 7,000 per kg to Rs 2,43,704 on the MCX. Silver ETFs also edged lower, reflecting weakness in the underlying metal and weighing on sentiment for the precious metal producer.",
            "pubDate": "2026-01-08T08:49:06.316293"
        },
        {
            "title": "10 microcap stocks surge up to 200% in FY26 so far,  4 turn multibaggers. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-microcap-stocks-surge-up-to-200-in-fy26-so-far-4-turn-multibaggers-do-you-own-any/slideshow/126410316.cms",
            "description": "The fiscal year FY26 has been quite the ride for the markets. The benchmark Nifty has surged around 11%, and even the Nifty Microcap 250 hasn’t lagged far behind, climbing roughly 10%. But the real excitement is hidden in the details. Within the Microcap 250, about 75 stocks have posted stellar gains, ranging anywhere from 20% to a staggering 200% in just these nine months. And for a select few, the rewards have been truly extraordinary: four of these microcap gems have more than doubled investors’ wealth in just over nine months of FY26. Here are the top 10 stocks that have surged more than 80% in FY26 so far. (Data Source: ACE Equity).",
            "pubDate": "2026-01-08T08:49:06.316390"
        },
        {
            "title": "Zerodha’s Nithin Kamath explains why tracking lock-in expiries is a must for IPO investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodhas-nithin-kamath-explains-why-tracking-lock-in-expiries-is-a-must-for-ipo-investors/articleshow/126411606.cms",
            "description": "Zerodha CEO Nithin Kamath urges IPO investors to track lock-in expiries, warning that post-expiry selling by large shareholders can pressure stocks. He also highlights regulatory limits on broker growth, including SEBI’s 15% open interest cap.",
            "pubDate": "2026-01-08T09:42:58.463284"
        },
        {
            "title": "European shares' momentum wanes as investors weigh earnings, geopolitics",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-momentum-wanes-as-investors-weigh-earnings-geopolitics/articleshow/126411136.cms",
            "description": "European shares deepened their pullback on Thursday as investors recalibrated bets following a strong start to the year, with geopolitical risks and major earnings ‌updates in ‌focus.",
            "pubDate": "2026-01-08T09:42:58.463406"
        },
        {
            "title": "Vedanta shares slide 4% as metal stocks reel under broad sell-off. Is the dip worth buying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-slide-4-as-metal-stocks-reel-under-broad-sell-off-is-the-dip-worth-buying/articleshow/126410920.cms",
            "description": "Vedanta shares fell sharply on Thursday to an intraday low of Rs 595 on the BSE amid a broad metal sector sell-off. Weakness in global and domestic commodity prices, coupled with profit booking after recent highs near Rs 630, pressured the stock, with near-term support seen around Rs 580 for potential buying.",
            "pubDate": "2026-01-08T09:42:58.463623"
        }
    ]
}