{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-18T19:28:01.054643",
    "items": [
        {
            "title": "GIFT Nifty down 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125398804.cms",
            "description": "Nifty closed above 26,000 on Monday, buoyed by positive Q2 earnings and strong domestic factors. Analysts anticipate a continued upward trend, with support at the 21-DMA around 25,790. The market sentiment remains bullish, presenting buying opportunities on pullbacks.",
            "pubDate": "2025-11-18T01:44:30.937562"
        },
        {
            "title": "Stocks in news: RIL, Tata Power, JSW Energy, HCL Tech, Inox Green",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-tata-power-jsw-energy-hcl-tech-inox-green/articleshow/125398778.cms",
            "description": "Indian markets climbed for a sixth day, with Nifty nearing 26,013. Investors watch global cues amid US market volatility. RIL's beauty arm partnered with Germany's cosnova Beauty. Tata Power commissioned a 300 MW solar project. KPI Green secured a Rs 696.50 crore solar project order. Inox Green faced grid connectivity issues for a wind project.",
            "pubDate": "2025-11-18T01:44:30.937677"
        },
        {
            "title": "Asian stocks decline ahead of Nvidia earnings, US jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-decline-ahead-of-nvidia-earnings-us-jobs-data/articleshow/125398758.cms",
            "description": "Asian markets opened lower following a Wall Street slide. Investors are cautious, moving away from risky assets. This sentiment is driven by upcoming Nvidia earnings and a crucial US jobs report. Global stock gauges are at a one-month low. Bitcoin also saw a significant drop. Uncertainty surrounds interest rates and tech valuations.",
            "pubDate": "2025-11-18T01:44:30.937852"
        },
        {
            "title": "Can Groww sustain its rally, or is a correction around the corner?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-groww-sustain-its-rally-or-is-a-correction-around-the-corner/articleshow/125398728.cms",
            "description": "Groww's parent company, Billionbrains Garage Ventures, has achieved a market capitalization exceeding ₹1 lakh crore. This milestone follows a significant surge in its stock price since its listing. Analysts are cautioning investors about potential overvaluation. New investors are advised to wait for dips before entering the market.",
            "pubDate": "2025-11-18T01:44:30.937935"
        },
        {
            "title": "AI story could unwind next year and India's likely to benefit: CLSA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-story-could-unwind-next-year-and-indias-likely-to-benefit-clsa/articleshow/125398695.cms",
            "description": "CLSA's equity strategist predicts an AI bubble burst within a year due to concerns over returns on significant sector investments. This sell-off is expected to benefit India as investors reallocate funds from Taiwan and Korea, seeking less frothy markets. India's appeal lies in its cheaper valuations and the exhaustion of alternative investment options.",
            "pubDate": "2025-11-18T01:44:30.938014"
        },
        {
            "title": "Can Hero MotoCorp sustain its fast-paced gains with rising exports, EV sales?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-hero-motocorp-sustain-its-fast-paced-gains-with-rising-exports-and-ev-momentum/articleshow/125398591.cms",
            "description": "Hero MotoCorp's stock reached a 52-week high following a strong second quarter with double-digit revenue and profit growth. The company achieved a record market share for its VIDA EV brand and saw significant growth in global dispatches. Analysts maintain a 'buy' rating, anticipating continued sales volume growth driven by new launches and improving rural demand.",
            "pubDate": "2025-11-18T01:44:30.938106"
        },
        {
            "title": "IL&FS moves NCLAT to update CoC vote shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ilfs-moves-nclat-to-update-coc-vote-shares/articleshow/125398556.cms",
            "description": "IL&FS is adjusting creditor voting rights in committees. This change reflects current outstanding debt after nearly ₹18,000 crore in interim payouts. Some lenders' voting power will decrease as their debt has been substantially repaid. This move aims to ensure fair decision-making in asset sales, preventing outdated claims from influencing outcomes. Major IL&FS assets will see shifts in committee makeup.",
            "pubDate": "2025-11-18T01:44:30.938188"
        },
        {
            "title": "Sebi starts review of corporate disclosure rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-starts-review-of-corporate-disclosure-rules/articleshow/125398493.cms",
            "description": "The Securities and Exchange Board of India is simplifying corporate disclosure rules. A review of Listing Obligations and Disclosure Requirements is underway. Sebi is also overhauling settlement regulations and other norms for stockbrokers and mutual funds. A closing-auction mechanism for equity markets is nearing implementation. Efforts are also focused on easing fundraising processes for companies.",
            "pubDate": "2025-11-18T01:44:30.938266"
        },
        {
            "title": "Bharti Airtel gets S&P upgrade backed by strong Q2 earnings, cash flow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-gets-sp-upgrade-backed-by-strong-q2-earnings-cash-flow-reliance-jio-ipo/articleshow/125398630.cms",
            "description": "Bharti Airtel's credit rating has been upgraded by S&P Global Ratings. This reflects the company's strong earnings and cash flow. The upgrade is expected to drive continued debt reduction over the next 12 to 24 months. Airtel's financial flexibility is anticipated to improve. This positive outlook is supported by rational industry competition and tariff hikes.",
            "pubDate": "2025-11-18T01:44:30.938430"
        },
        {
            "title": "Nomura's India fixed-income chief resigns amid reports of inflated profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomuras-india-fixed-income-chief-resigns-amid-reports-of-inflated-profits/articleshow/125398542.cms",
            "description": "Ujjwal Kumar, managing director of Nomura Fixed Income Securities, has resigned following a Bloomberg report alleging Nomura Holdings is investigating its India fixed-income unit for potentially inflated profits. The company denies any compliance investigation into the issues described, despite a recent net loss in the September quarter attributed to mark-to-market losses.",
            "pubDate": "2025-11-18T01:44:30.938506"
        },
        {
            "title": "LIC seeks GST relief, tax-free premium hike to boost sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-seeks-gst-relief-tax-free-premium-hike-to-boost-sales/articleshow/125398536.cms",
            "description": "LIC has urged the government to implement tax and regulatory changes in the upcoming budget to boost policy sales and insurer margins. Key proposals include treating insurance services as 'zero-rated' for GST to allow input tax credit claims and increasing the tax-free maturity proceeds limit to ₹10 lakh annually.",
            "pubDate": "2025-11-18T01:44:30.938585"
        },
        {
            "title": "Emmvee Photovoltaic shares list flat at IPO price of Rs 217 on BSE, NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emmvee-photovoltaic-shares-list-flat-at-ipo-price-of-rs-217-on-bse-nse/articleshow/125401452.cms",
            "description": "Emmvee Photovoltaic Power made its market debut on Tuesday, priced at Rs 217 per share. The initial public offering attracted moderate interest, reflecting a cautious appetite among investors. As a leading manufacturer of solar PV modules and cells, the company has demonstrated impressive financial results for FY25. The funds raised will primarily focus on reducing existing debt.",
            "pubDate": "2025-11-18T04:47:08.256713"
        },
        {
            "title": "PhysicsWallah shares make a strong D-St debut, list at 33% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallah-share-price-edtech-player-makes-strong-d-st-debut-lists-at-33-premium-over-ipo-price/articleshow/125401417.cms",
            "description": "PhysicsWallah share price: PhysicsWallah shares debuted with a significant premium on Tuesday, listing at 33% on the NSE and 31% on the BSE. The Rs 3,481 crore IPO saw strong QIB subscription, though NII participation was weak. The company aims to expand its hybrid model with IPO proceeds funding offline centers, marketing, and acquisitions.",
            "pubDate": "2025-11-18T04:47:08.256850"
        },
        {
            "title": "Peter Thiel’s Nvidia exit sparks fresh AI bubble fears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/peter-thiels-nvidia-exit-sparks-fresh-ai-bubble-fears/slideshow/125401436.cms",
            "description": "Fresh concerns are emerging on Wall Street as Peter Thiel’s hedge fund, Thiel Macro, has fully exited its Nvidia position, raising questions around whether the AI boom is losing steam. (Source: Reuters)",
            "pubDate": "2025-11-18T04:47:08.256959"
        },
        {
            "title": "Paytm shares fall 2% as PE funds offload stake in Rs 1,640-crore block deal: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-fall-2-as-pe-funds-offload-stake-in-rs-1640-crore-block-deal-report/articleshow/125401275.cms",
            "description": "Paytm’s parent One97 Communications slipped up to 2% to Rs 1,305 after a major block deal on Tuesday. According to a report, SAIF III Mauritius, SAIF Partners and Elevation Capital offloaded up to 2% of the company’s equity at a floor price of Rs 1,281, about 3.9% below Monday’s close. The sellers will also be subject to a 60-day lock-in.",
            "pubDate": "2025-11-18T04:47:08.257062"
        },
        {
            "title": "Q2 winners: Hero MotoCorp, Marico, 8 smallcaps enter Nuvama’s buy list; offer up to 56% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-winners-hero-motocorp-marico-8-smallcaps-enter-nuvamas-buy-list-offer-up-to-56-upside/slideshow/125401132.cms",
            "description": "Nuvama Institutional Equities has rolled out a fresh set of fundamental ideas across sectors after companies delivered strong Q2 earnings beats. The brokerage has upgraded targets and reinforced ‘Buy’ calls on 10 stocks, citing robust demand trends, margin expansion, and healthy order books. In this 2 are midcaps while the rest are smallcap picks with 7–44% upside potential. Take a look!",
            "pubDate": "2025-11-18T04:47:08.257160"
        },
        {
            "title": "SEC tightens grounds for skipping shareholder votes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sec-tightens-grounds-for-skipping-shareholder-votes/slideshow/125401165.cms",
            "description": "The SEC has revised its process for reviewing company requests to skip shareholder votes. This shift is expected to make it harder for activists to push proposals on sensitive topics such as climate change and workforce diversity.",
            "pubDate": "2025-11-18T04:47:08.257257"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains overweight on Eternal; Nuvama sees 30% upside in Max Healthcare",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-overweight-on-eternal-nuvama-sees-30-upside-in-max-healthcare/articleshow/125400910.cms",
            "description": "Brokerages like Morgan Stanley and Nuvama are optimistic about key sectors, citing strong earnings and improving fundamentals. Morgan Stanley sees a buying opportunity in Eternal, while Nuvama reiterates Buy ratings on Ahluwalia Contracts and Max Healthcare, driven by robust performances, margin expansion, and solid growth visibility for the next 12 months.",
            "pubDate": "2025-11-18T04:47:08.257354"
        },
        {
            "title": "AstraZeneca Pharma India shares surge over 3% on new Hyperkalaemia drug deal with Sun Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/astrazeneca-pharma-india-shares-in-focus-on-new-hyperkalemia-drug-deal-with-sun-pharma/articleshow/125400846.cms",
            "description": "On Tuesday, shares of AstraZeneca Pharma India surged following the announcement of an exciting alliance with Sun Pharmaceutical Industries. Together, they are set to enhance the availability of Sodium Zirconium Cyclosilicate, which combats hyperkalemia. AstraZeneca will introduce this treatment to the market under the name Lokelma, while Sun Pharma will distribute it as Gimliand.",
            "pubDate": "2025-11-18T04:47:08.257449"
        },
        {
            "title": "Sensex slips 200 pts, Nifty dips below 26,000 as D-St turns cautious after 6 day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-200-pts-nifty-dips-below-26000-as-d-st-turns-cautious-after-6-day-rally/articleshow/125400839.cms",
            "description": "Indian stocks opened lower on Tuesday, snapping a six-day winning streak. Both the Sensex and Nifty saw declines as investors adopted a cautious stance. This pullback comes ahead of key U.S. economic data that could influence the Federal Reserve's decision on interest rates next month.",
            "pubDate": "2025-11-18T04:47:08.257548"
        },
        {
            "title": "FIIs trim stakes in GRSE, BDL and 10 more defence stocks in Sept. Why is the firepower lacking?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-trim-stakes-in-grse-bdl-and-10-more-defence-stocks-in-sept-why-is-the-firepower-lacking/articleshow/125400751.cms",
            "description": "Foreign institutional investors reduced stakes in several Indian defence stocks during the September quarter, citing valuation concerns and slower-than-expected order inflows. Despite this pullback, mutual funds showed increased buying interest, indicating a selective shift in investor preference within the sector.",
            "pubDate": "2025-11-18T04:47:08.257640"
        },
        {
            "title": "Eternal shares to breach Rs 400? Morgan Stanley lists 3 reasons",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-to-breach-rs-400-morgan-stanley-lists-3-reasons/articleshow/125400710.cms",
            "description": "Eternal (formerly Zomato) shares dipped slightly despite Morgan Stanley raising its target price to Rs 427, citing an attractive buying window after a recent correction. The brokerage believes the company's market share gains are positive, with limited downside risk even in a stress scenario. Despite a 63% year-on-year profit decline, revenue surged 183%.",
            "pubDate": "2025-11-18T04:47:08.257733"
        },
        {
            "title": "Siemens & Hero MotoCorp among 9 stocks flash bullish signals, hinting at a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siemens-hero-motocorp-among-9-stocks-flash-bullish-signals-hinting-at-a-possible-uptrend/slideshow/125400690.cms",
            "description": "On November 17, in the Nifty500 pack, nine stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-11-18T04:47:08.257824"
        },
        {
            "title": "Mphasis shares drop 2% as Blackstone likely sells 9.5% stake in Rs 4,600-crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mphasis-shares-in-focus-as-blackstone-set-to-offload-stake-via-rs-4600-crore-block-deal-report/articleshow/125400587.cms",
            "description": "Mphasis shares are expected to see significant movement on Tuesday, November 18. Promoter Blackstone is looking to sell a substantial stake of up to 9.5% through block deals. The floor price is set at Rs 2,570 per share. This transaction is estimated to be worth around Rs 4,626 crore. Blackstone previously reduced its holding in June 2023.",
            "pubDate": "2025-11-18T04:47:08.257937"
        },
        {
            "title": "Multibagger hunt: 4 stocks with biggest 12-month upside potential of up to 164%. Own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-hunt-4-stocks-with-biggest-12-month-upside-potential-of-up-to-164-own-any/slideshow/125400494.cms",
            "description": "A new set of forward-looking market estimates from Trendlyne highlighted four stocks with strong potential upside over the next one year. These companies show projected gains ranging from 119% to 164%, placing them among the most promising mid-sized names in the market. Here is a simple breakdown of the stocks that screen strongly on expected returns.",
            "pubDate": "2025-11-18T04:47:08.258038"
        },
        {
            "title": "A math question: At Rs 1 lakh crore, did Groww shares run too far ahead too soon?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-math-question-at-rs-1-lakh-crore-did-groww-shares-run-too-far-ahead-too-soon/articleshow/125400212.cms",
            "description": "Groww's stock has surged over 70% post-IPO, surpassing Rs 1 lakh crore valuation. While strong financials and user growth support the rally, current valuations appear rich compared to peers. Regulatory risks concerning F&O trading and the sustainability of high margins pose challenges for investors.",
            "pubDate": "2025-11-18T04:47:08.258133"
        },
        {
            "title": "Groww’s market value is now bigger than 8 other listed brokers combined. 5 factors behind the surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/growws-market-value-is-now-bigger-than-8-other-listed-brokers-combined-5-factors-behind-the-surge/slideshow/125400135.cms",
            "description": "In a landmark moment for Indian fintech, Groww’s market cap has surged past Rs 1 lakh crore, overtaking the combined value of eight listed brokerage and wealth firms, barring Motilal Oswal. Together, these eight firms add up to Rs 99,827 crore -- still short of Groww alone. The move reflects a decisive shift in investor preference towards digital-native platforms as India’s retail investing boom deepens.",
            "pubDate": "2025-11-18T04:47:08.258226"
        },
        {
            "title": "Groww shares nearly double from issue price in just 5 sessions! Can investors still buy the stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-nearly-double-from-issue-price-in-just-5-sessions-can-investors-still-buy-the-stock/articleshow/125401996.cms",
            "description": "Billionbrains Garage Ventures, parent of Groww, extended its post-listing rally, hitting a record Rs 194 after strong IPO demand and rapid platform growth. Analysts cite user scale, low acquisition costs and AUM strength as positives, though valuations and regulation remain risks. Allottees are advised to hold, while others await meaningful corrections.",
            "pubDate": "2025-11-18T05:12:57.774212"
        },
        {
            "title": "Sensex target for 2026 at 107,000? Morgan Stanley makes big prediction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-target-for-2026-at-107000-morgan-stanley-makes-big-prediction/articleshow/125401942.cms",
            "description": "Morgan Stanley expects the Indian market to regain momentum by 2026 and has set a bull-case Sensex target of 1,07,000 by December 2026. With a 30% probability, this optimistic scenario assumes low oil prices, favourable global trade shifts, supportive policies, and strong economic growth, which could drive Sensex earnings to grow 19% annually through FY25–28.",
            "pubDate": "2025-11-18T05:12:57.774318"
        },
        {
            "title": "Markets bet on slower hikes as Takaichi pushes for caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-bet-on-slower-hikes-as-takaichi-pushes-for-caution/slideshow/125401807.cms",
            "description": "Bank of Japan Governor Kazuo Ueda will meet Prime Minister Sanae Takaichi on Tuesday for their first bilateral discussion. The meeting comes as the yen hits a nine-month low, prompting concern over volatile currency moves and the policy direction Japan will take next. (Source: Reuters)",
            "pubDate": "2025-11-18T05:12:57.774417"
        },
        {
            "title": "Japan's Nikkei falls 3% on tech selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-3-on-tech-selloff/articleshow/125402873.cms",
            "description": "Japan's Nikkei share average experienced its largest decline in over seven months, falling 3% on Tuesday. This sell-off was driven by investors shedding tech stocks, mirroring a sharp overnight drop on Wall Street. The index's fall below the key 50,000 level accelerated the decline as sentiment worsened.",
            "pubDate": "2025-11-18T05:52:59.243270"
        },
        {
            "title": "Kaynes Tech tumbles 6% as 11.6 million shares become eligible to trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-tech-tumbles-6-as-11-6-million-shares-become-eligible-to-trade/articleshow/125402729.cms",
            "description": "Shares of Kaynes Technology India Ltd. fell sharply on Tuesday as 11.6 million shares exited the lock-in period, making them eligible for trading. However, this does not necessarily mean these shares will be sold immediately. The company reported strong quarterly earnings, with net profit rising 102% and a robust order book.",
            "pubDate": "2025-11-18T05:52:59.243399"
        },
        {
            "title": "Jefferies starts WeWork coverage with buy call, says 5 tailwinds could push shares 30% higher",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-starts-wework-coverage-with-buy-call-says-5-tailwinds-could-push-shares-30-higher/articleshow/125402192.cms",
            "description": "WeWork India shares saw a significant jump after Jefferies initiated coverage with a buy rating. The brokerage believes the company is entering a multi-year growth phase. This growth is expected to be driven by strong demand for premium flexible workspaces and operational efficiencies. WeWork India is positioned as a leader in the expanding Indian market.",
            "pubDate": "2025-11-18T05:52:59.243609"
        },
        {
            "title": "PhysicsWallah shares soar 13% in debut trade after solid listing pop. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallah-shares-soar-13-in-debut-trade-after-solid-listing-pop-should-you-buy-sell-or-hold/articleshow/125403050.cms",
            "description": "PhysicsWallah shares jumped up to 13% in their market debut after listing at a strong premium over the IPO price, sparking immediate interest among investors. While the edtech firm posted robust revenue growth and returned to profit, analysts remain divided, urging investors to balance optimism with caution amid competitive and regulatory risks.",
            "pubDate": "2025-11-18T06:45:02.587045"
        },
        {
            "title": "Eternal extends leadership in both quick commerce & food delivery, Bernstein says citing 5 data points",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-extends-leadership-in-both-quick-commerce-food-delivery-bernstein-says-citing-5-data-points/articleshow/125407513.cms",
            "description": "Bernstein says Eternal dominates India’s e-commerce through Blinkit and Zomato, leading app downloads, market share, and user growth as quick commerce rises and food delivery becomes a two-player race.",
            "pubDate": "2025-11-18T09:51:07.442887"
        },
        {
            "title": "Volume Shocker: MFs add over 1 crore shares to 10 stocks in October, prices surge up to 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/volume-shocker-mfs-add-over-1-crore-shares-to-10-stocks-in-october-prices-surge-up-to-34/slideshow/125407482.cms",
            "description": "In today's mutual fund analysis, ETMarkets highlighted the stocks that saw the highest share increases from mutual funds in October 2025, compared to September 2025. The report revealed that 30 stocks experienced an addition of over 1 crore shares each, indicating strong buying interest from mutual fund houses.However, to zero in on the most promising investment opportunities from this broad list, we applied a second filter. Shortlisted only those stocks that not only saw high mutual fund accumulation but also delivered over 10% price gain since the start of October. This two-step screening process helped them narrow the focus to just 10 standout stocks, those that demonstrated both strong institutional interest and solid market performance. (Data Source: ACE MF, ACE Equity)",
            "pubDate": "2025-11-18T09:51:07.443010"
        },
        {
            "title": "European shares slide on Fed rate cut worries, tech valuations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-slide-on-fed-rate-cut-worries-tech-valuations/articleshow/125406572.cms",
            "description": "European shares fell to a one-week low on Monday, tracking a broad risk-off mood across global markets, sparked by worries about an overvalued tech sector and diminishing prospects of an imminent interest rate cut from the U.S. Federal Reserve.",
            "pubDate": "2025-11-18T09:51:07.443129"
        },
        {
            "title": "For investors with a 1- to 2-year time horizon: 7 mid-cap stocks from different sectors with upside potential of more than 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-a-1-to-2-year-time-horizon-7-mid-cap-stocks-from-different-sectors-with-upside-potential-of-more-than-28/articleshow/125404454.cms",
            "description": "The mid-cap segment is more susceptible to volatility. But remember: If you stick with them, mid-caps are capable of giving you better returns than other segments of the market. The only trouble, whether we like it or not, is that short-term volatility tends to cause confusion and one might end up making wrong decisions (both in buying and selling) which are driven by sentiment and not reason. A few steps, which include just looking at some basic facts about the company and business, will help bring clarity to decision-making and help improve returns.",
            "pubDate": "2025-11-18T09:51:07.443238"
        },
        {
            "title": "Tenneco Clean Air Listing Tomorrow: GMP hints at solid market debut for the Rs 3,600-crore IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tenneco-clean-air-listing-tomorrow-gmp-hints-at-solid-market-debut-for-the-rs-3600-crore-ipo/articleshow/125404280.cms",
            "description": "Tenneco Clean Air's Rs 3,600 crore IPO will list on November 19. Grey market trends suggest a 29% premium, with shares potentially opening at Rs 512. The IPO saw overwhelming demand, subscribing 61.79 times. Strong investor interest is driven by the company's market position and financial performance. Allotment status can be checked on the registrar's website or BSE.",
            "pubDate": "2025-11-18T09:51:07.443340"
        },
        {
            "title": "Reliance Jio, NSE, Flipkart and more: The who’s who of India Inc lining up $20-billion IPOs for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-jio-nse-flipkart-and-more-the-whos-who-of-india-inc-lining-up-20-billion-ipos-for-2026/articleshow/125409517.cms",
            "description": "India’s primary market is set for a landmark 2026, with marquee names like Reliance Jio, NSE, PhonePe, Flipkart, OYO and SBI Mutual Fund preparing IPOs that could collectively raise up to $20 billion. After a record five-year fundraising boom, promoters and PE investors are accelerating listings amid strong domestic participation and deepening capital markets.",
            "pubDate": "2025-11-18T10:54:09.379721"
        },
        {
            "title": "Market Wrap: Sensex drops 278 pts, Nifty slips under 26,000 as 6-day D-St run comes to a halt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-drops-278-pts-nifty-slips-under-26000-as-6-day-d-st-run-comes-to-a-halt/articleshow/125408397.cms",
            "description": "Indian stocks experienced a pullback on Tuesday, ending a six-session winning streak as volatility surrounding the Nifty's weekly expiry prompted traders to step back. The Sensex and Nifty both closed lower, despite positive developments in potential India-U.S. trade pact negotiations.",
            "pubDate": "2025-11-18T10:54:09.379843"
        },
        {
            "title": "10 stocks in Morgan Stanley's focus portfolio as it bets on a revival in Indian equities in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-stocks-in-morgan-stanleys-focus-portfolio-as-it-bets-on-a-revival-in-indian-equities-in-2026/slideshow/125408407.cms",
            "description": "Morgan Stanley says Indian equities are poised to “regain their mojo in 2026” after their worst relative performance in 31 years, citing a policy pivot that is reviving nominal growth, forecasting a bull-case Sensex target of 107,000 by December 2026. Even the brokerage’s base case sees the benchmark reaching 95,000, driven by macro stability, fiscal consolidation, private investment and potential monetary easing. In this backdrop, Morgan Stanley has built a focus portfolio of 10 Overweight-rated stocks it believes are best positioned to benefit from India’s cyclical recovery.",
            "pubDate": "2025-11-18T10:54:09.379944"
        },
        {
            "title": "Barely 6 weeks after listing, this stock is close to doubling after a 56% rally in 12 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/barely-6-weeks-after-listing-this-stock-is-close-to-doubling-after-a-56-rally-in-12-days/articleshow/125408431.cms",
            "description": "Barely six weeks after a muted listing, Anand Rathi Shares and Stock Brokers has turned into a striking momentum play, soaring 56% in 12 sessions and nearly doubling from its IPO price. The sharp spike in the shares has also alarmed the bourses. The exchanges have sought clarification from the company as investors track whether the company can sustain growth and margins amid intense broking competition.",
            "pubDate": "2025-11-18T10:54:09.380052"
        },
        {
            "title": "Investor alert: Groww short sellers feared trapped with over 30 lakh shares under auction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investor-alert-groww-short-sellers-feared-trapped-with-over-30-lakh-shares-under-auction/articleshow/125412041.cms",
            "description": "Groww’s sharp post-listing rally and limited free float pushed a large volume of undelivered shares into auction, trapping short sellers as scarce supply and rising prices sparked heavy delivery defaults and potential high auction losses.Groww’s sharp post-listing rally and limited free float pushed a large volume of undelivered shares into auction, trapping short sellers as scarce supply and rising prices sparked heavy delivery defaults and potential high auction losses",
            "pubDate": "2025-11-18T13:04:53.369369"
        },
        {
            "title": "Stock Radar: RIL stock breaks out from a cup & handle pattern on daily charts; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-ril-stock-breaks-out-from-a-cup-handle-pattern-on-daily-charts-what-should-investors-do/articleshow/125385339.cms",
            "description": "Reliance Industries Ltd. broke out of a cup and handle pattern on daily charts in November 2025, signaling a potential upward move. Experts suggest short-term traders can buy the stock for a target above 1600 levels in the medium term. The stock has shown strong support above its 200-DMA and positive momentum indicators.",
            "pubDate": "2025-11-18T13:04:53.369495"
        },
        {
            "title": "Gainers & Losers: Groww, Physicswallah and Paytm among 7 stocks that moved most on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-groww-physicswallah-and-paytm-among-7-stocks-that-moved-most-on-tuesday/slideshow/125409774.cms",
            "description": "",
            "pubDate": "2025-11-18T13:04:53.369604"
        },
        {
            "title": "Bubble or breakout? Nvidia earnings put AI boom under the microscope",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bubble-or-breakout-nvidia-earnings-put-ai-boom-under-the-microscope/articleshow/125410771.cms",
            "description": "Nvidia’s earnings on Wednesday will be pivotal for Wall Street’s massive AI bets, as bubble worries grow after a sharp November pullback. Despite strong chip demand and $500 billion in bookings, margins face pressure from rapid product cycles, rising complexity and stiff export curbs to China. Investors also remain wary of big-ticket AI investments.",
            "pubDate": "2025-11-18T13:04:53.369701"
        },
        {
            "title": "Infosys' Rs 18,000 crore share buyback window to open on Nov 20",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-rs-18000-crore-share-buyback-window-to-open-on-november-20-and-close-on-november-26/articleshow/125413123.cms",
            "description": "Infosys received shareholders' approval on November 6 for the share buyback up to ten crore fully paid-up equity shares of the company.",
            "pubDate": "2025-11-18T13:39:04.474535"
        },
        {
            "title": "These 8 banking stocks can give more than 23% returns in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-8-banking-stocks-can-give-more-than-23-returns-in-1-year-according-to-analysts/articleshow/125415754.cms",
            "description": "What is the bigger problem for the banking system? Lack of credit growth? Or high credit growth today – but with a clear risk of bigger NPAs at a later date? In India, it is important for banks to maintain credit quality. Yes, in terms of growth, there are a few challenges. But the fact is that, unlike 10 years ago, when even in a bad economic environment banks pushed credit to undeserving corporates and retail borrowers, they are now focused on the quality of their loans book. And the street is also taking that into consideration. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks along with detailed company analysis focusing on five key components ,earnings, fundamentals, relative valuation, risk, and price momentum, to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2025-11-18T17:21:46.888158"
        },
        {
            "title": "Market Trading Guide: Buy Aether, HUDCO and 2 more stocks on Wednesday for up to 9% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-aether-hudco-and-2-more-stocks-on-wednesday-for-up-to-9-gains-heres-why/slideshow/125415907.cms",
            "description": "Headline index Nifty today ended its six-session gaining streak to finish in the red amid selling pressure in IT, FMCG and pharma stocks. The Nifty remained confined within a 150-point range, marking the second consecutive day of consolidation.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that a bearish engulfing pattern has formed on the daily chart, suggesting a pause in the ongoing price rise. \"The hourly RSI has entered a bearish crossover, and the index has formed a lower top on the hourly timeframe, indicating an initial weakening of the trend. On the lower end, support is placed at 25,850; a fall below this level might trigger further correction towards 25,700. On the other hand, resistance is visible at 26,000–26,050, above which the trend may reverse,\" he saidHere are 4 stock recommendations for Wednesday:",
            "pubDate": "2025-11-18T17:21:46.888284"
        },
        {
            "title": "Rajiv Jain's GQG Partners hikes stake in 5 Adani Group companies in Rs 5,094-cr block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rajiv-jains-gqg-partners-hikes-stake-in-5-adani-group-companies-in-rs-5094-cr-block-deal/articleshow/125415495.cms",
            "description": "GQG Partners increased its holdings across five Adani Group companies through large block deals, buying shares from Reliance Trust as part of a multi-crore investment push in key entities spanning energy, ports and infrastructure.",
            "pubDate": "2025-11-18T17:21:46.888391"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/125415079.cms",
            "description": "",
            "pubDate": "2025-11-18T17:21:46.888496"
        },
        {
            "title": "Dow falls 500 points, S&P, Nasdaq plunge over 1% as valuation concerns, rate-cut jitters linger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-as-valuation-concerns-rate-cut-jitters-linger/articleshow/125414219.cms",
            "description": "Wall Street stocks declined Tuesday, with the Dow, S&P 500, and Nasdaq all falling amid tech sector worries and concerns about consumer spending strength. Valuation concerns for AI-linked stocks and a potential Federal Reserve rate hold impacted the market. Home Depot's missed earnings and lowered outlook further fueled fears of a discretionary spending slowdown.",
            "pubDate": "2025-11-18T17:21:46.888598"
        },
        {
            "title": "HUL sets December 5 as record date for demerger of ice-cream business Kwality Wall's. Scheme effective on Dec 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-sets-december-5-as-record-date-for-demerger-of-ice-cream-business-kwality-walls-scheme-effective-on-dec-1/articleshow/125413934.cms",
            "description": "Hindustan Unilever has set December 5, 2025, as the record date for the demerger of its ice-cream business into Kwality Wall’s (India) Limited. This move aims to unlock value by separating the high-growth segment, with The Magnum Ice Cream Company acquiring a majority stake.",
            "pubDate": "2025-11-18T17:21:46.888698"
        },
        {
            "title": "Two Trades for Today: A telecom services provider for a 4.95% gain, a mid-cap automobile stock for a rise of about 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-telecom-services-provider-for-a-4-95-gain-a-mid-cap-automobile-stock-for-a-rise-of-about-7/articleshow/125413513.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-18T17:21:46.888794"
        },
        {
            "title": "ET Prime Special: How auditors try to tell you about corporate governance issues & how companies hide their liabilities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-prime-special-how-auditors-try-to-tell-you-about-corporate-governance-issues-how-companies-hide-their-liabilities/articleshow/125416507.cms",
            "description": "Let’s start by going back a bit. To school. Class 11 commerce students are taught the “principle of prudence”: Anticipate all likely losses, but never anticipate profits. In practice, prudence means recording expenses and liabilities as soon as they are likely to happen in the near future, even if the exact amount is not yet clear. Now, let’s step into one of the trickiest and most revealing corners of audit reports: When companies fail to record expenses or liabilities that they actually should. At times, these omissions are innocent mistakes, but often they are intentional tweaks to achieve certain objectives. How exactly do they do this, and why?",
            "pubDate": "2025-11-18T17:55:07.604052"
        },
        {
            "title": "Europe's STOXX 600 falls 1.8%, closes at one-month low on Fed rate cut worries, tech valuations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-600-falls-1-8-closes-at-one-month-low-on-fed-rate-cut-worries-tech-valuations/articleshow/125417850.cms",
            "description": "European shares experienced a significant downturn on Tuesday, with Germany's DAX nearing a five-month low. This broad market sell-off was driven by concerns over an overvalued tech sector and reduced expectations for an imminent U.S. Federal Reserve interest rate cut. Investor anxiety was palpable as a volatility gauge surged, reflecting doubts about AI valuations and economic data.",
            "pubDate": "2025-11-18T19:28:00.428688"
        }
    ]
}