{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-16T05:13:33.775056",
    "items": [
        {
            "title": "IMF urges Japan to keep rates low amid global trade uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-urges-japan-to-keep-rates-low-amid-global-trade-uncertainty/slideshow/124595538.cms",
            "description": "The BOJ ended a decade-long stimulus programme last year, raising its key interest rate to 0.5% in January. Sticky food inflation, partly driven by a weak yen, complicates rate decisions. Policymakers are cautious: in September, two of nine board members’ proposals to raise rates were rejected. Core inflation and consumption show no signs of overheating.",
            "pubDate": "2025-10-16T04:55:24.980220"
        },
        {
            "title": "KEI Industries shares crash 9% despite reporting 31% growth in Q2 net profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kei-industries-shares-crash-9-despite-reporting-31-growth-in-q2-net-profit/articleshow/124595421.cms",
            "description": "KEI Industries’ shares fell 9% to Rs 4,032 despite strong Q2 FY26 results. Net profit rose 31.3% to Rs 204 crore, supported by revenue growth, while EBITDA was muted. Analysts maintain a Buy rating, citing robust demand in cables. Investors await commentary on volumes, margins, and Sanand plant timelines.",
            "pubDate": "2025-10-16T04:55:24.980347"
        },
        {
            "title": "Canara Robeco AMC shares list at 5% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canara-robeco-amc-shares-list-at-5-premium-over-ipo-price/articleshow/124595028.cms",
            "description": "Canara Robeco AMC is poised for its market debut on October 16, with early indicators suggesting a modest listing around Rs 285-290 per share, slightly above its IPO price. Despite strong investor demand, particularly from QIBs, analysts note the IPO was fully priced, leaving limited room for immediate upside. Long-term investors may benefit from India's growing mutual fund penetration.",
            "pubDate": "2025-10-16T04:55:24.980459"
        },
        {
            "title": "Healthy start! Rubicon Research shares list at 28% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/healthy-start-rubicon-research-shares-list-at-28-premium-over-ipo-price/articleshow/124595019.cms",
            "description": "Rubicon Research debuted on stock exchanges with a significant 27.9% premium, opening at Rs 620. The Rs 1,377 crore IPO saw overwhelming demand, subscribed 109 times, driven by strong QIB interest. Analysts cite robust financials, a specialized US generics portfolio, and a scalable model for the excitement.",
            "pubDate": "2025-10-16T04:55:24.980563"
        },
        {
            "title": "Ola Electric & Ather Energy: Can you bet on India’s EV stocks as China tightens lithium grip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-ather-energy-can-you-bet-on-indias-ev-stocks-as-china-tightens-lithium-grip/articleshow/124595225.cms",
            "description": "China’s new export curbs on lithium battery materials may disrupt India’s EV supply chain. Analysts say Ather Energy’s localisation efforts could limit the impact, while Ola Electric remains exposed due to its reliance on Chinese components. Ather’s technical outlook appears stronger, whereas Ola’s charts signal continued weakness.",
            "pubDate": "2025-10-16T04:55:24.980663"
        },
        {
            "title": "IMF, World Bank urge accelerated restructuring of non-bonded debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-world-bank-urge-accelerated-restructuring-of-non-bonded-debt/slideshow/124595386.cms",
            "description": "On Wednesday, during the IMF and World Bank annual meetings in Washington, top officials gathered to discuss debt vulnerabilities in developing countries and explore solutions for improved debt management. (Source: Reuters)",
            "pubDate": "2025-10-16T04:55:24.980761"
        },
        {
            "title": "HDFC Life shares fall 5% as Q2 results fail to impress the Street. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-life-shares-fall-5-as-q2-results-fail-to-impress-the-street-should-you-buy-sell-or-hold/articleshow/124595058.cms",
            "description": "HDFC Life Insurance shares dropped 4.6% despite a 3% YoY rise in Q2 FY26 consolidated PAT to Rs 448 crore. Net premium income surged 14% YoY to Rs 18,871 crore. Brokerages like Morgan Stanley, Goldman Sachs, and Nuvama maintain positive ratings, citing growth potential and target prices, though acknowledging margin pressures.",
            "pubDate": "2025-10-16T04:55:24.980860"
        },
        {
            "title": "Up to 10,000% returns! 10 multibagger stocks you'll wish you bought last Diwali",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/up-to-10000-returns-10-multibagger-stocks-youll-wish-you-bought-last-diwali/articleshow/124594971.cms",
            "description": "Dalal Street saw remarkable gains in small and midcap stocks from Diwali 2024 to Diwali 2025. Several stocks delivered returns up to 10,000%, turning modest investments into significant wealth. RRP Semiconductor led the pack with a nearly 10,000% surge. Other companies like GHV Infra Projects and Elitecon International also saw substantial growth.",
            "pubDate": "2025-10-16T04:55:24.980964"
        },
        {
            "title": "TVS Motor shares in focus on adventure touring segment entry with Apache RTX launch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-shares-in-focus-on-adventure-touring-segment-entry-with-apache-rtx-launch/articleshow/124594939.cms",
            "description": "TVS Motor Company enters the premium adventure motorcycle segment with the launch of the Apache RTX at Rs 1.99 lakh. Built on the new Next-Gen RT-XD4 engine platform, the 299cc bike blends track performance with touring comfort. The move complements TVS’s lifestyle-oriented strategy. In Q1 FY26, the company reported 32% YoY profit growth to Rs 610 crore.",
            "pubDate": "2025-10-16T04:55:24.981058"
        },
        {
            "title": "US banks tap Fed’s repo facility amid liquidity tightening",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-banks-tap-feds-repo-facility-amid-liquidity-tightening/slideshow/124594992.cms",
            "description": "US banks borrowed $6.5 billion from the Federal Reserve’s Standing Repo Facility (SRF) on Wednesday. This was the largest daily borrowing since the COVID-19 pandemic, excluding end-of-quarter periods. Repurchase rates also rose, signalling tightening conditions in the market ahead of major Treasury settlements. (Source: Reuters)",
            "pubDate": "2025-10-16T04:55:24.981174"
        },
        {
            "title": "BEL shares in focus after bagging order worth Rs 592 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-after-bagging-order-worth-rs-592-crore/articleshow/124594924.cms",
            "description": "BEL shares:  The Navratna defence PSU secured new orders worth ₹592 crore since September 29, 2025, covering a wide range of defence and technology systems such as tank subsystems, communication gear, combat and ship management systems, Kavach, jammers, and related upgrades and services.",
            "pubDate": "2025-10-16T04:55:24.981277"
        },
        {
            "title": "Hyundai Motor shares in focus as automaker bets Rs 45,000 crore on India push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-shares-in-focus-as-automaker-bets-rs-45000-crore-on-india-push/articleshow/124594908.cms",
            "description": "Hyundai Motor unveiled a Rs 45,000 crore India roadmap through FY30, including 26 new products, entry into MPV, off-road SUV, and hybrid segments, and a locally developed electric SUV by 2027. The company will launch its finance arm Hyundai Capital by FY26 and luxury brand Genesis by 2027, aiming to boost exports to 30% and revenues to Rs 1 lakh crore.",
            "pubDate": "2025-10-16T04:55:24.981374"
        },
        {
            "title": "Hero MotoCorp shares in focus on partnership with Noria Motos to enter Spain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-on-partnership-with-noria-motos-to-enter-spain/articleshow/124594864.cms",
            "description": "Hero MotoCorp has entered the Spanish market through a distribution partnership with Noria Motos, marking its presence in 50 international markets and strengthening its European expansion following its recent Italy launch.",
            "pubDate": "2025-10-16T04:55:24.981468"
        },
        {
            "title": "Sensex jumps over 300 pts, Nifty holds above 25,400 on earnings optimism and fresh FII inflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-300-pts-nifty-holds-above-25400-on-earnings-optimism-and-fresh-fii-inflows/articleshow/124594828.cms",
            "description": "Indian stock markets opened higher on Tuesday. The Sensex and Nifty saw gains, led by financial and consumer durable stocks. This rise was driven by positive sentiment regarding a domestic earnings recovery. Additionally, new foreign investments contributed to the upward trend. Investors are showing renewed confidence in the market.",
            "pubDate": "2025-10-16T04:55:24.981562"
        },
        {
            "title": "Buy, Sell or Hold: Motilal Oswal maintains buy on HDFC AMC; Nuvama initiates coverage on Hyundai Motor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-motilal-oswal-maintains-buy-on-hdfc-amc-nuvama-initiates-coverage-on-hyundai-motor/articleshow/124594743.cms",
            "description": "Brokerages remain optimistic on select large-caps, backing HDFC AMC, HDFC Life, and Hyundai Motor India for strong earnings growth, product expansion, and robust fundamentals over the next few years.",
            "pubDate": "2025-10-16T04:55:24.981655"
        },
        {
            "title": "ICICI Lombard General, HDFC AMC among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-lombard-general-hdfc-amc-among-5-stocks-showing-bullish-rsi-upswing/slideshow/124594747.cms",
            "description": "On October 15, in the Nifty200 pack, five stocks with gains of over 2.5% were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. An uptrend signal occurs when the RSI value crosses above 50 from below.“RSI Trending Up” indicates that the Relative Strength Index (RSI) values are rising, suggesting strengthening momentum in the stock’s price. This can signal potential upward movement and may help traders identify buying opportunities.",
            "pubDate": "2025-10-16T04:55:24.981750"
        },
        {
            "title": "Tata Investment Corp shares tumble over 12% in two days after trading ex-split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corp-shares-tumble-over-12-in-two-days-after-trading-ex-split/articleshow/124595794.cms",
            "description": "Tata Investment Corporation shares slipped 3.5% to Rs 908 after trading ex-split, following a 1:10 stock split on October 14. Despite an apparent 90% drop, market capitalisation remained unchanged. Q1 results showed strong profit growth, while the stock gained over 7% post-adjustment. Investor attention is on Tata Sons’ potential listing.",
            "pubDate": "2025-10-16T05:13:32.695434"
        }
    ]
}