{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-25T11:27:30.931463",
    "items": [
        {
            "title": "8 midcap stocks that could deliver over 50% upside. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/6-midcap-stocks-that-could-deliver-over-50-upside-do-you-own-any/slideshow/127450931.cms",
            "description": "For investors scouting the next breakout opportunities, a fresh analysis of Nifty Midcap 100 stocks throws up several compelling prospects. Based on consensus estimates, Trendlyne data shows that several midcap stocks are poised to deliver strong returns over the next 12 months. The projected upside represents the average expected gain during this period, providing a data-driven roadmap for investors seeking high-potential midcap ideas. We highlight 8 standout midcap stocks with estimated upside potential ranging from 40% to 85% over the coming year.",
            "pubDate": "2026-01-25T04:56:59.173363"
        },
        {
            "title": "US Fed set to keep rates steady as officials defend independence",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-set-to-keep-rates-steady-as-officials-defend-independence/articleshow/127450286.cms",
            "description": "The US Federal Reserve is widely expected to keep interest rates unchanged when it meets in the coming week, holding firm despite President Donald Trump's pressure to slash levels as it guards against threats to its independence. - External pressure - The Fed meets eight times a year to consider interest rate levels, and Michael Pearce of Oxford Economics said the dilemma it faces has eased.",
            "pubDate": "2026-01-25T04:56:59.173493"
        },
        {
            "title": "14 penny stocks crash up to 80% in three months. Check full list here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/14-penny-stocks-crash-up-to-80-in-three-months-check-full-list-here/slideshow/127451697.cms",
            "description": "Over the past three months, 11 penny stocks have plunged between 50% and 80%. These underperformers were identified using a targeted screen that focused on stocks with a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares, highlighting low-priced, actively traded stocks that have seen sharp declines. (Data source: ACE Equity)While penny stocks often attract investors with low entry prices and the lure of quick gains, they carry significant risks. Low liquidity, high volatility and limited transparency make them prone to manipulation and sudden price swings. Without a clear strategy and strong risk controls, losses can quickly outweigh gains.",
            "pubDate": "2026-01-25T05:26:35.119317"
        },
        {
            "title": "Q3 earnings, Fed rate decision, Budget to steer Dalal Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q3-earnings-fed-rate-decision-budget-to-steer-dalal-street-this-week/articleshow/127457472.cms",
            "description": "Stock market is gearing up for an eventful week ahead where key triggers such as quarterly earnings from corporates, the US Fed interest rate decision and the upcoming Union Budget for 2026-27 would grab the limelight, analysts said.",
            "pubDate": "2026-01-25T06:57:25.663829"
        },
        {
            "title": "How Mukul Agrawal tweaked his Rs 6,500-crore portfolio in Q3. Here’s all you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-mukul-agrawal-tweaked-his-rs-6500-crore-portfolio-in-q3-heres-everything-you-need-to-know/articleshow/127456400.cms",
            "description": "Ace investor Mukul Mahavir Agrawal reshuffled his Rs 6,500-crore equity portfolio in Q3, adding new names and adjusting stakes across several holdings. He entered stocks such as Hindustan Construction and Alcargo Logistics, increased exposure in Vasa Denticity and Vikran Engineering, and trimmed or exited positions in firms like Monolithisch, Pearl Global and Stanley Lifestyles. The moves reflect tactical repositioning after 2025’s sharp smallcap selloff.",
            "pubDate": "2026-01-25T06:57:25.663957"
        },
        {
            "title": "2026 may see more corrections. Focus on owning the correct business – & the 9 basic principles of investing in mid- and small-cap stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2026-may-see-more-corrections-focus-on-owning-the-correct-business-the-9-basic-principles-of-investing-in-mid-and-small-cap-stocks/articleshow/127457524.cms",
            "description": "Investors tend to get divided into two distinct sets during extended corrections. The first justify buying wrong stocks by describing themselves as “long-term investors”. The rest, genuine long-term investors, focus on the correct businesses. “Correct business”? Yes, one with a record of growth; which does not require frequent capital infusions; and where income is shared with minority investors. As geopolitics rock the global equity markets, here’s what investors must remember: Corrections are part of the market. They happened in 2024 and 2025, and will happen in 2026. Also, stock selection is the key given high valuations. Finally, manage behavioural risk. And that is something investors have to work out on their own.",
            "pubDate": "2026-01-25T07:20:26.568964"
        },
        {
            "title": "Market cap of 9 of top-10 most valued firms plunges by Rs 2.51 lakh cr; RIL biggest laggard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-cap-of-9-of-top-10-most-valued-firms-plunges-by-rs-2-51-lakh-cr-ril-biggest-laggard/articleshow/127457816.cms",
            "description": "The combined market valuation of nine of the top-10 most valued firms slumped by Rs 2.51 lakh crore last week, with Reliance Industries taking the biggest hit, in line with a weak trend in equities.",
            "pubDate": "2026-01-25T07:20:26.569093"
        },
        {
            "title": "Stock market holiday: Will NSE and BSE remain closed on January 26 for Republic Day?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-will-nse-and-bse-remain-closed-on-january-26-for-republic-day/articleshow/127467967.cms",
            "description": "Indian stock markets will be closed on Monday, January 26, for Republic Day, affecting trading across NSE, BSE and MCX. The closure marks the second market holiday of 2026. Trading will resume on Tuesday, January 27. For the rest of the year, exchanges will remain shut for 14 sessions, including Holi, Ram Navami, Diwali, Christmas and other national and regional observances.",
            "pubDate": "2026-01-25T10:21:03.310696"
        },
        {
            "title": "Union Budget 2026: What markets need to rebuild retail investors’ confidence",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-budget-2026-what-markets-need-to-rebuild-retail-investors-confidence/articleshow/127471312.cms",
            "description": "Retail investors have stayed committed to Indian markets through multiple crises, but their confidence must be continually reinforced as savings grow. Taxation, especially STT, CTT, and capital gains, adds friction and makes India less competitive globally. Predictable, rational tax policy and long-term support for mutual funds are crucial to sustain domestic capital formation. Higher capex, especially in defence and infrastructure, is essential for long-term growth.",
            "pubDate": "2026-01-25T11:27:30.132147"
        }
    ]
}