{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-14T17:52:47.737267",
    "items": [
        {
            "title": "Sebi drops charges against NSE, Chitra Ramkrishna, Ravi Narain & other officials in co-location case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-drops-charges-against-nse-chitra-ramkrishna-ravi-narain-other-officials-in-co-location-case/articleshow/113352240.cms",
            "description": "Sebi has dropped charges of fraudulent and unfair trade practices against NSE and seven former employees, including Chitra Ramkrishna and Ravi Narain, in the co-location case due to lack of evidence. The case had prompted a CBI probe and led to arrests of top NSE officials.",
            "pubDate": "2024-09-14T17:52:28.731177"
        },
        {
            "title": "As valuations stay elevated, be selective and choose right business: 5 large cap stocks from different sectors with upside potential of up to 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-valuations-stay-elevated-be-selective-and-chose-right-business-5-large-cap-stocks-from-different-sectors-upside-potential-up-to-34/articleshow/113351575.cms",
            "description": "At this point of time, there can be no debate on valuations, it is a well accepted fact that they are high. But if the street is comfortable in giving high valuations, then why argue with liquidity. Only thing which an investor can do is to focus on a business where the growth opportunity is big and growth will take care of the valuations. For example, it would be better to focus on a company which is part of the data centers as compared to an FMCG stocks where the growth is going to be single digit or at max low double digit. So, focus on business growth so that valuation comfort is taken care of in another manner.",
            "pubDate": "2024-09-14T17:52:28.731299"
        },
        {
            "title": "Concurrent Gainers: Bajaj Auto among 8 stocks that gained for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-bajaj-auto-among-8-stocks-that-gained-for-5-days-in-a-row/slideshow/113343367.cms",
            "description": "In the last five trading sessions up to September 13, the Sensex index increased by about 2.10%, finishing at 82,891, with gains recorded in 3 of those five sessions. During this weekly rally, ETMarkets identified that eight stocks from the Nifty200 pack showed consistent price increases during this timeframe. (Data Source: ACE Equity)",
            "pubDate": "2024-09-14T17:52:28.731403"
        },
        {
            "title": "Nifty trend remains intact after hitting fresh peak; caution advised for upcoming week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-trend-remains-intact-after-hitting-fresh-peak-caution-advised-for-upcoming-week/articleshow/113349109.cms",
            "description": "The markets reached new lifetime highs last week, with the Nifty closing at a fresh peak. Despite a strong trend, caution is advised due to significant deviation from the mean and potential for profit-taking. Key resistance and support levels are outlined for the coming week.",
            "pubDate": "2024-09-14T17:52:28.731503"
        },
        {
            "title": "FPIs bought Indian equities worth Rs 27,856 crore in September. 2024 net purchases jump to Rs 70,737 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-bought-indian-equities-worth-rs-27856-crore-in-september-2024-net-purchases-jump-to-rs-70737-crore/articleshow/113348883.cms",
            "description": "FPIs have been net buyers of Indian equities in September, investing over Rs 27,856 crore so far. Year-to-date investments total Rs 70,737 crore. FPIs were net sellers in April and May but have been net buyers since June, with a peak in July.",
            "pubDate": "2024-09-14T17:52:28.731603"
        },
        {
            "title": "Block deals worth over Rs 10,934 crore this week. Trent, Mamaearth, Patanjali Foods among stocks with major action",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/block-deals-worth-over-rs-10934-crore-this-week-trent-mamaearth-patanjali-foods-among-stocks-with-major-action/articleshow/113347272.cms",
            "description": "Nifty closed the week with 2% gains, despite significant block deals totaling Rs 10,934 crore across large, mid, and smallcap companies. Tata Group's Trent led largecap block deals with Rs 715 crore, followed by Mankind Pharma, Tube Investments of India, Bosch, and others.",
            "pubDate": "2024-09-14T17:52:28.731700"
        },
        {
            "title": "Stock picks of the week: 6 stocks with consistent score improvement and upside potential of up to 44%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-6-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-44/articleshow/113346694.cms",
            "description": "The way broader market indices, Nifty and Sensex have panned out in this phase of global volatility, it is clear that bulls are in no mood to leave control of the Street. But at the same time, probably we are going to get into a phase where the Indian market will act in line with the global market, which to some extent is different from what was happening in early part of 2024, when Indian markets were able to strongly outperform the global markets. So, while being bullish, be ready for a deal with a period of volatility and while selecting stocks, use more filters.",
            "pubDate": "2024-09-14T17:52:28.731791"
        },
        {
            "title": "Adani Energy was among top buys for mutual funds in August, ACC top reduction by this MF",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-energy-was-among-top-buys-for-mutual-funds-in-august-acc-top-reduction-by-this-mf/articleshow/113346631.cms",
            "description": "Mutual funds bought 1.6 crore shares of Adani Energy Solutions in August, valued at Rs 1,330 crore. Other Adani Group stocks like APSEZ, Ambuja Cements, and ACC also saw mutual fund interest. SBI Mutual Fund was a major buyer of Adani Energy, acquiring 73.73 lakh shares. Tata MF and Nippon MF also purchased Adani Energy shares.",
            "pubDate": "2024-09-14T17:52:28.731886"
        },
        {
            "title": "LG eyes D-Street debut for India unit at $1.5 billion valuation, picks banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-said-to-pick-banks-for-1-5-billion-listing-of-indian-unit/articleshow/113345360.cms",
            "description": "LG Electronics is considering an IPO of its Indian business, aiming to raise up to $1.5 billion. Banks like Bank of America, Citigroup, JPMorgan, and Morgan Stanley have been appointed for the potential offering.",
            "pubDate": "2024-09-14T17:52:28.731978"
        },
        {
            "title": "61 smallcap stocks deliver double-digit weekly returns as markets hit new highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/61-smallcap-stocks-deliver-double-digit-weekly-returns-as-markets-hit-new-highs/articleshow/113344574.cms",
            "description": "Indian markets rallied last week, overcoming Sebi's FII disclosure deadline and US recession fears. Rate-cut optimism boosted indices to new highs. Smallcap stocks outperformed, with Hardwyn India leading with a 30% gain.",
            "pubDate": "2024-09-14T17:52:28.732076"
        },
        {
            "title": "Congress targets Madhabi Puri Buch again, says 'Sebi chief traded in listed securities & invested in Chinese firms'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/congress-targets-madhabi-puri-buch-again-says-sebi-chief-traded-in-listed-securities-invested-in-chinese-firms/articleshow/113345099.cms",
            "description": "Congress has intensified its scrutiny of SEBI Chairperson Madhabi Puri Buch, accusing her of trading listed securities worth ₹36.9 crore and investing in foreign, including Chinese, funds between 2017 and 2023. Congress spokesperson Pawan Khera has called for Prime Minister Narendra Modi to address these allegations and questioned Buch’s adherence to SEBI’s conflict of interest guidelines. Buch and her husband have refuted the charges, labeling them as false and motivated.",
            "pubDate": "2024-09-14T17:52:28.732166"
        },
        {
            "title": "These 5 smallcap stocks witnessed a rise in prices with volumes in last 3 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-smallcap-stocks-witnessed-a-rise-in-prices-with-volumes-in-last-3-days/slideshow/113343077.cms",
            "description": "ETMarkets' analysis of BSE smallcap stocks shows that over the past three sessions (September 6-13 ), 5 stocks have consistently increased in price, trading volume, and delivery volume, indicating higher investor interest in these stocks. (Data Source: ACE Equity)",
            "pubDate": "2024-09-14T17:52:28.732257"
        },
        {
            "title": "MCX, Rites among over 200 stocks to remain in focus next week for dividend, bonus, split. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-rites-among-over-200-stocks-to-remain-in-focus-next-week-for-dividend-bonus-split-do-you-own-any/articleshow/113342439.cms",
            "description": "Several companies, including MCX, Rites, and Texmaco Rail, have upcoming record dates for various corporate actions like dividends, bonus issues, rights issues, and stock splits. Shareholders must hold shares in their demat accounts on the record date to be eligible.",
            "pubDate": "2024-09-14T17:52:28.732349"
        },
        {
            "title": "10 mid-cap stocks that mutual funds bought and sold in August",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-mid-cap-stocks-that-mutual-funds-bought-and-sold-in-august/slideshow/113342339.cms",
            "description": "In August 2024, mutual funds deployed Rs 35,600 crore and alongside FIIs sold Rs 27,000 crore in the Indian secondary market. Key additions by MFs in August in mid-cap stocks were in FirstCry, Delhivery, PNB Housing, and India Cement. Here is a list of stocks that mutual funds bought and sold in August, according to a report by Nuvama Institutional Equities:",
            "pubDate": "2024-09-14T17:52:28.732439"
        },
        {
            "title": "Technology sector poised for recovery; Coforge, HCL Tech could give 17-20% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technology-sector-poised-for-recover-coforge-hcl-tech-could-give-17-20-return-in-1-year/articleshow/113332441.cms",
            "description": "The technology sector is set for a strong recovery, driven by increased investments and new technologies like Generative AI. Key sectors such as BFSI, healthcare, and manufacturing are expected to lead this growth. Service vendors and Global Capability Centers will play crucial roles in this expansion, with companies like HCL Technologies and Coforge positioned for significant gains.",
            "pubDate": "2024-09-14T17:52:28.732533"
        },
        {
            "title": "Prospect of steeper Fed cuts boosts stocks, drives record gold prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prospect-of-steeper-fed-cuts-boosts-stocks-drives-record-gold-prices/articleshow/113340527.cms",
            "description": "U.S. stocks rose on Friday as investors anticipated possible aggressive rate cuts by the Federal Reserve at its upcoming policy meeting. The Dow Jones, S&P 500, and Nasdaq all closed higher. Gold hit record highs, while the dollar weakened and Treasury yields fell.",
            "pubDate": "2024-09-14T17:52:28.732619"
        }
    ]
}