{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-23T10:25:24.504274",
    "items": [
        {
            "title": "Buy, Sell or Hold? Elara upgrades APL Apollo; Motilal raises Bandhan Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-elara-upgrades-apl-apollo-motilal-raises-bandhan-bank/articleshow/127233451.cms",
            "description": "Brokerage commentary highlights improving fundamentals and favourable risk-reward across sectors, leading to stock upgrades and higher target prices. APL Apollo, Bandhan Bank, and InterGlobe Aviation are among the stocks receiving positive attention due to strong performance and constructive outlooks.",
            "pubDate": "2026-01-23T05:21:21.402173"
        },
        {
            "title": "Hindustan Zinc shares jump 6%, hit fresh 52-week high as silver nears $100. Should you buy, sell, hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-jump-6-hit-fresh-52-week-high-as-silver-nears-100-should-you-buy-sell-hold/articleshow/127233226.cms",
            "description": "Hindustan Zinc shares surged to a new 52-week high. This rally is fueled by record silver prices and strong analyst upgrades. HSBC and IIFL Capital have recommended buying the stock, citing its robust financial performance and positive outlook. The company reported its highest-ever quarterly revenue and profit in Q3FY26. Future capex plans indicate a focus on growth and expansion.",
            "pubDate": "2026-01-23T05:21:21.402295"
        },
        {
            "title": "What Goldman Sachs, Jefferies, HSBC, 5 others expect from Union Budget FY27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-goldman-sachs-jefferies-hsbc-5-others-expect-from-union-budget-fy27/slideshow/127231444.cms",
            "description": "As we inch closer to the Union Budget FY27, expectations from the government are to strike a balance between fiscal prudence and growth support. Focus is likely to remain on capital expenditure, especially infrastructure, alongside conservative tax assumptions and limited changes to personal income tax. Investors will track measures to boost consumption, manufacturing, employment, and exports, while the fiscal deficit and borrowing programme will be key market drivers. Here’s what 8 top brokerage firms expect from Finance Minister Nirmala Sitharaman on February 1.",
            "pubDate": "2026-01-23T05:21:21.402400"
        },
        {
            "title": "Aditya Birla Sun Life AMC shares rally 6% as Citi, Nuvama upgrade stock after strong Q3 beat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-sun-life-amc-shares-rally-6-as-citi-nuvama-upgrade-stock-after-strong-q3-beat/articleshow/127233198.cms",
            "description": "Aditya Birla Sun Life AMC shares rose sharply on Friday after a strong Q3 FY26 performance and fresh upgrades from Citi and Nuvama. The AMC posted a 20% YoY rise in net profit and steady revenue growth, prompting brokerages to highlight improving scheme performance and potential market-share recovery despite ongoing operational challenges.",
            "pubDate": "2026-01-23T05:21:21.402500"
        },
        {
            "title": "Budget 2026: Can a reduction in LTCG unleash a bull market in Indian stocks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-can-a-reduction-in-ltcg-unleash-a-bull-market-in-indian-stocks/articleshow/127232792.cms",
            "description": "Budget 2026 approaches with discussions on reducing capital gains tax for equities. While some believe it could boost investor sentiment after a year of muted returns and foreign investor selling, market experts suggest it may only offer marginal help. Global factors and corporate earnings growth are seen as more significant drivers for a sustained stock market rally.",
            "pubDate": "2026-01-23T05:21:21.402596"
        },
        {
            "title": "Sensex and Nifty edge modestly higher on easing geopolitical jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-and-nifty-edge-modestly-higher-on-easing-geopolitical-jitters/articleshow/127229998.cms",
            "description": "Indian equities opened marginally higher on Friday, extending a modest recovery after a three-session decline. Gains in Asian markets and easing geopolitical tensions provided some support, but persistent foreign fund outflows and mixed corporate results maintained investor caution.",
            "pubDate": "2026-01-23T05:21:21.402703"
        },
        {
            "title": "Rs 4.5 lakh crore PSU bank rally draws FII buying in 10 stocks. Are you late to the party?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-4-5-lakh-crore-psu-bank-rally-draws-fii-buying-in-10-stocks-are-you-late-to-the-party/articleshow/127230002.cms",
            "description": "Foreign investors are significantly increasing their stakes in Indian public sector banks, drawn by a remarkable rally and improving financial health.  These banks are now outperforming private lenders in loan growth, signaling a strong turnaround. Despite recent gains, analysts believe many PSU banks still offer attractive valuations, making them a compelling investment opportunity.",
            "pubDate": "2026-01-23T05:21:21.402802"
        },
        {
            "title": "Silver prices soar by Rs 12,600/kg to inch near Rs 3.4 lakh; gold hits Rs 1.6 lakh mark. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-prices-soar-by-rs-12600-per-kg-to-inch-near-rs-3-4-lakh-gold-hits-rs-1-6-lakh-mark-what-should-investors-do/articleshow/127229743.cms",
            "description": "Gold and silver surged to fresh highs on Friday, extending recent gains amid geopolitical tensions, a weaker US dollar, and expectations of Federal Reserve rate cuts at its upcoming January 27 meeting. Market uncertainty was also fueled by comments from US President Donald Trump on securing permanent US access to Greenland, though the deal’s details remain unclear and Denmark rejected any challenge to its sovereignty.",
            "pubDate": "2026-01-23T05:21:21.402896"
        },
        {
            "title": "IndiGo shares skid 4% after Q3 profit plummets 78% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-skid-4-after-q3-profit-plummets-78-yoy-should-you-buy-sell-or-hold/articleshow/127229019.cms",
            "description": "IndiGo share price: InterGlobe Aviation shares slipped after IndiGo reported a 78% year-on-year fall in Q3FY26 profit to Rs 550 crore, hit by exceptional charges from labour law changes, operational disruptions and currency movements. Excluding these items, profitability was strong, with revenue rising 26% sequentially, though margins and load factors weakened.",
            "pubDate": "2026-01-23T05:21:21.403009"
        },
        {
            "title": "Adani Energy Solutions shares fall over 2% after Q3 net profit slips to Rs 552 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-energy-solutions-shares-in-focus-after-q3-profit-slips-revenue-grows/articleshow/127229288.cms",
            "description": "Adani Energy Solutions' shares dipped over 2% after reporting a marginal 2% year-on-year decline in Q3 FY26 net profit to Rs 552 crore. Despite this, revenues surged 15% to Rs 6,730 crore, with EBITDA reaching a record Rs 2,210 crore, driven by strong transmission and smart metering growth.",
            "pubDate": "2026-01-23T05:21:21.403108"
        },
        {
            "title": "KEI Industries among 5 F&O stocks with a sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kei-industries-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/127228857.cms",
            "description": "As of January 22, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2026-01-23T05:21:21.403204"
        },
        {
            "title": "APL Apollo Tubes, two other stocks flash bullish signals, indicating an uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apl-apollo-tubes-two-other-stocks-flash-bullish-signals-indicating-an-uptrend/slideshow/127228460.cms",
            "description": "On January 22, three stocks from the Nifty200 pack were flagged by the White Marubozu bullish scanner, according to technical scan data from StockEdge.com. A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest and the closing price is the highest for a given session.Represented by a long white (or green) candlestick with no upper shadow and a small or negligible lower shadow, the pattern signals strong buying pressure throughout the session. Traders interpret this as buyers being in control from open to close and often use it to gauge potential future price movements.",
            "pubDate": "2026-01-23T05:21:21.403303"
        },
        {
            "title": "United Spirits shares in focus after Adar Poonawalla signals bid for RCB acquisition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/united-spirits-shares-in-focus-after-adar-poonawalla-signals-bid-for-rcb-acquisition/articleshow/127228227.cms",
            "description": "United Spirits shares are set to be in focus after Serum Institute CEO Adar Poonawalla said he plans to make a strong and competitive bid for the Royal Challengers Bengaluru IPL franchise, currently owned by the Diageo-controlled liquor maker. The development comes against the backdrop of a sharp rise in United Spirits’ December-quarter profit, even as revenue growth remained modest.",
            "pubDate": "2026-01-23T05:21:21.403398"
        },
        {
            "title": "Bank of Japan keeps key interest rate unchanged at 0.75%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-japan-keeps-key-interest-rate-unchanged-at-0-75/articleshow/127227850.cms",
            "description": "The Bank of Japan has kept its key interest rate steady at 0.75 percent. This decision was widely expected by analysts. The central bank anticipates inflation will fall below two percent in early 2026. Japan's economy is projected to grow moderately. Prime Minister Sanae Takaichi is preparing for a snap election on February 8.",
            "pubDate": "2026-01-23T05:21:21.403489"
        },
        {
            "title": "Bharat Electronics among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-electronics-among-6-stocks-showing-bullish-rsi-upswing/slideshow/127227759.cms",
            "description": "On January 22, six stocks from the NSE large-cap segment were flagged in the RSI Trending Up scan, according to data from StockEdge.com. An uptrend signal is generated when the RSI crosses above 50 from below. An “RSI trending up” reading indicates rising Relative Strength Index (RSI) values, suggesting strengthening price momentum. Traders often use this signal to identify potential buying opportunities.",
            "pubDate": "2026-01-23T05:21:21.403580"
        },
        {
            "title": "DLF shares gain over 1% after turning gross debt-free, Q3 net profit rises 14% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dlf-shares-in-focus-after-turning-gross-debt-free-q3-net-profit-rises-14-yoy/articleshow/127226388.cms",
            "description": "DLF shares are in focus after a strong Q3 performance. The company reported a 14.4% jump in net profit to Rs 1,207 crore. DLF also achieved a significant milestone by becoming gross debt-free for the first time since its 2007 IPO. Strong operating performance and consistent growth from its annuity business contributed to these positive results.",
            "pubDate": "2026-01-23T05:21:21.403671"
        },
        {
            "title": "What Ashish Kacholia, Mukul Agrawal, Vijay Kedia, Dolly Khanna bought and sold in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-ashish-kacholia-mukul-agrawal-vijay-kedia-dolly-khanna-bought-and-sold-in-q3/articleshow/127238235.cms",
            "description": "Veteran investors Ashish Kacholia, Mukul Agrawal, Vijay Kedia and Dolly Khanna remained active in Q3 FY26, selectively adding new stocks, raising stakes and trimming exposure amid a sharp selloff in smallcap equities.",
            "pubDate": "2026-01-23T05:47:14.543123"
        },
        {
            "title": "Silver ETFs rally up to 17% in dramatic reversal, but will $100 barrier throw bulls out of the game?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-etfs-rally-up-to-17-in-dramatic-reversal-but-will-100-barrier-throw-bulls-out-of-the-game/articleshow/127238052.cms",
            "description": "Silver’s sharp rally has boosted Indian silver ETFs, led by a 17% jump in Tata Silver ETF, as global prices near the key $100 level. Gold and silver hit record highs amid geopolitical tensions, a weaker dollar and expectations of Fed rate cuts.",
            "pubDate": "2026-01-23T05:47:14.543262"
        },
        {
            "title": "Tanla Platforms shares jump nearly 12% on double-digit Q3 FY26 growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tanla-platforms-shares-jump-nearly-12-on-double-digit-q3-fy26-growth/articleshow/127237817.cms",
            "description": "Tanla Platforms shares surged 11.87% to Rs 501.85 after reporting double-digit revenue and profit growth for Q3 FY26. Net sales rose 12% YoY to Rs 1,121 crore, with net profit up 11% to Rs 131 crore. The company's CEO hailed the quarter as a milestone, with strong performance across all key metrics.",
            "pubDate": "2026-01-23T05:47:14.543468"
        },
        {
            "title": "Why Central Bank Independence Matters: Global lessons as Trump targets Fed Governor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-central-bank-independence-matters-global-lessons-as-trump-targets-fed-governor/articleshow/127236440.cms",
            "description": "Central bank independence is crucial for economic stability, as it helps control inflation and maintain confidence. Research shows that political interference in monetary policy often leads to higher inflation, currency weakness and slower growth.",
            "pubDate": "2026-01-23T05:47:14.543566"
        },
        {
            "title": "IndiGrid raises Rs 1,500 cr through institutional placement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigrid-raises-rs-1500-cr-through-institutional-placement/articleshow/127241539.cms",
            "description": "IndiGrid Infrastructure Trust successfully raised Rs 1,500 crore via an oversubscribed institutional placement, attracting significant participation from insurance and mutual funds. This capital infusion, alongside a prior preferential issue, brings their total FY26 equity fundraising to Rs 1,938 crore. The move bolsters their balance sheet, enabling disciplined growth and enhancing unitholder value.",
            "pubDate": "2026-01-23T07:00:56.643627"
        },
        {
            "title": "ideaForge Technology shares tank 5% as Q3 net loss widens by 41% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ideaforge-technology-shares-tank-5-as-q3-net-loss-widens-by-41-yoy/articleshow/127239435.cms",
            "description": "ideaForge Technology's shares dropped 5% after reporting a widened net loss of Rs 33.85 crore in the December quarter, despite a 79% revenue jump.  Elevated material costs significantly compressed gross margins to 23.7%. The company, however, sees a strong order book and anticipates improving margins and profitability in the upcoming quarter.",
            "pubDate": "2026-01-23T07:00:56.643757"
        },
        {
            "title": "Paytm shares tumble 10%, down in 4 out of 5 sessions. What's behind the fall?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-tumble-10-today-extend-weekly-losses-to-12/articleshow/127246835.cms",
            "description": "Paytm's stock experienced a significant drop due to market worries about the Payment Infrastructure Development Fund.  This scheme's potential discontinuation could impact digital payment providers.  However, a brokerage firm has initiated coverage with a positive outlook, forecasting substantial growth.  Meanwhile, domestic mutual funds have reduced their holdings in Paytm for the first time since its debut.",
            "pubDate": "2026-01-23T07:33:42.403355"
        },
        {
            "title": "Sebi accuses executives at EY, PwC, among others, of insider trading in 2022 Yes Bank share sale case: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-accuses-executives-at-ey-pwc-among-others-of-insider-trading-report/articleshow/127249680.cms",
            "description": "India's market regulator has accused top executives from PwC and EY, along with global private equity firms Carlyle and Advent, of insider trading. The allegations stem from a 2022 Yes Bank share sale. SEBI claims these individuals shared confidential information, leading to unlawful gains. This action highlights a crackdown on market manipulation and insider trading in India.",
            "pubDate": "2026-01-23T07:48:23.492640"
        },
        {
            "title": "Eternal shares get $2 billion shock after Q3 results, but target price goes up to Rs 480. Buy or sell?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-get-2-billion-shock-after-q3-results-but-target-price-goes-up-to-rs-480-buy-or-sell/articleshow/127248957.cms",
            "description": "Eternal shares have fallen, erasing nearly $2 billion in market value, despite brokerages raising target prices, creating uncertainty for investors. The decline comes even as Blinkit turned EBITDA-positive amid intense competition, and a leadership change with CEO Deepinder Goyal stepping down may have added to market jitters.",
            "pubDate": "2026-01-23T07:48:23.492750"
        },
        {
            "title": "Cipla shares slide 5% after drug major's Q3 net profit drops 57% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-shares-slide-5-after-drug-major-q3-net-profit-drops-57-yoy/articleshow/127263769.cms",
            "description": "Cipla shares dropped 5% after reporting a 57% year-on-year decline in net profit to Rs 676 crore, impacted by a fall in gRevlimid sales. Revenue remained flat at Rs 7,074 crore, with EBITDA also declining. The company plans upcoming launches to offset revenue decline and drive future growth.",
            "pubDate": "2026-01-23T10:25:17.340745"
        },
        {
            "title": "Q3 Profit Boom: 10 smallcaps surge up to 150% in a year, 3 become multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q3-profit-boom-10-smallcaps-surge-up-to-150-in-a-year-3-become-multibaggers/slideshow/127264158.cms",
            "description": "Rising profits are a clear sign of a business on the move—efficient operations, growing demand, and strong momentum. They boost investor confidence, fuel reinvestment, and build a lasting competitive edge. The December quarter numbers tell an especially compelling story in the smallcap space. Based on Q3 results released so far, around 48 smallcap companies have delivered profit growth of over 25% year-on-year. To separate scale from noise, the focus narrows to companies with latest quarterly revenues above Rs 100 crore.More than half of these companies have rewarded shareholders with positive returns over the past year. Among them, 10 standout stocks surged between 50% and 150%, turning heads across the market. Even more striking, three of these names emerged as true multibaggers, doubling investor wealth in just twelve months. (Data Source: ACE Equity)",
            "pubDate": "2026-01-23T10:25:17.340873"
        },
        {
            "title": "Ixigo parent shares tumble 16% post Q3 results. Buy the dip or bail out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ixigo-parent-shares-tumble-16-post-q3-results-buy-the-dip-or-bail-out/articleshow/127257554.cms",
            "description": "The selloff follows management commentary on resilient operating performance during December, a month marked by industry-wide disruptions after large-scale IndiGo flight cancellations and rescheduling across the country.",
            "pubDate": "2026-01-23T10:25:17.340980"
        },
        {
            "title": "Vedanta shares rise 3%, hit record high as LME copper, aluminium prices gain. Will stock hit Rs 800?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-rise-3-hit-record-high-as-lme-copper-aluminium-prices-gain-will-stock-hit-rs-800/articleshow/127257223.cms",
            "description": "Shares of Anil Agarwal-led Vedanta Ltd rallied as much as 3% to their fresh 52-week high of Rs 699 on the BSE on Friday after copper prices bounced back to inch closer to its fresh high of $13,407 on the London Metal Exchange. Zinc prices also edged higher by about a percent.",
            "pubDate": "2026-01-23T10:25:17.341081"
        },
        {
            "title": "Rs 6 lakh cr wiped out! Sensex slumps over 800 points, Nifty below 25,050. What triggered the selloff?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-6-lakh-cr-wiped-out-sensex-slumps-over-700-points-nifty-below-25100-what-drove-the-markets-sudden-slide/articleshow/127254742.cms",
            "description": "Stock Market Crash Today: Indian equities experienced a sharp decline on Friday, with the Sensex and Nifty erasing early gains due to persistent foreign institutional investor (FII) selling. FIIs offloaded equities worth Rs 2,550 crore on Thursday, marking the 13th consecutive session of net selling in January, significantly impacting market sentiment and capitalization.",
            "pubDate": "2026-01-23T10:25:17.341188"
        },
        {
            "title": "Cipla Q3 Results: Net profit plunges 57% YoY to Rs 676 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-q3-results-net-profit-falls-57-yoy-to-rs-676-crore/articleshow/127253158.cms",
            "description": "Cipla Q3 Results: Cipla reported a 57% YoY drop in net profit to Rs 676 crore, impacted by lower gRevlimid sales in North America. Despite this, the company's One India business saw double-digit growth in branded prescriptions, and upcoming launches are expected to offset future revenue declines.",
            "pubDate": "2026-01-23T10:25:17.341314"
        },
        {
            "title": "Adani stocks suffer Rs 1.4 lakh crore shock, crash up to 15%. Here's what went wrong",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-adani-enterprises-adani-energy-adani-ports-shares-fall-up-to-10-whats-behind-the-selloff/articleshow/127251598.cms",
            "description": "Adani Group stocks tumbled up to 15% after the US SEC sought court permission to email summons to Gautam Adani and Sagar Adani regarding an alleged $265 million bribery scheme. India had previously rejected official requests for service, citing procedural grounds. The SEC is pursuing the case, which involves allegations of bribing Indian officials and misleading US investors.",
            "pubDate": "2026-01-23T10:25:17.341414"
        }
    ]
}