{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-30T09:45:30.709017",
    "items": [
        {
            "title": "ACME Solar shares rally 7% in 3 days after Q1 profit soars 9,319%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/acme-solar-shares-rally-7-in-3-days-after-q1-profit-soars-9319/articleshow/122994077.cms",
            "description": "ACME Solar share price: ACME Solar’s Q1 FY26 net profit jumped 9,319% YoY to Rs 131 crore, driven by strong revenue growth, margin expansion, new project wins, and debt refinancing. The company’s operational capacity rose to 2,890 MW, boosting investor confidence and share performance.",
            "pubDate": "2025-07-30T09:45:11.537698"
        },
        {
            "title": "Fed to avoid clear signal on rate-cut timing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-to-avoid-clear-signal-on-rate-cut-timing/articleshow/122993988.cms",
            "description": "The Federal Reserve is expected to maintain current interest rates at its upcoming meeting, but potential dissents hint at internal pressure for earlier rate cuts. Economic data releases before the September meeting will be crucial in determining future policy.",
            "pubDate": "2025-07-30T09:45:11.537850"
        },
        {
            "title": "Tariff-driven trade swings distort US growth outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-driven-trade-swings-distort-us-growth-outlook/slideshow/122993763.cms",
            "description": "The U.S. economy is expected to bounce back in the second quarter with a projected annualised growth rate of 2.5%, according to Briefing.com. This follows a contraction of 0.5% in Q1 and reflects temporary boosts from inventory and trade shifts. (Source: AFP)",
            "pubDate": "2025-07-30T09:45:11.537967"
        },
        {
            "title": "Tata Motors shares fall 4%. Here’s why investors are worried about $4.5 billion Iveco gamble",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-fall-4-heres-why-investors-are-worried-about-4-5-billion-iveco-gamble/articleshow/122994000.cms",
            "description": "Tata Motors shares fell sharply after reports of a $4.5 billion bid to acquire Italy’s Iveco. Investors are wary of the automaker's growing debt burden, especially amid electric transition costs, tightening tariffs, and emission compliance spending already weighing on its balance sheet.",
            "pubDate": "2025-07-30T09:45:11.538079"
        },
        {
            "title": "Japan's Nikkei flat as markets await key central bank decisions and looming tariff deadline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-flat-as-markets-await-key-central-bank-decisions-and-looming-tariff-deadline/articleshow/122993278.cms",
            "description": "Japan's Nikkei share average ended flat on Wednesday as investors braced for a three-day period that will see policy decisions from the Federal Reserve and Bank of Japan, followed by U.S. President Donald Trump's deadline for trade deals.",
            "pubDate": "2025-07-30T09:45:11.538181"
        },
        {
            "title": "European shares fall as investors digest earnings deluge; Adidas sinks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-fall-as-investors-digest-earnings-deluge-adidas-sinks/articleshow/122993214.cms",
            "description": "European shares fell on Wednesday, weighed down by bank stocks, as corporate earnings took centre stage ahead of a packed schedule, which includes central bank announcements, key data and the approaching August 1 tariff deadline this week.",
            "pubDate": "2025-07-30T09:45:11.538279"
        },
        {
            "title": "FIIs trim holdings in 10 midcap stocks; one plunges 70% in FY26, do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-trim-holdings-in-10-midcap-stocks-one-plunges-70-in-fy26-do-you-own-any/slideshow/122993184.cms",
            "description": "In the midcap segment, Foreign Institutional Investors (FIIs) currently hold stakes in around 137 stocks. Tracking where FIIs are investing is crucial, but it's equally important to monitor where they are cutting their stake, as their investment decisions are typically backed by thorough research and analysis.In our latest analysis, we observed that FIIs have reduced their holdings in approximately 68 midcap stocks. Of these, 22 have delivered negative returns so far in FY26. We’ve shortlisted the top 10 underperformers—stocks that fell between 7% and 70%. The steepest fall came from Aditya Birla Fashion and Retail, down 70% in just four months.",
            "pubDate": "2025-07-30T09:45:11.538376"
        },
        {
            "title": "Midcap stocks could be your portfolio's secret weapon in 2025. Here are 5 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcap-stocks-could-be-your-portfolios-secret-weapon-in-2025-here-are-5-reasons-why/articleshow/122992855.cms",
            "description": "India's surging economy is spotlighting mid-cap equities as prime opportunities for long-term wealth creation. These firms offer a blend of growth, diversification, and risk-adjusted returns, fueled by structural reforms and demographic strengths. Data reveals mid-caps have significantly outpaced large-caps in market cap acceleration and returns.",
            "pubDate": "2025-07-30T09:45:11.538471"
        },
        {
            "title": "FOMC July 2025 meeting: Jerome Powell’s rate cut decision speech tonight. What to expect and where to watch live?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fomc-july-2025-meeting-jerome-powells-rate-cut-decision-speech-tonight-what-to-expect-and-where-to-watch-live/articleshow/122992774.cms",
            "description": "The U.S. Federal Reserve will conclude its July FOMC meeting tonight, with Chair Jerome Powell set to deliver a pivotal speech amid global rate-cut speculation. While the Fed is likely to keep interest rates unchanged, investors will watch for any shift in Powell’s tone that could hint at a future policy pivot. The address will stream live at 11:30 PM IST on the Fed’s YouTube channel and website.",
            "pubDate": "2025-07-30T09:45:11.538565"
        },
        {
            "title": "Ola Electric held talks on potential high-yield debt financing: Sources",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-held-talks-on-potential-high-yield-debt-financing-sources/articleshow/122992221.cms",
            "description": "Ola Electric, facing a significant share decline and past crises like scooter fires, has reportedly engaged in preliminary discussions with lenders to secure approximately 10 billion rupees ($116 million) through high-yield debt. The funds are primarily intended for working capital, with potential lenders considering interest rates between 17.5% and 20% for this special situation financing.",
            "pubDate": "2025-07-30T09:45:11.538664"
        },
        {
            "title": "Japan's Nikkei treads water as central bank meetings, tariff deadline loom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-treads-water-as-central-bank-meetings-tariff-deadline-loom/articleshow/122992236.cms",
            "description": "Nikkei remained stable as investors are cautious. Policy announcements from the Federal Reserve and Bank of Japan are expected. Trump's trade deal deadline is also awaited. Airlines underperformed, with ANA Holdings declining after its earnings report. Advantest also experienced a slight dip. Sumitomo Pharma saw a significant surge. Market participants are closely monitoring these events for future direction.",
            "pubDate": "2025-07-30T09:45:11.538776"
        },
        {
            "title": "US–China trade truce talks show progress, no breakthrough yet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uschina-trade-truce-talks-show-progress-no-breakthrough-yet/slideshow/122992439.cms",
            "description": "In a bid to ease rising global tensions over trade, U.S. and Chinese officials held two days of talks in Stockholm. The meetings were described as constructive by both sides, raising hopes of a possible extension to the current 90-day tariff truce. With the trade war between the world’s two largest economies threatening global economic stability, the outcomes of these discussions hold significant implications for markets worldwide. (Source: Reuters)",
            "pubDate": "2025-07-30T09:45:11.538875"
        },
        {
            "title": "Stocks to Buy | Short Covering Time? Vinay Rajani’s Tactical Take on Nifty's Trend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-short-covering-time-vinay-rajanis-tactical-take-on-niftys-trend/slideshow/122991719.cms",
            "description": "Vinay Rajani, in an interview with ET Now, said that Nifty has experienced a steep correction, falling over 1,000 points from its recent swing high of 25,670. The index has now approached a crucial support zone between 24,500 and 24,600. According to Vinay, this zone coincides with the 100-day Exponential Moving Average, currently around 24,598. He also highlights that this level served as a consolidation base in June, making it a technically significant support area.Vinay Rajani adds that the derivative data signals an oversold condition, with the FII long-to-short ratio in index futures at a very low 0.17. This extreme reading suggests that short-covering by FIIs could take place soon, increasing the potential for a technical bounce from this key support zone.",
            "pubDate": "2025-07-30T09:45:11.538968"
        },
        {
            "title": "Jefferies sees ‘greenshoots’ for Indian metal players, picks Tata Steel and Jindal Stainless as top bets for rebound",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-sees-greenshoots-for-indian-metal-players-picks-tata-steel-and-jindal-stainless-as-top-bets-for-rebound/articleshow/122991413.cms",
            "description": "The brokerage observed that domestic hot-rolled coil (HRC) prices in China have climbed 8% over the past month, driven by expectations of production cuts under Beijing’s “anti-involution” policy and a $167 billion stimulus-backed hydropower project.",
            "pubDate": "2025-07-30T09:45:11.539063"
        },
        {
            "title": "Stocks to buy on dips: A strategic approach in a fairly valued market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-on-dips-a-strategic-approach-in-a-fairly-valued-market/slideshow/122991311.cms",
            "description": "Trideep Bhattacharya in an interview to ET Now said that the markets are currently trading at fair value. Largecap indices are about 5% above their 10-year average valuation, while mid and smallcap indices are trading at a 20–30% premium. With the Nifty approaching its September 2024 highs, he feels the next upward move will need a new catalyst — likely in the form of earnings upgrades, which he expects to arrive in three to five months.",
            "pubDate": "2025-07-30T09:45:11.539157"
        },
        {
            "title": "Indiqube Spaces shares fall 8% after weak market debut. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indiqube-spaces-shares-fall-8-after-weak-market-debut-what-should-investors-do/articleshow/122990555.cms",
            "description": "Indiqube Spaces shares experienced a decline after a weak stock market debut, trading below the IPO price due to investor concerns about valuation and profitability. Despite short-term skepticism, the company's business model in flexible workspaces and strong EBITDA margins offer long-term potential. Analysts suggest a neutral stance, closely monitoring performance and expansion strategies.",
            "pubDate": "2025-07-30T09:45:11.539257"
        }
    ]
}