{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-17T04:02:40.063819",
    "items": [
        {
            "title": "Asian stocks have cautious start, Bitcoin in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-have-cautious-start-bitcoin-in-focus/articleshow/125373908.cms",
            "description": "Asian markets opened with caution. Investors await crucial US economic data. Uncertainty surrounds the US Federal Reserve's next move. Japan and Australia saw slight dips. South Korea's equities climbed. Bitcoin's gains have largely vanished. Oil prices are down, while gold is up. This week promises significant market movements.",
            "pubDate": "2025-11-17T01:13:14.277302"
        },
        {
            "title": "Stocks in news: Kotak Mahindra Bank, Websol, Glenmark Pharma, Minda Corp, Anant Raj",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-kotak-mahindra-bank-websol-glenmark-pharma-minda-corp-anant-raj/articleshow/125367018.cms",
            "description": "Indian markets experienced volatility, ending with modest gains as equities grapple with conflicting signals and cautious sentiment due to US market corrections. Kotak Mahindra Bank's board will consider a stock split, while Godrej Properties plans significant housing unit launches. NTPC aims for a substantial share in India's nuclear capacity, and Websol Energy System is exploring a large solar manufacturing facility.",
            "pubDate": "2025-11-17T01:13:14.277424"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125367104.cms",
            "description": "Indian equities closed higher on Friday. Nifty gained 31 points, reaching 25,910. Easing retail inflation and a strong corporate earnings season provided a supportive backdrop. Analysts anticipate markets to remain firm. A potential India-US trade deal could drive further gains. Foreign portfolio investors were net sellers, while domestic institutional investors were net buyers.",
            "pubDate": "2025-11-17T01:13:14.277840"
        },
        {
            "title": "Will Nifty break past the 26,000–26,100 hurdle this week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-nifty-break-past-the-2600026100-hurdle-this-week/articleshow/125373721.cms",
            "description": "Nifty is poised for further gains, with analysts eyeing a decisive move above 26,000-26,100 for the next rally leg. Key support is seen at 25,500-25,750. Banking and IT strength are supporting the index, with expectations of retesting previous highs.",
            "pubDate": "2025-11-17T01:13:14.277940"
        },
        {
            "title": "What do Bihar Poll results spell for market, economy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-do-bihar-poll-results-spell-for-market-economy/articleshow/125373673.cms",
            "description": "Bihar election results highlight the impact of cash transfers on voter turnout and electoral success. While markets anticipate a positive reaction to the NDA's victory, concerns are rising over the fiscal deficit implications of such populist spending. Brokerages note that increased subsidy spending could push states' fiscal deficits beyond the 3% GDP ceiling.",
            "pubDate": "2025-11-17T01:13:14.278038"
        },
        {
            "title": "Private credit finds deeper funding pools at home",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/private-credit-finds-deeper-funding-pools-at-home/articleshow/125373768.cms",
            "description": "India's private credit sector is becoming the new darling for wealthy investors and family offices. With stock markets frequently in turmoil, these high-net-worth individuals are turning their gaze toward high-yield opportunities that private credit provides.",
            "pubDate": "2025-11-17T01:13:14.278225"
        },
        {
            "title": "RBI's  moratorium on loan repayments could help exporters take a breath amid uncertainties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbis-moratorium-on-loan-repayments-could-help-exporters-take-a-breath-amid-uncertainties/articleshow/125373764.cms",
            "description": "The Reserve Bank of India is stepping up to assist exporters with a key moratorium on loan repayments. This timely intervention is designed to give businesses the flexibility they need to adapt to the shifting tides of global commerce and pursue fresh avenues for growth.",
            "pubDate": "2025-11-17T01:13:14.278320"
        },
        {
            "title": "Anant Raj shares in focus on Rs 4,500-crore investment plan in Andhra Pradesh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anant-raj-shares-in-focus-on-rs-4500-crore-investment-plan-in-andhra-pradesh/articleshow/125375373.cms",
            "description": "Anant Raj will be in focus after announcing a Rs 4,500 crore investment to set up a data centre and IT park in Andhra Pradesh through its subsidiary ARCPL. The project is expected to create 16,000 jobs and add to its ongoing 307 MW data centre capacity expansion. Strong Q2FY26 results, rising revenues, and new real estate project clearances further highlight the company’s growth momentum.",
            "pubDate": "2025-11-17T03:41:19.705831"
        },
        {
            "title": "Alembic Pharmaceuticals shares in focus after USFDA nod for key hypertension drug",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alembic-pharmaceuticals-shares-in-focus-after-usfda-nod-for-key-hypertension-drug/articleshow/125375170.cms",
            "description": "Alembic Pharmaceuticals will be in focus after securing final USFDA approval for Diltiazem Hydrochloride Tablets, a widely used treatment for high blood pressure and angina. The drug is deemed therapeutically equivalent to Bausch Health’s Cardizem. With this approval, Alembic’s total ANDA count rises to 230. The stock closed at Rs 904.20 on Friday, down 14% so far in 2025.",
            "pubDate": "2025-11-17T03:41:19.705955"
        },
        {
            "title": "Muthoot Finance among 6 stocks witnessing 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muthoot-finance-among-6-stocks-witnessing-5-year-swing-high-breakouts/slideshow/125375147.cms",
            "description": "In the NSE list of stocks with a market cap above Rs 1,000 crore, six stocks hit a 5-year swing high at the close on November 14, indicating bullish momentum, according to technical scan data from StockEdge.A 5-year swing high represents the highest price a stock has reached within five years. This level often acts as a significant resistance zone where the price has historically struggled to move higher. Reaching this point can be viewed as a bullish signal, suggesting potential for further upside. However, this differs from a 5-year breakout, which occurs when a stock decisively surpasses a resistance level that has held for five years or more.",
            "pubDate": "2025-11-17T03:41:19.706063"
        },
        {
            "title": "Maruti Suzuki shares in focus as company recalls 39,506 Grand Vitara units",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-shares-in-focus-as-company-recalls-39506-grand-vitara-units/articleshow/125375068.cms",
            "description": "Maruti Suzuki will be in focus after recalling 39,506 Grand Vitara SUVs manufactured between December 2024 and April 2025 due to faulty fuel-level indicators. The company will inspect and replace parts free of cost. The recall comes as the Grand Vitara remains a top performer, driven by rising demand for its Strong Hybrid variants. Maruti’s stock closed at Rs 15,678 on Friday.",
            "pubDate": "2025-11-17T03:41:19.706176"
        },
        {
            "title": "DOMS Industries, Amber Enterprises among 7 stocks showing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/doms-industries-amber-enterprises-among-7-stocks-showing-bullish-signals/slideshow/125375010.cms",
            "description": "On November 14, in the Nifty500 pack, seven stocks appeared in the bullish White Marubozu scanner, according to technical scan data from StockEdge. A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for the period and the closing price is the highest.Characterised by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it signals strong buying pressure throughout the session. Traders interpret this as a sign that buyers were in control from open to close, often using the pattern to make informed decisions about future price movements.",
            "pubDate": "2025-11-17T03:41:19.706277"
        },
        {
            "title": "Godrej Consumer and 5 other stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-and-5-other-stocks-showing-bullish-rsi-upswing/slideshow/125374938.cms",
            "description": "On November 14, in the NSE large-cap segment, six stocks appeared in the RSI Trending Up scan based on data from StockEdge. An uptrend signal is generated when the RSI crosses above 50 from below. “RSI trending up” indicates rising Relative Strength Index (RSI) values, suggesting strengthening price momentum. This may point to potential upward movement and is often used by traders to identify buying opportunities.",
            "pubDate": "2025-11-17T03:41:19.706396"
        },
        {
            "title": "Tata Motors PV shares in focus on JLR  guidance cut, Q2 net profit on one-time gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-pv-shares-in-focus-on-jlr-guidance-cut-q2-net-profit-on-one-time-gain/articleshow/125374708.cms",
            "description": "Tata Motors shares are under investor watch. The company reported weak September quarter results. Its luxury unit, Jaguar Land Rover, also cut its guidance. This follows a cyber incident impacting Jaguar Land Rover's performance. Despite challenges, Tata Motors' domestic operations showed resilience. The company's multi-powertrain portfolio, including EVs, drove growth.",
            "pubDate": "2025-11-17T03:41:19.706499"
        },
        {
            "title": "Kotak Mahindra Bank shares in focus as board considers first stock split in 15 years. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-as-board-considers-first-stock-split-in-15-years-check-details/articleshow/125374669.cms",
            "description": "Kotak Mahindra Bank's board will consider a share split proposal on November 21, potentially making its stock more accessible. The bank's Q2 earnings met expectations, though margins saw a sequential dip. Analysts remain cautious, citing underperformance in NIM and slippage trends compared to peers.",
            "pubDate": "2025-11-17T03:41:19.706595"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Centum Electronics, SJVN among 5 stocks that could give 15-59% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-centum-electronics-sjvn-among-5-stocks-that-could-give-15-59-return/slideshow/125374631.cms",
            "description": "Analysts remain broadly optimistic across defence, infrastructure, power, and engineering names, with multiple brokerages issuing Buy calls backed by strong order books, sector tailwinds, and improving earnings visibility.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-17T03:41:19.706687"
        },
        {
            "title": "Autoriders International approach record date for 5:1 bonus issue. Last day to buy shares to qualify",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/autoriders-international-approach-record-date-for-51-bonus-issue-last-day-to-buy-shares-to-qualify/articleshow/125374453.cms",
            "description": "Today is the final chance for investors to buy Autoriders International shares for a 5:1 bonus issue. Shareholders will receive five extra shares for every one they hold. The stock becomes ex-bonus on November 18. This corporate action capitalizes the company's free reserves. Bonus shares will automatically appear in demat accounts. Investors must complete purchases today for eligibility.",
            "pubDate": "2025-11-17T03:41:19.706787"
        },
        {
            "title": "Asian Paints shares to trade ex-dividend on Nov 18 for Rs 4.50 interim payout. Check payment date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-shares-to-trade-ex-dividend-on-nov-18-for-rs-4-50-interim-payout-check-payment-date/articleshow/125374424.cms",
            "description": "Asian Paints shares will trade ex-dividend on November 18 for its interim dividend of Rs 4.50 per equity share. Investors must own the stock before this date to be eligible for the payout. The company recently reported a 43% year-on-year growth in consolidated net profit for Q2.",
            "pubDate": "2025-11-17T03:41:19.706878"
        },
        {
            "title": "Adani Enterprises’ Rs 24,930 crore rights issue hits record date today. Here’s what lies ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-rs-24930-crore-rights-issue-hits-record-date-today-heres-what-lies-ahead/articleshow/125374393.cms",
            "description": "Adani Enterprises Limited's major rights issue has set its record date. Eligible shareholders can now look forward to the subscription window opening soon. This significant equity raise will be structured with a staggered payment plan. Key dates for application and future payments are now in focus for investors.",
            "pubDate": "2025-11-17T03:41:19.706970"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/125374364.cms",
            "description": "In the Nifty500 pack, 11 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on November 14, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-11-17T03:41:19.707064"
        },
        {
            "title": "Ideaforge Technology shares in focus as co lands over Rs 100 crore in defence orders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ideaforge-technology-shares-in-focus-as-co-lands-over-rs-100-crore-in-defence-orders/articleshow/125375503.cms",
            "description": "Ideaforge Technology shares: IdeaForge has won over ₹100 crore in new defence orders, including a ₹75-crore Indian Army contract for its next-gen Zolt tactical drone after rigorous EW field trials, plus a ₹30-crore order for its SWITCH 2 VTOL drone.",
            "pubDate": "2025-11-17T04:02:38.707526"
        },
        {
            "title": "From Ola to BSE and Tata stocks: Retail investors bet Rs 18,000 crore on these 10 stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-ola-to-bse-and-tata-stocks-retail-investors-bet-rs-18000-crore-on-these-10-stocks/articleshow/125375457.cms",
            "description": "Retail investors injected over ₹18,000 crore into ten diverse stocks, including BSE, TCS, and Ola Electric, during the September 2025 quarter. Despite market volatility, individual investors showed a contrarian approach, increasing holdings in beaten-down stocks while divesting from some financial heavyweights. This sustained retail participation highlights their significant and growing influence in the Indian stock market.",
            "pubDate": "2025-11-17T04:02:38.707670"
        }
    ]
}