{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-08T11:18:11.483719",
    "items": [
        {
            "title": "LIC profit grows 5% despite lower equity gains in a volatile Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-profit-grows-5-despite-lower-equity-gains-in-a-volatile-q1/articleshow/123176791.cms",
            "description": "LIC reported a 5% increase in net profit to ₹10,986 crore, despite moderating capital gains from equity sales. The company's core insurance operating profit remained strong, with a 20.75% rise in the value of new business. LIC aims for double-digit profit expansion and is focusing on growing its non-participating business, which now constitutes over 30% of its portfolio.",
            "pubDate": "2025-08-08T06:55:55.976877"
        },
        {
            "title": "Tata Motors Q1 Results: Cons profit plunges 63% YoY to Rs 3,924 crore, but beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-q1-results-cons-profit-plunges-63-yoy-to-rs-3924-crore-but-beats-street-estimates/articleshow/123187388.cms",
            "description": "Tata Motors Q1 Results: The profit attributable to shareholders was higher than Street estimates of Rs 3,408 crore.",
            "pubDate": "2025-08-08T11:18:03.812871"
        },
        {
            "title": "GRSE Q1 Results: PAT surges 38% YoY to Rs 120 crore, revenue up 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grse-q1-results-pat-surges-38-yoy-to-rs-120-crore-revenue-up-by-30/articleshow/123185616.cms",
            "description": "Garden Reach Shipbuilders & Engineers (GRSE) reported a strong first quarter for FY26, with a 37.8% YoY increase in profit after tax, reaching Rs 120.17 crore. Revenue from operations also saw a significant rise of 29.7% YoY, totaling Rs 1,309.87 crore. The company's earnings per share improved to Rs 10.49, reflecting overall positive financial performance.",
            "pubDate": "2025-08-08T11:18:03.812995"
        },
        {
            "title": "Info Edge Q1 Results: Cons PAT jumps 27% YoY to Rs 296 crore, revenue up 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/info-edge-q1-results-cons-pat-jumps-27-yoy-to-rs-296-crore-revenue-up-17/articleshow/123185261.cms",
            "description": "Info Edge (India) reported a 27% year-on-year increase in consolidated net profit for the June quarter, reaching Rs 296 crore. Revenue also saw a 17% rise to Rs 791 crore. Standalone billings grew by 11.2%, with recruitment business increasing by 9.0% and non-recruitment portfolio growing by 17.6%. However, the recruitment segment faced headwinds and a sectoral slowdown.",
            "pubDate": "2025-08-08T11:18:03.813102"
        },
        {
            "title": "Grasim Industries Q1 Results: Cons net profit jumps 32% YoY to Rs 1,419 crore, revenue rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grasim-industries-q1-results-cons-net-profit-jumps-32-yoy-to-rs-1419-crore-revenue-rises-16/articleshow/123184975.cms",
            "description": "Grasim Industries announces a strong first quarter. The company's net profit rises by 32% compared to last year. Revenue from operations also increases significantly. Cement and Chemicals businesses drive the growth. The Paints business remains a key focus. The company anticipates benefiting from India's economic growth. Expansion plans for Cellulosic Fibres are underway.",
            "pubDate": "2025-08-08T11:18:03.813209"
        },
        {
            "title": "SBI Q1 Results: Standalone PAT jumps 12% YoY to Rs 19,160 crore, beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-q1-results-standalone-pat-jumps-12-yoy-to-rs-19160-crore-beats-street-estimates/articleshow/123183756.cms",
            "description": "SBI Q1 Results: SBI reported 6% YoY growth in interest income to Rs 1,17,996 crore for Q1FY26, while interest expenses rose 9% to Rs 76,923 crore. Profit growth was attributed to operating efficiency and controlled expenses. Despite weak market sentiment, shares recovered from day’s low post-results, trading over 1% lower on NSE after the announcement during market hours.",
            "pubDate": "2025-08-08T11:18:03.813312"
        },
        {
            "title": "Page Industries Q1 Results: Profit rises 21.5% to Rs 200.8 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/page-industries-q1-results-profit-rises-21-5-to-rs-200-8-crore/articleshow/123182788.cms",
            "description": "Page Industries Limited has announced a rise in net profit. The apparel manufacturer's profit increased by 21.52 percent for the June quarter. The company's net profit is now Rupees 200.79 crore. Revenue from operations also saw a boost. It increased 3 percent to Rupees 1,316.56 crore. The company's board has declared an interim dividend.",
            "pubDate": "2025-08-08T11:18:03.813415"
        }
    ]
}