{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-05T16:59:27.575039",
    "items": [
        {
            "title": "Adani Ports Q2 net soars 29% on logistics, marine strength",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-ports-q2-net-soars-29-on-logistics-marine-strength/articleshow/125099442.cms",
            "description": "Adani Ports reported a significant 29% year-on-year increase in net profit to ₹3,120 crore for the September quarter, driven by robust growth in its logistics and marine businesses. Revenue surged 30% to ₹9,167 crore, with cargo volumes rising 12% and market share reaching 28.1%.",
            "pubDate": "2025-11-05T03:36:39.042162"
        },
        {
            "title": "SBI Q2 profit rises 10% on loan growth; and yes, it beats Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-q2-profit-rises-10-on-loan-growth-and-yes-it-beats-street/articleshow/125099233.cms",
            "description": "State Bank of India reported a significant 10% year-on-year profit increase to ₹20,160 crore in the second quarter. This performance surpassed market expectations, driven by robust growth in retail, agriculture, and MSME advances. The bank also benefited from a profitable sale of its Yes Bank stake.",
            "pubDate": "2025-11-05T03:36:39.042321"
        },
        {
            "title": "Chalet Hotels posts revenue of Rs 735 cr for Q2, PAT at Rs 154 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/chalet-hotels-posts-revenue-of-rs-735-cr-for-q2-pat-at-rs-154-cr/articleshow/125103307.cms",
            "description": "Chalet Hotels reported a significant surge in revenue to Rs 735 crore and a net profit of Rs 154 crore in Q2 FY26, a substantial improvement from the previous year. The company also launched its premium lifestyle brand, ATHIVA Hotels & Resorts, with the rebranding of The Dukes Retreat.",
            "pubDate": "2025-11-05T07:32:46.280445"
        },
        {
            "title": "LIC Q2 preview: APE may drop up to 10% YoY on high base, but margin stability offers comfort. 7 things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-q2-preview-ape-may-drop-up-to-10-yoy-on-high-base-but-margin-stability-offers-comfort-7-things-to-track/articleshow/125101767.cms",
            "description": "LIC is set to announce its September quarter results on Thursday, with brokerages expecting up to a 10% year-on-year drop in its Annual Premium Equivalent (APE) to Rs 14,840–16,380 crore. Estimates for Value of New Business (VNB) range between Rs 2,374 crore and Rs 3,018 crore.",
            "pubDate": "2025-11-05T07:32:46.280597"
        },
        {
            "title": "Grasim Industries Q2 Results: Cons net profit soars 76% YoY to Rs 553 crore, revenue up 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grasim-industries-q2-results-cons-net-profit-jumps-76-yoy-to-rs-553-crore-revenue-up-17/articleshow/125105238.cms",
            "description": "Grasim Industries announced strong financial results for the second quarter of fiscal year 2026. The company's net profit saw a significant 76 percent increase year-on-year. Revenue from operations also climbed by 16.6 percent compared to the same period last year. These figures highlight a period of robust growth for the Aditya Birla Group flagship.",
            "pubDate": "2025-11-05T09:27:29.082853"
        },
        {
            "title": "Tools manufacturer Kennametal India Q1 profit rises 29% to Rs 434 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tools-manufacturer-kennametal-india-q1-profit-rises-29-to-rs-434-crore/articleshow/125109567.cms",
            "description": "Kennametal India Ltd. reported a significant 28.8% year-on-year increase in profit before tax to Rs 434 crore for its September quarter. This growth was fueled by rising market demand and a strong focus on operational efficiency, with revenue climbing 9.5% to Rs 2,960 crore. The company's hard metal and machining solutions segments were key drivers of this performance.",
            "pubDate": "2025-11-05T13:26:40.062023"
        },
        {
            "title": "Delhivery Q2 Results: Co turns to red, suffers net loss of Rs 50 crore despite 17% rise in revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/delhivery-q2-results-co-turns-to-red-suffers-net-loss-of-rs-50-crore-despite-17-rise-in-revenue/articleshow/125108946.cms",
            "description": "Delhivery reported a consolidated net loss of Rs 50.38 crore in Q2 FY26, a shift from a profit in the prior year, despite a 16.9% rise in revenue to Rs 2,559.3 crore. The company achieved record festive volumes, with Express Parcel shipments up 32% YoY, driven by strong operational performance and successful integration of Ecom Express.",
            "pubDate": "2025-11-05T13:26:40.062154"
        },
        {
            "title": "Fairfax-backed CSB Bank reports 16% YoY rise in net profit to Rs 160 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/fairfax-backed-csb-bank-reports-16-yoy-rise-in-net-profit-to-rs-160-crore/articleshow/125108429.cms",
            "description": "Fairfax-backed CSB Bank reported a 16% YoY rise in Q2 profit to ₹160 crore, driven by higher interest income and 16% NII growth to ₹424 crore. The bank plans to expand its retail, SME, and NRI businesses, including a new Dubai office, while maintaining a conservative gold loan strategy.",
            "pubDate": "2025-11-05T13:26:40.062277"
        },
        {
            "title": "Sun Pharma Q2 Results: Cons profit up 3% YoY to Rs 3,118 crore, revenue rises 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sun-pharma-q2-results-cons-profit-up-3-yoy-at-rs-31180-crore-revenue-rises-9/articleshow/125107348.cms",
            "description": "Sun Pharmaceutical Industries reported a net profit of Rs 3,117.95 crore for Q2 FY26, a 2.6% year-on-year increase. Revenue from operations grew 8.6% to Rs 14,405.22 crore, with U.S. Innovative Medicines sales surpassing Generics for the first time. The company's R&D investment stood at 5.4% of sales.",
            "pubDate": "2025-11-05T13:26:40.062380"
        },
        {
            "title": "Embassy REIT Q2 revenue rises 13% YoY to Rs 1,124 crore; NOI up 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/embassy-reit-q2-revenue-rises-13-yoy-to-rs-1124-crore-noi-up-15/articleshow/125107369.cms",
            "description": "Embassy Office Parks REIT reported a 13% YoY rise in Q2 FY26 revenue to ₹1,124 crore and 15% NOI growth to ₹927 crore, with 93% occupancy, ₹6.51 per unit distribution, and robust leasing momentum led by Bengaluru.",
            "pubDate": "2025-11-05T13:26:40.062480"
        },
        {
            "title": "Saregama Q2 net profit marginally lower at Rs 44 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/saregama-q2-net-profit-marginally-lower-at-rs-44-crore/articleshow/125110912.cms",
            "description": "Saregama, a part of RPSG Group, saw a slight dip in its September quarter performance. Net profit fell 2% year-on-year to Rs 44 crore. Revenue from operations also declined 5% to Rs 230 crore. The company declared an interim dividend of Rs 4.50 per share. Saregama expanded its music portfolio and saw growth in its live events business.",
            "pubDate": "2025-11-05T15:23:46.291008"
        },
        {
            "title": "Mindspace REIT Q2 operating income rises 26% on strong leasing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mindspace-reit-q2-operating-income-rises-26-on-strong-leasing/articleshow/125110365.cms",
            "description": "Mindspace Business Parks REIT reported a significant 25.8% year-on-year increase in net operating income to Rs 634 crore for the September quarter, driven by strong leasing and stable occupancy. Revenue from operations grew 24.8% to Rs 778 crore, with distribution rising 16.3% to Rs 355 crore, resulting in a DPU of Rs 5.83.",
            "pubDate": "2025-11-05T15:23:46.291155"
        },
        {
            "title": "McDonald's boosts third quarter sales by emphasizing value but warns customers remain pressured",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mcdonalds-boosts-third-quarter-sales-by-emphasizing-value-but-warns-customers-remain-pressured/articleshow/125112598.cms",
            "description": "McDonald's saw a sales boost from value offerings like Snack Wraps, but CEO Chris Kempczinski warns economic pressures will persist, impacting lower-income consumers. The company is leaning into discounts, sharing costs with franchisees, to maintain customer traffic amidst inflation and concerns about government aid.",
            "pubDate": "2025-11-05T16:59:24.767244"
        },
        {
            "title": "Britannia Q2 Results: Profit rises 23% to Rs 655 crore; sales up 4% at Rs 4,752 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/britannia-q2-results-profit-rises-23-to-rs-655-crore-sales-up-4-at-rs-4752-crore/articleshow/125112549.cms",
            "description": "Britannia Industries reported a 23.23% rise in consolidated net profit to Rs 655.06 crore for the September quarter, driven by stable commodity prices and cost optimization. Revenue from product sales increased by 4% to Rs 4,752.17 crore. The company anticipates progressive normalization of short-term impacts from GST changes, with adjacent bakery categories showing strong double-digit growth.",
            "pubDate": "2025-11-05T16:59:24.767375"
        },
        {
            "title": "The Ramco Cements Q2 Results: Net profit jumps three-fold to Rs 78 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/the-ramco-cements-q2-results-net-profit-jumps-three-fold-to-rs-78-crore/articleshow/125110642.cms",
            "description": "The Ramco Cements reported a significant three-fold surge in its consolidated net profit to Rs 77.88 crore for the September quarter. Revenue from operations grew 9.52% to Rs 2,238.74 crore, though cement sales volume remained flat. The company plans to reach 30 MTPA cement capacity by March 2026.",
            "pubDate": "2025-11-05T16:59:24.767587"
        }
    ]
}