{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-08T02:59:50.163797",
    "items": [
        {
            "title": "Eternal shares in focus as 0.5% stake likely to be offloaded via Rs 1,500 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-in-focus-as-0-5-stake-likely-to-be-offloaded-via-rs-1500-crore-block-deal/articleshow/125824850.cms",
            "description": "Eternal, Zomato's parent company, will see a 0.5% stake offloaded by an institutional investor on December 8, valued up to Rs 1,500 crore at a slight discount. This stake sale occurs amidst significant capital-raising activities by rivals Zepto and Swiggy in the quick-commerce sector. Eternal's shares have shown mixed performance, with a recent decline despite positive year-to-date and six-month trends.",
            "pubDate": "2025-12-08T02:59:35.379065"
        },
        {
            "title": "IndiGo shares in focus on DGCA deadline extension, flight operations stabilisation update",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-on-dgca-deadline-extension-flight-operations-stabilisation-update/articleshow/125824811.cms",
            "description": "IndiGo's CEO has been granted an extension to respond to a DGCA show-cause notice regarding massive flight disruptions. The airline expects its network to stabilize by December 10, reporting improved on-time performance and reduced cancellations after implementing revised pilot duty norms.",
            "pubDate": "2025-12-08T02:59:35.379182"
        },
        {
            "title": "Negative Breakout: These 10 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-cross-below-their-200-dmas/slideshow/125824535.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 1,000 crore, 10 stocks fell more than 2.5% and their closing prices crossed below their 200-day moving average (200 DMA) on December 5, according to technical scan data from StockEdge.com. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-12-08T02:59:35.379282"
        },
        {
            "title": "Ravelcare shares to list today. Here's what GMP indicates ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ravelcare-shares-to-list-today-heres-what-gmp-indicates-ahead-of-debut/articleshow/125824590.cms",
            "description": "Ravelcare is set to list on the BSE SME platform on December 8. The company saw a strong subscription response for its IPO. It raised Rs 24.10 crore through a fresh issue of shares. The grey market premium indicates modest listing expectations. Ravelcare is a digital-first beauty and personal care brand.",
            "pubDate": "2025-12-08T02:59:35.379375"
        },
        {
            "title": "Clear Secured Services IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/clear-secured-services-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/125824574.cms",
            "description": "Clear Secured Services is set for its market debut on December 8 following a successful ₹85.60 crore IPO, which saw strong investor demand. The integrated facility management firm, offering diverse services to sectors like telecom and banking, aims to bolster its operations and repay debt with the raised capital. Investors will be watching its NSE-SME listing performance closely.",
            "pubDate": "2025-12-08T02:59:35.379473"
        },
        {
            "title": "Speb Adhesives shares to debut today. GMP hints at muted gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/speb-adhesives-shares-to-debut-today-gmp-hints-at-muted-gains/articleshow/125824566.cms",
            "description": "Speb Adhesives is set to debut on the NSE SME on December 8, following a moderately subscribed IPO. The company, a manufacturer of solvent-based synthetic rubber adhesives, raised funds for a new water-based adhesives facility. With steady financial growth and an expanding product range, market watchers will observe its listing performance.",
            "pubDate": "2025-12-08T02:59:35.379572"
        },
        {
            "title": "Invicta Diagnostic share to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/invicta-diagnostic-share-to-list-today-check-gmp-ahead-of-debut/articleshow/125824552.cms",
            "description": "Invicta Diagnostic is set to debut on the NSE SME platform on December 8, following a successful IPO that raised 28.12 crore. The company, operating under the PC Diagnostics brand, offers integrated pathology and radiology services across the Mumbai Metropolitan Region.  Its expansion plans, focused on new centers and equipment, aim to drive future growth.",
            "pubDate": "2025-12-08T02:59:35.379669"
        },
        {
            "title": "Astron Multigrain IPO to debut today. Here's what GMP suggests ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/astron-multigrain-ipo-to-debut-today-heres-what-gmp-suggests-ahead-of-listing/articleshow/125824492.cms",
            "description": "Astron Multigrain is set to list on the BSE SME platform on December 8 following a modest IPO that closed at ₹18.40 crore. The company, which manufactures instant noodles and other snacks, saw a 1.22 times overall subscription, with retail investors showing more interest than non-institutional investors. Proceeds will fund capital expenditure and working capital needs.",
            "pubDate": "2025-12-08T02:59:35.379762"
        },
        {
            "title": "GIFT Nifty down 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125824189.cms",
            "description": "Indian stock markets rose on Friday following a 25-basis-point rate cut by the RBI. Analysts anticipate consolidation with a positive outlook, supported by RBI's actions and steady domestic flows. Global markets showed mixed movements. Foreign portfolio investors were net sellers, while domestic institutional investors were net buyers. The Indian Rupee closed lower against the US dollar.",
            "pubDate": "2025-12-08T02:59:35.379857"
        },
        {
            "title": "Stocks in news: IndiGo, Bajaj Finserv, Eternal, Ola Electric, Fino Payments Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indigo-bajaj-finserv-eternal-ola-electric-fino-payments-bank/articleshow/125824155.cms",
            "description": "Indian markets closed higher on Friday, showing resilience. Nifty's bounce from support suggests the uptrend may continue. IndiGo, Bajaj Finserv, Eternal, Ola Electric, and Fino Payments Bank are in focus. Bajaj Finserv plans expansion into pensions and wealth management. Ola Electric begins mass deliveries of new vehicles. RailTel and Cochin Shipyard secured new orders.",
            "pubDate": "2025-12-08T02:59:35.379989"
        },
        {
            "title": "Asian stocks tread water at the start of Fed week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-tread-water-at-the-start-of-fed-week/articleshow/125824137.cms",
            "description": "Asian stocks opened cautiously as traders assessed strained China-Japan relations and upcoming central bank decisions. Investor caution grew regarding the AI rally's sustainability, with markets anticipating policy announcements from major central banks amid renewed inflation pressures. The Federal Reserve's rate path for 2026 remains uncertain, balancing price pressures and economic activity.",
            "pubDate": "2025-12-08T02:59:35.380083"
        },
        {
            "title": "Will Nifty break past 26,350 for a fresh rally this week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-nifty-break-past-26350-for-a-fresh-rally-this-week/articleshow/125823932.cms",
            "description": "Nifty is expected to continue its uptrend, consolidating near record highs. Analysts suggest buying on dips, with a breakout potentially pushing the index towards 26,500-26,800. IndusInd Bank and PB Fintech are highlighted as top stock picks, with specific buy recommendations and targets.",
            "pubDate": "2025-12-08T02:59:35.380173"
        },
        {
            "title": "Bajaj Finserv plans foray into pension, wealth management in '26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-plans-foray-into-pension-wealth-management-in-26/articleshow/125823986.cms",
            "description": "Next year, Bajaj Finserv is paving the way for a dynamic foray into pensions and wealth management, setting the stage for a robust financial future. With ambitions to list its insurance arms in the next four to five years, this strategy is a cornerstone of their ambitious five-year roadmap aimed at tripling revenue by FY30.",
            "pubDate": "2025-12-08T02:59:35.380366"
        },
        {
            "title": "Banks unlikely to reduce deposit rates despite RBI easing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-unlikely-to-reduce-deposit-rates-despite-rbi-easing/articleshow/125823980.cms",
            "description": "Following the latest repo rate decrease, bankers foresee only slight adjustments to deposit rates. The landscape, characterized by sluggish savings yields and elevated credit-deposit ratios, restricts deeper cuts. Consequently, banks will experience continued margin pressure in the near term. However, a turnaround in profitability is anticipated later this fiscal year.",
            "pubDate": "2025-12-08T02:59:35.380460"
        },
        {
            "title": "RBI may need to inject further Rs 2 lakh crore to let rates transmit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-need-to-inject-further-2-lakh-crore-to-let-rates-transmit/articleshow/125823977.cms",
            "description": "To ensure the recent interest rate reduction truly benefits the economy, the Reserve Bank of India may have to infuse a staggering 1.5 lakh crore into the financial system. This move is seen as vital to offset the liquidity drains caused by advance tax payments and possible forex market interventions.",
            "pubDate": "2025-12-08T02:59:35.380554"
        }
    ]
}