{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-04T16:56:15.615540",
    "items": [
        {
            "title": "Massive upside: 8 largecap stocks set for up to 35% gains in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/massive-upside-8-largecap-stocks-set-for-up-to-35-gains-in-2026/slideshow/126332264.cms",
            "description": "Analyst forecasts offer more than just numbers — they provide a strategic view of future market potential. For investors seeking the next big opportunity, a closer examination of BSE large-cap stocks highlights some promising contenders.Based on consensus estimates from Trendlyne, several large-cap stocks are projected to deliver strong returns over the next 12 months. This anticipated “upside” represents the average expected gain over the coming year, providing a data-driven benchmark for investors targeting high-potential large-cap opportunities. In this analysis, we spotlight eight standout large-cap stocks expected to deliver gains in the range of 20% to 35% in the year ahead. Our selection includes only companies that reported positive growth in net revenue and profit on a sequential basis in the latest September quarter.",
            "pubDate": "2026-01-04T07:49:44.184154"
        },
        {
            "title": "US strike on Venezuela puts oil, gold and global markets on edge ahead of Monday’s open; here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-raid-on-venezuela-puts-oil-gold-and-global-markets-on-edge-ahead-of-mondays-open-heres-why/articleshow/126332139.cms",
            "description": "The U.S. military raid in Venezuela, resulting in President Maduro’s capture, has heightened geopolitical tensions at the start of 2026. Oil, gold, silver, the U.S. dollar, and global equities are expected to react when markets reopen on Monday. Venezuela’s vast energy and gold reserves, combined with market sensitivity after 2025 gains, may drive volatility across key asset classes.",
            "pubDate": "2026-01-04T07:49:44.184274"
        },
        {
            "title": "12 penny stocks surge up to 110% in a month, 2 turn multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-penny-stocks-surge-up-to-110-in-a-month-2-turn-multibaggers/slideshow/126332079.cms",
            "description": "Over the past month, 12 penny stocks delivered strong share price gains ranging from 15% to 110%, with two standout performers emerging as multibaggers and doubling investors’ wealth. These top performers were shortlisted using a targeted screening approach: each stock had a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a recent trading volume of at least 5 lakh shares. This method aims to spotlight low-priced, actively traded micro-cap stocks with strong price momentum. (Data Source: ACE Equity)Penny stocks often attract attention due to their low prices and potential for rapid growth. However, while the upside can be significant, so are the risks. These stocks typically have low liquidity, high price volatility, and limited financial transparency. As a result, successful investing in penny stocks requires more than just good luck—it demands a well-thought-out strategy and disciplined risk management.",
            "pubDate": "2026-01-04T07:49:44.184380"
        },
        {
            "title": "FPIs pull out Rs 7,608 cr from equities in just 2 days of Jan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-pull-out-rs-7608-cr-from-equities-in-just-2-days-of-jan/articleshow/126331696.cms",
            "description": "Foreign portfolio investors have started 2026 on a cautious note, extending their selling streak from last year by withdrawing Rs 7,608 crore (USD 846 million) from Indian equities in the first two trading sessions of January.",
            "pubDate": "2026-01-04T07:49:44.184474"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms surges Rs 1.23 lakh cr; Reliance biggest winner",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-surges-rs-1-23-lakh-cr-reliance-biggest-winner/articleshow/126331677.cms",
            "description": "The combined market capitalisation of seven of the top-10 most-valued firms surged Rs 1,23,724.19 crore last week, in line with an optimistic trend in equities, with Reliance Industries stealing the limelight with the biggest jump in its valuation.",
            "pubDate": "2026-01-04T07:49:44.184574"
        },
        {
            "title": "US-Venezuela conflict, FII flows and Bharat Coking Coal IPO among 10 factors that’ll steer D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-venezuela-conflict-fii-flows-and-bharat-coking-coal-ipo-among-10-factors-thatll-steer-d-street-this-week/articleshow/126331050.cms",
            "description": "Nifty closed the week over 1% higher after hitting a fresh lifetime high, supported by buying in metal and PSU bank stocks. Technical indicators signal continued momentum, with a buy-on-dips strategy advised above 26,000. This week, markets will track geopolitical developments, crude oil trends, Wall Street cues and FII flows for direction.",
            "pubDate": "2026-01-04T07:49:44.184665"
        },
        {
            "title": "Strong balance sheet, management & market share. You just need ‘ability to hold’: 8 large-caps with upside potential of up to 29%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-balance-sheet-management-market-share-you-just-need-ability-to-hold-8-large-caps-with-upside-potential-of-up-to-29/articleshow/126324823.cms",
            "description": "If you are worried about what will happen to the markets because of the US action in Venezuela, don't fret. It will soon be forgotten. In the new global world order, such things will keep occurring. But they will impact market sentiment only for the short term. In the end, it is the earnings of a company that matters to the street. And earnings are dependent on three important things: Quality of the balance sheet, management ability, and market share of the company in its industry. Unfortunately, not many companies have a combination of all three.",
            "pubDate": "2026-01-04T07:49:44.184757"
        },
        {
            "title": "Bajaj Finance Q3 update: New loans booked in December quarter grow 15% YoY, AUM jumps 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-q3-updates-new-loans-booked-in-december-quarter-grow-15-yoy-aum-jumps-22/articleshow/126322998.cms",
            "description": "Bajaj Finance reported a strong December-ended quarter with new loans booked jumping 15% year-on-year to 1.39 crore. The company's Assets Under Management (AUM) saw a significant 22% growth, reaching approximately Rs 4,85,900 crore. The customer franchise also expanded to 11.54 crore, indicating robust business expansion.",
            "pubDate": "2026-01-04T07:49:44.184858"
        },
        {
            "title": "Looking for 2026 winners? Hindustan Copper, BSE among 10 stocks with up to 36% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/looking-for-2026-winners-hindustan-copper-bse-among-10-stocks-with-up-to-36-upside/slideshow/126321592.cms",
            "description": "After delivering 10% returns in 2025, the Nifty’s outlook for 2026 looks more constructive, with the benchmark seen rising 13% to 29,731, according to Nilesh Jain, Head VP – Equity Research at Centrum Broking. Improving macro indicators, stronger Q2 GDP growth, benign inflation and an end to corporate earnings downgrades underpin the positive view, he said, while identifying 10 fundamentally strong stocks offering potential upside of up to 36%.",
            "pubDate": "2026-01-04T07:49:44.184969"
        },
        {
            "title": "FIIs dump Rs 7,608 cr in two sessions after 1.66 lakh cr sell-off in 2025. Why experts remain convinced on trend reversal in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-dump-rs-7608-cr-in-two-sessions-after-1-66-lakh-cr-sell-off-in-2025-why-experts-remain-convinced-on-trend-reversal-in-2026/articleshow/126321416.cms",
            "description": "Foreign Institutional Investors (FIIs) continued their selling spree into 2026, offloading Indian equities worth Rs 7,608 crore in the first two trading sessions. This follows record outflows of Rs 1.66 lakh crore in 2025, driven by elevated valuations and the AI trade. Experts anticipate a turnaround in 2026, with improved fundamentals and GDP growth expected to attract net FII inflows.",
            "pubDate": "2026-01-04T07:49:44.185069"
        },
        {
            "title": "Small-cap stocks: Riskier, yes, but if picked well, risk-reward ratio favours risk-takers; 6 small-caps with upside potential of up to 45%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/small-cap-stocks-riskier-yes-but-if-picked-well-risk-reward-ratio-favours-risk-takers-6-small-caps-with-upside-potential-of-up-to-45/articleshow/126320536.cms",
            "description": "The Q3 earnings season is likely to provide some positive surprises as it will reflect the full impact of the GST rate rejig and the softer interest rates. This may well see the bulls make a comeback. And when the bulls are out in force, retail investors start flocking to small-caps. Now, small-caps have an inherent risk which is technical in nature. But they do provide better returns if you pick the right ones. So, while being bullish, remember to be selective about your choices – and to tread cautiously.",
            "pubDate": "2026-01-04T07:49:44.185157"
        },
        {
            "title": "Dalal Street Week Ahead: Uptrend intact on weekly charts, selective profit-taking likely ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-week-ahead-uptrend-intact-on-weekly-charts-selective-profit-taking-likely-ahead/articleshow/126320300.cms",
            "description": "Nifty closed at a lifetime high, gaining 1.10% last week while consolidating within a defined range. Despite a bullish technical setup, the index shows signs of fatigue near the upper Bollinger band.  The coming week anticipates a steady start with a positive bias but a cautious undertone, with key resistance at 26,500 and supports at 26,000.",
            "pubDate": "2026-01-04T07:49:44.185251"
        },
        {
            "title": "Berkshire has best chance of lasting 100 years, says Warren Buffett as Greg Abel takes charge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-has-best-chance-of-lasting-100-years-says-warren-buffett-as-greg-abel-takes-charge/articleshow/126320278.cms",
            "description": "Warren Buffett has officially stepped down as CEO of Berkshire Hathaway. Greg Abel now leads the conglomerate. Buffett expressed strong confidence in Abel and Berkshire's enduring legacy. The company's shares saw a slight dip following the announcement. This marks a significant transition for the investment giant after Buffett's six-decade leadership.",
            "pubDate": "2026-01-04T07:49:44.185348"
        },
        {
            "title": "Axis top picks: 6 large cap stocks that can deliver returns of up to 34% in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-top-picks-6-large-cap-stocks-that-can-deliver-returns-of-up-to-34-in-2026/slideshow/126320129.cms",
            "description": "After a volatile 2025 marked by persistent foreign institutional investor selling, market sentiment has turned optimistic. Looking ahead to 2026, Axis Securities sees selective opportunities emerging within the large cap space. In a recent report, the brokerage has shortlisted six blue-chip stocks across multiple sectors that it believes offer attractive value and the potential to deliver returns of up to 34% over the next year. Here’s the full list.",
            "pubDate": "2026-01-04T07:49:44.185440"
        },
        {
            "title": "Goldman Sachs’ India portfolio slips, but four stocks rally 50–90% in CY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-india-portfolio-slips-but-four-stocks-rally-5090-in-cy25/slideshow/126320071.cms",
            "description": "Goldman Sachs’ Indian equity portfolio, held through its global funds, witnessed a sharp 27% decline in CY25, falling from Rs 12,407 crore in December 2024 to Rs 9,015 crore as of December 31, 2025. Despite the overall slump, four stocks in the portfolio bucked the trend, delivering gains of over 50% during the year. It is important to note that the December 2025 portfolio value is based on shareholding data from the September quarter, as December quarter data is expected to be released in the coming weeks.",
            "pubDate": "2026-01-04T07:49:44.185535"
        },
        {
            "title": "If not a fund manager, Siddhartha Bhaiya would have been a \"bean counter\". Ace investor's motto, key learnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/if-not-a-fund-manager-siddhartha-bhaiya-would-have-been-a-bean-counter-ace-investors-motto-key-learnings/articleshow/126319186.cms",
            "description": "Maverick fund manager Siddhartha Bhaiya, known for identifying small-cap multibaggers and drawing inspiration from Warren Buffett, passed away on December 31, 2025, due to cardiac arrest.  The 47-year-old, who once described the current market as a \"bubble of epic proportions,\" was a strong advocate for gold and value investing.",
            "pubDate": "2026-01-04T07:49:44.185626"
        },
        {
            "title": "Nifty may hit 29,500 by Q1 2027 on earnings rebound; Antique’s top picks include ICICI Bank and SBI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-may-hit-29500-by-q1-2027-on-earnings-rebound-antiques-top-picks-include-icici-bank-and-sbi/articleshow/126332695.cms",
            "description": "Antique Stock Broking expects an earnings-led recovery to drive Indian equities higher, with the Nifty targeting 29,500 by March 2027. The brokerage sees a profit upcycle in CY26, led by capital expenditure and financials, while remaining selective on consumption and midcaps. Stabilising FPI flows, improving earnings visibility and favourable macro conditions underpin its constructive outlook.",
            "pubDate": "2026-01-04T09:45:12.455983"
        },
        {
            "title": "Two Trades for Today: A pharma major for a 6.15% gain; a mid-cap power generating stock for an almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-pharma-major-for-a-6-15-gain-a-mid-cap-power-generating-stock-for-an-almost-7-rise/articleshow/126335719.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-04T14:18:05.636777"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/126335185.cms",
            "description": "Indian markets surged on Friday, marking the second trading day of the new year. The Nifty 50 reached an all-time high as a broad rally took hold. Strong corporate updates boosted investor sentiment across sectors. Global markets also started 2026 positively. Analysts remain constructive, focusing on Q3 earnings for near-term direction.",
            "pubDate": "2026-01-04T14:18:05.636903"
        },
        {
            "title": "Siemens Energy, Hitachi Energy among Antique’s eight midcap bets for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siemens-energy-hitachi-energy-among-antiques-eight-midcap-bets-for-2026/slideshow/126333888.cms",
            "description": "Antique Stock Broking expects midcap stocks to outperform large caps over the next two to three years, driven by stronger earnings growth and higher exposure to domestic cyclicals. The brokerage sees capital expenditure, defence manufacturing and financialisation as key tailwinds for the segment. Returns are expected to be driven by earnings recovery rather than valuation expansion. Here are Antique’s midcap stock picks for this period.",
            "pubDate": "2026-01-04T14:18:05.637021"
        },
        {
            "title": "Venezuela raid by US revives oil risk premium, Dalal Street braces for crude-led swings on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/venezuela-raid-by-us-revives-oil-risk-premium-dalal-street-braces-for-crude-led-swings-on-monday/articleshow/126335020.cms",
            "description": "The capture of Venezuelan President Maduro has reintroduced geopolitical risk into oil markets, impacting global crude prices. While immediate supply increases are unlikely, a US-led overhaul could eventually boost Venezuelan output, offering India a strategic alternative to Middle Eastern crude and potentially stabilizing prices.",
            "pubDate": "2026-01-04T14:18:05.637125"
        },
        {
            "title": "ICICI Bank, SBI among 10 largecap bets by Antique Broking for 2026 as it eyes an earnings rebound",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-sbi-among-10-largecap-bets-by-antique-broking-for-2026-as-it-eyes-an-earnings-rebound/slideshow/126333692.cms",
            "description": "Indian equities could be entering a decisive earnings-led phase in CY26, with Antique Stock Broking expecting a recovery in corporate profits and foreign portfolio investor flows after a weak 2025. The brokerage sees India’s “Goldilocks” phase continuing, supported by policy actions, easing macro headwinds, and a revival in capital expenditure, while preferring financials, capex-linked sectors, defence, and select discretionary stocks. Against this backdrop, here is the brokerage’s list of 10 large-cap stock picks for the period.",
            "pubDate": "2026-01-04T14:18:05.637227"
        },
        {
            "title": "Siddhartha Bhaiya’s global playbook: Top sectors in US, China and Europe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siddhartha-bhaiyas-global-playbook-top-sectors-in-us-china-and-europe/articleshow/126333557.cms",
            "description": "Veteran fund manager Siddhartha Bhaiya, who passed away after a cardiac arrest, was known for his contrarian investing style and multibagger small-cap bets. Citing rich valuations and market euphoria, he sharply reduced equity exposure and shifted heavily into gold ETFs. His disciplined, bottom-up approach delivered exceptional long-term returns and made his PMS the top performer in 2025.",
            "pubDate": "2026-01-04T14:18:05.637329"
        },
        {
            "title": "Two Trades for Today: A pharma major for a 6.15% gain; a mid-cap power generating stock for an almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-pharma-major-for-a-6-15-gain-a-mid-cap-power-generating-stock-for-an-almost-7-rise/articleshow/126335887.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-04T16:56:14.884198"
        }
    ]
}