{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-13T23:42:40.905420",
    "items": [
        {
            "title": "Nykaa shares rally 5% as brokerages turn more bullish post Q1 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-shares-rally-5-as-brokerages-turn-more-bullish-post-q1-results-should-you-buy-sell-or-hold/articleshow/123272555.cms",
            "description": "Nykaa shares rose 5.4% to Rs 215.95 after brokerages reaffirmed bullish views post-Q1 results. Net profit jumped 79% YoY to Rs 24 crore, revenue grew 23% to Rs 2,155 crore, and GMV climbed 26% to Rs 4,182 crore. Nuvama and JM Financial maintained Buy ratings, citing strong beauty growth, improving fashion performance, and margin expansion potential.",
            "pubDate": "2025-08-13T05:28:48.504095"
        },
        {
            "title": "KC Fed President Schmid urges caution, says tariffs don’t justify rate cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kc-fed-president-schmid-urges-caution-says-tariffs-dont-justify-rate-cuts/slideshow/123272495.cms",
            "description": "Kansas City Federal Reserve President Jeffrey Schmid said the muted impact of tariffs on inflation should not be taken as a reason to cut interest rates. Instead, he believes monetary policy is “appropriately calibrated” for current economic conditions and should remain modestly restrictive for now. (Source: Reuters)",
            "pubDate": "2025-08-13T05:28:48.504222"
        },
        {
            "title": "Honasa shares soar 13% on Q1 beat, Jefferies predicts stock can rally up to Rs 400",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-shares-soar-13-on-q1-beat-jefferies-predicts-stock-can-rally-up-to-rs-400/articleshow/123272121.cms",
            "description": "Honasa shares: Global brokerage Jefferies maintained a ‘Buy’ rating with a target price of ₹400, noting 7% YoY revenue growth in line with estimates. Gross margin contracted ~50 bps YoY, while A&P spending rose 3%. EBITDA margin slipped ~60 bps YoY to 7.7% (+2.6 ppt QoQ). EBITDA was flat YoY, but net profit saw slight growth, both exceeding expectations.",
            "pubDate": "2025-08-13T05:28:48.504331"
        },
        {
            "title": "BDL shares surge 3% after Q1 PAT soars 154% YoY. Should you buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bdl-shares-surge-3-after-q1-pat-soars-154-yoy-should-you-buy-now/articleshow/123272045.cms",
            "description": "Bharat Dynamics shares rose 3.2% to Rs 1,534 after Q1FY26 PAT surged 154% YoY to Rs 18.35 crore, driven by strong operational performance. Revenue climbed 23.07% to Rs 231.09 crore, while total income grew 23.29% to Rs 334.79 crore. Total expenses increased 19.72% to Rs 311.66 crore, reflecting higher costs but still delivering robust profit growth.",
            "pubDate": "2025-08-13T05:28:48.504433"
        },
        {
            "title": "US budget deficit soars 19% in July despite tariff boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-budget-deficit-soars-19-in-july-despite-tariff-boost/slideshow/123271980.cms",
            "description": "Treasury data shows that spending is growing faster than revenues, pushing the shortfall to record July levels. (Source: Reuters)",
            "pubDate": "2025-08-13T05:28:48.504536"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama maintains buy on Nykaa; cuts target price for Titagarh Rail Systems",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-maintains-buy-on-nykaa-cuts-target-price-for-titagarh-rail-systems/articleshow/123271549.cms",
            "description": "Nuvama reiterated ‘Buy’ ratings on Titagarh Rail Systems, Bharat Dynamics, and Nykaa, citing strong long-term prospects despite short-term challenges. It sees 15%–51% upside over the next year, driven by sectoral tailwinds, policy support, easing supply chain issues, and market share gains.",
            "pubDate": "2025-08-13T05:28:48.504639"
        },
        {
            "title": "Vodafone Idea’s 60% slump has more bearish undertones as analysts sound warning ahead of Q1 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-ideas-60-slump-has-more-bearish-undertones-as-analysts-sound-warning-ahead-of-q1-earnings/articleshow/123271405.cms",
            "description": "Vodafone Idea shares face scrutiny ahead of Q1 earnings, with analysts warning of potential downside due to a weak technical structure and bearish sentiment. Key support levels are identified at Rs 6.26 and Rs 5.72, while resistance is seen at Rs 6.87 and Rs 7.62.",
            "pubDate": "2025-08-13T05:28:48.504840"
        },
        {
            "title": "ONGC shares in focus after mixed Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-shares-in-focus-after-mixed-q1-results/articleshow/123271336.cms",
            "description": "ONGC shares: ONGC posted an 18.2% YoY rise in Q1FY26 consolidated net profit to ₹11,554.21 crore, even as revenue fell 3.2% to ₹1,63,108 crore. Standalone profit dropped 10.2% YoY to ₹8,024 crore but grew 24% QoQ, while standalone revenue slid 9.3% YoY to ₹32,003 crore. EBITDA declined 2% YoY to ₹18,657 crore.",
            "pubDate": "2025-08-13T05:28:48.504939"
        },
        {
            "title": "From Tata Motors to Adani: 141 companies see profits & sales decline in Q1. Is your portfolio at risk?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/141-companies-see-profits-sales-decline-in-q1-is-your-portfolio-at-risk/articleshow/123271286.cms",
            "description": "The June quarter earnings season disappointed investors, with many companies reporting simultaneous declines in sales and profit. Despite some sectors like cement and healthcare showing strength, large sectors including IT, financials, and auto experienced weak earnings growth. Experts remain cautiously optimistic, anticipating a recovery in the second half of FY26, driven by factors like rate cuts and a favorable monsoon.",
            "pubDate": "2025-08-13T05:28:48.505069"
        },
        {
            "title": "Waaree, Premier Energies shares tumble up to 4% after US launches solar cell dumping probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-premier-energies-shares-in-focus-after-us-launches-solar-cell-dumping-investigation/articleshow/123271229.cms",
            "description": "The US Department of Commerce has launched antidumping and subsidy probes into solar cells from India, Indonesia, and Laos, citing a 123% dumping margin on Indian exports. Preliminary findings are due September 2.",
            "pubDate": "2025-08-13T05:28:48.505183"
        },
        {
            "title": "Astral, Suzlon Energy among 7 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/astral-suzlon-energy-among-7-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/123271197.cms",
            "description": "As of August 12, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-08-13T05:28:48.505280"
        },
        {
            "title": "Sensex jumps over 200 pts, Nifty tops 24,550 on strong global cues; metal stocks rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-300-pts-nifty-tops-24550-on-strong-global-cues-metal-stock-rally/articleshow/123271032.cms",
            "description": "Indian benchmark indices Sensex and Nifty commenced trading on a positive note, reflecting the upward trend in Asian markets. This surge follows encouraging U.S. retail inflation data, fueling anticipation of a Federal Reserve rate cut in September. Easing domestic price pressures further bolstered investor confidence, contributing to the optimistic market sentiment.",
            "pubDate": "2025-08-13T05:28:48.505376"
        },
        {
            "title": "HAL shares jump 3% as brokerages predict up to Rs 6,000 target for stock despite 4% YoY dip in Q1 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-shares-in-focus-as-q1-profit-drops-nearly-4-yoy-despite-revenue-growth-should-you-invest/articleshow/123271058.cms",
            "description": "HAL shares: HAL reported a 3.7% YoY drop in Q1FY26 net profit to ₹1,383.77 crore despite a 10.8% revenue rise to ₹4,819.01 crore, driven by stronger execution and demand. Net profit fell 65.2% QoQ due to seasonal and project delivery factors. Net worth stood at ₹34,985.17 crore as of March 2025.",
            "pubDate": "2025-08-13T05:28:48.505472"
        },
        {
            "title": "Zota Health, Fortis Healthcare, and 2 other stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zota-health-fortis-healthcare-and-2-other-stocks-witness-5-year-swing-high-breakout/slideshow/123271004.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, four stocks witnessed a 5-year swing high at the close on August 12, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-08-13T05:28:48.505568"
        },
        {
            "title": "Sonata Software, Jindal Stainless among 8 stocks that rose above VWAP on August 12",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sonata-software-jindal-stainless-among-8-stocks-that-rose-above-vwap-on-august-12/slideshow/123270926.cms",
            "description": "On August 12, the closing prices of eight stocks in the Nifty 500 pack rallied by more than 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to Stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-13T05:28:48.505661"
        },
        {
            "title": "NMDC shares jump 2% after 23% YoY revenue growth, despite marginal PAT dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nmdc-shares-jump-2-after-23-yoy-revenue-growth-despite-marginal-pat-dip/articleshow/123274158.cms",
            "description": "NMDC shares experienced a rise of 2.5% following the announcement of robust first-quarter results for fiscal year 2026. Revenue saw a significant increase, driven by higher iron ore production and sales. While profit dipped slightly, operational performance was strong. The company holds substantial investments in various subsidiaries and joint ventures, both domestically and internationally.",
            "pubDate": "2025-08-13T07:27:03.186944"
        },
        {
            "title": "India now least favored Asian stock market: BofA survey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-now-least-favored-asian-stock-market-bofa-survey/articleshow/123273805.cms",
            "description": "India's stock market sentiment has sharply declined, shifting from being the most favored in Asia to the least preferred due to President Trump's tariff escalations. Fund managers are now underweight on Indian equities, influenced by trade tensions, weak earnings, and high valuations. This shift contrasts with increased enthusiasm for Chinese markets, leading to significant fund outflows from Indian shares.",
            "pubDate": "2025-08-13T07:27:03.187078"
        },
        {
            "title": "Stocks to Buy|Large- and midcap bias favoured in choppy markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-large-and-midcap-bias-favoured-in-choppy-markets/slideshow/123273773.cms",
            "description": "Siddharth Vora, in an interview with ET Now, said that Indian markets remain resilient in the long term, supported by strong domestic liquidity and record mutual fund SIP inflows, even as global factors like tariffs and FII selling weigh on sentiment.",
            "pubDate": "2025-08-13T07:27:03.187183"
        },
        {
            "title": "Apollo Hospitals Enterprise shares surge over 6% after Q1 net profit rises 42%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-hospitals-enterprise-shares-surge-over-6-after-q1-net-profit-rises-42/articleshow/123273590.cms",
            "description": "Apollo Hospitals Enterprise shares experienced a surge. This followed the company's strong Q1FY26 performance. The healthcare giant reported a significant increase in consolidated net profit. Revenue from operations also grew year-on-year. Positive earnings and revenue growth across business segments boosted investor confidence. The stock is exhibiting a bullish trend, trading above key Simple Moving Averages.",
            "pubDate": "2025-08-13T07:27:03.187329"
        },
        {
            "title": "Vikram Solar fixes Rs 315-332 price band for IPO. Check GMP, key dates, other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikram-solar-fixes-rs-315-332-price-band-for-ipo-check-gmp-key-dates-other-details/articleshow/123273503.cms",
            "description": "Vikram Solar IPO: Vikram Solar has set a price band of ₹315–₹322 for its ₹2,079.36 crore IPO opening on August 19, comprising a ₹1,500 crore fresh issue and ₹579.36 crore OFS. Minimum bid is 45 shares. The IPO is priced at a P/E of 68.48–72.17x FY25 EPS, higher than the peer average of 44.28x.",
            "pubDate": "2025-08-13T07:27:03.187437"
        },
        {
            "title": "RVNL shares slip 4% as Q1 profit plunges nearly 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-slip-4-as-q1-profit-plunges-nearly-40/articleshow/123273345.cms",
            "description": "RVNL shares fell after its Q1 profit dropped 40% year-on-year to Rs 134.36 crore, hit by lower revenue and weaker operations. The stock, down 24% in 2025, trades below key SMAs with RSI in oversold territory, signalling continued bearish momentum.",
            "pubDate": "2025-08-13T07:27:03.187538"
        },
        {
            "title": "Trump threatens ‘major lawsuit’ against Fed Chair Powell",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-threatens-major-lawsuit-against-fed-chair-powell/slideshow/123273168.cms",
            "description": "Former President Donald Trump said he may allow “a major lawsuit” against US Federal Reserve Chair Jerome Powell, criticising both Powell’s interest rate decisions and ongoing renovations at the Fed’s Washington headquarters. (Source: Reuters)",
            "pubDate": "2025-08-13T07:27:03.187633"
        },
        {
            "title": "Profit-taking driving shift from high-value to value picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/profit-taking-driving-shift-from-high-value-to-value-picks/slideshow/123276126.cms",
            "description": "Deven Choksey in an interview to ET Now said that the market is in a topsy-turvy phase, moving up one day and down the next. Earnings reports are triggering sharp reactions, with some stocks getting hammered while others see renewed buying interest. This constant back-and-forth is shaping the current sentiment.",
            "pubDate": "2025-08-13T09:48:22.665632"
        },
        {
            "title": "European shares rise on Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-on-fed-rate-cut-hopes/articleshow/123275659.cms",
            "description": "European shares advanced on Wednesday, with technology and defence stocks leading gains, as global mood remained buoyant after tame U.S. inflation data cemented expectations of interest rate cuts by the Federal Reserve.",
            "pubDate": "2025-08-13T09:48:22.665857"
        },
        {
            "title": "Suzlon Energy's share price target goes up to Rs 80. Should you buy after today’s dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energys-share-price-target-goes-up-to-rs-80-should-you-buy-after-todays-dip/articleshow/123275626.cms",
            "description": "Suzlon Energy shares slipped over 4% in Wednesday’s trade, but brokerages remain largely bullish, lifting price target to as high as Rs 80 on the back of record first-quarter deliveries, robust order inflows, and a strong domestic demand outlook.",
            "pubDate": "2025-08-13T09:48:22.665960"
        },
        {
            "title": "Nifty and business are different species: 5 small-cap stocks from different sectors with upside potential of up to 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-and-business-are-different-species-5-small-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-30/articleshow/123275307.cms",
            "description": "For anyone who believed the stock market only goes up in linear fashion, the last 11 months of correction must have been educational. In fact, it would have been even more so in the case of small caps, which do have a higher element of risk. So, how does one reduce the risk of going wrong while selecting small-cap stocks? By doing a bit of hard work, just a bit. If you take care of a few small points before investing, it will go a long way in ensuring that you get that extra return for the extra risk taken. Adhering to these basic points will probably lead to better decision-making while buying. And they will also ensure you do not panic.",
            "pubDate": "2025-08-13T09:48:22.666062"
        },
        {
            "title": "11 stocks held by over 100 MFs in July surge up to 80% in just 4 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-stocks-held-by-over-100-mfs-in-july-surge-up-to-80-in-just-4-months/slideshow/123275341.cms",
            "description": "When multiple mutual fund (MF) schemes hold a particular stock, it often boosts investor confidence. As of July '25, 225 stocks were identified as being held by over 100 mutual fund schemes. According to the latest analysis by ETMarkets, 28 of these stocks have recorded share price gains of over 25% in the ongoing fiscal year (FY26). Among them, we have highlighted 11 standout stocks that have delivered impressive returns of 40–80% so far in FY26. (Data Source: ACE MF, ACE Equity)",
            "pubDate": "2025-08-13T09:48:22.666160"
        },
        {
            "title": "Market Wrap: Indian stocks rise on Fed rate cut hopes, cooling domestic inflation; Sensex gains 304 points, Nifty tops 24,600",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-indian-stocks-rise-on-fed-rate-cut-hopes-cooling-domestic-inflation-sensex-gains-304-points-nifty-tops-24600/articleshow/123278686.cms",
            "description": "Stock Market Highlights: India’s benchmark indexes closed in the green on Wednesday, led by gains in auto and financial stocks, as softer U.S. retail inflation bolstered bets on a Federal Reserve rate cut in September and signs of easing domestic price pressures lifted investor sentiment.",
            "pubDate": "2025-08-13T11:08:25.594461"
        },
        {
            "title": "S&P 500, Nasdaq hit record highs on September rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-hit-record-highs-at-open-on-september-rate-cut-hopes/articleshow/123282599.cms",
            "description": "Wall Street surged on Wednesday, with the S&P 500 and Nasdaq reaching unprecedented highs. Optimism is growing that the Federal Reserve might initiate monetary policy easing as early as next month. The Dow Jones Industrial Average also saw gains, reflecting a broad market upswing fueled by anticipation of a more accommodative monetary policy.",
            "pubDate": "2025-08-13T14:21:22.276436"
        },
        {
            "title": "From IPO highs to earnings lows & how India is reworking oil imports under US pressure | Two Sharp",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-ipo-highs-to-earnings-lows-how-india-is-reworking-oil-imports-under-us-pressure-two-sharp/videoshow/123282366.cms",
            "description": "On Two Sharp with ET, Nisha Poddar tracks India’s record ₹14.6 lakh crore fundraising in FY25 and why slowing earnings are making global investors cautious. Plus, how fading Russian oil discounts and US tariff heat are driving India back to West Asian suppliers, reshaping the nation’s crude mix.",
            "pubDate": "2025-08-13T14:21:22.276574"
        },
        {
            "title": "Max Healthcare, M&M among 8 large-caps posting over 20% sales growth in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/max-healthcare-mampm-among-8-large-caps-posting-over-20-sales-growth-in-q1/slideshow/123280435.cms",
            "description": "",
            "pubDate": "2025-08-13T14:21:22.276689"
        },
        {
            "title": "Wealth creation: Look beyond the obvious in some things; 10 fertilizer sector companies worth watching",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-creation-look-beyond-the-obvious-in-some-things-10-fertilizer-sector-companies-worth-watching/articleshow/123280364.cms",
            "description": "The fertilizer sector is, of course, a key sector for India. Not only because it impacts the lives of a large number of farmers, but also for two more reasons. One, because India imports a lot of fertilizers. And two, it is critical for food production and hence food inflation. So, a very important sector from all perspectives. So, why are we talking of a sector that has been underperforming for a while now? Because of a stray bit of news emerging out of China.",
            "pubDate": "2025-08-13T14:21:22.276793"
        },
        {
            "title": "Small-cap winners: 12 stocks soar up to 162%, see high YoY profit & sales growth in June quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/small-cap-winners-12-stocks-soar-up-to-162-see-high-yoy-profit-sales-growth-in-june-quarter/articleshow/123280310.cms",
            "description": "In Q1 FY26, 91 small-cap companies posted over 25% YoY growth in sales and profits. Twelve delivered 80–160% returns, with Paradeep Phosphates, Ravindra Energy, and Sarda Energy emerging as standout multibaggers.",
            "pubDate": "2025-08-13T14:21:22.276922"
        },
        {
            "title": "​Stock Radar: Why is this 2-wheeler stock worth looking at after 26% fall from highs; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-why-is-this-2-wheeler-stock-worth-looking-at-after-26-fall-from-highs-check-target-stop-loss/articleshow/123259942.cms",
            "description": "Hero MotoCorp stock is showing positive signs. It bounced back after testing its 200-DMA. Experts suggest buying the stock with a target of Rs 4,950–5,000 in 1–3 months. The stock formed a Golden Cross, a bullish indicator. Improving earnings and strategic initiatives suggest a potential shift into top gear for the two-wheeler manufacturer. This ride may just be getting started.",
            "pubDate": "2025-08-13T14:21:22.277034"
        },
        {
            "title": "Paytm, Apollo Hospitals, TVS Motor among 10 stocks that hit 52-week high; rally up to 35% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-apollo-hospitals-tvs-motor-among-10-stocks-that-hit-52-week-high-rally-up-to-35-in-a-month/slideshow/123280130.cms",
            "description": "On Wednesday, the benchmark Sensex climbed by around 304 points to close at 80,539. Riding the wave of a broader market rally, 10 stocks from the BSE 500 index touched their 52-week highs, hitting their highest levels in the past year. Such breakouts are often seen by traders and investors as bullish indicators, signaling strong upward momentum and the potential for continued gains.",
            "pubDate": "2025-08-13T14:21:22.277148"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/123284303.cms",
            "description": "Indian markets closed higher on Wednesday, driven by auto and financial gains, as softer US inflation and easing domestic prices boosted Fed rate cut hopes and investor sentiment.",
            "pubDate": "2025-08-13T16:15:21.510367"
        },
        {
            "title": "Two Trades for Today: A pharma stock for a 5.75% gain, a large-cap commercial vehicle maker for almost 7% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-pharma-stock-for-a-5-75-gain-a-large-cap-commercial-vehicle-maker-for-almost-7-upmove/articleshow/123284046.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-08-13T16:15:21.510496"
        },
        {
            "title": "Market Trading Guide: Buy Eternal, TVS Motor and 3 more stocks on Thursday. Up to 16% near term upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-eternal-tvs-motor-and-3-more-stocks-on-thursday-up-to-16-near-term-upside-seen/slideshow/123283494.cms",
            "description": "India’s headline indices ended Wednesday with solid gains amid strong buying action in auto and pharma stocks. Nifty ended 131 points up at 24,619.35. Nifty remained strong through the day signaling improved sentiment amid tariff-related concerns. Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said that the likelihood of the Nifty moving above the 24,700 resistance has increased given the sentiments showing signs of improvement. \"The daily RSI has recently entered a positive crossover and continues to hold this momentum after several days of indecision. A decisive move above this level could trigger a rally towards 25,200 in the short term. On the lower side, support is placed at 24,337, below which the dynamics would once again turn in favor of the bears,\" De said.Here are 5 stock recommendations for Thursday:",
            "pubDate": "2025-08-13T16:15:21.510614"
        },
        {
            "title": "Sebi permits use of mutual funds for IAs, RAs deposit compliance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-permits-use-of-mutual-funds-for-ias-ras-deposit-compliance/articleshow/123284024.cms",
            "description": "Sebi has allowed investment advisers and research analysts to use liquid mutual funds and overnight mutual funds for meeting their mandatory deposit requirements, providing an alternative to scheduled bank deposits.",
            "pubDate": "2025-08-13T16:15:21.510728"
        },
        {
            "title": "Multibagger or IBC - Part 19: Steel is Stability. Alloy is the Alpha. This auto ancillary blends both",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-part-19-steel-is-stability-alloy-is-the-alpha-this-auto-ancillary-blends-both/articleshow/123284599.cms",
            "description": "This auto ancillary company is executing a two-pronged strategy: Go deeper into core components and diversify into adjacent categories. Domestic revenues come entirely from OEMs, while exports have nearly doubled in a year to over Rs. 560 crore. The US and Europe account for 96% of overseas shipments. Its rising share of premium-grade components has boosted profitability metrics across the board, and content per vehicle has tripled. Its dominant position in the EV 2-wheeler segment and strategic partnerships with steel majors position it well for the transition. This series on auto ancillary companies works with the assumption that, from the whole set of auto ancillary companies, some multibagger stocks will emerge. And some companies in this space risk going bankrupt.",
            "pubDate": "2025-08-13T17:57:30.069001"
        },
        {
            "title": "Stock Radar: JSPL forms Ascending Triangle pattern on weekly charts, could hit fresh 52-week high soon",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-jspl-forms-ascending-triangle-pattern-on-weekly-charts-could-hit-fresh-52-week-high-soon/articleshow/123277761.cms",
            "description": "Jindal Steel & Power Ltd. exhibits a bullish ascending triangle pattern on weekly charts, signaling potential upward momentum. Experts suggest that a breakout above Rs 1,000 could propel the stock towards Rs 1,090 in the coming weeks. Technical indicators and positive divergences support this outlook, advising traders to consider accumulating the stock with a stop loss at Rs 940.",
            "pubDate": "2025-08-13T23:42:40.325670"
        }
    ]
}