{
    "title": "RSS Feed",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-03T17:24:22.041086",
    "items": [
        {
            "title": "How will Sebi's new intraday limits impact equity index derivatives?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-sebis-new-intraday-limits-impact-equity-index-derivatives/articleshow/123667026.cms",
            "description": "Sebi is tightening intraday position limits in equity index derivatives starting October 1, aiming to curb volatility and potential market manipulation, especially on expiry days. The new framework sets a ₹5,000 crore intraday net futures-equivalent position limit in index options, down from the existing ₹1,500 crore end-of-day cap.",
            "pubDate": "2025-09-03T00:55:26.613648"
        },
        {
            "title": "Jane Street's $10.1-biilion trading haul sets Wall Street record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-streets-10-1-biilion-trading-haul-sets-wall-street-record/articleshow/123666969.cms",
            "description": "Jane Street Group achieved a record-breaking $10.1 billion in net trading revenue during the second quarter, surpassing major Wall Street banks. This surge, more than double the previous year's figure, propelled their first-half trading revenue to an unprecedented $17.3 billion. The firm benefited significantly from the market volatility spurred by President Trump's tariffs and subsequent investor repositioning.",
            "pubDate": "2025-09-03T00:55:26.613813"
        },
        {
            "title": "Sugar stocks soar up to 20% as govt lifts ethanol curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sugar-stocks-soar-up-to-20-as-govt-lifts-ethanol-curbs/articleshow/123666936.cms",
            "description": "Sugar stocks witnessed a surge following the central government's decision to remove restrictions on ethanol production from sugarcane. This move has boosted investor confidence in sugar companies. Analysts anticipate improved profitability and a potential rise in ethanol prices. The Supreme Court's stance on ethanol-blended petrol further supports the demand for ethanol. Rajshree Sugars and Shree Renuka Sugars experienced significant gains.",
            "pubDate": "2025-09-03T00:55:26.614030"
        },
        {
            "title": "Stock Radar: Short-term traders look to buy Hindalco stock on dips; 20-DEMA acts as a support",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-short-term-traders-look-to-buy-hindalco-stock-on-dips-20-dema-acts-as-a-support/articleshow/123653756.cms",
            "description": "Hindalco Industries, after breaking a key resistance in August 2025, is showing bullish signs. Despite a previous dip from an October 2024 high, the stock has been trending upwards since April 2025. Experts suggest short-term traders consider buying on dips, targeting Rs 750 in the coming weeks.",
            "pubDate": "2025-09-03T00:55:26.614135"
        },
        {
            "title": "Yes Bank shares in focus following CCI’s approval for SMBC stake acquisition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-following-ccis-approval-for-smbc-stake-acquisition/articleshow/123668532.cms",
            "description": "Yes Bank’s shares are in focus following the Competition Commission of India’s approval of Sumitomo Mitsui Banking Corporation’s (SMBC) stake acquisition via secondary purchase from SBI and seven other banks. This regulatory nod is a key step, though completion depends on customary closing conditions. Yes Bank shares closed flat at Rs 19.56 on Tuesday.",
            "pubDate": "2025-09-03T03:54:06.166682"
        },
        {
            "title": "Dividend stocks: 60 stocks including ONGC, OIL go ex-dividend tomorrow – last chance to buy!",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-stocks-60-stocks-including-ongc-oil-go-ex-dividend-tomorrow-last-chance-to-buy/articleshow/123668510.cms",
            "description": "Investors aiming for dividend payouts from PSUs should note today's deadline. Buying shares of Oil India Limited, NTPC, and ONGC today ensures eligibility for final dividends. These stocks will trade ex-dividend tomorrow, September 4, 2025. Several other companies, including A-1 Limited and AIA Engineering Limited, have also declared dividends with the same record date.",
            "pubDate": "2025-09-03T03:54:06.166861"
        },
        {
            "title": "NTPC among 5 Nifty stocks showing RSI Trending Up on September 2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-among-5-nifty-stocks-showing-rsi-trending-up-on-september-2/slideshow/123668434.cms",
            "description": "On September 2, five stocks in the Nifty50 pack appeared in the RSI Trending Up scan, based on data from StockEdge.com. An upward trend is signaled when the RSI (Relative Strength Index) crosses above 50 from below. \"RSI trending up\" indicates that RSI values are rising, suggesting strengthening momentum in a stock's price. This is often interpreted as a potential sign of upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-03T03:54:06.166981"
        },
        {
            "title": "Eternal shares in focus as Zomato hikes platform fee to Rs 12 amid festive demand surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-in-focus-as-zomato-hikes-platform-fee-to-rs-12-amid-festive-demand-surge/articleshow/123668469.cms",
            "description": "Zomato's parent company, Eternal, is in focus as the food delivery platform has increased its platform fee to ₹12 before the festive season, following a similar move by Swiggy. Both companies are investing heavily in quick commerce. Zomato reported a profit decline but revenue growth, while Swiggy's losses doubled due to Instamart investments.",
            "pubDate": "2025-09-03T03:54:06.167089"
        },
        {
            "title": "Reliance Power, Aster DM among 6 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-aster-dm-among-6-stocks-closed-crossing-above-vwap/slideshow/123668260.cms",
            "description": "On September 2, the closing prices of six stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price). A shift above the VWAP suggests a potential bullish trend, according to technical scan data from StockEdge.com.When the closing price rises above the VWAP, it indicates that the stock closed higher than the average price at which it was traded throughout the day, with the average weighted by trading volume. This is often interpreted by traders and investors as a bullish signal, potentially reflecting positive market sentiment.",
            "pubDate": "2025-09-03T03:54:06.167189"
        },
        {
            "title": "At multi-year highs: Eicher Motors, MRF among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-eicher-motors-mrf-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/123667991.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, six stocks witnessed a 5-year swing high at the close on September 2, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-03T03:54:06.167290"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Suzlon, Inox Wind among 5 stocks that could give 12-36% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-suzlon-inox-wind-among-5-stocks-that-could-give-12-36-return/slideshow/123667876.cms",
            "description": "Brokerages remain upbeat on select stocks across renewables, infrastructure, and real estate, projecting healthy upsides in the near to medium term.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-03T03:54:06.167393"
        },
        {
            "title": "Current Infraprojects IPO lists today. GMP hints at strong debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/current-infraprojects-ipo-lists-today-gmp-hints-at-strong-debut/articleshow/123667668.cms",
            "description": "Current Infraprojects is set to debut on the NSE SME after a highly successful IPO, oversubscribed by 379 times. The IPO, priced at ₹80 per share, saw significant interest from retail, NII, and QIB investors.",
            "pubDate": "2025-09-03T03:54:06.167488"
        },
        {
            "title": "Sattva Engineering shares to debut today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sattva-engineering-shares-to-debut-today-check-gmp-ahead-of-debut/articleshow/123667640.cms",
            "description": "Chennai's Sattva Engineering Construction is set for its SME debut today, following a highly successful IPO that was oversubscribed 198 times. The Rs 35.38 crore IPO, priced at Rs 75 per share, saw significant interest across all investor categories, particularly from non-institutional investors.",
            "pubDate": "2025-09-03T03:54:06.167585"
        },
        {
            "title": "Positive Breakout: These 8 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/123667590.cms",
            "description": "In the Nifty200 pack, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on September 2,2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-03T03:54:06.167678"
        },
        {
            "title": "Wall Street ends lower as ruling on Trump tariffs raises concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-as-ruling-on-trump-tariffs-raises-concerns/articleshow/123667476.cms",
            "description": "Wall Street experienced a downturn on Tuesday, influenced by uncertainty surrounding President Trump's tariffs after a court ruling deemed them largely illegal. Investors are also anticipating the upcoming U.S. payrolls report amidst concerns of weak job growth. The Dow, S&P 500, and Nasdaq all declined. While real estate suffered, PepsiCo saw gains due to activist investor interest.",
            "pubDate": "2025-09-03T03:54:06.167794"
        },
        {
            "title": "GIFT Nifty down 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123667199.cms",
            "description": "Equities experienced a slight downturn on Tuesday, reversing earlier gains driven by positive macro data due to profit booking. Investors are keenly awaiting the GST Council meeting. Technically, the daily RSI indicates a bearish trend, with support at 24,500 and resistance at 24,700. The rupee weakened to a record low of 88.15 against the US dollar.",
            "pubDate": "2025-09-03T03:54:06.167984"
        },
        {
            "title": "Stocks in news: Vikran Engineering, Indus Towers, Waaree Energies, TCS, YES Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vikran-engineering-indus-towers-waaree-energies-tcs-yes-bank/articleshow/123667179.cms",
            "description": "Domestic equities closed lower despite positive macro data, influenced by caution ahead of the GST Council meeting. Several companies are in focus, including Vikran Engineering and Anlon Healthcare, debuting on the exchanges. Indus Towers plans expansion in African markets, while Waaree Energies will acquire a 64% stake in Kotson.",
            "pubDate": "2025-09-03T03:54:06.168079"
        },
        {
            "title": "Treasuries stabilize after debt-sale jitters and budget concerns rattle markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/treasuries-stabilize-after-debt-sale-jitters-and-budget-concerns-rattle-markets/articleshow/123667141.cms",
            "description": "Treasuries stabilized in Asian trading following corporate-debt sales and budget worries that impacted bonds and stocks. US 30-year bond yields remained near 5%, affecting tech shares, while Japan's ultra-long bonds also declined. Investors are navigating economic data, tariffs, Fed policy, and fiscal outlooks as the S&P 500 experiences minimal gains.",
            "pubDate": "2025-09-03T03:54:06.168169"
        },
        {
            "title": "Can Smartworks maintain its growth momentum after a 29% surge since IPO?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-smartworks-maintain-its-growth-momentum-after-a-29-surge-since-ipo/articleshow/123667106.cms",
            "description": "Smartworks Coworking Spaces has shown strong performance since its IPO, gaining 29%, driven by robust June quarter results. With 1.1 million sq ft of space to be handed over soon, the company anticipates margin growth in the second half of FY26. They are targeting 30% revenue growth in FY26, leveraging an expanding operational footprint and long-term client relationships.",
            "pubDate": "2025-09-03T03:54:06.168260"
        },
        {
            "title": "Amanta Healthcare IPO subscribed 23 times on Day 3 so far; GMP at 8%. Should you bid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amanta-healthcare-ipo-subscribed-23-times-on-day-3-so-far-gmp-at-8-should-you-bid/articleshow/123670365.cms",
            "description": "Amanta Healthcare’s Rs 126 crore IPO was subscribed 23.04 times, driven by NIIs and RIIs. Trading at an 8% GMP, the stock may list around Rs 136. The company’s sterile liquid pharmaceuticals focus and global certifications position it for strong growth.",
            "pubDate": "2025-09-03T05:50:32.165967"
        },
        {
            "title": "GST rate cut: What's in store for 36 lakh ITC shareholders? Jefferies analysts decode",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-rate-cut-whats-in-store-for-36-lakh-itc-shareholders-jefferies-analysts-decode/articleshow/123670223.cms",
            "description": "ITC shares have delivered no returns in two years amid GST, BAT stake sale, and Marlboro concerns. Jefferies expects revenue-neutral GST changes, which could ease investor worries and support steady cigarette industry growth.",
            "pubDate": "2025-09-03T05:50:32.166088"
        },
        {
            "title": "From tariffs to tech: US listings regain momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-tariffs-to-tech-us-listings-regain-momentum/slideshow/123670118.cms",
            "description": "A slew of companies across sectors launched U.S. IPO roadshows on Tuesday, marking the start of the fall window for new listings.",
            "pubDate": "2025-09-03T05:50:32.166198"
        },
        {
            "title": "TBO Tek shares surge 12% after $125 million Classic Vacations acquisition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tbo-tek-shares-surge-12-after-125-million-classic-vacations-acquisition/articleshow/123670188.cms",
            "description": "TBO Tek shares jumped 11.61% to Rs 1,541.30 on NSE after announcing the acquisition of US-based Classic Vacations for up to $125 million. This strategic move will boost TBO Tek’s global footprint in the luxury travel market, combining advanced technology with Classic Vacations’ established luxury travel network and five decades of industry experience.",
            "pubDate": "2025-09-03T05:50:32.166296"
        },
        {
            "title": "Indus Towers shares drop 5% to 52-week low amid investor concerns over Africa entry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indus-towers-shares-drop-5-to-52-week-low-amid-investor-concerns-over-africa-entry/articleshow/123670148.cms",
            "description": "Indus Towers shares fell 5% to a 52-week low after the board approved a strategic international expansion into Nigeria, Uganda, and Zambia. While the move aligns with the government’s push for global growth, investors appeared cautious due to risks like regulatory hurdles, geopolitical instability, and cost pressures. The plan leverages Indus’s ties with Bharti Airtel in African markets.",
            "pubDate": "2025-09-03T05:50:32.166393"
        },
        {
            "title": "Anlon Healthcare shares make a muted D-Street debut, shares list at 1% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anlon-healthcare-shares-make-a-muted-d-street-debut-shares-list-at-1-premium-over-ipo-price/articleshow/123669700.cms",
            "description": "Anlon Healthcare shares had a muted debut, listing slightly above its IPO price after a nearly 7x subscription. The company plans to use the Rs 121 crore raised for expansion and debt reduction. Despite a limited operating history and regulatory risks, Anlon's strong financial growth, expanding product portfolio, and regulatory approvals make it a compelling long-term investment.",
            "pubDate": "2025-09-03T05:50:32.166488"
        },
        {
            "title": "Vikas Khemani sees broad-based rally to fuel markets; bets on financials, pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikas-khemani-sees-broad-based-rally-to-fuel-markets-bets-on-financials-pharma/articleshow/123669632.cms",
            "description": "Vikas Khemani expects a broad-based market rally, with financials, pharma, and manufacturing leading the charge. He sees large-caps offering stability while mid- and small-caps could outperform once sentiment improves, noting that short-covering and renewed buying may follow if tariff issues ease in the coming months.",
            "pubDate": "2025-09-03T05:50:32.168653"
        },
        {
            "title": "Japan’s reflation trade: Foreign firepower, domestic caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-reflation-trade-foreign-firepower-domestic-caution/slideshow/123669585.cms",
            "description": "Foreign buyers have been the main drivers of Japanese equities, lifting the Topix 34.2% from its April lows. The rally has coincided with yen appreciation, yet Japanese retail investors remain largely absent from the momentum.",
            "pubDate": "2025-09-03T05:50:32.168771"
        },
        {
            "title": "Zerodha hit by technical glitch, users face login & price update issues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-hit-by-technical-glitch-users-face-login-price-update-issues/articleshow/123669430.cms",
            "description": "Zerodha Down News: India's leading retail brokerage, experienced a technical glitch on Wednesday morning, causing price updates to freeze on its app. Users flocked to social media to report the issue, though order placement remained unaffected. Zerodha advised clients to use the Kite web platform as a temporary workaround.",
            "pubDate": "2025-09-03T05:50:32.168871"
        },
        {
            "title": "Ashish Kacholia-invested Vikran Engineering shares list at 3% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-invested-vikran-engineering-shares-list-at-3-premium-over-ipo-price/articleshow/123669125.cms",
            "description": "Vikran Engineering made its stock market debut on Wednesday after receiving strong interest for its Rs 772 crore IPO, which was subscribed nearly 25 times. The stock listed at a modest premium - Rs 99.70 on BSE and Rs 99.00 on NSE - against the issue price of Rs 97. The IPO was backed by noted investors Ashish Kacholia and Mukul Agarwal.",
            "pubDate": "2025-09-03T05:50:32.168968"
        },
        {
            "title": "Sugar stocks trap investors in ethanol hype time & again. Is this rally a multi-year opportunity?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sugar-stocks-trap-investors-in-ethanol-hype-time-again-is-this-rally-a-multi-year-opportunity/articleshow/123669302.cms",
            "description": "Sugar stocks are rallying due to government ethanol production decisions. Investors are hopeful, but past rallies have not always yielded long-term gains. Good monsoons and ethanol-blended petrol are positive factors. Analysts have mixed opinions on the sector's long-term sustainability. Ethanol prices and cane supply are key factors to watch. Some companies are better positioned to benefit.",
            "pubDate": "2025-09-03T05:50:32.169063"
        },
        {
            "title": "Waaree Energies shares in focus on Rs 192 crore acquisition of 64% stake in Kotson’s Pvt Ltd",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-in-focus-on-rs-192-crore-acquisition-of-64-stake-in-kotsons-pvt-ltd/articleshow/123669214.cms",
            "description": "Waaree Energies is set to acquire a 64% stake in Kotson’s Private Limited for ₹192 crore, aiming to bolster its position in the power value chain. The acquisition, expected to close by September 30, will grant Waaree Energies greater control over supply and product quality. Additionally, Waaree Energies will acquire 100% shareholding in Impactgrid Renewables for ₹1 lakh.",
            "pubDate": "2025-09-03T05:50:32.169250"
        },
        {
            "title": "Bajaj Finance among Axis Securities’ top 15 stock picks with upside potential of up to 29%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-among-axis-securities-top-15-stock-picks-with-upside-potential-of-up-to-29/slideshow/123669159.cms",
            "description": "Indian equity markets have navigated a volatile landscape over the past few months, with mixed performances across sectors, market caps, and styles. Despite the fluctuations, select high-conviction baskets have outperformed. Axis Securities’ Top Picks Basket delivered a 16.2% return in the last six months, outpacing the 10.4% gain by the Nifty 50, and delivering a flat MoM return in August, still ahead of the Nifty’s 1.4% decline. Since its inception in May 2020, this basket has generated a remarkable 324% return, significantly higher than the Nifty 50’s 164% over the same period.With optimism building around festive demand and a likely earnings upgrade cycle in the second half, Axis Securities has revealed its Top Picks across large, mid, and small cap segments—well-positioned to benefit from India’s resilient growth outlook for a horizon of next one year:",
            "pubDate": "2025-09-03T05:50:32.169344"
        },
        {
            "title": "Premier Energies, Ola Electric, UPL among 6 stocks crossing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-ola-electric-upl-among-6-stocks-crossing-below-vwap/slideshow/123669051.cms",
            "description": "On September 2, the closing prices of seven stocks from the Nifty200 index dropped over 1% relative to their VWAP (Volume Weighted Average Price). A shift below the VWAP suggests a potential bearish trend, according to technical scan data from StockEdge.com.When the closing price falls below the VWAP, it indicates that the stock closed lower than the average price at which it was traded during the day, with the average weighted by trading volume. This is often interpreted as a sign of increased selling pressure.",
            "pubDate": "2025-09-03T05:50:32.169437"
        },
        {
            "title": "Sensex slips 100 pts, Nifty below 24,600 as banks & IT weigh ahead of GST meet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-100-pts-nifty-below-24600-as-banks-it-weigh-ahead-of-gst-meet/articleshow/123668849.cms",
            "description": "Indian benchmark indices Sensex and Nifty experienced a decline on Wednesday, primarily influenced by the downturn in banking and IT sectors. Investors exhibited caution in anticipation of the GST council meeting, where potential rate cuts on various goods are expected. The S&P BSE Sensex fell by 0.16%, while the NSE Nifty 50 also dropped by 0.16%.",
            "pubDate": "2025-09-03T05:50:32.169529"
        },
        {
            "title": "CG Power shares zoom 14% in 4 days; here’s what’s driving the rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cg-power-shares-zoom-14-in-4-days-heres-whats-driving-the-rally/articleshow/123671250.cms",
            "description": "CG Power shares have increased following the launch of India's first OSAT facility in Sanand, Gujarat. CG Semi, a subsidiary, launched the facility. Morgan Stanley initiated coverage with an 'Overweight' rating. The company is investing significantly in two facilities. These facilities are expected to create jobs.",
            "pubDate": "2025-09-03T06:46:01.547286"
        },
        {
            "title": "Geopolitical risks make selective investing crucial, warns Nilesh Shetty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/geopolitical-risks-make-selective-investing-crucial-warns-nilesh-shetty/slideshow/123671179.cms",
            "description": "Nilesh Shetty in an interview to ET Now said that India’s GDP growth surprised on the upside and festive demand is expected to add momentum. Yet, global risks and valuations will determine investor strategies ahead of GST announcements.",
            "pubDate": "2025-09-03T06:46:01.547405"
        },
        {
            "title": "Markets pin hopes on GST meet as cyclical revival gains traction: Varun Goel",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-pin-hopes-on-gst-meet-as-cyclical-revival-gains-traction-varun-goel/articleshow/123670737.cms",
            "description": "As the GST Council convenes, investors anticipate announcements that could influence market sentiment. Expert Varun Goel predicts FY26 as a potential turning point for India's GDP growth, fueled by monetary easing and tax cuts, benefiting consumption and capex. Corporate earnings are expected to rise significantly, particularly in auto, consumer durables, and staples sectors.",
            "pubDate": "2025-09-03T06:46:01.547516"
        },
        {
            "title": "Gold’s record run: can central banks keep the rally alive?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/golds-record-run-can-central-banks-keep-the-rally-alive/slideshow/123670659.cms",
            "description": "Gold prices climbed to a historic $3,532 per troy ounce, marking a 90% surge since late 2022. The rally has been fuelled by strong central bank buying, robust investment flows, and heightened global uncertainty. (Source: Reuters)",
            "pubDate": "2025-09-03T06:46:01.547638"
        },
        {
            "title": "Promoters selling, retail investors buying. Who's right? Raamdeo Agrawal answers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/promoters-selling-retail-investors-buying-whos-right-raamdeo-agrawal-answers/articleshow/123672003.cms",
            "description": "Despite Indian promoters offloading record shares, retail investors remain bullish, says Raamdeo Agrawal. Promoter shareholding fell to an eight-year low, while domestic institutional investors' share rose to a record high, surpassing foreign investors. Agrawal likens the market to expensive Mumbai property, advising investors to accept slightly higher prices for long-term growth.",
            "pubDate": "2025-09-03T07:10:37.048457"
        },
        {
            "title": "Focus on value as GST, festive season and global risks shape markets; selective opportunities in logistics, pharma: Nilesh Shetty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/focus-on-value-as-gst-festive-season-and-global-risks-shape-markets-selective-opportunities-in-logistics-pharma-nilesh-shetty/articleshow/123671847.cms",
            "description": "India’s GDP growth and festive demand boost optimism, but Nilesh Shetty warns that valuations and global risks demand caution. He favours financials, IT, pharma, and logistics while trimming autos. Capital goods and staples look overpriced, while gold and silver remain secondary. Selectivity and long-term focus are key.",
            "pubDate": "2025-09-03T07:10:37.048582"
        },
        {
            "title": "GST uncertainty weighs on auto stocks; 10 counters to benefit from rate changes: Sunny Agrawal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-uncertainty-weighs-on-auto-stocks-10-counters-to-benefit-from-rate-changes-sunny-agrawal/articleshow/123671749.cms",
            "description": "Auto stocks slipped as investors await clarity on GST hike for luxury cars and EVs. Analysts say the impact hinges on whether the higher tax applies to vehicles above Rs 20 lakh or Rs 40 lakh, with M&M largely shielded if the latter prevails.",
            "pubDate": "2025-09-03T07:10:37.048806"
        },
        {
            "title": "JM Financial turns bullish on consumption, bearish on banks & infra. Check portfolio details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-turns-bullish-on-consumption-bearish-on-banks-infra-check-portfolio-details-here/articleshow/123674346.cms",
            "description": "JM Financial has rebalanced its model portfolio, turning bullish on consumption sectors like autos, consumer, cement, internet, hotels, and real estate, while cutting exposure to banks, NBFCs, insurance, infrastructure, ports, and defence, citing fiscal constraints and weak credit growth as key concerns.",
            "pubDate": "2025-09-03T09:49:21.951308"
        },
        {
            "title": "Tata Steel and other metal stocks rally up to 6% on China capacity curbs, policy support",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-and-other-metal-stocks-rally-up-to-5-on-china-capacity-curbs-policy-support/articleshow/123674052.cms",
            "description": "Metal stocks rallied on Wednesday with Tata Steel up 6%, as China’s production curbs and India’s tariff protection boosted sentiment. The Nifty Metal index rose 2.5%, led by Tata Steel, Jindal Steel, SAIL, and JSW Steel, with analysts seeing firmer steel prices ahead.",
            "pubDate": "2025-09-03T09:49:21.951435"
        },
        {
            "title": "Retail investors raising stakes in small-cap stocks for 4 straight quarters — but are they winning?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-raising-stakes-in-small-cap-stocks-for-4-straight-quarters-but-are-they-winning/slideshow/123673918.cms",
            "description": "Retail investors have steadily raised their stakes in 128 smallcap stocks over the last four quarters, up to June 2025—signaling growing confidence in emerging companies. But over 100 of these stocks have witnessed negative price returns in the past year, suggesting that most retail investors are currently in the red. (Retail investor - resident individuals holding nominal share capital up to Rs 2 lakhs)",
            "pubDate": "2025-09-03T09:49:21.951545"
        },
        {
            "title": "European shares recover as bond selloff stabilizes ahead of US data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-recover-as-bond-selloff-stabilizes-ahead-of-us-data/articleshow/123673880.cms",
            "description": "European shares climbed on Wednesday, bouncing back from steep losses in the previous session, as a selloff in longer-dated bonds appeared to stabilize, while investors awaited U.S. job openings data.",
            "pubDate": "2025-09-03T09:49:21.951674"
        },
        {
            "title": "Cyclically negative, structurally positive: Will cement be a surprise winner? 9 cement stocks with an upside potential of up to 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cyclically-negative-structurally-positive-will-cement-be-a-surprise-winner-9-cement-stocks-with-an-upside-potential-of-up-to-27/articleshow/123673604.cms",
            "description": "In some sectors, it is better to own a basket of shares rather than have exposure to a single stock. Reason: When a sector goes through a phase of restructuring and consolidation, the chances are high that a set of winners will emerge. But it is tough to figure out which the winners will be. So, buy a basket. Also, unlike in the past when buying a basket of stocks was a cumbersome process, today it is just a click away. Now, why cement? Because it might be a surprise winner. What makes that sector a surprise winner? When fundamentals are changing, but scepticism levels are still high. Cement is a sector which has probably seen the maximum mergers and acquisition in the last three years and that suggests there has been a change in the operating matrix.",
            "pubDate": "2025-09-03T09:49:21.951778"
        },
        {
            "title": "Anlon Healthcare shares make a tepid debut. Should IPO investors wait or sell?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anlon-healthcare-shares-make-a-tepid-debut-should-ipo-investors-wait-or-sell/articleshow/123673169.cms",
            "description": "Anlon Healthcare’s shares debuted with a modest 1% premium amid volatile pharma markets, despite a strong 7.12x IPO subscription driven by retail investors. The specialized API manufacturer showed robust financial growth, with revenue up 81% in FY25 and expanding profit margins. While niche products and global approvals boost prospects, risks include limited operating history and regulatory challenges. Analysts consider the IPO fully priced.",
            "pubDate": "2025-09-03T09:49:21.951880"
        },
        {
            "title": "Mukul Agrawal, Ashish Kacholia-backed Vikran Engineering shares rise 5% from IPO price. Time to cash out or double down?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-ashish-kacholia-backed-vikran-engineering-shares-rise-5-from-ipo-price-time-to-cash-out-or-double-down/articleshow/123672190.cms",
            "description": "Vikran Engineering’s shares rose about 5% on debut, listing slightly above its Rs 97 IPO price in a Rs 772-crore offering backed by investors Mukul Agrawal and Ashish Kacholia. Despite strong subscription and a robust order book, gains fell short of grey market expectations. Analysts recommend holding for long-term growth supported by government infrastructure spending and the company’s asset-light model.",
            "pubDate": "2025-09-03T09:49:21.951977"
        },
        {
            "title": "Time to think beyond correction & volatility? 7 small-caps from different sectors with upside potential of 13% to 50%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-think-beyond-correction-volatility-7-small-caps-from-different-sectors-with-upside-potential-of-13-to-50/articleshow/123671849.cms",
            "description": "We are in turbulent and confused times, at least where the market is concerned. Sentiment on the street swings with each statement by an Indian minister or a US official, or President Trump himself. One way to deal with this is to sit it out. But if you are a smart investor with a long-term perspective you will be wondering whether this is the opportunity you have been waiting for. You may also be wondering whether, after an extended correction, small-cap stocks are at a stage where you should start looking at them? Perhaps. But you need to be smart about picking the right stocks.",
            "pubDate": "2025-09-03T09:49:21.952071"
        },
        {
            "title": "Apollo Micro Systems shares rally 4%, extend winning streak to 4 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-micro-systems-shares-rally-4-extend-winning-streak-to-4-days/articleshow/123672121.cms",
            "description": "Apollo Micro Systems shares: Apollo Micro Systems hit a new 52-week high at Rs 303 on Wednesday, extending gains for the fourth session. The stock has surged 160% in six months, outperforming defence peers like Astra Microwave, BEML, Paras Defence, and BEL.",
            "pubDate": "2025-09-03T09:49:21.952168"
        },
        {
            "title": "GST, tariffs, and market moves: Manishi Raychaudhuri decodes what investors should watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-tariffs-and-market-moves-manishi-raychaudhuri-decodes-what-investors-should-watch-out-for/articleshow/123672088.cms",
            "description": "India’s GST meeting may cut tax slabs on discretionary items, potentially boosting consumption if benefits reach consumers. Global trade tensions, especially U.S. tariffs, pressure exporters, while rising bond yields reflect inflation concerns. Precious metals remain safe-haven favorites amid geopolitical risks, keeping investors cautious yet opportunistic.",
            "pubDate": "2025-09-03T09:49:21.952262"
        },
        {
            "title": "Ola Electric shares skyrocket 55% in a month, analysts see further rally till Rs 90",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-skyrocket-55-in-a-month-analysts-see-further-rally-till-rs-90/articleshow/123672054.cms",
            "description": "Ola Electric's shares are rebounding strongly. The stock has increased significantly in the past month. This is due to positive technical indicators and PLI scheme approval. The approval allows Ola to receive incentives until 2028. Analysts predict further gains, with potential targets of Rs 80-90. However, the company reported a net loss in the June quarter.",
            "pubDate": "2025-09-03T09:49:21.952361"
        },
        {
            "title": "NCDEX unlisted shares rocket 14% as Radhakishan Damani, Madhu Kela, Zerodha, Groww commit crores",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncdex-unlisted-shares-rocket-14-as-radhakishan-damani-madhu-kela-zerodha-groww-commit-crores/articleshow/123677347.cms",
            "description": "NCDEX unlisted shares surged 14.5% to Rs 475 after raising Rs 770 crore from top investors, including Radhakishan Damani, Zerodha, and Groww, ahead of its 2026 equity segment launch. The funding supports expansion into cash equities and derivatives, leveraging its rural commodities network amid rising competition.",
            "pubDate": "2025-09-03T11:51:36.822322"
        },
        {
            "title": "​Stock Radar: Cummins India stock hits fresh high in August 2025; will the rally continue in September?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-cummins-india-stock-hits-fresh-high-in-august-2025-will-the-rally-continue-in-september/articleshow/123659317.cms",
            "description": "Cummins India Ltd. is experiencing an uptrend, suggesting continued momentum into September. Experts recommend short-term traders consider buying, targeting above 4,400 levels. The stock's consistent higher top-higher bottom formation and strong performance, trading above key moving averages, reinforce a bullish outlook. Analysts suggest a stop loss at 3,600.",
            "pubDate": "2025-09-03T11:51:36.822458"
        },
        {
            "title": "GST rate cut: How is CLSA tweaking its portfolio ahead of the Council meeting verdict",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-rate-cut-how-is-clsa-tweaking-its-portfolio-ahead-of-ahead-of-the-council-meeting-verdict/articleshow/123676762.cms",
            "description": "GST reforms are set to impact markets, with potential 7–10% cuts on two-wheelers, small cars, tractors, and consumer goods. Analysts say consumption sectors are likely beneficiaries, shifting focus from September-quarter earnings to policy outcomes. CLSA favors defensive, consumption, and rate-sensitive sectors, while positioning may change based on final GST announcements.",
            "pubDate": "2025-09-03T11:51:36.822661"
        },
        {
            "title": "Market Snapshot: Range-bound trading continues as metals shine amid global cues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-snapshot-range-bound-trading-continues-as-metals-shine-amid-global-cues/articleshow/123676668.cms",
            "description": "Indian equity markets displayed a range-bound trade today, with Bank Nifty managing to remain in the green despite recent volatility. Investors are weighing news developments alongside technical trends, trying to gauge whether short-term headlines will steer the market or if chart trajectories will dictate the next move.",
            "pubDate": "2025-09-03T11:51:36.822767"
        },
        {
            "title": "GST, tariffs and Fed moves to shape market strategy for Indian investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-tariffs-and-fed-moves-to-shape-market-strategy-for-indian-investors/articleshow/123676094.cms",
            "description": "With the much-anticipated GST meeting underway, market participants are keeping a close eye on potential rate revisions that could impact sectors across India. ET Now recently spoke to Vikash Kumar Jain, a seasoned market strategist, for his insights on how GST changes could reshape investor sentiment and portfolio allocations.",
            "pubDate": "2025-09-03T11:51:36.824983"
        },
        {
            "title": "Sensex rises 410 pts, Nifty50 tops 24,700 as banks, metal stocks advance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-410-pts-nifty50-tops-24710-as-banks-metal-stocks-advance/articleshow/123675637.cms",
            "description": "Indian markets closed higher on Wednesday, driven by banking and metal stocks, as investors anticipated GST Council updates regarding potential rate cuts. The Nifty rose by 0.55%, and the Sensex increased by 0.51%. Metal stocks surged, led by Tata Steel, while the IT index lagged due to concerns over U.S. manufacturing data.",
            "pubDate": "2025-09-03T11:51:36.825120"
        },
        {
            "title": "US trading firm Jane Street files case against Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-trading-firm-jane-street-files-case-against-sebi-document-shows/articleshow/123675322.cms",
            "description": "Jane Street is challenging SEBI in court, alleging the regulator withheld crucial documents related to market manipulation accusations. This follows SEBI's earlier ban on Jane Street for allegedly profiting from derivatives trading, a ban temporarily lifted after the firm deposited alleged unlawful gains. The core dispute centers on whether Jane Street's trading activities constituted legitimate hedging or manipulative practices.",
            "pubDate": "2025-09-03T11:51:36.825219"
        },
        {
            "title": "GST meet kicks off amid market caution; investors eye consumption push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-meet-kicks-off-amid-market-caution-investors-eye-consumption-push/articleshow/123675063.cms",
            "description": "The two-day GST Council meet begins with markets cautious and FIIs largely absent, says Vikash Kumar Jain. While India’s long-term story remains strong, investor sentiment has cooled. A broad GST cut aimed at boosting consumption could surprise positively and trigger renewed confidence in equities.",
            "pubDate": "2025-09-03T11:51:36.825316"
        },
        {
            "title": "Piyush Goyal assures help to exporters to deal with global trade uncertainties",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/piyush-goyal-assures-help-to-exporters-to-deal-with-global-trade-uncertainties/articleshow/123681111.cms",
            "description": "Commerce Minister Piyush Goyal has assured exporters of government support in navigating steep US tariffs. He urged them to enhance product quality, diversify supply chains, and explore new markets. The government is committed to creating a supportive ecosystem through various initiatives and policy interventions. India's exports rebounded in July, with a significant increase in trade with the US.",
            "pubDate": "2025-09-03T21:18:56+05:30"
        },
        {
            "title": "GST has been contributing a substantial part of revenue kitty: JNU Professor Praveen Jha",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-has-been-contributing-a-substantial-part-of-revenue-kitty-jnu-professor-praveen-jha/videoshow/123680781.cms",
            "description": "",
            "pubDate": "2025-09-03T20:53:54+05:30"
        },
        {
            "title": "Guwahati Tea Auction Centre records impressive growth in sales during April – August with 76.94 mn kgs of teas sold",
            "link": "https://economictimes.indiatimes.com/news/economy/agriculture/guwahati-tea-auction-centre-records-impressive-growth-in-sales-during-april-august-with-76-94-mn-kgs-of-teas-sold/articleshow/123680052.cms",
            "description": "Guwahati Tea Auction Centre (GTAC) experienced substantial tea sales growth from April to August 2025. Total tea sales reached 76.94 million kgs, with CTC and Dust varieties at 72.70 million kgs and Orthodox teas at 4.24 million kgs. While Orthodox teas showed strong price appreciation, CTC and Dust prices corrected slightly, remaining above 2023 levels, indicating a dynamic market.",
            "pubDate": "2025-09-03T20:42:13+05:30"
        },
        {
            "title": "FDI up 15 pc to USD 18.62 bn in Apr-June FY26; inflow from US triples",
            "link": "https://economictimes.indiatimes.com/news/economy/indicators/fdi-up-15-pc-to-usd-18-62-bn-in-apr-june-fy26-inflow-from-us-triples/articleshow/123680374.cms",
            "description": "Foreign Direct Investment in India increased by 15 percent, reaching 18.62 billion US dollars during April to June. The United States became the largest investor, contributing 5.61 billion US dollars. Karnataka received the highest inflow of investments. The government has implemented investor-friendly policies and reforms across various sectors. These reforms aim to liberalize FDI norms and attract more overseas investments.",
            "pubDate": "2025-09-03T20:18:17+05:30"
        },
        {
            "title": "GST Council okays fast registration for non-risky businesses, seven-day refund window",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-approves-quicker-registration-seven-day-refund-window-and-tax-relief-for-exporters/articleshow/123680135.cms",
            "description": "The GST Council is likely to approve reforms aimed at easing compliance for small businesses, including faster registration and refunds. Amendments to the place of supply definition will benefit Global Capacity Centres and ITES, while rate rationalization discussions continue. The council also addressed post-sales discounts and appellate tribunal issues, focusing on reducing litigation and supporting small taxpayers and exporters.",
            "pubDate": "2025-09-03T20:09:11+05:30"
        },
        {
            "title": "GST on footwear, apparels priced at Rs 2,500 cut to 5%",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-on-footwear-apparels-priced-at-rs-2500-likely-cut-to-5/articleshow/123679325.cms",
            "description": "The GST Council has likely approved reducing the GST rate on footwear and apparel priced up to Rs 2,500 to 5%. Previously, this rate applied only to items priced up to Rs 1,000. The council also decided to eliminate the 12% and 28% slabs, shifting most items to the 5% and 18% categories.",
            "pubDate": "2025-09-03T18:51:11+05:30"
        },
        {
            "title": "Jaishankar on how India is balancing relations with conflicting partners: 'we were quite easy ..'",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/jaishankar-on-how-india-is-balancing-relations-with-conflicting-partners-we-were-quite-easy-/videoshow/123678581.cms",
            "description": "",
            "pubDate": "2025-09-03T18:06:58+05:30"
        },
        {
            "title": "Sberbank publishes guide for Indian entrepreneurs planning to localise biz in Russia",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/sberbank-publishes-guide-for-indian-entrepreneurs-planning-to-localise-biz-in-russia/articleshow/123677175.cms",
            "description": "Sberbank aims to facilitate the India-Russia trade relationship, targeting USD 100 billion in bilateral trade by 2030. To achieve this, Sberbank is providing resources for businesses looking to expand into each other's markets. While current trade stands at USD 63 billion, dominated by energy, there's a push for diversification, especially after trade reached USD 68.7 billion in 2024-25.",
            "pubDate": "2025-09-03T16:56:13+05:30"
        },
        {
            "title": "Govt sets up committee to examine tax, export clearance issues of manufacturing sector",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/govt-sets-up-committee-to-examine-tax-export-clearance-issues-of-manufacturing-sector/articleshow/123676457.cms",
            "description": "Amidst high tariffs imposed by the US, the government has formed a committee to address tax and export clearance issues faced by manufacturing units. The committee, comprising representatives from various ministries and industry bodies, will examine existing tax structures and procedures, identify sector-specific challenges, and recommend global best practices to enhance export competitiveness.",
            "pubDate": "2025-09-03T16:20:19+05:30"
        },
        {
            "title": "India-EFTA trade pact with sustainability clause to take effect on October 1",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-efta-trade-pact-with-sustainability-clause-to-take-effect-on-october-1/articleshow/123675109.cms",
            "description": "The free trade agreement between India and the EFTA bloc, set to take effect on October 1, includes legally binding provisions on trade and sustainable development. India has secured a USD 100 billion investment commitment over 15 years, leading to the creation of one million direct jobs. Switzerland gains improved market access for 94.",
            "pubDate": "2025-09-03T15:18:40+05:30"
        },
        {
            "title": "The art of consensus: How a divided India came together for GST",
            "link": "https://economictimes.indiatimes.com/news/economy/finance/the-art-of-consensus-how-a-divided-india-came-together-for-gst/articleshow/123674679.cms",
            "description": "The GST Council is meeting to discuss potential rate changes, including a two-slab structure and a luxury item tax. States are seeking revenue loss compensation as the Centre plans to end the compensation cess. The original GST rollout in 2017 was a landmark achievement of political consensus, uniting India through bipartisan cooperation.",
            "pubDate": "2025-09-03T15:07:57+05:30"
        },
        {
            "title": "EAM Jaishankar assures ‘special attention’ to German companies investing in India",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/eam-jaishankar-assures-special-attention-to-german-companies-investing-in-india/articleshow/123674722.cms",
            "description": "​​Speaking at a joint press conference with his German counterpart, Jaishankar reiterated that India remains fully committed to continuously improving the ease of doing business in this country and assured him minister that any concerns that German companies may have in India, coming to India, establishing themselves, working in India, New Delhi would be prepared to give it \"special attention.”",
            "pubDate": "2025-09-03T15:01:44+05:30"
        },
        {
            "title": "Textiles Minister assesses MSP operations for cotton procurement ahead of Kharif season",
            "link": "https://economictimes.indiatimes.com/news/economy/agriculture/textiles-minister-assesses-msp-operations-for-cotton-procurement-ahead-of-kharif-season/articleshow/123674394.cms",
            "description": "Union Textiles Minister Giriraj Singh reviewed MSP operations for cotton procurement starting October 1, 2025, assuring seamless procurement via the 'Kapas-Kisaan' app for farmer registration and direct payments. The initiative aims for a digitally empowered cotton ecosystem with transparent, faceless processes and uniform procurement norms.",
            "pubDate": "2025-09-03T14:44:22+05:30"
        },
        {
            "title": "GST Council starts two today meeting to discuss two slabs, tax cuts",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-starts-two-today-meeting-meet-to-discuss-two-slabs-tax-cuts/articleshow/123672352.cms",
            "description": "The GST Council convened to deliberate on a proposal to streamline tax slabs, potentially reducing rates for essential items and luxury goods. While states generally support the plan, some opposition-led regions seek revenue loss compensation. The proposed reforms aim to boost consumption, ease business operations, and simplify compliance, with potential economic benefits.",
            "pubDate": "2025-09-03T13:08:00+05:30"
        },
        {
            "title": "India counting on Germany's support to expedite trade talks with EU",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-counting-on-germanys-support-to-expedite-trade-talks-with-eu/articleshow/123672014.cms",
            "description": "Indian Foreign Minister Subrahmanyam Jaishankar urged German counterpart Johann Wadephul for support in strengthening ties with the European Union and advancing free trade agreement discussions. Wadephul is visiting India for two days, having been in Bengaluru on Tuesday.",
            "pubDate": "2025-09-03T12:33:48+05:30"
        },
        {
            "title": "Sitharaman: Next- gen GST reforms will be open, transparent, business-friendly",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/sitharaman-next-gen-gst-reforms-will-be-open-transparent-business-friendly/videoshow/123671619.cms",
            "description": "",
            "pubDate": "2025-09-03T12:14:04+05:30"
        },
        {
            "title": "Opposition-ruled states meet ahead of GST Council, seek compensation to approve reform agenda",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/opposition-ruled-states-meet-ahead-of-gst-council-seek-compensation-to-nod-reform-agenda/articleshow/123670750.cms",
            "description": "Opposition-ruled states met ahead of the GST Council meeting, seeking compensation for revenue loss following GST rate rejig. They fear losses from slab removals, while the Centre believes lower prices will boost consumption. The GST Council will discuss a proposal to reduce the number of tax rates and a special rate on select items, potentially impacting prices of various goods.",
            "pubDate": "2025-09-03T11:29:56+05:30"
        },
        {
            "title": "Govt likely to roll out four schemes to help exporters facing 50% US tariffs: Report",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/india-us-trump-tariffs-relief-schemes-msme-support-export-promotion-mission/articleshow/123670407.cms",
            "description": "In response to Washington's tariff hike, the Indian government is preparing a support package for exporters, potentially including credit and liquidity measures akin to those during the Covid-19 pandemic. The focus is on aiding MSMEs in sectors like textiles, gems, and engineering goods to withstand the impact, maintain jobs, and explore new markets.",
            "pubDate": "2025-09-03T11:27:56+05:30"
        },
        {
            "title": "GST Council meet begins to deliver on PM Modi's Diwali gift promise: What's coming for auto, insurance, personal care and electronic sectors?",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-headed-by-nirmala-sitharaman-meet-begins-to-deliver-on-pm-modis-diwali-gift-promise-whats-coming-for-auto-insurance-personal-care-and-electronic-sectors/articleshow/123669809.cms",
            "description": "Chaired by Finance Minister Nirmala Sitharaman, the GST Council is convening for two days to discuss a significant overhaul of the Goods and Services Tax. The proposed reforms aim to reduce tax rates on everyday items, potentially shifting most goods from the 12% bracket to 5% and from 28% to 18%.",
            "pubDate": "2025-09-03T11:20:58+05:30"
        },
        {
            "title": "India service sector growth hit 15-year high in August but inflation intensifies: PMI data",
            "link": "https://economictimes.indiatimes.com/news/economy/indicators/india-service-sector-growth-hit-15-year-high-in-august-but-inflation-intensifies-pmi-data/articleshow/123669856.cms",
            "description": "India's services sector experienced a significant surge in August, reaching a 15-year high driven by robust demand. This surge also led to the fastest increase in prices in over a decade. Business confidence improved, fueled by advertising plans and positive demand forecasts, despite modest employment growth. The Composite PMI hit a 17-year high, indicating broad economic momentum.",
            "pubDate": "2025-09-03T10:38:06+05:30"
        },
        {
            "title": "50% tariffs driving India towards Russia, China, says US' Ro Khanna; vows to protect bipartisan ties against 'Trump's ego'",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/50-tariffs-driving-india-towards-russia-china-says-us-ro-khanna-vows-to-protect-bipartisan-ties-against-trumps-ego/articleshow/123669126.cms",
            "description": "Khanna, who co-chairs the US-India Caucus, said the 50% duties were not only hurting Indian exporters of products such as leather and textiles but also undermining American manufacturers. The California Democrat accused Trump of jeopardising a strategic partnership out of personal grievances. He added that the alliance with India was too vital to be put at risk.",
            "pubDate": "2025-09-03T09:52:51+05:30"
        },
        {
            "title": "GST Council Meeting: Hour of GST 2.0 arrives; all eyes on Team Modi's Diwali gifts for Indian economy",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-meeting-hour-of-gst-2-0-arrives-all-eyes-on-team-modis-diwali-gifts-for-indian-economy/articleshow/123668868.cms",
            "description": "The keenly-watched GST Council meeting is underway. It will potentially overhauling India's tax structure by reducing it to two primary slabs of 5% and 18%, alongside a 40% rate for luxury items. This reform aims to boost consumption and simplify compliance, but faces opposition from states concerned about revenue losses and compensation mechanisms, particularly regarding the compensation cess.",
            "pubDate": "2025-09-03T09:33:47+05:30"
        },
        {
            "title": "Trump has no understanding of economics, India holds 21st century's deciding vote and justified tariff policies: Edward Price",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-has-no-understanding-of-economics-india-holds-21st-centurys-deciding-vote-and-justified-tariff-policies-edward-price/articleshow/123668703.cms",
            "description": "An analyst criticizes Donald Trump's India policy. Edward Price warns trade disputes harm relations. Trump's tariffs misunderstand economics. India's policies are justified for development. Price suggests India may align with China, Russia. Modi reminds the US of his options. Price recommends removing tariffs and offering an apology. He emphasizes India's importance in US-China competition.",
            "pubDate": "2025-09-03T09:16:59+05:30"
        },
        {
            "title": "GST 2.0 &amp; the great Indian price puzzle: Middle class cheer or boardroom bonus?",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-2-0-the-great-indian-price-puzzle-middle-class-cheer-or-boardroom-bonus/articleshow/123667802.cms",
            "description": "India is on the verge of GST 2.0, aiming to simplify the tax structure and boost demand. Essential goods may see reduced rates, benefiting consumers, while companies could strategically reprice products. The reform balances revenue concerns with the potential for increased consumption, impacting both household budgets and corporate strategies.",
            "pubDate": "2025-09-03T08:55:32+05:30"
        },
        {
            "title": "Motown unclear what route cess will take past GST 2.0",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/motown-unclear-what-route-cess-will-take-past-gst-2-0/articleshow/123664147.cms",
            "description": "Indian automakers and retailers may face losses on over 600,000 unsold vehicles. This is due to unclear GST compensation cess rules. The industry wants the government to abolish the cess. They seek a mechanism for credit losses after the GST revamp. The GST Council will discuss levy changes soon. Some companies are limiting dispatches of larger vehicles.",
            "pubDate": "2025-09-03T06:00:00+05:30"
        },
        {
            "title": "Hope to finalise US trade pact by November, says Piyush Goyal",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/hope-to-finalise-us-trade-pact-by-november-says-piyush-goyal/articleshow/123663871.cms",
            "description": "Piyush Goyal anticipates concluding a trade agreement with the US by November. Trade talks with the European Union are progressing well. Relations with China are improving as border tensions decrease. India has already finalized trade agreements with Mauritius, Australia, EFTA, the UK, and the UAE. India aims to be self-reliant by ensuring resilient supply chains.",
            "pubDate": "2025-09-03T05:00:00+05:30"
        },
        {
            "title": "ET Graphics | G 2.0: A reform story",
            "link": "https://economictimes.indiatimes.com/news/economy/finance/et-graphics-g-2-0-a-reform-story/articleshow/123664320.cms",
            "description": "The Goods and Services Tax Council is set to commence a two-day meeting on Wednesday to discuss significant reforms to the GST structure, which was implemented eight years ago. Prime Minister Narendra Modi has called the proposed changes a 'Diwali gift,' as the Centre aims to lessen the tax burden on the general public and simplify compliance procedures for businesses.",
            "pubDate": "2025-09-03T01:52:15+05:30"
        },
        {
            "title": "States to gain from GST rate rationalisation: Report",
            "link": "https://economictimes.indiatimes.com/news/economy/finance/states-to-gain-from-gst-rate-rationalisation-report/articleshow/123664296.cms",
            "description": "An SBI Research report projects states to be 'net gainers' from the proposed GST rate rationalization, with revenue exceeding ₹14.10 lakh crore this fiscal year. While an initial dip is possible, states are expected to gain ₹10 lakh crore in state GST and ₹4.1 lakh crore through devolution in FY26.",
            "pubDate": "2025-09-03T01:38:33+05:30"
        },
        {
            "title": "India ups the tempo in diversifying trade deals",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-ups-the-tempo-in-diversifying-trade-deals/articleshow/123664274.cms",
            "description": "India is accelerating its efforts to diversify export markets amid trade tensions with the US, actively pursuing new trade agreements with the Eurasian Economic Union (EAEU), the European Union (EU), and the South African Customs Union (SACU).",
            "pubDate": "2025-09-03T01:33:31+05:30"
        },
        {
            "title": "Fitment panel clears two-slab GST structure",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/fitment-panel-clears-two-slab-gst-structure/articleshow/123664265.cms",
            "description": "The GST Council is set to consider a proposal for a simplified two-slab GST structure of 5% and 18%, along with a 40% rate for sin and luxury goods. This move, recommended by the fitment committee, aims to lower the tax burden on common household items, potentially reducing it by 12-15%.",
            "pubDate": "2025-09-03T01:30:32+05:30"
        },
        {
            "title": "Tax exemption for global funds extended to FY31",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/tax-exemption-for-global-funds-extended-to-fy31/articleshow/123663856.cms",
            "description": "The CBDT has extended the tax exemption timeline for sovereign wealth and pension funds investing in India. Originally set to expire in FY25, the deadline is now extended to FY31, offering significant relief to these entities. This amendment encourages continued investment in infrastructure and priority sectors under Section 10(23FE) of the Income Tax Act.",
            "pubDate": "2025-09-03T00:43:27+05:30"
        },
        {
            "title": "Yellow pea imports hit prices; government urges import curbs",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/yellow-pea-imports-hit-prices-government-urges-import-curbs/articleshow/123663317.cms",
            "description": "The Ministry of Consumer Affairs has urged the Commerce Ministry to restrict duty-free yellow pea imports, as they are undercutting domestic pulse prices. This move follows concerns raised by the agriculture minister and industry bodies about the impact on local farmers and pulse production.",
            "pubDate": "2025-09-03T00:18:12+05:30"
        },
        {
            "title": "Budget 2026-27 preparation to begin on October 9: Finance Ministry",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/budget-2026-27-preparation-to-begin-on-october-9-finance-ministry/articleshow/123663116.cms",
            "description": "India's finance ministry is set to begin crafting the Union Budget for 2026-27 amidst new US tariffs and global economic uncertainties, starting October 9. The budget aims to navigate these challenges while advancing reforms to boost growth and employment. Ministries are urged to provide realistic projections and align allocations with approved plans, avoiding liability transfers between Finance Commission cycles.",
            "pubDate": "2025-09-03T00:08:33+05:30"
        },
        {
            "title": "Two Trades for Today: An FMCG major for a 4.75% rise, a large-cap aluminium stock for an almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-fmcg-major-for-a-4-75-rise-a-large-cap-aluminium-stock-for-an-almost-7-gain/articleshow/123680645.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-03T16:53:59.658686"
        },
        {
            "title": "NSE appoints former IFSCA chairman Injeti Srinivas as Public Interest Director",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-appoints-former-ifsca-chairman-injeti-srinivas-as-public-interest-director/articleshow/123680660.cms",
            "description": "The National Stock Exchange (NSE) has appointed Injeti Srinivas, former chairman of the International Financial Services Centres Authority (IFSCA), as a Public Interest Director on its board.",
            "pubDate": "2025-09-03T16:53:59.658810"
        },
        {
            "title": "Market Trading Guide: HDFC Bank, EIH among 5 stock recommendations for Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-hdfc-bank-eih-among-5-stock-recommendations-for-thursday/slideshow/123680644.cms",
            "description": "Indian equities closed higher on Wednesday after a mixed start to the session, buoyed by expectations of a consumption-led stimulus from the potential GST slab rationalisation. All categories of consumer-based sectors, like discretionary, durable and staples, continued to outperform.Analysts say market sentiment hinges on the outcome of the GST Council meeting in the near term, with traction on consumption-oriented stocks and sectors.Here are 5 stock recommendations for Thursday",
            "pubDate": "2025-09-03T16:53:59.658914"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/123680516.cms",
            "description": "Indian markets closed higher on Wednesday, led by banking and metal stocks, with Nifty at 24,715 and Sensex at 80,567. Investors await GST Council updates that could impact consumption-led sectors, while technical indicators show cautious near-term market momentum and potential support-resistance levels.",
            "pubDate": "2025-09-03T16:53:59.659032"
        },
        {
            "title": "Multibagger or IBC - Part 22: Over Rs. 1,000 crore cash in books. Dry powder ready for EV play and M&As?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-part-22-over-rs-1000-crore-cash-in-books-dry-powder-ready-for-ev-play-and-mas/articleshow/123679768.cms",
            "description": "Internal combustion technologies face long-term disruption as EV adoption grows, but this auto ancillary player is hedging its bets. While the core business continues to support a deep OEM client base, the company has stepped into electric mobility with motors and controllers. The latest financials show growing revenues, healthy margins and EPS, and strong cash reserves. Diversification across 45+ countries, steady dividend payouts, and disciplined capital allocation provide resilience, making this company’s transition worth tracking in the fast-changing auto ancillary landscape. This series on auto ancillary companies works with the assumption that, from the whole set of auto ancillary companies, some multibagger stocks will emerge. And some companies in this space risk going bankrupt.",
            "pubDate": "2025-09-03T16:53:59.659138"
        },
        {
            "title": "Alphabet shares surge over 6% after court rules against a breakup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/google-parent-alphabet-shares-surge-6-after-court-rules-against-a-breakup/articleshow/123679615.cms",
            "description": "Alphabet's shares surged after a U.S. judge ruled against breaking up Google, adding over $170 billion to its market value. The ruling allows Google to maintain control over Chrome and Android, while barring certain exclusive contracts. Analysts believe this outcome removes a significant legal overhang, potentially deepening Alphabet's partnership with Apple and integrating Gemini AI into iPhones.",
            "pubDate": "2025-09-03T16:53:59.659235"
        },
        {
            "title": "S&P 500 and Nasdaq gain after Alphabet antitrust ruling, soft jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-opens-higher-on-alphabet-boost-jobs-data-on-tap/articleshow/123679499.cms",
            "description": "Wall Street saw mixed trading. S&P 500 and Nasdaq rose due to Alphabet's antitrust win. Google's parent shares increased. A job openings report hinted at a possible rate cut by the Federal Reserve. Energy stocks declined as oil prices decreased. Macy's forecast boosted its shares. Dollar Tree shares dropped. Investors are watching for Friday's jobs report.",
            "pubDate": "2025-09-03T16:53:59.659333"
        },
        {
            "title": "Hotel stocks rally up to 50% in FY26: Will GST 2.0 give them an extra boost?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hotel-stocks-rally-up-to-50-in-fy26-will-gst-2-0-give-them-an-extra-boost/articleshow/123679055.cms",
            "description": "Hotel stocks surged up to 50% in FY26, fueled by strong demand, GST reform hopes, and expansion plans. Analysts remain bullish on Lemon Tree, Chalet, and Apeejay Park, citing rising room rates, reduced debt, and new projects. Seasonal travel and premium supply gaps further support the growth outlook.",
            "pubDate": "2025-09-03T16:53:59.659429"
        },
        {
            "title": "India’s VC AUM surges to Rs 4.9 lakh crore led by domestic capital and small funds: Fibonacci X",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-vc-aum-surges-to-rs-4-9-lakh-crore-led-by-domestic-capital-and-small-funds-fibonacci-x/articleshow/123678201.cms",
            "description": "India's venture capital AUM has surged fivefold in a decade, reaching Rs 4.9 lakh crore, propelled by domestic funds and family offices. Funds below Rs400 crore are key drivers, though top VCs yield seven times higher returns. Domestic limited partners now constitute 39% of new funds, up from 20% two years prior, strengthening the local investor base.",
            "pubDate": "2025-09-03T16:53:59.659521"
        },
        {
            "title": "Maruti Suzuki among 8 consumer discretionary stocks that hit 52-week high; rally up to 35% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-among-8-consumer-discretionary-stocks-that-hit-52-week-high-rally-up-to-35-in-a-month/slideshow/123678317.cms",
            "description": "On Wednesday, the benchmark Sensex surged approximately 410 points to close at 80,567. Amid this broad market upswing, eight stocks from the BSE Consumer Discretionary index reached their 52-week highs, marking their highest levels in the past year. Such breakouts are typically viewed by traders and investors as bullish signals, indicating strong momentum and the possibility of further gains.",
            "pubDate": "2025-09-03T16:53:59.659614"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/123682224.cms",
            "description": "In the last three trading sessions, the one thing clearly favouring the bulls was market breadth, especially in the mid-cap segment. A part of this optimism stems from the street’s expectation that the GST rate rationalisation will be implemented soon. Now, given that it may be implemented as soon as September 22, it probably takes away the fear that this festive season will suffer due to delayed purchases. So, in all probability, some select consumer stocks will get more attention in the coming days.",
            "pubDate": "2025-09-03T17:24:21.566054"
        }
    ]
}