{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-17T10:23:01.991065",
    "items": [
        {
            "title": "Reliance Industries profit flattens in Q3 on gas output, retail pressures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-profit-flattens-in-q3-on-gas-output-retail-pressures/articleshow/126601775.cms",
            "description": "In the latest quarter, Reliance Industries reported a notable increase in profits, driven primarily by robust performances in their telecom and refining sectors. However, challenges in retail and upstream oil and gas segments put pressure on margins. On a positive note, Jio experienced remarkable growth in its digital services and home broadband offerings.",
            "pubDate": "2026-01-17T04:55:55.182273"
        },
        {
            "title": "Reliance FMCG goes places, retail keeps selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-fmcg-goes-places-retail-keeps-selling/articleshow/126590467.cms",
            "description": "Reliance Consumer Products has secured global rights for four international beauty brands. These include Brylcreem, Toni & Guy, Badedas, and Matey. The company plans to expand these brands globally, including in India. Reliance's FMCG business saw significant growth in sales during the October-December quarter. The company is also expanding its manufacturing network and allocating land for food parks.",
            "pubDate": "2026-01-17T04:55:55.182400"
        },
        {
            "title": "Jio net profit zooms as 5G, broadband link well",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-net-profit-zooms-as-5g-broadband-link-well/articleshow/126589975.cms",
            "description": "Jio Platforms has experienced a remarkable 11.2% surge in profits year-over-year, now totaling ₹7,629 crore. This impressive growth stems from their relentless expansion in 5G services and home broadband solutions. Notably, JioAirFiber has made headlines as the fastest broadband service globally to hit the milestone of 10 million subscribers.",
            "pubDate": "2026-01-17T04:55:55.182506"
        },
        {
            "title": "Yes Bank Q3 Results: PAT jumps 55% YoY to Rs 952 crore, interest income down 3.6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-results-pat-jumps-55-yoy-to-rs-952-crore-interest-income-down-3-6/articleshow/126606559.cms",
            "description": "Yes Bank Q3 Results: Yes Bank on Saturday reported a 55% increase in its December quarter standalone net profit at Rs 952 crore compared to Rs 612 crore reported in the year ago period.",
            "pubDate": "2026-01-17T07:37:49.908097"
        },
        {
            "title": "RBL Bank Q3 Results: Net profit rockets 555% to Rs 214 crore, interest income up 5% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rbl-bank-q3-results-net-profit-rockets-555-to-rs-214-crore-interest-income-up-5-yoy/articleshow/126608327.cms",
            "description": "RBL Bank reported a 555% jump in Q3 net profit to Rs 214 crore, driven by advances growth, strong retail and wholesale lending, better asset quality, and higher deposits despite a slight dip in net interest margin.",
            "pubDate": "2026-01-17T08:54:32.941712"
        },
        {
            "title": "HDFC Bank Q3 Results: PAT jumps 11% YoY to Rs 18,654 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q3-results-pat-jumps-11-yoy-to-rs-18654-crore-beats-estimates/articleshow/126609566.cms",
            "description": "HDFC Bank Q3 Results: India's largest private lender HDFC Bank on Saturday reported an 11% jump in its December quarter standalone net profit at Rs 18,654 crore compared to Rs 16,735 crore reported in the year ago period. It was above Street's estimates of Rs 18,473 crore.",
            "pubDate": "2026-01-17T09:32:14.870052"
        },
        {
            "title": "ICICI Bank Q3 Results: PAT falls 4% YoY to Rs 11,318 crore, below estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q3-results-pat-falls-4-yoy-to-rs-11318-crore-below-estimates/articleshow/126610286.cms",
            "description": "ICICI Bank Q3 Results: India's second largest private lender ICICI Bank on Saturday reported a 4% fall in its December quarter standalone net profit at Rs 11,318 crore compared to Rs 11,792 crore reported in the year ago period. The profit after tax (PAT) was below ET Now estimates of Rs 12,346 crore.",
            "pubDate": "2026-01-17T10:23:01.005921"
        }
    ]
}