{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-17T05:49:11.896020",
    "items": [
        {
            "title": "SAT overturns ban on Nusli Wadia, sons, others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sat-overturns-ban-on-nusli-wadia-sons-others/articleshow/126602533.cms",
            "description": "In a surprising turn of events, the Securities Appellate Tribunal has lifted the ban imposed on Bombay Dyeing and its executives, alongside nullifying the associated penalties and restrictions on their directorship roles. This decision comes after Sebi's extended delay of nearly nine years in addressing allegations related to fraudulent activities tied to manipulated financial statements.",
            "pubDate": "2026-01-17T04:55:57.269026"
        },
        {
            "title": "IT resilience gives D-St a silver lining amid geopolitical clouds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-resilience-gives-d-st-a-silver-lining-amid-geopolitical-clouds/articleshow/126602424.cms",
            "description": "In a vibrant trading session on Friday, Indian stock markets rallied, with Nifty and Sensex recording notable gains. The upbeat revenue outlook from tech giant Infosys provided a much-needed boost to IT stocks, igniting early optimism in the market. However, nervousness regarding geopolitical issues led some investors to cash in on profits, resulting in a moderation of the earlier gains.",
            "pubDate": "2026-01-17T04:55:57.269144"
        },
        {
            "title": "European shares subdued as luxury stocks, miners weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-subdued-as-luxury-stocks-miners-weigh/articleshow/126603820.cms",
            "description": "European stock markets ended the week flat. Luxury and mining stocks saw declines. Geopolitical tensions eased, impacting commodity-linked shares. Defence stocks provided some support. Novo Nordisk shares surged on positive news about its weight-loss pill. Investors are navigating a busy earnings season amidst global uncertainties.",
            "pubDate": "2026-01-17T05:49:11.110744"
        }
    ]
}