{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-29T22:42:39.923910",
    "items": [
        {
            "title": "IndiGo shares in focus after DGCA extends lease for Turkish Airlines jets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-after-dgca-extends-lease-for-turkish-airlines-jets/articleshow/123575139.cms",
            "description": "IndiGo share price: DGCA has granted IndiGo a six-month extension to operate two leased Boeing 777 jets from Turkish Airlines under a damp lease, valid until February 28, 2026 . The regulator asked the airline to explore dry-lease alternatives and clarified that no further extensions will be granted.",
            "pubDate": "2025-08-29T03:00:48.658064"
        },
        {
            "title": "RBL Bank shares in focus after Societe Generale acquires shares worth Rs 79 crore via bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-after-societe-generale-acquires-shares-worth-rs-79-crore-via-bulk-deal/articleshow/123575053.cms",
            "description": "RBI Bank share price:  French lender Societe Generale executed a bulk deal in RBL Bank, purchasing over 31 lakh shares worth Rs 79 crore at an average price of Rs 250.57, while simultaneously offloading 1.29 lakh shares in another trade.",
            "pubDate": "2025-08-29T03:00:48.658180"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Adani Ports, Apollo Hospitals among 5 stocks that could give 12-29% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-adani-ports-apollo-hospitals-among-5-stocks-that-could-give-12-29-return/slideshow/123574907.cms",
            "description": "Brokerages have shared their latest stock recommendations across IT, ports, healthcare, metals, and auto ancillaries, highlighting potential upsides in the range of 12–29%.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-29T03:00:48.658279"
        },
        {
            "title": "RIL shares in focus ahead of AGM today. Here’s what investors, brokerages are expecting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-ahead-of-agm-today-heres-what-investors-brokerages-are-expecting/articleshow/123574963.cms",
            "description": "Reliance Industries' AGM is highly anticipated as 44 lakh shareholders await updates on IPO timelines for Jio and Retail, potentially unlocking significant value. Investors are keen on RIL's AI strategy, particularly the JioBrain platform, and progress in the new energy business, including solar and battery giga-factories. Brokerages maintain positive ratings, citing strong refining operations and attractive valuations.",
            "pubDate": "2025-08-29T03:00:48.658380"
        },
        {
            "title": "Last day to buy the shares of smallcap stock before stock split ex-date on Monday. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-the-shares-of-smallcap-stock-before-stock-split-ex-date-on-monday-check-details/articleshow/123574819.cms",
            "description": "Pavna Industries investors, note today is the last day to buy shares for the stock split eligibility. The company will subdivide shares from Rs 10 to Rs 1. September 1 is the ex-date. This split aims to enhance liquidity and make the stock affordable. Post-split, share count increases, but the holding value remains same.",
            "pubDate": "2025-08-29T03:00:48.658476"
        },
        {
            "title": "9 stocks to trade ex-dividend on Monday. Last chance to buy for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-stocks-to-trade-ex-dividend-on-monday-last-chance-to-buy-for-eligibility/articleshow/123574796.cms",
            "description": "Investors eyeing dividend payouts should note that today is the ex-dividend date for nine companies, including Alivus Life Sciences with a Rs 5 per share dividend. Other notable companies like Triveni Engineering and Triveni Turbine are also offering dividends. To be eligible for these payouts, investors must hold the stocks before today's trading close.",
            "pubDate": "2025-08-29T03:00:48.658571"
        },
        {
            "title": "ARC Insulation shares set for NSE SME debut. GMP signals strong debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/arc-insulation-shares-set-for-nse-sme-debut-gmp-signals-strong-debut/articleshow/123574768.cms",
            "description": "ARC Insulation and Insulators is set to debut on the NSE SME platform following a successful IPO that was oversubscribed 18.71 times. The company plans to utilize the Rs 41.19 crore raised for expansion, debt repayment, and working capital.",
            "pubDate": "2025-08-29T03:00:48.658661"
        },
        {
            "title": "S&P 500, Dow score record high closes as Nvidia results buttress AI rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-dow-score-record-high-closes-as-nvidia-results-buttress-ai-rally/articleshow/123574418.cms",
            "description": "The S&P 500 and Dow reached record highs, fueled by strong AI demand despite Nvidia's slightly underwhelming forecast due to Sino-U.S. trade concerns. Investors interpreted Nvidia's revenue surge as confirmation of robust AI spending, boosting other AI stocks.",
            "pubDate": "2025-08-29T03:00:48.658757"
        },
        {
            "title": "Asian stocks mixed as investors await key US inflation data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-mixed-as-investors-await-key-us-inflation-data/articleshow/123573800.cms",
            "description": "Asian equities showed mixed performance as investors awaited a key US inflation report. US stocks reached a new high after strong economic data eased recession fears but also fueled concerns about persistent inflation. The market anticipates potential Fed rate cuts, influenced by economic indicators and geopolitical factors like the Russia-Ukraine situation, impacting commodity prices.",
            "pubDate": "2025-08-29T03:00:48.658850"
        },
        {
            "title": "Stocks in news: RIL, IndiGo, ICICI Bank, TVS Motor, Infosys",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-indigo-icici-bank-tvs-motor-infosys/articleshow/123567833.cms",
            "description": "The markets declined on monthly expiry day. IndiGo's Gangwal family sold a stake. Reliance Industries will hold its AGM. ICICI Bank's compliance officer retired. TVS Motor faces EV volume issues due to magnet supply. Infosys partnered with Mastercard. Societe Generale acquired shares in RBL Bank. These developments are likely to influence trading.",
            "pubDate": "2025-08-29T03:00:48.658951"
        },
        {
            "title": "GIFT Nifty up 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123567858.cms",
            "description": "Nifty experienced a dip due to market reactions to imposed tariffs. Analysts anticipate that supportive policies will bolster domestic markets amidst global trade challenges. The rupee strengthened against the US dollar, influenced by a weaker dollar and lower crude oil prices. India VIX, a measure of market fear, saw a decrease.",
            "pubDate": "2025-08-29T03:00:48.659063"
        },
        {
            "title": "Cyrus Investments proposes withdrawal of Rs 100 crore dividend proceeds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cyrus-investments-proposes-withdrawal-of-rs-100-crore-dividend-proceeds/articleshow/123573677.cms",
            "description": "Cyrus Investments (CIPL) is seeking approval from its NCD holders to withdraw ₹100 crore from a portfolio holding company (PHC) deposit account. This withdrawal is part of the ₹216.8 crore dividend received in FY26. The remaining ₹116.8 crore, considered an excess dividend, will be transferred to a cash top-up account as per the debenture trust deed.",
            "pubDate": "2025-08-29T03:00:48.659161"
        },
        {
            "title": "Uno Minda shares surge 18% since August 6 following strong Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uno-minda-shares-surge-18-since-august-6-following-strong-q1-results/articleshow/123573541.cms",
            "description": "Uno Minda's shares soared to a record high following strong Q1 results, with gains of 18% since August 6. Limited exposure to US tariffs and strategic manufacturing locations globally have boosted investor confidence. The company is undertaking significant capital expenditure for growth and EV component manufacturing, alongside key management changes.",
            "pubDate": "2025-08-29T03:00:48.659255"
        },
        {
            "title": "India Inc doubles up on borrowing overseas after sovereign upgrade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-doubles-up-on-borrowing-overseas-after-sovereign-upgrade/articleshow/123573479.cms",
            "description": "Following India's sovereign rating upgrade by S&P, domestic firms like Credila and Muthoot Finance are actively pursuing offshore fundraising, aiming for over $2 billion. This move is expected to lower borrowing costs, though tax cuts and US tariffs introduce some risks. Market anticipates potential Fed rate cut may further influence fundraising strategies.",
            "pubDate": "2025-08-29T03:00:48.659348"
        },
        {
            "title": "Gangwal family trust sells 1.3% in IndiGo parent for Rs 2,933 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gangwal-family-trust-sells-1-3-in-indigo-parent-for-rs-2933-crore/articleshow/123573444.cms",
            "description": "Rakesh Gangwal's family trust divested a 1.3% stake in InterGlobe Aviation, IndiGo's parent company, for ₹2,933.4 crore through bulk deals. This sale is part of a phased exit strategy initiated after Gangwal stepped down from the board in February 2022. Shares of IndiGo closed lower following the transaction, though the stock has outperformed its benchmark index year-to-date.",
            "pubDate": "2025-08-29T03:00:48.659440"
        },
        {
            "title": "Boost for balance sheet: Japanese banking giant Sumitomo Mitsui lines up Rs 16,000 cr more for fitter Yes Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boost-for-balance-sheet-japanese-banking-giant-sumitomo-mitsui-lines-up-rs-16000-cr-more-for-fitter-yes-bank/articleshow/123574000.cms",
            "description": "Sumitomo Mitsui Banking Corp or SMBC will invest sixteen thousand crore rupees in Yes Bank. The investment will be through equity and debt. This will strengthen Yes Bank's balance sheet. SMBC will also acquire a twenty percent stake in the bank from existing shareholders. The deal awaits regulatory approvals. This move is expected to improve Yes Bank's financial standing.",
            "pubDate": "2025-08-29T03:00:48.659533"
        },
        {
            "title": "Hold equities, not cash; autos & largecap IT offer opportunities, says V Srivatsa",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hold-equities-not-cash-autos-largecap-it-offer-opportunities-says-v-srivatsa/articleshow/123576264.cms",
            "description": "In an ET Now interview, Srivatsa said that despite global challenges—especially risks from US growth, interest rates, and new tariffs—the Indian economy is displaying resilience. He added that domestic consumption appears to have bottomed out, supported by GST rationalisation and the recent corporate tax cuts, which should start yielding positive results in the coming quarters.",
            "pubDate": "2025-08-29T04:26:27.072581"
        },
        {
            "title": "Is your portfolio under attack from Trump’s tariffs? 5 critical moves to make right now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-your-portfolio-under-attack-from-trumps-tariffs-5-critical-moves-to-make-right-now/articleshow/123576187.cms",
            "description": "The US tariff hike to 50% on Indian goods is set to test export-heavy sectors like textiles, gems, and auto components, while pharma, IT, and domestic-focused industries remain resilient. Experts advise diversification, focus on strong balance sheets, and patience over panic. Analysts highlight banks, consumer plays, autos, and infrastructure as key stocks to watch near term.",
            "pubDate": "2025-08-29T04:26:27.072701"
        },
        {
            "title": "Buy, Sell or Hold: Kotak Institutional Equities upgrades Clean Science; Investec maintains sell call on Indigo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-kotak-institutional-equities-upgrades-clean-science-investec-maintains-sell-call-on-indigo/articleshow/123576087.cms",
            "description": "Brokerages gave mixed calls: Kotak upgraded Clean Science to Buy after correction, Investec kept a Sell on Indigo citing high valuations, while Nuvama maintained a Buy on Aditya Vision with a higher target on demand recovery and expansion plans.",
            "pubDate": "2025-08-29T04:26:27.072908"
        },
        {
            "title": "ITC, HDFC Bank lift Sensex 100 pts higher, Nifty above 24,500",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-150-pts-nifty-above-24500-as-ril-hdfc-bank-lead-gainers/articleshow/123575972.cms",
            "description": "The Indian benchmark indices Sensex and Nifty opened higher on Friday, led by advances in heavyweights Reliance Industries and HDFC Bank, though concerns over U.S. tariffs are expected to keep a cap on further gains.",
            "pubDate": "2025-08-29T04:26:27.073009"
        },
        {
            "title": "NSE proposes to roll out pre-open session for index, stock futures from December 8, following BSE’s move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-proposes-to-roll-out-pre-open-session-for-index-stock-futures-from-december-8-following-bses-move/articleshow/123575926.cms",
            "description": "The NSE’s update comes after a previous circular from the exchange, designed to improve trading ease and bolster risk oversight in equity derivatives.",
            "pubDate": "2025-08-29T04:26:27.073104"
        },
        {
            "title": "NTPC shares in focus on Rs 7,735 cr coal mining transfer plan to subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-shares-in-focus-on-rs-7735-cr-coal-mining-transfer-plan-to-subsidiary/articleshow/123575850.cms",
            "description": "Top-performing asset management companies (AMCs) may soon face a valuation check as rising competition, regulatory scrutiny, and elevated stock prices draw investor caution. While fund houses have delivered strong growth and outperformance, analysts warn that premium valuations leave little room for error. Any slowdown in inflows or margin pressure could trigger a reassessment of their lofty pricing.",
            "pubDate": "2025-08-29T04:26:27.073200"
        },
        {
            "title": "Fed governor calls for rate cut at September policy meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-governor-calls-for-rate-cut-at-september-policy-meeting/articleshow/123575806.cms",
            "description": "Federal Reserve Governor Christopher Waller urged the central bank to lower its key interest rate at the upcoming meeting, echoing President Trump's calls for monetary easing. Waller, a potential successor to Chairman Powell, advocated for a 25-basis-point cut to prevent labor market deterioration and achieve the two percent inflation target.",
            "pubDate": "2025-08-29T04:26:27.073293"
        },
        {
            "title": "Infosys shares in focus after partnering with Mastercard to boost cross-border payments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-after-partnering-with-mastercard-to-boost-cross-border-payments/articleshow/123575766.cms",
            "description": "Infosys has partnered with Mastercard to streamline cross-border payments, enabling faster, more secure onboarding for banks and boosting efficiency in payment integration.",
            "pubDate": "2025-08-29T04:26:27.073391"
        },
        {
            "title": "RIL AGM today: Will Reliance Industries shares break 4-year streak of letdowns?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-agm-today-will-reliance-industries-shares-break-4-year-streak-of-letdowns/articleshow/123575638.cms",
            "description": "Reliance Industries AGM 2025:  Reliance Industries’ AGMs have disappointed investors for four straight years, with shares slipping each time. Despite past hype around value-unlocking announcements, the 2024 meeting too failed to impress. Ahead of today’s AGM, expectations are muted, with brokerages suggesting this could finally leave room for a positive surprise if Mukesh Ambani delivers on growth cues across Jio, Retail, and New Energy.",
            "pubDate": "2025-08-29T04:26:27.073485"
        },
        {
            "title": "RBL Bank board approves Rs 6,500 crore fundraise via QIP, debt issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-board-approves-rs-6500-crore-fundraise-via-qip-debt-issue/articleshow/123585467.cms",
            "description": "RBL Bank’s board approved raising ₹6,500 crore through equity and debt securities, including a ₹3,500 crore QIP. The stock surged 4.4% after the announcement, supported by strong six-month rally and fresh bulk deals.",
            "pubDate": "2025-08-29T13:05:51.239323"
        },
        {
            "title": "LIC pays Rs 7,324 cr to Finance Minister as dividend for FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-pays-rs-7324-cr-to-finance-minister-as-dividend-for-fy25/articleshow/123584878.cms",
            "description": "Life Insurance Corporation of India (LIC) on Friday said it has paid a dividend cheque of Rs 7,324.34 crore to Finance Minister Nirmala Sitharaman for the 2024-25 financial year.",
            "pubDate": "2025-08-29T13:05:51.239451"
        },
        {
            "title": "Milind Karmarkar on Trent stock: A 10x growth story in the making",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/milind-karmarkar-on-trent-stock-a-10x-growth-story-in-the-making/slideshow/123582483.cms",
            "description": "Trent has already touched ₹4,800 this year, and Milind Karmarkar in an interview to ET Now disclosed that he personally owns the stock as well as through his fund. While not offering direct advice, he highlighted that per capita income growth is the key driver for Trent’s future. Quoting Ratan Tata, he noted that the company could potentially grow tenfold in the not-so-distant future. For investors, the best approach is to keep buying Trent gradually over time rather than chasing short-term moves.",
            "pubDate": "2025-08-29T13:05:51.239558"
        },
        {
            "title": "​Stock Radar: L&T Finance stock hits fresh record high in August; will the rally continue in September as well?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-lt-finance-stock-hits-fresh-record-high-in-august-will-the-rally-continue-in-september-as-well/articleshow/123565704.cms",
            "description": "L&T Finance stock achieved a new record high in August 2025. Chart patterns indicate a potential rally extension into September. Experts suggest a buying opportunity for short-term traders, targeting Rs 258 within two months. The stock previously broke out from a Cup & Handle formation. Analysts recommend maintaining stop losses below 194.",
            "pubDate": "2025-08-29T13:05:51.239657"
        },
        {
            "title": "Look beyond tariffs; great potential in building materials, domestic pharma and chemicals: Sorbh Gupta",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/look-beyond-tariffs-great-potential-in-building-materials-domestic-pharma-and-chemicals-sorbh-gupta/articleshow/123584192.cms",
            "description": "Bajaj Finserv AMC’s Sorbh Gupta said US tariffs on India pose limited earnings risk, with only 2% of MSCI India revenues exposed. He sees strong opportunities in consumption-driven sectors, midcaps, smallcaps, building materials, domestic pharma, and chemicals.",
            "pubDate": "2025-08-29T13:05:51.239756"
        },
        {
            "title": "Market Wrap: Sensex falls 270 points, Nifty slips below 24,450 as RIL, tariff worries weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-falls-270-points-nifty-slips-below-24450-as-ril-tariff-worries-weigh/articleshow/123582997.cms",
            "description": "Indian benchmark indices Sensex and Nifty experienced a third consecutive session of declines, primarily influenced by a downturn in Reliance Industries following its annual shareholder meeting. Investor concerns regarding newly imposed U.S. tariffs on Indian exports further contributed to the market's negative sentiment. Oil-and-gas and IT sectors led sectoral declines, while midcap and smallcap shares also experienced losses.",
            "pubDate": "2025-08-29T13:05:51.239857"
        },
        {
            "title": "Bank Nifty’s oversold zone could trigger sharp pullback: Nilesh Jain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-niftys-oversold-zone-could-trigger-sharp-pullback-nilesh-jain/articleshow/123582049.cms",
            "description": "After underperforming, Bank Nifty showed signs of recovery, sparking hopes for a market bounce. Nilesh Jain highlighted support at 53,800, with potential upside to 55,500, while also recommending Finolex Industries and Cummins India as stock-specific opportunities amid cautious Nifty trends.",
            "pubDate": "2025-08-29T13:05:51.239958"
        },
        {
            "title": "F&O Radar| Deploy Short Strangle in Nifty to capitalise on Theta decay for potential gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-short-strangle-in-nifty-to-capitalise-on-theta-decay-for-potential-gains/articleshow/123581939.cms",
            "description": "Nifty slipped below 24,850 this week, testing 24,500 on expiry day amid global headwinds and U.S. tariff concerns. Analysts see a range-bound trade between 24,200–24,900. Kotak Securities suggests deploying a Short Strangle options strategy to capitalise on Theta decay in the current volatile market.",
            "pubDate": "2025-08-29T13:05:51.240050"
        },
        {
            "title": "Retail to lead India’s next consumption wave: Milind Karmarkar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-to-lead-indias-next-consumption-wave-milind-karmarkar/articleshow/123581840.cms",
            "description": "Rising per capita incomes are shifting India’s consumption growth from FMCG to retail, offering higher returns. Experts highlight retail stocks like Trent and DMart as long-term opportunities, emphasizing patience, valuation discipline, and gradual accumulation amid cyclical trends and economic shifts.",
            "pubDate": "2025-08-29T13:05:51.240144"
        },
        {
            "title": "China stocks post biggest monthly gain in 11 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-post-biggest-monthly-gain-in-11-months/articleshow/123580909.cms",
            "description": "China stocks surged, marking their best month since September 2024, fueled by ample liquidity despite tech firms cautioning against recent price spikes. The CSI300 Index rose 0.7%, and the Shanghai Composite Index gained 0.4%. Hong Kong's Hang Seng saw a slight increase of 0.3%.",
            "pubDate": "2025-08-29T13:05:51.240266"
        },
        {
            "title": "Reliance Industries shares end over 2% lower on AGM day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-reliance-industries-shares-are-performing-on-agm-day-should-you-buy-sell-or-hold/articleshow/123580626.cms",
            "description": "Reliance Industries' shares dipped despite Mukesh Ambani announcing the anticipated Reliance Jio IPO in the first half of 2026. Investors await updates on IPOs, AI, new energy, and retail, mindful of past AGM disappointments. Brokerages maintain a positive outlook, anticipating value unlocking in Reliance's diverse businesses, while the market hopes Ambani can break the recent trend of post-AGM letdowns.",
            "pubDate": "2025-08-29T13:05:51.240369"
        },
        {
            "title": "European shares slip ahead of crucial US, euro zone data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-slip-ahead-of-crucial-us-euro-zone-data/articleshow/123580313.cms",
            "description": "European shares edged lower on Friday as investors geared up for a slew of euro zone data and a key U.S. inflation report for cues on the potential timing of interest rate cuts on both sides of the Atlantic.",
            "pubDate": "2025-08-29T13:05:51.240459"
        },
        {
            "title": "Japan's Nikkei falls as August rally spurs profit-taking",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-as-august-rally-spurs-profit-taking/articleshow/123580264.cms",
            "description": "Japan's Nikkei share average fell on Friday, as August's rally invited profit taking on the month's final trading day, while a stronger yen and some weak economic readings weighed.",
            "pubDate": "2025-08-29T13:05:51.240553"
        },
        {
            "title": "Tariff worries fade, consumption revival seen as next big theme: Amit Khurana",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-worries-fade-consumption-revival-seen-as-next-big-theme-amit-khurana/articleshow/123580062.cms",
            "description": "Equity markets are recovering from tariff hike concerns. Investors anticipate limited long-term growth impact. Focus shifts to Goods and Services Tax (GST) rate rationalisation. This is expected to boost domestic consumption. Experts highlight that government policies aim to revive demand. Opportunities exist in consumer staples, durables, and building materials. A broader structural recovery in consumption is anticipated.",
            "pubDate": "2025-08-29T13:05:51.240645"
        },
        {
            "title": "Raamdeo Agrawal sees long-term opportunities as India enters new growth cycle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/raamdeo-agrawal-sees-long-term-opportunities-as-india-enters-new-growth-cycle/articleshow/123580031.cms",
            "description": "Raamdeo Agrawal believes India is entering a new phase of economic growth. He suggests this cycle is stronger and more sustainable. Agrawal advises investors to be selective and focus on companies with strong earnings. He highlights opportunities for long-term wealth creation. Market experts emphasize the importance of fundamental changes and corporate earnings quality.",
            "pubDate": "2025-08-29T13:05:51.240740"
        },
        {
            "title": "American PSUs: New asset class? Intel is done, Lockheed Martin is in the air. Who might be next on Trump's American PSU dream list? And why?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/american-psus-new-asset-class-intel-is-done-lockheed-martin-is-in-the-air-who-might-be-next-on-trumps-american-psu-dream-list-and-why/articleshow/123579547.cms",
            "description": "For over two centuries, the US has distinguished itself from state-led economies by keeping government ownership out of private enterprise. Washington regulated, subsidised, and contracted. But it never owned. That firewall is now showing cracks. The Trump administration’s purchase of a nearly 10% stake in Intel, with hints of similar moves in defence giants like Boeing and Lockheed Martin, signals a profound shift. Is America inching toward its own PSU model? Or is it laying the groundwork for its version of a sovereign wealth fund? Either way, it marks a turning point in the story of American capitalism and how valuations would be done across global markets.",
            "pubDate": "2025-08-29T13:05:51.240829"
        },
        {
            "title": "India’s financial sector profits set to double by 2030; UBS sees NBFCs outpacing banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-financial-sector-profits-set-to-double-by-2030-ubs-sees-nbfcs-outpacing-banks/articleshow/123587152.cms",
            "description": "India’s financial-services sector is set for robust expansion, with profits projected to nearly double by FY30. UBS sees NBFCs leading growth, driven by retail credit, wealth management, payments, and insurance, while banks lag amid margin pressures and weak corporate lending.",
            "pubDate": "2025-08-29T14:43:22.544344"
        },
        {
            "title": "Dell shares crash 10% as AI server costs crush margins despite strong demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dell-shares-crash-10-as-ai-server-costs-crush-margins-despite-strong-demand/articleshow/123586783.cms",
            "description": "Shares of Dell Technologies fell about 10% on Friday, as high manufacturing costs for AI-optimized servers and intensifying competition overshadowed the company's bullish demand forecast for artificial intelligence infrastructure.",
            "pubDate": "2025-08-29T14:43:22.544468"
        },
        {
            "title": "US stocks tick lower after inflation data; tariff concerns weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-after-inflation-data-tariff-concerns-weigh/articleshow/123586335.cms",
            "description": "On Friday, Wall Street's main stock indexes saw a lower opening. This followed an inflation report that aligned with expectations. The report maintained anticipation for a September interest rate cut. However, it also raised concerns about tariffs potentially driving up prices. The Dow Jones Industrial Average, S&P 500, and Nasdaq Composite all experienced declines at the start of trading.",
            "pubDate": "2025-08-29T14:43:22.544684"
        },
        {
            "title": "BSE and NSE's combined average daily turnover in cash market slides 32% YoY in July",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-and-nses-combined-average-daily-turnover-in-cash-market-slides-32-yoy-in-july/articleshow/123586144.cms",
            "description": "India’s equity markets corrected in July with combined BSE and NSE cash market turnover falling 32% year-on-year. Weak Q1 earnings, Trump tariffs, and foreign capital flight weighed, even as Sebi emphasized deepening cash markets and balancing F&O activity.",
            "pubDate": "2025-08-29T14:43:22.544780"
        },
        {
            "title": "Nvidia stock gets boost from JP Morgan; analysts look past tepid outlook, hike target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/j-p-morgan-analysts-look-past-nvidias-tepid-outlook-lift-target-price/articleshow/123586097.cms",
            "description": "J.P. Morgan reaffirmed its bullish stance on Nvidia, raising its target price to $215 despite softer guidance. Nvidia posted record Q2 revenue of $46.7 billion and net income of $26.4 billion, driven by AI and networking demand. Risks persist, but analysts see strong multi-year growth potential in AI infrastructure.",
            "pubDate": "2025-08-29T14:43:22.544880"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 30% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-30-in-1-year/articleshow/123589654.cms",
            "description": "There is high probability that we will see more volatility in the coming days. While it is not always the case, sometimes the expiry of a derivative series contract throws light on what might happen in the near term. This time around, it has indicated continued volatility. The task for investors is therefore to reframe volatility not as a threat but as an entry point. Buying into weakness requires patience and conviction, but history tells us that those who take the longer view are rewarded. It means ignoring the noise and focusing on whether the company’s competitive edge, innovation pipeline, or consumer franchise will still matter five or ten years from now. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-08-29T22:42:39.100107"
        }
    ]
}