{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-18T11:45:43.775669",
    "items": [
        {
            "title": "Q2 results today: Jio Financial, Tata Consumer among 44 companies to announce earnings on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-jio-financial-tata-consumer-among-44-companies-to-announce-earnings-on-friday/articleshow/114332691.cms",
            "description": "The second quarter earnings season continues with 44 companies, including Jio Financial, Tata Consumer, and ICICI Lombard, reporting results. Tata Consumer is expected to see a 5% drop in net profit year-on-year, despite a 15% revenue growth driven by new businesses in pharma and food channels.",
            "pubDate": "2024-10-18T03:00:17.466493"
        },
        {
            "title": "Infosys net profit rises 4.7% in Q2, misses Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-net-profit-rises-4-7-in-q2-misses-street-estimates/articleshow/114331924.cms",
            "description": "The guidance change is the sixth consecutive quarterly revision and seventh in eight quarters. Infosys is seeing a “lot of traction in financial services, which has given us good growth last quarter and this quarter,” said chief executive officer Salil Parekh. “We see that continuing.”",
            "pubDate": "2024-10-18T03:00:17.466629"
        },
        {
            "title": "Axis Bank beats Street with 18% Q2 net rise, cites 'tough variables'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-beats-street-with-18-q2-net-rise-cites-tough-variables/articleshow/114331249.cms",
            "description": "Net interest income - the difference between interest earned on loans and that paid on deposits - a key source of income for banks, grew 9% year-on-year to ₹13,483 crore. Net interest margins for the September quarter basis eased to 3.99% against 4.11% a year ago.",
            "pubDate": "2024-10-18T03:00:17.466737"
        },
        {
            "title": "Zee Ent Q2 Results: Cons profit surges 70% YoY to Rs 209 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zee-ent-q2-results-cons-profit-rises-70-yoy-to-rs-209-crore/articleshow/114346378.cms",
            "description": "Zee Entertainment Enterprises saw a 70% year-on-year growth in consolidated net profit to Rs 209 crore for the quarter ended September 2024. Total income fell 19% YoY to Rs 2,034 crore. Domestic advertising revenue declined 9% YoY. Subscription revenues grew 9% YoY. ZEE shares traded 5.5% higher at Rs 132.73 on NSE.",
            "pubDate": "2024-10-18T11:22:07.223929"
        },
        {
            "title": "Hindustan Zinc Q2 Results: Cons PAT jumps 35% YoY to Rs 2,327 crore, revenue up 21%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindustan-zinc-q2-results-cons-pat-jumps-34-6-yoy-to-rs-2327-crore-revenue-up-21/articleshow/114345828.cms",
            "description": "Hindustan Zinc Q2 Results: Vedanta promoted Hindustan Zinc on Friday reported a 35% jump in its September quarter consolidated net profit at Rs 2,327 crore versus Rs 1,729 crore posted by the company in the year ago period.",
            "pubDate": "2024-10-18T11:22:07.224051"
        },
        {
            "title": "Tech Mahindra Q2 results preview: One-time gain may drive PAT higher by 100%; revenue growth muted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q2-results-preview-one-time-gain-may-drive-pat-higher-by-100-revenue-growth-muted/articleshow/114336144.cms",
            "description": "Tech Mahindra's Q2 revenue growth is expected to be muted with only a 2% year-on-year rise. However, a one-time gain from a land sale is anticipated to double net profit. Margins are forecasted to improve slightly due to cost-control measures.",
            "pubDate": "2024-10-18T11:22:07.224160"
        },
        {
            "title": "HDFC Bank Q2 results preview: PAT may rise 2% YoY; margins to be stable",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q2-results-preview-pat-may-rise-2-yoy-margins-to-be-stable/articleshow/114335948.cms",
            "description": "HDFC Bank's net profit for the September quarter is anticipated to rise by 2% year-on-year. Net interest income may jump 11%. Investors will watch the management's comments on deposit growth and credit progression. The bank's gross advances and CASA deposits saw moderate growth in the same period.",
            "pubDate": "2024-10-18T11:22:07.224255"
        },
        {
            "title": "Zee Entertainment Enterprises to announce Q2FY25 earnings today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zee-entertainment-enterprises-to-announce-q2fy25-earnings-today-heres-what-to-expect/articleshow/114335864.cms",
            "description": "Zee Entertainment Enterprises (ZEEL) is set to announce its Q2FY25 earnings, with expected revenue at Rs 2,059 crore, marking a 16% YoY decline. Core net profit is anticipated at Rs 153 crore, an 18% increase YoY. EBITDA is projected to decline by 21% YoY to Rs 264 crore.",
            "pubDate": "2024-10-18T11:22:07.224355"
        },
        {
            "title": "Tata Consumer Q2 Results: Cons PAT jumps 8% YoY to Rs 364 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-q2-results-cons-pat-jumps-8-yoy-to-rs-364-crore-beats-estimates/articleshow/114350232.cms",
            "description": "Tata Consumer Q2 Results: The profit after tax was above ET Now poll estimates of Rs 314 crore. The company reported quarterly revenue of Rs 4,214 crore, a 13% increase from Rs 3,734 crore in the same period last year. The India Beverages segment grew 3%, despite a 4% decline in tea volumes, while India Foods revenue rose 28% (9% organic). Overall volume growth was 1%.",
            "pubDate": "2024-10-18T11:45:43.223870"
        }
    ]
}