{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-02T15:44:12.094065",
    "items": [
        {
            "title": "Avenue Supermarts Q3 Updates: Standalone revenue jumps 13% YoY to Rs 17,613 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dmart-operator-avenue-supermarts-q3-updates-standalone-revenue-jumps-13-yoy-to-rs-17613-crore/articleshow/126307154.cms",
            "description": "Avenue Supermarts, operator of DMart, posted a 13% YoY increase in standalone Q3 revenue to Rs 17,613 crore, while its store count rose to 442. The provisional update reflects steady growth momentum for the retail chain, supported by continued expansion and consistent improvement in revenue across its operations.",
            "pubDate": "2026-01-02T13:47:34.468167"
        },
        {
            "title": "PNB Q3 updates: Global business grows 9.6% YoY to Rs 28.92 lakh crore, advances jump 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-q3-updates-global-business-grows-9-6-yoy-to-rs-28-92-lakh-crore-advances-jump-11/articleshow/126307077.cms",
            "description": "PNB reported a steady Q3 update with global business rising 9.6% YoY to Rs 28.92 lakh crore and advances growing 11%. Deposits saw healthy expansion, while domestic business improved 9% YoY. The bank’s shares gained over 1% as it continued to trade above key moving averages, reflecting strong investor interest.",
            "pubDate": "2026-01-02T13:47:34.468299"
        },
        {
            "title": "Marico Q3 Update: Revenue growth in high twenties; India volumes edge higher",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/marico-q3-update-revenue-growth-in-high-twenties-india-volumes-edge-higher/articleshow/126305994.cms",
            "description": "Marico delivered a steady Q3 performance with revenue growth in the high twenties and improving India volumes. Lower copra costs aided margins, while Parachute remained resilient and value-added hair oils grew strongly. International markets posted double-digit growth. Marico expects sustained volume-led expansion and sequential margin improvement in the coming quarters.",
            "pubDate": "2026-01-02T13:47:34.468423"
        },
        {
            "title": "Cupid Q3 update: Company expects December quarter to be best-ever, guides for over Rs 335 cr FY26 revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/company-expects-december-quarter-to-be-best-ever-guides-for-over-rs-335-cr-fy26-revenue/articleshow/126308694.cms",
            "description": "Cupid expects Q3 FY26 to be its best-ever quarter, driven by strong demand and smooth execution. The company said its order book is at a record high and expressed confidence in surpassing its FY26 revenue and profit guidance. Capacity expansion and new FMCG products are also progressing as planned.",
            "pubDate": "2026-01-02T15:44:11.423664"
        }
    ]
}