{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-18T14:10:29.570297",
    "items": [
        {
            "title": "IFB Industries,  PG Electroplast, Voltas and other  consumer durable  shares rally up to  20% on  GST cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ifb-industries-pg-electroplast-voltas-and-other-consumer-durable-shares-rally-up-to-20-on-gst-cut-hopes/articleshow/123357740.cms",
            "description": "Consumer durable shares rallied on Monday as hopes of a GST cut ahead of Diwali lifted sentiment. IFB Industries surged 20% to Rs 1,538.75, PG Electroplast rose 13.6%, Voltas 10%, Amber Enterprises 8.7%, and Blue Star 8.7%, driving sector-wide gains.",
            "pubDate": "2025-08-18T06:38:49.664225"
        },
        {
            "title": "Bajaj Finance, Bajaj Housing Finance shares rally up to 7% on GST reform hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-bajaj-housing-finance-shares-rally-up-to-7-on-gst-reform-hopes/articleshow/123357143.cms",
            "description": "Shares of Bajaj Finance and Bajaj Housing Finance surged up to 7% on GST cut hopes and India’s sovereign credit rating upgrade. Lower consumer durables taxes and reduced borrowing costs are expected to boost lending, supporting broader financial sector gains ahead of Diwali.",
            "pubDate": "2025-08-18T06:38:49.664357"
        },
        {
            "title": "HDFC MMC, Neuland Laboratories among 8 stocks that rose above VWAP on August 14",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-mmc-neuland-laboratories-among-8-stocks-that-rose-above-vwap-on-august-14/slideshow/123356635.cms",
            "description": "On August 14, the closing prices of right stocks in the Nifty500 pack rallied over 0.5% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-18T06:38:49.664472"
        },
        {
            "title": "GST Reforms 2.0: Full list of over 40 stocks that can benefit from PM Modi's Diwali promise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-reforms-2-0-full-list-of-over-40-stocks-that-can-benefit-from-pm-modis-diwali-promise/articleshow/123356845.cms",
            "description": "As PM Narendra Modi plans GST structure changes by Diwali, Dalal Street sees potential winners across sectors like auto, financial, real estate, consumer, and cement stocks. The GST reforms aim to reduce retail prices. Two-wheelers and small cars may benefit. Cement sector could see revenue boost. Banks may gain from increased consumption. Over 40 stocks are identified as potential beneficiaries.",
            "pubDate": "2025-08-18T06:38:49.664573"
        },
        {
            "title": "Easy Trip Planners shares slide 4% as Q1 PAT drops 99% YoY to Rs 0.44 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/easy-trip-planners-shares-slide-4-as-q1-pat-drops-99-yoy-to-rs-0-44-cr/articleshow/123356168.cms",
            "description": "Easy Trip Planners shares: Revenue from operations came in at ₹113.79 crore in Q1FY26, down from ₹152.6 crore in the same quarter last year. Adjusted total income, including other income, slipped to ₹166.24 crore from ₹208.16 crore a year earlier.",
            "pubDate": "2025-08-18T06:38:49.664672"
        },
        {
            "title": "Knowledge Realty Trust REIT shares list at 4% premium over issue price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/knowledge-realty-trust-reit-shares-list-at-4-premium-over-issue-price/articleshow/123355681.cms",
            "description": "Knowledge Realty Trust REIT launched on the stock exchanges with a 4% increase. The IPO was subscribed 12.48 times. It raised Rs 1,620 crore from anchor investors. The funds will repay borrowings. Knowledge Realty Trust REIT manages 30 office assets across six cities. Its occupancy is 91.4%. The REIT reported total income of Rs 4,146.86 crore.",
            "pubDate": "2025-08-18T06:38:49.664882"
        },
        {
            "title": "Hero Moto, Maruti, Tata Motors and other auto stocks jump up to 8%. How a GST rate cut may impact them",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-maruti-other-auto-stocks-jump-up-to-8-how-gst-rate-cut-may-impact-them/articleshow/123355657.cms",
            "description": "Shares of auto companies like Tata Motors, Hero MotoCorp and Maruti Suzuki rose sharply. This is due to anticipation of a GST rate reduction. The current 28% tax on two-wheelers may fall to 18%. Small cars and commercial vehicles could also see lower taxes. Analysts believe Prime Minister Modi's GST simplification plans will boost consumption. A simplified two-slab GST system is expected.",
            "pubDate": "2025-08-18T06:38:49.664984"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Devyani International, Jindal Steel among 5 stocks that could give 12-32% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-devyani-international-jindal-steel-among-5-stocks-that-could-give-12-32-return/slideshow/123355598.cms",
            "description": "Brokerages have expressed a bullish outlook on a diverse set of stocks spanning quick-service restaurants, metals, healthcare, and automobiles, projecting healthy upsides based on growth prospects and strong fundamentals.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-18T06:38:49.665083"
        },
        {
            "title": "Indian auto shares at 10-month high after media report on small car tax cut proposal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-auto-shares-at-10-month-high-after-media-report-on-small-car-tax-cut-proposal/articleshow/123355491.cms",
            "description": "Indian auto stocks saw a significant surge. They jumped 4% reaching a 10-month high. This followed reports of a proposed GST reduction on small cars. The auto sector emerged as the top gainer on the Nifty 50. Hero MotoCorp and Maruti Suzuki experienced notable gains. All fifteen stocks on the auto index increased.",
            "pubDate": "2025-08-18T06:38:49.665178"
        },
        {
            "title": "Rs 3,100 crore mutual fund battle: Why MFs are ditching Zomato for Swiggy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-3100-crore-mutual-fund-battle-why-mfs-are-ditching-zomato-for-swiggy/articleshow/123355475.cms",
            "description": "Zomato Vs Swiggy: Mutual funds exhibited contrasting strategies in July, divesting approximately ₹1,700 crore worth of Eternal shares amidst a 17% surge, while simultaneously investing ₹1,400 crore in Swiggy, whose shares have declined 26% year-to-date.",
            "pubDate": "2025-08-18T06:38:49.665268"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/123355331.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-08-18T06:38:49.665358"
        },
        {
            "title": "Why market is rising today? Sensex soars 1,100 pts, Nifty tops 25K; GST reforms among 5 key factors behind today's surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-market-is-rising-today-sensex-soars-over-1000-pts-nifty-above-24950-gst-reforms-among-top-factors-behind-todays-surge/articleshow/123355107.cms",
            "description": "Stock Market Today: Indian benchmark indices surged at the opening bell on Monday, fueled by receding anxieties regarding Russian oil supplies after discussions between U.S. and Russian leaders. Positive sentiment also stemmed from optimism surrounding New Delhi's suggested goods and services tax revisions. The BSE Sensex soared by 1.17%, while the NSE Nifty 50 climbed 1.24% at the start of trading.",
            "pubDate": "2025-08-18T06:38:49.665450"
        },
        {
            "title": "Tata Steel, JSW Steel other steelmakers' shares jump up to 3% as safeguard duty decision clears overhang",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-jsw-steel-other-steelmakers-in-focus-as-safeguard-duty-decision-clears-overhang/articleshow/123355063.cms",
            "description": "Indian steelmakers like Tata Steel and JSW Steel saw their stocks rise after the DGTR recommended a safeguard duty on steel imports for three years. This move aims to protect domestic producers from a surge in imports, particularly from China, Korea, Japan, Vietnam, and Nepal.",
            "pubDate": "2025-08-18T06:38:49.665541"
        },
        {
            "title": "Swiggy shares jump 3% after company hikes platform fees to Rs 14",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-in-focus-after-company-hikes-platform-fees-to-rs-14/articleshow/123355021.cms",
            "description": "Swiggy's shares experienced a surge on Monday following an increase in its platform fee to Rs 14 in high-demand areas, aiming to mitigate widening losses. Despite a doubled net loss of Rs 1,197 crore in Q2, operating revenue rose 54% to Rs 4,961 crore. Intensifying competition from new entrants like Rapido's Ownly, offering lower commission rates, adds pressure.",
            "pubDate": "2025-08-18T06:38:49.665637"
        },
        {
            "title": "Inox Wind, Tata Steel, DRL among 10 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-tata-steel-drl-among-10-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/123354964.cms",
            "description": "As of August 14, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 6% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.\"",
            "pubDate": "2025-08-18T06:38:49.665732"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/123366805.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-08-18T14:10:16.008207"
        },
        {
            "title": "US stocks open flat, focus on retail earnings and Jackson Hole summit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-flat-focus-on-retail-earnings-and-jackson-hole-summit/articleshow/123366620.cms",
            "description": "Wall Street's major indexes displayed a subdued performance at the opening bell on Monday, marking a calm commencement to a week filled with significant corporate earnings releases from prominent retailers. Investors are also keenly awaiting insights from the Federal Reserve's highly anticipated annual symposium in Jackson Hole.",
            "pubDate": "2025-08-18T14:10:16.008328"
        },
        {
            "title": "10 midcap companies show consistent decline in debt-to-equity ratio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-midcap-companies-show-consistent-decline-in-debt-to-equity-ratio/slideshow/123366141.cms",
            "description": "",
            "pubDate": "2025-08-18T14:10:16.008425"
        },
        {
            "title": "Gainers & Losers: Maruti Suzuki among 5 major movers on Monday. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-maruti-suzuki-godfrey-phillips-among-5-major-movers-on-monday-heres-why/slideshow/123365705.cms",
            "description": "",
            "pubDate": "2025-08-18T14:10:16.008610"
        },
        {
            "title": "Maruti Suzuki, M&M, among 11 stocks that hit 52-week high; rally up to 30% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-mampm-among-11-stocks-that-hit-52-week-high-rally-up-to-30-in-a-month/slideshow/123365449.cms",
            "description": "On Monday, the benchmark Sensex surged by approximately 676 points, closing at 81,273. Boosted by a broader market rally, 11 stocks from the BSE Consumer Discretionary index hit their 52-week highs — marking their highest levels in a year. These breakouts are typically viewed by traders and investors as bullish signals, reflecting strong upward momentum and the potential for further gains.",
            "pubDate": "2025-08-18T14:10:16.008705"
        },
        {
            "title": "Stock Radar: From consolidation to breakout! Here’s what makes Hero MotoCorp an interesting buy at current levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-from-consolidation-to-breakout-heres-what-makes-hero-motocorp-an-interesting-buy-at-current-levels/articleshow/123304271.cms",
            "description": "Hero MotoCorp, after rebounding from its long-term moving average in early August 2025, presents a buying opportunity for medium-term traders. Experts suggest a target price of Rs 5,600 within 4-5 months, citing the stock's financial strength and undervalued status. Technical indicators point towards a bullish trend, supported by a breakout from a three-month trading range.",
            "pubDate": "2025-08-18T14:10:16.008915"
        },
        {
            "title": "Why FIIs selling Indian stocks is not wrong:  Helios Capital's Samir Arora explains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-fiis-selling-indian-stocks-is-not-wrong-helios-capitals-samir-arora-explains/articleshow/123363667.cms",
            "description": "FIIs sold Indian equities worth ₹1.16 lakh crore in 2025, but Helios Capital Management's founder  & fund manager Samir Arora calls it marginal rebalancing. Arora stressed FIIs’ $750 billion India exposure and IPO/QIP investments reflect confidence despite near-term market underperformance and global trade concerns. He said that there is nothing wrong with the FII/FPI selling.",
            "pubDate": "2025-08-18T14:10:16.009004"
        },
        {
            "title": "Sebi defers deadline for implementation of margin obligations via pledge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-extends-deadline-for-implementation-of-margin-obligations-process-by-way-of-pledge-to-oct-10/articleshow/123363595.cms",
            "description": "Markets regulator Sebi on Monday extended the deadline for the implementation of framework pertaining to the process of margin obligations via pledge and re-pledge within the depository system to October 10.",
            "pubDate": "2025-08-18T14:10:16.009097"
        },
        {
            "title": "Zerodha co-founder Nikhil Kamath invests Rs 137.5 crore in Surat-based Goldi Solar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-co-founder-nikhil-kamath-invests-rs-137-5-crore-in-surat-based-goldi-solar/articleshow/123362858.cms",
            "description": "Zerodha co-founder Nikhil Kamath has invested Rs 137.5 crore in Goldi Solar to expand production and strengthen its global renewable energy presence. Goldi Solar, India’s largest solar module manufacturer, has increased capacity from 3 GW to 14.7 GW and is venturing into solar cell manufacturing, aligning with India’s clean energy goals.",
            "pubDate": "2025-08-18T14:10:16.009187"
        },
        {
            "title": "Cement stocks on a strong footing in FY26; GST cut could cement further gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cement-stocks-on-a-strong-footing-in-fy26-gst-cut-could-cement-further-gains/articleshow/123361459.cms",
            "description": "Cement stocks surged in FY26, led by Nuvoco Vistas, JK Cement, and Star Cement, amid GST cut hopes. Strong Q1 FY26 profits highlighted sector resilience, efficiency gains, and investor confidence despite muted performance from large-cap peers.",
            "pubDate": "2025-08-18T14:10:16.009283"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 20% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-20-in-1-year/articleshow/123361218.cms",
            "description": "The street is rejoicing over the expected GST rate cut. But there is another side to the story: Will the rationalization lead to a decline in the overall GST collection? This is critical as it is government spending that has powered the economic engine for the last many years, including infrastructure like railways, roads, and ports. So, the economy can ill afford any cut in this spending. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-08-18T14:10:16.009372"
        },
        {
            "title": "10+ MFs added these 11 stocks in July 2025. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-mfs-added-these-11-stocks-in-july-2025-do-you-own-any/slideshow/123361587.cms",
            "description": "Mutual funds reaffirmed their strong confidence in Indian equities, recording net investments of around Rs 47,000 crore in July 2025. As per ETMarkets analysis, 41 stocks were added to the portfolios of more than 10 mutual fund schemes — a rise from the previous month. Among these, we’ve spotlighted 11 stocks that not only saw buying interest from over 10 MFs but also delivered robust returns, surging between 25% and 85% in the first four and a half months of FY26. (Data Source: ACE Equity, ACE MF)",
            "pubDate": "2025-08-18T14:10:16.009466"
        },
        {
            "title": "Goldman Sachs expands Mumbai presence with new office",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-expands-mumbai-presence-with-new-office/articleshow/123361069.cms",
            "description": "Goldman Sachs opened a new, larger office in Mumbai’s Worli, marking its long-term commitment to India. The facility emphasizes innovation, collaboration, and growth as the bank strengthens its presence in the world’s fourth-largest economy.",
            "pubDate": "2025-08-18T14:10:16.009550"
        },
        {
            "title": "Japan's Nikkei ends at record high as automakers rise on weaker yen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-record-high-as-automakers-rise-on-weaker-yen/articleshow/123360034.cms",
            "description": "Japan's Nikkei share average extended its gains from last week to end at a record high on Monday, as a weaker yen pushed automakers' stocks higher.",
            "pubDate": "2025-08-18T14:10:16.009635"
        }
    ]
}