{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-14T05:51:10.499124",
    "items": [
        {
            "title": "FII activity, India-US trade deal among 5 key cues that could set the tone for D-St this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-activity-india-us-trade-deal-among-5-key-cues-that-could-set-the-tone-for-d-st-this-week/articleshow/125957193.cms",
            "description": "Key factors will shape the stock market this week. Domestic data releases like WPI inflation and trade balance are expected. Progress on the India-US trade deal is also a focus. Technical indicators suggest Nifty needs to hold support levels. FII selling continues, while DII buying provides some stability. Currency movements will also be watched closely.",
            "pubDate": "2025-12-14T04:22:39.941193"
        },
        {
            "title": "Fresh delivery: Swiggy raises Rs 10,000 cr via QIP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fresh-delivery-swiggy-raises-10kcr-via-qip/articleshow/125957160.cms",
            "description": "In a significant step towards enhancing its market position, food delivery giant Swiggy has raised Rs 10,000 crore through a savvy institutional placement. This capital injection is poised to strengthen its fundamental operations and propel the growth trajectory of Instamart, its rapid commerce division.",
            "pubDate": "2025-12-14T04:22:39.941302"
        },
        {
            "title": "10 Nifty500 stocks with upside potential of up to 50%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-nifty500-stocks-with-upside-potential-of-up-to-50-do-you-own-any/slideshow/125958050.cms",
            "description": "Analyst forecasts go beyond mere numbers; they offer a strategic lens into future market potential. For investors on the lookout for the next breakout opportunity, certain Nifty500 stocks stand out as compelling picks. Consensus estimates from Trendlyne indicate that many Nifty500 stocks have the potential to deliver significant returns over the coming 12 months.",
            "pubDate": "2025-12-14T05:51:06.540263"
        },
        {
            "title": "Corona Remedies and Wakefit Innovations to list tomorrow; GMP suggests sharp upside for pharma play",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corona-remedies-and-wakefit-innovations-to-list-tomorrow-gmp-suggests-sharp-upside-for-pharma-play/articleshow/125957953.cms",
            "description": "Corona Remedies and Wakefit Innovations are set to list amid divergent grey market signals. Corona Remedies commands strong listing expectations backed by robust subscriptions and profitability, while Wakefit’s muted GMP reflects cautious sentiment towards consumer-facing growth businesses, highlighting current investor preference for earnings visibility and consistency.",
            "pubDate": "2025-12-14T05:51:06.540385"
        },
        {
            "title": "India’s wealth creation hits record Rs 148 trillion. Who led and what to learn?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-wealth-creation-hits-record-rs-148-trillion-who-led-and-what-to-learn/slideshow/125957921.cms",
            "description": "The Motilal Oswal 30th Annual Wealth Creation Study (2020–2025) analyses the top 100 companies in India that have created the most wealth for investors over the last five years. Wealth creation is measured by the increase in market capitalisation, adjusted for corporate actions such as mergers, demergers, buybacks, capital issuance, and dividends.",
            "pubDate": "2025-12-14T05:51:06.540488"
        },
        {
            "title": "10 penny stocks rally up to 515% in FY26 so far, 6 turn multibaggers — Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-penny-stocks-rally-up-to-515-in-fy26-so-far-6-turn-multibaggers-do-you-own-any/slideshow/125957683.cms",
            "description": "So far in FY26, 10 penny stocks have risen sharply, delivering returns ranging from 25% to 515%. Notably, six of these have turned into multibaggers. These standout performers were selected based on specific criteria: market capitalisation below Rs 1,000 crore, share price under Rs 20, and minimum recent trading volume of 5 lakh shares. This strategy focuses on identifying low-priced, actively traded micro-cap stocks demonstrating strong upward momentum. (Data Source: ACE Equity).Penny stocks often attract attention due to their low entry price and the potential for explosive growth. But while the rewards can be impressive, the risks are equally high. These stocks typically carry low liquidity, high volatility, and limited financial transparency. Investors should proceed with caution —success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2025-12-14T05:51:06.540611"
        },
        {
            "title": "Axis Securities names Vedanta among top 3 technical picks, sees up to 11% upside in 3–4 weeks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-names-vedanta-among-top-3-technical-picks-sees-up-to-11-upside-in-34-weeks/slideshow/125957418.cms",
            "description": "Markets remained volatile and ended the week in negative territory, weighed down by a mix of domestic and global cues. Throughout most of the week, investor sentiment stayed subdued and weakened further as selling pressure intensified. However, a late rebound in the final trading sessions helped contain the overall downside.Despite this marginal recovery, the overall tone remained cautious. Persistent foreign fund outflows and a sharp depreciation in the rupee significantly impacted investor confidence. Against this backdrop, technical analysts at Axis Securities have identified a few stocks that could offer potential trading opportunities based on chart patterns and momentum indicators, for a holding period of 3-4 weeks:",
            "pubDate": "2025-12-14T05:51:06.540713"
        }
    ]
}