{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-31T05:46:56.228369",
    "items": [
        {
            "title": "Navin Fluorine shares soar 15% to record high as Q2 net profit rockets 152% to Rs 148 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/navin-fluorine-shares-soar-15-to-record-high-as-q2-net-profit-rockets-152-to-rs-148-crore/articleshow/124984323.cms",
            "description": "Navin Fluorine’s shares surged up to 15% to a record Rs 5,729 after the company reported strong Q2FY26 results. Net profit jumped 152% to Rs 148 crore, while revenue rose 46% to Rs 758 crore. Robust margins, solid segmental growth, and fresh capex plans further strengthened investor confidence.",
            "pubDate": "2025-10-31T04:59:21.833118"
        },
        {
            "title": "Tata Investment Corp shares slide nearly 25% since stock split. Right time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corp-shares-slide-nearly-25-since-stock-split-right-time-to-buy/articleshow/124984118.cms",
            "description": "Tata Investment Corporation shares have fallen nearly 25% post-split, amid profit-booking and growing unease over the Tata Group's leadership turmoil. Technical experts suggest the stock is in a cooling-off phase, with Rs 760 being a crucial support level. The group's internal disputes and operational challenges are weighing on investor sentiment.",
            "pubDate": "2025-10-31T04:59:21.833248"
        },
        {
            "title": "S&P 500’s path to 7,000 boosted by derivative flows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500s-path-to-7000-boosted-by-derivative-flows/slideshow/124984279.cms",
            "description": "A wave of bullish options trading has turbocharged the U.S. stock market’s rally, propelling the S&P 500 close to the 7,000 mark after gaining 17% so far this year. Traders have shown strong appetite for call options, pushing the one-month rolling calls-to-puts ratio to its most optimistic level in nearly four years. This surge in demand highlights the growing confidence among investors betting on continued market strength. (Source: Reuters)",
            "pubDate": "2025-10-31T04:59:21.833370"
        },
        {
            "title": "Rubicon Research shares can rally 22%, says Motilal Oswal after initiating with ‘Buy’ rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rubicon-research-shares-can-rally-22-says-motilal-oswal-after-initiating-with-buy-rating/articleshow/124983622.cms",
            "description": "Shares of Rubicon Research rose up to 3% on October 31 after Motilal Oswal initiated coverage with a ‘Buy’ rating and a target price of Rs 740, implying a 22% upside. The brokerage highlighted Rubicon’s strong R&D-led growth, expanding US portfolio, and 43% earnings CAGR outlook, citing its efficient product launches and premium valuation potential.",
            "pubDate": "2025-10-31T04:59:21.833481"
        },
        {
            "title": "Nifty’s 10-year November seasonality split even, but FIIs & DIIs paint a brighter picture",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niftys-10-year-november-seasonality-split-even-but-fiis-diis-paint-a-brighter-picture/articleshow/124983496.cms",
            "description": "November's market performance for Nifty is historically split.  Foreign investors bought in 60% of past Novembers, while domestic investors showed stronger buying in 70% of instances.  This year, domestic investors are a key stabiliser.  Looking ahead, Nifty is expected to end positively in November 2025, building on October's gains.  However, some caution exists regarding near-term sentiment and rollover trends.",
            "pubDate": "2025-10-31T04:59:21.833580"
        },
        {
            "title": "China’s factory slump deepens as PMI falls to six-month low",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-factory-slump-deepens-as-pmi-falls-to-six-month-low/slideshow/124983618.cms",
            "description": "China’s manufacturing sector remained under pressure in October, with the official PMI slipping to 49.0 from 49.8 a month earlier — marking the seventh straight month of contraction. The non-manufacturing PMI, which tracks services and construction, edged up slightly to 50.1, indicating only marginal expansion. Weak domestic demand and a struggling property sector continue to weigh on overall economic momentum. (Source: Reuters)",
            "pubDate": "2025-10-31T04:59:21.833683"
        },
        {
            "title": "NLC India, PB Fintech among 6 stocks closed above VWAP, signalling bullish shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nlc-india-pb-fintech-among-6-stocks-closed-above-vwap-signalling-bullish-shift/slideshow/124983356.cms",
            "description": "On October 30, the closing prices of six stocks in the Nifty500 pack rallied by more than 1% relative to their VWAP (Volume Weighted Average Price), and a move above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it indicates the closing price is higher than the average price at which it traded throughout the day, with the average weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-10-31T04:59:21.833783"
        },
        {
            "title": "Sensex, Nifty flat as foreign outflows cap rally near record highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-flat-as-foreign-outflows-cap-rally-near-record-highs/articleshow/124983173.cms",
            "description": "Indian stocks opened with a muted tone on Friday, with the Sensex and Nifty experiencing minor fluctuations. The domestic rally lost some steam as foreign investors resumed selling, though strong corporate earnings and easing global trade tensions provided some support.",
            "pubDate": "2025-10-31T04:59:21.833882"
        },
        {
            "title": "NTPC shares drop 3% as Q2 net profit declines 4% YoY, but Morgan Stanley cites steady core growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-shares-in-focus-as-q2-profit-declines-4-yoy-but-morgan-stanley-cites-steady-core-growth/articleshow/124982926.cms",
            "description": "NTPC's stock saw a dip following a profit decline for the September quarter. Despite this, Morgan Stanley remains positive on the company's outlook. Revenue saw a slight increase. NTPC announced an interim dividend. The company's capacity expanded, driven by renewable energy growth. Capital expenditure remains robust, indicating continued investment.",
            "pubDate": "2025-10-31T04:59:21.833979"
        },
        {
            "title": "Dr. Reddy's Labs, LIC Housing Finance among 7 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-labs-lic-housing-finance-among-7-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124982848.cms",
            "description": "As of October 30, there was a notable surge in futures open interest for seven stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% compared to the previous session. A significant uptick in futures open interest indicates substantial growth in the number of active, unexpired futures contracts for a specific security. This uptrend reflects a rise in market participants either initiating new positions or expanding their existing ones within the futures market.",
            "pubDate": "2025-10-31T04:59:21.834075"
        },
        {
            "title": "Dabur India shares slide 2% after Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dabur-india-shares-in-focus-as-q2-profit-rises-6-5-yoy-should-you-buy-sell-or-hold/articleshow/124982667.cms",
            "description": "Dabur India's shares dipped after the release of Q2FY26 results, even as net profit climbed 6.5% compared to last year. Revenue growth was promising, supported by robust performance across multiple categories and expansion in its international sector. Alongside, the company confirmed an interim dividend payout.",
            "pubDate": "2025-10-31T04:59:21.834171"
        },
        {
            "title": "Buy, Sell or Hold: Motilal Oswal initiates buy on Rubicon Research; Morgan Stanley recommends overweight on Aditya Birla Capital",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-motilal-oswal-initiates-buy-on-rubicon-research-morgan-stanley-recommends-overweight-on-aditya-birla-capital/articleshow/124982589.cms",
            "description": "Motilal Oswal, Goldman Sachs, and Morgan Stanley remain positive on Rubicon Research, ITC, and Aditya Birla Capital, citing strong execution, margin recovery, and robust earnings growth prospects heading into FY26.",
            "pubDate": "2025-10-31T04:59:21.834264"
        },
        {
            "title": "Hyundai Motor India shares in focus as Q2 PAT jumps 14%; revenue flat. What are analysts saying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-shares-in-focus-as-q2-pat-jumps-14-revenue-flat-what-are-analysts-saying/articleshow/124982521.cms",
            "description": "Hyundai Motor India reported a 14% year-on-year rise in consolidated net profit to Rs 1,572 crore for the September quarter of FY26, while revenue from operations inched up 1.2% to Rs 17,460.82 crore. The company’s performance was supported by strong festive demand, SUV sales, and continued cost optimisation measures, boosting investor sentiment ahead of Friday’s trade.",
            "pubDate": "2025-10-31T04:59:21.834371"
        },
        {
            "title": "Bharat Electronics shares in focus as Navratna firm secures Rs 732 crore in fresh defence orders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-electronics-shares-in-focus-as-navratna-firm-secures-rs-732-crore-in-fresh-defence-orders/articleshow/124982378.cms",
            "description": "Bharat Electronics Ltd (BEL) announced fresh orders worth Rs 732 crore, expanding its strong order book and reinforcing its role in India’s defence manufacturing push. The new contracts cover advanced systems such as software-defined radios, missile components, and cybersecurity solutions. BEL expects additional orders worth Rs 27,000 crore this fiscal, potentially taking total inflows beyond Rs 50,000 crore in FY26.",
            "pubDate": "2025-10-31T04:59:21.834470"
        },
        {
            "title": "Swiggy shares jump 4% after Morgan Stanley reiterates ‘overweight’ call despite Rs 1,092 crore Q2 loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-in-focus-as-net-loss-widens-to-rs-1092-crore-in-q2-should-you-invest/articleshow/124982219.cms",
            "description": "Swiggy share price: Swiggy shares saw a 4% jump to Rs 434.50 on Friday. This rise followed Morgan Stanley's 'Overweight' rating. The food delivery company reported a net loss of Rs 1,092 crore for the September quarter. Revenue from operations increased by 54% year-on-year. The quick-commerce segment showed strong growth. Swiggy also plans to raise up to Rs 10,000 crore.",
            "pubDate": "2025-10-31T04:59:21.834563"
        },
        {
            "title": "AB Capital and 3 other stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ab-capital-and-3-other-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/124981608.cms",
            "description": "On October 30, within the Nifty500 pack, four stocks appeared on the bullish White Marubozu scanner, according to technical scan data from StockEdge.com.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest point of the period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it signals strong buying pressure throughout the session. Traders interpret it as an indication that buyers remained in control from open to close, often using such patterns to make informed decisions about potential future price movements.",
            "pubDate": "2025-10-31T04:59:21.834660"
        },
        {
            "title": "Sebi caps weights in Bank Nifty, tightens index rules to broaden representation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-caps-weights-in-bank-nifty-tightens-index-rules-to-broaden-representation/articleshow/124985621.cms",
            "description": "SEBI has capped the weight of top stocks in non-benchmark indices like Bank Nifty, limiting a single stock’s weight to 20% and the top three to 45%. The move aims to reduce concentration risk and enhance market representation.",
            "pubDate": "2025-10-31T05:46:53.124622"
        },
        {
            "title": "United Spirits shares rally 7%  as Q2 net profit surges 36% to Rs 464 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/united-spirits-shares-rally-7-as-q2-net-profit-surges-36-to-rs-464-crore/articleshow/124985298.cms",
            "description": "United Spirits shares jumped 7% to ₹1,488 after the company reported a strong Q2 FY26 performance, with net profit rising 36% to ₹464 crore and revenue up 8% to ₹7,199 crore year-on-year.",
            "pubDate": "2025-10-31T05:46:53.124745"
        },
        {
            "title": "Pause, Cut or Hike? The central bank playbook after the Fed’s move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pause-cut-or-hike-the-central-bank-playbook-after-the-feds-move/slideshow/124984990.cms",
            "description": "The U.S. Federal Reserve has realigned with its global peers after cutting interest rates by 25 basis points. However, the Fed signalled caution against further aggressive easing, citing uncertainty caused by the ongoing Washington shutdown. Meanwhile, the Bank of Japan and the European Central Bank kept rates unchanged, reflecting a broader pause across major economies as policymakers balance inflation control with growth concerns. (Source: Reuters)",
            "pubDate": "2025-10-31T05:46:53.124858"
        },
        {
            "title": "Bandhan Bank shares fall 6% after Q2 PAT plunges 88% YoY to Rs 110 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bandhan-bank-shares-fall-6-after-q2-pat-plunges-88-yoy-to-rs-110-crore/articleshow/124985254.cms",
            "description": "Bandhan Bank shares dropped nearly 6% after the lender reported an 88% year-on-year fall in Q2FY26 profit to Rs 110 crore. Weak net interest income, lower margins, and rising credit costs weighed on earnings, even as advances and deposits grew. Asset quality slightly deteriorated, with GNPA rising to 5% and NIM slipping to 5.8%.",
            "pubDate": "2025-10-31T05:46:53.124960"
        },
        {
            "title": "RIL shares in focus as co seals Google AI partnership, BofA picks up Rs 44 crore stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-as-co-seals-google-ai-partnership-bofa-picks-up-rs-44-crore-stake/articleshow/124985053.cms",
            "description": "Reliance Industries Ltd. announced a significant partnership with Google to boost AI adoption in India, offering eligible Jio users free access to Google's AI Pro plan for 18 months. Reliance Intelligence is now a strategic partner for Google Cloud in India, aiming to enhance AI infrastructure and drive enterprise AI adoption.",
            "pubDate": "2025-10-31T05:46:53.125060"
        }
    ]
}