{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-23T18:58:38.917484",
    "items": [
        {
            "title": "Syngene International reports 11% revenue growth and 59% net profit surge in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/syngene-international-reports-11-revenue-growth-and-59-net-profit-surge-in-q1/articleshow/122864079.cms",
            "description": "Syngene International, a Biocon subsidiary, reveals an 11% revenue increase to Rs 875 crore for the first quarter. Net profit jumps 59% to Rs 87 crore. Growth is attributed to research services and biologics manufacturing. Operations commenced at Unit III in Bengaluru. Preparations advance for the Bayview facility in the US.",
            "pubDate": "2025-07-23T18:58:20.522411"
        },
        {
            "title": "Tata Consumer Products posts 10% jump in Q1 PAT driven by tea, salt sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-products-posts-10-jump-in-q1-pat-driven-by-tea-salt-sales/articleshow/122863625.cms",
            "description": "Tata Consumer Products Limited saw a rise in revenue. The company's revenue stood at Rs 4778.91 crore. Net profit also increased to Rs 346.44 crore. India business showed double-digit growth, driven by tea and salt. Starbucks added six new stores, reaching 485 stores across 80 cities. Revenue growth for Tata Starbucks was 6% during the quarter.",
            "pubDate": "2025-07-23T18:58:20.522539"
        },
        {
            "title": "Bajaj Housing Finance Q1 profit rises 21% to Rs 583 crore, AUM up 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-housing-finance-q1-profit-rises-21-to-rs-583-crore-aum-up-24/articleshow/122862236.cms",
            "description": "Bajaj Housing Finance posted a 21% YoY rise in Q1 net profit to ₹583 crore, with steady margins and healthy asset quality. AUM rose 24% to Rs 1.2 lakh crore despite competitive pricing and real estate demand moderation.",
            "pubDate": "2025-07-23T18:58:20.522661"
        },
        {
            "title": "Tata Consumer Products Q1 Results: Cons PAT rises 15% YoY to Rs 334 crore, revenue grows 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-products-q1-results-cons-pat-rises-15-yoy-to-rs-334-crore-revenue-grows-10/articleshow/122859606.cms",
            "description": "Tata Consumer Products Q1 Results: Tata Consumer Products on Wednesday reported a 15% year-on-year (YoY) growth in its Q1FY26 consolidated net profit at Rs 334 crore versus Rs 290 crore in the year-ago period.",
            "pubDate": "2025-07-23T18:58:20.522768"
        },
        {
            "title": "Tata Teleservices Q1 Results: Net loss rises marginally by 0.5% YoY, revenue down by 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-teleservices-q1-results-net-loss-rises-marginally-by-0-5-yoy-revenue-down-by-12/articleshow/122859459.cms",
            "description": "Tata Teleservices (Maharashtra) posted a net loss of ₹324.98 crore in Q1FY26, with a 12.3% drop in revenue. While expenses fell and margins improved, weak topline impacted overall performance. Shares closed 1.7% higher despite negative yearly returns.",
            "pubDate": "2025-07-23T18:58:20.522878"
        },
        {
            "title": "Infosys Q1 Results: Profit beats estimates, zooms 9% YoY to Rs 6,921 cr; revenue up 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q1-results-profit-beats-estimates-zooms-9-yoy-to-rs-6921-cr-revenue-up-8/videoshow/122859086.cms",
            "description": "India's second largest IT services exporter Infosys reported 9% year-on-year (YoY) growth in its consolidated net profit at Rs 6,921 crore for the first quarter ended June. Revenue from operations rose 8% YoY to Rs 42,279 crore. The Bengaluru-based company has upped its lower end of revenue growth guidance, which is pegged at 1-3% in constant currency for FY26.",
            "pubDate": "2025-07-23T18:58:20.522982"
        },
        {
            "title": "Dr. Reddy's Laboratories Q1 Results: PAT rises 2% YoY to Rs 1,418 crore, revenue jumps 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-laboratories-q1-results-pat-rises-2-yoy-to-rs-1418-crore-revenue-jumps-11/articleshow/122858707.cms",
            "description": "Dr Reddy's Laboratories Q1 Results: Pharma major Dr. Reddy's Laboratories reported a marginal 2% year-on-year (YoY) growth in its consolidated net profit at Rs 1,418 crore for the first quarter ended June. Revenue from operations rose 11% YoY to Rs 8,545 crore.",
            "pubDate": "2025-07-23T18:58:20.523078"
        },
        {
            "title": "Bajaj Housing Finance Q1 Results: Net profit jumps 21% YoY to Rs 583 crore, revenue rises 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-housing-finance-q1-results-net-profit-jumps-21-yoy-to-rs-583-crore-revenue-rises-18/articleshow/122857934.cms",
            "description": "Bajaj Housing Finance reported a 21% YoY increase in net profit, reaching Rs 583 crore for the June quarter, with total revenue from operations rising 18% to Rs 2,616 crore. The company's AUM grew by 24% to Rs 1,20,420 crore. Gross and Net NPAs stood at 0.30% and 0.13% respectively, with a capital adequacy ratio of 26.94%.",
            "pubDate": "2025-07-23T18:58:20.523173"
        },
        {
            "title": "Infosys Q1 Results: Profit rises 9% YoY to Rs 6,921 crore, revenue up 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q1-results-profit-rises-9-yoy-to-rs-6921-crore-revenue-up-8/articleshow/122857195.cms",
            "description": "Infosys Q1 Results: India's second largest IT services exporter Infosys reported 9% year-on-year (YoY) growth in its consolidated net profit at Rs 6,921 crore for the first quarter ended June. Revenue from operations rose 8% YoY to Rs 42,279 crore.",
            "pubDate": "2025-07-23T18:58:20.523269"
        },
        {
            "title": "Westlife Foodworld Q1 Results: Net profit slumps 62% to Rs 1.22 cr, sales at Rs 653 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/westlife-foodworld-q1-results-net-profit-slumps-62-to-rs-1-22-cr-sales-at-rs-653-cr/articleshow/122856780.cms",
            "description": "Westlife Foodworld, operator of McDonald's restaurants in West and South India, on Wednesday reported a decline of 62.5 per cent in its consolidated net profit to Rs 1.22 crore in the June quarter.",
            "pubDate": "2025-07-23T18:58:20.523364"
        },
        {
            "title": "Mahindra Holidays Q1 Results: Co posts higher quarterly profit on strong domestic sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mahindra-holidays-q1-results-co-posts-higher-quarterly-profit-on-strong-domestic-sales/articleshow/122856218.cms",
            "description": "Mahindra Holidays and Resorts India reported a 33.6% surge in first-quarter profit on Wednesday, underpinned by robust domestic sales.",
            "pubDate": "2025-07-23T18:58:20.523453"
        },
        {
            "title": "Bajaj Finance Q1 Results Preview: Up to 20% YoY PAT growth seen, NII may jump up to 24%. 5 other metrics to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finance-q1-results-preview-up-to-19-yoy-pat-growth-seen-nii-may-jump-up-to-24-5-other-metrics-to-track/articleshow/122856092.cms",
            "description": "Bajaj Finance is expected to post steady Q1 numbers, with PAT likely rising up to 19.5% YoY and NII seen jumping up to 24%. Analysts will track AUM growth, asset quality, credit costs, digital progress, margin trends, and FY26 guidance commentary.",
            "pubDate": "2025-07-23T18:58:20.523545"
        },
        {
            "title": "AB Real Estate Q1 Results: Co posts net loss of Rs 27 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ab-real-estate-q1-results-co-posts-net-loss-of-rs-27-crore/articleshow/122855085.cms",
            "description": "Aditya Birla Real Estate Ltd (ABREL) on Wednesday reported a consolidated net loss of Rs 27.08 crore for the first quarter of this fiscal.",
            "pubDate": "2025-07-23T18:58:20.523636"
        },
        {
            "title": "KFC India operator Sapphire posts loss as consumers tighten spending",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kfc-india-operator-sapphire-posts-loss-as-consumers-tighten-spending/articleshow/122855032.cms",
            "description": "Sapphire Foods India, which operates Pizza Hut and KFC restaurants in the country, reported a quarterly loss on Wednesday, as fast-food restaurant chains face stiff competition from local cafes and online kitchens.",
            "pubDate": "2025-07-23T18:58:20.523745"
        },
        {
            "title": "SBI Life Q1FY26 results preview: APE may grow up to 8% YoY, VNB could surge up to 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-life-q1fy26-results-preview-ape-may-grow-up-to-8-yoy-vnb-could-surge-up-to-17/articleshow/122853339.cms",
            "description": "SBI Life is expected to post modest growth in Q1FY26, with APE rising up to 8% and VNB by 2–17% YoY. Margins may contract sequentially. Brokerages advise tracking VNB margin trends, growth commentary, and product mix changes amid seasonal softness and shifting ULIP-group business ratios.",
            "pubDate": "2025-07-23T18:58:20.523839"
        },
        {
            "title": "Nestle Q1 Preview: Muted profit seen despite steady sales growth as RM costs weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-q1-preview-muted-profit-seen-despite-steady-sales-growth-as-rm-costs-weigh/articleshow/122853288.cms",
            "description": "Nestle India is likely to report a flat Q1FY26, with a modest 5–6% revenue rise but a 1% drop in profit due to high input costs and lower other income. Beverages and confectionery may drive growth, while milk and nutrition segments remain sluggish. Analysts expect mixed margin trends and cautious investor sentiment.",
            "pubDate": "2025-07-23T18:58:20.523935"
        }
    ]
}