{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-07T18:27:04.269474",
    "items": [
        {
            "title": "SBI Q1 Results Preview: Mixed PAT growth likely; muted NII seen amid margin pressure. Check these 6 metrics",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-q1-results-preview-mixed-pat-growth-likely-muted-nii-seen-amid-margin-pressure-check-these-6-metrics/articleshow/123165659.cms",
            "description": "SBI’s Q1 FY26 results are expected to show moderate bottom-line growth amid contracting NIMs, higher provisions, and tepid loan growth. Analysts flag margin trends, credit costs, and asset quality as key metrics to track. PAT is estimated between Rs 16,530–19,576 crore.",
            "pubDate": "2025-08-07T11:46:26.315481"
        },
        {
            "title": "Transrail Q1 Results: Net profit more than doubles to Rs 106 cr; order book crosses Rs 14K cr level",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/transrail-q1-results-net-profit-more-than-doubles-to-rs-106-cr-order-book-crosses-rs-14k-cr-level/articleshow/123163308.cms",
            "description": "Transrail Lighting has said its net profit more than doubled to Rs 106 crore in the June quarter of FY26, pushed by higher revenues from core business segments.",
            "pubDate": "2025-08-07T11:46:26.315594"
        },
        {
            "title": "India's Bajaj Electricals Q1 Results: Profit plunges 97% YoY on weak demand, one-time charge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indias-bajaj-electricals-q1-results-profit-plunges-97-yoy-on-weak-demand-one-time-charge/articleshow/123162130.cms",
            "description": "India's Bajaj Electricals reported a 96.8% slump in first-quarter profit on Thursday, hurt by lower demand for its home appliances and a one-off expense.",
            "pubDate": "2025-08-07T11:46:26.315694"
        },
        {
            "title": "Tata Motors Q1 Preview: PAT likely to drop 36% YoY, hurt by JLR and domestic headwinds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-q1-preview-pat-likely-to-drop-36-yoy-hurt-by-jlr-and-domestic-headwinds/articleshow/123159123.cms",
            "description": "Tata Motors is expected to report weak Q1FY26 results, with a sharp YoY drop in PAT and revenue due to sluggish volumes across JLR and domestic segments. Analysts foresee margin pressures from operating leverage, input costs, and forex challenges, while commentary on demand trends and margins will be closely tracked.",
            "pubDate": "2025-08-07T11:46:26.315798"
        },
        {
            "title": "Biocon reports 95% YoY decline in net profit, operating revenue up 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/biocon-reports-95-yoy-decline-in-net-profit-operating-revenue-up-15/articleshow/123170774.cms",
            "description": "Biocon's Q1 net profit declined 95% year-on-year, but on a like-for-like basis, profit after tax increased by 65%. Revenue grew 15% to Rs 3,942 crore, fueled by Biocon Biologics' 18% growth and Syngene's 11% increase. A recent QIP of Rs 4,500 crores will strengthen Biocon's balance sheet and increase its ownership in Biocon Biologics.",
            "pubDate": "2025-08-07T18:26:47.829541"
        },
        {
            "title": "Emcure Pharmaceuticals reports 41% surge in Q1 net profit driven by strong domestic and international growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/emcure-pharmaceuticals-reports-41-surge-in-q1-net-profit-driven-by-strong-domestic-and-international-growth/articleshow/123170733.cms",
            "description": "Emcure Pharmaceuticals reported a strong first quarter with a 41% increase in net profit, reaching Rs 215 crore, and a 16% rise in revenue to Rs 2,101 crore. Growth was fueled by robust domestic and international performance, particularly in the rest of the world and Canada.",
            "pubDate": "2025-08-07T18:26:47.829680"
        },
        {
            "title": "Signature Global reports 386% year-on-year increase in Q1 profit after tax",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/signature-global-reports-386-year-on-year-increase-in-q1-profit-after-tax/articleshow/123170676.cms",
            "description": "Signature Global's Q1 FY26 profit surged by 386% to Rs 34 crore, fueled by a 118% revenue increase to Rs 870 crore due to higher project completions. While pre-sales dipped slightly, average sales realization improved significantly. The company acquired land for further development and maintains a strong project pipeline for future growth.",
            "pubDate": "2025-08-07T18:26:47.829796"
        },
        {
            "title": "Grasim Industries Q1 Preview: Net loss may widen to Rs 309 crore amid paints, VSF pressure. 5 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grasim-industries-q1-preview-net-loss-may-widen-to-rs-309-crore-amid-paints-vsf-pressure-5-things-to-watch-out-for/articleshow/123170339.cms",
            "description": "Grasim Industries is projected to report a wider net loss in Q1, despite a robust 30% YoY revenue growth. Weak profitability is expected due to ongoing losses in new ventures like paints and B2B e-commerce, coupled with soft margins in the viscose fibre business. While the chemical segment may show slight improvement, margin pressure and cost headwinds remain concerns.",
            "pubDate": "2025-08-07T18:26:47.829911"
        },
        {
            "title": "Sun TV Network Q1 net profit dips amid ad revenue decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sun-tv-network-q1-net-profit-dips-amid-ad-revenue-decline/articleshow/123169886.cms",
            "description": "Sun TV Network reported a 3% YoY drop in Q1 profit to ₹529 crore due to weak advertising revenues, while subscription income grew 10%. EBITDA fell 13% to ₹617 crore.",
            "pubDate": "2025-08-07T18:26:47.830019"
        },
        {
            "title": "HPCL Q1 Results: Standalone PAT skyrockets 1,128% YoY to Rs 4,371 crore, revenue sees marginal decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hpcl-q1-results-standalone-pat-skyrockets-1128-yoy-to-rs-4371-crore-revenue-sees-marginal-decline/articleshow/123169653.cms",
            "description": "HPCL reported a sharp 1,128% year-on-year rise in Q1 standalone net profit to ₹4,371 crore, driven by strong refinery throughput and operational efficiency, despite marginally lower revenues and weaker refining margins.",
            "pubDate": "2025-08-07T18:26:47.830126"
        },
        {
            "title": "Apollo Tyres reports net profit of Rs 12.8 cr for Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-tyres-reports-net-profit-of-rs-12-8-cr-for-q1/articleshow/123168925.cms",
            "description": "Apollo Tyres on Thursday posted a consolidated net profit of Rs 12.8 crore for the June quarter on one-time expense of Rs 368.5 crore for the restructuring process.",
            "pubDate": "2025-08-07T18:26:47.830252"
        },
        {
            "title": "Global Health Q1 Results: Profit surges 50% to Rs 159 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/global-health-q1-results-profit-surges-50-to-rs-159-crore/articleshow/123168805.cms",
            "description": "The mutual fund industry experienced strong growth in new Systematic Investment Plan (SIP) registrations, with 1.67 crore accounts added in the quarter ended June 2025, driven by resilient retail participation despite market volatility.",
            "pubDate": "2025-08-07T18:26:47.830356"
        },
        {
            "title": "Kalyan Jewellers Q1 profit jumps 49% to Rs 246 crore, revenue up 31%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kalyan-jewellers-q1-profit-jumps-49-to-rs-246-crore-revenue-up-31/articleshow/123168368.cms",
            "description": "Kalyan Jewellers posted a 49% YoY rise in Q1FY26 PAT at Rs 246 crore, with revenue climbing 31% to Rs 7,268 crore. Strong domestic and international performance, despite gold price volatility, boosted the quarter.",
            "pubDate": "2025-08-07T18:26:47.830452"
        },
        {
            "title": "Crompton Greaves Consumer Electricals Q1 Results: Profit falls 19% to Rs 124 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/crompton-greaves-consumer-electricals-q1-results-profit-falls-19-to-rs-124-crore/articleshow/123168161.cms",
            "description": "Crompton Greaves Consumer Electricals Ltd on Thursday reported a 19 per cent decline in consolidated profit after tax at Rs 124 crore in the first quarter ended June 2025 with sales of cooling products being impacted by unusual weather.",
            "pubDate": "2025-08-07T18:26:47.830550"
        },
        {
            "title": "BSE Q1 Results: Cons PAT jumps 103% YoY to Rs 539 crore, revenue surges 59%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bse-q1-results-cons-pat-jumps-103-yoy-to-rs-539-crore-revenue-surges-59/articleshow/123167712.cms",
            "description": "BSE Q1 Results: BSE Limited reported a 103% year-on-year jump in its consolidated net profit for the June quarter at Rs 539 crore on Thursday, compared to Rs 265 crore in the year-ago period.",
            "pubDate": "2025-08-07T18:26:47.830646"
        },
        {
            "title": "Kalyan Jewellers Q1 Results: Cons PAT jumps 49% YoY to Rs 264 crore, revenue grows 31%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kalyan-jewellers-q1-results-cons-pat-jumps-49-yoy-to-rs-264-crore-revenue-grows-31/articleshow/123167133.cms",
            "description": "Kalyan Jewellers posted a 49% YoY jump in Q1FY26 net profit to Rs 264 crore, driven by strong domestic and international growth. Revenue rose 31% YoY to Rs 7,268 crore, with upbeat outlook for the festive season.",
            "pubDate": "2025-08-07T18:26:47.830746"
        },
        {
            "title": "LIC Q1 Results: PAT rises 5% YoY to Rs 10,987 crore, NPI up 5% as well",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-q1-results-pat-rises-5-yoy-to-rs-10987-crore-npi-also-up-5/articleshow/123166391.cms",
            "description": "LIC Q1 Results: LIC reported a 5% YoY increase in net profit, reaching Rs 10,987 crore, with a corresponding 5% rise in net premium income to Rs 1.19 lakh crore in Q1. The insurer maintained market leadership with a 63.51% share in First Year Premium Income. VNB also rose 21% YoY to Rs 1,944 crore, reflecting improved profitability.",
            "pubDate": "2025-08-07T18:26:47.830845"
        },
        {
            "title": "Titan Company Q1 Results: Standalone PAT surges 34% YoY to Rs 1,030 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titan-company-q1-results-pat-surges-34-yoy-to-rs-1030-crore-beats-estimates/articleshow/123166262.cms",
            "description": "Titan Company Q1 Results: Titan Company on Thursday reported a 34% YoY surge in its Q1FY26 standalone net profit at Rs 1,030 crore versus Rs 770 crore in the year ago period. The profit after tax (PAT) was above Street's estimates of Rs 925 crore.",
            "pubDate": "2025-08-07T18:26:47.830943"
        }
    ]
}