{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-27T16:57:20.509750",
    "items": [
        {
            "title": "Can DRL’s new product launches offset the slowdown in Revlimid sales?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-drls-new-product-launches-offset-the-slowdown-in-revlimid-sales/articleshow/124837182.cms",
            "description": "Dr Reddy's Laboratories saw a high single-digit revenue increase in Q3, driven by India, emerging, and European markets, despite a muted US business. The company launched 24 new products, with a pipeline of 100 products expected to offset slowing Revlimid sales. Analysts remain cautious, with valuations factoring in earnings upside.",
            "pubDate": "2025-10-27T05:16:00.667490"
        },
        {
            "title": "Indian Oil Q2 Results: State-run refiner swings to Rs 7,818 crore profit, revenue up 4% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-oil-q2-results-state-run-refiner-swings-to-rs-7818-crore-profit-revenue-up-4-yoy/articleshow/124848492.cms",
            "description": "State-run Indian Oil Corporation Ltd (IOC) on Monday reported its swing back to profit in the September quarter, posting a consolidated net profit attributable to shareholders at Rs 7,817.55 crore for second quarter of FY26, reversing from a loss of Rs 169.58 crore in the same quarter last year, as revenue rose and margins improved.",
            "pubDate": "2025-10-27T11:41:37.755531"
        },
        {
            "title": "Adani Energy Q2 Results: Cons profit falls 21% YoY to Rs 534 crore, revenue rises 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-energy-q2-results-profit-falls-21-yoy-to-rs-534-crore-revenue-rises-7/articleshow/124848145.cms",
            "description": "Adani Energy Q2 Results: Adani Energy Solutions on Monday reported 21% decline in its consolidated net profit at Rs 534 crore for the quarter ended September 2025. The same stood at Rs 675 crore in the year-ago quarter. Revenue from operations in the same period increased 7% year-on-year (YoY) to Rs 6,596 crore.",
            "pubDate": "2025-10-27T11:41:37.755677"
        },
        {
            "title": "Tata Investment Corp Q2 Results: Cons PAT rises 19% to Rs 148 crore, revenue up 8.5% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-investment-corporation-q2-results-pat-rises-20-yoy-at-rs-148-crore/articleshow/124845523.cms",
            "description": "In a remarkable showcase of resilience, Tata Investment Corporation has revealed impressive financial results. The net profit for Q2 of FY 2026 surged by 19.3%, complemented by a notable rise in operational revenue. This achievement coincides with heightened excitement from investors regarding the Tata Sons listing.",
            "pubDate": "2025-10-27T11:41:37.755796"
        },
        {
            "title": "Tamilnad Mercantile Bank Q2 profit up 5% as lower provisions aid earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tamilnad-mercantile-bank-q2-profit-up-5-as-lower-provisions-aid-earnings/articleshow/124853465.cms",
            "description": "Tamilnad Mercantile Bank posted a 5% rise in Q2FY26 net profit to Rs 318 crore, aided by sharply lower provisions. Asset quality improved, with gross NPA falling to 1.01% and net NPA to 0.26%.",
            "pubDate": "2025-10-27T16:57:18.216225"
        },
        {
            "title": "PNB Housing Finance Q2 Results: Profit rises 24% to Rs 582 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-housing-finance-q2-results-profit-rises-24-to-rs-582-crore/articleshow/124851898.cms",
            "description": "PNB Housing Finance on Monday reported a 24 per cent increase in its net profit to Rs 582 crore for the second quarter ended September 2025.",
            "pubDate": "2025-10-27T16:57:18.216359"
        },
        {
            "title": "Bata India Q2 Results: Net profit down 73% to Rs 13.9 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bata-india-q2-results-net-profit-down-73-to-rs-13-9-crore/articleshow/124851566.cms",
            "description": "Footwear maker Bata India Ltd on Monday reported a 73.26 per cent decline in consolidated net profit to Rs 13.9 crore in the second quarter ended September 30, 2025, impacted by lower revenue and higher expenses.",
            "pubDate": "2025-10-27T16:57:18.216468"
        },
        {
            "title": "Canara HSBC Life Q2 Results: Net profit rises 11% to Rs 41 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/canara-hsbc-life-q2-net-profit-rises-11-pc-to-rs-41-cr/articleshow/124851408.cms",
            "description": "Canara HSBC Life Insurance Company on Monday reported an 11 per cent rise in net profit to Rs 41 crore in the September quarter of the current fiscal.",
            "pubDate": "2025-10-27T16:57:18.216570"
        }
    ]
}