{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-11T01:37:29.812413",
    "items": [
        {
            "title": "Apollo Hospitals net profit rise 52% to Rs 372 crore in Q3FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-net-profit-rise-52-to-rs-372-crore-in-q3fy25/articleshow/118123140.cms",
            "description": "Apollo Hospitals on Monday reported a 52% year-on-year (YoY) jump in net profit to Rs 372 crore in Q3FY25, led by growth across healthcare services, specialty chains and pharmacy segments.",
            "pubDate": "2025-02-11T01:36:16.047429"
        },
        {
            "title": "Signature Global reduces net debt to Rs 740 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/signature-global-reduces-net-debt-to-rs-740-crore/articleshow/118122868.cms",
            "description": "Realty developer Signature Global has reduced the net debt to Rs 740 crore by Q3FY25 against Rs 1,160 crore at the end of FY24.",
            "pubDate": "2025-02-11T01:36:16.047551"
        },
        {
            "title": "ESAF Small Finance Bank Q3 net loss widens to Rs 211 crore QoQ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/esaf-small-finance-bank-q3-net-loss-widens-to-rs-211-crore-qoq/articleshow/118122687.cms",
            "description": "ESAF Small Finance Bank suffered net losses for the second quarter in a row due to asset quality stress and a fall in earnings.",
            "pubDate": "2025-02-11T01:36:16.047672"
        },
        {
            "title": "Grasim Q3 Results: PAT falls 41% YoY to Rs 899 crore, revenue rises 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grasim-q3-results-pat-falls-41-yoy-to-rs-899-crore-revenue-rises-9/articleshow/118121931.cms",
            "description": "Grasim Q3 Results: Grasim on Monday reported a 41% year-on-year (YoY) decline in its consolidated net profit at Rs 899 crore in the third quarter. Revenue from operations during the same period rose 9% YoY to Rs 34,793 crore.",
            "pubDate": "2025-02-11T01:36:16.047773"
        },
        {
            "title": "Apollo Hospitals Q3 Results: PAT jumps 52% YoY to Rs 372 crore, revenue rises 14%; Rs 9 per share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-q3-results-pat-jumps-52-yoy-to-rs-372-crore-revenue-rises-14/articleshow/118121516.cms",
            "description": "Apollo Hospitals Q3 Results: The company's board has declared an interim dividend of Rs 9 per share, with February 15 as the record date. The payout will be made by February 28. In Q3, EBITDA grew 24% YoY to Rs 762 crore. Healthcare revenues rose 13% YoY to Rs 2,785 crore, driving a 21% YoY profit increase to Rs 348 crore, while EBITDA for the segment surged 14% YoY to Rs 671 crore.",
            "pubDate": "2025-02-11T01:36:16.047880"
        },
        {
            "title": "Gillette India Q3 Results: Profit jumps 21% to Rs 126 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gillette-india-q3-results-profit-jumps-21-to-rs-126-crore/articleshow/118120491.cms",
            "description": "Shaving products maker Gillette India Ltd on Monday reported 21.18 per cent rise in profit to Rs 125.97 crore for the second quarter ended December 2024.",
            "pubDate": "2025-02-11T01:36:16.047981"
        },
        {
            "title": "Saregama Q3 Results: Profit rises 20% to Rs 63 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/saregama-q3-results-profit-rises-20-to-rs-63-crore/articleshow/118120419.cms",
            "description": "Saregama India Ltd on Monday reported a 20.8-per cent year-on-year rise in consolidated net profit to Rs 63.24 crore for the quarter ended December 2024, driven by robust revenue growth in the music and events segments.",
            "pubDate": "2025-02-11T01:36:16.048081"
        },
        {
            "title": "Novelis Q3 Results: Net income down 9% YoY to $110 million, sales rise 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/novelis-q3-results-net-income-down-9-yoy-to-110-million-sales-rise-4/articleshow/118120301.cms",
            "description": "Novelis Q3 Results: Novelis Inc, Hindalco’s subsidiary, reported a 9% YoY drop in Q3 net income to $110 million, with adjusted EBITDA down 19%. Rising scrap aluminum costs pressured margins despite higher revenue from aluminum price gains.",
            "pubDate": "2025-02-11T01:36:16.048179"
        },
        {
            "title": "Satin Creditcare Q3 Results: Profit slumps 87% YoY to Rs 14 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/satin-creditcare-q3-results-profit-slumps-87-yoy-to-rs-14-crore/articleshow/118119452.cms",
            "description": "Satin Creditcare reported an 87% YoY drop in Q3 net profit to ₹14 crore due to rising credit costs. Revenue grew 15%, but provisions surged, raising GNPA to 3.9%. The company emphasizes returning to fundamentals for recovery.",
            "pubDate": "2025-02-11T01:36:16.048283"
        },
        {
            "title": "Eicher Motors Q3 Results: PAT jumps 18% YoY to Rs 1,171 crore; revenue up 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eicher-motors-q3-results-pat-jumps-18-yoy-to-rs-1171-crore-revenue-up-19/articleshow/118119246.cms",
            "description": "Eicher Motors Q3 Results: Eicher Motors posted an 18% YoY rise in net profit to ₹1,171 crore in Q3, with revenue surging 19%. Royal Enfield and VE Commercial Vehicles achieved record sales, boosting overall performance despite sluggish industry trends.",
            "pubDate": "2025-02-11T01:36:16.048384"
        },
        {
            "title": "Nykaa Q3 Results: PAT surges 61% YoY to Rs 26 crore, but misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-q3-results-pat-surges-61-yoy-to-rs-26-crore-but-misses-estimates/articleshow/118115865.cms",
            "description": "Nykaa Q3 Results: Nykaa reported a 61% YoY growth in its consolidated net profit to Rs 26.12 crore, falling short of the Street estimate. Revenue rose by 27% YoY to Rs 2,267 crore, aligning with expectations. The company's EBITDA for the October-December 2024 quarter stood at Rs 141 crore, with margins at 6.2%.",
            "pubDate": "2025-02-11T01:36:16.048481"
        },
        {
            "title": "Eureka Forbes Q3 profit up 52.5 pc to Rs 35 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eureka-forbes-q3-profit-up-52-5-pc-to-rs-35-cr/articleshow/118114910.cms",
            "description": "Eureka Forbes Ltd, a health and hygiene products maker, on Monday reported a 52.5 per cent increase in its consolidated net profit to Rs 35.03 crore in the December quarter.",
            "pubDate": "2025-02-11T01:36:16.048596"
        },
        {
            "title": "Varun Beverages Q4 Results: PAT rises 36% YoY to Rs 195 crore, revenue jumps 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/varun-beverages-q4-results-pat-rises-36-yoy-to-rs-195-64-crore-revenue-jumps-40d/articleshow/118110875.cms",
            "description": "Varun Beverages reported strong financial growth, with net revenues (post-excise duty) rising 38.3% to Rs 3,688.79 crore. Revenue from operations surged 39.8% year-over-year, reaching Rs 3,817.61 crore, compared to Rs 2,730.98 crore in the same period last year. The company’s impressive performance reflects strong demand and operational efficiency, contributing to its continued expansion in the beverage market.",
            "pubDate": "2025-02-11T01:36:16.048698"
        },
        {
            "title": "Q3 results today: Nykaa, Grasim among 298 companies to announce earnings on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-nykaa-grasim-among-298-companies-to-announce-earnings-on-monday/articleshow/118102100.cms",
            "description": "Third quarter earnings reports are being released, with key companies like Varun Beverages, Nykaa, Grasim, Eicher Motors, and Apollo Hospitals showing notable performance. Nykaa's revenue growth is projected at 27%, while Grasim Industries is expected to see a 23-30% revenue increase. Analysts will focus on industry trends and competitive landscapes.",
            "pubDate": "2025-02-11T01:36:16.048888"
        },
        {
            "title": "Nykaa Q3 Results Preview: PAT to more than double on strong BPC growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-q3-results-preview-pat-to-more-than-double-on-strong-bpc-growth/articleshow/118087052.cms",
            "description": "Nykaa Q3 Results Preview: Nykaa's Q3FY25 update forecasts 27% YoY revenue growth, driven by a strong performance in the BPC segment, with eB2B contributing 8% of BPC GMV. Fashion segment faces muted demand, but market share gains persist. Despite some margin pressure, overall growth remains positive, with expected EBITDA margin expansion due to reduced losses in fashion and other segments.",
            "pubDate": "2025-02-11T01:36:16.048985"
        }
    ]
}