{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-19T01:48:27.788143",
    "items": [
        {
            "title": "Asian stocks join Wall Street rally, brace for BOJ hike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-join-wall-street-rally-brace-for-boj-hike/articleshow/126067388.cms",
            "description": "Asian markets rebounded, mirroring Wall Street's tech surge, as investors anticipate a Bank of Japan rate hike. U.S. inflation slowed to 2.7%, though analysts caution about data distortions. Central banks in Europe and Britain signaled a more cautious approach to future rate cuts, impacting currency and bond markets.",
            "pubDate": "2025-12-19T01:48:15.406015"
        },
        {
            "title": "Are Anupam Rasayan shares poised for long-term gains on Jayhawk deal?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-anupam-rasayan-shares-poised-for-long-term-gains-on-jayhawk-deal/articleshow/126067320.cms",
            "description": "Anupam Rasayan's stock surged following its $150 million acquisition of US-based Jayhawk Fine Chemicals. This strategic move grants Anupam a US manufacturing presence, enhancing its global CDMO capabilities and polymer portfolio. The deal, funded through internal accruals and structured equity, is expected to be EPS accretive from day one and significantly boost US export share.",
            "pubDate": "2025-12-19T01:48:15.406135"
        },
        {
            "title": "Stocks in news: ICICI Prudential AMC, Meesho, Ola Electric, Bharti Airtel, Vodafone Idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-icici-prudential-amc-meesho-ola-electric-bharti-airtel-vodafone-idea/articleshow/126060941.cms",
            "description": "Markets traded cautiously, ending flat as consolidation continues, influenced by global cues and currency concerns. Key stocks like Ola Electric, ICICI Prudential AMC, and Bharti Airtel are in focus due to promoter stake sales, IPO debut, and CFO appointment respectively. NTPC plans significant capacity expansion, while Vodafone Idea raised funds for network investment.",
            "pubDate": "2025-12-19T01:48:15.406335"
        },
        {
            "title": "GIFT Nifty up 70 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126061024.cms",
            "description": "Nifty consolidated with a weak bias on Thursday, closing marginally lower. Analysts suggest the short-term trend remains choppy, with the 25,700 level appearing vulnerable. Foreign portfolio investors and domestic institutional investors showed net buying activity.",
            "pubDate": "2025-12-19T01:48:15.406441"
        },
        {
            "title": "Meesho m-cap tops Rs 1 lakh cr in seven sessions after its listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-m-cap-tops-rs-1-lakh-cr-in-seven-sessions-after-its-listing/articleshow/126067207.cms",
            "description": "E-commerce platform Meesho's market capitalization surged past ₹1 lakh crore within seven sessions of its listing, closing Thursday at ₹234 per share. This significant growth, up 37% since its December 10th debut, is attributed to its focus on Tier 2 and 3 city consumers and a robust, asset-light business model generating positive cash flows.",
            "pubDate": "2025-12-19T01:48:15.406559"
        },
        {
            "title": "Sebi strikes a 'balance' in fee change; AMCs, brokers rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-strikes-a-balance-in-fee-change-amcs-brokers-rally/articleshow/126067189.cms",
            "description": "Asset management and broking stocks surged on Thursday following Sebi's revised mutual fund fee structure and broking fee caps. The regulator's less severe overhaul, with reduced expense ratio cuts and lower brokerage fee limits, led to a relief rally, with several AMC and brokerage firms seeing significant gains.",
            "pubDate": "2025-12-19T01:48:15.406657"
        },
        {
            "title": "Japan’s MUFG to invest $4.45 billion on Shriram Finance in biggest FDI in Indian financial services",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-mufg-to-invest-4-45-billion-on-shriram-finance-in-biggest-fdi-in-indian-financial-services/articleshow/126067351.cms",
            "description": "Mitsubishi UFJ Financial Group is set to invest $4.45 billion for a 20% stake in Shriram Finance, marking the largest FDI in India's financial services sector. This strategic move paves the way for an eventual acquisition, with MUFG aiming to increase its holding and gain majority control over time.",
            "pubDate": "2025-12-19T01:48:15.406755"
        },
        {
            "title": "ECB holds interest rates at 2% for a fourth time",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecb-holds-interest-rates-at-2-for-a-fourth-time/articleshow/126067147.cms",
            "description": "The European Central Bank has held interest rates steady for the fourth time. Inflation is near the bank's target. The euro zone economy is showing resilience. New forecasts suggest economic growth will strengthen. Inflation is expected to return to the 2% target in 2028. Other central banks like the Bank of England and Federal Reserve have cut rates.",
            "pubDate": "2025-12-19T01:48:15.406848"
        },
        {
            "title": "ICICI Pru AMC could gain up to 10-20% on debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-pru-amc-could-gain-up-to-10-20-on-debut/articleshow/126067089.cms",
            "description": "ICICI Prudential Asset Management's IPO saw a strong subscription, indicating a likely firm market debut with potential listing gains of 10-20%. Analysts suggest the stock could list above ₹2,500, with some assigning a 'Buy' rating and a price target of ₹3,000. The company's strong fundamentals and industry tailwinds support long-term growth prospects.",
            "pubDate": "2025-12-19T01:48:15.406941"
        },
        {
            "title": "Airtel rings in rights issue, shuffles senior leadership",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/airtel-rings-in-rights-issue-shuffles-senior-leadership/articleshow/126067357.cms",
            "description": "Bharti Airtel's board has approved calling the remaining ₹15,740 crore from a rights issue. This move aims to cut debt and strengthen the company's balance sheet. The board also approved a top management rejig. Shashwat Sharma will become the new CEO from January 1. Gopal Vittal will transition to executive vice chairman. Akhil Garg is the new CFO.",
            "pubDate": "2025-12-19T01:48:15.407126"
        },
        {
            "title": "HDFC, BoB raise $1.5 billion from overseas loan market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bob-raise-1-5-billion-from-overseas-loan-market/articleshow/126067272.cms",
            "description": "HDFC Bank and Bank of Baroda have collectively secured $1.5 billion in overseas loans, bolstering their liquidity amidst stabilizing interest rates. HDFC Bank raised $1 billion through a three-and-a-half-year loan, while BoB secured $500 million via a five-year pact, with MUFG and HSBC involved in the transactions.",
            "pubDate": "2025-12-19T01:48:15.407217"
        }
    ]
}