{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-20T01:39:59.975114",
    "items": [
        {
            "title": "Asian stocks, US treasuries fall on tariff angst",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-us-treasuries-fall-on-tariff-angst/articleshow/126740003.cms",
            "description": "Asian markets opened lower Tuesday. President Donald Trump's tariff threats regarding Greenland have reignited trade tensions. This has impacted investor confidence. European shares fell significantly on Monday. US markets were closed. Investors are watching for the European Union's response to potential US tariffs. The situation adds to existing market nervousness.",
            "pubDate": "2026-01-20T01:39:49.413012"
        },
        {
            "title": "Stocks in news: ITC Hotels, Tata Capital, Ola Electric, Adani Power, LTIMindtree",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-itc-hotels-tata-capital-ola-electric-adani-power-ltimindtree/articleshow/126704264.cms",
            "description": "Indian markets opened lower, with the Nifty index falling below a crucial support level. Analysts suggest a continued corrective trend. Despite the overall weakness, some sectors are performing well. Investors are advised to focus on these leading sectors and manage risk.",
            "pubDate": "2026-01-20T01:39:49.413122"
        },
        {
            "title": "GIFT Nifty up 40 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126704614.cms",
            "description": "Indian equity markets closed lower amid a cautious global sentiment and mixed earnings reports. Analysts anticipate sideways trading, influenced by global cues and ongoing corporate results, with geopolitical escalations posing a significant risk. The India VIX saw a 4% rise, indicating increased market fear.",
            "pubDate": "2026-01-20T01:39:49.413323"
        },
        {
            "title": "IndiGo posts biggest single-day gain in 16 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-post-biggest-single-day-gain-in-16-months/articleshow/126737156.cms",
            "description": "IndiGo's parent company, InterGlobe Aviation, saw its shares rise significantly. This surge followed a penalty from the Directorate General of Civil Aviation for flight cancellations. Investors reacted positively as the fine was less than anticipated. The company had faced disruptions in December due to crew time limits and aircraft issues.",
            "pubDate": "2026-01-20T01:39:49.413425"
        },
        {
            "title": "Wipro sinks over 8% as weak Q4 guidance spooks investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-sinks-over-8-as-weak-q4-guidance-spooks-investors/articleshow/126736077.cms",
            "description": "Wipro shares plummeted over 8% on Monday following a disappointing fourth-quarter growth outlook provided by the IT services firm. The company reported revenue of ₹23,556 crore for the quarter ended December 31, with modest sequential and year-on-year increases. Analysts expressed concern over the management's guidance, leading to a significant drop in the stock price.",
            "pubDate": "2026-01-20T01:39:49.413522"
        },
        {
            "title": "RIL slumps over 3% after Q3 miss dampens growth outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-slumps-over-3-after-q3-miss-dampens-growth-outlook/articleshow/126735591.cms",
            "description": "Reliance Industries shares saw a significant drop on Monday. This decline followed the company's third-quarter results. Analysts point to slower growth across its business segments. Investors are advised to observe further developments. The stock has experienced a notable fall in the past month. Technical indicators suggest continued weakness. A cautious approach is recommended for retail investors.",
            "pubDate": "2026-01-20T01:39:49.413614"
        },
        {
            "title": "Sun Pharma places non-binding offer for US-based Organon in its boldest global bet ever",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-places-non-binding-offer-for-us-based-organon-in-its-boldest-global-bet-ever/articleshow/126738816.cms",
            "description": "Sun Pharmaceutical Industries Ltd has submitted a non-binding offer to acquire US-based Organon for an all-cash deal, securing $10-14 billion in acquisition financing. This move marks Sun Pharma's boldest global bet, aiming to bolster its presence in women's health biopharma and biosimilars. The acquisition, if successful, would be the largest by an Indian pharmaceutical company.",
            "pubDate": "2026-01-20T01:39:49.413706"
        },
        {
            "title": "Banks feel the pinch as CASA pool shrinks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-feel-the-pinch-as-casa-pool-shrinks/articleshow/126737250.cms",
            "description": "As Indian banks grapple with dwindling low-cost CASA deposits, a growing number of savers are shifting their money into market-driven investments seeking higher returns. This shift compels banks to depend increasingly on pricier short-term borrowing methods, such as Certificates of Deposit, to sustain their lending activities.",
            "pubDate": "2026-01-20T01:39:49.413888"
        },
        {
            "title": "Tiger Global saga: An interpretation of maladies that's open to more ills",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tiger-global-saga-an-interpretation-of-maladies-thats-open-to-more-ills/articleshow/126737456.cms",
            "description": "Tiger Global may file a review petition following a Supreme Court verdict on the India-Mauritius tax treaty. The ruling alters how investors interpret tax treaties, particularly regarding indirect transfers. This development sparks discussions in tax and legal circles. The verdict's interpretation of a key treaty article differs significantly from investor expectations.",
            "pubDate": "2026-01-20T01:39:49.413980"
        },
        {
            "title": "RBI tightens PSL norms, mandates auditor certification for lenders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-tightens-psl-norms-mandates-auditor-certification-for-lenders/articleshow/126738526.cms",
            "description": "The Reserve Bank of India has strengthened priority sector lending compliance, mandating external auditor certificates from intermediaries to prevent double-claiming of loans. This move follows scrutiny of banks for misclassifying agricultural loans. The RBI aims to ensure credit flows to priority sectors by enhancing monitoring and internal controls.",
            "pubDate": "2026-01-20T01:39:49.414352"
        }
    ]
}