{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-09T05:58:34.441894",
    "items": [
        {
            "title": "FIIs sell consumer stocks despite GST2.0 boost to buy financials worth Rs 13,300 crore in October",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-sell-consumer-stocks-despite-gst2-0-boost-to-buy-financials-worth-rs-13300-crore-in-october/articleshow/125197491.cms",
            "description": "Foreign institutional investors (FIIs) offloaded consumer-centric stocks worth Rs 9,477 crore in October, even as they poured Rs 13,279 crore into the financial space, data from ACE Equity showed. Interestingly, the selling in consumer stocks came despite the rollout of GST 2.0, a tax reform aimed at boosting consumption.",
            "pubDate": "2025-11-09T05:58:30.318829"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms erodes by Rs 88,635 cr; Airtel, TCS biggest laggards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-erodes-by-rs-88635-cr-airtel-tcs-biggest-laggards/articleshow/125197465.cms",
            "description": "The combined market valuation of seven of the top-10 most valued firms eroded by Rs 88,635.28 crore in a holiday-shortened last week, with Bharti Airtel and Tata Consultancy Services taking the biggest hit, in line with the weak trend in equities.",
            "pubDate": "2025-11-09T05:58:30.318972"
        },
        {
            "title": "Axis Securities names 15 stocks as its top picks. How many do you have in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-names-15-stocks-as-its-top-picks-how-many-do-you-have-in-your-portfolio/slideshow/125197453.cms",
            "description": "Intro – Axis Securities’ latest Top Picks – November 2025 report highlights 15 stocks across large, mid, and smallcap segments that it believes are best positioned to deliver strong returns in the coming months. Backed by improving domestic liquidity, policy support, and rising consumption, these top picks span sectors such as financials, telecom, healthcare, industrials, and utilities—offering a balanced mix of defensives and cyclical opportunities for investors.",
            "pubDate": "2025-11-09T05:58:30.319077"
        },
        {
            "title": "Lenskart listing, Infosys buyback and FII trends among 7 factors to steer markets this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-listing-infosys-buyback-and-fii-trends-among-7-factors-to-steer-markets-this-week/articleshow/125196839.cms",
            "description": "Indian benchmark indices Nifty and the BSE Sensex ended with weekly declines of 0.9%, amid selling pressure in IT and consumer stocks.",
            "pubDate": "2025-11-09T05:58:30.319199"
        },
        {
            "title": "Plunge in Asia’s AI shares sows doubts over world-beating rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/plunge-in-asias-ai-shares-sows-doubts-over-world-beating-rally/articleshow/125196789.cms",
            "description": "The sudden slump in Asia’s technology shares last week has jolted investors, serving as a stark reminder that the world-beating rally in artificial intelligence and semiconductor stocks may be nearing a short-term crest.",
            "pubDate": "2025-11-09T05:58:30.319297"
        }
    ]
}