{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-04T05:31:02.237210",
    "items": [
        {
            "title": "Dow, S&P 500 manage record closing highs; Nasdaq falls in volatile session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-sp-500-manage-record-closing-highs-nasdaq-falls-in-volatile-session/articleshow/124301234.cms",
            "description": "The S&P 500 and Dow achieved record closing highs Friday, navigating a volatile session amid an ongoing government shutdown. Interest rate-cut expectations strengthened, driven by weak economic data, including contracting services employment. Traders now anticipate a Fed rate cut in October as almost certain, with another probable in December, despite concerns about a prolonged shutdown's impact.",
            "pubDate": "2025-10-04T03:49:37.194583"
        },
        {
            "title": "M-cap share of defensives hits lowest level since 2011: ICICI Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/m-cap-share-of-defensives-hits-lowest-level-since-2011-icici-securities/articleshow/124301089.cms",
            "description": "ICICI Securities reports that defensive sectors like FMCG, IT, and healthcare have seen their market-cap share drop to a 20% low since 2011, from 30% in 2020. Their profit pool share also plummeted to 16%, while valuations remain high at 32 times P/E. Meanwhile, cyclicals' P/B ratios have surged significantly from 2020 bottoms.",
            "pubDate": "2025-10-04T03:49:37.194693"
        },
        {
            "title": "Will stock-specific trading continue to drive market gains?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-stock-specific-trading-continue-to-drive-market-gains/articleshow/124300938.cms",
            "description": "Indian equity indices closed higher on Friday, recovering from early losses as stock-specific trading dominated after the RBI's dovish stance fizzled out. Midcap, smallcap, metal, and PSU bank sectors saw significant gains, with experts suggesting buying opportunities on dips towards 24,400-24,600 for Nifty.",
            "pubDate": "2025-10-04T03:49:37.194794"
        },
        {
            "title": "GST 2.0: Insurers cut payouts to distributors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-2-0-insurers-cut-payouts-to-distributors/articleshow/124300931.cms",
            "description": "Life insurers face a similar squeeze. The industry paid about ?24,000 crore in GST in FY24, offset by ? 14,000 crore of ITC. With credits no longer available, the new two-rate system leaves them facing a ?15,000 crore sector-wide hit, part of which will show up in company profit and loss accounts and embedded values. Despite the exemption, customers may not see a meaningful drop in premiums as insurers adjust pricing to recoup lost credits, analysts said.",
            "pubDate": "2025-10-04T03:49:37.194892"
        },
        {
            "title": "Growth Uncapped: NBFCs can tap a billion dollars or more in ECBs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/growth-uncapped-nbfcs-can-tap-a-billion-dollars-or-more-in-ecbs/articleshow/124300922.cms",
            "description": "Financial regulators - the Reserve Bank of India, Securities and Exchange Board of India, Insurance Regulatory and Development Authority of India and Pension Fund Regulatory and Development Authority -would not enforce ceilings on the amounts that can be borrowed by Indian companies from overseas markets. The RBI has also allowed borrowers that is under a debt restructuring scheme or corporate insolvency resolution process to raise ECB only if specifically permitted under the restructuring or resolution plan.",
            "pubDate": "2025-10-04T03:49:37.194985"
        },
        {
            "title": "India anchor of stability in volatile world: RBI governor Sanjay Malhotra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-anchor-of-stability-in-volatile-world-rbi-governor-sanjay-malhotra/articleshow/124301152.cms",
            "description": "RBI Governor Sanjay Malhotra affirmed India as an \"anchor of stability\" due to resilient growth, robust macroeconomic fundamentals, and continuous reforms. He cautioned against global stock market complacency and rising public debt, noting gold prices now reflect global uncertainties. Malhotra also highlighted India's unique central bank autonomy framework.",
            "pubDate": "2025-10-04T03:49:37.195077"
        },
        {
            "title": "RBI tweaks related party lending rules, unveils 'unified' framework",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-proposes-revised-framework-for-lending-to-related-parties/articleshow/124301028.cms",
            "description": "The move is aimed at tightening governance and reducing conflicts of interest in lending practices by commercial banks. The revised norms, effective from April 1, 2026, consolidate and replace over a dozen legacy circulars, creating a unified regulatory framework. RBI also introduced scale-based thresholds beyond which banks and non-banking financial companies (NBFCs) will need board approval for lending to related parties.",
            "pubDate": "2025-10-04T03:49:37.195278"
        },
        {
            "title": "HDFC Bank Q2 update: Average deposits grow 15% YoY, 9% rise in advances",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-q2-update-average-deposits-grow-15-yoy-9-rise-in-advances/articleshow/124302695.cms",
            "description": "HDFC Bank announced robust Q2FY26 business updates, with average deposits surging 15.1% year-on-year to Rs 27.15 lakh crore. Average advances also grew by 9% to Rs 27.95 lakh crore. The bank reported significant increases in both CASA and time deposits, reflecting strong financial performance for the quarter.",
            "pubDate": "2025-10-04T05:31:00.509417"
        },
        {
            "title": "Sebi says no plans to regulate family offices after reports spark speculation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-says-no-plans-to-regulate-family-offices-after-reports-spark-speculation/articleshow/124302440.cms",
            "description": "Family offices are investment firms set up by wealthy families to manage their assets. Over the past two decades, they have become a significant force in India’s markets—investing in startups, private equity, and initial public offerings.",
            "pubDate": "2025-10-04T05:31:00.509559"
        },
        {
            "title": "How hedge funds performed in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-hedge-funds-performed-in-september/articleshow/124301854.cms",
            "description": "The JPMorgan note, which tracks hedge fund trading, said positioning in U.S. stocks was only \"somewhat bullish,\" indicating an expectation for equities to rise.",
            "pubDate": "2025-10-04T05:31:00.509677"
        }
    ]
}