{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-08T17:31:48.623345",
    "items": [
        {
            "title": "LIC profit grows 5% despite lower equity gains in a volatile Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-profit-grows-5-despite-lower-equity-gains-in-a-volatile-q1/articleshow/123176791.cms",
            "description": "LIC reported a 5% increase in net profit to ₹10,986 crore, despite moderating capital gains from equity sales. The company's core insurance operating profit remained strong, with a 20.75% rise in the value of new business. LIC aims for double-digit profit expansion and is focusing on growing its non-participating business, which now constitutes over 30% of its portfolio.",
            "pubDate": "2025-08-08T06:55:55.976877"
        },
        {
            "title": "Tata Motors Q1 Results: Cons profit plunges 63% YoY to Rs 3,924 crore, but beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-q1-results-cons-profit-plunges-63-yoy-to-rs-3924-crore-but-beats-street-estimates/articleshow/123187388.cms",
            "description": "Tata Motors Q1 Results: The profit attributable to shareholders was higher than Street estimates of Rs 3,408 crore.",
            "pubDate": "2025-08-08T11:18:03.812871"
        },
        {
            "title": "GRSE Q1 Results: PAT surges 38% YoY to Rs 120 crore, revenue up 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grse-q1-results-pat-surges-38-yoy-to-rs-120-crore-revenue-up-by-30/articleshow/123185616.cms",
            "description": "Garden Reach Shipbuilders & Engineers (GRSE) reported a strong first quarter for FY26, with a 37.8% YoY increase in profit after tax, reaching Rs 120.17 crore. Revenue from operations also saw a significant rise of 29.7% YoY, totaling Rs 1,309.87 crore. The company's earnings per share improved to Rs 10.49, reflecting overall positive financial performance.",
            "pubDate": "2025-08-08T11:18:03.812995"
        },
        {
            "title": "Info Edge Q1 Results: Cons PAT jumps 27% YoY to Rs 296 crore, revenue up 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/info-edge-q1-results-cons-pat-jumps-27-yoy-to-rs-296-crore-revenue-up-17/articleshow/123185261.cms",
            "description": "Info Edge (India) reported a 27% year-on-year increase in consolidated net profit for the June quarter, reaching Rs 296 crore. Revenue also saw a 17% rise to Rs 791 crore. Standalone billings grew by 11.2%, with recruitment business increasing by 9.0% and non-recruitment portfolio growing by 17.6%. However, the recruitment segment faced headwinds and a sectoral slowdown.",
            "pubDate": "2025-08-08T11:18:03.813102"
        },
        {
            "title": "Grasim Industries Q1 Results: Cons net profit jumps 32% YoY to Rs 1,419 crore, revenue rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grasim-industries-q1-results-cons-net-profit-jumps-32-yoy-to-rs-1419-crore-revenue-rises-16/articleshow/123184975.cms",
            "description": "Grasim Industries announces a strong first quarter. The company's net profit rises by 32% compared to last year. Revenue from operations also increases significantly. Cement and Chemicals businesses drive the growth. The Paints business remains a key focus. The company anticipates benefiting from India's economic growth. Expansion plans for Cellulosic Fibres are underway.",
            "pubDate": "2025-08-08T11:18:03.813209"
        },
        {
            "title": "SBI Q1 Results: Standalone PAT jumps 12% YoY to Rs 19,160 crore, beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-q1-results-standalone-pat-jumps-12-yoy-to-rs-19160-crore-beats-street-estimates/articleshow/123183756.cms",
            "description": "SBI Q1 Results: SBI reported 6% YoY growth in interest income to Rs 1,17,996 crore for Q1FY26, while interest expenses rose 9% to Rs 76,923 crore. Profit growth was attributed to operating efficiency and controlled expenses. Despite weak market sentiment, shares recovered from day’s low post-results, trading over 1% lower on NSE after the announcement during market hours.",
            "pubDate": "2025-08-08T11:18:03.813312"
        },
        {
            "title": "Page Industries Q1 Results: Profit rises 21.5% to Rs 200.8 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/page-industries-q1-results-profit-rises-21-5-to-rs-200-8-crore/articleshow/123182788.cms",
            "description": "Page Industries Limited has announced a rise in net profit. The apparel manufacturer's profit increased by 21.52 percent for the June quarter. The company's net profit is now Rupees 200.79 crore. Revenue from operations also saw a boost. It increased 3 percent to Rupees 1,316.56 crore. The company's board has declared an interim dividend.",
            "pubDate": "2025-08-08T11:18:03.813415"
        },
        {
            "title": "Tata Motors Q1 profit slumps 63% on JLR tariff hit, misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-q1-profit-slumps-63-on-jlr-tariff-hit-misses-estimates/articleshow/123191984.cms",
            "description": "Tata Motors reported a 63% YoY decline in consolidated net profit to ₹3,924 crore in Q1, hit by US tariffs, weak demand, and legacy Jaguar model phase-out. Revenue dipped 2.5%, and EBITDA fell nearly 36%, signaling profitability pressure.",
            "pubDate": "2025-08-08T17:31:40.153244"
        },
        {
            "title": "Fusion Finance posts Rs 92 crore loss in June quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/fusion-finance-posts-rs-92-crore-loss-in-june-quarter/articleshow/123191898.cms",
            "description": "Fusion Finance reported a ₹92.25 crore net loss in Q1FY26, marking its fifth consecutive quarterly loss. It breached covenants on ₹3,567 crore in borrowings and is seeking lender waivers to continue operations amid declining assets and margins.",
            "pubDate": "2025-08-08T17:31:40.153375"
        },
        {
            "title": "Grasim Q1 profit jumps 32% YoY to Rs 1,419 crore on chemicals, cement boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grasim-q1-profit-jumps-32-yoy-to-rs-1419-crore-on-chemicals-cement-boost/articleshow/123191842.cms",
            "description": "Grasim Industries reported a 32% year-on-year rise in Q1FY26 consolidated profit at ₹1,419 crore, driven by strong performance in chemicals and building materials. Revenue grew 16% to ₹40,118 crore. EBITDA rose 36% despite higher paint business investments.",
            "pubDate": "2025-08-08T17:31:40.153481"
        },
        {
            "title": "Cholamandalam Financial Holdings Q1 Results: Co posts cons PAT of Rs 1,259 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cholamandalam-financial-holdings-posts-consolidated-pat-at-rs-1259-54-cr/articleshow/123191048.cms",
            "description": "Cholamandalam Financial Holdings Ltd has reported a consolidated profit after tax of Rs 1,259.54 crore for the April-June 2025 quarter, the company said on Friday.",
            "pubDate": "2025-08-08T17:31:40.153583"
        },
        {
            "title": "Infibeam Avenues Q1 Results: PAT surges 70% to Rs 85 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infibeam-avenues-pat-rises-70-pc-to-rs-85-5-cr-in-q1/articleshow/123190730.cms",
            "description": "Infibeam Avenues on Friday said its profit after tax (PAT) rose over 70 per cent to Rs 85.50 crore in the June quarter mainly on the back of enhanced pricing control through AI deployment, which improved monetisation and merchant experience.",
            "pubDate": "2025-08-08T17:31:40.153681"
        },
        {
            "title": "Equitas SFB posts Rs 224 crore Q1 loss on microfinance provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/equitas-sfb-posts-rs-224-crore-q1-loss-on-microfinance-provisions/articleshow/123190217.cms",
            "description": "Equitas Small Finance Bank reported a ₹224 crore Q1FY26 net loss due to higher provisions in its microfinance portfolio. The lender took a one-time provisioning hit to buffer future stress, even as microfinance collections show signs of recovery.",
            "pubDate": "2025-08-08T17:31:40.153788"
        },
        {
            "title": "Voltas Q1 Results: Profit slumps 58% to Rs 140 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/voltas-q1-results-profit-slumps-58-to-rs-140-crore/articleshow/123189513.cms",
            "description": "Air-conditioning maker and engineering services provider Voltas Ltd on Friday reported a decline of 58 per cent in its consolidated net profit to Rs 140.61 crore for the June quarter, as unseasonal rains and early arrival of monsoon impacted the cooling business.",
            "pubDate": "2025-08-08T17:31:40.153887"
        },
        {
            "title": "NIIT Q1 profit dips 44 pc to Rs 4.3 cr; revenue rises 2 pc to Rs 84.1 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/niit-q1-profit-dips-44-pc-to-rs-4-3-cr-revenue-rises-2-pc-to-rs-84-1-cr/articleshow/123188367.cms",
            "description": "Skills and talent development firm NIIT Ltd on Friday posted a 43.6 per cent decline in consolidated net profit to Rs 4.37 crore in the April-June quarter due to headwinds from a turbulent environment in the technology and BFSI sectors.",
            "pubDate": "2025-08-08T17:31:40.153998"
        },
        {
            "title": "Carborundum Universal Q1 Results: Co reports net profit at Rs 60 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/carborundum-universal-q1-results-co-reports-net-profit-at-rs-60-crore/articleshow/123188245.cms",
            "description": "Carborundum Universal Ltd on Friday recorded a dip in its consolidated net profits at Rs 60.39 crore for the April-June 2025 quarter due to a decline in its sales in the abrasives business, the company said.",
            "pubDate": "2025-08-08T17:31:40.154093"
        }
    ]
}