{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-13T05:39:10.408666",
    "items": [
        {
            "title": "Sebi’s new norms: FPI path to India eased; new rulebook for IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-new-norms-fpi-path-to-india-eased-new-rulebook-for-ipos/articleshow/123863084.cms",
            "description": "The Securities and Exchange Board of India is set to ease Foreign Portfolio Investors entry norms. This move aims to counter their withdrawal from the Indian equity market. Sebi will also relax IPO issue sizes for large Indian companies. Insurance companies and pension funds will get a quota in IPO anchor books.",
            "pubDate": "2025-09-13T03:54:33.230336"
        },
        {
            "title": "Wall Street coasts to the finish of its best week in the last 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-coasts-to-the-finish-of-its-best-week-in-the-last-5/articleshow/123863060.cms",
            "description": "Wall Street concluded its strongest week in five, hovering near record highs as investors anticipate a Federal Reserve interest rate cut. The S&P 500 remained relatively stable, while the Dow Jones Industrial Average declined, and the Nasdaq composite increased.",
            "pubDate": "2025-09-13T03:54:33.230461"
        },
        {
            "title": "Wall Street Week Ahead: Investors seek Fed's view of shaky labor market as rate cut looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-seek-feds-view-of-shaky-labor-market-as-rate-cut-looms/articleshow/123863039.cms",
            "description": "Investors anticipate the Federal Reserve will likely cut interest rates next week, potentially the first time in nine months, amid concerns about a weakening U.S. labor market. Despite recent inflation data, a rate cut is widely expected, with speculation focusing on the size of the reduction.",
            "pubDate": "2025-09-13T03:54:33.230696"
        },
        {
            "title": "NARCL to auction Rs 3,700 crore Wind World debt; Omkara files anchor offer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/narcl-to-auction-wind-world-debt-omkara-files-anchor-offer/articleshow/123863230.cms",
            "description": "National Asset Reconstruction Company is selling Wind World's debt. The reserve bid is ₹1,250 crore. Omkara ARC has emerged as the anchor bidder. They offered around ₹1,250 crore. NARCL acquired the distressed company's loans 18 months ago. The acquisition amount was ₹672 crore. The resolution process is underway. The Swiss Challenge auction is expected to wrap up soon.",
            "pubDate": "2025-09-13T04:31:22.619999"
        },
        {
            "title": "Nifty closes above 25,000 for a 2nd day, points to more gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-closes-above-25000-for-a-2nd-day-points-to-more-gains/articleshow/123863208.cms",
            "description": "Domestic equities marked a second consecutive week of gains, propelled by a surge in IT stocks following positive remarks from Donald Trump on India and Infosys' share buyback announcement. The NSE Nifty closed above 25,000, fueling optimism for further gains, while the Volatility Index declined, signaling reduced market risk.",
            "pubDate": "2025-09-13T04:31:22.620131"
        },
        {
            "title": "Concurrent Gainers: 11 BSE 200 stocks gained for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-11-bse-200-stocks-gained-for-5-days-in-a-row/slideshow/123864069.cms",
            "description": "Over the five trading sessions leading up to September 12, the Sensex posted a steady upward trend, gaining 1.5% or 1,194 points to settle at 81,905. Notably, the benchmark index closed in positive territory on each of those five days, reflecting sustained investor confidence. What makes this rally more interesting is that 11 stocks from the BSE 200 index managed to log gains in every single session during this period, highlighting consistent buying interest in select counters. (Data Source: ACE Equity)",
            "pubDate": "2025-09-13T05:39:07.549538"
        },
        {
            "title": "These 11 mutual fund favourite stocks plunge up to 40% in 2025 so far",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-11-mutual-fund-favourite-stocks-plunge-up-to-40-in-2025-so-far/slideshow/123863922.cms",
            "description": "Investor sentiment often strengthens when a stock is widely held across multiple mutual fund (MF) schemes — a sign of perceived stability and long-term potential. But even these popular names aren’t immune to sharp corrections.As of August 2025, 232 stocks were held by over 100 mutual fund schemes. Yet nearly 100 of them have delivered negative returns in CY25. ETMarkets’ analysis highlights 12 such stocks that have plunged 25–50% this year — a reminder that even heavily owned stocks aren’t guaranteed winners. Diversification and vigilance remain key. (Data: ACE MF, ACE Equity)",
            "pubDate": "2025-09-13T05:39:07.549668"
        },
        {
            "title": "Europe's STOXX 600 slips as French rating review looms; still ends week higher",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-600-slips-as-french-rating-review-looms-still-ends-week-higher/articleshow/123863523.cms",
            "description": "European shares closed the week mostly higher. Investors were cautious about France's credit rating. Healthcare stocks saw losses, with Novartis and Zealand Pharma declining. Aerospace and defence stocks rose due to geopolitical tensions. Banks rebounded after a weak period. French stocks outperformed despite political concerns. Ocado shares fell after Kroger's review of warehouse investments.",
            "pubDate": "2025-09-13T05:39:07.549779"
        },
        {
            "title": "Global stocks edge up with dollar, bond yields as Fed rate cuts loom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-edge-up-with-dollar-bond-yields-as-fed-rate-cuts-loom/articleshow/123863492.cms",
            "description": "Global equities saw a slight increase following a record close, while U.S. Treasury yields rebounded amid fluctuating rate cut expectations. U.S. consumer sentiment declined, with rising inflation expectations fueling investor concerns. Wall Street showed mixed performance after recent record highs, as investors await Federal Reserve Chair Jerome Powell's upcoming statements.",
            "pubDate": "2025-09-13T05:39:07.549878"
        }
    ]
}