{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-19T05:14:46.081060",
    "items": [
        {
            "title": "Sebi promotes broadened investor participation in infrastructure sector for enhanced liquidity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-promotes-broadened-investor-participation-in-infrastructure-sector-for-enhanced-liquidity/articleshow/123987431.cms",
            "description": "SEBI is looking to attract a wider range of investors, including mutual funds, pension funds, and retail participants, to the infrastructure sector to boost liquidity in infrastructure securities. Chairman Tuhin Kanta Pandey highlighted the need for expedited asset monetisation by state governments and cautioned against over-reliance on banks and government funding, advocating for market-based instruments to diversify risk.",
            "pubDate": "2025-09-19T00:47:19.408941"
        },
        {
            "title": "Stocks in news: Adani Enterprises, Adani Power, Vedanta, Texmaco Rail, Oil India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-adani-enterprises-adani-power-vedanta-texmaco-rail-oil-india/articleshow/123980753.cms",
            "description": "Markets showed volatility but maintained a positive trend. Adani Group stocks are in focus as Sebi dismissed allegations in the Hindenburg case. Indian Hotels clarified its leasehold rights for The Pierre hotel. Bombay Dyeing appointed Rohit Santhosh as CEO of Bombay Realty, while Oil India anticipates the restart of a Mozambique LNG project by year-end.",
            "pubDate": "2025-09-19T00:47:19.409062"
        },
        {
            "title": "NaBFID needs to make ambitious projects bankable: DFS secretary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nabfid-needs-to-make-ambitious-projects-bankable-dfs-secretary/articleshow/123987404.cms",
            "description": "NaBFID, having sanctioned ₹2 lakh crore in projects, is urged to enhance expertise and systems for long-term infrastructure viability, according to M Nagaraju. He suggested NaBFID act as a transaction advisor, mitigating early-stage risks to attract commercial investment. Focus should be on urban infrastructure and water, developing standards and engaging with states to improve project bankability.",
            "pubDate": "2025-09-19T00:47:19.409292"
        },
        {
            "title": "Motilal Oswal settles case with Sebi,  pays Rs 34.85 lakh as settlement charges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-settles-case-with-sebi-pays-rs-34-85-lakh-as-settlement-charges/articleshow/123987376.cms",
            "description": "Sebi has settled proceedings with Motilal Oswal Financial Services regarding a case of suspected front-running by the Chaturvedi Group, linked to a large client's trades. The brokerage paid ₹34.85 lakh as settlement charges. The regulator alleged the firm failed to maintain proper order records and attempted to create supporting documents post-execution, leading to a show-cause notice earlier this year.",
            "pubDate": "2025-09-19T00:47:19.409397"
        },
        {
            "title": "Will US Fed rate cut lead to revival of foreign investment in Indian stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-us-fed-rate-cut-lead-to-revival-of-foreign-investment-in-indian-stocks/articleshow/123987336.cms",
            "description": "Following the US Federal Reserve's rate cut, anticipation surrounds the potential return of foreign capital to Indian equities. However, high valuations in India and attractive opportunities in markets like China may temper inflows. While foreign selling has slowed, a significant turnaround hinges on domestic institutional investor activity and improved earnings momentum to shift FPI sentiment.",
            "pubDate": "2025-09-19T00:47:19.409493"
        },
        {
            "title": "Nifty, Sensex rise for a 3rd day after US Fed rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-sensex-rise-for-a-3rd-day-after-us-fed-rate-cut/articleshow/123987249.cms",
            "description": "Indian stock indices climbed for the third consecutive session on Thursday, buoyed by the US Federal Reserve's expected interest rate cut. The NSE Nifty and BSE Sensex both closed 0.4% higher, while the India Volatility Index hit a record low. Foreign and domestic portfolio investors were net buyers, contributing to the positive market sentiment.",
            "pubDate": "2025-09-19T00:47:19.409588"
        },
        {
            "title": "Stock Radar: Defense major HAL gains momentum; upside seen till Rs 5,130, Shivangi Sarda recommends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-defense-major-hal-gains-momentum-upside-seen-till-rs-5130-shivangi-sarda-recommends/articleshow/123972607.cms",
            "description": "Hindustan Aeronautics Limited stock broke out after consolidating for two months. Experts suggest short-term traders consider buying. The stock previously hit a high in May. It faced resistance around Rs 4,600. Support was found near Rs 4,300. The stock rallied over ten percent in a week. Analysts recommend a target of Rs 5,130 in the coming weeks.",
            "pubDate": "2025-09-19T00:47:19.409684"
        },
        {
            "title": "Step up infrastructure credit flow, India requires $4.5 trillion growth capital: PFRDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/step-up-infrastructure-credit-flow-india-requires-4-5-trillion-growth-capital-pfrda/articleshow/123987356.cms",
            "description": "India requires a substantial $4.5 trillion infrastructure investment by 2030 to maintain its desired growth. Sivasubramanian Ramann highlighted the shift in financing from banks to pension and insurance funds, better suited for long-term projects. Regulatory reforms and wider use of credit enhancement schemes are expected to boost credit flow and bond issuance for infrastructure companies.",
            "pubDate": "2025-09-19T00:47:19.409773"
        },
        {
            "title": "NCLT approves Gayatri Projects' settlement plan from promoters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nclt-approves-gayatri-projects-settlement-plan-from-promoters/articleshow/123987349.cms",
            "description": "The Hyderabad NCLT has approved a ₹2,400 crore OTS plan by Gayatri Projects' promoters, resolving ₹8,100 crore in dues to lenders led by Canara Bank. With 97% lender approval, the promoters have 90 days to pay ₹750 crore, cover bank guarantee invocations, and allocate ₹450 crore from arbitration claims.",
            "pubDate": "2025-09-19T00:47:19.409870"
        },
        {
            "title": "Godfrey Phillips India shares in focus following arrest of director Samir Modi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godfrey-phillips-india-shares-in-focus-following-arrest-of-director-samir-modi/articleshow/123988835.cms",
            "description": "Godfrey Phillips India's shares are under scrutiny after director Samir Modi's arrest in Delhi on rape charges, following a complaint filed by a former employee alleging repeated sexual assault since 2019. Modi's legal team denies the allegations, claiming extortion.",
            "pubDate": "2025-09-19T03:38:53.341143"
        },
        {
            "title": "Vedanta shares in focus after being named preferred bidder for manganese block in Andhra Pradesh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-after-being-named-preferred-bidder-for-manganese-block-in-andhra-pradesh/articleshow/123988791.cms",
            "description": "Vedanta share price: Vedanta has been declared the ‘Preferred Bidder’ for the Punnam Manganese Block in Andhra Pradesh after qualifying in the government’s auction process. The 152-hectare block is at the G4 exploration stage, and the license grant will be subject to regulatory approvals and conditions.",
            "pubDate": "2025-09-19T03:38:53.341269"
        },
        {
            "title": "Hindenburg case ends: 5 Adani Group stocks with potential to rally up to 58%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindenburg-case-ends-5-adani-group-stocks-with-potential-to-rally-up-to-58/slideshow/123988863.cms",
            "description": "The Sebi closure of investigations into the Hindenburg allegations has come as a major relief to the Adani Group. With the regulatory cloud lifted, brokerages have turned their focus back to fundamentals and growth potential. Here are five Adani stocks that analysts believe could rally significantly from current levels.",
            "pubDate": "2025-09-19T03:38:53.341385"
        },
        {
            "title": "Adani Group stocks in focus as Sebi clears Gautam Adani, Rajesh Adani of Hindenburg allegations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-in-focus-as-sebi-clears-gautam-adani-rajesh-adani-of-hindenburg-allegations/articleshow/123988723.cms",
            "description": "Adani Group share price: Sebi has given a clean chit to Gautam Adani, Rajesh Adani, and several Adani Group firms in the Hindenburg case, saying its probe found no fraud, fund misuse, or rule violations. The regulator said the transactions in question were regular loans and not related-party deals.",
            "pubDate": "2025-09-19T03:38:53.341489"
        },
        {
            "title": "Dividend alert: BEML, 56 other stocks to go ex-dividend on Monday. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-alert-beml-56-other-stocks-to-go-ex-dividend-on-monday-do-you-own-any/articleshow/123988670.cms",
            "description": "Investors seeking BEML Ltd's dividend must buy shares today. September 22 is the record date. Many listed firms also offer dividends with the same record date. A list of companies trading ex-dividend today includes AB Infrabuild, Accel Ltd, Bajaj Holdings, and many more. Investors should purchase shares before market close to receive dividends. This information is sourced from StockEdge data.",
            "pubDate": "2025-09-19T03:38:53.341591"
        },
        {
            "title": "Adani Power 1:5 stock split: Last day to buy shares for first-ever split eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-15-stock-split-last-day-to-buy-shares-for-first-ever-split-eligibility/articleshow/123988431.cms",
            "description": "Investors have one last chance to buy Adani Power shares to qualify for the stock split. The record date is September 22, 2025. Each share of face value Rs 10 will split into five shares of face value Rs 2. Shareholders approved the split on September 4, 2025. The company aims to increase outstanding shares and improve liquidity.",
            "pubDate": "2025-09-19T03:38:53.341692"
        },
        {
            "title": "Smallcap stock with 1,100% 5-year returns to go ex-bonus for 2:1 bonus issue. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stock-with-1100-5-year-returns-to-go-ex-bonus-for-21-bonus-issue-last-day-to-buy/articleshow/123988386.cms",
            "description": "Sandur Manganese & Iron Ores announces a 2:1 bonus issue. Investors aiming for bonus shares must buy shares today. September 22, 2025, is the record date. The company's stock has shown significant growth in the past. Shareholders will receive two shares for each share held. This bonus issue increases the total number of outstanding shares.",
            "pubDate": "2025-09-19T03:38:53.341787"
        },
        {
            "title": "Interns are being offered $14,000 a month by high-speed trading firms in India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/interns-are-being-offered-14000-a-month-by-high-speed-trading-firms-in-india/articleshow/123988097.cms",
            "description": "Despite regulatory scrutiny in India's equity derivatives market, high-speed trading firms are significantly increasing entry-level pay. Companies like IMC Trading and Quadeye are offering lucrative packages to interns and new hires, driven by the potential for substantial profits.",
            "pubDate": "2025-09-19T03:38:53.341881"
        },
        {
            "title": "Banco Products among 5 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banco-products-among-5-stocks-witness-5-year-swing-high-breakout/slideshow/123988057.cms",
            "description": "In the NSE list of companies with a market cap over Rs 10,000 crore, five stocks witnessed a 5-year swing high at the close on September 18, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as bullish, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-19T03:38:53.341975"
        },
        {
            "title": "Biocon, ITC among 8 Stocks flashing bullish RSI signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-itc-among-8-stocks-flashing-bullish-rsi-signals/slideshow/123988020.cms",
            "description": "Eight stocks in the Nifty200 pack were highlighted in the RSI Trending Up scan on September 18, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-19T03:38:53.342091"
        },
        {
            "title": "Positive Breakout: These 6 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-6-stocks-close-cross-above-their-200-dmas/slideshow/123987967.cms",
            "description": "The closing prices of six stocks from the Nifty500 pack crossed above their 200 DMAs (Daily Moving Averages) on September 18, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-19T03:38:53.342188"
        },
        {
            "title": "Wall Street indexes notch record-high closes as Intel soars on Nvidia stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-notch-record-high-closes-as-intel-soars-on-nvidia-stake/articleshow/123987858.cms",
            "description": "Wall Street saw record highs after the US Federal Reserve reduced interest rates. Chipmaker Intel experienced a significant surge following Nvidia's investment. The small-cap Russell 2000 index also reached a new high. The Fed indicated potential further rate cuts due to a softening job market. CrowdStrike shares rose after brokerage upgrades.",
            "pubDate": "2025-09-19T03:38:53.342280"
        },
        {
            "title": "Motilal Oswal bullish on HAL: breakout, strong volumes support uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-bullish-on-hal-breakout-strong-volumes-support-uptrend/videoshow/123979713.cms",
            "description": "“Hindustan Aeronautics (HAL) stock has remained in strong focus on the back of a sustained uptrend in both its price action and derivatives activity, reinforcing bullish strength from the chart as well as data. Traders can buy for a target of Rs 5130 in the next 2-3 weeks,” Shivangi Sarda, Analyst, Derivatives and Technical Research, Motilal Oswal Financial Services Ltd, said.",
            "pubDate": "2025-09-19T03:38:53.342375"
        },
        {
            "title": "Asian stocks rise as global gauge hits new peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-as-global-gauge-hits-new-peak/articleshow/123987572.cms",
            "description": "Asian stock markets are performing well. US equity benchmarks reached new highs. This was supported by the Federal Reserve's interest rate cut. Stocks in Japan and Australia increased. South Korea remained stable. The S&P 500 and other indexes achieved record highs together. The yen remained steady after Japan's inflation slowed. The Bank of Japan's rate decision is expected.",
            "pubDate": "2025-09-19T03:38:53.342465"
        },
        {
            "title": "Sebi gives clean chit to Adani on Hindenburg allegations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-gives-clean-chit-to-adani-on-hindenburg-allegations/articleshow/123987506.cms",
            "description": "Sebi has exonerated Gautam Adani and other Adani group companies regarding Hindenburg Research's allegations of stock manipulation. The investigation, spanning from FY13 to FY21, found no evidence of fraudulent transactions or siphoning of funds. Sebi concluded that the transactions in question did not qualify as related-party transactions, thus not violating listing agreements.",
            "pubDate": "2025-09-19T03:38:53.342558"
        },
        {
            "title": "Will Saatvik Green Energy IPO spark long-term value for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-saatvik-green-energy-ipo-spark-long-term-value-for-investors/articleshow/123987460.cms",
            "description": "Saatvik Green Energy, a solar module manufacturer, is planning an IPO. The company aims to raise ₹700 crore through fresh equity. It will use the funds to expand capacity and repay debt. An additional ₹200 crore will be raised through an offer for sale. The IPO will reduce promoter stake to 76.02%. Saatvik's financials show strong revenue and profit growth.",
            "pubDate": "2025-09-19T03:38:53.342655"
        },
        {
            "title": "Tata Investment, STL Networks among 9 stocks flashing White Marubozu breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-stl-networks-among-9-stocks-flashing-white-marubozu-breakouts/slideshow/123989222.cms",
            "description": "On September 18, nine NSE-listed stocks with a market cap above Rs 1,000 crore appeared on the bullish “White Marubozu” scanner, according to StockEdge’s technical scan data.A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest point of the session and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and little or no lower shadow, it signals strong buying pressure throughout the day. Traders often view it as an indication that buyers dominated from open to close, using it as a cue for potential bullish momentum.",
            "pubDate": "2025-09-19T03:59:15.240452"
        },
        {
            "title": "Vodafone Idea shares in focus ahead of key AGR hearing in Supreme Court",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-ahead-of-key-agr-hearing-in-supreme-court/articleshow/123989125.cms",
            "description": "Vodafone Idea shares will be in focus on September 19 as the Supreme Court hears its plea against the DoT’s Rs 9,450 crore AGR demand. The telco argues the claim includes duplications and pre-merger liabilities, while the DoT calls it pending account finalisation. The verdict could impact Vodafone Idea’s funding talks and long-term financial strategy.",
            "pubDate": "2025-09-19T03:59:15.240579"
        },
        {
            "title": "Biocon, Laurus Labs among 6 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-laurus-labs-among-6-stocks-that-closed-above-vwap/slideshow/123989085.cms",
            "description": "On September 18, the closing prices of six stocks in the Nifty500 pack ended over 1% higher than their VWAP (Volume Weighted Average Price), according to StockEdge’s technical scan data. A move above VWAP is typically seen as a potential bullish signal.When the closing price is above the VWAP, it means the stock closed higher than the average price at which it traded during the day, with the average weighted by trading volume. Traders and investors often interpret this as an indication of positive market sentiment.",
            "pubDate": "2025-09-19T03:59:15.240682"
        },
        {
            "title": "Indian Bank, HFCL, among 8 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-bank-hfcl-among-8-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123989040.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack as of September 18, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-19T03:59:15.240777"
        },
        {
            "title": "Ola Electric shares rally 40% in one month. Are you missing out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-rally-40-in-one-month-are-you-missing-out/articleshow/123989521.cms",
            "description": "Ola Electric shares have experienced a 40% surge in the past month, driven by supportive government policies, improved operational efficiency, and overall sector optimism. The company's eligibility for Production Linked Incentive scheme and enhanced gross margins have boosted investor confidence. However, technical indicators present a mixed outlook, with analysts suggesting potential short-term corrections despite the positive trend.",
            "pubDate": "2025-09-19T04:24:43.040618"
        },
        {
            "title": "Indian Hotels shares in focus after clarification on Pierre Hotel exit buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-hotels-shares-in-focus-after-clarification-on-pierre-hotel-exit-buzz/articleshow/123989481.cms",
            "description": "Indian Hotels Company clarified it does not own but operates New York’s The Pierre under leasehold rights, dismissing reports of a $2 billion exit deal as “misleading and speculative.” The filing stressed hotel operations remain unaffected, with disclosures to follow if required. The clarification comes amid IHCL’s selective overseas strategy and focus on city-specific opportunities.",
            "pubDate": "2025-09-19T04:24:43.040743"
        },
        {
            "title": "Foreign holdings of US treasuries hit record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-holdings-of-us-treasuries-hit-record-high/slideshow/123989497.cms",
            "description": "Foreign holdings of U.S. Treasuries surged to a record $9.159 trillion in July, up from $9.126 trillion in June. Compared with a year earlier, Treasuries owned by foreigners have increased by nearly 9%, reflecting a steady appetite for U.S. government debt. (Source: Reuters)",
            "pubDate": "2025-09-19T04:24:43.040849"
        },
        {
            "title": "BOJ keeps interest rates steady, decides to start selling ETFs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-keeps-interest-rates-steady-decides-to-start-selling-etfs/articleshow/123989415.cms",
            "description": "The Bank of Japan (BOJ) has decided to maintain its short-term interest rates at 0.5% following a two-day policy meeting. However, in a significant shift, the BOJ will begin selling its holdings of exchange-traded funds (ETFs) and real-estate investment trusts (REITs). The decision saw dissent from board members Naoki Tamura and Hajime Takata.",
            "pubDate": "2025-09-19T04:24:43.040963"
        },
        {
            "title": "5 big-ticket IPOs gearing up for Diwali debut. Check details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-big-ticket-ipos-gearing-up-for-diwali-debut-check-details-here/slideshow/123989405.cms",
            "description": "India’s IPO market is regaining momentum after bouts of volatility, with startup listings taking centre stage. With Sebi’s regulatory reforms and strong domestic SIP inflows cushioning foreign outflows, bankers expect three to five startups to hit the market around Diwali, according to a report by the Times of India. Here are five of the hottest IPOs lining up for a late October–November debut.",
            "pubDate": "2025-09-19T04:24:43.041059"
        },
        {
            "title": "Sensex sheds over 200 pts, Nifty50 below 25,400 as D-St snaps 3-day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-sheds-over-200-pts-nifty50-below-25400-as-d-st-snaps-3-day-rally/articleshow/123989293.cms",
            "description": "Indian stocks experienced a slight downturn on Friday, halting a three-day rally. The Sensex and Nifty 50 indices both opened lower, influenced by tempered enthusiasm regarding potential U.S. Federal Reserve rate cuts and the advancement of trade discussions between India and the United States. Investors are adopting a cautious approach after recent gains.",
            "pubDate": "2025-09-19T04:24:43.041156"
        },
        {
            "title": "The big Rs 1.4 lakh crore question: Are FIIs done betting against Sensex, Nifty?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-big-rs-1-4-lakh-crore-question-are-fiis-done-betting-against-sensex-nifty/articleshow/123989350.cms",
            "description": "Foreign investors may reverse their stance on Indian markets. A rally in Sensex and Nifty is expected. US Federal Reserve rate cuts and India's economic resilience are key factors. GST reductions and other reforms are also important. Earnings recovery is expected from Q3FY26. This could trigger renewed capital inflows. The macroeconomic foundation of India remains strong.",
            "pubDate": "2025-09-19T04:24:43.041249"
        },
        {
            "title": "Waaree Energies shares in focus after board okays Racemosa stake buy by unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-in-focus-after-board-okays-racemosa-stake-buy-by-unit/articleshow/123989301.cms",
            "description": "Waaree Energies' subsidiary, Waaree Power, is set to acquire a 76% stake in Racemosa Energy, a smart meter manufacturer, for approximately Rs 53 crore. This strategic move will allow Waaree to enhance its renewable energy and power distribution offerings by leveraging Racemosa's expertise in smart metering solutions. The deal, expected to close in FY 2025-26, is subject to regulatory approvals.",
            "pubDate": "2025-09-19T04:24:43.041343"
        },
        {
            "title": "John Cockerill India shares jump 4% on after bagging contract from Tata Steel in Jamshedpur",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/john-cockerill-india-shares-in-focus-on-tata-steels-jamshedpur-project-contract/articleshow/123989269.cms",
            "description": "John Cockerill India's shares rose after securing a contract from Tata Steel to supply a push-pull pickling line and acid regeneration plant for its Jamshedpur Tinplate Division. The advanced technology aims to enhance production efficiency and support Tata Steel's sustainability goals. Earlier this month, the company also secured a contract from JSW JFE Electrical Steel Nashik.",
            "pubDate": "2025-09-19T04:24:43.041436"
        },
        {
            "title": "Adani Power shares soar 9% as Morgan Stanley initiates coverage with 'Overweight' rating, 30% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-soar-9-as-morgan-stanley-initiates-coverage-with-overweight-rating-30-upside-seen/articleshow/123989945.cms",
            "description": "Adani Power share price: Morgan Stanley initiated coverage of Adani Power with an Overweight rating and a Rs 818 price target, seeing nearly 30% upside. The brokerage highlighted the company’s large coal-based capacity, growth plans to 41.9 GW by FY32, and robust long-term PPAs under India’s SHAKTI policy.",
            "pubDate": "2025-09-19T05:14:44.327904"
        },
        {
            "title": "UK consumer confidence dips ahead of November Budget",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uk-consumer-confidence-dips-ahead-of-november-budget/slideshow/123990174.cms",
            "description": "Britons grew more pessimistic in September, with GfK reporting that the consumer confidence index fell to -19, down from -17 in August. August had been the highest reading since December last year, but September’s decline shows renewed concerns among households. The figure was also slightly below the -18 forecast in a Reuters poll. (Source: Reuters)",
            "pubDate": "2025-09-19T05:14:44.328034"
        },
        {
            "title": "BOJ keeps interest rates steady, decides to start selling ETFs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-keeps-interest-rates-steady-decides-to-start-selling-etfs/articleshow/123989780.cms",
            "description": "The Bank of Japan has maintained its short-term interest rates at 0.5%. However, the central bank decided to begin selling its exchange-traded funds and real-estate investment trusts. Naoki Tamura and Hajime Takata dissented to the decision. Governor Kazuo Ueda will explain the decision at a news conference. The policy meeting concluded on Friday.",
            "pubDate": "2025-09-19T05:14:44.328138"
        }
    ]
}