{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-15T13:21:37.046946",
    "items": [
        {
            "title": "ICICI Lombard Q2 net profit rises 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-lombard-q2-net-profit-rises-18/articleshow/124565244.cms",
            "description": "ICICI Lombard General Insurance saw an 18% net profit increase in Q2 FY26 despite a 1.9% dip in gross direct premium income. The insurer's combined ratio edged up to 105.1%, with a dividend of ₹6.5 per share declared. The company maintains a solvency ratio of 2.73x, exceeding regulatory requirements.",
            "pubDate": "2025-10-15T01:54:52.674506"
        },
        {
            "title": "HDB Financial Q2 results today: Shares in consolidation mode after listing. Should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdb-financial-q2-results-today-shares-in-consolidation-mode-after-listing-should-you-buy/articleshow/124565763.cms",
            "description": "HDB Financial Services shares are in focus today. The company will announce its September-quarter results. The stock has slipped since its market debut. Investors are cautious due to sector pressures. Analysts expect loan growth and modest margin expansion. Credit costs are anticipated to rise. The company's performance and asset quality will be closely watched.",
            "pubDate": "2025-10-15T07:50:14.727754"
        },
        {
            "title": "IRFC Q2 Results: PAT jumps 10% YoY to Rs 1,777 crore, revenue falls 8%. Rs 1.05/share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irfc-q2-results-profit-jumps-10-yoy-to-rs-1777-crore-revenue-falls-8-rs-1-05/share-dividend-announced/articleshow/124572902.cms",
            "description": "IRFC Q2 Results: Indian Railway Finance Corporation (IRFC) reported a 10% year-on-year growth in its September quarter net profit, reaching Rs 1,777 crore. However, total revenue from operations declined by 8% to Rs 6,372 crore compared to the previous year. The company also announced an interim dividend of Rs 1.05 per share.",
            "pubDate": "2025-10-15T09:20:45.507603"
        },
        {
            "title": "Nestle Q2 Preview: Profit to mark subdued growth inflation weighs on margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-q2-preview-profit-to-mark-subdued-growth-inflation-weighs-on-margins/articleshow/124572155.cms",
            "description": "Nestle India’s Q2FY26 profit is likely to rise just 1% YoY, with sales up around 4%, as GST destocking and rising input costs weigh on margins, according to the average of five brokerage estimates. Analysts expect volume growth to remain modest, while festive-quarter demand may support a recovery.",
            "pubDate": "2025-10-15T09:20:45.507737"
        },
        {
            "title": "Infosys Q2 Preview: Profit likely up 10% YoY on margin tailwinds and steady deal momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q2-preview-profit-likely-up-10-yoy-on-margin-tailwinds-and-steady-deal-momentum/articleshow/124571705.cms",
            "description": "Infosys Q2FY26 profit is expected to rise 10% YoY with revenue growth of 10%, supported by large-deal momentum, stable BFSI demand, and cost efficiencies. Investors will watch margin trends, GenAI adoption, and management guidance amid cautious discretionary IT spending.",
            "pubDate": "2025-10-15T09:20:45.507869"
        },
        {
            "title": "Wipro Q2 Preview: Profit may rise 4% YoY amid weak demand and deal ramp-ups",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q2-preview-profit-may-rise-4-yoy-amid-weak-demand-and-deal-ramp-ups/articleshow/124571570.cms",
            "description": "Wipro’s Q2FY26 profit is seen rising 4% YoY with 2% revenue growth. Analysts expect margins to remain under pressure due to large-deal ramp-ups. Investors will focus on the deal pipeline, Europe traction, and GenAI adoption amida  slow discretionary spending recovery.",
            "pubDate": "2025-10-15T09:20:45.507985"
        },
        {
            "title": "Tata Communications Q2 Results: PAT falls 27% YoY to Rs 183 crore; revenue up over 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-communications-q2-results-pat-falls-27-yoy-to-rs-183-crore-revenue-up-over-6/articleshow/124573694.cms",
            "description": "Tata Communications reported a 27% year-on-year fall in profit to Rs 183 crore in Q2 FY26, despite a 6.5% rise in revenue to Rs 6,100 crore. EBITDA grew modestly, while margins declined slightly due to higher costs.",
            "pubDate": "2025-10-15T09:55:00.091438"
        },
        {
            "title": "HDFC AMC announces first-ever 1:1 bonus share issue. Check key details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-amc-announces-first-ever-11-bonus-share-issue-check-key-details/articleshow/124574272.cms",
            "description": "HDFC AMC announces its first-ever 1:1 bonus issue, doubling shareholders’ equity and enhancing stock liquidity. The move rewards long-term investors. The company posted a 24.6% YoY rise in Q2 FY26 net profit to Rs 718.43 crore in earnings announced on Wednesday.",
            "pubDate": "2025-10-15T10:13:54.182792"
        },
        {
            "title": "HDFC Life Q2 Results: Cons PAT up 3% YoY to Rs 448 crore, NPI jumps 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-life-q2-results-cons-pat-up-3-to-rs-448-crore-npi-jumps-14/articleshow/124574403.cms",
            "description": "HDFC Life Insurance Company on Wednesday reported a 3% YoY growth in its consolidated Q2 net profit at Rs 448 crore versus Rs 435 crore in the year ago period.",
            "pubDate": "2025-10-15T10:37:49.039952"
        },
        {
            "title": "Axis Bank Q2 results: Standalone profit falls 26% YoY to Rs 5,090 crore as provisions spike sharply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q2-results-standalone-net-profit-falls-26-yoy-to-rs-5090-crore-nii-up-2/articleshow/124574431.cms",
            "description": "Axis Bank's standalone net profit experienced a significant 25% year-on-year decline, falling to Rs 5,090 crore in the second quarter. This decrease occurred despite a marginal 2% rise in net interest income, which reached Rs 13,744 crore during the same period.",
            "pubDate": "2025-10-15T10:37:49.040083"
        },
        {
            "title": "Eternal Q2 Preview: Blinkit to power 137% YoY topline surge, but among villains for up to 71% PAT fall. 5 things to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-q2-review-blinkit-to-power-137-yoy-topline-surge-but-among-villains-for-up-to-71-pat-fall-5-things-to-watch/articleshow/124580291.cms",
            "description": "Eternal’s Q2 revenue may surge up to 137% YoY, led by Blinkit growth, but profitability could fall as much as 71% due to elevated costs, rider incentives, and marketing spends, brokerages estimate. The Zomato parent is set to announce its Q2 earnings on Thursday, October 1.",
            "pubDate": "2025-10-15T13:21:34.884176"
        },
        {
            "title": "Swiggy, Eternal to see margins improve in Q2FY26: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swiggy-eternal-to-see-margins-improve-in-q2fy26-analysts/articleshow/124578488.cms",
            "description": "Indian online delivery firms Eternal and Swiggy could see profit margins improve slightly in the second quarter, analysts said, after at least a year of accelerating losses in their quick commerce arms due to higher costs.",
            "pubDate": "2025-10-15T13:21:34.884443"
        },
        {
            "title": "HDB Financial Services Q2 Results: Profit drops 2% YoY to Rs 581 crore, NII jumps 20%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdb-financial-services-q2-results-profit-drops-2-yoy-to-rs-581-crore/articleshow/124577246.cms",
            "description": "HDB Financial Services Q2 Results: HDB Financial reported a marginal 2% drop in net profit to Rs 581 crore for the July-September quarter, despite a 13% increase in revenue to Rs 4,545 crore. Net interest income rose 20% YoY to Rs 2,192 crore, supported by higher yields and efficient funding. The company's gross loan book grew 13% YoY to Rs 1.",
            "pubDate": "2025-10-15T13:21:34.884536"
        }
    ]
}