{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-01T07:32:42.516823",
    "items": [
        {
            "title": "It is better to look beyond hotel stocks to capture the full spectrum of travel spending: 17 stocks from the whole tourism ecosystem",
            "link": "/markets/stocks/news/it-is-better-to-look-beyond-hotel-stocks-to-capture-the-full-spectrum-of-travel-spending-17-stocks-from-the-whole-tourism-ecosystem/articleshow/112964419.cms",
            "description": "While there can be a debate on whether, after the run up that hotel stocks saw in the last three years, are they cheap or not, and whether one should buy them now. But when it comes to tourism and the possibility that it will grow at a much faster rate, there is little room for debate. Now the question is if one buys only one set of stocks, for example hotel stocks, they come with their own plus and minus, right from the business risk of that industry to the fact that in tourism business, there are many segments, so there is a premium segment, there are travelers who travels by train and stay in medium size hotel which are not even listed. But then he has spent money in booking his ticket which has been captured on a railways ticketing platform. So, why not have that railway ticketing platform in a small portion of the portfolio.",
            "pubDate": "2024-09-01T07:32:42.516128"
        },
        {
            "title": "FPI inflows in equities drop to Rs 7,320 crore in August due to higher valuations",
            "link": "/markets/stocks/news/fpis-inflow-in-equities-drops-to-rs-7320-cr-in-august-on-higher-valuations/articleshow/112963767.cms",
            "description": "While September is likely to see continued interest from FPIs, the flows would be shaped by a combination of domestic political stability, economic indicators, global interest rate movements, market valuations, sectoral preferences, and the attractiveness of the debt market, Vipul Bhowar, Director Listed Investments, Waterfield Advisors, said.",
            "pubDate": "2024-09-01T07:32:42.516174"
        },
        {
            "title": "Tiny Titans! 9 penny stocks surge 10-55% in a week",
            "link": "/markets/stocks/news/tiny-titans-9-penny-stocks-surge-10-55-in-a-week/slideshow/112963354.cms",
            "description": "In the week ending August 30, the Indian benchmark index Sensex posted a weekly gain of approximately 1.58%. During this rally, nine penny stocks saw their prices rise between 10% and 55%. Our selection criteria focused on stocks with a market capitalization below Rs 1,000 crore, a share price under Rs 20, and a trading volume exceeding 5 lakh shares. (Data Source: ACE Equity)",
            "pubDate": "2024-09-01T07:32:42.516208"
        },
        {
            "title": "NBCC board approves 1:2 bonus issue, fixes record date",
            "link": "/markets/stocks/news/nbcc-board-approves-12-bonus-issue-fixes-record-date/articleshow/112963430.cms",
            "description": "The Board of NBCC has approved a 1:2 bonus share issue, granting one additional share for every two shares currently held. October 7 has been set as the record date to determine eligibility. The bonus shares will be issued from free reserves, as per the audited financial statements for March 2024, with reserves of Rs 1,959 crore available for capitalization.",
            "pubDate": "2024-09-01T07:32:42.516239"
        },
        {
            "title": "M-cap of 8 of top-10 most valued firms rises Rs 1.53 lakh crore; Airtel, Infosys biggest gainers",
            "link": "/markets/stocks/news/mcap-of-8-of-top-10-most-valued-firms-surge-rs-1-53-lakh-crore-airtel-infosys-biggest-gainers/articleshow/112963184.cms",
            "description": "Rallying for the ninth straight session on Friday, the 30-share BSE Sensex climbed 231.16 points or 0.28 per cent to settle at an all-time closing high of 82,365.77. During the day, it jumped 502.42 points or 0.61 per cent to hit a record intra-day peak of 82,637.03.",
            "pubDate": "2024-09-01T07:32:42.516270"
        },
        {
            "title": "NBCC board approves 1:2 bonus issue, fixes record date",
            "link": "/markets/stocks/news/nbcc-board-approves-12-bonus-issue-fixes-record-date/articleshow/112963131.cms",
            "description": "The bonus shares, once allotted, will rank pari passu with the existing equity shares in all respects. They will carry the same rights and will be entitled to participate fully in any dividends and other corporate actions.",
            "pubDate": "2024-09-01T07:32:42.516300"
        },
        {
            "title": "​Technical Breakout Stocks: How to trade Glenmark Pharma, Oil India and MCX on Monday",
            "link": "/markets/stocks/news/technical-breakout-stocks-how-to-trade-glenmark-pharma-oil-india-and-mcx-on-monday/slideshow/112962342.cms",
            "description": "The Indian market hit a fresh record high on Friday, tracking positive global cues. The S&P BSE Sensex rallied more than 200 points, while the Nifty50 closed above the 25,200 level.The S&P BSE Sensex reached a record high of 82,637, and the Nifty50 hit a high of 25,268.",
            "pubDate": "2024-09-01T07:32:42.516336"
        },
        {
            "title": "FII action, global cues and 6 more factors that will steer D-Street this week",
            "link": "/markets/stocks/news/fii-action-global-cues-and-6-more-factors-that-will-steer-d-street-this-week/articleshow/112962243.cms",
            "description": "The Indian rupee ended little changed on Friday as dollar demand from state-run banks offset the potential impact of inflows into local equities. The rupee closed at 83.8625 against the US dollar, nearly flat compared to its previous close of 83.87. While most Asian currencies rallied between 2% and 6% in August, the rupee weakened by 0.2%, marking its second consecutive monthly decline.",
            "pubDate": "2024-09-01T07:32:42.516369"
        },
        {
            "title": "Nifty at new highs. Time to be both, bullish & selective: 6 midcap stocks from different sectors with upside potential of up to 47%",
            "link": "/markets/stocks/news/nifty-at-new-highs-time-to-be-both-bullish-selective-6-midcap-stocks-from-different-sector-with-upside-potential-of-up-to-47/articleshow/112962108.cms",
            "description": "As Nifty and Sensex continue to scale new highs, there is a mixed feeling on the street . How to manage the relationship between opportunity and challenges. Given the way markets are panning out, yes there are opportunities to make returns in a short term. But the challenge is finding the right stock which not only delivers a return in the short term but is also worth holding in the portfolio for the long term. So, one has to strike a balance between being bullish and finding the stocks which in case of a decline in market fall less. While there is no full proof of doing it, there are some simple things that if one looks at before buying the stocks, it would help in finding the stocks which have higher probability delivering return with relative lesser drawn down.",
            "pubDate": "2024-09-01T07:32:42.516400"
        },
        {
            "title": "The uncommon combination, dividend yield & capital gains: 8 stocks with dividend yield of 4-7% and upside potential of up to 28%",
            "link": "/markets/stocks/news/the-uncommon-combination-dividend-yield-capital-gains-8-stocks-with-dividend-yield-of-4-7-and-upside-potential-of-up-to-28/articleshow/112961850.cms",
            "description": "In a market which is giving decent capital gains both the level of index and stocks, looking at dividend yield stocks might not appeal to the majority. But when valuations are high and an investor has to make a choice between two kinds of stocks. A newly listed company promising to be profitable in next four years or till eternity & quoting at US $ 6 billion market capitalization or a company which has paid dividend for the last 10 years, what choice one would make. Maybe dividend yield which is reality rather than a promise of profitability.",
            "pubDate": "2024-09-01T07:32:42.516430"
        },
        {
            "title": "NBCC announces issue of bonus shares in 1:2 ratio; to use Rs 90 crore free reserve for this purpose",
            "link": "/markets/stocks/news/nbcc-announces-issue-of-bonus-shares-in-12-ratio-to-use-rs-90-crore-free-reserve-for-this-purpose/articleshow/112953554.cms",
            "description": "State-owned NBCC (India) Ltd has approved the issuance of bonus shares in a 1:2 ratio, utilising Rs 90 crore from free reserves. The company will distribute 90 crore bonus shares, with October 7, 2024, set as the record date. This move aims to boost shareholder value and reflects the company's strong financial position.",
            "pubDate": "2024-09-01T07:32:42.516458"
        },
        {
            "title": "FPIs remain net buyers of Indian equities at Rs 7,320 crore in August",
            "link": "/markets/stocks/news/fpis-remain-net-buyers-of-indian-equities-at-rs-7320-crore-in-august/articleshow/112948703.cms",
            "description": "In August, Foreign Portfolio Investors (FPIs) were net buyers of Indian equities at Rs 7,320 crore, increasing their 2024 total to Rs 42,886 crore. FPIs' recent activity shows a fluctuating trend, with notable purchases in July and February-March, and sales in April-May and January.",
            "pubDate": "2024-09-01T07:32:42.516485"
        },
        {
            "title": "Dalal Street Week Ahead: Market uptrend strong; stay selective and cautious",
            "link": "/markets/stocks/news/dalal-street-week-ahead-market-uptrend-strong-stay-selective-and-cautious/articleshow/112948573.cms",
            "description": "The month ended as well; Nifty posted a monthly gain of 284.75 points (+1.14%) The markets are in a strong uptrend; however, once again it has created a situation wherein they have sharply deviated from their mean.",
            "pubDate": "2024-09-01T07:32:42.516513"
        },
        {
            "title": "Ever wondered how a fund manager picks stocks? Learn from the horse's mouth",
            "link": "/markets/stocks/news/ever-wondered-how-a-fund-manager-picks-stocks-learn-from-the-horses-mouth/articleshow/112947960.cms",
            "description": "Charlie Munger believed the key to big returns is patience and conviction in investing. ETMarkets is hosting an online session with Gautam Baid of Stellar Wealth Partners to guide investors on stock selection. Register for the event to enhance your investment strategy.",
            "pubDate": "2024-09-01T07:32:42.516541"
        },
        {
            "title": "Emami to acquire remaining 49.6% stake in 'The Man Company'",
            "link": "/markets/stocks/news/emami-to-acquire-remaining-49-6-stake-in-the-man-company/articleshow/112946955.cms",
            "description": "Emami has completed the acquisition of the remaining 49.6% stake in Helios Lifestyle, full owner of 'The Man Company'. This final acquisition strengthens Emami's presence in the digital-first premium male grooming segment, complementing its existing brands. Emami plans to further enhance the growth potential of The Man Company.",
            "pubDate": "2024-09-01T07:32:42.516573"
        },
        {
            "title": "Ircon, Deepak Fertilisers among 98 stocks with dividend, bonus, split, rights issue next week. Do you own any?",
            "link": "/markets/stocks/news/ircon-deepak-fertilisers-among-98-stocks-with-dividend-bonus-split-rights-issue-next-week-do-you-own-any/articleshow/112946688.cms",
            "description": "Ircon International, Deepak Fertilisers, and Sapphire Foods are among the companies set to be in focus next week as they reach record dates for dividends, bonus issues, rights issues, and stock splits. Record dates determine eligible shareholders for these offers, ensuring shares are in demat accounts by the stipulated time.",
            "pubDate": "2024-09-01T07:32:42.516600"
        }
    ]
}