{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-16T05:09:08.648329",
    "items": [
        {
            "title": "US companies could report earnings twice a year under Trump's plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-companies-could-report-earnings-twice-a-year-under-trumps-plan/slideshow/123913572.cms",
            "description": "President Donald Trump speaks in the Oval Office of the White House, Monday, Sept. 15, 2025, in Washington.",
            "pubDate": "2025-09-16T04:37:53.137820"
        },
        {
            "title": "Buy, Sell or Hold: Nomura remains neutral on Maruti Suzuki; Citi recommends buy on Reliance Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nomura-remains-neutral-on-maruti-suzuki-citi-recommends-buy-on-reliance-industries/articleshow/123913331.cms",
            "description": "Global brokerages are offering insights on key Indian companies, adjusting their outlooks as sectors evolve. Nomura is neutral on Maruti Suzuki, noting the Victoris SUV launch and shifting demand. Citi is positive on Reliance Industries, citing regulatory clarity and Jio's potential listing.",
            "pubDate": "2025-09-16T04:37:53.137939"
        },
        {
            "title": "Gujarat Gas shares rise over 1% ahead of shareholder meeting on merger plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-gas-shares-in-focus-ahead-of-shareholder-meeting-on-merger-plan/articleshow/123913269.cms",
            "description": "Gujarat Gas shares saw a rise as the company, along with GSPL and GSPC, seeks shareholder approval for its amalgamation scheme. The restructuring aims to simplify the holding structure and unlock value for shareholders. Technical analysis suggests short-term bullish undertones, while longer-term trends remain bearish, with investors closely monitoring the merger's progress.",
            "pubDate": "2025-09-16T04:37:53.138070"
        },
        {
            "title": "Zydus Lifesciences shares in focus on USFDA nod for canine drug",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-on-usfda-nod-for-canine-drug/articleshow/123913214.cms",
            "description": "Shares of Zydus Lifesciences are likely in focus after its subsidiary, ZyVet Animal Health, launched the first FDA-approved generic treatment for canine urinary incontinence in the U.S. The phenylpropanolamine hydrochloride tablets target aging and spayed female dogs, marking a significant move into the underserved animal generics market and reinforcing ZyVet’s focus on affordable, high-quality veterinary care.",
            "pubDate": "2025-09-16T04:37:53.138173"
        },
        {
            "title": "Golden Crossovers: Caplin Point Lab among 4 stocks that signal further bullishness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/golden-crossovers-caplin-point-lab-among-4-stocks-that-signal-further-bullishness/slideshow/123913181.cms",
            "description": "In the NSE list of stocks with a market cap of Rs 1,000 crore, four stocks are witnessing Golden Crossovers, according to stockedge.com's technical scan data. Golden Cross is an important technical indicator of bullishness. It occurs when the short-term moving average crosses over the major long-term moving average on the upside. These stocks' 50-day simple moving averages (SMA) crossed their 200-day SMAs on September 15.",
            "pubDate": "2025-09-16T04:37:53.138269"
        },
        {
            "title": "Transrail Lighting shares in focus on massive order win. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/transrail-lighting-shares-in-focus-on-massive-order-win-check-details/articleshow/123913062.cms",
            "description": "Transrail Lighting shares may be in focus after the company secured fresh orders worth Rs 421 crore, including a major transmission line project in a new African market. With this, cumulative order inflows for FY26 crossed Rs 3,500 crore as of August 2025, up 78% year-on-year, underscoring its diversified presence and growing global footprint.",
            "pubDate": "2025-09-16T04:37:53.138368"
        },
        {
            "title": "Canara Bank shares in focus as Sebi clears life insurance arm’s IPO plans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canara-bank-shares-in-focus-as-sebi-clears-life-insurance-arms-ipo-plans/articleshow/123913030.cms",
            "description": "Canara Bank will be in focus after its subsidiary, Canara HSBC Life Insurance, received Sebi’s nod to proceed with its IPO by filing an Updated Draft Red Herring Prospectus. The proposed offer for sale will include up to 23.75 crore shares, with Canara Bank, HSBC Insurance, and Punjab National Bank among the key selling shareholders.",
            "pubDate": "2025-09-16T04:37:53.138470"
        },
        {
            "title": "Sensex rises over 200 pts, Nifty50 tops 25,100 as US trade deal optimism lifts sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-100-pts-nifty50-tops-25100-as-us-trade-deal-optimism-lifts-sentiment/articleshow/123912958.cms",
            "description": "Indian stock markets saw a positive start on Tuesday. This mirrored gains in Asian markets. Investor confidence grew due to progress in US-China and US-India trade talks. Auto stocks performed well, boosting the market. Attention is now on the Federal Reserve's upcoming interest rate decision. The Sensex and Nifty both experienced initial increases.",
            "pubDate": "2025-09-16T04:37:53.138562"
        },
        {
            "title": "Asahi India, SBI Cards among 6 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asahi-india-sbi-cards-among-6-stocks-that-closed-above-vwap/slideshow/123912856.cms",
            "description": "On September 15, six stocks from the Nifty500 pack closed more than 1% above their VWAP (Volume Weighted Average Price), according to StockEdge.com’s technical scan data. A move above VWAP is generally seen as a potential bullish signal, indicating that the closing price is higher than the average traded price of the day, weighted by volume—often suggesting positive market sentiment.",
            "pubDate": "2025-09-16T04:37:53.138653"
        },
        {
            "title": "Rail Vikas Nigam among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rail-vikas-nigam-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123912755.cms",
            "description": "As of September 15, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, leading to an overall increase of over 5% compared to the previous session. A significant uptick in futures open interest indicates strong growth in the number of active, unexpired futures contracts in a given security. This trend reflects a rise in market participation, with traders either initiating new positions or expanding existing ones.",
            "pubDate": "2025-09-16T04:37:53.138749"
        },
        {
            "title": "Ola Electric shares in focus after filing Rs 400 crore PLI claim",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-after-filing-rs-400-crore-pli-claim/articleshow/123912641.cms",
            "description": "Ola Electric shares price: Ola Electric has filed a Rs 400 crore claim under the government’s Production-Linked Incentive (PLI) scheme, backed by eligible sales of Rs 3,000 crore for FY25. This marks its second consecutive year qualifying for incentives, strengthening its position in India’s EV manufacturing ecosystem.",
            "pubDate": "2025-09-16T04:37:53.138843"
        },
        {
            "title": "NCC shares rally 5% on winning Rs 2,090 crore reservoir project in Bihar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncc-shares-in-focus-on-winning-rs-2090-5-crore-reservoir-project-in-bihar/articleshow/123912602.cms",
            "description": "NCC share price: NCC Ltd has won a Rs 2,090.5 crore contract from Bihar’s Water Resources Department for the construction of the Barner Reservoir Scheme in Jamui district. The project involves building reservoir and dam structures, irrigation channels, and related works, with a 30-month execution period.",
            "pubDate": "2025-09-16T04:37:53.138936"
        },
        {
            "title": "Wipro shares in focus after AI-powered security partnership with CrowdStrike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-in-focus-after-ai-powered-security-partnership-with-crowdstrike/articleshow/123912243.cms",
            "description": "Wipro share price: Wipro and CrowdStrike have launched CyberShield MDR, an AI-powered managed security service leveraging Falcon Next-Gen SIEM to boost threat detection, automate responses, and streamline SOC operations. The collaboration aims to tackle cyber threats, reduce alert fatigue, and enhance enterprise-level security efficiency globally.",
            "pubDate": "2025-09-16T04:37:53.139085"
        },
        {
            "title": "ICICI Bank, DLF, among 7 stocks showing RSI Trending Up on September 15",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-dlf-among-7-stocks-showing-rsi-trending-up-on-september-15/slideshow/123912277.cms",
            "description": "Seven stocks from the NSE large cap pack were highlighted in the RSI Trending Up scan on September 15, based on data from stockedge.com. If the RSI value crosses above 50 from below, it is generally considered an uptrend signal. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-16T04:37:53.139181"
        },
        {
            "title": "Godawari Power, Radico Khaitan among 7 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godawari-power-radico-khaitan-among-7-stocks-witness-5-year-swing-high-breakout/slideshow/123912200.cms",
            "description": "In the Nifty500 segment, seven stocks witnessed a 5-year swing high at the close on September 15, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-16T04:37:53.139271"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Maruti Suzuki, United Spirits among 5 stocks that could give 10-25% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-maruti-suzuki-united-spirits-among-5-stocks-that-could-give-10-25-return/slideshow/123912081.cms",
            "description": "Brokerages remain constructive on key names across autos and beverages, citing robust growth prospects and supportive valuations.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-16T04:37:53.139361"
        },
        {
            "title": "Suzlon Energy shares jump 2% after the co bags its largest FY26 order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-shares-jump-2-after-the-co-bags-its-largest-fy26-order/articleshow/123914155.cms",
            "description": "Suzlon Energy shares rose nearly 2% after securing its largest FY26 order — an 838 MW wind project from Tata Power Renewable Energy. The deal spans Karnataka, Maharashtra, and Tamil Nadu, boosting Suzlon’s order book and reinforcing its role in India’s clean energy transition.",
            "pubDate": "2025-09-16T05:09:01.317986"
        },
        {
            "title": "Infosys caught in buyback vs AI tangle: What's beneficial for its 26 lakh shareholders?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-caught-in-buyback-vs-ai-tangle-whats-beneficial-for-its-26-lakh-shareholders/articleshow/123914132.cms",
            "description": "Infosys announces a massive share buyback. This move raises questions about prioritizing short-term gains over long-term innovation. Experts are divided on whether this is the best use of the company's cash reserves. Some argue for increased investment in AI and research. Others say the buyback benefits shareholders.",
            "pubDate": "2025-09-16T05:09:01.318117"
        },
        {
            "title": "Stephen Miran confirmed to Fed board, expands Trump’s influence",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stephen-miran-confirmed-to-fed-board-expands-trumps-influence/slideshow/123913799.cms",
            "description": "The US Senate narrowly confirmed Stephen Miran to the Federal Reserve's Board of Governors in a 48-47 vote. The appointment gives President Trump’s top economic adviser one of 12 interest-rate votes, expanding the president’s influence over the central bank. (Source: Reuters)",
            "pubDate": "2025-09-16T05:09:01.318227"
        },
        {
            "title": "Nifty seen at 26,000 in 12 months; telecom, cement among top picks: Nikhil Ranka, Nuvama AMC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-seen-at-26000-in-12-months-telecom-cement-among-top-picks-nikhil-ranka-nuvama-amc/articleshow/123914067.cms",
            "description": "Indian equities are set for a favourable phase, though with moderate returns. Nikhil Ranka suggests a 10% return outlook and sees Nifty reaching 26,000 in 10–12 months, urging investors to deploy capital with a medium-term view.",
            "pubDate": "2025-09-16T05:09:01.318328"
        },
        {
            "title": "This smallcap stock jumps 40% in just 5 trading sessions. Should you book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-smallcap-stock-jumps-40-in-just-5-trading-sessions-should-you-book-profits/articleshow/123914035.cms",
            "description": "Sigachi Industries has experienced a significant rally, increasing its market value by Rs 474 crore in five sessions, driven by high volumes and surpassing its 200 DEMA. While technical indicators suggest overbought conditions and caution is advised due to past volatility, optimism surrounding a potential US-India trade deal and a dividend announcement have fueled investor interest.",
            "pubDate": "2025-09-16T05:09:01.318432"
        },
        {
            "title": "With gold prices at record highs, are gold loan lenders a better bet for your portfolio than jewellery makers?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/with-gold-prices-at-record-highs-are-gold-loan-lenders-a-better-bet-for-your-portfolio-than-jewellery-makers/articleshow/123913999.cms",
            "description": "Gold's soaring prices are reshaping the Indian stock market, benefiting gold-loan financiers like Manappuram and Muthoot Finance, which are seeing increased collateral value and loan disbursals. Conversely, jewellery companies such as Titan and Kalyan Jewellers face reduced demand as consumers shift to more affordable options.",
            "pubDate": "2025-09-16T05:09:01.318578"
        },
        {
            "title": "India's most hated stocks now contra bets for Rs 75 lakh crore mutual fund industry. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-most-hated-stocks-now-contra-bets-for-rs-75-lakh-crore-mutual-fund-industry-heres-why/articleshow/123913916.cms",
            "description": "Indian fund managers are investing in IT stocks despite market concerns. Mutual funds increased IT sector allocation amidst a downturn. Infosys is a top pick, attracting significant investment. The sector's decline has led to attractive dividend yields. Experts see potential for improvement in the IT sector. However, AI poses a significant threat to revenue.",
            "pubDate": "2025-09-16T05:09:01.318680"
        }
    ]
}