{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-24T18:52:35.514584",
    "items": [
        {
            "title": "Cipla Q1 results preview: Muted US sales to hit revenue YoY. 4 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cipla-q1-results-preview-muted-us-sales-to-hit-revenue-yoy-4-things-to-watch-out-for/articleshow/122874757.cms",
            "description": "Cipla's June quarter earnings are anticipated to reveal a mixed performance, with robust India sales partially offsetting challenges in the US generics market. Revenue is expected to increase, while EBITDA margins may decline due to lower US contributions. Investor attention will be directed towards the US business trajectory, pricing dynamics, and the resurgence of India's trade generics segment.",
            "pubDate": "2025-07-24T06:52:06.918967"
        },
        {
            "title": "Nestle Q1 Results: Consolidated PAT falls 13% YoY to Rs 647 crore, revenue rises 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-q1-results-consolidated-pat-falls-13-yoy-to-rs-646-crore-revenue-rises-6/articleshow/122873969.cms",
            "description": "Nestle Q1 Results: Nestle India's consolidated profit after tax decreased by 13.4% year-on-year, reaching Rs 647 crore. However, revenue from operations saw a 6% increase, totaling Rs 5,096 crore. Domestic sales grew by 5.5%, while export sales experienced a significant 16% rise. Total income for the quarter amounted to Rs 5,100 crore, a 5% increase.",
            "pubDate": "2025-07-24T06:52:06.919119"
        },
        {
            "title": "Can Infosys maintain its momentum after reporting strong June 2025 quarter growth?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-infosys-maintain-its-momentum-after-reporting-strong-june-2025-quarter-growth/articleshow/122868732.cms",
            "description": "Infosys showcased robust sequential revenue growth in the June 2025 quarter, driven by a lower base, improved pricing, and higher utilization, outperforming its peers. The company revised its FY26 constant currency revenue guidance upwards to 1-3% due to strong new deal wins.",
            "pubDate": "2025-07-24T06:52:06.919235"
        },
        {
            "title": "Capital SFB Q1 profit rises 7% despite higher bad loan provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/capital-sfb-q1-profit-rises-7-despite-higher-bad-loan-provisions/articleshow/122884629.cms",
            "description": "Capital Small Finance Bank posted a 7% rise in Q1 FY26 net profit to ₹32 crore, despite a nearly fourfold jump in provisions due to NBFC-MFI defaults. Operating profit rose 21%, and advances and deposits saw double-digit growth.",
            "pubDate": "2025-07-24T14:20:44.349666"
        },
        {
            "title": "Indian Bank Q1 Result: PAT jumps 24% to Rs 2,973 crore on lower NPA provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-bank-q1-result-pat-jumps-24-to-rs-2973-crore-on-lower-npa-provisions/articleshow/122884595.cms",
            "description": "Indian Bank reported a 24% YoY rise in Q1 net profit to Rs 2,973 crore, aided by sharply lower NPA provisions. Asset quality improved, with gross NPAs falling to 3.01%. While net interest income grew modestly, other income surged 28%. Advances and deposits saw double-digit year-on-year growth.",
            "pubDate": "2025-07-24T14:20:44.349794"
        },
        {
            "title": "Nestle India Q1 Result: PAT falls 13.4%; revenue grows 5.9% to Rs 5,096 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-india-q1-result-pat-falls-13-4-revenue-grows-5-9-to-rs-5096-crore/articleshow/122884559.cms",
            "description": "Nestle India reported a 13.4% YoY drop in Q1 FY26 net profit to Rs 647 crore, citing high input and operational costs. Revenue rose 5.9% to Rs 5,096 crore. Despite profit pressure, the company saw growth in e-commerce, out-of-home business, and urban demand.",
            "pubDate": "2025-07-24T14:20:44.349908"
        },
        {
            "title": "Airtel Africa Q1 profit grows multifold to USD 156 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/airtel-africa-q1-profit-grows-multifold-to-usd-156-million/articleshow/122883648.cms",
            "description": "Telecom operator Airtel Africa posted multifold growth in profit after tax (PAT) to USD 156 million in the June quarter mainly on account of customer growth, lower capex, and forex gain.",
            "pubDate": "2025-07-24T14:20:44.350118"
        },
        {
            "title": "Canara Bank Q1 profit rises 22% to Rs 4,752 crore on treasury gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/canara-bank-q1-profit-rises-22-to-rs-4752-crore-on-treasury-gains/articleshow/122883438.cms",
            "description": "Canara Bank reported a 22% YoY rise in Q1 FY26 net profit to ₹4,752 crore, driven by a 33% jump in non-interest income despite a 2% fall in net interest income. Treasury gains and fee income supported performance amid NIM pressure.",
            "pubDate": "2025-07-24T14:20:44.350219"
        },
        {
            "title": "Sky Gold Q1 FY26 profit doubles to Rs 43.6 crore, revenue up 56%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sky-gold-q1-fy26-profit-doubles-to-rs-43-6-crore-revenue-up-56/articleshow/122882842.cms",
            "description": "Sky Gold and Diamonds posted a 2x jump in Q1 FY26 net profit to ₹43.6 crore, driven by robust exports, lightweight jewellery demand, and major B2B client additions. Revenue rose 56.5% YoY to ₹1,131 crore, supporting its ambitious expansion plans.",
            "pubDate": "2025-07-24T14:20:44.350321"
        },
        {
            "title": "IEX Q1 Results: Cons PAT jumps 25% YoY to Rs 120 crore, revenue rises 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/iex-q1-results-cons-pat-jumps-25-yoy-to-rs-120-crore-revenue-rises-19/articleshow/122882526.cms",
            "description": "IEX Q1 Results: Indian Energy Exchange (IEX) on Thursday reported a 25% year-on-year jump in its consolidated net profit for the quarter ended June 30, 2025 to Rs 120 crore versus Rs 96 crore reported in the year-ago period.",
            "pubDate": "2025-07-24T14:20:44.350419"
        },
        {
            "title": "SBI General Insurance posts 21.5% growth in Q1FY26, outpaces industry growth of 6.2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-general-insurance-posts-21-5-growth-in-q1fy26-outpaces-industry-growth-of-6-2/articleshow/122882016.cms",
            "description": "SBI General Insurance posted 21.5% YoY topline growth in Q1 FY26, outperforming the industry’s 6.2%. Strong gains in motor, health, and PA segments boosted profit to ₹188 crore, with improved loss ratio and solvency showcasing financial strength.",
            "pubDate": "2025-07-24T14:20:44.350543"
        },
        {
            "title": "Bajaj Finance Q1 Results: PAT grows 22% YoY to Rs 4,765 crore, NII jumps 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finance-q1-results-pat-grows-22-yoy-to-rs-4765-crore-nii-jumps-22/articleshow/122879694.cms",
            "description": "Bajaj Finance announced a 22% increase in consolidated net profit, reaching Rs 4,765 crore for the first quarter. Net interest income also rose by 22% to Rs 10,227 crore. The company added 4.69 million new customers, expanding its customer base. Assets under management surged to Rs 4.41 lakh crore. However, there was a slight increase in non-performing assets.",
            "pubDate": "2025-07-24T14:20:44.350646"
        },
        {
            "title": "SBI Life Q1 Results: PAT jumps 14% YoY to Rs 594 crore, net premium income also up 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-life-q1-results-pat-jumps-14-yoy-to-rs-594-crore-net-premium-income-also-up-14/articleshow/122879545.cms",
            "description": "The company’s net premium income stood at Rs 17,178 crore, up 14% from Rs 15,105 crore reported in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-07-24T14:20:44.350742"
        },
        {
            "title": "Adani Energy Q1 Results: Co swings to profit of Rs 512 crore vs YoY loss, revenue grows 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-energy-q1-results-co-swings-to-profit-of-rs-512-crore-vs-yoy-loss-revenue-grows-27/articleshow/122878855.cms",
            "description": "Adani Energy Solutions announced a consolidated net profit of Rs 512 crore for the quarter ending in June, a significant turnaround from the Rs 824 crore loss reported in the same period last year. The company's revenue from operations also saw a substantial increase, reaching Rs 6,819 crore, marking a 27% rise compared to the previous financial year's corresponding quarter.",
            "pubDate": "2025-07-24T14:20:44.350838"
        },
        {
            "title": "ACC Q1 Results: Cons PAT rises 4% YoY to Rs 375 crore, revenue up 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/acc-q1-results-cons-pat-rises-4-yoy-to-rs-375-crore-revenue-up-18/articleshow/122878338.cms",
            "description": "ACC reported a 4% YoY increase in consolidated net profit, reaching Rs 375 crore, with revenue from operations rising 18% to Rs 6,015 crore. Volume growth was 12% YoY in the period under review, driven by higher trade volumes and premium product sales.",
            "pubDate": "2025-07-24T14:20:44.350932"
        },
        {
            "title": "Canara Bank Q1 Results: PAT surges nearly 22% YoY, NII marginally down by 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/canara-bank-q1-results-pat-surges-nearly-22-yoy-nii-marginally-down-by-2/articleshow/122878148.cms",
            "description": "Canara Bank Q1 results:Net Interest Income (NII) for Q1 FY26 came in at ₹9,009 crore, slightly lower than ₹9,166 crore reported in the same quarter last year. Operating profit for the quarter rose by 12.32% year-on-year to ₹8,554 crore.",
            "pubDate": "2025-07-24T14:20:44.351025"
        },
        {
            "title": "ACC Q1 profit rises 4% YoY to Rs 375 crore, misses estimates; demand outlook strong",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/acc-q1-profit-rises-4-yoy-to-rs-375-crore-misses-estimates-demand-outlook-strong/articleshow/122886474.cms",
            "description": "ACC Ltd reported a 4% YoY rise in Q1FY26 net profit to Rs 375 crore, driven by record-high sales volume of 11.5 million tonnes and 17% revenue growth. Despite strong demand and higher EBITDA, earnings missed expectations due to rising tax expenses.",
            "pubDate": "2025-07-24T18:52:34.199081"
        },
        {
            "title": "Anant Raj Q1 profit jumps 38% YoY, revenue up 25%, eyes data growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/anant-raj-q1-profit-jumps-38-yoy-revenue-up-25-eyes-data-growth/articleshow/122886392.cms",
            "description": "Anant Raj Limited posted a 38.3% YoY rise in Q1FY26 net profit to ₹125.90 crore, with consolidated revenue growing 25.5% to ₹592.41 crore. The company also highlighted its upcoming data center launch in Panchkula.",
            "pubDate": "2025-07-24T18:52:34.199225"
        }
    ]
}