{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-09T04:13:15.873381",
    "items": [
        {
            "title": "No big bang for festival season from Nifty50 companies, September quarter to be muted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/no-big-bang-for-festival-season-from-nifty50-companies-sept-quarter-to-be-muted/articleshow/114061445.cms",
            "description": "Revenue is expected to grow by 5.6%, the lowest in nine quarters under observation. Net profit may grow by 11% helped by select companies in the banking, finance, pharmaceuticals and telecom sectors.",
            "pubDate": "2024-10-09T04:13:08.451638"
        },
        {
            "title": "Q2 results season begins this week with TCS, IREDA, DMart. Check out the earnings calendar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-season-begins-this-week-with-tcs-ireda-dmart-check-out-the-earnings-calendar/articleshow/113981423.cms",
            "description": "TCS will kick off the earnings season on October 10, reporting its Q2 results alongside companies like Tata Elxsi and DMart. Key earnings to watch include TCS’s revenue growth and DMart's significant profit jump in Q1 FY25. Other notable companies reporting include Lotus Chocolates and Anand Rathi Wealth.",
            "pubDate": "2024-10-09T04:13:08.451763"
        },
        {
            "title": "Bandhan Bank business grows 25% in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bandhan-bank-business-grows-25-in-q2/articleshow/113981212.cms",
            "description": "Total business of private lender Bandhan Bank increased 24.6 per cent in the second quarter of current financial year, a regulatory filing with the exchanges by the bank said. Total business at the end of September 30, 2024, touched Rs 2,73,163 crore, as compared to Rs 2,19,712 crore in the similar previous period, representing a rise of 24.6 per cent.",
            "pubDate": "2024-10-09T04:13:08.451886"
        },
        {
            "title": "IT sector Q2 preview: Single-digit revenue growth seen, FY25 guidance may improve",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/it-sector-q2-preview-single-digit-revenue-growth-seen-fy25-guidance-may-improve/articleshow/113963387.cms",
            "description": "Indian IT cos are projected to see up to 4% revenue growth for the quarter ending September 30, 2024. Analysts foresee positive trends for FY25, with large-cap firms anticipated to show stable or slight increases in earnings, driven by volume growth and new deals.",
            "pubDate": "2024-10-09T04:13:08.451996"
        },
        {
            "title": "Adani Wilmar Q2 Update: Co reports 16% YoY revenue growth on strong execution in edible oil, food biz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-wilmar-q2-update-co-reports-16-yoy-revenue-growth-on-strong-execution-in-edible-oil-food-biz/articleshow/113944527.cms",
            "description": "Adani Wilmar reports experiencing growth across its food business in various product categories and geographic regions throughout India. The company's diverse range of oils and food products, along with increased production capacity, is now providing it with a significant distribution advantage due to economies of scale.",
            "pubDate": "2024-10-09T04:13:08.452101"
        },
        {
            "title": "Stock Watch: PNB shares in spotlight on Q2 business update",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/stock-watch-pnb-shares-in-spotlight-on-q2-business-update/articleshow/113923858.cms",
            "description": "Shares of Punjab National Bank will be in focus today after the bank posted an 11% YoY growth in domestic business to Rs 24.30 lakh crore for Q2 FY24. Domestic deposits rose 11% to Rs 14.17 lakh crore, while domestic advances increased 12% to Rs 10.12 lakh crore.",
            "pubDate": "2024-10-09T04:13:08.452211"
        }
    ]
}