{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-07T15:33:36.278479",
    "items": [
        {
            "title": "Cosmic 9-9-9 alignment: Wealth creation or risk of sharp reversal?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cosmic-9-9-9-alignment-wealth-creation-or-risk-of-sharp-reversal/articleshow/123743561.cms",
            "description": "As markets open on September 9, 2025, they do so in the wake of a potent lunar event: the total lunar eclipse (Chandra Grahan) that occurs on September 7–8, widely visible across India.",
            "pubDate": "2025-09-07T06:00:26.634279"
        },
        {
            "title": "Modi-Xi handshake, tax cuts boost case for lagging Indian stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/modi-xi-handshake-tax-cuts-boost-case-for-lagging-indian-stocks/articleshow/123742967.cms",
            "description": "Prime Minister Narendra Modi’s symbolic handshake with President Xi Jinping in China, combined with fresh tax cuts at home, is fueling optimism that Indian equities will finally narrow the gap with their emerging-market peers.",
            "pubDate": "2025-09-07T06:00:26.634410"
        },
        {
            "title": "FII activity, India-US trade deal among 7 factors that may impact D-Street action this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-activity-india-us-trade-deal-among-7-factors-that-may-impact-d-street-action-next-week/articleshow/123742868.cms",
            "description": "Indian equity benchmarks wrapped up the week on a solid note, buoyed by strong domestic macroeconomic data and ongoing policy reforms. The Nifty gained 1.29% to settle at 24,741, while the Sensex climbed 1.13% to close at 80,710.",
            "pubDate": "2025-09-07T06:00:26.634618"
        },
        {
            "title": "Mcap of 7 of top-10 most-valued firms jumps Rs 1 lakh cr; Bajaj Finance, Reliance major gainers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-jumps-rs-1-lakh-cr-bajaj-finance-reliance-major-gainers/articleshow/123743831.cms",
            "description": "The combined market valuation of seven of the top-10 most valued firms jumped Rs 1,06,250.95 crore last week, with Bajaj Finance and Reliance Industries emerging as the biggest gainers, in line with an optimistic trend in equities.",
            "pubDate": "2025-09-07T06:32:08.110496"
        },
        {
            "title": "Time-based analysis signals Sept 10 as high-momentum date, Harshubh Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-based-analysis-signals-sept-10-as-high-momentum-date-harshubh-shah/articleshow/123743810.cms",
            "description": "After a sharp 2% fall in the previous week, the markets staged a strong comeback. The rebound was supported by better-than-expected GDP data and the GST Council’s move to simplify the tax structure into dual slabs of 5% and 18%, which lifted investor sentiment.",
            "pubDate": "2025-09-07T06:32:08.110616"
        },
        {
            "title": "FPIs withdraw Rs 12,257 cr in first week of Sep on strong dollar, US tariff concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-withdraw-rs-12257-cr-in-first-week-of-sep-on-strong-dollar-us-tariff-concerns/articleshow/123743716.cms",
            "description": "Foreign investors pulled out Rs 12,257 crore (USD 1.4 billion) from Indian equities in the first week of September, weighed down by a stronger dollar, US tariff concerns, and persistent geopolitical tensions.",
            "pubDate": "2025-09-07T06:32:08.110821"
        },
        {
            "title": "Gold is the new FDI for India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-is-the-new-fdi-for-india/articleshow/123745042.cms",
            "description": "Since the severe foreign exchange crisis of 1991, one word that has become familiar to every Indian household is foreign investment, or FDI.",
            "pubDate": "2025-09-07T08:58:25.331429"
        },
        {
            "title": "Nifty failed to live up to GST 2.0 hype. Will this week offer a redemption?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-failed-to-live-up-to-gst-2-0-hype-will-this-week-offer-a-redemption/articleshow/123745465.cms",
            "description": "Indian equities kicked off last week on a high, with the GST Council’s sweeping tax cuts sparking hopes of a broad rally. However, the rally fizzled out as quickly as it started. By Friday, the Nifty gave up much of its early gains.",
            "pubDate": "2025-09-07T09:59:36.160094"
        },
        {
            "title": "PSU stocks: Time to relook? But don’t use the 2023 lens; choose the business. 57 PSU stocks, some good, some not so good",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-stocks-time-to-relook-but-dont-use-the-2023-lens-choose-the-business-57-psu-stocks-some-good-some-not-so-good/articleshow/123745969.cms",
            "description": "A bull run from June 2023 to June 2024, and then a bear run for a year. PSU stocks now seem at a stage where it is probably time to look at them again. For those who have not noticed, some of these stocks have seen higher-than-average volumes. Also a sort of outperformance in the bearish phase where they did not decline like other stocks in the market. They are not in the news any more; nor are many talking about them on TV. All signs suggesting it might probably be time to look at them again. But this time do it from a very different perspective – and not just because they are PSU. What matters is the category of business they fall into.",
            "pubDate": "2025-09-07T10:33:04.655962"
        },
        {
            "title": "Top 10 IPOs of 2025 so far: Gains up to 115%, 3 turn multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-10-ipos-of-2025-so-far-gains-up-to-115-3-turn-multibaggers/slideshow/123746016.cms",
            "description": "Around 52 mainboard IPOs have been listed on the exchanges so far in 2025. Of these, 39 are currently trading in the green, while 13 are in the red, resulting in an average return of 21.31%, according to data from Trendlyne. We are highlighting the top 10 IPOs that have delivered impressive gains ranging from 50% to 115% over their issue price — with 3 of them emerging as multibaggers.",
            "pubDate": "2025-09-07T10:33:04.656107"
        },
        {
            "title": "Dividend yield: Stock traders can use it differently to distinguish between the probability & possibility of making money",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-yield-stock-traders-can-use-it-differently-to-distinguish-between-the-probability-possibility-of-making-money/articleshow/123746248.cms",
            "description": "Dividend yield is not just an investor’s tool. At certain points in the market, it becomes just as relevant – sometimes even more so – for traders. Yes, traders. Now, why would dividend yield, of all things, act like a support line? The explanation lies in market memory and psychology. Around a certain level of dividend yield, value-oriented funds begin to step in because the price suddenly offers the comfort of an income stock. Momentum traders see valuation support and a floor building underneath the price. Options desks recalibrate, as downside looks limited and covered calls turn attractive. Each group is reacting to its own cues, but collectively they create the reflexive bounce that turns weakness into opportunity for traders.",
            "pubDate": "2025-09-07T11:11:34.328940"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/123746636.cms",
            "description": "Indian market closed flat on Friday due to profit booking in consumer and IT sectors, offsetting gains in the auto sector following proposed tax cuts. While domestic investors rotated into mid- and small-cap stocks, U.S. and European markets dipped amid concerns about the pace of economic recovery after a softer-than-expected jobs report.",
            "pubDate": "2025-09-07T12:16:31.767868"
        },
        {
            "title": "Two Trades for Today: A pharma major for a 3.95% gain, a mid-cap hospitality stock for almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-pharma-major-for-a-3-95-gain-a-mid-cap-hospitality-stock-for-almost-7-gain/articleshow/123748701.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-07T15:33:35.715692"
        }
    ]
}