{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-26T15:49:17.382662",
    "items": [
        {
            "title": "'Violent' price spike rocks gas traders' bad winter bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/violent-price-spike-rocks-gas-traders-bad-winter-bets/articleshow/127519887.cms",
            "description": "US and European gas traders wrongly predicted a mild winter. Now, a severe cold snap in America has sent natural gas prices soaring. This surge impacts global markets, with Asian buyers potentially priced out. Tankers are rerouting to Europe. Traders are in panic mode as pipelines face freezing risks, threatening supply amid high demand.",
            "pubDate": "2026-01-26T02:27:40.118251"
        },
        {
            "title": "Greenko Energy raises Rs 4,800 crore from NaBFID",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/greenko-energy-raises-rs-4800-crore-from-nabfid/articleshow/127519573.cms",
            "description": "Greenko Energy Holdings secured ₹4,800 crore from NaBFID. This funding will retire dollar bonds maturing soon. The loan is for 38 special purpose vehicles with 1 GW renewable capacity. Greenko plans to use the funds for bond redemption this week. The company has a net installed capacity of 11 GW across India. Fitch recently downgraded Greenko's rating citing project delays.",
            "pubDate": "2026-01-26T02:27:40.118411"
        },
        {
            "title": "Nifty eyes relief rally on tariff hopes, FIIs remain a drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-eyes-relief-rally-on-tariff-hopes-fiis-remain-a-drag/articleshow/127518921.cms",
            "description": "Markets anticipate a rebound early in the shortened week following news of potential tariff removal on India. Despite oversold conditions, a sustained bounce hinges on reduced foreign institutional selling. Analysts identify key support and resistance zones, with a durable sentiment improvement requiring the index to reclaim higher bands.",
            "pubDate": "2026-01-26T02:27:40.118611"
        },
        {
            "title": "Market on high alert for Yen intervention",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-on-high-alert-for-yen-intervention/articleshow/127518736.cms",
            "description": "Traders are on high alert for potential Japanese government intervention to curb the yen's recent decline, with speculation fueled by reports of the Federal Reserve Bank of New York contacting financial institutions about the exchange rate. This move, potentially with US backing, follows a warning from Prime Minister Sanae Takaichi about abnormal yen movements.",
            "pubDate": "2026-01-26T02:27:40.118705"
        },
        {
            "title": "Stock market holiday 2026: Are BSE, NSE closed today on January 26 for Republic Day?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-2026-are-bse-nse-closed-today-on-january-26-for-republic-day/articleshow/127481989.cms",
            "description": "Indian stock markets, including NSE and BSE, are closed today, January 26, for Republic Day. Trading will resume on Tuesday, January 27. This marks the second holiday of the year, with 16 closures scheduled for 2026 due to various national and religious observances.",
            "pubDate": "2026-01-26T02:27:40.118803"
        },
        {
            "title": "Foreign banks can go deep; there is no dearth of space: Care Ratings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-banks-can-go-deep-there-is-no-dearth-of-space-care-ratings/articleshow/127519678.cms",
            "description": "The UK, France, and China show high bank credit-to-GDP ratios. This suggests substantial lending to businesses, individuals, and across borders. Germany and Japan also demonstrate high levels of credit penetration, aligning with financial systems that rely heavily on banks.",
            "pubDate": "2026-01-26T02:27:40.118900"
        },
        {
            "title": "Microfinance sector shows signs of recovery as NPAs stabilise in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/microfinance-sector-shows-signs-of-recovery-as-npas-stabilise-in-q3/articleshow/127517938.cms",
            "description": "Microfinance lenders are showing signs of recovery after a prolonged bad loan cycle. Leading institutions like Bandhan Bank, Ujjivan Small Finance Bank, and CreditAccess Grameen reported stable non-performing assets and improved margins. This performance suggests a normalization of business, offering relief to stakeholders and indicating a positive outlook for the sector.",
            "pubDate": "2026-01-26T02:27:40.118997"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/127525043.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2026-01-26T05:01:03.425259"
        },
        {
            "title": "Union Budget expectations, Q3 earnings, 6 other factors that may shape this week’s action on D-St",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-budget-expectations-q3-earnings-6-other-factors-that-may-shape-this-weeks-action-on-d-st/articleshow/127522962.cms",
            "description": "The sell-off was broad-based, with all sectoral indices finishing lower and midcap and smallcap stocks seeing notable wealth erosion.",
            "pubDate": "2026-01-26T05:01:03.425371"
        },
        {
            "title": "Budget 2026: Why market may shift from broad rallies to stock-specific bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-why-market-may-shift-from-broad-rallies-to-stock-specific-bets/articleshow/127522154.cms",
            "description": "A key shift we expect is transition in policy emphasis from stimulating consumption to enabling production, reflecting a broader economic pivot from a ‘Buy India’ approach to a ‘Build India’ agenda.",
            "pubDate": "2026-01-26T05:01:03.425472"
        },
        {
            "title": "NBFCs let it pass through as funding costs increase",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfcs-let-it-pass-through-as-funding-costs-increase/articleshow/127520850.cms",
            "description": "Retail loan pricing at some NBFCs has risen, offsetting recent repo rate cuts due to climbing borrowing costs. Experts note that while many maintain rates, some are passing higher funding expenses to customers via increased lending rates or fees. The spread between NBFC and corporate borrowing costs has widened significantly.",
            "pubDate": "2026-01-26T05:01:03.425587"
        },
        {
            "title": "Yen surges as intervention risks lurk, gold surpasses $5,000/oz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yen-surges-as-intervention-risks-lurk-gold-surpasses-5000/oz/articleshow/127520647.cms",
            "description": "Gold surged past $5,000 per ounce early on Monday following a turbulent week where tensions over Greenland and Iran rattled sentiment, ‍while markets remained on tenterhooks after a rout ​in bonds and violent spikes in the yen.",
            "pubDate": "2026-01-26T05:01:03.425687"
        },
        {
            "title": "Why PSU banks may be the real value play in BFSI, Alok Singh explains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-psu-banks-may-be-the-real-value-play-in-bfsi-alok-singh-explains/articleshow/127528866.cms",
            "description": "In an interaction with ET Markets, Alok Singh, CIO at Bank of India Mutual Fund, explains why the current phase still offers a compelling entry point for BFSI investing, highlights the case for PSU banks, and outlines the growth drivers shaping the sector’s medium-term outlook.",
            "pubDate": "2026-01-26T05:38:31.642587"
        },
        {
            "title": "From last Republic Day to now: 18 smallcaps soar up to 469%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-last-republic-day-to-now-18-smallcaps-soar-up-to-469/slideshow/127531555.cms",
            "description": "As India marks its 77th Republic Day on January 26, 2026, the past year has highlighted both the country’s resilience and the challenges faced by financial markets. Amid global uncertainties, the Sensex rose by around 7%, while the broader market lagged, with the smallcap index declining nearly 6.5%. Several smallcap stocks defied the broader trend—18 stocks more than doubled in value—showing that select companies can still create significant wealth even during difficult market phases. (Data Source: ACE Equity)",
            "pubDate": "2026-01-26T06:37:37.400378"
        },
        {
            "title": "Investec backs Paytm’s digital ‘toll road’,  sees 23% upside despite 15% fall.  Key reasons here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investec-backs-paytms-digital-toll-road-sees-23-upside-despite-15-fall-key-reasons-here/articleshow/127534932.cms",
            "description": "The brokerage’s bullish view on the Paytm parent is driven by three key triggers, led by India’s rapidly expanding digital payments ecosystem, where the fintech operates like a “toll road”.",
            "pubDate": "2026-01-26T07:36:38.385547"
        },
        {
            "title": "Don’t try to time the market in this VUCA world",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dont-try-to-time-the-market-in-this-vuca-world/articleshow/127534334.cms",
            "description": "The US-led democratic Western world played a key role in the post-Second World War growth and development. This leadership role is now under threat thanks to the unconventional, uncertain, and hugely disruptive policies and actions of President Trump.",
            "pubDate": "2026-01-26T07:36:38.385652"
        },
        {
            "title": "Two Trades for Today: An FMCG major for a 5.8% rise, a mid-cap housing finance stock for a 4.5% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-fmcg-major-for-a-5-8-rise-a-mid-cap-housing-finance-stock-for-a-4-5-gain/articleshow/127535961.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-26T08:38:17.896966"
        },
        {
            "title": "Market Trading Guide: Two stocks to buy on Tuesday with up to 11% upside. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-two-stocks-to-buy-on-tuesday-with-up-to-11-upside-check-details/slideshow/127539690.cms",
            "description": "The Nifty ended sharply lower on Friday, extending its losing streak after a one-day pause, as heavy selling pressure weighed across the market. Banking, energy and auto stocks bore the brunt of the selloff. The index also slipped below its 200-day moving average on a closing basis. Rupak De, Senior Technical Analyst at LKP Securities, commenting on the current trends, said the index remained weak throughout the session as it stayed below the 20 EMA on the hourly chart, suggesting capitulation by the bulls after a futile attempt to defend the crucial long-term moving average. \"As a result, short- to medium-term sentiment is likely to remain weak as long as the index trades below 25,500. On the downside, the decline could extend toward 24,700 in the short term,\" he added further.Here are 2 stock recommendations for Tuesday:",
            "pubDate": "2026-01-26T09:44:15.303891"
        },
        {
            "title": "Mahi Madhusudan Kela acquires 1.12% stake in Emkay Global in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahi-madhusudan-kela-acquires-1-12-stake-in-emkay-global-in-q3/articleshow/127539391.cms",
            "description": "The stake purchase comes at a time when the stock has seen prolonged underperformance. Over the past three months, shares of Emkay Global Financial Services have declined 14%, compared with a roughly 3% fall each in the Nifty and the BSE Sensex. Its one-year return has also moderated to about 3%.",
            "pubDate": "2026-01-26T09:44:15.304032"
        },
        {
            "title": "Big Promoter Move: 10 stocks see promoter pledges cut in Q3FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-promoter-move-10-stocks-see-promoter-pledges-cut-in-q3fy26/slideshow/127539478.cms",
            "description": "Promoter Decreasing Pledge refers to a scenario where company promoters lower the proportion of their shares pledged as collateral for loans or other financial obligations. Within the Nifty500 universe, we have identified the top 10 stocks that saw a reduction in promoter pledge levels in the December ’25 quarter compared with September ’25, based on StockEdge’s promoter holding pledge scan.A declining pledge is generally seen as a positive signal, as it points to improved financial stability and lower reliance on borrowing. It reflects stronger promoter confidence in the company’s fundamentals and often helps enhance investor trust in the stock.",
            "pubDate": "2026-01-26T09:44:15.304142"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-35/articleshow/127538156.cms",
            "description": "Anything positive on the India-US trade deal would be welcomed by the street. So there is a possibility that the US treasury secretary’s statement that the additional tariffs on India may be eased will see the street react positively. However, what needs to be watched carefully is something else – and it has to be seen in combination with several other factors. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2026-01-26T09:44:15.304236"
        },
        {
            "title": "Asian Paints Q3 Preview: PAT seen up 8% YoY; volume growth to pick up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-q3-preview-pat-seen-up-8-yoy-volume-growth-to-pick-up/articleshow/127545920.cms",
            "description": "Asian Paints is poised for a steady December quarter performance, with volume growth expected to improve. While margins are set to expand due to lower raw material costs, revenue growth will be moderated by weak pricing and a challenging demand environment. The B2B segment is anticipated to provide support.",
            "pubDate": "2026-01-26T11:15:32.956707"
        },
        {
            "title": "IPO GMP Watch: Shadowfax hints at discounted debut; SME issues dull",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-gmp-watch-shadowfax-hints-at-discounted-debut-sme-issues-dull/slideshow/127545694.cms",
            "description": "It is set to be a relatively quiet week for India’s primary markets, with no new mainboard IPOs opening for subscription. However, Shadowfax Technologies will make its mainboard debut, while five SME IPOs are scheduled to open during the week. Grey market trends point to a largely cautious sentiment. Here’s what the GMP indicates for these issues.",
            "pubDate": "2026-01-26T11:15:32.956884"
        },
        {
            "title": "Global shares mostly dip as yen rises against U.S. dollar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-shares-mostly-dip-as-yen-rises-against-u-s-dollar/articleshow/127544346.cms",
            "description": "Global shares mostly declined on Monday, as in Asia, Japan's benchmark took a tumble after the yen surged against the US dollar.",
            "pubDate": "2026-01-26T11:15:32.957017"
        },
        {
            "title": "Time to look at them without bias? 6 cement sector stocks with an upside potential of up to 44%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-look-at-them-without-bias-6-cement-sector-stocks-with-an-upside-potential-of-up-to-44/articleshow/127549299.cms",
            "description": "There was a time not so long ago when, come monsoon, cement stocks used to witness pressure. Why? Because, the monsoon traditionally meant the sector had to hit the pause button. What was different and noticeable last year was that, despite an extended monsoon in many parts of the county, cement stocks did not come under pressure. In fact, for the second year in a row, cement companies were able to increase prices around the same time.",
            "pubDate": "2026-01-26T12:29:33.233006"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/127558458.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2026-01-26T15:49:16.737955"
        }
    ]
}