{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-29T05:38:19.424263",
    "items": [
        {
            "title": "Wall Street edges higher in thin post-holiday trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-edges-higher-in-thin-post-holiday-trade/articleshow/125650924.cms",
            "description": "Indian markets saw a surge in stock prices on Friday. Retail and technology sectors led the gains. Investors anticipated a Federal Reserve interest rate cut. Major indexes recorded weekly gains. The Nasdaq experienced a monthly decline due to AI valuation concerns. A CME Group outage briefly disrupted trading. The holiday shopping season commenced with Black Friday and Cyber Monday.",
            "pubDate": "2025-11-29T05:38:16.511032"
        },
        {
            "title": "European shares clock monthly gains on Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-clock-monthly-gains-on-fed-rate-cut-hopes/articleshow/125650865.cms",
            "description": "European shares concluded Friday higher, extending a strong weekly and monthly advance. Optimism surrounding potential U.S. rate cuts fueled gains, with the banking sector notably performing well. Basic Resources also led Friday's rise, driven by record copper prices, while aerospace and defence stocks faced pressure amid Ukraine peace talks.",
            "pubDate": "2025-11-29T05:38:16.511156"
        },
        {
            "title": "India’s blockbuster 8.2% Q2 GDP growth beats expectations. But is it enough to lift the markets?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-blockbuster-8-2-q2-gdp-growth-beats-expectations-but-is-it-enough-to-lift-the-markets/articleshow/125650707.cms",
            "description": "India’s Q2 FY26 GDP surged 8.2%, beating expectations and reaffirming its position as the fastest-growing major economy. Markets may open positively on Monday, driven by robust manufacturing and services growth, easing inflation, and potential FII sentiment shift, though experts caution against chasing indices at elevated levels.",
            "pubDate": "2025-11-29T05:38:16.511363"
        },
        {
            "title": "Sebi Plans online disclosure of cos’ names, registration numbers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-plans-online-disclosure-of-cos-names-reg-numbers/articleshow/125650663.cms",
            "description": "The Securities and Exchange Board of India, often referred to as Sebi, is rolling out a set of new regulations designed to clamp down on the rising tide of fraud in the securities market.",
            "pubDate": "2025-11-29T05:38:16.511461"
        },
        {
            "title": "Wall Street Week Ahead: Investors on watch for AI, economic updates as US stocks steady",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-on-watch-for-ai-economic-updates-as-us-stocks-steady/articleshow/125650587.cms",
            "description": "Indian markets are watching for AI profitability signals and economic health indicators. Stocks rebounded, buoyed by expected December Fed rate cuts. However, AI stock volatility, particularly in Nvidia and Alphabet, keeps investors cautious. Upcoming economic reports and consumer sentiment data will be crucial in navigating market uncertainty through year-end.",
            "pubDate": "2025-11-29T05:38:16.511552"
        }
    ]
}