{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-24T15:53:33.932471",
    "items": [
        {
            "title": "Chemical companies may see muted growth amid pricing pressure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/chemical-companies-may-see-muted-growth-amid-pricing-pressure/articleshow/124774381.cms",
            "description": "Chemical companies anticipate a mixed September quarter. Volume recovery in some areas faces challenges from weak pricing and lower demand. Specialty and fluorine-based firms are poised for better results. Agrochemicals may see a weaker performance due to weather disruptions. Investors will monitor project launches and price trends.",
            "pubDate": "2025-10-24T03:59:18.084895"
        },
        {
            "title": "SBI Card Q2 Results: Profit rises 10% to Rs 445 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-card-q2-results-profit-rises-10-to-rs-445-crore/articleshow/124788840.cms",
            "description": "SBI Cards and Payment Services on Friday reported 10.15 per cent increase in net profit at Rs 445 crore for the second quarter of the current fiscal.",
            "pubDate": "2025-10-24T15:53:25.641514"
        },
        {
            "title": "Hindustan Coca-Cola Beverages FY25 profit down 73% to Rs 756 crore, revenue slides 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindustan-coca-cola-beverages-fy25-profit-down-73-to-rs-756-crore-revenue-slides-9/articleshow/124788760.cms",
            "description": "Hindustan Coca-Cola Beverages Ltd, the bottling arm of beverage major Coca-Cola in India, reported a 73 per cent decline in net profit to Rs 756.64 crore in FY2024-25.",
            "pubDate": "2025-10-24T15:53:25.641649"
        },
        {
            "title": "Coforge Q2 Results: PAT jumps 86% YoY to Rs 376 crore, revenue rises 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/coforge-q2-results-pat-jumps-86-yoy-to-rs-376-crore-revenue-rises-32-check-dividend/articleshow/124785438.cms",
            "description": "Coforge Q2 Results: Coforge reported a stellar Q2, with net profit surging 86% year-on-year to Rs 376 crore. Revenue climbed 32% to Rs 3,986 crore, driven by strong order intake and new client acquisitions. The company's robust performance and low attrition signal an exceptional fiscal year ahead, according to its CEO.",
            "pubDate": "2025-10-24T15:53:25.641760"
        },
        {
            "title": "Dr Reddy's Laboratories Q2 Results: Profit rises 7% YoY to Rs 1,347 crore, revenue up 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-laboratories-q2-results-profit-rises-7-yoy-to-rs-1347-crore-revenue-up-10/articleshow/124784538.cms",
            "description": "Dr Reddy's Laboratories Q2 Results: Generic drugmaker Dr Reddy's Labs reported 7% growth in its net profit at Rs 1,347 crore in the September quarter, compared with Rs 1,255 crore in the same quarter of last year. Revenue from operations increased 10% YoY to Rs 8828 crore.",
            "pubDate": "2025-10-24T15:53:25.641864"
        },
        {
            "title": "SBI Life Q2 Results: Profit falls 6% YoY to Rs 495 crore, but net premium income jumps 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-life-q2-results-profit-falls-6-yoy-to-rs-495-crore-but-net-premium-income-jumps-23/articleshow/124782687.cms",
            "description": "SBI Life Q2 Results: SBI Life's net profit dipped 6% to Rs 495 crore in Q2, despite a 23% rise in net premium income to Rs 24,848 crore. For the first half of FY26, profit after tax grew 4% to Rs 1,090 crore, driven by improved persistency and a balanced product mix. The insurer also saw its Value of New Business increase by 14%.",
            "pubDate": "2025-10-24T15:53:25.641966"
        },
        {
            "title": "ITC Hotels Q2 Results: Cons PAT soars 74% YoY to Rs 133 crore, revenue rises 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-hotels-q2-results-cons-pat-soars-74-yoy-to-rs-133-crore-revenue-rises-8/articleshow/124781641.cms",
            "description": "ITC Hotels Q2 Results: ITC Hotels announced a significant 74% surge in its consolidated net profit for the second quarter, reaching Rs 133 crore compared to Rs 76 crore in the previous year. This impressive growth was accompanied by an 8% increase in revenue from operations, which rose to Rs 839 crore from Rs 778 crore.",
            "pubDate": "2025-10-24T15:53:25.642066"
        },
        {
            "title": "Kotak Bank Q2 Preview: PAT seen flat amid NIM compression and margin pressure. 9 key things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-bank-q2-preview-pat-seen-flat-amid-nim-compression-and-margin-pressure-9-key-things-to-track/articleshow/124779052.cms",
            "description": "Kotak Mahindra Bank is expected to report a largely flat Q2FY26 PAT amid NIM compression and margin pressure. Analysts highlight loan and deposit growth, unsecured lending, and asset quality as key monitorables, with operating performance and credit costs shaping the near-term outlook.",
            "pubDate": "2025-10-24T15:53:25.642165"
        }
    ]
}