{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-22T02:08:03.022989",
    "items": [
        {
            "title": "Stocks to buy in 2026: SRF, Oberoi Realty among 5 stocks that could give 10-20% return in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-srf-oberoi-realty-among-5-stocks-that-could-give-10-20-return-in-long-term/slideshow/127084368.cms",
            "description": "Brokerage firms have maintained a mixed but largely constructive view across stocks spanning chemicals, real estate, automobiles, tyres and IT services, reflecting selective optimism amid evolving sector dynamics.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-22T02:07:50.982143"
        },
        {
            "title": "Armour Security IPO shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/armour-security-ipo-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/127083987.cms",
            "description": "Armour Security India is poised for its NSE SME debut with muted grey market sentiment, showing a 0% premium. The Rs 26.51 crore IPO, fully a fresh issue, saw modest subscription of 1.82 times.  The private security and facility management firm, serving diverse sectors nationwide, plans to utilize IPO funds for working capital, equipment, and debt repayment.",
            "pubDate": "2026-01-22T02:07:50.982237"
        },
        {
            "title": "GIFT Nifty up 200 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127079725.cms",
            "description": "Indian equities declined for a third straight session, with stock-specific action anticipated from major company earnings. Analysts foresee a sideways trading range for the Nifty, influenced by ongoing results and global sentiment. The India VIX surged, reflecting increased market fear, while the rupee hit an all-time low against the dollar amid foreign fund outflows.",
            "pubDate": "2026-01-22T02:07:50.982320"
        },
        {
            "title": "Stocks in news: Eternal, IndiGo, Adani Green, Dr Reddy's, Vodafone Idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-eternal-indigo-adani-green-dr-reddys-vodafone-idea/articleshow/127079288.cms",
            "description": "Markets closed lower amid weak cues, with the Nifty nearing its 200 DEMA. Select heavyweight stocks may offer short-term relief due to oversold conditions. Companies like Eternal, IndiGo, and Dr Reddy's are in focus due to Q3 results and news developments.",
            "pubDate": "2026-01-22T02:07:50.982400"
        },
        {
            "title": "Asian stocks gain after Trump touts Greenland deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-gain-after-trump-touts-greenland-deal/articleshow/127078702.cms",
            "description": "Asian stocks rose, mirroring Wall Street's gains, as President Trump's comments on a \"framework\" deal regarding Greenland eased market concerns. Precious metals retreated, with gold and silver falling. The US president's remarks signaled a de-escalation of geopolitical and trade tensions, leading to a return of risk appetite in equities.",
            "pubDate": "2026-01-22T02:07:50.982485"
        },
        {
            "title": "Central bank sold $9.7 billion in Nov as rupee falls 0.7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/central-bank-sold-9-7-billion-in-nov-as-rupee-falls-0-7/articleshow/127076287.cms",
            "description": "The Reserve Bank of India sold dollars in November. This action aimed to manage the Indian rupee's value. The rupee saw depreciation last year. India's currency's real effective exchange rate also decreased. This rate reflects the rupee's strength against other major currencies. The figures show a shift in the rupee's standing.",
            "pubDate": "2026-01-22T02:07:50.982562"
        },
        {
            "title": "FDI inflows dip marginally, outflows fall sharply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fdi-inflows-dip-marginally-outflows-fall-sharply/articleshow/127075622.cms",
            "description": "India experienced a slight dip in gross FDI to $6.4 billion in November, while net FDI saw a reduced outflow of $446 million. Singapore, Mauritius, the US, and the UK were major contributors to outward FDI, primarily directed towards manufacturing, financial, insurance, and business services sectors.",
            "pubDate": "2026-01-22T02:07:50.982643"
        },
        {
            "title": "Kalyan shares fall the most in 3 years as stake-sale fears spook investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-shares-fall-the-most-in-3-years-as-stake-sale-fears-spook-investors/articleshow/127073991.cms",
            "description": "Kalyan Jewellers' shares plummeted over 12% on Wednesday, marking their steepest single-day fall in three years and extending a nine-session losing streak. Investors are nervous due to concerns about a mutual fund potentially reducing its stake, coupled with an increase in promoter share pledging. Margin calls also contributed to the significant decline.",
            "pubDate": "2026-01-22T02:07:50.982722"
        },
        {
            "title": "Foreign investors not done with selling, FMCG tops list in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-investors-not-done-with-selling-fmcg-tops-list-in-2026/articleshow/127071784.cms",
            "description": "Foreign investors withdrew ₹22,420 crore from Indian markets in early January 2026. The FMCG sector saw the largest sell-off, losing shares worth ₹6,128 crore. Financial services and IT also experienced outflows. Investors are reportedly sensitive to high valuations in FMCG. Metals and mining was the only sector to see significant foreign buying.",
            "pubDate": "2026-01-22T02:07:50.982800"
        },
        {
            "title": "Capri Global Capital CEO Monu Ratra steps down",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capri-global-capital-ceo-monu-ratra-steps-down/articleshow/127074883.cms",
            "description": "In his resignation letter addressed to the company's board of directors, Ratra said that after careful thought and personal reflection, he had decided to explore entrepreneurial opportunities.",
            "pubDate": "2026-01-22T02:07:50.982956"
        }
    ]
}