{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-09T14:52:26.395599",
    "items": [
        {
            "title": "Ex-trader investigating Jane Street ends term at Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ex-trader-investigating-jane-street-ends-term-at-sebi/articleshow/124403480.cms",
            "description": "A key SEBI official, Ananth Narayan, who spearheaded the probe into Jane Street Group LLC's alleged market manipulation, is set to depart as his term concludes. The investigation into the US trading firm, accused of exploiting India's stock and derivatives markets, continues as SEBI faces Jane Street in court. This high-profile case, involving significant financial stakes, has garnered global attention.",
            "pubDate": "2025-10-09T03:24:28.841733"
        },
        {
            "title": "Explained: Reliance Industries is India’s most valuable company but why isn’t it No.1 in Nifty50 weight?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-reliance-industries-is-indias-most-valuable-company-but-why-isnt-it-no-1-in-nifty50-weight/articleshow/124403406.cms",
            "description": "Reliance Industries, despite its massive market capitalization, ranks third in Nifty 50 index weight due to its lower free-float shares. Banks like HDFC Bank and ICICI Bank hold higher weights because a larger portion of their stock is available for public trading, influencing the index more significantly.",
            "pubDate": "2025-10-09T03:24:28.841859"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Kaynes Technology, Titan among 4 stocks that could give 17-40% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-kaynes-technology-titan-among-4-stocks-that-could-give-17-40-return/slideshow/124403133.cms",
            "description": "Brokerages remain upbeat on select Indian equities across sectors, signaling confidence in the country’s growth momentum and corporate earnings outlook for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-09T03:24:28.841963"
        },
        {
            "title": "TCS shares in focus ahead of Q2FY26 results today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-ahead-of-q2fy26-results-today/articleshow/124403360.cms",
            "description": "TCS share price: TCS is set to announce its Q2FY26 results later today, with brokerages projecting net profit between Rs 12,346–13,058 crore and revenue of Rs 64,200–65,700 crore. Analysts will track margins, BFSI growth, GenAI adoption, H1-B visa impact, and deal momentum.",
            "pubDate": "2025-10-09T03:24:28.842069"
        },
        {
            "title": "Bonus issue alert: Last day to buy shares of these 7 companies ahead of record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bonus-issue-alert-last-day-to-buy-shares-of-these-7-companies-ahead-of-record-date/articleshow/124403327.cms",
            "description": "October 9 is the last day to buy shares of seven companies, including Harshil Agrotech, Laxmi Goldorna, and Narmada Macplast, to qualify for upcoming bonus issues. Stocks will trade ex-bonus from October 10, making today the critical cutoff for eligibility.",
            "pubDate": "2025-10-09T03:24:28.842173"
        },
        {
            "title": "Last day to buy Hexaware Technologies, 2 other stocks to qualify for dividends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-hexaware-technologies-2-other-stocks-to-qualify-for-dividends/articleshow/124403230.cms",
            "description": "October 9 is the last day to buy shares of Hexaware Technologies, Rashtriya Chemicals & Fertilizers, and Sacheta Metals to qualify for the announced dividends. Hexaware offers a 575% interim payout, RCF 13.2%, and Sacheta Metals 2.5%, with ex-dividend from October 10.",
            "pubDate": "2025-10-09T03:24:28.842269"
        },
        {
            "title": "RBL Bank among 5 tocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-among-5-tocks-closed-crossing-above-vwap/slideshow/124402910.cms",
            "description": "The closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on October 8, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-10-09T03:24:28.842381"
        },
        {
            "title": "HCL Technologies and 9 other stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-technologies-and-9-other-stocks-showing-bullish-rsi-upswing/slideshow/124402866.cms",
            "description": "Ten stocks from the Nifty500 pack were highlighted in the RSI Trending Up scan on October 8, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-09T03:24:28.842483"
        },
        {
            "title": "Negative Breakout: These 9 stocks close cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-9-stocks-close-cross-below-their-200-dmas/slideshow/124402873.cms",
            "description": "In the Nifty200 pack, nine stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on October 8, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-10-09T03:24:28.842578"
        },
        {
            "title": "S&P 500, Nasdaq end higher as tech strength outweighs Fed concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-end-higher-as-tech-strength-outweighs-fed-concerns/articleshow/124402595.cms",
            "description": "Technology shares propelled U.S. stocks to record highs, led by AI megacaps, as investors awaited Federal Reserve minutes for interest rate clues amid a government shutdown. Chip stocks outperformed, while gold prices surged due to geopolitical uncertainty. The Fed minutes revealed a divided committee on rate cuts.",
            "pubDate": "2025-10-09T03:24:28.842671"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 28%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-28-according-to-analysts/articleshow/124402582.cms",
            "description": "When the underlying bias of the market has changed from bearish to bullish, then volatility should be used to enter the stock market. There is no point fearing volatility. One of the reasons why we are working with underlying bullish assumptions is the fact that, unlike the past when the market used to look at immediate quarterly earnings, the focus of the street is on Q3 numbers, rather than Q2 earnings. Now given the fact that a large number of companies are giving positive business updates and showing confidence, there is good enough reason to be positive. ET Screener, powered by Refinitiv’s Stock Report Plus, lists quality stocks with high upside potential over the next 12 months, and having an average recommendation rating of “Buy” or \"Strong Buy\". This predefined screener is only available to ET Prime users.",
            "pubDate": "2025-10-09T03:24:28.842768"
        },
        {
            "title": "Rs 10 lakh to Rs 1 crore! India's oldest gold ETF sparkles with dazzling 950% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-10-lakh-to-rs-1-crore-indias-oldest-gold-etf-sparkles-with-dazzling-950-return/articleshow/124402561.cms",
            "description": "India's oldest gold ETF, Nippon India ETF Gold BeES, has delivered an impressive 950% return since 2007, transforming a Rs 10 lakh investment into over Rs 1 crore. This remarkable performance coincides with gold's record-breaking surge globally and domestically, driven by inflation, geopolitical concerns, and de-dollarization trends.",
            "pubDate": "2025-10-09T03:24:28.842862"
        },
        {
            "title": "GIFT Nifty up 60 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124402308.cms",
            "description": "Indian markets closed flat on Wednesday following profit booking after an initial strong start. Investors are now awaiting US jobless claims data, with analysts anticipating a range-bound market influenced by global cues and Q2 earnings. The India VIX saw a slight increase, indicating rising market fear.",
            "pubDate": "2025-10-09T03:24:28.842961"
        },
        {
            "title": "Stocks in news: TCS, PVR Inox, Senco Gold, JSW Cement, Maruti Suzuki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-pvr-inox-senco-gold-jsw-cement-maruti-suzuki/articleshow/124402285.cms",
            "description": "Indian markets saw a slight dip after recent gains, with all eyes now on TCS's Q2 earnings report. Analysts anticipate further consolidation with a positive outlook. Key stocks in focus include TCS, PVR Inox's new dine-in cinema concept, Lupin's US expansion, Maruti Suzuki's service network growth, JSW Cement's new unit, and Senco Gold's revenue increase.",
            "pubDate": "2025-10-09T03:24:28.843064"
        },
        {
            "title": "Asian shares rise after US gains driven by AI-linked companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-rise-after-us-gains-driven-by-ai-linked-companies/articleshow/124402260.cms",
            "description": "Asian shares opened higher, mirroring Wall Street's gains driven by AI-linked companies. Gold and oil saw slight declines following a reported Middle East peace deal. Investors are closely watching China's market reopening after a holiday break, balancing AI enthusiasm against cautious consumer spending data.",
            "pubDate": "2025-10-09T03:24:28.843155"
        },
        {
            "title": "Adani Enterprises to raise up to Rs 3,000 cr via NCDs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-to-raise-up-to-rs-3000-cr-via-ncds/articleshow/124402226.cms",
            "description": "The company aims to spend ₹36,000 crore in capital expenditure in the current fiscal. Adani Enterprises first tapped the domestic NCD market last year, where it raised ₹800 crore. This was followed by fund raising of ₹1,000 crore in July this year.",
            "pubDate": "2025-10-09T03:24:28.843249"
        },
        {
            "title": "Netweb Technologies shares in focus on partnership to build AI infrastructure solutions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-shares-in-focus-on-partnership-to-build-ai-infrastructure-solutions/articleshow/124404085.cms",
            "description": "Netweb Technologies India has partnered with Bengaluru-based Bud Ecosystem to develop affordable, localized AI infrastructure solutions for India. The collaboration will produce modular, scalable AI-in-a-Box systems combining optimized hardware and software, enabling AI adoption even in low-connectivity environments. Customers can start with CPU-based setups and seamlessly upgrade to advanced GPU or accelerator-based configurations as required.",
            "pubDate": "2025-10-09T03:54:37.164034"
        },
        {
            "title": "Naukri gains spotlight after Q2 business update shows 12% growth in billings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/naukri-gains-spotlight-after-q2-business-update-shows-12-growth-in-billings/articleshow/124403926.cms",
            "description": "Info Edge (India), the parent of Naukri.com, reported a 12.1% YoY rise in standalone billings to Rs 729 crore for Q2FY26, driven by steady growth across its Recruitment Solutions and 99acres segments. Half-year billings rose to Rs 1,373 crore. The company said these unaudited figures are subject to review by its board and auditors.",
            "pubDate": "2025-10-09T03:54:37.164163"
        },
        {
            "title": "Diwali 2025 Picks: Asit C. Mehta recommends these 9 stocks with up to 54% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-2025-picks-asit-c-mehta-recommends-these-9-stocks-with-up-to-54-upside/slideshow/124403889.cms",
            "description": "Asit C. Mehta has unveiled its top Diwali 2025 portfolio ideas, featuring companies across sectors like infrastructure, logistics, hospitality, and pharmaceuticals. Each of these stocks comes with a defined price target and significant upside potential from current market levels.",
            "pubDate": "2025-10-09T03:54:37.164270"
        },
        {
            "title": "InCred Equities lists HDFC Bank, among 9 other stocks as top 10 high conviction picks. Check full list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/incred-equities-lists-hdfc-bank-among-9-other-stocks-as-top-10-high-conviction-picks-check-full-list/slideshow/124403696.cms",
            "description": "On Wednesday, Indian equity benchmarks, Sensex and Nifty, ended their four-day winning streak, dragged down by profit booking, particularly in financial stocks. Despite gains in IT counters ahead of the quarterly earnings season, banking sector weakness led the decline.The domestic markets experienced a choppy session, marked by cautious investor sentiment and valuation reassessments following a recent rally. With the Q2 earnings season approaching, market participants appeared wary of overstretched valuations. In this environment, InCred Equities has unveiled its top 10 high-conviction ‘ADD’ recommendations for October 2025. Here's the list",
            "pubDate": "2025-10-09T03:54:37.164380"
        },
        {
            "title": "Dolly Khanna increases stake in Coffee Day Enterprises, stock rises 4% in intra-day trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dolly-khanna-increases-stake-in-coffee-day-enterprises-stock-rises-4-in-intra-day-trade/articleshow/124409424.cms",
            "description": "Ace investor Dolly Khanna raised her stake in Coffee Day Enterprises, the parent company of Café Coffee Day, to 2.19% in the September 2025 quarter from 1.55% earlier. Her holding now stands at 46.32 lakh shares. Following the update, the stock gained 3.7% to Rs 42.3 on the BSE, drawing renewed investor interest.",
            "pubDate": "2025-10-09T08:54:04.206521"
        },
        {
            "title": "12th day of upper circuit! Cian Agro Industries shares scale new high; rally over 1,400% in last 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12th-day-of-upper-circuit-cian-agro-industries-shares-scale-new-high-rally-over-1400-in-last-1-year/articleshow/124409228.cms",
            "description": "Shares of Cian Agro Industries and Infrastructure surged to Rs 2,847, hitting a 5% upper circuit for the 12th straight day and marking 42 consecutive sessions of gains. The stock has skyrocketed 460% this year and 1,400% in the past 12 months. Trading volumes were lower than average, and the BSE-listed stock remains under T-group and long-term surveillance.",
            "pubDate": "2025-10-09T08:54:04.206645"
        },
        {
            "title": "Weak Yen: A boost for Japan’s economy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weak-yen-a-boost-for-japans-economy/slideshow/124406302.cms",
            "description": "The yen is currently weak against the dollar, which economist Takuji Aida views as beneficial for Japan’s economy. This depreciation comes alongside rising stock prices and increasing investor confidence, providing a positive environment for domestic growth. (Source: Reuters)",
            "pubDate": "2025-10-09T08:54:04.206753"
        },
        {
            "title": "Japan's Nikkei rallies to record high as SoftBank surges amid AI fever",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rallies-to-record-high-as-softbank-surges-amid-ai-fever/articleshow/124408776.cms",
            "description": "Japan's Nikkei share average rallied to a fresh high on Thursday, with index heavyweight SoftBank Group surging more than 11% as investors bought into its vision of artificial intelligence-powered robots.",
            "pubDate": "2025-10-09T08:54:04.206858"
        },
        {
            "title": "European shares dip as HSBC's Hang Seng privatisation plan weighs on banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-dip-as-hsbcs-hang-seng-privatisation-plan-weighs-on-banks/articleshow/124408722.cms",
            "description": "European shares opened lower on Thursday, pulled down by banks after heavyweight HSBC dropped following its proposal to privatise Hong Kong's Hang Seng Bank, although gains in mining and technology stocks helped limit the overall losses.",
            "pubDate": "2025-10-09T08:54:04.206958"
        },
        {
            "title": "For investors looking to invest beyond one 1 year: 5 largecaps from different sectors with an upside potential of up to 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-looking-investor-beyond-one-1-year-5-large-caps-from-different-sectors-with-an-upside-potential-of-up-to-38/articleshow/124408470.cms",
            "description": "As the bulls make a return to the street, it is time to be bullish, selective and cautious. Bullish, because macro reforms undertaken by policy makers have a higher probability of pushing growth. Selective, because one should always be selective on the street. And cautious, because valuations are still high. If you are looking to increase exposure in the stock market , then it would be better to stay with companies where the overall market size of the business is big and the management has a proven track record.",
            "pubDate": "2025-10-09T08:54:04.207078"
        },
        {
            "title": "DSM Fresh Foods lists 20% above IPO issue price, defying grey market forecasts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dsm-fresh-foods-lists-20-above-ipo-issue-price-defying-grey-market-forecasts/articleshow/124407945.cms",
            "description": "DSM Fresh Foods, Zappfresh’s parent, debuted on BSE SME at Rs 120, a 20% premium over IPO. Strong subscription from NIIs and QIBs highlights robust investor interest in India’s meat delivery sector.",
            "pubDate": "2025-10-09T08:54:04.207178"
        },
        {
            "title": "Silver ETF jumps 9% in 1 hour, but MCX price down. Who's driving this anomaly?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-etf-jumps-9-in-1-hour-but-mcx-price-down-whos-driving-this-anomaly/articleshow/124407715.cms",
            "description": "Investors in Nippon India Silver ETF witnessed a sharp 9% surge in an hour, despite silver prices falling 0.75%, highlighting a liquidity mismatch in the ETF market. The fund’s NAV hit a record ₹165 per unit, diverging significantly from the underlying metal’s value.",
            "pubDate": "2025-10-09T08:54:04.207275"
        },
        {
            "title": "MosChip Technologies shares decline 9% despite the launch of AgenticSky AI platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/moschip-technologies-shares-decline-9-despite-the-launch-of-agenticsky-ai-platform/articleshow/124406921.cms",
            "description": "MosChip Technologies launched AgenticSky, a suite of Agentic AI accelerators designed to help OEMs develop adaptive, autonomous, and trust-driven products for machines, devices, and edge systems. The platform reduces development cycles by up to 40% and offers reusable cores for visual intelligence, human-machine interaction, device optimization, and wearables, providing a scalable framework for next-generation AI-powered product innovation.",
            "pubDate": "2025-10-09T08:54:04.207373"
        },
        {
            "title": "BoE warns: Global markets at risk from AI and Fed uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boe-warns-global-markets-at-risk-from-ai-and-fed-uncertainty/slideshow/124406182.cms",
            "description": "Global financial markets could tumble if investor confidence in AI or the U.S. Federal Reserve falters. Share valuations in the U.S. are near the peaks seen during the dotcom era. The Bank of England highlighted that such a scenario could spill over into Britain’s financial system, creating material risks. (Source: Reuters)",
            "pubDate": "2025-10-09T08:54:04.207469"
        },
        {
            "title": "JP Morgan’s Jamie Dimon warns ‘serious stock market correction in US’ on the cards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jp-morgans-jamie-dimon-warns-serious-stock-market-correction-in-us-on-the-cards/articleshow/124405909.cms",
            "description": "JP Morgan CEO Jamie Dimon has warned of a potential major U.S. stock market correction within six months to two years, citing geopolitical tensions, heavy fiscal spending, and global uncertainty. While optimistic about AI, he cautioned against overconfidence and stressed the importance of central bank independence and stronger defence preparedness.",
            "pubDate": "2025-10-09T08:54:04.207563"
        },
        {
            "title": "Tata Steel shares climb over 3% as EU proposes measures to shield steel sector from global overcapacity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-climb-over-3-as-eu-proposes-measures-to-shield-steel-sector-from-global-overcapacity/articleshow/124405799.cms",
            "description": "Tata Steel shares rose after the European Commission proposed new measures to protect the EU steel industry from global overcapacity. The plan, part of the EU Steel and Metal Action Plan, aims to replace the current safeguard expiring in June 2026 and strengthen the long-term viability of the steel sector.",
            "pubDate": "2025-10-09T08:54:04.207661"
        },
        {
            "title": "Internet stocks shed ‘hype’ tag: Ixigo, CarTrade, Nykaa soar up to 80% in 3-months on earnings revival",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/internet-stocks-shed-hype-tag-ixigo-cartrade-nykaa-soar-up-to-80-in-3-months-on-earnings-revival/articleshow/124405630.cms",
            "description": "India’s internet stocks, led by Ixigo, CarTrade, and Nykaa, have surged up to 80% in three months on earnings recovery and strong revenue growth. Analysts highlight improved profitability, business diversification, and favourable macro trends, though caution that recent rallies are not risk-free. New-age stocks head into the earnings season on a strong note following a rating upgrade from JM Financial.",
            "pubDate": "2025-10-09T08:54:04.207757"
        },
        {
            "title": "SpiceJet shares soar 18% on expansion announcements, new winter routes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-soar-18-on-expansion-announcements-new-winter-routes/articleshow/124405506.cms",
            "description": "SpiceJet shares saw a sharp uptick on Thursday following announcements of network expansion and winter flight operations. The low-cost carrier is launching new routes to popular destinations like Port Blair and Udaipur, alongside special Diwali flights to Ayodhya. This expansion, including fleet growth, aims to capitalise on seasonal demand and enhance domestic connectivity.",
            "pubDate": "2025-10-09T08:54:04.207853"
        },
        {
            "title": "HSBC plans to privatise Hang Seng Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-plans-to-privatise-hang-seng-bank/slideshow/124405693.cms",
            "description": "HSBC has announced plans to acquire the remaining 36.5% stake in Hang Seng Bank. The offer price is HK$155 per share, valuing the transaction at approximately HK$106.1 billion ($13.63 billion). This deal places Hang Seng Bank’s total valuation at around $37 billion. (Source: Reuters)",
            "pubDate": "2025-10-09T08:54:04.207946"
        },
        {
            "title": "Senco Gold shares decline over 4% after modest Q2 growth amid high gold prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/senco-gold-shares-decline-over-4-after-modest-q2-growth-amid-high-gold-prices/articleshow/124404700.cms",
            "description": "Senco Gold share price: Senco Gold reported 6.5% YoY revenue growth in Q2 FY26, with H1 revenue up 17.8%, driven by retail expansion and strong same-store sales. Despite high gold prices and seasonal headwinds, diamond and silver jewellery sales showed robust value growth, reflecting resilient consumer demand.",
            "pubDate": "2025-10-09T08:54:04.208059"
        },
        {
            "title": "FOMO or greed? Both driving unusual rally across gold, crypto and AI stocks, says Kotak Institutional Equities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fomo-or-greed-both-driving-unusual-rally-across-gold-crypto-and-ai-stocks-says-kotak-institutional-equities/articleshow/124411028.cms",
            "description": "In a rare market phenomenon, both haven and risky assets are soaring together — a move that Kotak Institutional Equities attributes largely to a cocktail of FOMO and greed.",
            "pubDate": "2025-10-09T09:57:55.110509"
        },
        {
            "title": "Profit Turnaround: These 5 Smallcap stocks surged up to 57% after swinging to profit. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/profit-turnaround-these-5-smallcap-stocks-surged-up-to-57-after-swinging-to-profit-do-you-own-any/slideshow/124410972.cms",
            "description": "After two quarters of losses, around 20 smallcaps turned profitable in Q1 FY26, but post-results performance has been mixed. Between July and early October, only half of these profit turnarounds have rewarded investors with positive returns, while the rest slipped back into negative territory. Five stocks surged 10–57% over three months, while five laggards fell sharply, highlighting ongoing volatility in the smallcap segment. (Source: ACE Equity)",
            "pubDate": "2025-10-09T09:57:55.110650"
        },
        {
            "title": "Tata Motors demerger: Record date on October 14, stock crashes over 9% in 5 sessions. What next for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-demerger-record-date-on-october-14-stock-crashes-over-9-in-5-sessions-what-next-for-investors/articleshow/124410273.cms",
            "description": "Tata Motors shares have seen a sharp slump ahead of the October 14 demerger record date, as investors brace for structural changes. The 1:1 split into Passenger and Commercial Vehicle units aims to unlock value and improve operational focus, though near-term volatility remains high.",
            "pubDate": "2025-10-09T09:57:55.110761"
        },
        {
            "title": "Eternal hits fresh peak, Swiggy soars 4% after Citi hikes target prices. Which is a better bet?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-hits-fresh-peak-swiggy-soars-4-after-citi-hikes-target-prices-which-is-a-better-bet/articleshow/124410005.cms",
            "description": "Shares of Eternal and Swiggy witnessed an uptick on Thursday after Citi hiked target prices for the stocks, citing strong quick-commerce growth and improving margins. Both food-delivery firms show top-line momentum, with technicals signalling strength as investors track breakeven progress.",
            "pubDate": "2025-10-09T09:57:55.110871"
        },
        {
            "title": "Gainers & Losers: Swiggy among top stocks that were in spotlight on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-swiggy-among-top-stocks-that-were-in-spotlight-on-thursday/slideshow/124412827.cms",
            "description": "",
            "pubDate": "2025-10-09T11:13:38.578105"
        },
        {
            "title": "Market Wrap: Sensex jumps 398 points, Nifty tops 25,150 as metal, IT stocks rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-jumps-398-points-nifty-tops-25150-as-metal-it-stocks-rally/articleshow/124411737.cms",
            "description": "Indian benchmark indices Sensex and Nifty advanced on Thursday, led by gains in IT and metal stocks. Investors turned optimistic ahead of Tata Consultancy Services’ quarterly earnings, while a rebound in base metal prices added momentum to the rally.",
            "pubDate": "2025-10-09T11:13:38.578233"
        },
        {
            "title": "Eternal, V2 Retail among 4 consumer discretionary stocks that hit 52-week high; gain up to 50% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-v2-retail-among-4-consumer-discretionary-stocks-that-hit-52-week-high-gain-up-to-50-in-a-month/slideshow/124416238.cms",
            "description": "On Thursday, the benchmark Sensex climbed by around 398 points to close at 82,712. During the rally, four stocks from the BSE Consumer Discretionary Index hit their 52-week highs — marking their highest levels in the past year. Such breakouts are often seen by traders and investors as bullish signals, suggesting strong upward momentum and the potential for further gains.",
            "pubDate": "2025-10-09T12:46:21.513200"
        },
        {
            "title": "Stock Radar: Hindustan Zinc benefits from silver surge; technical setup turns bullish; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-hindustan-zinc-benefits-from-silver-surge-technical-setup-turns-bullish-check-target-stop-loss/articleshow/124387713.cms",
            "description": "Hindustan Zinc stock is showing positive signs after testing key technical levels. Experts suggest a buying opportunity for short-term traders. The company is expected to benefit from rising silver prices. The stock has broken out of a resistance zone, indicating renewed bullish momentum. A target of Rs 580 is anticipated in the coming months.",
            "pubDate": "2025-10-09T12:46:21.513335"
        },
        {
            "title": "US stocks subdued at open after Fed's Powell offers no rate clues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-subdued-at-open-after-feds-powell-offers-no-rate-clues/articleshow/124419922.cms",
            "description": "Wall Street's main indexes posted subdued gains at open on Thursday after Federal Reserve Chair Jerome Powell offered no fresh policy signals, leaving investors to rely on older data to shape sentiment.",
            "pubDate": "2025-10-09T14:00:18.450389"
        },
        {
            "title": "Sebi member leading Jane Street probe leaves office after term ends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-member-leading-jane-street-probe-leaves-office-after-term-ends/articleshow/124417519.cms",
            "description": "Ananth Narayan G, the Indian regulatory official who led the high-profile investigation of alleged market manipulation by U.S. high-frequency trading firm Jane Street, stepped down on Thursday at the end of his three-year term.",
            "pubDate": "2025-10-09T14:00:18.450513"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124422408.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-10-09T14:52:25.654911"
        }
    ]
}