{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-04T16:51:18.554789",
    "items": [
        {
            "title": "These 8 stocks hit fresh 52-week highs, rallied up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-8-stocks-hit-fresh-52-week-highs-rallied-up-to-25-in-a-month/slideshow/113946420.cms",
            "description": "On Friday, India's benchmark index Sensex dropped by around 809 points, closing at 81,688. Despite this steep decline, eight stocks from the BSE 500 index reached their 52-week highs. A 52-week high is significant because it represents the highest price a stock has reached in the past year, providing valuable insights for traders and investors. This milestone helps evaluate a stock's current value and predict future price movements.",
            "pubDate": "2024-10-04T16:50:57.604464"
        },
        {
            "title": "Investor sells 8.45% holding in R Systems for Rs 465 crore; Goldman Sachs picks up stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investor-sells-8-45-holding-in-r-systems-for-rs-465-crore-goldman-sachs-picks-up-stake/articleshow/113946186.cms",
            "description": "Investor Bhavook Tripathi on Friday trimmed its stake in R Systems International by divesting an 8.45 per cent stake to investors like Goldman Sachs, DSP Mutual Fund (MF), and Sundaram MF for Rs 465 crore through open market transactions. After the stake sale, Tripathi's holding has come down to 20.58 per cent from 29.03 per cent.",
            "pubDate": "2024-10-04T16:50:57.604592"
        },
        {
            "title": "Titan sees 25% YoY growth in Q2 as jewellery business picks up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-sees-25-yoy-growth-in-q2-as-jewellery-business-picks-up/articleshow/113945066.cms",
            "description": "Titan reported 25% YoY growth in Q2 FY25. 75 new stores were added, bringing the total to 3,171. Jewellery domestic operations grew 25% YoY. Consumer demand picked up after the reduction in custom duty on gold imports.",
            "pubDate": "2024-10-04T16:50:57.604702"
        },
        {
            "title": "BSE arm launches 3 new indices. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-arm-launches-3-new-indices-check-details/articleshow/113944757.cms",
            "description": "The BSE Sensex Sixty 65:35 is a strategy index consisting of 60 stocks, drawn from the BSE Sensex and BSE Sensex Next 30 in a 65:35 ratio. These 60 stocks account for over 55% of the total free float market capitalization of all listed companies in India. The 65:35 ratio is structured to provide greater exposure to the Next 30 stocks compared to the traditional free float market capitalization method.",
            "pubDate": "2024-10-04T16:50:57.604803"
        },
        {
            "title": "Stock brokers may participate in the G-Secs market, proposes Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-brokers-may-participate-in-the-g-secs-market-proposes-sebi/articleshow/113943779.cms",
            "description": "The regulatory framework issued by the relevant authority will specify how stock brokers operating on NDS-OM handle policy, eligibility, risk management, investor grievances, inspections, enforcement, and claims.",
            "pubDate": "2024-10-04T16:50:57.604900"
        },
        {
            "title": "Nasdaq jumps over 1% at open after strong payrolls data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-jumps-over-1-at-open-after-strong-payrolls-data/articleshow/113943753.cms",
            "description": "The Dow Jones Industrial Average opened up by 236.7 points (0.56%) at 42,248.26, while the S&P 500 gained 37.5 points (0.66%) to start at 5,737.48.",
            "pubDate": "2024-10-04T16:50:57.604999"
        },
        {
            "title": "NSE, former chief Vikram Limaye, others settle TAP system case with Sebi; pay Rs 643 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-former-chief-vikram-limaye-others-settled-tap-system-case-with-sebi-pay-rs-643-cr/articleshow/113943527.cms",
            "description": "The National Stock Exchange (NSE), its former chief Vikram Limaye and eight others on Friday settled with markets regulator Sebi a case pertaining to alleged bypass of trading access point (TAP) system by certain brokers after paying Rs 643 crore.",
            "pubDate": "2024-10-04T16:50:57.605093"
        },
        {
            "title": "Tech View: Nifty breaks below 50 DEMA, forms bear candle. How to trade on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-breaks-below-50-dema-forms-bear-candle-how-to-trade-on-monday/articleshow/113941853.cms",
            "description": "A bear candle appeared on both the daily and weekly charts, indicating a sharp reversal in Nifty's near-term uptrend. Currently positioned near the support level around 25,000, there is potential for a minor upside bounce early in the week, likely presenting a sell-on-rise opportunity. A decisive break below the 25,000-24,950 range could lead to a further decline toward 24,500. Immediate resistance is expected around 25,300, according to Nagaraj Shetti of HDFC Securities.",
            "pubDate": "2024-10-04T16:50:57.605185"
        },
        {
            "title": "IndusInd Bank Q2 update: Net advances jump 13% YoY to Rs 3,56,980 crore, deposits rise 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-q2-update-net-advances-jump-13-yoy-to-rs-356980-crore-deposits-rise-15/articleshow/113939447.cms",
            "description": "IndusInd Bank reported a 13% YoY increase in net advances, reaching ₹3,56,980 crore, while deposits grew 15% to ₹4,12,704 crore as of September 30, 2024, amidst stable net interest margins.",
            "pubDate": "2024-10-04T16:50:57.605284"
        },
        {
            "title": "Middle East fears, foreign outflows spark worst D-Street slump in over 2 years; Sensex tanks 809 points",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/middle-east-fears-foreign-outflows-spark-worst-d-street-slump-in-over-2-years-sensex-tanks-809-points/articleshow/113938546.cms",
            "description": "For the week, the Sensex fell by 3,883 points (4.5%), while the Nifty lost 1,128 points (4.3%). The total market capitalisation of all listed companies on the BSE dropped by Rs 16.67 lakh crore to Rs 461.26 lakh crore. At the same time, foreign institutional investors recorded significant outflows, selling shares worth $3.65 billion over the past three sessions, marking a record high on Thursday.",
            "pubDate": "2024-10-04T16:50:57.605396"
        },
        {
            "title": "HSBC initiates coverage on Bajaj Housing with a ‘reduce’ rating, predicts 27% downside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-initiates-coverage-on-bajaj-housing-with-a-reduce-rating-predicts-27-downside/articleshow/113938681.cms",
            "description": "HSBC initiated coverage on Bajaj Housing Finance with a 'reduce' rating, targeting Rs 110, citing earnings slowdown and concerns over high valuations compared to peers.",
            "pubDate": "2024-10-04T16:50:57.605495"
        },
        {
            "title": "IDFC First Bank Q2 update: Loans rise 21% YoY to Rs 2.22 lakh crore; deposits up 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idfc-first-bank-q2-update-loans-rise-21-yoy-to-rs-2-22-lakh-crore-deposits-up-32/articleshow/113937294.cms",
            "description": "Meanwhile, CASA deposits increased by 37.6% on a YoY basis to Rs 1,09,345 crore. The CASA ratio stood at 48.9% as of September 2024, as compared to 46.4% as of September 2023.",
            "pubDate": "2024-10-04T16:50:57.605592"
        },
        {
            "title": "Federal Bank, Coforge among 5 stocks with short covering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-coforge-among-5-stocks-with-short-covering/slideshow/113936289.cms",
            "description": "Short covering happens when traders buy back shares they previously sold short, often due to a shift in market sentiment or new information. This usually results in a decrease in open interest and can drive the stock price higher. In Friday's trading session, five stocks saw short covering. Here's the list:",
            "pubDate": "2024-10-04T16:50:57.605690"
        },
        {
            "title": "Nestle, Can Fin Home among 5 stocks with long unwinding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nestle-can-fin-home-among-5-stocks-with-long-unwinding/slideshow/113936164.cms",
            "description": "Long unwinding refers to the selling of positions or stocks owned for a longer period either to book profit or to exit it in anticipation of impending bearishness. In Friday's trading session, five stocks witnessed a long unwinding. Here's the list:",
            "pubDate": "2024-10-04T16:50:57.605783"
        },
        {
            "title": "Info Edge, Lloyds Metals among 5 small & midcap stocks that hit 52-week highs on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/info-edge-lloyds-metals-among-5-small-amp-midcap-stocks-that-hit-52-week-highs-on-friday/slideshow/113935587.cms",
            "description": "Sensex and Nifty erased all intra-day gains to trade deep in the red on Friday, remaining on course for their worst week in more than two years after a deluge of foreign outflows and on concerns about the deepening conflict in the Middle East. Meanwhile, in Friday's trade, five small and midcap stocks from the Nifty 500 index reached new 52-week highs. Here's the list:",
            "pubDate": "2024-10-04T16:50:57.605876"
        },
        {
            "title": "HDFC Bank originates India’s largest securitisation transaction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-originates-indias-largest-securitisation-transaction/articleshow/113935280.cms",
            "description": "India’s largest private sector lender HDFC Bank has originated the largest securitisation pool of Rs 9,063 crore, rated AAA by domestic rating agency India Ratings. The asset-backed securitisation transaction is backed by a pool of new car loans",
            "pubDate": "2024-10-04T16:50:57.605974"
        }
    ]
}