{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-29T15:50:54.707102",
    "items": [
        {
            "title": "Stocks in news: PNB, IndiGo, Sigachi Industries, Coal India, Coforge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-pnb-indigo-sigachi-industries-coal-india-coforge/articleshow/126222281.cms",
            "description": "Indian markets saw a slight dip, continuing their consolidation phase. Trading activity remained subdued due to low volumes. However, specific company news is creating opportunities. PNB reported a large fraud. IndiGo's market share decreased. Coal India appointed a new CEO. Vedanta received a conditional nod for drilling. Sigachi Industries' MD and CEO was remanded.",
            "pubDate": "2025-12-29T00:59:39.977223"
        },
        {
            "title": "Global stocks hold near record, silver at all-time high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-hold-near-record-silver-at-all-time-high/articleshow/126222247.cms",
            "description": "Global stocks hovered near record highs amid light trading, while silver surged to a new peak, extending a historic year-end rally. Equities saw gains in Australia, with modest declines anticipated in Japan. Investors are closely watching AI trends and Federal Reserve interest rate decisions for future market direction.",
            "pubDate": "2025-12-29T00:59:39.977358"
        },
        {
            "title": "Will Encora acquisition cement Coforge’s AI leadership in healthcare and hi-tech?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-encora-acquisition-cement-coforges-ai-leadership-in-healthcare-and-hi-tech/articleshow/126222169.cms",
            "description": "Coforge is acquiring California-based Encora for $2.35 billion, bolstering its AI capabilities in healthcare and hi-tech, and expanding its US market presence. This strategic move aims to position Coforge for future growth, with the combined entity projected to significantly increase revenue and potentially become India's seventh-largest software exporter.",
            "pubDate": "2025-12-29T00:59:39.977572"
        },
        {
            "title": "Nifty faces 26,200 hurdle; indicators flag uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-faces-26200-hurdle-indicators-flag-uncertainty/articleshow/126222095.cms",
            "description": "Nifty 50 is consolidating near all-time highs, facing resistance at 26,200, indicating near-term indecision. Analysts suggest range-bound trade with sector-specific opportunities, while Bank Nifty shows signs of potential profit-booking. Experts recommend specific stock bets like Lupin and Varun Beverages for potential gains.",
            "pubDate": "2025-12-29T00:59:39.977676"
        },
        {
            "title": "Bandhan Bank sells Rs 3,212 crore microfinance bad loans to ARCIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bandhan-bank-sells-rs-3212-crore-microfinance-bad-loans-to-arcil/articleshow/126222128.cms",
            "description": "Bandhan Bank has sold a ₹3,212 crore microfinance non-performing loan portfolio to ARCIL for ₹578 crore. This sale followed a Swiss Challenge process. The bank also initiated a process to sell an additional ₹3,720 crore in loans. These actions come as the bank's asset quality faced pressure from the microfinance segment.",
            "pubDate": "2025-12-29T00:59:39.977872"
        },
        {
            "title": "Finance ministry to take a relook at crop insurance plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/finance-ministry-to-take-a-relook-at-crop-insurance-plan/articleshow/126222120.cms",
            "description": "The finance ministry is reviewing the Pradhan Mantri Fasal Bima Yojana's cup-and-cap model. This comes as crop insurance business declines, with premium collections expected to fall significantly. Large states are shifting to the cup-and-cap model, which limits insurer risk and profitability. The review aims to ensure the scheme's long-term sustainability and effective farmer coverage.",
            "pubDate": "2025-12-29T00:59:39.977964"
        },
        {
            "title": "Banks urge RBI to extend trade relief measures beyond December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-urge-rbi-to-extend-trade-relief-measures-beyond-december/articleshow/126222033.cms",
            "description": "Banks are asking the Reserve Bank of India for more time on loan relief for exporters. The current scheme ends this month. Exporters face ongoing challenges from global trade issues. Banks believe the real impact of these issues will be seen next quarter. An extension would offer a crucial safety net for exporters.",
            "pubDate": "2025-12-29T00:59:39.978064"
        },
        {
            "title": "77% post-IPO rally: Ashish Kacholia-backed Jain Resource Recycling anchor lock-in ends, 12 mn shares now tradable",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/77-post-ipo-rally-ashish-kacholia-backed-jain-resource-recycling-anchor-lock-in-ends-12-mn-shares-now-tradable/articleshow/126224007.cms",
            "description": "Ashish Kacholia-backed Jain Resource Recycling's anchor lock-in period has ended, making 12 million shares tradable. The company's stock has surged 77% above its IPO price of Rs 232, reaching Rs 461. Jain Resource Recycling specializes in non-ferrous metal recycling and manufacturing, serving prominent domestic and global clients.",
            "pubDate": "2025-12-29T04:16:57.006793"
        },
        {
            "title": "$5 trillion in gold? At record high prices, India's household gold could now be bigger than GDP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-trillion-in-gold-at-record-high-prices-indias-household-gold-could-now-be-bigger-than-gdp/articleshow/126223934.cms",
            "description": "India's household gold reserves have surged past $5 trillion, exceeding the nation's GDP, as record gold prices reflect cultural significance and a safe-haven appeal. While central banks also fuel the rally, this vast, largely idle asset presents a policy challenge in unlocking its value for economic growth.",
            "pubDate": "2025-12-29T04:16:57.006919"
        },
        {
            "title": "Coforge among 6 F&O stocks with sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-among-6-fo-stocks-with-sharp-rise-in-futures-open-interest/slideshow/126223698.cms",
            "description": "As of December 26, six stocks in the NSE F&O segment saw a notable surge in futures open interest, with each recording an increase of over 10% compared with the previous trading session. A rise in futures open interest indicates growth in the number of active, unexpired contracts in a stock, reflecting increased participation as traders either initiate fresh positions or add to existing ones in the futures market.",
            "pubDate": "2025-12-29T04:16:57.007032"
        },
        {
            "title": "Buy, Sell or Hold: Motilal Oswal maintains buy; Morgan Stanley remains overweight on Titan Company",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-motilal-oswal-maintains-buy-morgan-stanley-remains-overweight-on-titan-company/articleshow/126223863.cms",
            "description": "Top brokerages remain bullish on Coforge, Apollo Tyres and Titan, citing strong order books, resilient demand and strategic growth initiatives that support long-term earnings visibility.",
            "pubDate": "2025-12-29T04:16:57.007136"
        },
        {
            "title": "Sensex, Nifty off to lacklustre start as D-St rally meets year-end caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-off-to-lacklustre-start-as-d-st-rally-meets-year-end-caution/articleshow/126223806.cms",
            "description": "Indian equities commenced Monday's trading session with modest gains, mirroring a positive trend in Asian markets. However, the upward momentum was tempered by ongoing concerns regarding foreign fund outflows and thin year-end trading volumes. Investors also closely monitored developments in the Ukraine war negotiations.",
            "pubDate": "2025-12-29T04:16:57.007243"
        },
        {
            "title": "Titan Company shares gain on ‘beYon’ debut, its first lab-grown diamond store. What are brokerages saying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-company-shares-gain-on-beyon-debut-its-first-lab-grown-diamond-store-what-are-brokerages-saying/articleshow/126223804.cms",
            "description": "Titan Company's shares rose as it prepares to launch its first lab-grown diamond store under the new brand 'beYon' in Mumbai. Experts offer mixed views, with some seeing it as a strategic move to tap into growing demand, while others express caution regarding its impact on earnings and valuations.",
            "pubDate": "2025-12-29T04:16:57.007353"
        },
        {
            "title": "Rs 66,500 crore boom in 5 days! Rail stocks roar back on track after a 17-month slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-66500-crore-boom-in-5-days-rail-stocks-roar-back-on-track-after-a-17-month-slump/articleshow/126223699.cms",
            "description": "Indian railway stocks are roaring back after a 17-month slump. A Rs 66,500 crore boom in market value has occurred in just five days. Investors are repositioning ahead of the Union Budget. Improving revenue signals and fare rationalization are driving this comeback. Key stocks like Jupiter Wagons and RVNL have seen substantial gains.",
            "pubDate": "2025-12-29T04:16:57.007456"
        },
        {
            "title": "MCX, Vedanta among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-vedanta-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/126223628.cms",
            "description": "In the Nifty 500 segment, six stocks witnessed a 5-year swing high at the close on December 26, pointing to bullishness in select counters, according to StockEdge’s technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as an important resistance zone where prices have historically struggled to move beyond. While such a move is considered bullish, it differs from a 5-year breakout, which requires a decisive move above resistance held for five years or longer.",
            "pubDate": "2025-12-29T04:16:57.007557"
        },
        {
            "title": "South Korean shares hit near 2-month high as chipmakers rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-hit-near-2-month-high-as-chipmakers-rally/articleshow/126223557.cms",
            "description": "South Korean stocks reached a near two-month high on Monday. Chipmakers like Samsung Electronics and SK Hynix saw significant gains. This surge was driven by optimism surrounding future demand for semiconductors. The KOSPI index performed strongly, marking it as the world's best performer this year. Other sectors showed mixed movements. The South Korean won also strengthened against the dollar.",
            "pubDate": "2025-12-29T04:16:57.007672"
        },
        {
            "title": "Hindustan Zinc shares in focus as Silver hits new record, crosses $82. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-as-silver-hits-new-record-crosses-82-what-should-investors-do/articleshow/126223533.cms",
            "description": "Hindustan Zinc shares are in focus as silver prices hit record highs, driven by low supply and rising demand. The company, a top silver producer, is poised to benefit from these trends, with analysts projecting strong earnings growth and improved cost efficiency. Higher silver prices are expected to significantly boost EBITDA in FY27.",
            "pubDate": "2025-12-29T04:16:57.007775"
        },
        {
            "title": "Japan's Nikkei slips as tech stocks track Wall Street lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slips-as-tech-stocks-track-wall-street-lower/articleshow/126223530.cms",
            "description": "Tokyo's Nikkei index saw a slight dip on Monday, breaking a two-day rally. Technology shares mirrored a weak Wall Street close. Some major companies traded ex-dividend, impacting the market. Banks, however, showed gains following discussions on interest rate hikes. Value stocks performed better, driven by retail investor interest in NISA accounts.",
            "pubDate": "2025-12-29T04:16:57.007870"
        },
        {
            "title": "Hindustan Copper shares surge 15% to lifetime high. Should traders chase the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-soar-30-in-6-days-to-hit-record-high-whats-fueling-the-surge-and-what-should-traders-do-now/articleshow/126223511.cms",
            "description": "Hindustan Copper shares are experiencing a significant rally in December 2025. The stock has climbed over 48% in just seven trading sessions, reaching an all-time high. This surge is driven by increasing global copper prices and a weakening rupee. Investors are showing strong interest in metal stocks.",
            "pubDate": "2025-12-29T04:16:57.007968"
        },
        {
            "title": "Ola Electric shares in focus as Bharat Cell scooter deliveries scale up across 4 states",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-as-bharat-cell-scooter-deliveries-scale-up-across-4-states/articleshow/126223436.cms",
            "description": "Ola Electric Mobility’s shares are set to be in focus after the company said it has scaled up deliveries of scooters powered by its indigenously manufactured 4680 Bharat Cell battery across four states, marking a wider rollout of its in-house EV technology.",
            "pubDate": "2025-12-29T04:16:57.008066"
        },
        {
            "title": "Defence stocks HAL, BEL, others in focus ahead Defence Acquisition Council meet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-hal-bel-others-in-focus-ahead-defence-acquisition-council-meet/articleshow/126223325.cms",
            "description": "Defence stocks are in focus as the Defence Acquisition Council meets today to consider high-value proposals, potentially worth Rs 80,000 crore, for critical military systems. The meeting is expected to boost the order pipeline for domestic manufacturers, with approvals for missile systems and drone leasing on the agenda.",
            "pubDate": "2025-12-29T04:16:57.008162"
        },
        {
            "title": "IRCTC among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irctc-among-4-stocks-showing-bullish-rsi-upswing/slideshow/126223366.cms",
            "description": "On December 26, four stocks in the Nifty 200 that gained over 2% were highlighted in the RSI Trending Up scan, based on data from StockEdge. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify opportunities for buying.",
            "pubDate": "2025-12-29T04:16:57.008259"
        },
        {
            "title": "Sigachi Industries shares in focus after CEO remanded in Hyderabad unit fire probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sigachi-industries-shares-in-focus-after-ceo-remanded-in-hyderabad-unit-fire-probe/articleshow/126223291.cms",
            "description": "Sigachi Industries shares are set to remain in focus after the company disclosed that its Managing Director and CEO was remanded in connection with the Hyderabad unit fire probe. While investigations continue, the company has assured operational continuity and appointed an interim leader to oversee day-to-day business activities.",
            "pubDate": "2025-12-29T04:16:57.008356"
        },
        {
            "title": "Why dividend stocks continue to attract global investors and HNIs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-dividend-stocks-continue-to-attract-global-investors-and-hnis/articleshow/126224552.cms",
            "description": "In today's volatile investment climate, dividend-paying stocks are regaining favor among high-net-worth individuals and long-term investors globally. These companies offer predictable income, a buffer against market downturns, and potential inflation protection, making them a stabilizing force in diversified portfolios.",
            "pubDate": "2025-12-29T05:00:11.790117"
        },
        {
            "title": "NBCC shares rise 9% in just two trading sessions! What’s fuelling the rise today?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-shares-rise-9-in-just-two-trading-sessions-whats-fuelling-the-rise-today/articleshow/126224482.cms",
            "description": "NBCC shares surged 3% to Rs 126 following a settlement with the Delhi government over a 42.46-acre land parcel, granting the PSU development rights. This resolution, coupled with recent approvals for infrastructure projects at Mumbai Port, has boosted investor confidence. The stock is up over 8% in two sessions and 34% year-to-date.",
            "pubDate": "2025-12-29T05:00:11.790259"
        },
        {
            "title": "John Cockerill India shares surge 5% for second straight day after Ramesh Damani’s bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/john-cockerill-india-shares-surge-5-for-second-straight-day-after-ramesh-damanis-bulk-deal/articleshow/126224462.cms",
            "description": "John Cockerill India shares jumped nearly 5% after veteran investor Ramesh Damani bought shares via a bulk deal, extending a two-day rally. The move lifted investor sentiment, supported by strong long-term returns and bullish technical signals, though valuations remain elevated at current levels.",
            "pubDate": "2025-12-29T05:00:11.790465"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/126223976.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-12-29T05:00:11.790562"
        },
        {
            "title": "Coforge shares rally over 2% after $2.35 billion Encora deal. Should investors buy the stock now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-shares-rally-over-2-after-2-35-billion-encora-deal-should-investors-buy-the-stock-now/articleshow/126225000.cms",
            "description": "Coforge rose after it announced a $2.35 billion acquisition of US-based AI firm Encora.",
            "pubDate": "2025-12-29T05:34:18.257671"
        },
        {
            "title": "IRFC, RVNL, other railway-linked stocks slide up to 3% after 5 sessions of gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irfc-rvnl-other-railway-linked-stocks-slide-up-to-3-after-5-sessions-of-gains/articleshow/126224840.cms",
            "description": "Railway-linked stocks including IRFC and RVNL slipped up to 3% on Monday as investors booked profits after five straight sessions of sharp gains, even as the sector remains in focus following a recent passenger fare hike and rising expectations from the Union Budget 2026–27.",
            "pubDate": "2025-12-29T05:34:18.257801"
        },
        {
            "title": "Vedanta shares gain over 2% to hit 52-week high. Here’s what drove the surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-gain-over-2-to-hit-52-week-high-heres-what-drove-the-surge/articleshow/126225530.cms",
            "description": "Vedanta shares hit a fresh 52-week high as rising silver prices, strong performance in Hindustan Zinc and its successful bid for the Depo Graphite–Vanadium Block lifted investor confidence in metal and mining stocks.",
            "pubDate": "2025-12-29T05:53:46.327314"
        },
        {
            "title": "MMTC shares rally over 10% as gold, silver prices hit record highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mmtc-shares-rally-over-10-as-gold-silver-prices-hit-record-highs/articleshow/126225500.cms",
            "description": "MMTC shares rally over 31% in seven sessions as record-high gold and silver prices lift sentiment and strengthen bullish technical indicators.",
            "pubDate": "2025-12-29T05:53:46.327420"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-36/articleshow/126227184.cms",
            "description": "Although the Nifty and Sensex are range bound, market breadth has a bullish bias. At this juncture, keep an eye out for things the market is overlooking. For instance, the strong upward movement in base metal prices. This will impact inflation. Similarly, the impact of Chinese dumping is also being overlooked by the market. So, while it is time to be bullish with a long-term perspective, keep some of these things in mind. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-12-29T07:52:08.061799"
        },
        {
            "title": "Vikran Engineering shares zoom nearly 10% after winning 45.75 MW AC capacity solar project bids in Madhya Pradesh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikran-engineering-shares-zoom-nearly-10-after-winning-45-75-mw-ac-capacity-solar-project-bids-in-madhya-pradesh/articleshow/126227124.cms",
            "description": "Vikran Engineering shares soared after it accepted LOAs for 45.75 MW solar projects in Madhya Pradesh under the PM KUSUM-C scheme. The projects will be executed in Vidisha district to supply power to MPPMCL.",
            "pubDate": "2025-12-29T07:52:08.061927"
        },
        {
            "title": "7 long weekends! NSE, BSE 2026 stock market holiday calendar shows markets will remain shut for 15 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-long-weekends-nse-bse-2026-stock-market-holiday-calendar-shows-markets-will-remain-shut-for-15-days/articleshow/126226137.cms",
            "description": "NSE and BSE announce the 2026 trading holiday calendar, highlighting seven long weekends and Muhurat trading. Advance visibility helps investors plan around closures, while brokerages anticipate 2026 as a recovery year for Indian equities post-volatile 2025.",
            "pubDate": "2025-12-29T07:52:08.062047"
        },
        {
            "title": "Jupiter Wagons shares dip 3% after five-day winning streak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-wagons-shares-dip-3-after-five-day-winning-streak/articleshow/126226034.cms",
            "description": "Jupiter Wagons shares fall 3% after a five-day 37% rally post-promoter stake increase. Despite high valuations and overbought RSI, promoters maintain control. Technicals suggest short-term correction while momentum remains strong amid profit booking by institutional investors.",
            "pubDate": "2025-12-29T07:52:08.062150"
        },
        {
            "title": "European shares touch record high as markets resume post-holiday trading",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-touch-record-high-as-markets-resume-post-holiday-trading/articleshow/126229018.cms",
            "description": "European shares struck a record high on Monday, with basic resources stocks in the lead, as trading resumed following the ‌Christmas and ‌Boxing Day holidays.",
            "pubDate": "2025-12-29T09:52:42.331477"
        },
        {
            "title": "FII-backed: 10 high-growth, high-margin stocks surged up to 530% in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-backed-10-high-growth-high-margin-stocks-surged-up-to-530-in-a-year/slideshow/126229044.cms",
            "description": "When foreign institutional investors (FIIs) increase their exposure to companies with strong fundamentals, those stocks become worth tracking. To identify such opportunities, we screened companies that posted robust year-on-year sales and profit growth of over 10% in the September quarter, while also maintaining healthy profit margins above 10% despite a challenging economic environment. Additionally, these companies saw an increase in FII shareholding during the September quarter compared to the previous quarter. The screening excluded banking and financial stocks and considered only companies with a market capitalisation above Rs 1,500 crore.Applying these filters across BSE-listed companies yielded a universe of around 100 stocks. We then added price performance criteria, which revealed that nearly half of these stocks have delivered double-digit returns in CY25 so far. From this group, we shortlisted 14 standout stocks that rallied between 50% and 530% over the past year. Notably, three of these stocks more than doubled investor wealth during the same period. (Data Source: ACE Equity)",
            "pubDate": "2025-12-29T09:52:42.331599"
        },
        {
            "title": "Market Wrap: Sensex slides 346 pts, Nifty below 25,950 as year-end lull drags D-St",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slides-346-pts-nifty-below-26000-as-year-end-lull-drags-d-st/articleshow/126229984.cms",
            "description": "Indian equities slipped on Monday as thin year-end volumes and continued foreign outflows weighed on sentiment. The Sensex and Nifty extended their losing streak, dragged by weakness in energy, IT and large-cap stocks. Caution prevailed amid global trade worries, a soft rupee, and focus shifting toward upcoming Q3 earnings and U.S. trade developments.",
            "pubDate": "2025-12-29T10:50:04.687274"
        },
        {
            "title": "Record foreign outflows cap India stock rally in 2025; selling may ease next year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/record-foreign-outflows-cap-india-stock-rally-in-2025-selling-may-ease-next-year/articleshow/126229720.cms",
            "description": "Record foreign selling capped the rise in India's share market ‍in 2025 even as the ​benchmarks scaled fresh highs after a 14-month rally, underscoring a ⁠growing divergence between the behaviour of global and domestic investors.",
            "pubDate": "2025-12-29T10:50:04.687421"
        },
        {
            "title": "Stock Radar: Down 20% from highs! Why Container Corp stock showing signs of bottoming out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-down-20-from-highs-why-container-corp-stock-showing-signs-of-bottoming-out/articleshow/126189160.cms",
            "description": "Container Corporation of India shares, despite a sharp correction from recent highs, are trading near a six-year long-term support zone. Technical indicators suggest a possible short-term rebound, with experts highlighting bullish divergence and improving momentum.",
            "pubDate": "2025-12-29T11:35:12.944067"
        },
        {
            "title": "India’s savings story, much bigger & stable: 9 stocks from the savings & growth ecosystem with upside potential of up to 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-savings-story-much-bigger-stable-9-stocks-from-the-savings-growth-ecosystem-with-upside-potential-of-up-to-43/articleshow/126231089.cms",
            "description": "Look and think beyond the obvious, because the tailwinds for many sectors are a function of a growth in the GDP rather than anything else. Yes, in the short term there will be some noise about them. But there is enough proof both locally and globally that, finally, it is the GDP which comes out the winner. And these are the sectors that will benefit the most.",
            "pubDate": "2025-12-29T11:35:12.944189"
        },
        {
            "title": "Silver's Rs 21,000 crash tips Nithin Kamath to warn traders of position sizing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silvers-rs-21000-crash-tips-nithin-kamath-to-warn-traders-of-position-sizing/articleshow/126231748.cms",
            "description": "Silver futures saw an intraday drop of Rs 21,000, highlighting extreme market volatility. Zerodha CEO Nithin Kamath used the move to emphasise the role of position sizing and risk management. Factors like profit booking, easing geopolitical tensions, and recent margin hikes contributed to the sharp reversal in prices.",
            "pubDate": "2025-12-29T11:54:01.857097"
        },
        {
            "title": "NMDC, Hindustan Zinc among 6 stocks hit 52-week highs; gains up to 27% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nmdc-hindustan-zinc-among-6-stocks-hit-52-week-highs-gains-up-to-27-in-a-month/slideshow/126232597.cms",
            "description": "Benchmark Sensex ended 345 points lower at 84,695 on Monday. Despite the broader market weakness, six BSE 200 stocks scaled fresh 52-week highs, hitting their strongest levels over the past year. Such breakouts often indicate sustained bullish momentum and could point to further upside potential in the near term.",
            "pubDate": "2025-12-29T13:09:29.674230"
        },
        {
            "title": "Growth Leaders: 10 largecap stocks with stellar YoY Sales gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/growth-leaders-10-largecap-stocks-with-stellar-yoy-sales-gains/slideshow/126232243.cms",
            "description": "A robust rise in quarterly sales on a year-over-year (YoY) basis signals strong business growth and heightened demand. Among NSE large-cap companies (excluding banking and financials), the top 10 firms posted over 25% sales growth in the September 2025 quarter versus the same period in 2024, according to StockEdge.com. This surge reflects a company’s ability to attract and retain customers, highlighting growth potential. However, assessing the sustainability of this momentum remains crucial.",
            "pubDate": "2025-12-29T13:09:29.674355"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/126233948.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-29T14:24:44.688635"
        },
        {
            "title": "Market Trading Guide: Buy Gujarat Ambuja, and this smallcap on Tuesday for up to 14% gains. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-gujarat-ambuja-and-this-smallcap-on-tuesday-for-up-to-14-gains-heres-why/slideshow/126234052.cms",
            "description": "Nifty ended with cuts for the third day in a row, dragged by IT stocks, with selling pressure also seen in financials and the auto pack. The trend remains weak as the index has moved below the 21 EMA.Rupak De, Senior Technical Analyst at LKP Securities, attributed the decline to profit booking during the session. \"On the derivatives front, 26,000 PE PUT writers unwound their positions as the index slipped below this level. Nifty has retraced more than 50% of the previous rise, casting doubt over the sustainability of the recent rally. On the downside, support is placed at 25,900, while on the upside, the 26,000 level is likely to act as the initial resistance,\" De said.Here are 2 stock recommendations for Tuesday:",
            "pubDate": "2025-12-29T14:24:44.688751"
        },
        {
            "title": "Honasa Consumer Block Deal: Promoter Varun Alagh ups stake in Mamaearth parent as stock trades 15% below IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-block-deal-promoter-varun-alagh-ups-stake-in-mamaearth-parent-as-stock-trades-15-below-ipo-price/articleshow/126234367.cms",
            "description": "Honasa Consumer promoter Varun Alagh raised his stake by 57 bps in Mamaearth parent company, acquiring 18.52 lakh shares from Fireside Ventures in a Rs 50 crore block deal. He bought the shares at Rs 270 each, slightly above the previous close, increasing his total holding to 31.88%.",
            "pubDate": "2025-12-29T14:44:09.456073"
        },
        {
            "title": "Two Trades for Today: A PSU oil refiner for a 5.1% upmove; a large-cap commercial vehicle stock for an almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-psu-oil-refiner-for-a-5-1-upmove-a-large-cap-commercial-vehicle-stock-for-an-almost-6-gain/articleshow/126234244.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-29T14:44:09.456206"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/126235005.cms",
            "description": "Indian markets ended lower on Monday, with the Sensex and Nifty slipping as muted year-end volumes and foreign fund outflows weighed on investor sentiment. Analysts highlight a consolidation phase, favouring large-caps, while top active stocks included Hindustan Copper, Hindustan Zinc, Dixon Technologies, and Vedanta. Market breadth remained bearish.",
            "pubDate": "2025-12-29T15:38:01.364860"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of up to 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-up-to-25/articleshow/126234771.cms",
            "description": "At a time when the Indian markets are dealing with confusion and lack of clarity on many fronts, it may be better for investors to have a twin strategy. Select a stock where it would pay off to be bullish, but also keep some powder dry for a day to buy them – a day when panic is triggered on the market. The twin strategy may work better for a simple reason. In the short term, there are many factors suggesting a higher probability of the volatility quotient remaining high. It is better to use volatility as a tool rather than be scared of it.",
            "pubDate": "2025-12-29T15:38:01.364981"
        },
        {
            "title": "Mangalam Drugs Bulk Deal: Vijay Kedia's new bet is a microcap that has plunged over 70% in one year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mangalam-drugs-bulk-deal-vijay-kedias-new-bet-is-a-microcap-that-has-plunged-over-70-in-one-year/articleshow/126235212.cms",
            "description": "Ace investor Vijay Kedia has picked up 1.38 lakh shares of Mangalam Drugs in a Rs 33 lakh bulk deal, marking a fresh bet on a microcap that has crashed over 70% in a year.  Kedia purchased the shares via his investment company, Kedia Securities Private Ltd. The shares were bought for Rs 24.15 per equity share, which was a 1.5% premium over the Friday closing price of Rs 23.78 on the NSE.",
            "pubDate": "2025-12-29T15:50:54.116145"
        }
    ]
}