{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-25T03:48:59.824542",
    "items": [
        {
            "title": "Stock Market Christmas 2025 Holiday: NSE, BSE will be closed for Christmas celebration; check holiday list for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-christmas-2025-holiday-nse-bse-will-be-closed-for-christmas-celebration-check-holiday-list-for-2026/articleshow/126169119.cms",
            "description": "Christmas 2025 Stock Market Holiday: NSE and BSE are closed for trading today due to the Christmas holiday. The commodity exchanges MCX and NCDEX will also take a day's break and resume trading on Friday.",
            "pubDate": "2025-12-25T02:32:28.479682"
        },
        {
            "title": "Order pipeline to keep LTIMindtree in good books",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/order-pipeline-to-keep-ltimindtree-in-good-books/articleshow/126169673.cms",
            "description": "LTIMindtree has seen its stock soar by 18% over the last quarter, surpassing the broader IT index. Recently reported new order bookings have exceeded market expectations, leading analysts to adjust their target prices upwards. The company has also demonstrated sequential revenue and net profit growth, alongside enhanced operating margins attributed to efficiency improvements.",
            "pubDate": "2025-12-25T03:48:58.066322"
        },
        {
            "title": "Two-thirds of Nifty 500 stocks trade in overvalued zone",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-thirds-of-nifty-500-stocks-trade-in-overvalued-zone/articleshow/126169643.cms",
            "description": "A study by Omniscience Capital reveals that nearly 65% of India's Nifty 500 stocks are overvalued, with the index trading at a high P/E ratio relative to its growth prospects. While financials, utilities, industrials, and energy sectors appear attractively positioned, consumer staples, healthcare, and IT sectors show overvaluation.",
            "pubDate": "2025-12-25T03:48:58.066422"
        },
        {
            "title": "Metal rally lifts Hind Copper, Hind Zinc to fresh highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metal-rally-lifts-hind-copper-hind-zinc-to-fresh-highs/articleshow/126169322.cms",
            "description": "Hindustan Copper and Hindustan Zinc shares reached new highs on Wednesday, driven by global metal rallies. Hindustan Copper's surge is attributed to tightening global copper supplies and rising demand from new-age sectors, while Hindustan Zinc benefits from a sharp increase in silver prices, a key by-product for the company.",
            "pubDate": "2025-12-25T03:48:58.066580"
        }
    ]
}