{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-04T10:38:23.781616",
    "items": [
        {
            "title": "Q2 results: Nifty companies show zero profit growth leading to downgrades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-nifty-companies-show-zero-profit-growth-leading-to-downgrades/articleshow/114932310.cms",
            "description": "September quarter results reveal weaker-than-expected earnings, with a flat YoY growth for 34 Nifty companies. Key downgrades in earnings estimates affected FY25 and FY26 projections, led by BPCL, Reliance Industries, and Coal India. Mixed performance noted across banks, IT, consumer, and oil marketing companies.",
            "pubDate": "2024-11-04T06:52:39.837160"
        },
        {
            "title": "Q2 results today: IRFC, IRCTC, Raymond among 47 companies to announce earnings on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-irfc-irctc-raymond-among-47-companies-to-announce-earnings-on-monday/articleshow/114926577.cms",
            "description": "Key companies, including IRFC, IRCTC, and Raymond, are set to announce their quarterly earnings today. Amara Raja Energy is anticipated to report a 17% YoY growth in net profit and a 10% YoY increase in revenue, driven by solid performance in the aftermarket division and new energy business.",
            "pubDate": "2024-11-04T06:52:39.837288"
        },
        {
            "title": "IRFC Q2 Results: PAT jumps 4% YoY to Rs 1,612 crore, revenue up by 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irfc-q2-results-pat-jumps-4-yoy-to-rs-1612-crore-revenue-up-by-2/articleshow/114944680.cms",
            "description": "Indian Railway Finance Corporation (IRFC) reported a 4% YoY jump in net profit to Rs 1,612.65 crore in Q2FY25. Revenue from operations increased by 2% to Rs 6,899.34 crore. The company declared an interim dividend of Rs 0.80 per share.",
            "pubDate": "2024-11-04T10:38:22.117947"
        },
        {
            "title": "Exide Industries Q2 Results: PAT drops 14% to Rs 233 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/exide-industries-q2-results-pat-drops-14-to-rs-233-crore/articleshow/114944488.cms",
            "description": "Battery maker Exide Industries Ltd on Monday reported a 13.66 per cent decline in consolidated profit after tax at Rs 233.4 crore in the September quarter, impacted by higher expenses.",
            "pubDate": "2024-11-04T10:38:22.118061"
        },
        {
            "title": "Titan Q2 Preview: Profit likely to decline up to 27% on one-time exceptional charge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titan-q2-preview-profit-likely-to-decline-up-to-27-on-one-time-exceptional-charge/articleshow/114942230.cms",
            "description": "Net profit for the July-September 2024 quarter is expected to decline by up to 27% year-on-year, based on the average estimate from four brokerages. In contrast, net sales are projected to increase by 3% year-on-year during the same period, according to the estimates.",
            "pubDate": "2024-11-04T10:38:22.118165"
        }
    ]
}