{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-24T10:36:58.973312",
    "items": [
        {
            "title": "IndusInd net falls on rise in provisions, expects better Q4",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-net-profit-falls-on-rise-in-provisions/articleshow/127349700.cms",
            "description": "IndusInd Bank's net profit plummeted 91% to ₹128 crore in the third quarter due to deteriorating asset quality and increased provisions. Despite this sharp decline, the bank returned to profitability after a significant loss in the previous quarter, which was impacted by microloan provisions and derivative misreporting issues.",
            "pubDate": "2026-01-24T04:45:27.801332"
        },
        {
            "title": "Kotak Mahindra Bank Q3 results: Standalone PAT rises 4% YoY, NII grows 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-mahindra-bank-q3-results-standalone-pat-jumps-4-yoy-nii-grows-5/articleshow/127381952.cms",
            "description": "Kotak Mahindra Bank has announced a solid financial performance for the third quarter of fiscal year 2026. The private lender saw its standalone net profit climb 4% year-on-year to Rs 3,446 crore.  This growth was supported by a 5% rise in net interest income, reaching Rs 7,565 crore, indicating a healthy expansion in its core lending operations.",
            "pubDate": "2026-01-24T10:36:57.812307"
        },
        {
            "title": "UltraTech Cement Q3 results: Cons PAT zooms 32% YoY, net sales up over 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-q3-results-cons-pat-zooms-32-yoy-net-sales-up-over-22/articleshow/127378164.cms",
            "description": "Ultratech Cement has announced strong financial results for the third quarter of FY26. The company's profit after tax saw a significant 32% year-on-year increase, reaching Rs 1,792 crore. Net sales also climbed by 22.5% year-on-year to Rs 21,506 crore. These figures exclude the impact of the New Labour Code.",
            "pubDate": "2026-01-24T10:36:57.812434"
        }
    ]
}