{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-03T04:31:19.122312",
    "items": [
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/125046372.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-11-03T04:30:59.734831"
        },
        {
            "title": "Godrej Consumer shares rally 6% as Goldman Sachs raises target after Q2 show. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-shares-rally-6-after-q2-results-should-you-buy-sell-or-hold/articleshow/125046689.cms",
            "description": "Godrej Consumer shares: The company’s Q2 FY26 profit fell 6.5% YoY to ₹459.3 crore despite a 4.3% rise in revenue to ₹3,825 crore. EBITDA declined 3.5% to ₹733.6 crore, with margins easing to 19.2% from 20.7%. India operations posted steady 4% sales growth and 3% volume growth, driven by strong gains in non-soap categories.",
            "pubDate": "2025-11-03T04:30:59.734963"
        },
        {
            "title": "​Chasing returns? Lenskart, Groww among 7 IPO GMPs show up to 21% likely gains to investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chasing-returns-lenskart-groww-among-7-ipo-gmps-show-up-to-21-likely-gains-to-investors/slideshow/125046327.cms",
            "description": "A fresh wave of high-profile public offerings will hit Dalal Street this week, which will also feature issues from last week from the likes of Lenskart and Studds Accessories. Here's how GMPs are faring in the grey market.",
            "pubDate": "2025-11-03T04:30:59.735079"
        },
        {
            "title": "JK Cement shares fall 3% after Q2 results, Citi reduces target price. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jk-cement-shares-in-focus-as-q2-profit-rises-17-should-you-buy-sell-or-hold/articleshow/125046407.cms",
            "description": "JK Cement reported a 17% year-on-year rise in consolidated profit to Rs 159 crore for Q2 FY26, driven by higher volumes. Revenue grew 18% to Rs 3,019 crore, though margins were pressured by rising costs. The company also expanded capacity at its Prayagraj unit.",
            "pubDate": "2025-11-03T04:30:59.735183"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama sees over 20% upside in BEL: Citi recommends buy on Maruti Suzuki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-sees-over-20-upside-in-bel-citi-recommends-buy-on-maruti-suzuki/articleshow/125046316.cms",
            "description": "Brokerages are optimistic about select auto and manufacturing stocks, with Citi and Nuvama reiterating 'Buy' ratings on Maruti Suzuki, JK Cement, and BEL. Strong growth prospects, resilient earnings, and margin outperformance are key drivers cited by analysts for these positive outlooks.",
            "pubDate": "2025-11-03T04:30:59.735288"
        },
        {
            "title": "Sensex slips over 250 points, Nifty dips below 25,700 as private banks, FMCG stocks drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-250-points-nifty-dips-below-25700-as-private-banks-fmcg-stocks-drag/articleshow/125046343.cms",
            "description": "Indian equities opened November on a cautious note, slipping after October’s strong rally as private banks and FMCG stocks weighed on sentiment. Analysts cited profit booking and renewed foreign investor selling, though steady earnings momentum and resilient auto demand helped limit deeper market losses.",
            "pubDate": "2025-11-03T04:30:59.735393"
        },
        {
            "title": "Banking Pot: Is something hot brewing?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banking-pot-is-something-hot-brewing/articleshow/125046009.cms",
            "description": "Over $6 billion in fresh FDI inflows into private banks like Yes Bank and Federal Bank highlight renewed global confidence in India’s banking sector. Improving credit quality, moderating costs, and signs of private capex revival add to the sector’s bullish outlook.",
            "pubDate": "2025-11-03T04:30:59.735495"
        },
        {
            "title": "BPCL shares in focus after Q2 PAT soars 170% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bpcl-shares-in-focus-after-q2-pat-soars-170-yoy/articleshow/125045976.cms",
            "description": "BPCL reported a 170% YoY surge in Q2 net profit to Rs 6,191 crore, driven by improved refining margins, cost control, and government compensation for LPG under-recoveries, while revenue rose 3% YoY to Rs 1.21 lakh crore despite a sequential decline.",
            "pubDate": "2025-11-03T04:30:59.735597"
        },
        {
            "title": "Zen Technologies shares rise 7% on Rs 289-crore order from defence ministry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zen-technologies-shares-in-focus-on-rs-289-crore-order-from-ministry-of-defence/articleshow/125045947.cms",
            "description": "Zen Technologies shares surged on Monday after announcing two major contracts worth Rs 289 crore from India's Ministry of Defence. These contracts are for upgrading Anti-Drone Systems. The upgrades will be completed within a year. This development follows recent operations highlighting the need for advanced drone defence. The company aims to keep India ahead in defence technology.",
            "pubDate": "2025-11-03T04:30:59.735737"
        },
        {
            "title": "Maruti Suzuki shares fall 3% after Q2 results, October sales volumes. Should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-shares-in-focus-after-8-yoy-rise-in-q2-pat-october-sales-volumes-should-you-buy/articleshow/125045832.cms",
            "description": "Maruti Suzuki share price: Maruti Suzuki reported an 8% YoY rise in Q2 PAT and strong October sales growth, with brokerages like Goldman Sachs, Elara, and Citi maintaining positive outlooks on robust festive demand, improving exports, and upcoming SUV launches driving medium-term performance.",
            "pubDate": "2025-11-03T04:30:59.735838"
        },
        {
            "title": "CDSL shares in focus after Nuvama raises target price despite weak Q2 show",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cdsl-shares-in-focus-after-nuvama-raises-target-price-despite-weak-q2-show/articleshow/125045759.cms",
            "description": "CDSL reported a 13.6% YoY drop in Q2FY26 net profit to Rs 140 crore, hurt by higher expenses and lower income, though sequential growth remained strong with a 37% QoQ profit jump. Nuvama retained its Buy rating and raised the target price to Rs 1,840, citing sharp growth in IPO, corporate action, and data charges.",
            "pubDate": "2025-11-03T04:30:59.735936"
        },
        {
            "title": "Urban Company shares fall 6% after Q2 loss widens YoY to Rs 59 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-in-focus-after-q2-loss-widens-yoy/articleshow/125045418.cms",
            "description": "Urban Company reported a sharp rise in Q2FY26 net loss to Rs 59 crore from Rs 2 crore a year ago, even as revenue jumped 37% YoY to Rs 380 crore. Losses stemmed from its new Insta Help vertical. Excluding it, the firm posted an adjusted EBITDA profit, with strong growth across India, Native, and international segments.",
            "pubDate": "2025-11-03T04:30:59.736034"
        },
        {
            "title": "Manappuram Finance, Bandhan Bank among 6 F&O stocks with a sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/manappuram-finance-bandhan-bank-among-6-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125045679.cms",
            "description": "There was a notable surge in futures open interest for six stocks in the NSE F&O pack as of October 31, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-11-03T04:30:59.736131"
        },
        {
            "title": "Navin Fluorine and 4 other stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/navin-fluorine-and-4-other-stocks-witness-5-year-swing-high-breakouts/slideshow/125045575.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1000 crore, five stocks witnessed a 5-year swing high at the close on October 31, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-11-03T04:30:59.736225"
        },
        {
            "title": "Lodha Developers among 9 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lodha-developers-among-9-stocks-showing-bullish-rsi-upswing/slideshow/125045469.cms",
            "description": "Nine stocks from the Nifty500 pack were highlighted in the RSI Trending Up scan on October 31, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-03T04:30:59.736323"
        },
        {
            "title": "3 PSU stocks to trade ex-dividend on Tuesday. Check details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/3-psu-stocks-to-trade-ex-dividend-on-tuesday-check-details-here/articleshow/125045091.cms",
            "description": "Investors have a final chance today, November 3, to buy shares in Coal India, Mazagon Dock Shipbuilders, and RailTel Corporation of India. These public sector undertakings are offering interim dividends. Shares will trade ex-dividend from November 4. Other companies like Bhansali Engineering Polymers, Happiest Minds Technologies, and Sundram Fasteners also go ex-dividend on November 4.",
            "pubDate": "2025-11-03T04:30:59.736421"
        }
    ]
}