{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-30T02:54:00.663327",
    "items": [
        {
            "title": "Microsoft beats expectations with 18% revenue jump, but shares slide",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/microsoft-beats-expectations-with-18-revenue-jump-but-shares-slide/articleshow/124929080.cms",
            "description": "Microsoft announced impressive quarterly earnings, with revenue surging due to high demand for artificial intelligence services.  This boosted its cloud computing business significantly.  However, the company's stock saw a decline as investors worried about how quickly AI will generate profits.  An Azure cloud service outage also impacted operations.  Microsoft continues to invest heavily in AI, including its partnership with OpenAI.",
            "pubDate": "2025-10-30T02:53:58.998481"
        },
        {
            "title": "Alphabet beats quarterly revenue estimates on strong ad, cloud demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/alphabet-beats-quarterly-revenue-estimates-on-strong-ad-cloud-demand/articleshow/124928864.cms",
            "description": "Google-parent Alphabet surpassed revenue expectations for the third quarter. Its advertising and cloud computing divisions showed strong performance. Google Cloud's growth was fueled by enterprise demand for AI infrastructure. The company's advertising business also saw steady gains. This comes as competition in the AI and cloud market intensifies.",
            "pubDate": "2025-10-30T02:53:58.998605"
        },
        {
            "title": "Meta's profit hit by $16 billion one-time tax charge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/metas-profit-hit-by-16-billion-one-time-tax-charge/articleshow/124928777.cms",
            "description": "Meta faced a substantial charge impacting its stock. The company is heavily investing in AI infrastructure, planning massive data centers. This aggressive spending, shared by major tech firms, raises concerns about an AI bubble. Meta is also streamlining its AI unit with job cuts. These moves signal a focus on long-term AI development despite current cost pressures.",
            "pubDate": "2025-10-30T02:53:58.998712"
        }
    ]
}