{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-28T19:57:04.152936",
    "items": [
        {
            "title": "Can Fin's growth story finds new homes in the North",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-fins-growth-story-finds-new-homes-in-the-north/articleshow/125627583.cms",
            "description": "The surge in Can Fin Homes' stock prices reflects its successful strategy to extend operations outside southern India. As the company spreads its wings, it expects a substantial increase in its asset management growth. Recent reports indicate a sharp rise in loan disbursements, backed by strong asset quality and controlled NPAs.",
            "pubDate": "2025-11-28T02:49:44.808037"
        },
        {
            "title": "Gift Nifty trades on flat note; here's the trading setup for the day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-trades-on-flat-note-here-the-trading-setup-for-the-day/articleshow/125626931.cms",
            "description": "Indian markets reached new record highs on Thursday. Global markets showed strong performance, boosting domestic sentiment. Analysts identified 26,300 as a key resistance level. A break above this could lead to further gains. The India VIX, a fear gauge, declined. Foreign investors were net sellers, while domestic institutional investors were net buyers. The rupee weakened against the US dollar.",
            "pubDate": "2025-11-28T02:49:44.808161"
        },
        {
            "title": "Global stocks hold steady after four-day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-hold-steady-after-four-day-rally/articleshow/125627215.cms",
            "description": "Global equities held firm, buoyed by expectations of faster Federal Reserve rate cuts and a return of risk appetite, with Bitcoin surging. Markets anticipate a year-end rally, supported by a positive macro outlook and decent corporate earnings. Tech shares led gains in Asia, while German equities rose on takeover interest.",
            "pubDate": "2025-11-28T02:49:44.808371"
        },
        {
            "title": "Analysts see bullish trend intact as Nifty hits record high. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/analysts-see-bullish-trend-intact-as-nifty-hits-record-high-what-should-investors-do/articleshow/125627166.cms",
            "description": "Nifty hit a fresh intraday record, with analysts expecting the bullish trend to continue towards 26,500. Traders are advised to hold existing positions and focus on outperforming sectors like banking and financials. Strategies like buying at-the-money call options or bull-call spreads are suggested for potential gains.",
            "pubDate": "2025-11-28T02:49:44.808469"
        },
        {
            "title": "Nifty breaks a 14-month lull, yet Silver and Gold returns dominate D-Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-breaks-a-14-month-lull-yet-silver-and-gold-returns-dominate-d-street/articleshow/125627095.cms",
            "description": "After a 14-month period of underperformance compared to global peers, India's Nifty index has reached a new all-time high. During this time, silver and gold emerged as top-performing assets, while specific Indian sectoral indices like Capital Markets, PSU Bank, and Defence also saw significant gains.",
            "pubDate": "2025-11-28T02:49:44.808563"
        },
        {
            "title": "D-Street scales new peaks after 14 months as FPI selling cools, US-India deal eyed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-scales-new-peaks-after-14-months-as-fpi-selling-cools-us-india-deal-eyed/articleshow/125627051.cms",
            "description": "Indian stock markets reached new heights on Thursday, with the Sensex and Nifty crossing previous records. This surge follows a 14-month period of consolidation. Investors are now looking towards a potential US-India trade deal and a decrease in foreign investor selling to fuel further market gains. Analysts suggest focusing on large-cap stocks for potential upside.",
            "pubDate": "2025-11-28T02:49:44.808660"
        },
        {
            "title": "Asian stocks ebb as global rally loses momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-ebb-as-global-rally-loses-momentum/articleshow/125627007.cms",
            "description": "Asian stocks showed signs of losing momentum Friday, with indexes opening lower in South Korea and Japan, while global equities remained flat. Investors are closely watching Chinese stocks after JPMorgan upgraded its recommendation, and are also focused on the yen's stability amid steady Tokyo inflation and potential Bank of Japan rate hikes.",
            "pubDate": "2025-11-28T02:49:44.808752"
        },
        {
            "title": "Stocks in news: Bandhan Bank, Lenskart, LG India, Adani Enterprises, Wipro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-bandhan-bank-lenskart-lg-india-adani-enterprises-wipro/articleshow/125626885.cms",
            "description": "Markets reached a new record high on Thursday, buoyed by positive global sentiment, expectations of interest rate cuts, and falling crude oil prices. Several companies, including Bandhan Bank, Lenskart, and Adani Enterprises, are in focus due to significant business developments and strategic moves.",
            "pubDate": "2025-11-28T02:49:44.808846"
        },
        {
            "title": "Emcure Pharma shares in focus after GST Department conducts search at Mumbai offices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emcure-pharma-shares-in-focus-after-gst-department-conducts-search-at-mumbai-offices/articleshow/125628471.cms",
            "description": "Emcure Pharmaceuticals' shares could see action following a Goods and Services Tax search at its Mumbai offices. The inspection concluded this week. The company recently reported a robust rise in revenue and profit after tax. Domestic and international businesses both showed strong performance.",
            "pubDate": "2025-11-28T03:58:02.615067"
        },
        {
            "title": "Zydus Lifesciences shares in focus after US FDA nods for diabetes and blood pressure drugs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-after-us-fda-nods-for-diabetes-and-blood-pressure-drugs/articleshow/125628439.cms",
            "description": "Zydus Lifesciences is set to be in focus after it received tentative approval from the United States Food and Drug Administration for Empagliflozin and Linagliptin combination tablets for type 2 diabetes, alongside final approval for a blood pressure treatment drug. The company also entered into a licensing and commercialisation pact with RK Pharma for a supportive oncology product in the US. Shares ended marginally lower on Thursday as investors assessed the latest regulatory developments.",
            "pubDate": "2025-11-28T03:58:02.615198"
        },
        {
            "title": "GMDC among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-among-4-stocks-showing-bullish-rsi-upswing/slideshow/125628462.cms",
            "description": "On November 27, four stocks in the Nifty500 that gained over 3% appeared in the RSI Trending Up scan, according to data from StockEdge. An uptrend signal is generated when the RSI moves above 50 from below, indicating strengthening momentum. Rising RSI values suggest building bullishness in price action and may help traders identify potential buying opportunities.",
            "pubDate": "2025-11-28T03:58:02.615304"
        },
        {
            "title": "Kaynes Technology among 5 F&O stocks with a sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125628425.cms",
            "description": "There was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade, as of November 27. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-11-28T03:58:02.615405"
        },
        {
            "title": "Negative Breakout: These 10 stocks closed below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-close-below-their-200-dmas/slideshow/125628375.cms",
            "description": "In the Nifty500 pack, 10 stocks saw their closing prices fall below their 200-day moving average (200 DMA) on November 27, according to technical scan data from StockEdge. Trading below the 200 DMA is typically viewed as a bearish signal, as it indicates the stock has slipped under its long-term trend line, a key indicator used by traders to gauge overall momentum. Here are the details:",
            "pubDate": "2025-11-28T03:58:02.615513"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Tata Motors PV among 4 stocks that could give 10-28% returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-tata-motors-pv-among-4-stocks-that-could-give-10-28-returns/slideshow/125628182.cms",
            "description": "Brokerages remain selectively optimistic across sectors, with fresh target revisions signaling room for upside in several stocks.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-28T03:58:02.615614"
        },
        {
            "title": "Lenskart shares in focus as Jefferies initiates coverage with Buy rating. Check target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-in-focus-as-jefferies-initiates-coverage-with-buy-check-target-price/articleshow/125628072.cms",
            "description": "Jefferies initiated coverage on Lenskart with a 'Buy' rating, setting a Rs 500 price target, suggesting a 23% upside. The brokerage highlights Lenskart's leadership in India's under-penetrated eyewear market, driven by its tech-enabled, omni-channel model and strong store economics.  Growth is expected from network expansion and international operations.",
            "pubDate": "2025-11-28T03:58:02.615709"
        },
        {
            "title": "Thyrocare Technologies in focus as shares to trade ex-bonus for 2:1 issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thyrocare-technologies-in-focus-as-shares-to-trade-ex-bonus-for-21-issue/articleshow/125627854.cms",
            "description": "Thyrocare Technologies will trade ex-bonus today for its 2:1 bonus share issue, under which investors will receive two additional shares for every one held. The record date for determining eligible shareholders is November 28.",
            "pubDate": "2025-11-28T03:58:02.615802"
        },
        {
            "title": "Paytm shares rise 3% as Goldman Sachs doubles price target, upgrades to Buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-rise-3-as-goldman-sachs-doubles-price-target-upgrades-to-buy/articleshow/125629615.cms",
            "description": "Goldman Sachs upgraded Paytm's parent company, One 97 Communications, to 'Buy' with a significantly raised price target, citing improving regulatory conditions and strong revenue growth prospects. The brokerage anticipates over 20% revenue growth and a doubling of EBITDA margins, bolstered by recent payment aggregator authorization and strategic focus areas.",
            "pubDate": "2025-11-28T05:33:27.462010"
        },
        {
            "title": "GAIL shares slump over 6% on PNGRB’s lower-than-expected transmission tariff revision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gail-share-price-slumps-over-6-on-pngrbs-lower-than-expected-transmission-tariff-revision/articleshow/125629556.cms",
            "description": "GAIL's share price dropped sharply on Friday after PNGRB announced a lower-than-expected tariff revision for its natural gas pipeline network. The regulator raised tariffs to Rs 77.98/MMBTU but deferred full cost recovery until 2028, limiting GAIL’s ability to offset rising capex and opex, raising concerns over medium-term margins and earnings visibility.",
            "pubDate": "2025-11-28T05:33:27.462133"
        },
        {
            "title": "Tata Steel among 5 buy-rated stocks backed by Motilal Oswal with upside potential of up to 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-among-5-buy-rated-stocks-backed-by-motilal-oswal-with-upside-potential-of-up-to-26/slideshow/125628941.cms",
            "description": "The Nifty 50 index climbed to a new all-time peak of 26,310.45 in Thursday’s session, backed by broad-based buying across sectors. Adding to the momentum, brokerage firms like JP Morgan are projecting a base-case target of 30,000 for the Nifty 50 by end-2026.This comes on the back of strong macro fundamentals, policy support, and domestic flows as core drivers for its bullish outlook, with a clear preference for India-focused sectors. Amid this backdrop, domestic brokerage firm Motilal Oswal has identified five stocks that offer up to 26% upside over a one-year horizon.",
            "pubDate": "2025-11-28T05:33:27.462233"
        },
        {
            "title": "Patel Engineering shares fall 5% as investors book profits after two-day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patel-engineering-shares-fall-5-as-investors-book-profits-after-two-day-rally/articleshow/125629445.cms",
            "description": "Patel Engineering shares fell nearly 5% to Rs 35.58 on Friday after a sharp two-day rally. The stock had surged nearly 20% earlier in the week following the award of coal excavation and transportation contracts worth Rs 798.19 crore for the Jhiria West OCP in Chhattisgarh by SECL, with a nine-year execution period.",
            "pubDate": "2025-11-28T05:33:27.462330"
        },
        {
            "title": "Strong Start! Sudeep Pharma shares list at 24% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sudeep-pharma-shares-list-at-24-premium-over-ipo-price-on-bse-nse/articleshow/125629090.cms",
            "description": "Sudeep Pharma debuted strongly on D-Street with nearly 24% listing gains, aligning with grey market expectations. The Rs 895-crore IPO saw robust demand, subscribing 93.71 times. Strong institutional interest, solid financials, high margins, and leadership in specialised ingredients underpin investor confidence as the stock begins trading on the secondary market.",
            "pubDate": "2025-11-28T05:33:27.462433"
        },
        {
            "title": "Why Thyrocare Technologies' shares are down 67% today, but why investors shouldn't worry?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-thyrocare-technologies-shares-are-down-67-today-but-why-investors-shouldnt-worry/articleshow/125629002.cms",
            "description": "Thyrocare Technologies’ shares slumped 66.7% to ₹492 on Friday as they began trading ex-bonus for the recently announced 2:1 bonus issue. The sharp drop is a normal adjustment due to the bonus issue and doesn’t indicate any deterioration in fundamentals.",
            "pubDate": "2025-11-28T05:33:27.462531"
        },
        {
            "title": "M&M shares rise 2% as Nomura gives thumbs up to new 7-seater launch. Check target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-shares-rise-2-as-nomura-gives-thumbs-up-to-new-7-seater-launch-check-target-price/articleshow/125628927.cms",
            "description": "Mahindra & Mahindra shares surged following Nomura's Buy rating and a Rs 4,335 price target, driven by the launch of the feature-rich XEV 9S at a disruptive price. The brokerage anticipates strong SUV growth and sees the new vehicle as a catalyst for Mahindra's electric era, with bookings opening in January 2026.",
            "pubDate": "2025-11-28T05:33:27.462651"
        },
        {
            "title": "An overlooked FII trade is exploding with Rs 43,000 crore flows. Will 2026 belong to Jio, Airtel?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/an-overlooked-fii-trade-is-exploding-with-rs-43000-crore-flows-will-2026-belong-to-jio-airtel/articleshow/125628813.cms",
            "description": "Foreign investors are heavily investing in India's telecom sector, pouring ₹43,000 crore into it. This surge is driven by expected tariff hikes, rising average revenue per user (ARPU), and the upcoming Jio IPO. Analysts are optimistic about a multi-year monetization cycle, with major brokerages upgrading their outlook and projecting strong earnings growth for companies like Airtel and Jio.",
            "pubDate": "2025-11-28T05:33:27.462746"
        },
        {
            "title": "Sensex up over 50 pts, Nifty holds above 26,200 as D-St hovers near record high levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-68-pts-nifty-holds-above-26230-as-d-st-hovers-near-record-high-levels/articleshow/125628657.cms",
            "description": "Indian stocks opened slightly higher on Friday, with both the Sensex and Nifty hovering near their all-time highs. Investors are anticipating interest-rate cuts in the U.S. and India, while also looking forward to resilient quarterly growth data driven by strong domestic demand.",
            "pubDate": "2025-11-28T05:33:27.462839"
        },
        {
            "title": "Ashok Leyland, MCX among 5 stocks witnessing 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-mcx-among-5-stocks-witnessing-5-year-swing-high-breakouts/slideshow/125628753.cms",
            "description": "In the Nifty500 pack, five stocks hit a 5-year swing high at the close on November 27, indicating bullish momentum in these counters, according to technical scan data from StockEdge.A 5-year swing high marks the highest price a stock has reached in the past five years and often acts as a significant resistance level. While touching this level can signal strengthening bullish sentiment, it is not the same as a 5-year breakout, which occurs only when the stock decisively surpasses that long-held resistance.",
            "pubDate": "2025-11-28T05:33:27.462933"
        },
        {
            "title": "Japan's Nikkei adds to weekly gain with eyes on central bank meetings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-adds-to-weekly-gain-with-eyes-on-central-bank-meetings/articleshow/125632268.cms",
            "description": "Japan's Nikkei 225 closed up 0.2% on Friday, extending its weekly gain despite a challenging November. Investor focus is shifting to upcoming central bank decisions, with Tokyo's core inflation hinting at a potential Bank of Japan rate hike. U.S. tech stocks' performance hinges on the Federal Reserve's December interest rate outlook.",
            "pubDate": "2025-11-28T07:52:36.015159"
        },
        {
            "title": "Reliance Industries shares jump to fresh 52-week high as Jefferies projects 14% upside on earnings momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-jump-to-fresh-52-week-high-as-jefferies-projects-14-upside-on-earnings-momentum/articleshow/125631551.cms",
            "description": "Reliance Industries hit a fresh 52-week high after Jefferies reaffirmed its ‘Buy’ rating and projected a 14% upside. The brokerage cited strong earnings momentum across retail, O2C, telecom, and FMCG, along with favourable valuations. Upcoming triggers include robust festive demand, JioMart expansion, elevated refining margins, and Jio’s expected 2026 IPO.",
            "pubDate": "2025-11-28T07:52:36.015292"
        },
        {
            "title": "Australian shares log decade's worst November as expensive banks slide",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-log-decades-worst-november-as-expensive-banks-slide/articleshow/125631478.cms",
            "description": "Australian shares experienced their worst November in over a decade, with the S&P/ASX 200 index falling 3%. Heavyweight banks declined due to lofty valuations and margin pressures, while strong inflation and employment data diminished hopes for near-term rate cuts. Resources stocks, however, continued their upward trend.",
            "pubDate": "2025-11-28T07:52:36.015497"
        },
        {
            "title": "Sudeep Pharma shares rally 8% after solid listing pop. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sudeep-pharma-shares-rally-8-after-solid-listing-pop-should-you-buy-sell-or-hold/articleshow/125630622.cms",
            "description": "Sudeep Pharma’s strong stock market debut turned into an early rally, with shares gaining up to 8% after listing at a nearly 24% premium to the IPO price. The Rs 895 crore issue drew heavy demand across all investor categories, reflecting confidence in the company’s position in speciality pharma ingredients. While analysts see long-term potential backed by high margins and strong export presence, they advise caution on near-term risks such as margin pressure and raw material volatility, suggesting partial profit booking with a disciplined stop-loss.",
            "pubDate": "2025-11-28T07:52:36.015617"
        },
        {
            "title": "GMDC shares snap 3-day rally, fall 2% as traders opt to book profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-shares-snap-3-day-rally-fall-2-as-traders-opt-to-book-profits/articleshow/125630656.cms",
            "description": "GMDC shares fell after a three-day surge as traders booked profits, following strong gains driven by a government incentive to boost rare earth magnet production. The stock faced short-term technical resistance, though long-term trends remain positive. Profit taking set in after optimism around GMDC’s role in India’s strategic minerals push.",
            "pubDate": "2025-11-28T07:52:36.015717"
        },
        {
            "title": "The missing pillar of Atmanirbhar Bharat: Financial services",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-missing-pillar-of-atmanirbhar-bharat-financial-services/articleshow/125630600.cms",
            "description": "India’s Atmanirbhar Bharat vision needs a sixth pillar—financial self-reliance. As domestic savings, market participation, and long-term capital grow, India can increasingly fund its own development. Strengthening local market intermediaries, payment systems, and asset managers is essential to reduce external dependence and build a resilient, sovereign financial ecosystem.",
            "pubDate": "2025-11-28T07:52:36.015811"
        },
        {
            "title": "Nifty’s December hit rate is 60% over 10 years on strong FII/DII trends. What’s in store for 2025?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niftys-december-hit-rate-is-60-over-10-years-on-strong-fii/dii-trends-whats-in-store-for-2025/articleshow/125630327.cms",
            "description": "Nifty hit a fresh lifetime high in December, buoyed by favorable seasonality and positive FII/DII trends. Historically, December offers an average 1.6% return, with Nifty closing higher 60% of the time over the past decade. FIIs and DIIs have shown a generally positive flow, influencing market performance.",
            "pubDate": "2025-11-28T07:52:36.015904"
        },
        {
            "title": "4 years of fraud: How a Mumbai-based elderly couple allegedly lost Rs 35 crore in trading scam without knowing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/4-years-of-fraud-how-a-mumbai-based-elderly-couple-allegedly-lost-rs-35-crore-in-trading-scam-without-knowing/articleshow/125633448.cms",
            "description": "A 72-year-old Mumbai resident, Bharat Harakchand Shah, has filed a police complaint after discovering that his inherited equity portfolio—long believed to be growing—had allegedly been mismanaged, leading to a sudden demand for ₹35 crore. The case is now under investigation by Mumbai Police’s Economic Offences Wing, with an FIR filed against Globe Capital.",
            "pubDate": "2025-11-28T08:53:37.437311"
        },
        {
            "title": "As another clean-up phase gets over, time to look at a select few? 5 construction-related stocks with upside potential of up to 33%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-another-clean-up-phase-gets-over-time-to-look-at-a-select-few-5-construction-related-stocks-with-upside-potential-of-up-to-33/articleshow/125633194.cms",
            "description": "After a strong, four-year bull run followed by a year of correction, the market is now at a point where no sector or segment can be called cheap or even reasonably priced. Does it mean you should not buy anything? The answer is no. The sensible thing to do is to look at sectors where the growth is likely to remain at a certain level. Given that infrastructure remains a focus area, the contracting and construction sector, which has historically seen many ups and downs, may be worth looking at again. The market may still be wary of them, but with government spending likely to increase, it may be a good idea to have them on your watchlist.",
            "pubDate": "2025-11-28T08:53:37.437433"
        },
        {
            "title": "Reliance Infra shares soar 17% in 3 sessions. What's behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infra-shares-soar-17-in-3-sessions-whats-behind-the-surge/articleshow/125635613.cms",
            "description": "Reliance Infrastructure shares jumped 17% in three sessions, reversing last week’s steep fall. The stock remains far below its 52-week high, but bargain buying, stabilising quarterly numbers, and returning domestic institutional interest have revived sentiment. Traders say technical support and value buying are driving the sharp rebound in the Anil Ambani–group stock",
            "pubDate": "2025-11-28T10:59:19.323362"
        },
        {
            "title": "Market Wrap: Sensex and Nifty end flat as profit-taking caps D-St rally near record highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-and-nifty-end-flat-as-profit-taking-caps-d-st-rally-near-record-highs/articleshow/125635339.cms",
            "description": "Indian stock markets closed with a slight dip on Friday. The Sensex and Nifty saw minor fluctuations throughout the day. Investors took profits near record highs. They considered potential interest rate cuts in the US and India. Domestic growth figures also influenced trading. Both major indices ended marginally lower after reaching new peaks previously.",
            "pubDate": "2025-11-28T10:59:19.323527"
        },
        {
            "title": "Turnaround Story: 8 stocks turn profitable after two quarters of losses; soar up to 75% in FY26 so far",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/turnaround-story-8-stocks-turn-profitable-after-two-quarters-of-losses-soar-up-to-75-in-fy26-so-far/slideshow/125634137.cms",
            "description": "After two straight loss-making quarters, 13 companies turned profitable in Q2FY26, hinting at a potential market turnaround. We filtered the list to firms with a market cap above Rs 1,000 crore and quarterly sales over Rs 100 crore, ensuring only fundamentally strong players made the cut. Notably, 8 of these stocks have delivered double-digit gains in FY26, rallying an average 75% in the first eight months—reflecting renewed investor confidence amid market volatility. (Data Source: ACE Equity)",
            "pubDate": "2025-11-28T10:59:19.323642"
        },
        {
            "title": "Nifty at record highs, but portfolios still bleed. SAMCO Securities lists 4 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-at-record-highs-but-portfolios-still-bleed-samco-securities-lists-4-reasons-why/articleshow/125635174.cms",
            "description": "Despite Nifty hitting a fresh all-time high, most retail portfolios remain in the red as gains are concentrated in a few heavyweight stocks. Broader market weakness, poor small- and mid-cap performance, and narrow participation continue to drag investors down",
            "pubDate": "2025-11-28T10:59:19.323746"
        },
        {
            "title": "Rs 7,000 crore boom! Groww, Lenskart among 7 newly-listed firms to see shareholder lock-in end in December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-7000-crore-boom-groww-lenskart-among-7-newly-listed-firms-to-see-shareholder-lock-in-end-in-december/articleshow/125635072.cms",
            "description": "Several newly listed companies may witness increased December trading activity as shareholder lock-in expiries free up nearly Rs 7,000 crore worth of equity. While this does not guarantee immediate selling, key names such as Groww, Lenskart, Urban Company, Pine Labs and Orkla India could see heightened investor attention as fresh supply enters the market.Several newly listed companies may witness increased December trading activity as shareholder lock-in expiries free up nearly Rs 7,000 crore worth of equity. While this does not guarantee immediate selling, key names such as Groww, Lenskart, Urban Company, Pine Labs and Orkla India could see heightened investor attention as fresh supply enters the market",
            "pubDate": "2025-11-28T10:59:19.323851"
        },
        {
            "title": "Nomura initiates coverage on this recently-listed CRDMO stock, sees 18% upside despite 22% correction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-initiates-coverage-on-this-recently-listed-crdmo-stock-sees-18-upside-despite-22-correction/articleshow/125634395.cms",
            "description": "Nomura has initiated coverage on Anthem Biosciences with a Buy rating and a ₹740 target, citing attractive valuations, strong CRDMO positioning, diversified capabilities, and robust revenue and earnings growth projections despite recent stock correction.",
            "pubDate": "2025-11-28T10:59:19.323951"
        },
        {
            "title": "'Phenomenally Stupid': Zerodha's Nithin Kamath warns against blind pre-IPO frenzy as unlisted market booms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/phenomenally-stupid-zerodhas-nithin-kamath-warns-against-blind-pre-ipo-frenzy-as-unlisted-market-booms/articleshow/125636637.cms",
            "description": "Nithin Kamath cautions retail investors against blindly chasing pre-IPO shares amid extreme valuations and hype. He flags 100–500% markups, poor pricing, misleading promotions, regulatory gaps, and the rising risks in unlisted shares and crypto derivatives despite booming IPO sentiment",
            "pubDate": "2025-11-28T11:31:01.306263"
        },
        {
            "title": "Stock Radar: Max Healthcare stock showing signs of bottoming out; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-max-healthcare-stock-showing-signs-of-bottoming-out-check-target-stop-loss/articleshow/125611967.cms",
            "description": "Max Healthcare stock is showing signs of recovery after forming a double bottom pattern. Experts suggest short-term traders can consider buying the stock. A potential technical bounce back towards 1350 levels is anticipated in the coming months. The stock has found support in the 1050-1070 zone, indicating a possible upward trend.",
            "pubDate": "2025-11-28T12:32:54.401095"
        },
        {
            "title": "Cement outlook muted, but BNP Paribas still bullish on Ambuja and 2 other stocks; sees up to 29% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cement-outlook-muted-but-bnp-paribas-still-bullish-on-ambuja-and-2-other-stocks-sees-up-to-29-upside/slideshow/125637384.cms",
            "description": "The cement sector is on a rough ride, and brokerage firm BNP Paribas sees a weak outlook with consolidation likely to continue. Notwithstanding the ongoing headwinds, it finds an investment case for three stocks, pegging an upside of up to 29%. The stocks to buy are Adani Group-owned Ambuja Cements, JK Cement and UltraTech Cement. Here's why:",
            "pubDate": "2025-11-28T12:32:54.401222"
        },
        {
            "title": "Reliance Industries, Samvardhana Motherson and 4 other large-cap stocks hit 52-week highs & gained up to 18% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-samvardhana-motherson-and-4-other-large-cap-stocks-hit-52-week-highs-amp-gained-up-to-18-in-a-month/slideshow/125639179.cms",
            "description": "On Friday, the benchmark Sensex ended nearly flat, slipping 14 points to close at 85,707. Despite the lacklustre market sentiment, six BSE large-cap stocks climbed to their 52-week highs, marking their strongest levels in a year. Such breakouts are typically viewed as bullish signals by traders and investors, suggesting strong momentum and the potential for further short-term gains",
            "pubDate": "2025-11-28T13:50:04.895610"
        },
        {
            "title": "50-year-old’s Rs 80 lakh retirement dilemma: FDs won’t beat inflation and aren’t tax-efficient. What’s the smarter route?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/50-year-olds-rs-80-lakh-retirement-dilemma-fds-wont-beat-inflation-and-arent-tax-efficient-whats-the-smarter-route/slideshow/125638749.cms",
            "description": "Are you 50 years old and planning to retire early with Rs 80 lakh in fixed deposits and monthly expenses of around Rs 60,000. An expert offers help on how much one needs to save to retire in the next five years, as reported by ETWealth",
            "pubDate": "2025-11-28T13:50:04.895734"
        },
        {
            "title": "Sebi wants regulated entities, agents to display name, registration number on social media",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-wants-regulated-entities-agents-to-display-name-registration-number-on-social-media/articleshow/125640720.cms",
            "description": "This proposal comes after the regulator observed the growing need to clearly distinguish content uploaded by Sebi-regulated persons from material posted by unregistered individuals on social media",
            "pubDate": "2025-11-28T15:51:34.007262"
        },
        {
            "title": "US stocks trade higher on last trading day of November, futures resume trade after outage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-futures-resume-trade-after-outage/articleshow/125640533.cms",
            "description": "Wall Street indexes climbed Friday after a CME Group outage, which had temporarily frozen global trading, was resolved. Major indexes saw gains as markets reopened. Retailers were in focus with the holiday shopping season kicking off, while bets on a December Fed rate cut increased amid mixed economic signals.",
            "pubDate": "2025-11-28T15:51:34.007415"
        },
        {
            "title": "Authum Investment's board approves 4:1 bonus issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/authum-investments-board-approves-41-bonus-issue/articleshow/125640372.cms",
            "description": "Authum Investment & Infrastructure approved a 4:1 bonus share issue, subject to approvals, while increasing authorised capital to ₹128 crore. The NBFC, which operates investment and credit businesses, reported softer Q2 earnings but strong one-year stock returns despite market volatility",
            "pubDate": "2025-11-28T15:51:34.007625"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 33% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-33-in-1-year/articleshow/125643673.cms",
            "description": "There are market phases when it is important to de-link what is happening to the Nifty and the stocks in your portfolio. Reason: Given their composition, the Nifty and Sensex can be impacted by events in one or two sectors. This time, it is banking stocks and the market’s old bellwether, Reliance Industries, that have taken the Nifty to a new high. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-11-28T19:57:03.581471"
        }
    ]
}