{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-10T01:05:36.121958",
    "items": [
        {
            "title": "Sebi gets power to directly remove false stock content",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-gets-power-to-directly-remove-false-stock-content/articleshow/125880023.cms",
            "description": "The Securities & Exchange Board of India (Sebi) has been empowered by the government to order social media platforms to remove unlawful stock-related content. This directive, issued by the finance ministry, aims to combat misleading information spread by financial influencers and other entities. The move addresses the growing concern over content scrutiny as millions invest in the stock market.",
            "pubDate": "2025-12-10T01:05:27.069603"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125873836.cms",
            "description": "Indian stock markets experienced a sharp downturn on Tuesday. The Nifty index fell by 120 points, reflecting ongoing market volatility. Foreign portfolio investors were net sellers, while domestic institutional investors bought shares. The Indian Rupee strengthened against the US dollar. Analysts suggest the market trend may remain weak in the short term.",
            "pubDate": "2025-12-10T01:05:27.069733"
        },
        {
            "title": "Stocks in news: IndiGo, JSW Energy, Nalco, Swiggy, Kaynes Tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indigo-jsw-energy-nalco-swiggy-kaynes-tech/articleshow/125873695.cms",
            "description": "Markets closed with a nearly 0.5% cut on weekly expiry day amidst mixed cues, with the benchmark index showing pressure while broader markets, especially mid- and small-caps, experienced significant erosion. Analysts suggest Nifty faces crucial support near 25,800, with a breakdown potentially leading to 25,650, while 26,000–26,200 acts as a hurdle.",
            "pubDate": "2025-12-10T01:05:27.069847"
        },
        {
            "title": "Amit Rathi offloads Anand Rathi Wealth shares worth Rs 560 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amit-rathi-offloads-anand-rathi-wealth-shares-worth-rs-560-cr/articleshow/125879949.cms",
            "description": "Amit Rathi divested shares of Anand Rathi Wealth valued at Rs 560 crore through a bulk deal on NSE. He sold 20 lakh shares at Rs 2,800.03 each, reducing his stake by 2.4%. The company's shares saw a marginal increase of 0.6% on Tuesday.",
            "pubDate": "2025-12-10T01:05:27.069946"
        },
        {
            "title": "Energy, telecom continue to draw foreign flows in Nov",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/energy-telecom-continue-to-draw-foreign-flows-in-nov/articleshow/125879911.cms",
            "description": "Foreign investors injected significant capital into India's energy and telecom sectors in the latter half of November, continuing a trend from earlier in the month and October. While telecom saw substantial inflows, the oil and gas sector also attracted considerable investment. Conversely, FMCG and automobile sectors experienced outflows as investors booked profits and re-evaluated high valuations.",
            "pubDate": "2025-12-10T01:05:27.070045"
        },
        {
            "title": "ARCs seek pass-through for alternative investment funds' security receipts income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/arcs-seek-pass-through-for-alternative-investment-funds-security-receipts-income/articleshow/125879974.cms",
            "description": "Asset reconstruction companies (ARCs) are on the frontlines, lobbying for a pass-through tax designation for alternative investment funds (AIFs) that invest in security receipts (SRs). They believe the current tax bracket of 42.74% is stifling potential investors, proposing instead that SR income be taxed directly in the hands of the end investors.",
            "pubDate": "2025-12-10T01:05:27.070268"
        },
        {
            "title": "RBI wants groups to untie their NBFC knots",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-wants-groups-to-untie-their-nbfc-knots/articleshow/125879964.cms",
            "description": "The Reserve Bank of India is urging large business groups to consolidate their non-banking finance and investment companies. This move aims to simplify structures for better risk assessment and regulatory oversight. Groups with multiple NBFCs, especially those with overlapping businesses, are being advised to merge entities.",
            "pubDate": "2025-12-10T01:05:27.070361"
        },
        {
            "title": "RBI governor Sanjay Malhotra urges banks to use tech and trim costs in easing cycle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-governor-sanjay-malhotra-urges-banks-to-use-tech-and-trim-costs-in-easing-cycle/articleshow/125879885.cms",
            "description": "RBI Governor Sanjay Malhotra met bank chief executives, emphasizing that rate cuts and technology adoption should lower costs and boost efficiency for sustainable growth and financial inclusion. He also urged banks to enhance digital fraud safeguards and improve customer service by reducing grievances and strengthening internal systems.",
            "pubDate": "2025-12-10T01:05:27.070455"
        },
        {
            "title": "BlackRock unit to invest Rs 3000 crore in Grasim Arm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-renewables-secures-up-to-3000-crore-investment-from-global-infrastructure-partners/articleshow/125879987.cms",
            "description": "Aditya Birla Renewables Limited (ABREN) secured up to ₹3,000 crore from Global Infrastructure Partners (GIP), now part of BlackRock. This significant investment values ABREN at approximately ₹14,600 crore and will fuel its expansion to over 10 GW of renewable energy capacity across India.",
            "pubDate": "2025-12-10T01:05:27.070734"
        },
        {
            "title": "Finance Ministry increases foreign investment limit in AU Small Finance Bank to 74%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/finance-ministry-increases-foreign-investment-limit-in-au-small-finance-bank-to-74/articleshow/125880032.cms",
            "description": "The Finance Ministry has raised the foreign investment cap in AU Small Finance Bank to 74% from 49%, requiring prior approval for FDI. This move aims to provide ample room for foreign investment through permissible channels. Foreign portfolio investors held 34.5% of the bank's shares as of September 30.",
            "pubDate": "2025-12-10T01:05:27.070830"
        }
    ]
}