{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-29T15:45:48.135801",
    "items": [
        {
            "title": "eClerx Services rallies 4% after Q3 profit surge; bonus issue nod",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eclerx-services-rallies-4-after-q3-profit-surge-bonus-issue-nod/articleshow/127756597.cms",
            "description": "eClerx shares surged following a robust quarterly performance. The company's board approved a 1:1 bonus share issue. Net profit rose 40% year-on-year to Rs 192 crore for the December quarter. Revenue from operations also saw a significant increase. The bonus shares will be issued from retained earnings. The company expects to credit bonus shares by March 2026.",
            "pubDate": "2026-01-29T05:13:40.370877"
        },
        {
            "title": "Hindustan Copper shares soar to record high, surge 40% in 4 days. What's behind the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-soar-to-record-high-surge-40-in-4-days-whats-behind-the-rally/articleshow/127756140.cms",
            "description": "Hindustan Copper shares surged 40% in four sessions to a 52-week high as record global copper prices and the company’s emergence as the preferred bidder for a new mining block in Madhya Pradesh fueled a fresh wave of buying in the state-owned miner.",
            "pubDate": "2026-01-29T05:13:40.370990"
        },
        {
            "title": "Smallcap bloodbath: 10 stocks tumble up to 40% in first month of 2026. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-bloodbath-10-stocks-tumble-up-to-40-in-first-month-of-2026-do-you-own-any/slideshow/127753877.cms",
            "description": "The pain in India’s smallcap space is no longer limited to a handful of overheated names. Just weeks into 2026, more than 600 smallcap stocks have already slipped into double-digit negative territory. What makes this phase particularly unsettling is that it has not been sudden. The correction has been building for nearly a year. After a powerful run fuelled by abundant liquidity, aggressive retail participation and optimism around India’s long-term growth story, the market began to fracture in 2024. Here are 10 stocks that have borne the brunt of this downturn in 2026.",
            "pubDate": "2026-01-29T05:13:40.371086"
        },
        {
            "title": "Hindustan Zinc OFS opens: How can retail investors participate?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-ofs-opens-how-can-retail-investors-participate/articleshow/127755722.cms",
            "description": "Hindustan Zinc’s Offer For Sale (OFS) opens for retail investors on Thursday, January 29, after strong demand from non-retail participants. Vedanta, the promoter, aims to raise up to Rs 4,500 crore through the sale of 0.79% of the company’s equity, with a green shoe option of 0.59% additional stake if demand remains robust. The indicative price is Rs 691.15.",
            "pubDate": "2026-01-29T05:13:40.371184"
        },
        {
            "title": "GRSE shares soar 5%, up 18% in two sessions. What’s triggering the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grse-shares-soar-5-up-18-in-two-sessions-whats-triggering-the-surge/articleshow/127755633.cms",
            "description": "GRSE shares rallied sharply after the defence shipbuilder posted strong year-on-year growth in profit and revenue for the December 2025 quarter. Higher operational scale, steady margins and a second interim dividend announcement boosted investor sentiment.",
            "pubDate": "2026-01-29T05:13:40.371283"
        },
        {
            "title": "Silver up 50% this month. Is it now time for gold to outpace its poor cousin?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-up-50-this-month-is-it-now-time-for-gold-to-outpace-its-poor-cousin/articleshow/127754335.cms",
            "description": "Silver has surged nearly 50% this month, dramatically outshining gold. Investors are now questioning if gold will catch up. Both metals have seen significant gains, driven by geopolitical uncertainty and expectations of interest rate cuts. Experts suggest gold offers stability, while silver's sharp rise comes with higher volatility.",
            "pubDate": "2026-01-29T05:13:40.371379"
        },
        {
            "title": "Sensex sinks over 600 pts, Nifty below 25,200 as Union Budget focus takes hold",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-400-pts-nifty-below-25300-as-union-budget-focus-takes-hold/articleshow/127753822.cms",
            "description": "Indian stock markets opened lower today. The Sensex and Nifty saw a slight dip. Investors are now focusing on the upcoming federal budget. This comes after a recent rally driven by trade agreement optimism. Market participants are shifting their attention to domestic policy announcements expected this weekend.",
            "pubDate": "2026-01-29T05:13:40.371474"
        },
        {
            "title": "Buy, Sell or Hold? Goldman Sachs reiterates Buy on L&T; Morgan Stanley stays Overweight on TVS Motor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-reiterates-buy-on-lt-morgan-stanley-stays-overweight-on-tvs-motor/articleshow/127754027.cms",
            "description": "Brokerages are positive on L&T, TVS Motor, and Maruti Suzuki. L&T shows strong order inflows and profitability. TVS Motor benefits from margin expansion and industry tailwinds. Maruti Suzuki expects new products and export growth to boost earnings. These companies are poised for growth driven by various factors.",
            "pubDate": "2026-01-29T05:13:40.371568"
        },
        {
            "title": "FIIs dump 2 stocks for every one bought, smallcaps worst hit. What it means for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-dump-2-stocks-for-every-one-bought-smallcaps-worst-hit-what-it-means-for-investors/articleshow/127752838.cms",
            "description": "Foreign institutional investors (FIIs) significantly reduced their holdings in Indian equities during the December quarter, selling nearly two stocks for every one purchased, with smallcaps bearing the brunt. This exodus, driven by high valuations and modest earnings growth, saw FIIs divest from 814 stocks while acquiring only 478 across various market segments.",
            "pubDate": "2026-01-29T05:13:40.371682"
        },
        {
            "title": "Maruti Suzuki shares decline over 3% after Q3 results; Should buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-in-focus-after-q3-results-should-buy-sell-or-hold/articleshow/127752710.cms",
            "description": "Maruti Suzuki's shares fell after reporting a modest 4% profit rise in Q3 FY26, missing street expectations. Despite strong revenue growth driven by domestic demand, margins were hit by lower export realisations and one-time costs. The company achieved record domestic and total sales, with the small car segment showing a strong recovery.",
            "pubDate": "2026-01-29T05:13:40.371778"
        },
        {
            "title": "L&T shares rise 4% as order inflows hit record high in Q3; what's next",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-shares-in-focus-after-q3-profit-dips-4-yoy-order-inflows-hit-record-high/articleshow/127752289.cms",
            "description": "Larsen & Toubro shares climbed 4% to Rs 3,935 on Thursday. The company reported a 4.3% drop in net profit for the December quarter. This was due to a one-time provision for employee benefits. Excluding this, profit grew 31%. Revenue increased 10% year-on-year. Order inflows reached an all-time high of Rs 1.36 lakh crore.",
            "pubDate": "2026-01-29T05:13:40.371874"
        },
        {
            "title": "TVS Motor Company shares in focus after Q3. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-company-shares-in-focus-after-q3-should-you-buy-sell-or-hold/articleshow/127752020.cms",
            "description": "TVS Motor Company reported a robust 49% year-on-year jump in consolidated net profit to Rs 841 crore for the December quarter, driven by record sales and revenue. The two-wheeler major's overall sales grew 27% YoY to 15.44 lakh units, with strong performance across motorcycles, scooters, and international markets.",
            "pubDate": "2026-01-29T05:13:40.371968"
        },
        {
            "title": "Cochin Shipyard among 8 Nifty200 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cochin-shipyard-among-8-nifty200-stocks-showing-bullish-rsi-upswing/slideshow/127751629.cms",
            "description": "On January 28, eight stocks from the Nifty200 universe that gained over 5% were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2026-01-29T05:13:40.372062"
        },
        {
            "title": "KRM Ayurveda shares list at 28% premium over IPO price on NSE SME platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/krm-ayurveda-shares-to-list-today-gmp-indicates-healthy-premium-on-debut/articleshow/127750035.cms",
            "description": "KRM Ayurveda debuted on Dalal Street with a strong 27.5% listing premium, opening at Rs 172.1 against its IPO price of Rs 135. The Rs 77 crore issue saw overwhelming demand, subscribed over 74 times across investor categories. This robust response signals investor confidence in the Ayurvedic healthcare provider's expansion plans.",
            "pubDate": "2026-01-29T05:13:40.372154"
        },
        {
            "title": "Positive Breakout: These 12 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-12-stocks-cross-above-their-200-dmas/slideshow/127749474.cms",
            "description": "As of January 28, 2026, 22 stocks in the Nifty 500 segment closed above their 200-day moving average (DMA). Of these, we have highlighted the top 12 that posted gains of more than 3%, based on StockEdge’s technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2026-01-29T05:13:40.372248"
        },
        {
            "title": "GIFT Nifty down 65 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127747874.cms",
            "description": "Indian stock markets closed higher on Wednesday. Positive global sentiment and optimism surrounding the India-EU Free Trade Agreement fueled the gains. Analysts anticipate this upward trend to continue. Upcoming budget expectations and ongoing Q3 earnings season are also contributing factors. Global markets showed mixed movements. Foreign investors were net buyers.",
            "pubDate": "2026-01-29T05:13:40.372337"
        },
        {
            "title": "If wealth creation is the goal, how does the Indian Budget balance market-friendly policies with revenue pressures?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/if-wealth-creation-is-the-goal-how-does-the-indian-budget-balance-market-friendly-policies-with-revenue-pressures/articleshow/127759767.cms",
            "description": "Investors are looking for a Budget that encourages growth without weakening fiscal stability. A focus on productive capex, selective incentives and realistic revenue planning usually enhances confidence. The interplay between market-friendly policy choices and fiscal pressures will shape the overall response.",
            "pubDate": "2026-01-29T06:52:34.079087"
        },
        {
            "title": "MCX shares soar nearly 20% in 3 sessions! What’s behind the sharp surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-soar-nearly-20-in-3-sessions-whats-behind-the-sharp-surge/articleshow/127759326.cms",
            "description": "Multi Commodity Exchange of India shares surged on Thursday. The company reported a significant 151% year-on-year jump in net profit for the quarter ended December 31, 2026. This bullishness was further fueled by rising gold and silver prices. Higher trading volumes directly boosted MCX revenues and operational performance. The exchange also saw substantial growth in trading activity across segments.",
            "pubDate": "2026-01-29T06:52:34.079215"
        },
        {
            "title": "Bharat Electronics shares slip 3% as Nomura retains ‘Neutral’ rating, citing rich valuations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-electronics-shares-slip-3-as-nomura-retains-neutral-rating-citing-rich-valuations/articleshow/127759174.cms",
            "description": "The company’s order backlog stood at Rs 730.2 billion as of December 2025, up 3% year-on-year. The company said that this implies an order inflow of Rs 56.8 billion during 3QFY26, which was broadly in line with estimates.",
            "pubDate": "2026-01-29T06:52:34.079427"
        },
        {
            "title": "Rs 3 lakh crore wiped out! Sensex slumps over 600 points, Nifty below 25,200. What spooked the market today?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-today-rs-3-lakh-crore-wiped-out-sensex-slumps-over-600-points-nifty-below-25200-what-spooked-the-market-today/articleshow/127757964.cms",
            "description": "Indian equities experienced a sharp decline on Thursday, erasing recent gains as caution set in ahead of the Union Budget. Investors locked in profits and pivoted from global trade optimism to domestic policy risks, leading to a broad-based selloff. Market strategists suggest the recent rally was tactical, with foreign institutional investors maintaining a 'sell India' strategy.",
            "pubDate": "2026-01-29T06:52:34.079527"
        },
        {
            "title": "Capex vs refinancing: What Budget 2026 must do to revive private investment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capex-vs-refinancing-what-budget-2026-must-do-to-revive-private-investment/articleshow/127757308.cms",
            "description": "The Union Budget FY27 pivots to a debt-anchoring framework, aiming for fiscal consolidation amidst slowing domestic consumption.  With fading tax buoyancy, the government will increasingly rely on non-tax revenues and expenditure compression.  Capex is normalizing, with a shift towards off-budget spending and state-led initiatives.",
            "pubDate": "2026-01-29T06:52:34.079626"
        },
        {
            "title": "Explained: Why Hindustan Zinc shares are down 2% despite silver prices soaring to Rs 4 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-hindustan-zinc-shares-are-down-2-despite-silver-prices-soaring-to-rs-4-lakh/articleshow/127756661.cms",
            "description": "Hindustan Zinc shares have fallen about 2% over the last two sessions despite silver prices hitting a record Rs 4 lakh, reflecting a disconnect between the commodity rally and the stock. The decline is not due to fundamentals but is driven by short-term supply pressure from promoter Vedanta’s ongoing OFS, which has added fresh shares to the market through a base sale and a greenshoe option.",
            "pubDate": "2026-01-29T06:52:34.079724"
        },
        {
            "title": "Indonesia financial regulator says it will impose 15% stock free float requirement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indonesia-financial-regulator-says-it-will-impose-15-stock-free-float-requirement/articleshow/127762617.cms",
            "description": "Indonesia's financial watchdog is boosting the free float requirement for listed companies to 15% to address MSCI's transparency concerns, which triggered significant market sell-offs. The Financial Services Authority is also enhancing supervision timeliness and effectiveness. Authorities view MSCI's feedback positively and are awaiting a response to proposed solutions, aiming for resolution by March.",
            "pubDate": "2026-01-29T07:31:05.513239"
        },
        {
            "title": "Realty stocks tumble up to 28% in January ahead of Budget’ 26; can sops lift the laggards?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/realty-stocks-tumble-up-to-28-in-january-ahead-of-budget-26-can-sops-lift-the-laggards/articleshow/127762416.cms",
            "description": "Within these five years, January 2025 marked the sector’s steepest decline, as the Nifty Realty index plunged 12.45%. Other years were also weak, with declines of 4.69% in 2023, 0.81% in 2022, and 2.61% in 2021. The lone outlier was 2024, when the index posted gains of over 9%.",
            "pubDate": "2026-01-29T07:31:05.513367"
        },
        {
            "title": "Balu Forge Industries shares hit 10% upper circuit. Here’s what’s behind the surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balu-forge-industries-shares-hit-10-upper-circuit-heres-whats-behind-the-surge/articleshow/127761338.cms",
            "description": "Balu Forge Industries shares surged significantly after its formal induction into the NATO supply chain. The company will now manufacture and supply critical defence components, including artillery shell bodies, to NATO member states. This strategic milestone positions Balu Forge at the forefront of the alliance's industrial efforts.",
            "pubDate": "2026-01-29T07:31:05.513474"
        },
        {
            "title": "ABB gives confident outlook for 2026, launches $2 billion buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/abb-gives-confident-outlook-for-2026-launches-2-billion-buyback/articleshow/127763303.cms",
            "description": "Swiss engineering group ABB reported fourth-quarter earnings exceeding forecasts and announced a new $2 billion share buyback, expressing confidence for 2026. The company is benefiting from the AI boom, strong demand in rail and marine sectors, and achieved record full-year orders and revenue. ABB aims for further growth and margin improvement by 2026.",
            "pubDate": "2026-01-29T08:02:18.070467"
        },
        {
            "title": "From multibaggers to laggards: 12 FY25 stars plunge up to 55% in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-multibaggers-to-laggards-12-fy25-stars-plunge-up-to-55-in-fy26/slideshow/127767012.cms",
            "description": "Markets have quietly flipped the script over the last two fiscal years. In FY26 so far, the benchmark Sensex and broader indices are up nearly 6%, while the smallcap index has barely moved—stuck in neutral. Roll the clock back to FY25, and the picture looks very different: smallcaps stole the spotlight with an 8% rise, comfortably outpacing the Sensex and midcaps, which managed gains of around 5%. On the surface, headline indices across both years show only single-digit moves. But beneath that calm exterior, the broader market has seen dramatic churn. Stocks that were darlings just a year ago have faced sharp reversals.Here are the stocks that standout as multibaggers in FY25—rallying more than 100%—but have since slipped into the laggards’ camp in FY26. The findings are striking: around 12 such stocks that once created outsized wealth have corrected sharply, falling 30–55% so far this fiscal year. To ensure relevance, the study is limited to companies with a current market capitalisation above Rs 2,000 crore. Investors should note, however, that a couple of names on this list trade with relatively lower volumes. (Data Source: ACE Equity)",
            "pubDate": "2026-01-29T09:31:55.281424"
        },
        {
            "title": "FPIs flow remained volatile in FY26 on global uncertainty, capital shift towards AI-hubs: Eco Survey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-flow-remained-volatile-in-fy26-on-global-uncertainty-capital-shift-towards-ai-hubs-eco-survey/articleshow/127770211.cms",
            "description": "Foreign Portfolio Investment (FPI) flows in FY26 remained volatile, leading to a net outflow of USD 3.9 billion as of December 2025, driven by elevated uncertainty and increased capital allocation towards AI-centric markets such as the US, Taiwan, and Korea, the Economic Survey 2025-26 said on Thursday.",
            "pubDate": "2026-01-29T10:07:16.178868"
        },
        {
            "title": "European shares rise as miners, energy stocks lift sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-as-miners-energy-stocks-lift-sentiment/articleshow/127769555.cms",
            "description": "European shares rebounded on Thursday, lifted by higher prices of oil and precious metals, shaking off the gloom from weaker luxury ‌earnings the ‌day before.",
            "pubDate": "2026-01-29T10:07:16.178963"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/127769388.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2026-01-29T10:07:16.179124"
        },
        {
            "title": "Market Wrap: Sensex adds 222 points, Nifty above 25,400 as D-St recovers from early dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-adds-222-points-nifty-above-25400-as-d-st-recovers-from-early-dip/articleshow/127771084.cms",
            "description": "Indian markets reversed early losses to end higher on Thursday, with the Sensex and Nifty rebounding after a sharp morning selloff. Gains were supported by an upbeat economic survey and firm global cues, even as elevated crude, record gold prices and U.S.–Iran tensions kept investors cautious ahead of the Union Budget.",
            "pubDate": "2026-01-29T10:54:39.671901"
        },
        {
            "title": "Hindustan Zinc stock hits fresh 52-week high in January 2026; will the rally continue?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-stock-hits-fresh-52-week-high-in-january-2026-will-the-rally-continue/articleshow/127697932.cms",
            "description": "Hindustan Zinc has hit a fresh 52-week high after breaking out of a four-week consolidation. Technical indicators remain bullish, with experts suggesting buying on dips while cautioning that overbought levels could trigger short-term pullbacks.",
            "pubDate": "2026-01-29T11:49:34.202981"
        },
        {
            "title": "‘Easy money era’ after 2008 made Indian stock market very expensive: CEA Nageswaran",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/easy-money-era-after-2008-made-indian-stock-market-very-expensive-cea-nageswaran/articleshow/127774259.cms",
            "description": "India’s Chief Economic Adviser V Anantha Nageswaran on Thursday delivered a sharp warning on financial markets, saying years of ultra-loose monetary policy have resulted in stretched asset valuations, rising concentration risks, and a growing reliance on less regulated sources of capital.",
            "pubDate": "2026-01-29T11:49:34.203117"
        },
        {
            "title": "Two Trades for Today: A PSU energy major for a 6.1% gain, a mid-cap cement stock for a 3% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-psu-energy-major-for-a-6-1-gain-a-mid-cap-cement-stock-for-a-3-upmove/articleshow/127777807.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-29T13:34:57.908524"
        },
        {
            "title": "These large- and mid-cap stocks can give more than 25% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-and-mid-cap-stocks-can-give-more-than-25-return-in-1-year-according-to-analysts/articleshow/127776949.cms",
            "description": "Budget 2026 is unlikely to bring any direct relief to the market. Unless, of course, the government decides to do something dramatically positive with capital gains, which it is literally unlikely to. Why? Because this government has been quite clear on its taxation policy – and it involves a stable tax regime. But there are many things which the government could announce that may indicate how it plans to tackle the impact of geopolitics on the economy. And that will, in turn, provide a good idea on how things will pan out in the market.",
            "pubDate": "2026-01-29T13:34:57.908634"
        },
        {
            "title": "Gainers & Losers: Hindustan Copper, Vedanta among 6 stocks in focus on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-hindustan-copper-vedanta-among-6-stocks-in-focus-on-thursday/slideshow/127777131.cms",
            "description": "",
            "pubDate": "2026-01-29T13:34:57.908720"
        },
        {
            "title": "Hindustan Zinc OFS sees strong retail subscription of 2.3 times on Day 2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-ofs-sees-strong-retail-subscription-of-2-3-times-on-day-2/articleshow/127776447.cms",
            "description": "Hindustan Zinc’s OFS drew strong interest, with the retail portion subscribed 2.3 times on Day 2 as investors bid for 1.10 crore shares against 47.58 lakh on offer. This followed a robust 142% non-retail subscription on Day 1, underscoring solid demand at the Rs 685 floor price despite the stock trading higher.",
            "pubDate": "2026-01-29T13:34:57.908806"
        },
        {
            "title": "Budget & the Stock Market: Don’t confuse this number with the deficit, it is a delivery mechanism that holds a message for the markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-the-stock-market-dont-confuse-this-number-with-the-deficit-it-is-a-delivery-mechanism-that-holds-a-message-for-the-markets/articleshow/127778036.cms",
            "description": "The deficit figure for FY 2025–26 is best read not through one number, but through the full programme mix the budget documents lay out – because that mix is what determines yields, liquidity, and ultimately the valuation environment for equities.",
            "pubDate": "2026-01-29T14:22:11.977522"
        },
        {
            "title": "Market Trading Guide: Buy Oil India and ABB on Friday for up to 14% potential upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-oil-india-and-abb-on-friday-for-up-to-14-potential-upside/articleshow/127780113.cms",
            "description": "Nifty posted a third straight gain, led by financials and energy, while autos and IT capped upside. Technicals remain positive above the 50 EMA, with resistance near 25,500. Analysts recommend buying Oil India and ABB India on bullish setups.",
            "pubDate": "2026-01-29T15:45:47.597859"
        }
    ]
}