{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-30T18:27:45.072186",
    "items": [
        {
            "title": "Bank of Baroda Q3 Results: Profit rises 6% to Rs 4,837 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-baroda-q3-results-profit-rises-6-to-rs-4837-crore/articleshow/117748459.cms",
            "description": "Bank of Baroda's net profit increased by 5.6% to Rs 4,837 crore in the December quarter, driven by a slight rise in interest income and a reduction in non-performing assets. However, the Net Interest Margin declined, and the overall provisions rose during the period.",
            "pubDate": "2025-01-30T18:27:27.107412"
        },
        {
            "title": "Biocon buys back an investor stake in biologics unit, posts Rs 25 crore net profit in Q3FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/biocon-buys-back-an-investor-stake-in-biologics-unit-posts-rs-25-crore-net-profit-in-q3fy25/articleshow/117747925.cms",
            "description": "Biocon's board has approved the acquisition of 1.5% equity in Biocon Biologics for Rs 550 crore, increasing its stake to 90.2%. The deal is expected to complete by February 1, 2025. Despite a significant drop in net profit, revenue and EBITDA have grown. Increased biosimilar market share and strategic approvals are expected to drive future growth.",
            "pubDate": "2025-01-30T18:27:27.107559"
        },
        {
            "title": "PB Fintech Q3 Results: Net profit jumps 88% YoY to Rs 71.54 crore on insurance boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pb-fintech-q3-results-net-profit-jumps-88-yoy-to-rs-71-54-crore-on-insurance-boost/articleshow/117745664.cms",
            "description": "India's PB Fintech reported an 88% rise in Q3 profit to Rs 71.54 crore, driven by a 62% jump in insurance broker services. The company's revenue from operations increased by 48%, while disbursal in the online credit business declined by 20%. Total lending disbursal grew by 52%.",
            "pubDate": "2025-01-30T18:27:27.107666"
        },
        {
            "title": "Jindal Steel Q3 Results: Profit halves to Rs 951 crore on weak steel prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jindal-steel-q3-results-profit-halves-to-rs-951-crore-on-weak-steel-prices/articleshow/117744889.cms",
            "description": "Jindal Steel Q3 Results: Jindal Steel and Power’s net profit fell by 51% in the December quarter due to weak steel prices and increased imports. The company’s net debt rose, and operating profit per tonne decreased significantly. Despite this, they're progressing on expansion projects, planning substantial capital expenditure, and projecting increased production capacity in the coming years.",
            "pubDate": "2025-01-30T18:27:27.107763"
        },
        {
            "title": "Shree Cement Q3 Results: Profit plunges 69% YoY to Rs 229 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shree-cement-q3-results-profit-plunges-69-yoy-to-rs-229-crore/articleshow/117744003.cms",
            "description": "Shree Cement Q3 Results: Shree Cement's profit for the December quarter fell 69% compared to the previous year, mainly due to lower revenue and weak cement prices. The company's net revenue was down 13%, while EBITDA also decreased. Despite this, Shree Cement is optimistic about future demand and is continuing its expansion projects.",
            "pubDate": "2025-01-30T18:27:27.107866"
        },
        {
            "title": "Mastercard Q4 Results: Profit jumps on strong holiday spending",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mastercard-q4-results-profit-jumps-on-strong-holiday-spending/articleshow/117743797.cms",
            "description": "Mastercard's fourth-quarter profit rose, driven by increased consumer spending during the holiday season and a strong labor market. Gross dollar volume rose 12%, and revenue from value-added services grew 17%. Net income increased to $3.34 billion, with shares up 2% before the bell.",
            "pubDate": "2025-01-30T18:27:27.107959"
        },
        {
            "title": "Waaree Energies  Q3 Results: Cons PAT shoots up 296% YoY to Rs 493 crore, revenue jumps 117%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/waaree-energies-q3-results-cons-pat-shoots-up-296-yoy-to-rs-493-crore-revenue-jumps-117/articleshow/117740410.cms",
            "description": "Waaree Energies’ Q3FY25 revenue from operations rose 117% YoY to Rs 3,457 crore from Rs 1,596 crore. Sequentially, PAT grew 36% from Rs 362 crore in Q2FY25, while revenue declined 3.2% from Rs 3,574 crore in the July-September quarter.",
            "pubDate": "2025-01-30T18:27:27.108056"
        },
        {
            "title": "Tata Consumer Q3 Results: Profit flat at Rs 279 crore; revenues rises 17% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-q3-results-profit-flat-at-rs-279-crore-revenues-rises-17-yoy/articleshow/117739843.cms",
            "description": "Tata Consumer Q3 Results: Tata Consumer Products recorded a flattish net profit growth of Rs 279 crore in Q3 FY25, while revenue from operations increased 17% YoY to Rs 4,444 crore. The India business saw a 23% revenue growth, with strong performances in beverages and foods. International business revenue rose 8%.",
            "pubDate": "2025-01-30T18:27:27.108150"
        },
        {
            "title": "Vedanta Q3 Preview: Topline may grow by up to 14% YoY. Higher metal prices to aid EBITDA growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-q3-preview-topline-may-grow-by-up-to-14-yoy-higher-metal-prices-to-aid-ebitda-growth/articleshow/117739019.cms",
            "description": "Vedanta’s Q3FY25 YoY net profit growth is expected to be in high double digits, according to two brokerages, while one predicts a decline in the consolidated bottom line. Estimates from Kotak Institutional Equities, Nuvama Institutional Equities, and Antique Stock Broking vary, with Kotak the most bullish on revenue and PAT, while Antique holds the most conservative outlook.",
            "pubDate": "2025-01-30T18:27:27.108242"
        },
        {
            "title": "Airtel Africa Q3 net profit jumps over 11-fold YoY to $169 mn on $94-mn exceptional gain, lower finance costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/airtel-africa-q3-net-profit-jumps-over-11-fold-yoy-to-169-mn-on-94-mn-exceptional-gain-lower-finance-costs/articleshow/117738719.cms",
            "description": "Bharti Airtel’s Africa business posted an 11-fold profit surge to $169 million in Q3 FY25, aided by currency appreciation and lower finance costs. Revenue grew 2% to $1.26 billion, driven by strong customer additions. Airtel Africa announced a second $100 million share buyback.",
            "pubDate": "2025-01-30T18:27:27.108336"
        },
        {
            "title": "L&T Q3 Results: Cons PAT rises 14% YoY to Rs 3,359 crore, misses Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-q3-results-cons-pat-rises-14-yoy-to-rs-3359-crore-misses-street-estimates/articleshow/117737508.cms",
            "description": "L&T Q3 Results: The company reported consolidated revenues of Rs 64,668 crore in Q3FY25, up 17% YoY, driven by a strong order book and increased execution momentum in its Projects & Manufacturing (P&M) businesses.",
            "pubDate": "2025-01-30T18:27:27.108421"
        },
        {
            "title": "BEL Q3 Results: PAT jumps 47% YoY to Rs 1316 crore, revenue up 37%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bel-q3-results-pat-jumps-47-yoy-to-rs-1316-crore-revenue-up-37/articleshow/117736807.cms",
            "description": "BEL Q3 Results: BEL, a Navratna Defence PSU, reported a turnover of Rs 5,643.25 crore for the third quarter of fiscal year 2025, reflecting a 36.97% growth compared to Rs 4,120.10 crore in Q3 FY24. Profit before tax (PBT) for the quarter reached Rs 1,754.15 crore, marking a strong 49.64% increase from Rs 1,172.26 crore in the same period last year.",
            "pubDate": "2025-01-30T18:27:27.108512"
        },
        {
            "title": "Dabur India Q3 Results: PAT rises marginally YoY to Rs 516 cr, revenue up 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dabur-india-q3-results-pat-rises-marginally-yoy-to-rs-516-cr-revenue-up-3/articleshow/117734061.cms",
            "description": "Dabur India Q3 Results: FMCG company Dabur India on Thursday reported its results for the third quarter ended December 2024, posting a marginal 1.8% rise in its consolidated profit after tax on a year-on-year (YoY) basis to Rs 515.82 crore while its revenue from operations climbed 3% YoY.",
            "pubDate": "2025-01-30T18:27:27.108620"
        },
        {
            "title": "Adani Enterprises Q3 Results: Profit nearly wiped out, falls 97% YoY to Rs 58 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-enterprises-q3-results-profit-nearly-wiped-out-falls-97-yoy-to-rs-58-crore/articleshow/117731635.cms",
            "description": "Adani Enterprises Q3 Results: The bottom line plunged 97% to Rs 58 crore from Rs 1,888 crore in the same quarter last year. Revenue from operations for the quarter fell 9% YoY to Rs 22,848 crore. After the results, the company's shares dropped over 4%, touching a low of Rs 2,220.35.",
            "pubDate": "2025-01-30T18:27:27.108714"
        },
        {
            "title": "IndusInd Bank Q3 results preview: Weak NII, higher provisions could drag PAT down by 40% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-q3-results-preview-weak-nii-higher-provisions-could-drag-pat-down-by-40-yoy/articleshow/117730982.cms",
            "description": "IndusInd Bank's Q3 results are projected to show weak net interest income (NII) growth, elevated slippages, and increased provisions, potentially reducing PAT by 40% YoY. Loan and deposit growth are expected to remain moderate, with business growth staying sluggish.",
            "pubDate": "2025-01-30T18:27:27.108805"
        },
        {
            "title": "Nestle Q3 results preview: PAT, revenue growth seen marginal as muted demand weighs on earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-q3-results-preview-pat-revenue-growth-seen-marginal-as-muted-demand-weighs-on-earnings/articleshow/117730429.cms",
            "description": "Nestle India is expected to see marginal revenue and profit growth in Q3, impacted by muted consumer demand and high commodity prices. Analysts predict a slight rise in revenue due to a small increase in volumes and price hikes, but a decline in EBITDA margins due to elevated raw material costs.",
            "pubDate": "2025-01-30T18:27:27.108894"
        }
    ]
}