{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-23T09:53:25.814058",
    "items": [
        {
            "title": "Buy, Sell or Hold: Why brokerages are positive on Ambuja Cement and Century Plyboards but cautious on Kajaria",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-why-brokerages-are-positive-on-ambuja-cement-and-century-plyboards-but-cautious-on-kajaria/articleshow/126133982.cms",
            "description": "Brokerages maintain a selectively constructive stance on building material stocks, highlighting company-specific catalysts, restructuring benefits, and margin expansion potential despite near-term risks. HDFC Securities remains cautious on Kajaria Ceramics, while Antique and Nuvama are bullish on Ambuja Cement and Century Plyboards, citing structural simplification, cost savings, volume growth, and improving profitability.",
            "pubDate": "2025-12-23T05:28:05.316705"
        },
        {
            "title": "Dhurandhar has packed the theatres. Is Avatar the next catalyst to lift PVR Inox shares out of a long slump?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dhurandhar-has-packed-the-theatres-is-avatar-the-next-catalyst-to-lift-pvr-inox-shares-out-of-a-long-slump/articleshow/126133873.cms",
            "description": "PVR Inox shares are showing signs of life with the success of Dhurandhar and the release of Avatar: Fire and Ash. These films are expected to boost box office collections in the current quarter. Analysts believe this content surge could lead to modest earnings upgrades for the company.",
            "pubDate": "2025-12-23T05:28:05.316813"
        },
        {
            "title": "Jupiter Wagons, MCX India and 4 other stocks flash bullish signals, indicating a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-wagons-mcx-india-and-4-other-stocks-flash-bullish-signals-indicating-a-possible-uptrend/slideshow/126133528.cms",
            "description": "On December 22, in the Nifty 500 pack, six stocks that gained over 5% appeared on the bullish “White Marubozu” scanner, according to StockEdge.com’s technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest and the closing price is the highest for a given period.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-12-23T05:28:05.316910"
        },
        {
            "title": "RVNL, IRCTC, Jupiter Wagons shares jump up to 8% as railway stocks extend rally, all eyes now on Budget 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-irctc-jupiter-wagons-shares-jump-up-to-8-as-railway-stocks-extend-rally-all-eyes-now-on-budget-2026/articleshow/126133795.cms",
            "description": "Railway stocks extended their rebound on Tuesday, with Jupiter Wagons, IRCTC and RailTel gaining as investors reposition ahead of Union Budget 2026. The rally builds on stock-specific triggers and renewed capex hopes, even as the sector remains scarred by steep losses through much of 2025.",
            "pubDate": "2025-12-23T05:28:05.317026"
        },
        {
            "title": "Explained: What merger of Ambuja Cements, ACC, Orient Cement means for Adani shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-merger-of-ambuja-cements-acc-orient-cement-means-for-adani-shareholders/articleshow/126133606.cms",
            "description": "Ambuja Cements’ board approved merger schemes to combine ACC and Orient Cement into Ambuja through share swaps, with no cash payout. ACC shareholders will get 328 Ambuja shares for every 100 ACC shares, while Orient shareholders receive 33 Ambuja shares per 100 Orient shares. The swap values ACC near its current market price and offers Orient a roughly 9% premium.",
            "pubDate": "2025-12-23T05:28:05.317119"
        },
        {
            "title": "Four lost years push Indian IT to an AI reckoning. Will TCS, Infosys, Wipro deliver in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/four-lost-years-push-indian-it-to-an-ai-reckoning-will-tcs-infosys-wipro-deliver-in-2026/articleshow/126133433.cms",
            "description": "Indian IT stocks, after a four-year slump, face an AI reckoning. While past growth was fueled by pandemic spending, a cautious global market and AI's initial efficiency gains have pressured revenues. Experts anticipate a gradual AI-driven recovery, with 2026 expected to bring stability and renewed confidence as companies integrate AI into core business processes.",
            "pubDate": "2025-12-23T05:28:05.317212"
        },
        {
            "title": "KSH International shares list at 4% discount to IPO price on BSE, NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ksh-international-shares-list-at-4-discount-to-ipo-price-on-bse-nse/articleshow/126133277.cms",
            "description": "KSH International listed at a nearly 4% discount to its IPO price, reflecting muted investor sentiment after the issue saw just 83% subscription. The company cut its OFS size post-issue to support smoother allotment. Despite strong fundamentals, valuation concerns dominated demand across non-institutional and retail categories.",
            "pubDate": "2025-12-23T05:28:05.317308"
        },
        {
            "title": "GPT Infraprojects shares zoom 6% after being declared L1 bidder for Rs 670 crore NHAI project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gpt-infraprojects-shares-zoom-6-after-being-declared-l1-bidder-for-rs-670-crore-nhai-project/articleshow/126133198.cms",
            "description": "GPT Infraprojects shares: The company emerged as the L1 bidder for a Rs 670 crore NHAI infrastructure project. The order was secured through a consortium with ISCPPL and disclosed in a regulatory filing.",
            "pubDate": "2025-12-23T05:28:05.317404"
        },
        {
            "title": "Auto stocks rally up to 140% in 2025. How smooth will the road be in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-stocks-rally-up-to-140-in-2025-how-smooth-will-the-road-be-in-2026/articleshow/126133103.cms",
            "description": "India's auto sector is experiencing a robust rally, driven by a significant GST rate reduction in September. This policy shift has spurred broad-based demand across passenger vehicles, two-wheelers, tractors, and commercial vehicles. Auto ancillaries are outperforming, fueled by strong exports and EV component growth, setting a positive outlook for 2026.",
            "pubDate": "2025-12-23T05:28:05.317494"
        },
        {
            "title": "Sensex slips over 100 pts, Nifty below 26,200 as foreign outflows halt 2-day rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-100-pts-nifty-below-26200-as-foreign-outflows-halt-2-day-rally/articleshow/126133030.cms",
            "description": "Indian equities opened lower on Tuesday, breaking a two-day rally as foreign investors resumed selling. The Sensex and Nifty saw slight declines, with analysts anticipating thin trading volumes as the year concludes. The market awaits fresh catalysts ahead of the year-end.",
            "pubDate": "2025-12-23T05:28:05.317589"
        },
        {
            "title": "SBI, Varun Beverages among Axis Securities’ top 9 stock picks for 2026, up to 23% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-varun-beverages-among-axis-securities-top-9-stock-picks-for-2026-up-to-23-upside-seen/slideshow/126133094.cms",
            "description": "Axis Securities expects Indian equities to enter a robust earnings-led growth phase in 2026, forecasting the Nifty 50 to reach 28,100 by December 2026. This projection is based on a broad revival in corporate earnings, strong domestic macro fundamentals, a favorable policy backdrop, and a shift in global investor preference toward relatively insulated, consumption-driven economies like India.The brokerage believes that sectors aligned with credit growth, consumption, healthcare, and select cyclicals will be key beneficiaries in this phase. Against this backdrop, here are Axis Securities' top 9 stock picks, each offering an upside potential of up to 23%, based on fundamental strength and earnings visibility.",
            "pubDate": "2025-12-23T05:28:05.317682"
        },
        {
            "title": "HNI demand didn’t save them: 12 heavily subscribed IPOs of 2025 are still underwater",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hni-demand-didnt-save-them-12-heavily-subscribed-ipos-of-2025-are-still-underwater/articleshow/126132960.cms",
            "description": "India's IPO market is facing a harsh reality check as nearly half of the 102 listings in 2025 are trading below their issue price. Even strong demand from High Net Worth Individuals (HNIs) failed to protect 12 heavily subscribed IPOs, which are now underwater, highlighting issues beyond subscription frenzy.",
            "pubDate": "2025-12-23T05:28:05.317773"
        },
        {
            "title": "Ola Electric shares in focus after clarification on promoter stake sale for debt repayment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-after-clarification-on-promoter-stake-sale-for-debt-repayment/articleshow/126132927.cms",
            "description": "Ola Electric shares: The company clarified that promoter Bhavish Aggarwal’s Rs 324 crore stake sale was a one-time move to repay debt. The proceeds were used to fully repay a Rs 260 crore promoter-level loan, including interest, and to release all pledged promoter shares.",
            "pubDate": "2025-12-23T05:28:05.317861"
        },
        {
            "title": "Reliance Power among 4 Nifty500 stocks closing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-among-4-nifty500-stocks-closing-below-vwap/slideshow/126132901.cms",
            "description": "On December 22, the closing prices of four stocks from the Nifty 500 pack fell more than 1.5% below the VWAP (Volume Weighted Average Price). A move below the VWAP suggests a potential bearish trend, according to StockEdge.com’s technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.",
            "pubDate": "2025-12-23T05:28:05.317969"
        },
        {
            "title": "Ram Ratna Wires shares approach ex-date for 1:1 bonus issue. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ram-ratna-wires-shares-approach-ex-date-for-11-bonus-issue-do-you-own/articleshow/126132659.cms",
            "description": "December 23 is the last day to buy Ram Ratna Wires shares to qualify for its 1:1 bonus issue. The record date is December 26, and with December 25 being a market holiday, the stock will turn ex-bonus on December 24. Investors must purchase shares by the close on December 23 to be eligible.",
            "pubDate": "2025-12-23T05:28:05.318066"
        },
        {
            "title": "Ambuja Cements, Orient Cement shares zoom up to 10% following board approval for merger with Orient Cement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/acc-ambuja-cements-shares-in-focus-following-board-approval-for-merger-with-orient-cement/articleshow/126132638.cms",
            "description": "Ambuja Cements is embarking on an exciting merger with ACC Ltd and Orient Cement Ltd, a move designed to create a robust and unified cement platform across the Indian landscape. By merging, the companies aim to boost efficiency and refine their corporate framework.",
            "pubDate": "2025-12-23T05:28:05.318157"
        },
        {
            "title": "Meesho shares slide 21% in 3 days, after more than doubling in post-IPO surge. What's behind the decline?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-slide-21-in-3-days-after-more-than-doubling-in-post-ipo-surge-whats-behind-the-decline/articleshow/126134286.cms",
            "description": "Meesho shares fell for a third session after a blistering 110% post-IPO rally, as a low free-float, short-covering pressures and profit-taking triggered a sharp reversal. Brokerages remain constructive on the long-term growth story, even as volatility rattles near-term sentiment.",
            "pubDate": "2025-12-23T05:47:37.970920"
        },
        {
            "title": "Jupiter Wagons shares zoom 32% in 3 days after promoter buys Rs 135 crore stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-wagons-shares-zoom-32-in-3-days-after-promoter-buys-rs-135-crore-stake/articleshow/126134369.cms",
            "description": "Jupiter Wagons shares have seen a sharp uptick in three days after promoter Tatravagonka A.S. increased its stake via a Rs 135-crore convertible warrant allotment. The move boosted promoter holding to 19.24%, lifting investor sentiment. The stock trades at Rs 334 with bullish technicals despite remaining below long-term moving averages.",
            "pubDate": "2025-12-23T05:47:37.971038"
        },
        {
            "title": "Market algorithms: How Algo trading is reshaping global investing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-algorithms-how-algo-trading-is-reshaping-global-investing/articleshow/126134343.cms",
            "description": "Algorithmic trading, once the domain of global hedge funds, is now increasingly relevant for HNIs and family offices in India and abroad. Using pre-defined rules and automated execution enhances efficiency, risk management, and opportunity capture. Strategies include trend-following, arbitrage, mean reversion, and high-frequency trading across equities, derivatives, and currencies.",
            "pubDate": "2025-12-23T05:47:37.971259"
        },
        {
            "title": "Ola Electric’s 78% slide from peak wipes out Rs 8,000 crore for SoftBank; Temasek-backed fund down Rs 548 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electrics-78-slide-from-peak-wipes-out-rs-8000-crore-for-softbank-temasek-backed-fund-down-rs-548-crore/articleshow/126134308.cms",
            "description": "Global investors like SoftBank and Temasek have incurred substantial notional losses on Ola Electric shares, with valuations plummeting by approximately 78% from their peak. The company faces headwinds from declining market share and weak financial performance, prompting a cautious 'wait and watch' approach for retail investors.",
            "pubDate": "2025-12-23T05:47:37.971358"
        },
        {
            "title": "Motilal Oswal initiates coverage on Nykaa with ‘neutral' rating, Rs 280 target price on strong brand-led discovery model",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-initiates-coverage-on-nykaa-with-neutral-rating-rs-280-target-price-on-strong-brand-led-discovery-model/articleshow/126135722.cms",
            "description": "Motilal Oswal has initiated coverage on Nykaa with a ‘Neutral’ rating and a target price of Rs 280, implying a 10.3% upside from the previous close. The brokerage cited Nykaa’s strong position in the beauty and personal care segment, where it holds about a 27% share of India’s online market.",
            "pubDate": "2025-12-23T06:56:08.793331"
        },
        {
            "title": "Coal India shares rise 3.5% as subsidiary Bharat Coking Coal plans Rs 1,300 crore IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-shares-rise-3-5-as-subsidiary-bharat-coking-coal-plans-rs-1300-crore-ipo/articleshow/126135329.cms",
            "description": "Coal India shares rose on Tuesday after reports that its subsidiary, Bharat Coking Coal (BCCL), is preparing a Rs 1,300 crore IPO via a 10% stake sale. The issue, expected within two weeks, implies a valuation of about Rs 13,000 crore. Coal India stock is nearing its 52-week high.",
            "pubDate": "2025-12-23T06:56:08.793456"
        },
        {
            "title": "Investors gear up for a “Naya Daur” in 2026: Mirae Asset’s Swarup Mohanty shares market insights",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-gear-up-for-a-naya-daur-in-2026-mirae-assets-swarup-mohanty-shares-market-insights/articleshow/126135182.cms",
            "description": "Mirae Asset CIO Swarup Mohanty anticipates 2026 as a stock picker's market, favoring healthcare and banking, especially smaller private banks.  Global allocations have shifted, with a 50% US, 30% China, and 20% India focus.  He highlights the need for corporate earnings growth and sees India as a consumption story and safe investment haven.",
            "pubDate": "2025-12-23T06:56:08.793675"
        },
        {
            "title": "IRFC share price gain  5.03% as Sensex  falls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irfc-share-price-gain-5-03-as-sensex-falls/articleshow/126136368.cms",
            "description": "IRFC Share Price: On the technical charts, the RSI of the stock stood at 65.98.",
            "pubDate": "2025-12-23T07:40:06.316407"
        },
        {
            "title": "KSH International shares slip 5% after listing at discount. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ksh-international-shares-slip-5-after-listing-at-discount-should-you-buy-sell-or-hold/articleshow/126136191.cms",
            "description": "KSH International’s shares slipped 5% on debut after listing at a nearly 4% discount to the IPO price, reflecting cautious investor sentiment and muted demand outside institutional buyers. The weak listing has reignited the debate on whether investors should exit, hold on for the long term, or wait for clarity on valuation and balance-sheet repair.",
            "pubDate": "2025-12-23T07:40:06.316526"
        },
        {
            "title": "Ambuja Cements approves merger with ACC, Orient Cement; Brokerages decode impact. What’s in for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambuja-cements-approves-merger-with-acc-orient-cement-brokerages-decode-impact-whats-in-for-investors/articleshow/126136182.cms",
            "description": "Shares of Ambuja Cements and ACC rose after Ambuja’s board approved the merger of ACC and Orient Cement into Ambuja to form a unified “One Cement Platform” under the Adani Group. The merger will be carried out through a share swap with no cash payout, with defined exchange ratios for ACC and Orient Cement shareholders.",
            "pubDate": "2025-12-23T07:40:06.316726"
        },
        {
            "title": "Foreigners buy most Indian stocks in 2 months as rupee recovers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreigners-buy-most-indian-stocks-in-2-months-as-rupee-recovers/articleshow/126136097.cms",
            "description": "Foreign investors injected the most capital into Indian stocks in two months, purchasing $644 million in local shares. This surge followed a rupee rebound from its record low, with the currency achieving its largest weekly gain in nearly six months. The inflows underscore the critical link between rupee stability and sustained foreign interest in Indian equities.",
            "pubDate": "2025-12-23T07:40:06.316829"
        },
        {
            "title": "For investors with a perspective of more than 1 year: 5 mid-cap stocks from different sectors with upside potential of up to 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-a-perspective-of-more-than-1-year-5-mid-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-34/articleshow/126136500.cms",
            "description": "In the next few days we will be talking about 2026 and how to manage investing in the New Year. But come the second week of January and the street will be back to doing what it should be doing: Looking at earnings numbers. Why talk about this at this point of time? In the last four months, since the GST reforms were introduced and interest rates were cut, there has been marked improvement in the market. And valuations have inched higher. So, it is probably time to give equal value to being optimistically cautious while being bullish on India.",
            "pubDate": "2025-12-23T07:50:39.014750"
        },
        {
            "title": "Japan shares rise as bond yields retreat; tech jitters weigh on Nikkei",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-shares-rise-as-bond-yields-retreat-tech-jitters-weigh-on-nikkei/articleshow/126136698.cms",
            "description": "Japanese stocks rose on Tuesday as ‍a retreat in domestic bond ​yields from record highs lifted sentiment, although persistent worries about artificial intelligence-linked ⁠share valuations capped gains for the tech-heavy Nikkei.",
            "pubDate": "2025-12-23T07:50:39.014863"
        },
        {
            "title": "Vodafone Idea shares rally 22% in a month on AGR due relief hopes. Is the turnaround real for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-rally-22-in-a-month-on-agr-due-relief-hopes-is-the-turnaround-real-for-investors/articleshow/126137156.cms",
            "description": "Vodafone Idea shares have surged 22% in a month, hitting a fresh 52-week high as hopes rise over potential AGR dues relief. Reports of an interest-free moratorium and possible reassessment of liabilities have lifted sentiment, though analysts say a sustained turnaround hinges on a decisive breakout above key resistance levels.",
            "pubDate": "2025-12-23T08:30:44.884120"
        },
        {
            "title": "Diabetes wave to fuel Indian pharma rally in 2026. Elara Capital picks 9 stocks for up to 43% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diabetes-wave-to-fuel-indian-pharma-rally-in-2026-elara-capital-picks-9-stocks-for-up-to-43-gains/slideshow/126138367.cms",
            "description": "India's pharma sector is staring at a significant tailwind that comes in the form of GLP-1 opportunity. Brokerage Elara Capital in a note said that GLP-1 could become first line therapy in diabetes and obesity and could replace other drug classes in metabolic syndrome. It has picked 5 stocks to buy and four others to 'Accumulate'. It also has a 'Sell' recommendation on one stock in its coverage. Check details:",
            "pubDate": "2025-12-23T09:41:18.069045"
        },
        {
            "title": "Mutual Funds turn buyers: Stakes raised after two quarters, 7 stocks surge up to 55%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-turn-buyers-stakes-raised-after-two-quarters-7-stocks-surge-up-to-55/slideshow/126138167.cms",
            "description": "After trimming exposure for two straight quarters, mutual funds shifted gears in the September 2025 quarter, emerging as selective buyers in the broader market. They raised their stakes in 38 BSE 500 stocks, reversing the cautious stance seen during the December 2024–March 2025 and March–June 2025 periods. The move indicates that fund managers, who had stayed on the sidelines earlier, are gradually re-entering the market in chosen names.Performance among these stocks in CY25 has been uneven. While 13 stocks delivered double-digit returns of up to 55%, about 22 slipped into negative territory, with six witnessing steep declines of 30–60%. Still, mutual funds are considered informed investors, guided by deep research and long-term fundamentals, and their renewed buying after sustained cuts often reflects rising confidence in business prospects rather than expectations of quick price gains. We highlighted the top seven gainers, which surged 30–55%, as well as the major laggards that declined 30–60% in CY25. (Data Source: ACE Equity)",
            "pubDate": "2025-12-23T09:41:18.069176"
        },
        {
            "title": "Zerodha co-founder Nithin Kamath reacts to NSE’s lending ban for brokers, calls it a good first step",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-co-founder-nithin-kamath-reacts-to-nses-lending-ban-for-brokers-calls-it-a-good-first-step/articleshow/126138731.cms",
            "description": "Zerodha co-founder Nithin Kamath welcomed NSE’s ban on brokers distributing third-party loans unrelated to trading, calling it a “good first step.” The move aims to curb investor leverage risks, especially from unsecured borrowing, while maintaining existing frameworks like the Margin Trading Facility. Kamath highlighted the importance of separating lending from trading.",
            "pubDate": "2025-12-23T09:53:24.987184"
        }
    ]
}