{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-20T05:34:01.900032",
    "items": [
        {
            "title": "IDFC First Bank shares rally 3% as Q2 profit surges 75%. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idfc-first-bank-shares-rally-3-as-q2-profit-surges-75-should-you-buy-sell-or-hold/articleshow/124700119.cms",
            "description": "IDFC First Bank shares surged following a robust 75.5% year-on-year profit increase for the second quarter of FY26. This growth was fueled by strong business expansion and better operating leverage. Loans and customer deposits saw significant year-on-year increases. Asset quality remained stable. The bank's management expressed confidence in sustaining this positive trend.",
            "pubDate": "2025-10-20T05:33:42.547145"
        },
        {
            "title": "Wipro, Muthoot Finance among 7 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-muthoot-finance-among-7-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124700013.cms",
            "description": "As of October 17, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-20T05:33:42.547279"
        },
        {
            "title": "Robust retail, O2C performance support Reliance’s quarterly growth: Sudip Bandyopadhyay",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/robust-retail-o2c-performance-support-reliances-quarterly-growth-sudip-bandyopadhyay/articleshow/124699667.cms",
            "description": "Reliance Industries showcased a robust quarterly performance, with its telecom segment leading the charge driven by strong ARPU and customer additions. The company's retail and O2C segments also performed well, supported by festive demand and GST relief. Investors are anticipating future value unlocking from the upcoming Jio listing and the diversified portfolio.",
            "pubDate": "2025-10-20T05:33:42.547408"
        },
        {
            "title": "China holds benchmark lending rates steady amid slowing growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-holds-benchmark-lending-rates-steady-amid-slowing-growth/slideshow/124699862.cms",
            "description": "China has left its benchmark lending rates unchanged in October for the fifth consecutive month. The decision reflects caution amid slowing economic momentum and ongoing trade tensions with the U.S. (Source: Reuters)",
            "pubDate": "2025-10-20T05:33:42.547537"
        },
        {
            "title": "Muhurat trading, Q2 earnings, global cues: 8 key triggers for markets this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muhurat-trading-q2-earnings-global-cues-8-key-triggers-for-markets-this-week/articleshow/124699545.cms",
            "description": "Indian stock markets began the week with significant gains. Strong earnings from HDFC Bank and ICICI Bank boosted investor confidence. Global sentiment improved due to easing U.S.-China trade tensions. The upcoming week includes Muhurat trading and more Q2 earnings reports. Investors will also watch global developments and currency movements.",
            "pubDate": "2025-10-20T05:33:42.547652"
        },
        {
            "title": "China’s GDP growth slows to 4.8% in Q3 amid property slump, trade tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-gdp-growth-slows-to-4-8-in-q3-amid-property-slump-trade-tensions/slideshow/124699598.cms",
            "description": "China’s GDP growth slowed to its weakest pace in a year during the third quarter, affected by a prolonged property slump and ongoing trade tensions with the U.S. Policymakers are under pressure to introduce more stimulus to maintain momentum. (Source: Reuters)",
            "pubDate": "2025-10-20T05:33:42.547764"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains overweight on HDFC Bank; Emkay Global recommends Buy on RIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-overweight-on-hdfc-bank-emkay-global-recommends-buy-on-ril/articleshow/124699342.cms",
            "description": "Top brokerages like Morgan Stanley and Emkay Global are optimistic about leading Indian banks and conglomerates. Morgan Stanley reiterates Overweight on HDFC Bank and ICICI Bank, citing strong fundamentals and growth. Emkay Global maintains a Buy on Reliance Industries, highlighting robust performance across its segments.",
            "pubDate": "2025-10-20T05:33:42.547870"
        },
        {
            "title": "Technical picks: Axis Securities favours 3 stocks for up to 18% returns as Nifty eyes record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-axis-securities-favours-3-stocks-for-up-to-18-returns-as-nifty-eyes-record-high/slideshow/124699375.cms",
            "description": "Indian markets ended the week higher with the Nifty closing at 25,710, up 425 points, forming a strong bullish candle on weekly charts. Axis Securities expects the uptrend to continue as both Nifty and Bank Nifty trade near key breakout zones.\"The index has also broken above the medium-term downward sloping trendline, paving the way for a potential move towards the all-time high of 26,277,\" the brokerage said.",
            "pubDate": "2025-10-20T05:33:42.547981"
        },
        {
            "title": "Nifty rallying, but portfolios down? Diwali run masks retail pain as smallcaps extend year-long slide",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-rallying-but-portfolios-down-diwali-run-masks-retail-pain-as-smallcaps-extend-year-long-slide/articleshow/124699303.cms",
            "description": "The Nifty 50 is reaching new heights driven by large companies. However, many smallcap stocks are not participating in this rally. Investors are cautious due to high valuations and tight liquidity in the smallcap segment. Experts suggest patience and selectivity for potential future gains as the market may rotate towards smaller companies.",
            "pubDate": "2025-10-20T05:33:42.548082"
        },
        {
            "title": "PTC Industries shares in focus on Bharat Dynamics JV to develop missiles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ptc-industries-shares-in-focus-on-bharat-dynamics-jv-to-develop-missiles/articleshow/124699176.cms",
            "description": "PTC Industries and Bharat Dynamics have signed an MoU to form a joint venture for manufacturing propulsion systems, guided bombs, and aero-engines for missiles and UAVs. This collaboration aims to boost the 'Make in India' initiative by reducing foreign dependence and strengthening domestic capabilities in strategic engine technologies.",
            "pubDate": "2025-10-20T05:33:42.548192"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124699100.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-10-20T05:33:42.548292"
        },
        {
            "title": "RBL Bank shares surge 5% to 52-week high on Q2 beat, Emirates NBD’s Rs 26,853 crore stake buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-on-q2-results-emirates-nbds-60-stake/articleshow/124699138.cms",
            "description": "RBL Bank shares surged to a 52-week high following its September quarter earnings and a landmark investment agreement with Emirates NBD. The Dubai-based bank will acquire a 60% stake for Rs 26,853 crore, marking the largest FDI in India's financial services sector. This strategic partnership is set to significantly bolster RBL Bank's capital and expand its growth prospects.",
            "pubDate": "2025-10-20T05:33:42.548395"
        },
        {
            "title": "Yes Bank shares in focus after reporting 18% YoY jump in Q2 net profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-after-reporting-18-yoy-jump-in-q2-net-profit/articleshow/124699106.cms",
            "description": "Yes Bank shares: The private lender reported an 18.3% YoY rise in Q2FY26 profit to ₹654.47 crore, with NII up 4.5% to ₹2,300.88 crore. Advances crossed ₹2.5 lakh crore, growing 6.4% YoY on robust disbursements across segments.",
            "pubDate": "2025-10-20T05:33:42.548509"
        },
        {
            "title": "IndusInd Bank shares slip 3% after posting Rs 437 crore net loss in Q2FY26. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-after-posting-rs-437-crore-q2-loss-what-should-investors-do/articleshow/124699081.cms",
            "description": "IndusInd Bank reported a Q2 FY26 net loss of Rs 437 crore, reversing a Rs 1,331 crore profit a year ago, as NII and fee income fell and asset quality pressures persisted. CASA deposits formed 31% of total deposits. Brokerages remain cautious, with Morgan Stanley at Equal-weight and Elara Capital at Sell, citing muted growth and strategic challenges under new management.",
            "pubDate": "2025-10-20T05:33:42.548621"
        },
        {
            "title": "Sensex surges over 650 pts, Nifty tops 25,900 on solid bank earnings & global trade optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-surges-over-650-pts-nifty-tops-25900-on-solid-bank-earnings-global-trade-optimism/articleshow/124699050.cms",
            "description": "Indian stock markets opened with significant gains on Monday. The Sensex and Nifty surged higher. Strong quarterly results from HDFC Bank and ICICI Bank boosted investor confidence. Global markets also showed improvement. This was driven by positive signs regarding U.S.-China trade relations. Investors are reacting positively to these developments.",
            "pubDate": "2025-10-20T05:33:42.548724"
        },
        {
            "title": "RIL shares surge 3% as Q2 profit rises 10% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-as-net-profit-rises-10-yoy-in-q2/articleshow/124699057.cms",
            "description": "RIL Share Price: Reliance Industries shares saw a significant jump on Monday. The company announced a 10% year-on-year growth in its profit after tax for the second quarter of fiscal year 2026. This strong performance was driven by its Oil-to-Chemicals, Jio, and retail businesses. Revenue also increased by 10% year-on-year. Capital expenditure focused on expansion across key segments.",
            "pubDate": "2025-10-20T05:33:42.548827"
        }
    ]
}