{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-29T06:54:03.900570",
    "items": [
        {
            "title": "Sun Pharma, L&T among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-lt-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124203823.cms",
            "description": "As of September 26, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-29T03:26:52.519256"
        },
        {
            "title": "PB Fintech, Hero MotoCorp among 5 stocks close crossing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pb-fintech-hero-motocorp-among-5-stocks-close-crossing-below-vwap/slideshow/124203729.cms",
            "description": "The closing prices of five stocks from Nifty500 dropped over 0.5% relative to the VWAP (Volume Weighted Average Price) on September 26, and a shift below the VWAP suggests a potential bearish trend, according to stockedge.com's technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.\"",
            "pubDate": "2025-09-29T03:26:52.519384"
        },
        {
            "title": "IZMO, Lumax Auto, and 3 other stocks hit 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/izmo-lumax-auto-and-3-other-stocks-hit-5-year-swing-high-breakout/slideshow/124203494.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, five stocks witnessed a 5-year swing high at the close on September 26, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-29T03:26:52.519490"
        },
        {
            "title": "Prime Cable Industries shares to debut today. GMP signals muted listing buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prime-cable-industries-shares-to-debut-today-gmp-signals-muted-listing-buzz/articleshow/124203415.cms",
            "description": "Prime Cable Industries is poised for its stock market debut on Monday, with modest expectations for its listing. Despite the IPO being oversubscribed 8.28 times across all categories, a grey market premium of just 4% suggests a flat-to-marginal opening. The company reported strong FY25 financials, yet analysts indicate its current valuation leaves little room for immediate upside.",
            "pubDate": "2025-09-29T03:26:52.519594"
        },
        {
            "title": "Solvex Edibles IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/solvex-edibles-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/124203410.cms",
            "description": "Solvex Edibles' initial public offering closed. Investor response was tepid. The company's shares are listing today. The grey market premium held flat at zero percent. This suggests limited listing day excitement. The issue received 1.02 times subscription overall. Retail portion subscription was 0.73 times. Solvex Edibles makes rice bran oil and by-products.",
            "pubDate": "2025-09-29T03:26:52.519690"
        },
        {
            "title": "Negative Breakout: These 9 stocks close cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-9-stocks-close-cross-below-their-200-dmas/slideshow/124203251.cms",
            "description": "In the Nifty200 pack, the closing prices of 17 stocks fell below their 200 DMA (Daily Moving Averages) on September 26, according to StockEdge.com's technical scan data. Of these, we have highlighted 9 stocks that slipped more than 2%. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-09-29T03:26:52.519786"
        },
        {
            "title": "Atlanta Electricals shares to debut today. GMP builds up as listing nears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/atlanta-electricals-shares-to-debut-today-gmp-builds-up-as-listing-nears/articleshow/124203107.cms",
            "description": "Atlanta Electricals, a prominent transformer manufacturer, debuts on bourses September 29 following a successful Rs 687 crore IPO. The issue was oversubscribed 72.16 times, with a 15% grey market premium reflecting cautious optimism. Analysts view the company positively, highlighting its robust order book and strong potential to capitalize on India's expanding power sector, suggesting a long-term investment opportunity.",
            "pubDate": "2025-09-29T03:26:52.519880"
        },
        {
            "title": "Ashish Kacholia-backed Ganesh Consumer Products shares to debut today. GMP turns negative ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-ganesh-consumer-products-shares-to-debut-today-gmp-turns-negative-ahead-of-listing/articleshow/124203097.cms",
            "description": "Ganesh Consumer Products is poised for a cautious stock market debut on Monday, with a negative grey market premium suggesting a weak listing despite moderate IPO subscription. The prominent eastern India FMCG firm, known for wheat-based products, reported steady FY25 financials but operates on low margins. Its long-term prospects hinge on brand expansion and sustained profitability in a competitive market.",
            "pubDate": "2025-09-29T03:26:52.519971"
        },
        {
            "title": "Asian shares cautious as US government faces shutdown risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shares-cautious-in-asia-as-us-government-faces-shutdown-risk/articleshow/124202811.cms",
            "description": "Asian markets opened cautiously Monday as investors eyed a potential U.S. government shutdown, which could delay key economic data and marginally impact the Fed's October rate cut decision. Despite this, S&P 500 futures rose, while gold neared a record high and oil prices slipped on increased supply.",
            "pubDate": "2025-09-29T03:26:52.520086"
        },
        {
            "title": "Legacy microloan stress still a worry for small finance banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/legacy-microloan-stress-still-a-worry-for-small-finance-banks/articleshow/124202733.cms",
            "description": "Microfinance business is significantly impacting small finance banks like ESAF, Suryoday, and Utkarsh, with nearly a fifth of their microloan books under severe stress. This deterioration in asset quality, driven by high unsecured microloans, is weighing heavily on their profitability and has led to rating downgrades and losses for some.",
            "pubDate": "2025-09-29T03:26:52.520181"
        },
        {
            "title": "GIFT Nifty up 100 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124196602.cms",
            "description": "Equity markets faced significant selling pressure last week, tumbling over 2.5% and ending a three-week winning streak. The upcoming week is data-heavy, with RBI policy and derivatives expiry expected to fuel volatility. FIIs net sold shares, while the rupee rebounded from its all-time low.",
            "pubDate": "2025-09-29T03:26:52.520275"
        },
        {
            "title": "Stocks in news: Tata Motors, Waaree Energies, HDFC Bank, Anant Raj, Oil India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tata-motors-waaree-energies-hdfc-bank-anant-raj-oil-india/articleshow/124196542.cms",
            "description": "Markets extended their losing streak for the sixth consecutive session, with the Nifty approaching key support levels, prompting analysts to advise caution. Meanwhile, Waaree Energies confirmed its expansion plans despite a US tariff probe, HDFC Bank's Dubai branch faced client onboarding restrictions, and Tata Motors announced a new MD & CEO.",
            "pubDate": "2025-09-29T03:26:52.520373"
        },
        {
            "title": "Valuations remain elevated, retail investors urged to stay disciplined",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuations-remain-elevated-retail-investors-urged-to-stay-disciplined/articleshow/124202642.cms",
            "description": "Indian equities saw an unusual year. They lagged global peers despite strong economic fundamentals. High valuations and foreign outflows impacted performance. Domestic investors, however, showed strong support. Households now own more of the market. Caution is advised due to current valuations. Retail investors should focus on disciplined asset allocation. Large caps offer better comfort.",
            "pubDate": "2025-09-29T03:26:52.520465"
        },
        {
            "title": "Two-thirds of Nifty 500 stocks trade below last year’s levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-thirds-of-nifty-500-stocks-trade-below-last-years-levels/articleshow/124202581.cms",
            "description": "Indian equities faced a downturn since September 2024. The Nifty 50 is 1,623 points short of its peak. Two-thirds of Nifty 500 stocks are below year-ago levels. A study revealed widespread losses among listed stocks. Bitcoin surged 79 percent. Gold and silver rallied over 51 percent. These alternative assets far outpaced Indian stock market performance.",
            "pubDate": "2025-09-29T03:26:52.520554"
        },
        {
            "title": "Will India-US tariff deal spark the next rally on Dalal Street?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-india-us-tariff-deal-spark-the-next-rally-on-dalal-street/articleshow/124202522.cms",
            "description": "Indian equities face continued underperformance, trailing global peers due to earnings disappointment and significant overseas exits. While corporate earnings revival is anticipated only by FY27, a resolution to the India-US tariff dispute is seen as the immediate trigger to push Sensex and Nifty towards new all-time highs.",
            "pubDate": "2025-09-29T03:26:52.520646"
        },
        {
            "title": "Why Indian markets have been underperforming peers and why the outlook looks incrementally better",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-indian-markets-have-been-underperforming-peers-and-why-the-outlook-looks-incrementally-better/articleshow/124206797.cms",
            "description": "Indian equities lagged global markets over the past year. Weak earnings and high valuations caused this underperformance. Foreign investors also reduced holdings. Now, valuations are more reasonable. Government reforms and global shifts may attract new flows. A rebound is possible in the next 12 months. Focus will be on specific sectors.",
            "pubDate": "2025-09-29T06:53:42.464108"
        },
        {
            "title": "How silver dethroned gold in 2025’s race for returns and why investors are rushing in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-silver-dethroned-gold-in-2025s-race-for-returns-and-why-investors-are-rushing-in/articleshow/124206519.cms",
            "description": "Silver has emerged as the top-performing precious metal of 2025, delivering a 53% YTD gain, outpacing gold’s 49% rise. Its rally pushed prices to an all-time high of Rs 1,44,179/kg on the MCX, highlighting strong bullish momentum.",
            "pubDate": "2025-09-29T06:53:42.464238"
        },
        {
            "title": "RBI poised to hold rates at 5.50% amid mixed signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-poised-to-hold-rates-at-5-50-amid-mixed-signals/slideshow/124206298.cms",
            "description": "The Reserve Bank of India is widely expected to maintain its key policy rate at 5.50% in Wednesday’s meeting. However, some economists caution that a surprise cut cannot be ruled out, given global trade pressures and subdued inflation. (Source: Reuters)",
            "pubDate": "2025-09-29T06:53:42.464343"
        },
        {
            "title": "HUL shares fall 3% on muted Q2 business update as GST 2.0 delays spending",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-fall-3-on-muted-q2-business-update-as-gst-2-0-delays-spending/articleshow/124205627.cms",
            "description": "Hindustan Unilever (HUL) shares fell sharply on muted Q2 growth, impacted by GST rate cuts. Trade and channel disruptions led to postponed orders and lower consumer buying in September, affecting sales. The portfolio now sees reduced GST rates on key FMCG products.",
            "pubDate": "2025-09-29T06:53:42.464444"
        },
        {
            "title": "Ashish Kacholia invested in these 5 IPOs recently. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-invested-in-these-5-ipos-recently-do-you-own-any/slideshow/124205080.cms",
            "description": "The last two months have been hectic for IPO investors with a flurry of listings. September, particularly, was the busiest in nearly three decades. For investors startled with the number of IPOs, marquee picks from star names might have a clue as to which IPOs are worth looking at. Ashish Kacholia is one such name who invested in the",
            "pubDate": "2025-09-29T06:53:42.464561"
        },
        {
            "title": "Pace Digitek IPO Day 2: GMP drops to 5%. Check subscription status and other key details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pace-digitek-ipo-day-2-gmp-drops-to-5-check-subscription-status-and-other-key-details/articleshow/124204841.cms",
            "description": "Pace Digitek IPO: The IPO is now quoting at a 5.5% premium to its issue price of Rs 219 in the grey market, sharply lower than the earlier 14% premium.",
            "pubDate": "2025-09-29T06:53:42.464666"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124204395.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-09-29T06:53:42.464764"
        },
        {
            "title": "Too many IPOs, too little returns? GMPs suggest cautious trends for 9 listings tomorrow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/too-many-ipos-too-little-returns-gmps-suggest-cautious-trends-for-9-listings-tomorrow/slideshow/124204806.cms",
            "description": "If last week was about a flood of IPOs opening for subscription, this week will all be about the listings of these issues. Despite a breathtaking primary market activity, the demand for these IPOs has been mixed, both on the subscription and grey market fronts. Here's a look at 9 IPOs that will list tomorrow and their GMPs.",
            "pubDate": "2025-09-29T06:53:42.464860"
        },
        {
            "title": "China eyes policy flexibility amid global rate cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-eyes-policy-flexibility-amid-global-rate-cuts/slideshow/124204771.cms",
            "description": "Industrial profits in China returned to growth in August, rising 20.4% year-on-year, after a 1.5% decline in July. In the first eight months, profits grew 0.9%, reversing a 1.7% decline in January–July, according to National Bureau of Statistics data. (Source: Reuters)",
            "pubDate": "2025-09-29T06:53:42.464953"
        },
        {
            "title": "PSU banks’ m-cap jumps 5X since FY20: 5 triggers that could drive re-rating & more upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-banks-m-cap-jumps-5x-since-fy20-5-triggers-that-could-drive-re-rating-more-upside/articleshow/124204500.cms",
            "description": "Indian public sector banks have transformed into powerful wealth creators, multiplying investor wealth over five times since FY20, with their combined market cap surging to Rs 16.40 lakh crore. This re-rating is fueled by fundamental improvements like drastically reduced NPAs, strong RoA, and outperforming private banks in loan growth.",
            "pubDate": "2025-09-29T06:53:42.465048"
        },
        {
            "title": "Waaree Energies shares rise after co addresses CBP inquiry, assures U.S. compliance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-in-focus-after-co-addresses-cbp-inquiry-assures-u-s-compliance/articleshow/124204451.cms",
            "description": "Waaree Energies' shares rose after the company reaffirmed its U.S. manufacturing commitment and regulatory compliance, despite a U.S. Customs and Border Protection inquiry. The probe investigates allegations of mislabeling Chinese-made solar components as Indian to circumvent tariffs. Waaree is cooperating, expressing confidence in its compliance, and does not expect additional duties.",
            "pubDate": "2025-09-29T06:53:42.465141"
        },
        {
            "title": "Sensex jumps over 300 pts, Nifty tops 24,700 as D-St snaps 6-day losing streak ahead of RBI MPC meet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-100-pts-nifty-tops-24700-as-d-st-snaps-6-day-losing-streak-ahead-of-rbi-mpc-meet/articleshow/124204308.cms",
            "description": "Benchmark indices Nifty and Sensex opened in the green on Monday, September 29, snapping a six-day losing streak. Gains in IT, oil & gas, and metal stocks propelled the market, though a sharp drop in FMCG counters limited the overall upside. The Sensex rose 162 points, while the Nifty gained 75 points.",
            "pubDate": "2025-09-29T06:53:42.465235"
        },
        {
            "title": "Buy, Sell or Hold: Motilal Oswal maintains buy on Mahanagar Gas; Nuvama raises target price on Jindal Steel",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-motilal-oswal-maintains-buy-on-mahanagar-gas-nuvama-raises-target-price-on-jindal-steel/articleshow/124204276.cms",
            "description": "Brokerages stay bullish on Mahanagar Gas, Jindal Steel, and ACME Solar, citing strong growth, resilient margins, capacity expansion, and robust cash flows, with long-term upside potential of 35–38% across energy, steel, and renewables.",
            "pubDate": "2025-09-29T06:53:42.465331"
        },
        {
            "title": "Azad Engineering shares rally 4% after signing contract worth Rs 651 crore with Mitsubishi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/azad-engineering-shares-in-focus-after-signing-contract-worth-rs-651-crore-with-mitsubishi/articleshow/124204363.cms",
            "description": "Azad Engineering shares: The company signed a $73.47 million (₹651 crore) five-year contract with Japan’s Mitsubishi Heavy Industries to supply turbine engine components. This builds on an earlier deal, taking total business value with MHI to $156.36 million (₹1,387 crore).",
            "pubDate": "2025-09-29T06:53:42.465421"
        },
        {
            "title": "Silver soars 59%, gold jumps 47% in 2025 but Nifty only 4%. Is the great reversal coming?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-soars-59-gold-jumps-47-in-2025-but-nifty-only-4-is-the-great-reversal-coming/articleshow/124204232.cms",
            "description": "Precious metals have dramatically outperformed Indian stock market this year, with silver up 59% and gold 47% against Nifty50's 4%. While some experts see equities poised for a comeback due to lower valuations and earnings recovery, others remain bullish on precious metals, though caution is advised at current highs. The market faces a potential reversal of fortunes.",
            "pubDate": "2025-09-29T06:53:42.465527"
        },
        {
            "title": "Tata Motors shares rise 2% as JLR bags £2 billion loan, slew of management changes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-as-jlr-bags-2-billion-loan-slew-of-management-changes/articleshow/124204208.cms",
            "description": "Tata Motors shares: JLR secured a £2 billion loan guarantee to ease liquidity pressures after a September 1 cyberattack halted production. The shutdown affected plants in the UK, Slovakia, Brazil, and India, though its China JV remained operational. JLR has begun a phased restart, with key systems and operations gradually resuming.",
            "pubDate": "2025-09-29T06:53:42.465622"
        }
    ]
}