{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-09T23:57:02.896154",
    "items": [
        {
            "title": "Japan's Nikkei crosses 44,000 for first time on trade, stimulus optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-crosses-44000-for-first-time-on-trade-stimulus-optimism/articleshow/123777242.cms",
            "description": "Nikkei in Japan surpasses 44,000 for the first time. Trade optimism and stimulus hopes boosted market sentiment. U.S. tariffs on Japanese autos are set to decrease. Shigeru Ishiba resigned and Sanae Takaichi is running for leadership. Semiconductor shares saw a rally. Advantest and other chip-related companies experienced significant gains. Sony also showed positive movement in the market.",
            "pubDate": "2025-09-09T03:40:24.065675"
        },
        {
            "title": "Hudco shares in focus after Rs 11,300 crore MoU with Nagpur Metro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hudco-shares-in-focus-after-rs-11300-crore-mou-with-nagpur-metro/articleshow/123777233.cms",
            "description": "Housing & Urban Development Corporation (Hudco) signed a non-binding MoU with Nagpur Metropolitan Region Development Authority (NMRDA) to provide up to Rs 11,300 crore for metro, housing, and infrastructure projects over five years. The pact, attended by Maharashtra CM Devendra Fadnavis, also covers consultancy and capacity-building support. Analysts expect the deal to strengthen Hudco’s long-term lending portfolio.",
            "pubDate": "2025-09-09T03:40:24.065793"
        },
        {
            "title": "Ashok Leyland, Tata Motors among 5 stocks with White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-tata-motors-among-5-stocks-with-white-marubozu-pattern/slideshow/123777194.cms",
            "description": "On September 8, five stocks from the Nifty500 pack appeared on the bullish “White Marubozu” scanner, according to technical scan data from stockedge.com.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for a given period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, the pattern signals strong buying pressure throughout the session. Traders often interpret it as a sign that buyers dominated from open to close, using it as an input for future trading decisions.Stocks on the White Marubozu scanner:",
            "pubDate": "2025-09-09T03:40:24.065897"
        },
        {
            "title": "Voltamp Transformers shares in focus as promoter plans 7% equity stake sale via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/voltamp-transformers-shares-in-focus-as-promoter-plans-7-equity-stake-sale-via-block-deal/articleshow/123777063.cms",
            "description": "Media reports suggest that Voltamp Transformers promoter Kunjal Patel will sell up to 7% equity via a $67 million block deal at a floor price of Rs 7,600 per share, potentially altering promoter holdings and attracting institutional interest.",
            "pubDate": "2025-09-09T03:40:24.066003"
        },
        {
            "title": "Godrej Consumer Products shares in focus on Rs 250 crore investment in Indonesia manufacturing facility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-products-shares-in-focus-on-rs-250-crore-investment-in-indonesia-manufacturing-facility/articleshow/123776825.cms",
            "description": "Godrej Consumer share price: Godrej Consumer Products has announced a Rs 250 crore investment in a new Indonesia facility. The expansion, set to boost the company's Home and Personal Care capacity by 15% over 18–36 months, underlines GCPL’s confidence in its Southeast Asia growth story.",
            "pubDate": "2025-09-09T03:40:24.066103"
        },
        {
            "title": "Infosys shares in focus as board to consider buyback proposal in upcoming board meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-as-board-to-consider-buyback-proposal-in-upcoming-board-meeting/articleshow/123776792.cms",
            "description": "Infosys share price: Infosys board is set to consider a buyback proposal on September 11. The move comes after a 25% stock slide in a year, aiming to boost investor confidence amid weak IT sector sentiment, muted growth guidance, and global headwinds.",
            "pubDate": "2025-09-09T03:40:24.066201"
        },
        {
            "title": "RailTel shares in focus after securing multiple work orders worth over Rs 700 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railtel-shares-in-focus-after-securing-multiple-work-orders-worth-over-rs-700-crore/articleshow/123776759.cms",
            "description": "RailTel share price: RailTel has secured orders worth over Rs 700 crore from the Bihar Education Project Council. The contracts include Smart Classrooms, ICT Labs, ISM Labs, and teaching materials across government schools, aimed at boosting digital education and bridging the learning gap.",
            "pubDate": "2025-09-09T03:40:24.066316"
        },
        {
            "title": "Nasdaq ends at record as markets eye interest rate relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-ends-at-record-as-markets-eye-interest-rate-relief/articleshow/123776655.cms",
            "description": "US equity indices surged, with the Nasdaq reaching a new record, fueled by anticipation of Federal Reserve interest rate cuts following benign inflation data. Sam Stovall of CFRA Research noted growing investor confidence in lower rates.",
            "pubDate": "2025-09-09T03:40:24.066413"
        },
        {
            "title": "At multi-year highs: Maruti, JSW Steel among 8 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-maruti-jsw-steel-among-8-stocks-witness-5-year-swing-high-breakout/slideshow/123776647.cms",
            "description": "In the Nifty200 pack, eight stocks witnessed a 5-year swing high at the close on September 8, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-09T03:40:24.066507"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Samvardhana Motherson, CEAT among 5 stocks that could give 16-41% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-samvardhana-motherson-ceat-among-5-stocks-that-could-give-16-41-return/slideshow/123776564.cms",
            "description": "Brokerages remain positive on select stocks, highlighting strong upside potential across sectors.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-09T03:40:24.066602"
        },
        {
            "title": "Positive Breakout: These 8 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/123776426.cms",
            "description": "In the Nifty200 pack, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on September 8, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-09T03:40:24.066693"
        },
        {
            "title": "Auto ancillaries in focus: Motilal Oswal bets on Apollo Tyres for short-term gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-ancillaries-in-focus-motilal-oswal-bets-on-apollo-tyres-for-short-term-gains/videoshow/123768692.cms",
            "description": "“We like Apollo Tyre stock as the technical structure of this stock seems very strong. The stock has given breakout from its falling trendline resistance with high volumes. Traders can buy for a target of Rs 530 in the near term,” Ruchit Jayantilal Jain, VP, Head – Equity Technical Research at Motilal Oswal Financial Services Limited, said.",
            "pubDate": "2025-09-09T03:40:24.066784"
        },
        {
            "title": "Time to increase risk-quotient? Optimistic & pessimistic statements don’t matter. 7 mid-caps with upside potential of over 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-increase-risk-quotient-optimistic-pessimistic-statements-dont-matter-7-mid-caps-with-upside-potential-of-over-26/articleshow/123776048.cms",
            "description": "Imagine a situation from, say, a decade back. The Union budget is announced. The government cuts excise duty across the board (there is no GST at that time). It also provides a massive tax relief to the middle class. How would the market react? Without a doubt, it would react very positively. Why? Because the excise cut would spur demand and help corporates. The tax cut would give more disposable income to the middle class. Now, the current government has done the same thing. The only difference is that it has not been done in a single budget, but in two budgets. One of which will get implemented on September 22.",
            "pubDate": "2025-09-09T03:40:24.066874"
        },
        {
            "title": "Jane Street faces off with India market regulator in court",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-faces-off-with-india-market-regulator-in-court/articleshow/123776082.cms",
            "description": "Jane Street Group is appealing a SEBI order accusing them of manipulative practices in India's derivatives market. The firm claims SEBI is withholding crucial documents needed for their defense, seeking a halt to regulatory action. The case has significant implications for global quantitative firms operating in India, as the court will consider whether SEBI is obstructing Jane Street's defense.",
            "pubDate": "2025-09-09T03:40:24.066968"
        },
        {
            "title": "Asian stocks rise to track US optimism on Fed cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-to-track-us-optimism-on-fed-cuts/articleshow/123776023.cms",
            "description": "Asian stocks experienced gains on Tuesday, mirroring Wall Street's positive sentiment fueled by anticipation of Federal Reserve rate cuts. Japan and South Korea saw morning trading increases, while Australia's equities dipped. This follows increased expectations of US rate cuts, boosting stocks near record highs.",
            "pubDate": "2025-09-09T03:40:24.067061"
        },
        {
            "title": "Stocks in news: Infosys, Hero MotoCorp, Coal India, Hudco, Voltamp Transformers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-hero-motocorp-coal-india-hudco-voltamp-transformers/articleshow/123770140.cms",
            "description": "The week saw markets open strong but close with moderate gains. Infosys will consider a buyback on September 11. Hudco is set to fund Nagpur Metro with Rs 11,300 crore. TVS Motor will pass on GST cut benefits. PCBL Chemical plans a capacity boost. Coal India explores data centers in old mines.",
            "pubDate": "2025-09-09T03:40:24.067151"
        },
        {
            "title": "Two billion-dollar disruptions, one Reliance: Can Mukesh Ambani deliver?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-billion-dollar-disruptions-one-reliance-can-mukesh-ambani-deliver/articleshow/123777735.cms",
            "description": "Mukesh Ambani's Reliance Industries is embarking on ambitious ventures in AI and FMCG, aiming for significant growth. Reliance Intelligence, a joint venture with Meta and Google, seeks to dominate India's AI landscape. Simultaneously, Reliance Consumer Products targets a staggering ₹1 lakh crore revenue within five years, challenging established FMCG players through strategic acquisitions and brand building.",
            "pubDate": "2025-09-09T04:28:48.617023"
        },
        {
            "title": "Sensex up over 250 pts, Nifty50 above 24,850 on Infosys buyback plans, banks rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-over-300-pts-nifty50-above-24800-on-infosys-buyback-plans-banks-rally/articleshow/123777593.cms",
            "description": "Indian benchmark indices Sensex and Nifty initiated trading on a positive note, fueled by Infosys' potential share buyback. Gains in banking and consumer discretionary stocks further bolstered the market. Optimism surrounding anticipated GST cuts and growing expectations of a U.S. rate cut this month also contributed to the upward momentum.",
            "pubDate": "2025-09-09T04:28:48.617169"
        },
        {
            "title": "Maruti Suzuki, HCL Tech among 8 F&O stocks with sharp OI build-up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-hcl-tech-among-8-fo-stocks-with-sharp-oi-build-up/slideshow/123777454.cms",
            "description": "As of September 8, futures open interest (OI) saw a notable surge in eight stocks from the NSE F&O pack, contributing to a total increase of over 5% compared with the previous session. A significant rise in futures OI indicates growth in the number of active, unexpired contracts for a security. This trend reflects greater participation, with traders either initiating new positions or expanding existing ones.",
            "pubDate": "2025-09-09T04:28:48.617278"
        },
        {
            "title": "SML Isuzu shares in focus as August sales nosedive 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sml-isuzu-shares-in-focus-as-august-sales-nosedive-15/articleshow/123777308.cms",
            "description": "SML Isuzu may be in focus on September 9 after reporting a 15% drop in August sales to 815 units and exports halving to 27, even as production rose 7% to 1,045 units. The update comes as the commercial vehicle maker prepares to rebrand as SML Mahindra, pending shareholder and regulatory approvals.",
            "pubDate": "2025-09-09T04:28:48.617378"
        },
        {
            "title": "Amanta Healthcare shares list at 7% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amanta-healthcare-shares-list-at-7-premium-over-ipo-price/articleshow/123778057.cms",
            "description": "Amanta Healthcare shares: Amanta Healthcare shares debuted with a premium, listing at Rs 135 on NSE and Rs 134 on BSE against an issue price of Rs 126. The Rs 126 crore IPO, a fresh issue, will fund expansion, including a new SteriPort line. Despite strong demand and oversubscription, analysts consider the IPO \"fully priced,\" citing a high price-to-earnings ratio.",
            "pubDate": "2025-09-09T04:43:20.653243"
        },
        {
            "title": "Hindalco, TVS Motor among 5 stocks to buy today for upside of up to 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindalco-tvs-motor-among-5-stocks-to-buy-today-for-upside-of-up-to-17/slideshow/123778051.cms",
            "description": "Indian headline index Nifty ended with minor gains and only a decisive breakout above the 25,000 can determine the direction, says Ajit Mishra, SVP - Research at Religare Broking as he sees support at 24,400–24,600. The D-Street is expected to see sector and stock specific action. ETMarkets has compiled a list of 5 technical and fundamental picks recommended by top brokerages to buy today. Take a look!",
            "pubDate": "2025-09-09T04:43:20.653374"
        },
        {
            "title": "Goel Construction shares surge 5% after listing with 15% premium on BSE SME platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goel-construction-shares-surge-5-after-listing-with-15-premium-on-bse-sme-platform/articleshow/123778718.cms",
            "description": "Goel Construction shares debuted strongly on the BSE SME platform, opening at a 15% premium of Rs 302.50. The IPO witnessed significant investor interest, being oversubscribed across all categories. The company, specializing in industrial and infrastructure projects, reported substantial revenue and profit growth in FY25, supported by a robust order book.",
            "pubDate": "2025-09-09T05:33:29.718414"
        },
        {
            "title": "Infosys buyback makes IT stocks break 5-day losing streak. Should you buy or sell?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-buyback-makes-it-stocks-break-5-day-losing-streak-should-you-buy-or-sell/articleshow/123778689.cms",
            "description": "Indian IT stocks rebounded after a five-day slump, spurred by Infosys' announcement of a potential share buyback on September 11. The Nifty IT index rose by 2%, with Infosys leading gains.",
            "pubDate": "2025-09-09T05:33:29.718551"
        },
        {
            "title": "Nasdaq to Pioneer Tokenised Securities Trading in US",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-to-pioneer-tokenised-securities-trading-in-us/slideshow/123778524.cms",
            "description": "Nasdaq is collaborating with U.S. regulators to introduce trading of tokenised securities. If approved, this would be the first instance of tokenised assets being traded on a major U.S. stock exchange. The move also represents a significant step toward integrating blockchain-based settlement into the national market system. (Source: Reuters)",
            "pubDate": "2025-09-09T05:33:29.718658"
        },
        {
            "title": "Buy, Sell or Hold: Citi maintains sell on Wipro; Antique sees over 50% upside in Ujjivan Small Finance Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-sell-on-wipro-antique-sees-over-50-upside-in-ujjivan-small-finance-bank/articleshow/123778607.cms",
            "description": "Brokerages gave mixed calls on key stocks. Citi maintained a Sell on Wipro, citing weak discretionary spending and competitive dynamics. Nuvama reiterated a Buy on Century Plyboards with a higher target, while Antique sees over 50% upside in Ujjivan Small Finance Bank.",
            "pubDate": "2025-09-09T05:33:29.718761"
        },
        {
            "title": "Hong Kong shares hit 4-year highs buoyed by US rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hk-shares-hit-4-year-highs-buoyed-by-us-rate-cut-bets/articleshow/123778399.cms",
            "description": "Hong Kong stocks hit four-year highs on Fed rate cut hopes, with the Hang Seng up 0.8%, while mainland markets fell as SMIC slumped 9% after an acquisition deal, dragging tech shares. Gold miners gained on rising prices, and Hong Kong property shares surged.",
            "pubDate": "2025-09-09T05:33:29.718877"
        },
        {
            "title": "Samvardhana Motherson among 4 stocks showing RSI Trending Up on September 8",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/samvardhana-motherson-among-4-stocks-showing-rsi-trending-up-on-september-8/slideshow/123778339.cms",
            "description": "Four stocks from the NSE large cap pack were highlighted in the RSI Trending Up scan on September 8, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-09T05:33:29.718978"
        },
        {
            "title": "SpiceJet shares jump 4% after airline completes $24 million payment to Credit Suisse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-jump-4-after-airline-completes-24-million-payment-to-credit-suisse/articleshow/123778223.cms",
            "description": "SpiceJet shares rose sharply after the airline completed a $24 million (approx. Rs 200 crore) payment to Credit Suisse, closing a long-standing liability. The full settlement strengthens its balance sheet, boosts investor confidence, and marks a key step in its turnaround efforts.",
            "pubDate": "2025-09-09T05:33:29.719073"
        },
        {
            "title": "Glenmark shares gain 2% as firm receives $700 million upfront payment from AbbVie deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/glenmark-shares-gain-2-as-firm-receives-700-million-upfront-payment-from-abbvie-deal/articleshow/123778187.cms",
            "description": "Glenmark Pharmaceuticals' shares surged following its subsidiary's $700 million upfront payment from AbbVie for an exclusive licensing agreement concerning IGI's lead drug candidate, ISB 2001. The deal grants AbbVie rights in key markets, while Glenmark retains commercialization in emerging regions.",
            "pubDate": "2025-09-09T05:33:29.719170"
        },
        {
            "title": "Standard Chartered calls for bigger Fed rate cut after weak jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/standard-chartered-calls-for-bigger-fed-rate-cut-after-weak-jobs-data/slideshow/123778979.cms",
            "description": "Standard Chartered now expects the U.S. Federal Reserve to implement a 50-basis-point rate cut at its September policy meeting, doubling its earlier projection of a 25-bps reduction. This revision comes in response to a soft August jobs report, signaling a slowdown in the labor market. (Source: Reuters)",
            "pubDate": "2025-09-09T05:51:01.214119"
        },
        {
            "title": "Anurag Singh sees US tariffs as non-issue for India, calls markets a domestic game",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anurag-singh-sees-us-tariffs-as-non-issue-for-india-calls-markets-a-domestic-game/articleshow/123780191.cms",
            "description": "India remains attractive to global investors despite US tariff concerns. Anurag Singh of ET Now says investors are more focused on US economic issues. He notes India's choice to prioritize its market over US trade demands. Singh advises a balanced investment approach, expecting steady returns. He suggests allocating 20-25% to debt instruments.",
            "pubDate": "2025-09-09T06:57:52.534335"
        },
        {
            "title": "GST cuts put autos back in fast lane, ancillaries also gain: Pankaj Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-cuts-put-autos-back-in-fast-lane-ancillaries-also-gain-pankaj-pandey/articleshow/123780145.cms",
            "description": "The auto sector is poised for further growth, fueled by GST-led price reductions that could boost vehicle volumes by 8-10%, according to Pankaj Pandey, Head of Research. Maruti, M&M, and Ashok Leyland are expected to benefit, along with ancillary stocks like Exide Industries and Apollo Tyres.",
            "pubDate": "2025-09-09T06:57:52.534462"
        },
        {
            "title": "5 IPOs opening tomorrow: Check which one is investors' favourite on GMP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-ipos-opening-tomorrow-check-which-one-is-investors-favourite-on-gmp/slideshow/123779921.cms",
            "description": "Five IPOs are opening tomorrow across mainboard and SME platforms. Grey market premiums (GMP) give the first hint of listing-day excitement. Here’s how they stack up.",
            "pubDate": "2025-09-09T06:57:52.534570"
        },
        {
            "title": "Adani Power shares rally 8% in 2 days. Here’s what’s driving the rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-rally-8-in-2-days-heres-whats-driving-the-rally/articleshow/123780107.cms",
            "description": "Adani Power's stock value increased following a deal with Bhutan's Druk Green Power Corp for a hydroelectric project. The companies will jointly establish a public company in Bhutan. Adani Power shareholders approved a stock split. Each share of Rs 10 will be subdivided into five shares of Rs 2 each.",
            "pubDate": "2025-09-09T06:57:52.534669"
        },
        {
            "title": "Bollywood-linked smallcap zooms 33% in 3 days as Ramesh Damani, Madhu Kela pick up stakes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bollywood-linked-smallcap-zooms-33-in-3-days-as-ramesh-damani-madhu-kela-pick-up-stakes/articleshow/123779987.cms",
            "description": "Prime Focus shares have surged, hitting their upper circuit for the third consecutive session, fueled by investments from marquee investors like Ramesh Damani and Singularity AMC. The media company, known for its VFX work on the upcoming film Ramayana, has seen a 33% increase in stock value in the last three trading sessions.",
            "pubDate": "2025-09-09T06:57:52.534769"
        },
        {
            "title": "MosChip Technologies shares slide 10% after rallying 59% in 7 days. Should you buy the dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/moschip-technologies-shares-slide-10-after-rallying-59-in-7-days-should-you-buy-the-dip/articleshow/123779769.cms",
            "description": "MosChip Technologies shares tumbled 10% on Tuesday following a 59% rally in seven sessions, driven by India’s semiconductor push and strong volumes. While technical indicators suggest overbought conditions, analysts say long-term investors can consider using short-term dips to build positions in the high-growth stock.",
            "pubDate": "2025-09-09T06:57:52.534867"
        },
        {
            "title": "From cement to solar: How GST 2.0 could reprice Adani stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-cement-to-solar-how-gst-2-0-could-reprice-adani-stocks/articleshow/123779601.cms",
            "description": "The Goods and Services Tax reforms are set to benefit Adani Group companies. Tax rate cuts on cement and renewable energy equipment are expected. Ambuja Cements and ACC could see stronger demand. Adani Green Energy may experience lower project costs. Adani Power is poised to gain from reduced coal costs. Adani Ports anticipates higher cargo volumes.",
            "pubDate": "2025-09-09T06:57:52.534959"
        },
        {
            "title": "Morgan Stanley initiates coverage on newly-listed Birla stock, upgrades another",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/morgan-stanley-initiates-coverage-on-newly-listed-birla-stock-upgrades-another/articleshow/123779244.cms",
            "description": "Morgan Stanley is optimistic about Aditya Birla Group's retail ventures, initiating coverage on Aditya Birla Lifestyle Brands Ltd (ABLBL) with an \"Overweight\" rating, projecting a 23% upside. Simultaneously, Aditya Birla Fashion and Retail Ltd (ABFRL) was upgraded to \"Overweight,\" anticipating a 53% potential increase. This upgrade is due to improved profitability.",
            "pubDate": "2025-09-09T06:57:52.535047"
        },
        {
            "title": "Auto stocks add $33 billion in market value on GST relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-stocks-add-33-billion-in-market-value-on-gst-relief/articleshow/123779178.cms",
            "description": "Indian automakers are experiencing a significant boost due to the government's decision to cut consumption taxes, leading to a surge in market value. The reduction in Goods and Services Tax (GST) on passenger vehicles, making them more affordable, is expected to drive demand, particularly during the upcoming festival season. Mahindra & Mahindra, Eicher Motors, and TVS Motor Co.",
            "pubDate": "2025-09-09T06:57:52.535157"
        },
        {
            "title": "France government collapse deepens economic woes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/france-government-collapse-deepens-economic-woes/slideshow/123779183.cms",
            "description": "The rejection of Prime Minister Francois Bayrou's government in a no-confidence vote leaves France, the euro zone’s second-biggest economy, facing weak growth, high borrowing costs, and mounting debt. (Source: Reuters)",
            "pubDate": "2025-09-09T06:57:52.535254"
        },
        {
            "title": "Wall Street penny stock rallies 3000% in 1 day on digital asset play and strategic moves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-penny-stock-rallies-3000-in-1-day-on-digital-asset-play-and-strategic-moves/articleshow/123781691.cms",
            "description": "Eightco Holdings surged over 3,000% in one session after announcing a Worldcoin acquisition backed by OpenAI’s Sam Altman and appointing Wall Street analyst Dan Ives as chairman. The stock’s rally was fueled by a private placement, digital-asset strategy, and investor enthusiasm, highlighting growing market interest in crypto-linked corporate initiatives.",
            "pubDate": "2025-09-09T08:54:47.722626"
        },
        {
            "title": "European shares steady as M&A optimism offsets French political turmoil",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-steady-as-ma-optimism-offsets-french-political-turmoil/articleshow/123781544.cms",
            "description": "European shares remained stable. Merger deals provided initial optimism. This offset political uncertainty in France. Francois Bayrou's ouster impacted market sentiment. Anglo American's shares rose after merger with Teck Resources. Monte dei Paschi di Siena's shares increased following data. Mediobanca's shares also saw gains. Investors are watching President Emmanuel Macron's choice for prime minister.",
            "pubDate": "2025-09-09T08:54:47.722744"
        },
        {
            "title": "Out of favour! Wipro, Asian Paints among 5 stocks with highest ‘sell’ calls in Nifty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/out-of-favour-wipro-asian-paints-among-5-stocks-with-highest-sell-calls-in-nifty/slideshow/123780610.cms",
            "description": "Some of India's top stocks are facing the wrath of analysts with highest sell calls, according to data collated from Trendlyne. However, they present bearish opportunities for investors willing to hunt stocks in Nifty. Here's the list.",
            "pubDate": "2025-09-09T08:54:47.722846"
        },
        {
            "title": "Explained: What Infosys buyback proposal means for 26 lakh shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-infosys-buyback-proposal-means-for-26-lakh-shareholders/articleshow/123781533.cms",
            "description": "Infosys announced a potential share buyback on September 11, sparking renewed investor interest with the stock rising 5% intraday. The buyback could be via tender offer or open market route. Amid declining stock performance and heavy FII selling, the move may support valuations, provide arbitrage opportunities, and boost long-term investor confidence.",
            "pubDate": "2025-09-09T08:54:47.722948"
        },
        {
            "title": "Specialty chemicals: Time to re-look with some bias? 7 chemical stocks with an upside potential of up to 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/specialty-chemicals-time-to-re-look-with-some-bias-7-chemical-stocks-with-an-upside-potential-of-up-to-24/articleshow/123781172.cms",
            "description": "The market is currently swinging between euphoria and uncertainty, caused, respectively, by the GST rate rationalisation and the Trump-imposed tariffs. What do investors do in such a scenario? Well, this is probably a good time to take a long bet. Now, winners are likely to emerge from sectors that are undergoing some transformation. And one such is the chemicals sector. It has been striving, over the past six years or so, to cut dependencies on China and has received some policy support as well. So, it is time to take a look at companies here once again. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks along with detailed company analysis focusing on five key components - earnings, fundamentals, relative valuation, risk and price momentum to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2025-09-09T08:54:47.723043"
        },
        {
            "title": "Sebi says investigation into Jane Street could be wider",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/csays-investigation-into-jane-street-could-be-wider/articleshow/123781068.cms",
            "description": "Securities and Exchange Board of India stated that the investigation and final order on Jane Street could be much wider. SEBI will not release documents not relied upon for the order. Jane Street appealed against SEBI, seeking document release to rebut market manipulation allegations. The hearing started on Tuesday.",
            "pubDate": "2025-09-09T08:54:47.723137"
        },
        {
            "title": "Auto demand set for festival boost; BSE, CAMS good long-term bets: Neeraj Dewan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-demand-set-for-festival-boost-bse-cams-good-long-term-bets-neeraj-dewan/articleshow/123781050.cms",
            "description": "Market expert Neeraj Dewan highlights attractive opportunities for long-term investors across various sectors. He suggests Infosys' buyback is appealing due to better valuations, while railway stocks like RailTel are poised for growth after consolidation. Dewan also notes solid entry points in the auto sector following corrections and favors capital market-linked stocks like BSE, NAM, and CAMS for long-term investment.",
            "pubDate": "2025-09-09T08:54:47.723231"
        },
        {
            "title": "Chinese fighter-jet maker Avic Chengdu stock tumbles nearly 25% in 5 sessions, here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinese-fighter-jet-maker-avic-chengdu-stock-tumbles-nearly-25-in-5-sessions-heres-why/articleshow/123780914.cms",
            "description": "Avic Chengdu shares slumped nearly 25% in five sessions, even as the firm remains China’s largest defence company by market value. The decline coincided with Beijing’s military parade, drawing global attention. Despite the fall, the stock remains up year-to-date, while broader defence indices and peers like Zhuzhou Hongda also weakened.",
            "pubDate": "2025-09-09T08:54:47.723321"
        },
        {
            "title": "Abhay Agarwal identifies 4 sectors as next growth drivers, with India turning tariff threats into reform opportunity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/abhay-agarwal-identifies-4-sectors-as-next-growth-drivers-with-india-turning-tariff-threats-into-reform-opportunity/articleshow/123780967.cms",
            "description": "Abhay Agarwal, Founder of Piper Serica Advisors, said India is converting global tariff uncertainty into reform-driven growth. He sees four sectors—manufacturing, pharma innovation, consumer internet, and financials—as key drivers, with GST cuts boosting festive demand and small banks, NBFCs, and microfinance lenders emerging as beneficiaries.",
            "pubDate": "2025-09-09T08:54:47.723443"
        },
        {
            "title": "Nikkei ends lower on yen strength, profit-taking after crossing 44,000",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nikkei-ends-lower-on-yen-strength-profit-taking-after-crossing-44000/articleshow/123780943.cms",
            "description": "Japan's Nikkei experienced a volatile session, initially surging past 44,000 on hopes of increased government spending following Prime Minister Ishiba's resignation. However, the index reversed course, closing lower due to a strengthening yen, which dampened exporter earnings. While auto tariff reductions with the U.S. offered some positive news, concerns arose over pharmaceuticals and semiconductors.",
            "pubDate": "2025-09-09T08:54:47.723547"
        },
        {
            "title": "Fed could deliver surprise 50 bps cut amid weak jobs data: Steve Englander",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-could-deliver-surprise-50-bps-cut-amid-weak-jobs-data-steve-englander/articleshow/123780837.cms",
            "description": "The BRICS nations face scrutiny, with differing views on their strength. Standard Chartered's Steve Englander discusses BRICS unity amid US policy concerns. He views the US economy as a hedge fund, dependent on tech innovations. Englander highlights risks to the dollar from rising debt. He anticipates aggressive Fed rate cuts, citing a weak labor market.",
            "pubDate": "2025-09-09T08:54:47.723639"
        },
        {
            "title": "SAT tells Sebi to respond to Jane Street's appeal, effectively halting further action",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sat-tells-sebi-to-respond-to-jane-streets-appeal-effectively-halting-further-action/articleshow/123780739.cms",
            "description": "India's Securities Appellate Tribunal has instructed the Securities and Exchange Board of India (SEBI) to justify its refusal to disclose additional documents requested by Jane Street in an ongoing market manipulation case. The tribunal has also temporarily halted personal hearings with the trading firm until the next hearing on November 18. This pause delays a potential confirmatory order from SEBI.",
            "pubDate": "2025-09-09T08:54:47.723730"
        },
        {
            "title": "Microcap Mayhem: 10 stocks crash up to 50% in FY26. Is your portfolio at risk?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/microcap-mayhem-10-stocks-crash-up-to-50-in-fy26-is-your-portfolio-at-risk/slideshow/123780546.cms",
            "description": "Even as the microcap index paints a rosy picture, the underbelly tells a different story. In FY26 so far, 27 Nifty microcap stocks have slipped over 10%, with 10 of them plunging between 20% and 50% — all within just five months.This comes at a time when the broader market is showing strong momentum: the Nifty 50 has gained 5.3%, while the Nifty250 Microcap Index has surged 14.5%. Standout performers like Le Travenues Technology and Gabriel India have even doubled investor wealth during this period. But the sharp divergence in performance across the microcap space is a reminder that not all stocks are riding the same wave — and the risks in the segment remain as real as the rewards. (Data Source: ACE Equity)",
            "pubDate": "2025-09-09T08:54:47.723819"
        },
        {
            "title": "Sebi notifies easier delisting rules for PSUs with 90% govt holding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-notifies-easier-delisting-rules-for-psus-with-90-govt-holding/articleshow/123783429.cms",
            "description": "Sebi has introduced relaxed delisting norms for PSUs where the government holds over 90% stake, excluding banks, NBFCs, and insurance firms. The new rules waive the two-thirds public shareholder approval threshold and offer a fixed-price delisting option with a minimum 15% premium over the floor price.",
            "pubDate": "2025-09-09T09:43:10.729246"
        },
        {
            "title": "Amanta Healthcare shares jump another 5% after a decent debut. Should you book profits or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amanta-healthcare-shares-jump-another-5-after-a-decent-debut-should-you-book-profits-or-hold/articleshow/123783232.cms",
            "description": "Amanta Healthcare shares extended gains after debuting at a 7% premium, reflecting moderate investor optimism despite steep valuations at 46.6x FY25 earnings. The sterile injectables maker plans to use IPO proceeds for capacity expansion under its SteriPort brand and SVP facility. Strong margins, growing exports, and branded generics support growth, though supply risks and competition remain overhangs.",
            "pubDate": "2025-09-09T09:43:10.729376"
        },
        {
            "title": "Explained: Jane Street is fighting back against Sebi. How will this saga play out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-jane-street-is-fighting-back-against-sebi-how-will-this-saga-play-out/articleshow/123782774.cms",
            "description": "Jane Street faces scrutiny from India's Sebi over alleged manipulation in the options market, involving a hefty penalty and trading ban. The firm is appealing to SAT, arguing Sebi withheld exculpatory evidence. The outcome will determine Jane Street's future in India and test Sebi's enforcement transparency, impacting investor confidence in the booming options market.",
            "pubDate": "2025-09-09T09:43:10.729602"
        },
        {
            "title": "Jim Rogers prefers silver over gold, finds India a promising but pricey bet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jim-rogers-prefers-silver-over-gold-finds-india-a-promising-but-pricey-bet/articleshow/123783190.cms",
            "description": "Investor Jim Rogers highlights gold and silver as safe havens amid weakening faith in US treasuries, preferring silver over gold at current levels. He sees India as a promising but pricey equity market, favors agriculture as an emerging investment theme, and remains cautious on global markets due to widespread optimism.",
            "pubDate": "2025-09-09T09:43:10.729699"
        },
        {
            "title": "Gold hits record Rs 1.09 lakh/10g in India; how much higher can it go?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-hits-record-rs-1-09-lakh/10g-in-india-how-much-higher-can-it-go/articleshow/123783662.cms",
            "description": "Gold prices in India surged to Rs 1,09,500 per 10 grams, tracking COMEX highs of $3,700/oz. Driven by Fed rate cut expectations, dollar weakness, and geopolitical risks, analysts see the bull run continuing with further record highs likely.",
            "pubDate": "2025-09-09T09:58:25.404708"
        },
        {
            "title": "Adani Ports, JSW Infra emerge as investor favourites, Jefferies flags strong growth outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-jsw-infra-emerge-as-investor-favourites-jefferies-flags-strong-growth-outlook/articleshow/123783901.cms",
            "description": "Investor appetite for Adani Ports and JSW Infrastructure remains strong, Jefferies said, citing robust growth visibility, logistics synergies, and expansion plans. While investors welcome leverage reduction and capital allocation strategies, valuations remain a key concern with JSWI trading at a steep premium to ADSEZ.",
            "pubDate": "2025-09-09T10:20:23.233922"
        },
        {
            "title": "Market Wrap: Sensex gains 314 points, Nifty above 24,850 on Infosys buyback optimism, consumer stocks rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-gains-314-points-nifty-above-24850-on-infosys-buyback-optimism-consumer-stocks-rally/articleshow/123784424.cms",
            "description": "Indian equities closed higher on Tuesday, fueled by Infosys' share buyback announcement, which boosted IT stocks. Optimism surrounding potential GST cuts and growing expectations of a U.S. interest rate reduction further supported market sentiment. The Sensex and Nifty both gained, with IT and consumer discretionary sectors leading the advance.",
            "pubDate": "2025-09-09T10:48:42.022619"
        },
        {
            "title": "Nifty clings to 24,800 support as markets await breakout; AB Capital, Adani Ports among top picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-clings-to-24800-support-as-markets-await-breakout-ab-capital-adani-ports-among-top-picks/articleshow/123784430.cms",
            "description": "The Indian equity market remains range-bound, with Nifty facing support at 24,600–24,800 and resistance near 25,000. Momentum is weak despite positive cues. Traders are advised to focus on select sectors and resilient stocks like AB Capital and Adani Ports, using appropriate stop losses for short-term trades.",
            "pubDate": "2025-09-09T10:48:42.022757"
        },
        {
            "title": "Stock Radar: Time to buy the falling knife. What should investors do with Cochin Shipyard which is down 35% from highs?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-time-to-buy-the-falling-knife-what-should-investors-do-with-cochin-shipyard-which-is-down-35-from-highs/articleshow/123763792.cms",
            "description": "Cochin Shipyard Ltd, despite being in a bear grip, shows potential for a technical bounce back, supported by its 200-DMA position. Experts suggest high-risk traders consider buying near Rs 1,650, targeting Rs 3,000 within three months, contingent on the stock closing above Rs 1,740. This mid-cap contender could offer significant gains amid India's growing defence and maritime sector.",
            "pubDate": "2025-09-09T11:58:24.573911"
        },
        {
            "title": "BSE CEO optimistic on economy and market; making efforts to deepen derivatives market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-ceo-optimistic-on-economy-and-market-making-efforts-to-deepen-derivatives-market/articleshow/123785512.cms",
            "description": "BSE CEO Sundararaman Ramamurthy says India’s economy is on a strong growth path, supported by domestic investors, rising consumption, and policy reforms. Despite FPI outflows, equity markets remain resilient. IPOs, SME listings, and mutual fund expansion boost market depth, while derivatives growth strengthens participation. Optimism persists for long-term equity gains.",
            "pubDate": "2025-09-09T11:58:24.574035"
        },
        {
            "title": "Vijay Kedia-backed SME IPO to open next week. Check price band and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-backed-sme-ipo-to-open-next-week-check-price-band-and-other-details/articleshow/123785457.cms",
            "description": "TechD Cybersecurity, backed by Vijay Kedia, is launching a Rs 40 crore IPO on NSE Emerge from September 15–17 at Rs 183–193 per share. Proceeds will fund global expansion, talent growth, and India’s largest integrated cybersecurity GSOC in Ahmedabad.",
            "pubDate": "2025-09-09T11:58:24.574141"
        },
        {
            "title": "Explained: What is China's anti-involution shift and how it impacts Indian stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-is-chinas-anti-involution-shift-and-how-it-impacts-indian-stocks/articleshow/123785099.cms",
            "description": "China’s 2025 anti-involution strategy to curb oversupply in steel, solar, and EVs is reshaping global markets. Analysts see upside for Indian stocks like Reliance, Tata Steel, JSW Steel, Hindalco, and Vedanta while EVs show mixed impact and second-order gains may flow to banks and capital goods.",
            "pubDate": "2025-09-09T11:58:24.574247"
        },
        {
            "title": "Midcaps and smallcaps to drive next bull run: Gautam Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcaps-and-smallcaps-to-drive-next-bull-run-gautam-shah/articleshow/123785003.cms",
            "description": "Market expert Gautam Shah believes Indian equities are nearing a breakout after months of stagnation. With strong government reforms, supportive liquidity, and key resistance at 24,850, Nifty could soon test 25,000 and aim for lifetime highs of 26,200.",
            "pubDate": "2025-09-09T11:58:24.574345"
        },
        {
            "title": "Retail investors hit hard: 8 of top 10 most held stocks in red",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-hit-hard-8-of-top-10-most-held-stocks-in-red/articleshow/123784904.cms",
            "description": "Data from the quarter reveals a worrying trend: most retail-favourite stocks have delivered negative returns despite their popularity. However, Tata Motors broke the pattern with a 4.5% gain in Q2FY26, while Tata Steel also managed a 5.7% rise, making them the only two gainers among the top ten.",
            "pubDate": "2025-09-09T11:58:24.574448"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/123790262.cms",
            "description": "Indian markets ended higher as Infosys’ share buyback announcement boosted IT stocks, while consumer discretionary gained on GST optimism. Expectations of a U.S. Fed rate cut further lifted investor sentiment, with Sensex closing at 81,101 and Nifty at 24,869.",
            "pubDate": "2025-09-09T16:19:47.823590"
        },
        {
            "title": "Market Trading Guide: Buy Adani Ports,  Dr Reddy’s and 5 smallcap stocks on Wednesday for short term gains up to 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-adani-ports-dr-reddys-and-5-smallcap-stocks-on-wednesday-for-short-term-gains-up-to-11/slideshow/123790046.cms",
            "description": "Indian headline indices ended with gains today aided by IT and pharma stocks. Nifty remained in a narrow range of 100 points before closing higher. Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities, said that the current sentiments look positive in the short term, with the index sustaining above the 21-EMA for the past few sessions. \"RSI is in a bullish crossover and holding above 50. In the near term, Nifty may move towards 25,000 and beyond, while support on the lower end is placed at 24,750–24,700,\" De said.Here are 7 stock recommendations for Wednesday:",
            "pubDate": "2025-09-09T16:19:47.823706"
        },
        {
            "title": "Jane Street-backed Nebius Group surges 52% intraday after Microsoft pact; 1-year gains top 330%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-backed-nebius-group-surges-52-intraday-after-microsoft-pact-1-year-gains-top-330/articleshow/123789652.cms",
            "description": "Nebius Group N.V. shares surged 52% on Nasdaq after announcing a multi-billion dollar AI infrastructure deal with Microsoft. The agreement ensures long-term committed capacity from Nebius’ new Vineland, New Jersey data center.",
            "pubDate": "2025-09-09T16:19:47.823810"
        },
        {
            "title": "Blue Jet Healthcare OFS opens on Wednesday; promoter to sell up to 6.83% stake, floor price at Rs 675",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blue-jet-healthcare-ofs-opens-on-wednesday-promoter-to-sell-up-to-6-83-stake-floor-price-at-rs-675/articleshow/123789092.cms",
            "description": "Blue Jet Healthcare’s promoter Akshay Bansarilal Arora will sell up to 6.83% equity via an OFS starting September 10–11, at a floor price of Rs 675, marking an 8.2% discount to current levels.",
            "pubDate": "2025-09-09T16:19:47.823906"
        },
        {
            "title": "Dolly Khanna portfolio's smallcap multibagger sets September 17 as record date for final dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dolly-khanna-portfolios-smallcap-multibagger-sets-september-17-as-record-date-for-final-dividend/articleshow/123788504.cms",
            "description": "Prakash Industries has set September 17 as the record date for its Rs 1.50 per share dividend. Despite recent underperformance, the Dolly Khanna and Mukul Agrawal-backed multibagger has delivered 255% returns over five years.",
            "pubDate": "2025-09-09T16:19:47.824019"
        },
        {
            "title": "EBITDA Jump: BSE, Dixon Tech, Waaree Energies shine in June quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ebitda-jump-bse-dixon-tech-waaree-energies-shine-in-june-quarter/slideshow/123788419.cms",
            "description": "Quarterly EBITDA growth suggests that companies are seeing higher earnings before interest, taxes, depreciation, and amortization, indicating enhanced profitability and operational efficiency. Among the Nifty 200 segment, these 8 stocks have recorded over 70% EBITDA growth in the June '25 quarter compared to the same period last year, according to StockEdge profitability scan.",
            "pubDate": "2025-09-09T16:19:47.824124"
        },
        {
            "title": "US stocks tick slightly higher in run-up to employment revision figures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-slightly-higher-in-run-up-to-employment-revision-figures/articleshow/123788147.cms",
            "description": "Wall Street indexes experienced a slight uptick at the opening bell on Tuesday, building on the momentum from the previous day's near-record closing levels. Investors are proceeding with caution as they await the upcoming revision of the employment rate. The Dow, S&P 500, and Nasdaq Composite all registered gains in early trading.",
            "pubDate": "2025-09-09T16:19:47.824217"
        },
        {
            "title": "Japan's Sumitomo Mitsui to exit Kotak Mahindra Bank through Rs 6,166 crore block deal: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-sumitomo-mitsui-to-exit-kotak-mahindra-bank-through-rs-6166-crore-block-deal-report/articleshow/123787851.cms",
            "description": "Sumitomo Mitsui is set to divest its 1.65% stake in Kotak Mahindra Bank through a block deal valued at Rs 6,166 crore, offered at a 4% discount. Despite this sale, brokerages maintain a positive outlook on Kotak, citing strong fundamentals and growth potential. Axis Securities reiterates a BUY call, anticipating credit growth and margin recovery.",
            "pubDate": "2025-09-09T16:19:47.824314"
        },
        {
            "title": "Neilsoft, Prozeal Green Energy get Sebi nod for IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/neilsoft-prozeal-green-energy-get-sebi-nod-for-ipos/articleshow/123787774.cms",
            "description": "Sebi has approved IPOs of Prozeal Green Energy and Neilsoft. Prozeal aims to raise Rs 700 crore to fund working capital, debt repayment, and expansion in renewable energy. Neilsoft’s Rs 90 crore fresh issue will support capital expenditure. Both firms seek growth from India’s renewable and engineering R&D opportunities.",
            "pubDate": "2025-09-09T16:19:47.824409"
        },
        {
            "title": "Eicher Motors shares up 22% in a month. Will GST-led premiumisation drive further upside?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eicher-motors-shares-up-22-in-a-month-will-gst-led-premiumisation-drive-further-upside/articleshow/123787513.cms",
            "description": "Eicher Motors gained over 22% in the past month, with Bank of America Securities raising its target to Rs 7,500, citing GST rate cuts, rising premium demand, rural financing support, and brand pull. The brokerage expects Eicher to remain a key beneficiary of the two-wheeler upcycle alongside TVS.",
            "pubDate": "2025-09-09T16:19:47.824502"
        },
        {
            "title": "TVS Motor, Maruti among 5 auto stocks that hit 52-week highs & rallied up to 22% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-maruti-among-5-auto-stocks-that-hit-52-week-highs-amp-rallied-up-to-22-in-a-month/slideshow/123787231.cms",
            "description": "On Tuesday, the benchmark Sensex surged by about 314 points, closing at 81,101. Fueled by a broad-based market rally, five stocks from the BSE Auto index surged to their 52-week highs — marking their highest levels in a year. These breakouts are often viewed by traders and investors as bullish signals, indicating strong upward momentum and the potential for further upside.",
            "pubDate": "2025-09-09T16:19:47.824593"
        },
        {
            "title": "Sebi comes out with simplified 'disclosure document' format for portfolio managers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-comes-out-with-simplified-disclosure-document-format-for-portfolio-managers/articleshow/123786974.cms",
            "description": "To facilitate ease of doing business, markets regulator Sebi on Tuesday came out with a simplified format for disclosure documents for portfolio managers.",
            "pubDate": "2025-09-09T16:19:47.824681"
        },
        {
            "title": "NSE appoints Srinivas Injeti as Chairman of company's board",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-appoints-srinivas-lnjeti-as-chairman-of-companys-board/articleshow/123786777.cms",
            "description": "The National Stock Exchange (NSE) has appointed retired IAS officer Srinivas Injeti as its new Chairperson. Backed by SEBI approval, Injeti brings four decades of regulatory, governance, and financial services experience, including leading reforms in insolvency, competition, and corporate laws.",
            "pubDate": "2025-09-09T16:19:47.824770"
        },
        {
            "title": "Wealth creation: Two words, ‘just hold’, make it easier. 12 large-cap stocks from different sectors which fit the bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-creation-two-words-just-hold-make-it-easier-12-large-cap-stocks-from-different-sectors-which-fit-the-bill/articleshow/123791021.cms",
            "description": "Stock markets are a theatre of constant buying and selling, but real wealth is often built in the quieter act of holding. There are stretches when the wisest move isn’t a trade – it’s conviction. Spend your energy on finding businesses with durable advantages, clean balance sheets, and steady cash flows, then let time do the compounding. Headlines will swing from panic to euphoria and back again; good companies won’t. You don’t need to guess the next move on the world stage to create wealth; you need to own the right stocks and hold them long enough for the story to play out. Remember: There is and will never be a dearth of noise on the street.",
            "pubDate": "2025-09-09T17:36:23.827633"
        },
        {
            "title": "630% in 5 years: Citigroup, UTI MF, others buy the dip in this smallcap via Rs 360-crore bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/630-in-5-years-citigroup-uti-mf-others-buy-the-dip-in-this-smallcap-via-rs-360-crore-bulk-deal/articleshow/123790615.cms",
            "description": "Citigroup purchased 57,000 shares of Voltamp Transformers in a bulk deal on Tuesday. Other institutional investors such as Aditya Birla Sun Life and others acquired equity in the block deal amounting to Rs 364 crore. Voltamp Transformers shares closed lower today.",
            "pubDate": "2025-09-09T17:36:23.827748"
        },
        {
            "title": "Two Trades for Today: An infotech major for a 7.01% rise, a large-cap pharma stock for almost 7% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-infotech-major-for-a-7-01-rise-a-large-cap-pharma-stock-for-almost-7-upmove/articleshow/123790669.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-09T17:36:23.827940"
        },
        {
            "title": "Stock Radar: Jewellery bellwether Titan positioned for medium-term rally as charts indicate strength above support levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-jewellery-bellwether-titan-positioned-for-medium-term-rally-as-charts-indicate-strength-above-support-levels/articleshow/123783732.cms",
            "description": "Titan Company Ltd, after rebounding from its 100-DMA and 200-DMA tests in August 2025, shows potential for new highs. Experts suggest medium-term traders consider buying the stock within Rs 3,550-3,750 range, targeting Rs 4,190 over the next 2-4 months. A stop loss can be placed below Rs 3,490.",
            "pubDate": "2025-09-09T23:57:02.283585"
        }
    ]
}