{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-25T23:42:28.379601",
    "items": [
        {
            "title": "Stock Market Christmas 2025 Holiday: NSE, BSE will be closed for Christmas celebration; check holiday list for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-christmas-2025-holiday-nse-bse-will-be-closed-for-christmas-celebration-check-holiday-list-for-2026/articleshow/126169119.cms",
            "description": "Christmas 2025 Stock Market Holiday: NSE and BSE are closed for trading today due to the Christmas holiday. The commodity exchanges MCX and NCDEX will also take a day's break and resume trading on Friday.",
            "pubDate": "2025-12-25T02:32:28.479682"
        },
        {
            "title": "Order pipeline to keep LTIMindtree in good books",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/order-pipeline-to-keep-ltimindtree-in-good-books/articleshow/126169673.cms",
            "description": "LTIMindtree has seen its stock soar by 18% over the last quarter, surpassing the broader IT index. Recently reported new order bookings have exceeded market expectations, leading analysts to adjust their target prices upwards. The company has also demonstrated sequential revenue and net profit growth, alongside enhanced operating margins attributed to efficiency improvements.",
            "pubDate": "2025-12-25T03:48:58.066322"
        },
        {
            "title": "Two-thirds of Nifty 500 stocks trade in overvalued zone",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-thirds-of-nifty-500-stocks-trade-in-overvalued-zone/articleshow/126169643.cms",
            "description": "A study by Omniscience Capital reveals that nearly 65% of India's Nifty 500 stocks are overvalued, with the index trading at a high P/E ratio relative to its growth prospects. While financials, utilities, industrials, and energy sectors appear attractively positioned, consumer staples, healthcare, and IT sectors show overvaluation.",
            "pubDate": "2025-12-25T03:48:58.066422"
        },
        {
            "title": "Metal rally lifts Hind Copper, Hind Zinc to fresh highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metal-rally-lifts-hind-copper-hind-zinc-to-fresh-highs/articleshow/126169322.cms",
            "description": "Hindustan Copper and Hindustan Zinc shares reached new highs on Wednesday, driven by global metal rallies. Hindustan Copper's surge is attributed to tightening global copper supplies and rising demand from new-age sectors, while Hindustan Zinc benefits from a sharp increase in silver prices, a key by-product for the company.",
            "pubDate": "2025-12-25T03:48:58.066580"
        },
        {
            "title": "Consolidation before the next rally? What charts say on Nifty, New Years picks and sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/consolidation-before-the-next-rally-what-charts-say-on-nifty-new-years-picks-and-sectors/articleshow/126170084.cms",
            "description": "Indian equity markets are showing a bullish technical setup despite recent range-bound trading. Analysts suggest Nifty may consolidate before a potential move higher, with mid-caps showing signs of revival. Railway stocks are gaining interest ahead of the Union Budget, while IT and FMCG sectors remain constructive.",
            "pubDate": "2025-12-25T04:25:13.233056"
        },
        {
            "title": "Why the AI rally (and the bubble talk) could continue next year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-the-ai-rally-and-the-bubble-talk-could-continue-next-year/articleshow/126169943.cms",
            "description": "The AI revolution is fueling a massive investment boom, with some experts warning of an inevitable bubble.  Transformative technologies historically lead to asset inflation, and AI's rapid integration into markets and the economy is no exception.  Concerns are rising as AI's impact on GDP growth and market valuations intensifies.",
            "pubDate": "2025-12-25T04:25:13.233176"
        },
        {
            "title": "5 Adani stocks that rose up to 36% in 2025 in a mixed year for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-adani-stocks-that-rose-up-to-36-in-2025-in-a-mixed-year-for-investors/slideshow/126170283.cms",
            "description": "Even as volatility stayed high across Indian equities in 2025, a handful of Adani Group stocks managed to end the year in the green. While several group companies struggled to regain momentum, five listed Adani stocks delivered positive returns, with gains of up to 36% over the year. Here is a snapshot of the five Adani companies that rewarded shareholders in 2025.",
            "pubDate": "2025-12-25T05:14:25.170627"
        },
        {
            "title": "Reliance Jio, NSE, PhonePe among top 10 IPOs to watch out for in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-jio-nse-phonepe-among-top-10-ipos-to-watch-out-for-in-2026/articleshow/126170212.cms",
            "description": "India’s primary market is gearing up for a blockbuster 2026, with over 190 companies either approved or awaiting clearance from Sebi to raise more than Rs 2.5 lakh crore through IPOs. From Reliance Jio and NSE to Flipkart and PhonePe, several marquee names are expected to shape market sentiment next year.",
            "pubDate": "2025-12-25T05:14:25.170740"
        },
        {
            "title": "Santa rally unwrapped: 12 stocks surge 100%–500% since last Christmas",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/santa-rally-unwrapped-12-stocks-surge-100500-since-last-christmas/slideshow/126170179.cms",
            "description": "Since last Christmas, the Sensex has quietly climbed about 9%. Beneath that steady rise, a select group of BSE stocks has delivered eye-catching gains. In some cases, a few of these stocks have multiplied investor wealth by more than 2.5 times in a single year.",
            "pubDate": "2025-12-25T05:14:25.170838"
        },
        {
            "title": "Explained: Sebi eases norms for duplicate securities, increases limit, and simplifies documentation. 5 things to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-sebi-eases-norms-for-duplicate-securities-increases-limit-and-simplifies-documentation-5-things-to-know/articleshow/126170541.cms",
            "description": "The Securities and Exchange Board of India has doubled the monetary threshold for simplified documentation when issuing duplicate securities. Investors holding securities valued up to Rs 10 lakh will now face fewer procedural burdens. This move aims to ease compliance and remove inconsistencies. Notarisation of the Affidavit-cum-Indemnity Bond is also waived for securities up to Rs 10,000.",
            "pubDate": "2025-12-25T05:41:02.710009"
        },
        {
            "title": "Stocks to buy on Friday: Jio Financial, APL Apollo, 3 more scrips offer up to 16% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-on-friday-jio-financial-apl-apollo-3-more-scrips-offer-up-to-16-upside/articleshow/126171464.cms",
            "description": "Markets closed for Christmas, but five broker-recommended stocks offer 7%-16% upside. Key picks include Jio Financial Services, APL Apollo, CEAT, Godrej Consumer, and Belrise Industries. Technical indicators suggest potential breakouts and steady accumulation, making these stocks noteworthy for short-to-medium-term investors.",
            "pubDate": "2025-12-25T07:29:14.895945"
        },
        {
            "title": "Stocks to buy on Friday: Jio Financial, APL Apollo, 3 more scrips offer up to 16% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-on-friday-jio-financial-apl-apollo-3-more-scrips-offer-up-to-16-upside/slideshow/126172400.cms",
            "description": "With stock markets closed today on account of the Christmas holiday, investors may consider tracking these five stocks recommended by various brokerages ahead of the resumption of trade on Friday. Jio Financial Services stands out as a Christmas pick with an upside potential of 16%, while APL Apollo, CEAT, Godrej Consumer Products, and Belrise Industries also offer short-to-medium-term upside of up to 16%. Take a look!",
            "pubDate": "2025-12-25T09:53:56.343866"
        },
        {
            "title": "Market Trading Guide: PNB Housing, IIFL Finance are top stocks to buy on Friday for up to 10% gains. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-pnb-housing-iifl-finance-are-top-stocks-to-buy-on-friday-for-up-to-10-gains-heres-why/slideshow/126172267.cms",
            "description": "Nifty ended its three-session winning streak on Wednesday amid selling pressure in IT and consumer stocks. The benchmark index witnessed volatility and low volumes ahead of the Christmas holiday on Thursday, December 25. Siddhartha Khemka, Head of Research, Wealth Management at Motilal Oswal Financial Services, said Nifty's marginally lower ending was due to profit booking in select sectors. \"Overall, we expect Indian equities to trade in a narrow range this week amid a lack of triggers and reduced trading activity due to holidays across several global markets,\" he said.Here are 2 stock recommendations for Friday:",
            "pubDate": "2025-12-25T09:53:56.343990"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/126172222.cms",
            "description": "Indian markets ended lower in thin pre-Christmas trade as foreign selling and a lack of triggers weighed on sentiment, with Sensex and Nifty slipping marginally. Analysts said trading remained subdued in the holiday-shortened week, though RBI liquidity steps may support markets amid mixed global cues.",
            "pubDate": "2025-12-25T09:53:56.344118"
        },
        {
            "title": "LIC books profit in Hindustan Copper, cuts 2% stake in four months as stock rallies 76% in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-books-profit-in-hindustan-copper-cuts-2-stake-in-four-months-as-stock-rallies-76-in-2025/articleshow/126172160.cms",
            "description": "LIC has cut its stake in Hindustan Copper by 2% through open-market sales between August and December, reducing its holding to about 4.1%.",
            "pubDate": "2025-12-25T09:53:56.344220"
        },
        {
            "title": "Jaipur masala company becomes 5th most subscribed SME IPO ever; Rs 38 cr issue draws Rs 25,000 crore bids",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jaipur-masala-company-becomes-5th-most-subscribed-sme-ipo-ever-rs-38-cr-issue-draws-rs-25000-crore-bids/articleshow/126173223.cms",
            "description": "Shyam Dhani Industries’ SME IPO drew bids worth Rs 25,000 crore, making it the most subscribed SME issue of 2025 and the fifth highest ever.",
            "pubDate": "2025-12-25T11:17:21.405038"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/126175207.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-25T14:48:14.949950"
        },
        {
            "title": "Two Trades for Today: A PSU mining enterprise for a 9.1% surge; a  mid-cap financial services stock for an almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-psu-mining-enterprise-for-a-9-1-surge-a-mid-cap-financial-services-stock-for-an-almost-6-gain/articleshow/126174876.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-25T14:48:14.950075"
        },
        {
            "title": "These large- and mid-cap stocks can give more than 25% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-and-mid-cap-stocks-can-give-more-than-25-return-in-1-year-according-to-analysts/articleshow/126175762.cms",
            "description": "If the year-end stock market volatility is worrying you, just consider three things. Year-end adjustment of books is underway; an earnings season is set to start; and valuations are not cheap. Also, the market is sitting with the gains accumulated after the August 2025 announcement of the GST rate rationalisation. Given these factors, some more profit-booking in the extreme short term can be expected. So, when looking at stocks, be cautious, don't leverage, check what the management said in the Q2 results about the business, and, finally, focus on giving due importance to earnings and the quarterly business update which some companies will start to give in the coming days.",
            "pubDate": "2025-12-25T17:12:45.730040"
        },
        {
            "title": "Stock Radar: Phoenix Mills stock moving in an upward sloping channel; hits fresh 52-week high in December 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-phoenix-mills-stock-moving-in-an-upward-sloping-channel-hits-fresh-52-week-high-in-december-2025/articleshow/126157799.cms",
            "description": "Phoenix Mills Ltd stock is on an upward trajectory. It broke out of a symmetrical triangle in August and is now in a rising channel. Experts see potential for the stock to reach Rs 1,950 to Rs 2,000 in the coming months. Traders can consider buying the stock. A close below Rs 1,700 would signal a change in trend.",
            "pubDate": "2025-12-25T23:42:27.648243"
        }
    ]
}