{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-10T17:00:17.370145",
    "items": [
        {
            "title": "Asian stocks fluctuate as US jobs outlook cools",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fluctuate-as-us-jobs-outlook-cools/articleshow/123797446.cms",
            "description": "Asian stocks showed mixed performance as investors await key inflation data that could influence the Federal Reserve's rate cut decisions. Hopes for rate cuts were fueled by signs of a cooling US labor market, even as geopolitical tensions in the Middle East pushed oil prices higher. Traders are also monitoring potential trade actions and economic data from China.",
            "pubDate": "2025-09-10T01:13:52.662043"
        },
        {
            "title": "Legal tangles could stall Vedanta-JAL deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/legal-tangles-could-stall-vedanta-jal-deal/articleshow/123797437.cms",
            "description": "Vedanta has won the bid for Jaiprakash Associates. The deal worth Rupees 12,505 crore may face hurdles. Legal battles over asset ownership are a concern. Disputes with Yamuna Expressway Authority are ongoing. There are issues with pledged shares in Bhilai Jaypee Cement. Promoter Manoj Gaur's guarantees add complexity. The resolution process could face court challenges.",
            "pubDate": "2025-09-10T01:13:52.662172"
        },
        {
            "title": "These 9 banking stocks from the private and public sectors may have an upside potential of up to 32% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-banking-stocks-from-the-private-and-public-sectors-may-have-an-upside-potential-of-up-to-32-in-1-year/articleshow/123797349.cms",
            "description": "It is often said on the street that banking stocks reflect what is happening in the economy. Why? One example to put this in perspective: 100% of HCV/LCV sales take place on credit. A majority of cars are also financed. Similarly, with two-wheelers; much of the sales are financed. Now all these categories reflect a part of the economy. HCV/LCVs sales suggest greater movement of goods and services. Cars move people and have an aspirational value. Two-wheelers move the common man. And the common connection? They are all financed. Who provides finance? Banks or NBFCs. And who finances NBFCs, directly or indirectly ? Yes, banks.",
            "pubDate": "2025-09-10T01:13:52.662382"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123790452.cms",
            "description": "Indian equity markets closed higher on Tuesday, propelled by gains in IT, pharma, and FMCG sectors. Technically, Nifty maintained its position above key EMAs, suggesting a continued short-term uptrend. However, analysts suggest potential consolidation or profit booking if the index fails to sustain above 25,000, with immediate support around 24,620.",
            "pubDate": "2025-09-10T01:13:52.662486"
        },
        {
            "title": "Stocks in news: Vodafone Idea, Kotak Bank, Bajaj Auto, Blue Jet, Bikaji Foods",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vodafone-idea-kotak-bank-bajaj-auto-blue-jet-bikaji-foods/articleshow/123790383.cms",
            "description": "Markets saw gains amid weekly expiry, with several companies in focus. Prakash Industries declared a dividend, while Blue Jet Healthcare's promoter will sell shares via OFS. Sumitomo Mitsui plans to sell its stake in Kotak Mahindra Bank, and Bajaj Auto will pass on GST reductions to customers. Vodafone Idea is challenging AGR demands in the Supreme Court.",
            "pubDate": "2025-09-10T01:13:52.662591"
        },
        {
            "title": "SAT asks Sebi to explain why it withheld documents from Jane Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sat-asks-sebi-to-explain-why-it-withheld-documents-in-jane-street-case/articleshow/123797286.cms",
            "description": "The Securities Appellate Tribunal (SAT) has directed SEBI to explain why it withheld documents from Jane Street, a US trading firm accused of manipulating the Indian derivatives market. SAT has also halted in-person hearings in the case until further notice.",
            "pubDate": "2025-09-10T01:13:52.662685"
        },
        {
            "title": "Will Infosys' share buyback boost investor confidence?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-infosys-share-buyback-boost-investor-confidence/articleshow/123797239.cms",
            "description": "Infosys' share buyback announcement has historically boosted its stock performance, raising investor optimism. On Tuesday, Infosys shares surged 5% following the buyback declaration, with the Nifty IT index climbing 2.8%. This marks the IT firm's fifth buyback, aiming to counter a 20% stock decline this year amid US slowdown worries.",
            "pubDate": "2025-09-10T01:13:52.662802"
        },
        {
            "title": "Bank finance for projects: Gujarat and Maharashtra in an investment league of their own",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-finance-for-projects-gujarat-and-maharashtra-in-an-investment-league-of-their-own/articleshow/123797319.cms",
            "description": "Gujarat has remained the top state in attracting investments as it got the most number for projects in each year between FY15 and FY25, while Maharashtra has retained the second place for the last four fiscal years, showed data available in a study by the Reserve Bank of India (RBI) staff.",
            "pubDate": "2025-09-10T01:13:52.662995"
        },
        {
            "title": "SWIFT wants to speed up cross-border transactions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swift-wants-to-speed-up-cross-border-transactions/articleshow/123797321.cms",
            "description": "Delays occur because many Indian banks contact the receiver before crediting their account to confirm the payment, or re-verify final account details. In addition, differences in how institutions update tracking information or credit client accounts-often tied to batch processing in back-office systems-slow down deals.",
            "pubDate": "2025-09-10T01:13:52.663084"
        },
        {
            "title": "Slower transmission, risk meter keep borrowing cost high for most MFIs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/slower-transmission-risk-meter-keep-borrowing-cost-high-for-most-mfis/articleshow/123797324.cms",
            "description": "Despite policy rate cuts, banks are hesitant to significantly lower lending rates to microfinance institutions due to lingering asset quality concerns and internal margin pressures. Smaller MFIs face tightened purse strings and higher risk premiums, hindering their access to crucial funding.",
            "pubDate": "2025-09-10T01:13:52.663446"
        },
        {
            "title": "European shares rise as Inditex leads retailers, Novo Nordisk shines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-as-inditex-leads-retailers-novo-nordisk-shines/articleshow/123804422.cms",
            "description": "European shares experienced a rise, propelled by strong performances in the retail sector, particularly Inditex, which reported accelerated sales. Novo Nordisk also saw gains following its restructuring announcement, including workforce reductions, aimed at enhancing competitiveness. Tech stocks contributed to the positive sentiment, with SAP and ASML climbing after Oracle's optimistic cloud order projections.",
            "pubDate": "2025-09-10T08:48:05.042202"
        },
        {
            "title": "Goldman Sachs India portfolio slips, but 5 stocks rally 50-100% in 5 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-india-portfolio-slips-but-5-stocks-rally-50-100-in-5-months/slideshow/123804641.cms",
            "description": "Goldman Sachs’ Indian equity portfolio, managed through its global funds, has experienced a notable 14% decline in value over the past six months, slipping from Rs 11,940 crore in March to Rs 10,326 crore as of September 10. Despite this overall downturn, several select stocks within the portfolio have defied the trend, delivering spectacular gains for investors.The fund’s holdings encompass shares in 50 listed Indian companies, collectively valued at over Rs 10,000 crore. While the macro equity market environment has posed challenges, nearly half of these stocks—24 in total—have generated double-digit returns in the current fiscal year (FY26) alone. Among these winners, ten stocks have demonstrated exceptional performance, with price rallies ranging between 30% and 100% in just over five months. Leading the pack is Netweb Technologies India, which has emerged as a multibagger stock by surging an impressive 102% during this period.(Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-09-10T08:48:05.042336"
        },
        {
            "title": "Japan's Nikkei tracks Wall Street higher; Kansai Electric surges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-tracks-wall-street-higher-kansai-electric-surges/articleshow/123804313.cms",
            "description": "Japan's Nikkei hits a record high, mirroring Wall Street's positive trend. Technology stocks led the surge. Investors are closely watching economic data for potential shifts in central bank policies in both the United States and Japan. SoftBank Group and Furukawa Electric saw significant gains. Sumitomo Pharma and Mazda Motor experienced losses. The focus remains on the 44,000 level.",
            "pubDate": "2025-09-10T08:48:05.042441"
        },
        {
            "title": "Shrimp & fisheries stocks: Out of troubled waters? It’s both No and Yes. 4 stocks to keep an eye on, but for the right reason",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shrimp-fisheries-stocks-out-of-troubled-waters-its-both-no-and-yes-4-stocks-to-keep-an-eye-on-but-for-the-right-reason/articleshow/123803517.cms",
            "description": "The European Union has green-lighted exports from 102 additional Indian marine establishments. Result: All stocks related to aquaculture and fisheries have seen a bump up. Now, this is not the first time that these stocks have moved up in unison. In the past two years, there have been a couple of times when this has happened. But the rallies have failed to sustain because the headwinds just kept coming. The latest headwind is the US tariff, with the aquaculture sector being the hardest hit. So, the EU decision is surely a welcome one. But does it mean that all the sector’s troubles are over? Probably not. Interestingly, though, this development probably signals something else.",
            "pubDate": "2025-09-10T08:48:05.042547"
        },
        {
            "title": "Why CarTrade Tech shares crashed 19% today? Here’s what triggered the sell-off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-cartrade-tech-shares-crashed-19-today-heres-what-triggered-the-sell-off/articleshow/123803491.cms",
            "description": "CarTrade Tech shares plunged 18.7% after JM Financial downgraded the stock to ‘Sell’ and cut its target price to Rs 1,910, citing rich valuations, B2B revenue dependence, and structural risks from generative AI adoption. Shares partially recovered, trading 10% lower amid volatile market sentiment.",
            "pubDate": "2025-09-10T08:48:05.042652"
        },
        {
            "title": "Nepal turmoil a minor hurdle, GST cuts to lift FMCG growth: Abneesh Roy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nepal-turmoil-a-minor-hurdle-gst-cuts-to-lift-fmcg-growth-abneesh-roy/articleshow/123803366.cms",
            "description": "Political unrest in Nepal poses only a minor risk to FMCG firms, says Abneesh Roy, noting exposure is limited. He expects GST cuts and recovering paint demand to drive stronger consumption and margins in H2, cushioning near-term pressures from floods and Nepal’s instability.",
            "pubDate": "2025-09-10T08:48:05.042774"
        },
        {
            "title": "OFSS shares rally over 9%, mirroring parent Oracle’s surge on cloud boom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ofss-shares-rally-over-9-mirroring-parent-oracles-surge-on-cloud-boom/articleshow/123803318.cms",
            "description": "Shares of Oracle Financial Services Software (OFSS) rallied over sharply after parent Oracle’s U.S. stock soared on a blockbuster cloud forecast. Oracle’s multi-billion-dollar client wins and aggressive expansion in multi-cloud services boosted optimism that OFSS will benefit from higher license and cloud revenue growth.",
            "pubDate": "2025-09-10T08:48:05.042876"
        },
        {
            "title": "Infosys shares up 7% in 2 days; can it rally more after tomorrow's buyback announcement?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-up-7-in-2-days-can-it-rally-more-after-tomorrows-buyback-announcement/articleshow/123803118.cms",
            "description": "Infosys shares experienced a 2% surge, reaching Rs 1,535 on the BSE, ahead of its fifth share buyback meeting. Historically, Infosys shares have generally risen following buyback announcements. Market experts suggest that current valuations are more appealing, with the stock consolidating at lower levels.",
            "pubDate": "2025-09-10T08:48:05.042974"
        },
        {
            "title": "US consumers stay financially strong despite cooling job market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-consumers-stay-financially-strong-despite-cooling-job-market/slideshow/123803022.cms",
            "description": "Top U.S. banks report that consumers remain financially healthy, with little evidence of credit quality deterioration despite a cooling job market. Spending continues steadily, and most consumers are paying their debts on time.",
            "pubDate": "2025-09-10T08:48:05.043069"
        },
        {
            "title": "FMCG, IT and pharma facing slowdown; new growth may come from privatisation: Manish Chokhani",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fmcg-it-and-pharma-facing-slowdown-new-growth-may-come-from-privatisation-manish-chokhani/articleshow/123802772.cms",
            "description": "Manish Chokhani of Enam Holdings cautions that Indian equities, particularly in FMCG, IT, and pharma, face potential derating without innovation and business model changes. He highlights overvaluation in high-growth sectors like QSR and EMS, while suggesting opportunities in PSU privatization. India needs new growth drivers to avoid a prolonged market consolidation.",
            "pubDate": "2025-09-10T08:48:05.043166"
        },
        {
            "title": "Markets cheer as Trump-Modi trade talk optimism boosts sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-cheer-as-trump-modi-trade-talk-optimism-boosts-sentiment/articleshow/123802703.cms",
            "description": "US and India trade talks show promise. Donald Trump and Narendra Modi are highlighting progress. A deal may finalize by November. Market expert Chakri Lokapriya sees benefits for IT, pharma, and auto sectors. Export sectors are likely to gain first. GST cuts will boost consumption. Auto and tyre companies are well-positioned.",
            "pubDate": "2025-09-10T08:48:05.043260"
        },
        {
            "title": "Markets likely to see long-term gains despite near-term volatility: Anshul Saigal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-likely-to-see-long-term-gains-despite-near-term-volatility-anshul-saigal/articleshow/123802663.cms",
            "description": "Equity markets remain range-bound at 24,800–25,000, with short-term pullbacks amid foreign investor selling and tariff concerns. Anshul Saigal of Saigal Capital says long-term growth remains intact, advising investors to focus on strong businesses. While IT valuations appear expensive with weak growth, opportunities are better in defence, renewables, banking, capital goods, and manufacturing.",
            "pubDate": "2025-09-10T08:48:05.043353"
        },
        {
            "title": "IT buybacks lift market sentiment; midcaps and consumption stocks in focus: Narendra Solanki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-buybacks-lift-market-sentiment-midcaps-and-consumption-stocks-in-focus-narendra-solanki/articleshow/123802624.cms",
            "description": "Investor enthusiasm has surged in the Indian IT sector, spurred by buyback announcements. Experts believe the downside is limited, with potential for improvement in the second half, particularly in BFSI. Mid-cap IT stocks are favored over large caps due to attractive valuations.",
            "pubDate": "2025-09-10T08:48:05.043444"
        },
        {
            "title": "Adani Power shares jump 8% in 3 days. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-jump-8-in-3-days-heres-why/articleshow/123802515.cms",
            "description": "Adani Power's stock is rising. This is due to a new hydroelectric project in Bhutan and the company's first stock split. Adani Power signed an agreement with Druk Green Power Corp for the Bhutan project. The stock split aims to improve liquidity. GST reforms are also expected to boost Adani Power's margins. Technical indicators suggest short-term strength for the stock.",
            "pubDate": "2025-09-10T08:48:05.043539"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Spread in Nifty to capitalize on positive outlook amid volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-capitalize-on-positive-outlook-amid-volatility/articleshow/123802248.cms",
            "description": "The Nifty index saw a gap-up opening on Tuesday. It experienced volatility within a narrow range. Resistance was met at 24,900. The index closed with gains. Chandan Taparia suggests a Bull Call Spread strategy. Option data indicates a trading range between 24,300 and 25,300. Immediate range is expected between 24,600 and 25,100 levels. Market participants may consider the strategy.",
            "pubDate": "2025-09-10T08:48:05.043634"
        },
        {
            "title": "Oracle shares rise 31% on $500-billion cloud revenue prospects",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-shares-rise-31-on-500-billion-cloud-revenue-prospects/articleshow/123801962.cms",
            "description": "Oracle's shares experienced a significant surge, climbing 31% in Frankfurt following the company's projection of its Oracle Cloud Infrastructure business exceeding half a trillion dollars in booked revenue. This positive outlook also influenced European markets, with German software maker SAP seeing a 2% increase. Oracle's stock has demonstrated substantial growth this year, rising 45%.",
            "pubDate": "2025-09-10T08:48:05.043752"
        },
        {
            "title": "Bank Nifty recovery in sight, could march towards 56,000 in coming weeks: Rohit Srivastava",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-nifty-recovery-in-sight-could-march-towards-56000-in-coming-weeks-rohit-srivastava/articleshow/123805376.cms",
            "description": "Market strategist Rohit Srivastava sees Indian equities entering the early stages of a year-end rally. With Nifty aiming for 25,000 and beyond, he suggests viewing short-term pullbacks as buying opportunities amid improving sentiment.",
            "pubDate": "2025-09-10T09:31:05.800639"
        },
        {
            "title": "KKR, Blackstone help India become Asia’s private equity HQ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kkr-blackstone-help-india-become-asias-private-equity-hq/articleshow/123804893.cms",
            "description": "Global asset managers from KKR & Co. to Blackstone Inc. are ramping up investments in India and elevating locally-based executives to key regional roles, underscoring the nation’s rise in Asia’s private equity landscape.",
            "pubDate": "2025-09-10T09:31:05.800768"
        },
        {
            "title": "Stock Radar: Hyundai Motor trading near record highs! Check target & stop loss for long positions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-hyundai-motor-trading-near-record-highs-check-target-stop-loss-for-long-positions/articleshow/123787573.cms",
            "description": "Hyundai Motor India has exhibited strong price action, signaling sustained momentum. Experts suggest a buy, targeting above Rs 2,900 in the coming weeks. The stock overcame profit-booking declines and trades favorably above key moving averages, supported by bullish RSI and MACD indicators. Analysts anticipate continued outperformance with a target of 2,915, advising a stop loss at 2,430.",
            "pubDate": "2025-09-10T11:44:53.519155"
        },
        {
            "title": "BEL dividend payment date announced; stock rises 5%. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-dividend-payment-date-announced-stock-rises-5-check-details/articleshow/123808153.cms",
            "description": "Bharat Electronics Ltd declared Rs 0.90 dividend per share, payable September 23. Strong Q1FY26 results, 25% PAT growth, and Rs 74,859 crore order book highlight BEL’s robust financials and defence sector strength.",
            "pubDate": "2025-09-10T11:44:53.519285"
        },
        {
            "title": "Zerodha’s Nithin Kamath shares how a behavioural hack kept him from trading his investments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodhas-nithin-kamath-shares-how-a-behavioural-hack-kept-him-from-trading-his-investments/articleshow/123808167.cms",
            "description": "Zerodha CEO Nithin Kamath highlighted the benefits of a secondary offline demat account, helping investors separate long-term and short-term holdings, avoid impulsive trading, and optimize tax management. Recently launched on Zerodha’s Kite app, this feature supports smarter investing, while Kamath emphasized the company’s growth through referrals and word-of-mouth",
            "pubDate": "2025-09-10T11:44:53.519502"
        },
        {
            "title": "Lenskart IPO: 10 things Jefferies said about Rs 2,200 crore offer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-ipo-10-things-jefferies-said-about-rs-2200-crore-offer/articleshow/123808066.cms",
            "description": "Lenskart is preparing a Rs 2,200 crore IPO, backed by strong financials, robust revenue growth, market leadership in India and Asia, and an omnichannel presence. Jefferies highlights profitability, international expansion, and large market potential driving investor interest.",
            "pubDate": "2025-09-10T11:44:53.519601"
        },
        {
            "title": "InvIT market set for wider participation as SEBI lowers entry bar to Rs 25 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/invit-market-set-for-wider-participation-as-sebi-lowers-entry-bar-to-rs-25-lakh/articleshow/123806952.cms",
            "description": "India’s Infrastructure Investment Trusts (InvITs) are set for wider participation after the Securities and Exchange Board of India (SEBI) lowered the minimum subscription in privately placed InvITs to ₹25 lakh.",
            "pubDate": "2025-09-10T11:44:53.519703"
        },
        {
            "title": "Market Wrap: Sensex jumps 324 points; Nifty 50 tops 24,950, extends rally to day 6 on US-India trade talk hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-jumps-324-points-nifty-50-tops-extends-rally-to-day-6-on-us-india-trade-talks-hopes/articleshow/123806708.cms",
            "description": "Indian equities extended their winning streak on Wednesday, with the Nifty notching a sixth consecutive day of gain, after U.S. President Donald Trump said his administration is continuing negotiations to address trade barriers with India",
            "pubDate": "2025-09-10T11:44:53.519801"
        },
        {
            "title": "IT could outperform over next 6-12 months; pharma, FMCG outlook strong: Sandeep Tandon",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-could-outperform-over-next-6-12-months-pharma-fmcg-outlook-strong-sandeep-tandon/articleshow/123806819.cms",
            "description": "Sandeep Tandon of Quant Mutual Fund sees India’s market setup as constructive, recommending continued exposure to IT, pharma, and FMCG. IT stocks may outperform over 6–12 months, while GST-led consumption and global demand support pharma and FMCG growth, backed by steady retail inflows.",
            "pubDate": "2025-09-10T11:44:53.519894"
        },
        {
            "title": "Reliance Power, Reliance Infra shares down 36% in 3 months. Can Anil Ambani convince markets his turnaround still has legs?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-reliance-infra-shares-down-36-in-3-months-can-anil-ambani-convince-markets-his-turnaround-still-has-legs/articleshow/123806709.cms",
            "description": "Reliance Power and Reliance Infrastructure shares have fallen nearly 36% in three months, raising concerns about Anil Ambani’s corporate comeback. Legal cases, lender scrutiny, and profit volatility overshadow operational gains, leaving investors uncertain about the sustainability of the turnaround.",
            "pubDate": "2025-09-10T11:44:53.520016"
        },
        {
            "title": "Nepal protests: 6 listed FMCG companies exposed to India's neighbour. Should investors worry?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nepal-protests-6-listed-fmcg-companies-exposed-to-indias-neighbour-should-investors-worry/articleshow/123805899.cms",
            "description": "Nepal’s political unrest, which forced PM KP Oli’s resignation, has raised concerns for FMCG majors like ITC, HUL, Dabur, Marico, Bikaji and Varun Beverages. Analysts say the impact is limited, with Nepal contributing just 2–3% of sales, though supply chain disruptions remain a risk.",
            "pubDate": "2025-09-10T11:44:53.520116"
        },
        {
            "title": "Rs 6,256-crore Kotak Bank block deal: BlackRock, BofA, Nomura among marquee buyers as SMBC exits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smbc-sells-over-3-crore-shares-of-kotak-mahindra-for-rs-6256-crore-blackrock-goldman-sachs-among-buyers/articleshow/123812896.cms",
            "description": "Sumitomo Mitsui Banking Corporation divested its 1.65% stake in Kotak Mahindra Bank for Rs 6,256 crore through block deals, with shares sold at Rs 1,940.8 apiece to various domestic and foreign investors. Kotak Mahindra Bank's shares closed higher, despite trading below key moving averages.",
            "pubDate": "2025-09-10T17:00:02.801081"
        },
        {
            "title": "Trump Media and Technology seeks SEC approval for five new ETFs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-media-and-technology-seeks-sec-approval-for-five-new-etfs/articleshow/123812850.cms",
            "description": "Trump Media and Technology Group announced the filing for five new exchange-traded funds with the U.S. Securities and Exchange Commission on Wednesday.",
            "pubDate": "2025-09-10T17:00:02.801208"
        },
        {
            "title": "Market Trading Guide: Buy HAL, Waaree Energies and 3 stocks on Thursday for short term gains up to 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-hal-waaree-energies-and-3-stocks-on-thursday-for-short-term-gains-up-to-12/slideshow/123812594.cms",
            "description": "Indian headline indices ended with gains today aided by IT and financial stocks though auto stocks pulled markets down. Nifty closed positive for the sixth session in a row, gaining more than 100 points to close above the 21EMA. Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said that RSI has given a bullish crossover above 50, supporting the positive momentum. \"Going ahead, sustaining above 24,820–24,750 may lead the index towards 25,160 and higher levels, while support remains at 24,820–24,750,\" De said.Here are 5 stock recommendations for Thursday:",
            "pubDate": "2025-09-10T17:00:02.801313"
        },
        {
            "title": "Two Trades for Today: A PSU banking major for a 4.52% upmove, a large-cap IT stock for almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-psu-banking-major-for-a-4-52-upmove-a-large-cap-it-stock-for-almost-7-gain/articleshow/123812692.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-10T17:00:02.801411"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/123812646.cms",
            "description": "Indian markets extended gains for the sixth session as Nifty and Sensex closed higher, driven by optimism over India–US trade talks, potential GST cuts, and expectations of a U.S. Fed rate cut.",
            "pubDate": "2025-09-10T17:00:02.801508"
        },
        {
            "title": "Multibagger or IBC - Part 23: Game-changing certifications could put this small-cap on every long-term investor’s radar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-part-23-game-changing-certifications-could-put-this-small-cap-on-every-long-term-investors-radar/articleshow/123812078.cms",
            "description": "What began as a small regional venture in the 1960s is today a listed small-cap backed by a major group. Certifications in aerospace and railways reflect ambitions beyond domestic markets, while exports now account for close to 10% of revenues. The numbers reflect a sharp turnaround: Sales rising 3x since FY21, profits climbing 5x, and return on capital touching 35%. With low trading volumes on the BSE, patience is key, but for long-term investors the OEM base, EV readiness, and steady R&D investments offer a compelling case. This series on auto ancillary companies works with the assumption that, from the whole set of auto ancillary companies, some multibagger stocks will emerge. And some companies in this space risk going bankrupt.",
            "pubDate": "2025-09-10T17:00:02.801603"
        },
        {
            "title": "Oracle stock turns 2025's multibagger after 41% surge; chairman Larry Ellison beats Elon Musk to become world's richest man",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-stock-turns-2025s-multibagger-after-41-surge-chairman-larry-ellison-beats-elon-musk-to-become-worlds-richest-man/articleshow/123812248.cms",
            "description": "Oracle shares soared 41% on Nasdaq after unveiling an AI Center of Excellence for healthcare. The rally pushed year-to-date gains above 100% and lifted co-founder Larry Ellison past Elon Musk as the world’s richest man. The surge was amid high volumes as nearly 43 million shares changed hands around 10:06 AM ET (7:40 India time).",
            "pubDate": "2025-09-10T17:00:02.801699"
        },
        {
            "title": "Sebi cancels registration of 18 investment advisers for fee non-payment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-cancels-registration-of-18-investment-advisers-for-fee-non-payment/articleshow/123811738.cms",
            "description": "Markets regulator Sebi on Wednesday cancelled the registration of 18 investment advisers for failing to pay renewal fees, a statutory requirement under its regulations.",
            "pubDate": "2025-09-10T17:00:02.801825"
        },
        {
            "title": "Oracle shares surge 35% on AI cloud growth as customers race to secure computing capacity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-shares-surge-35-on-ai-cloud-growth-as-customers-race-to-secure-computing-capacity/articleshow/123811295.cms",
            "description": "Oracle shares soared about 35% on Wednesday after the company pointed to a demand surge for its cloud services from AI firms, underscoring its deeper push into the backbone of artificial intelligence systems.",
            "pubDate": "2025-09-10T17:00:02.801924"
        },
        {
            "title": "Nykaa, Colgate-Palmolive among 7 midcap stocks trading above book value",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-colgate-palmolive-among-7-midcap-stocks-trading-above-book-value/slideshow/123811213.cms",
            "description": "Price above book value refers to a situation where a company's stock is trading at a market price higher than its book value per share. From the NSE midcap segment, we have highlighted the top seven stocks whose market prices are trading above their book values, based on June '25 quarter results data, as per StockEdge valuation Scans.Price above book value, typically indicates that investors expect the company to generate strong future earnings, possess valuable intangible assets, or maintain a competitive edge. A price above book value is common among high-growth or well-managed firms, but if not supported by fundamentals, it may also signal overvaluation. Book value is the net worth of a company as recorded on its balance sheet. It is calculated by subtracting total liabilities from total assets. When divided by the number of outstanding shares, it gives the book value per share. (Note: Market price refers to the previous day's closing value.)",
            "pubDate": "2025-09-10T17:00:02.802020"
        },
        {
            "title": "S&P 500, Nasdaq hit record highs as inflation data boosts rate-cut bets; Oracle soars",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-hit-record-highs-on-boosted-rate-cut-bets-oracle-soars/articleshow/123810989.cms",
            "description": "American stock markets saw gains. S&P 500 and Nasdaq reached record highs. This happened after inflation data was released. The data suggested a potential cut in borrowing costs. Oracle's surge also contributed to the market's positive performance. Investors are now awaiting the U.S. consumer prices data. This data will provide further insights into the inflation trend.",
            "pubDate": "2025-09-10T17:00:02.802114"
        },
        {
            "title": "HBL Engineering, Cupid, Prime Focus among 8 smallcap stocks that hit 52-week highs & rallied up to 45% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hbl-engineering-cupid-prime-focus-among-8-smallcap-stocks-that-hit-52-week-highs-amp-rallied-up-to-45-in-a-month/slideshow/123810639.cms",
            "description": "On Wednesday, the benchmark Sensex rose by approximately 324 points, ending the day at 81,425. Fueled by a broader market rally, eight stocks from the BSE smallcap index reached their 52-week highs, marking their peak levels over the past year. These breakouts are often interpreted by traders and investors as bullish signals, indicating strong upward momentum and the possibility of further gains.",
            "pubDate": "2025-09-10T17:00:02.802207"
        },
        {
            "title": "Gainers & Losers: OFSS, CarTrade Tech among 6 big movers on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-ofss-cartrade-tech-among-6-big-movers-on-wednesday/slideshow/123809731.cms",
            "description": "",
            "pubDate": "2025-09-10T17:00:02.802296"
        },
        {
            "title": "Explained: 8 reasons why companies do share buybacks and what it means to investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-8-reasons-why-companies-do-share-buybacks-and-what-it-means-to-investors/articleshow/123809535.cms",
            "description": "Infosys’ upcoming buyback proposal highlights why companies repurchase shares. Buybacks boost EPS, signal undervaluation, and stabilise stock prices. They return excess cash, offset ESOP dilution, and defend against hostile takeovers. Unlike dividends, they offer flexibility and can be tax-efficient. Investors view buybacks as confidence in fundamentals and growth.",
            "pubDate": "2025-09-10T17:00:02.802397"
        },
        {
            "title": "Nifty could touch 29,000 going ahead if earnings growth sustains: Sanjay H Parekh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-could-touch-29000-going-ahead-if-earnings-growth-sustains-sanjay-h-parekh/articleshow/123808818.cms",
            "description": "Sanjay H Parekh of Sohum Asset Managers expects short-term weakness in Indian equities but remains bullish long-term, projecting Nifty at 26,000–29,000. Strong fundamentals, domestic sector focus, and earnings recovery from FY26–27 support the outlook.",
            "pubDate": "2025-09-10T17:00:02.802487"
        }
    ]
}