{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-25T03:48:13.867228",
    "items": [
        {
            "title": "Hot Stocks: Brokerages on Power Grid, NTPC, BEL and Dabur",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerages-on-power-grid-ntpc-bel-and-dabur/articleshow/113650592.cms",
            "description": "Goldman Sachs has reaffirmed a Buy rating on NTPC, setting a target price of Rs 430. The profits from NTPC Green align with expectations, and Goldman values NTPC at Rs 4,173 billion based on a sum-of-the-parts (SOTP) analysis for a 12-month target, with NTPC Green contributing Rs 784 billion. Additionally, a proposed Rs 100 billion primary issuance would result in a 13% dilution of NTPC's stake.",
            "pubDate": "2024-09-25T03:47:51.875198"
        },
        {
            "title": "Stocks to buy today: Infosys, Hindalco among top 10 trading ideas for September 25, 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-infosys-hindalco-among-top-10-trading-ideas-for-september-25-2024/articleshow/113650490.cms",
            "description": "In the options market, the highest Call open interest (OI) is at the 27,000 strike, followed by the 26,500 strike. Conversely, the maximum Put OI is at the 25,000 strike and then at the 24,500 strike. Call writing is noted at the 26,000 and 27,000 strikes, while Put writing is observed at the 25,900 and 26,000 strikes.",
            "pubDate": "2024-09-25T03:47:51.875332"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Spread in Nifty to gain from bullish stance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-gain-from-bullish-stance/articleshow/113650397.cms",
            "description": "In the final hour of Tuesday’s session, the index surged to a new all-time high of 26,011, having opened flat and traded within a 125-point range during the day. Although the index crossed the 26,000 mark, slight profit-taking at the end reduced most of its intraday gains.",
            "pubDate": "2024-09-25T03:47:51.875465"
        },
        {
            "title": "Buy calls are slowly vanishing from India’s booming stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-calls-are-slowly-vanishing-from-indias-booming-stock-market/articleshow/113649989.cms",
            "description": "The number of stocks on the NSE Nifty 200 index with a consensus ‘buy’ rating totaled 61 as of Tuesday, the lowest in at least a decade, data analyzed by Bloomberg show. LIC Housing Finance Ltd., Sun TV Network Ltd. and Dr. Lal PathLabs Ltd. are among stocks that saw multiple downgrades this quarter, putting their average analyst rating at ‘hold’.",
            "pubDate": "2024-09-25T03:47:51.875593"
        },
        {
            "title": "KRN Heat Exchanger IPO to open for subscription today; GMP at 110%. Should you bid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/krn-heat-exchanger-ipo-to-open-for-subscription-today-gmp-at-110-should-you-bid/articleshow/113649895.cms",
            "description": "The IPO of KRN Heat Exchanger opened for subscription on Wednesday and will be available until September 27. The company plans to use the proceeds to invest in its subsidiary, KRN HVAC Products, for a new manufacturing facility in Neemrana, Rajasthan, with the remaining funds allocated for general corporate purposes.",
            "pubDate": "2024-09-25T03:47:51.875685"
        },
        {
            "title": "F&O Ban List: Hindustan Copper, IEX among 5 stocks under trade ban on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-ban-list-hindustan-copper-iex-among-5-stocks-under-trade-ban-on-wednesday/articleshow/113649619.cms",
            "description": "On Wednesday, five stocks are subject to a F&O trade ban: Aditya Birla Fashion and Retail (ABFRL), Granules India, Hindustan Copper, Vodafone Idea, and Indian Energy Exchange (IEX).",
            "pubDate": "2024-09-25T03:47:51.875797"
        },
        {
            "title": "Big movers on D-Street: What should investors do with Power Grid, IEX and Tech Mahindra?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-street-what-should-investors-do-with-power-grid-iex-and-tech-mahindra/articleshow/113649503.cms",
            "description": "Benchmark Sensex reached 85,000 and Nifty crossed 26,000 for the first time before closing flat in a volatile session. Power Grid rose 2.77%, IEX declined 11.5%, and Tech Mahindra increased nearly 2%. Analyst Riyank Arora provides recommendations for these stocks as the market resumes trading.",
            "pubDate": "2024-09-25T03:47:51.875897"
        },
        {
            "title": "Australia, New Zealand dollars scale fresh highs on China boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/forex-australia-new-zealand-dollars-scale-fresh-highs-on-china-boost/articleshow/113649332.cms",
            "description": "The Australian and New Zealand dollars reached multi-month highs, driven by China's aggressive stimulus measures. The yuan also hit its strongest level in over a year. Despite a slight dip in the Aussie after domestic inflation data, global markets were buoyed by China's support measures, impacting currencies linked to its economy.",
            "pubDate": "2024-09-25T03:47:51.875987"
        },
        {
            "title": "Regret holding cash in buying frenzy? Here’s why experienced investors call it a smart move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-analysis-cash-turns-out-to-be-a-safe-harbour-when-market-tide-turns/articleshow/113649052.cms",
            "description": "Investors are increasingly holding cash due to concerns over high share valuations and market excesses. Despite criticism, including from Warren Buffett, many prefer the safety of cash or equivalents. Experienced investors are particularly cautious, while newer ones remain bullish. Cash holdings offer a cushion against potential market downturns.",
            "pubDate": "2024-09-25T03:47:51.876077"
        },
        {
            "title": "Hudco raises $448 million in Yen debt in a rare transaction for state-owned firm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hudco-raises-448-million-in-yen-debt/articleshow/113649016.cms",
            "description": "The Housing and Urban Development Corp (Hudco) has secured a 60 billion yen ($448 million) loan from three major Japanese banks. The five-year loan, priced at 70 basis points above the Tokyo Overnight Average Rate, will be swapped to dollars for domestic lending in India. This transaction is rare for a government-owned company.",
            "pubDate": "2024-09-25T03:47:51.876172"
        },
        {
            "title": "Blackstone, Vista Equity Partners reach $8.4-billion deal to buy Smartsheet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstone-vista-equity-partners-reach-8-4-billion-deal-to-buy-smartsheet/articleshow/113648990.cms",
            "description": "Blackstone and Vista Equity Partners have agreed to acquire software provider Smartsheet for about $8.4 billion. The buyout firms will pay $56.50 a share in cash, representing a premium of roughly 41% to Smartsheet's average closing price over the past 90 trading days. Shares in Smartsheet rose 6% following the announcement.",
            "pubDate": "2024-09-25T03:47:51.876270"
        },
        {
            "title": "Retail investors must block funds only via UPI for investment of up to Rs 5 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-must-block-funds-only-via-upi-for-investment-of-up-to-rs-5-lakh/articleshow/113648948.cms",
            "description": "The Securities and Exchange Board of India (Sebi) announced that starting Nov 1, 2024, retail investors applying for public issues of debt securities through stock brokers for amounts up to ₹5 lakh must use UPI to block funds, while other modes of payment will still be available for individual investors through stock exchange platforms.",
            "pubDate": "2024-09-25T03:47:51.876358"
        },
        {
            "title": "In Sensex's journey from 75K to 85K, HDFC and Bharti Airtel outshined",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/in-sensexs-journey-from-75k-to-85k-hdfc-and-bharti-airtel-outshined/articleshow/113648901.cms",
            "description": "HDFC Bank, Bharti Airtel, Infosys, ICICI Bank, and M&M contributed over 50%, or 5,700 points, to the recent 10,000-point Sensex rally, as the index surged 13.16% from 75,000 to 85,000, outperforming markets in Japan, France, and China during this period.",
            "pubDate": "2024-09-25T03:47:51.876449"
        },
        {
            "title": "Why is L&T looking attractive at current levels? Could hit fresh record highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-lt-looking-attractive-at-current-levels-could-hit-fresh-record-highs/videoshow/113648806.cms",
            "description": "“L&T stock has consolidated within a  range in the last few months. This entire consolidation just seems to be a time-wise correction within an uptrend. Traders can buy for a target  of Rs 4000 in the next few weeks,” Ruchit Jain, Lead Research, 5paisa.com, said.",
            "pubDate": "2024-09-25T03:47:51.876541"
        },
        {
            "title": "GIFT Nifty signals a negative start for D-Street. Here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-signals-a-negative-start-for-d-street-heres-the-trading-setup-for-todays-session/articleshow/113648686.cms",
            "description": "Domestic equities reached new highs with Sensex surpassing 85,000 and Nifty breaking 26,000. The rally was driven by positive domestic cues, healthy foreign investments, and the start of the US Fed's rate cut cycle. Investors are now looking forward to US Consumer Confidence data for further market direction.",
            "pubDate": "2024-09-25T03:47:51.876628"
        },
        {
            "title": "S&P 500, Dow close at new highs as mining stocks rise on China stimulus boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-dow-close-at-new-highs-as-mining-stocks-rise-on-china-stimulus-boost/articleshow/113648682.cms",
            "description": "The S&P 500 and Dow closed at record highs on Tuesday, driven by a surge in mining stocks following China's announcement of a major stimulus package. Despite weak U.S. consumer confidence data, sectors like metals and mining outperformed. Federal Reserve Governor Michelle Bowman warned that inflation remains above target, necessitating caution in rate cuts.",
            "pubDate": "2024-09-25T03:47:51.876713"
        }
    ]
}