{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-26T11:27:27.290090",
    "items": [
        {
            "title": "Infosys’ Rs 18,000-crore share buyback: Don’t ignore this important tax implication",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-rs-18000-crore-share-buyback-dont-ignore-this-important-tax-implication/articleshow/125579485.cms",
            "description": "Infosys' Rs 18,000 crore share buyback closes today, with investor focus shifting to the new tax regime. Under the revised rules, buyback proceeds are taxed as 'deemed dividend' at individual income-tax slab rates, replacing the old company-level tax.",
            "pubDate": "2025-11-26T04:33:51.559485"
        },
        {
            "title": "Bessent signals Christmas timeline for new Fed Chief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bessent-signals-christmas-timeline-for-new-fed-chief/slideshow/125579414.cms",
            "description": "U.S. Treasury Secretary Scott Bessent said he is wrapping up the second round of interviews for the next Federal Reserve Chair. He added that there is a strong possibility President Donald Trump will reveal his choice before Christmas. (Source: Reuters)",
            "pubDate": "2025-11-26T04:33:51.559615"
        },
        {
            "title": "Sensex jumps over 600 pts, Nifty above 26,000 as metal, PSU bank stocks shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-200-pts-nifty-nears-26000-as-metal-psu-bank-stocks-shine/articleshow/125579031.cms",
            "description": "In a thrilling turnaround, the Indian stock markets, Nifty and Sensex, experienced a notable upswing on November 26. Leading the recovery were metal and PSU bank stocks, successfully reversing a three-day downward trend. The positive energy stemmed from encouraging signals across global markets, particularly from Wall Street and Asia.",
            "pubDate": "2025-11-26T04:33:51.559720"
        },
        {
            "title": "Federal Bank among 4 stocks that witnessed 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-among-4-stocks-that-witnessed-5-year-swing-high-breakout/slideshow/125578951.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, four stocks witnessed a 5-year swing high at the close on November 25, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-11-26T04:33:51.559824"
        },
        {
            "title": "Zydus Lifesciences shares in focus after USFDA nod for Verapamil Hydrochloride ER Tablets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-after-usfda-nod-for-verapamil-hydrochloride-er-tablets/articleshow/125578909.cms",
            "description": "Zydus Lifesciences will be in focus on Wednesday after receiving final USFDA approval for its Verapamil Hydrochloride Extended-Release Tablets in 120 mg, 180 mg, and 240 mg strengths. The drug, a generic version of Calan SR, is used to treat high blood pressure. The approval strengthens Zydus’ US portfolio and supports its ongoing expansion in the regulated markets.",
            "pubDate": "2025-11-26T04:33:51.559923"
        },
        {
            "title": "HCLTech shares in focus on strategic collaboration agreement with AWS",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcltech-shares-in-focus-on-strategic-collaboration-agreement-with-aws/articleshow/125578881.cms",
            "description": "HCLTech shares will be watched after the company announced a strategic collaboration with AWS to accelerate digital transformation in the financial services sector. The partnership aims to modernise legacy systems, enhance customer experiences, and deploy AI-driven, industry-compliant solutions across banking, wealth, and insurance, strengthening long-standing ties between both companies.",
            "pubDate": "2025-11-26T04:33:51.560024"
        },
        {
            "title": "India's stock market facade: 576 stocks down over 30% as Sensex, Nifty near record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-stock-market-facade-576-stocks-down-over-30-as-sensex-nifty-near-record-high/articleshow/125578860.cms",
            "description": "Indian stock market presents a dual reality. While Sensex and Nifty approach record highs, a significant number of BSE-listed stocks have seen sharp declines. Over 576 stocks are down by at least 30% from their peaks. This divergence is attributed to valuation excesses and concentrated investment flows into select large-cap companies.",
            "pubDate": "2025-11-26T04:33:51.560120"
        },
        {
            "title": "Godrej Consumer Products among 6 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-products-among-6-stocks-that-closed-above-vwap/slideshow/125578838.cms",
            "description": "On November 25, six stocks in the Nifty500 pack closed significantly above their VWAP, based on StockEdge.com data. A closing price above the VWAP suggests stronger buying interest in the session and the possibility of a short-term bullish trend forming.",
            "pubDate": "2025-11-26T04:33:51.560212"
        },
        {
            "title": "Vedanta among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-among-4-stocks-showing-bullish-rsi-upswing/slideshow/125578793.cms",
            "description": "On November 25, in the NSE large-cap segment, four stocks appeared in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal is generated when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) is rising, suggesting strengthening momentum in the stock’s price. This may signal potential upward movement and can help traders identify buying opportunities.",
            "pubDate": "2025-11-26T04:33:51.560303"
        },
        {
            "title": "Orient Electric, Carraro India among 7 stocks flashing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/orient-electric-carraro-india-among-7-stocks-flashing-bullish-signals/slideshow/125578745.cms",
            "description": "On November 25, 20 stocks appeared in the bullish ‘White Marubozu’ scanner on the NSE list of stocks with a market cap above Rs 1,000 crore, according to technical scan data from StockEdge.com. Of these, we highlighted seven stocks that gained over 5%.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for the period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and little to no lower shadow, it indicates strong buying pressure throughout the session. Traders view this as a signal that buyers dominated from open to close, often using such patterns to make informed decisions about future price movements.",
            "pubDate": "2025-11-26T04:33:51.560419"
        },
        {
            "title": "For impatient investors with the ability to be patient for 3 years: 5 small-caps from 4 different growth sectors that fit the bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-impatient-investors-with-the-ability-to-be-patient-for-3-years-5-small-caps-from-4-different-growth-sectors-that-fit-the-bill/articleshow/125578387.cms",
            "description": "In an emerging economy, how to define a growth sector? It is an industry whose real value added grows persistently above the national GDP growth rate, attracts rising private and foreign investment, demonstrates productivity gains, and generates strong employment and linkage effects – thereby contributing disproportionately to structural transformation. The next question is: Which sectors are currently undergoing transformation and attracting significant private equity investment? Finally, which are the small-cap firms within these high-growth sectors that merit closer attention?",
            "pubDate": "2025-11-26T04:33:51.560508"
        },
        {
            "title": "Apollo Micro Systems shares in focus on MoU with IIT-Chennai, Indian Navy to fast-track defence tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-micro-systems-shares-in-focus-on-mou-with-iit-chennai-indian-navy-to-fast-track-defence-tech/articleshow/125578434.cms",
            "description": "Apollo Micro Systems is set for active trade following a significant collaboration. The company, along with IIT-Chennai and the Indian Navy, will focus on developing advanced homegrown defence technologies. This partnership aims to meet the operational needs of the Armed Forces through indigenous research and development.",
            "pubDate": "2025-11-26T04:33:51.560606"
        },
        {
            "title": "HDFC AMC shares in focus as stock turns ex-bonus for 1:1 issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-shares-in-focus-as-stock-turns-ex-bonus-for-11-issue/articleshow/125578386.cms",
            "description": "HDFC Asset Management Company shares are trading ex-bonus today, November 26, following a 1:1 bonus share issue. Investors who held shares by the end of trading on November 25 are eligible for one bonus share for every share owned. The record date for this bonus issuance was November 26, 2025.",
            "pubDate": "2025-11-26T04:33:51.560697"
        },
        {
            "title": "Sunil Mittal family likely sells Bharti Airtel shares worth Rs 7,400 crore in block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-shares-in-focus-as-promoter-icil-likely-to-offload-rs-7195-crore-worth-stake-via-block-deal/articleshow/125578345.cms",
            "description": "Bharti Airtel shares saw a dip in early trade. This followed a large block deal where a promoter entity sold shares. The transaction fetched a significant amount. This move comes after the company reported strong quarterly results. Analysts maintain a positive outlook on the telecom major's future performance.",
            "pubDate": "2025-11-26T04:33:51.560789"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Star Cement, Vishnu Chemicals among 5 stocks that could give 15-40% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-star-cement-vishnu-chemicals-among-5-stocks-that-could-give-15-40-return/slideshow/125577890.cms",
            "description": "Brokerages remain upbeat on select stocks across chemicals, pharmaceuticals, metals, and cement, highlighting strong upside potential despite broader market volatility.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-26T04:33:51.560878"
        },
        {
            "title": "Last day to buy Sikko Industries shares ahead of 10:1 stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-sikko-industries-shares-to-be-eligible-for-101-stock-split/articleshow/125577788.cms",
            "description": "Sikko Industries shares are in focus today, the last chance for investors to buy before a 10:1 stock split. Those holding shares by market close will benefit from the split, which adjusts face value from Rs 10 to Rs 1. The ex-split trading begins November 27, 2025, impacting holdings proportionally without altering total investment value.",
            "pubDate": "2025-11-26T04:33:51.560969"
        },
        {
            "title": "Despite 24% correction in Kaynes Technology shares, Nomura eyes 46% upside. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-24-correction-in-kaynes-technology-shares-nomura-eyes-46-upside-heres-why/articleshow/125585819.cms",
            "description": "Kaynes Technology’s sharp correction hasn’t deterred brokerages, which remain upbeat on long-term prospects, citing strong order visibility, improving working capital plans, major capex-led expansion and growth drivers across EV, smart meters, aerospace and OSAT segments despite near-term challenges.",
            "pubDate": "2025-11-26T09:49:03.868056"
        },
        {
            "title": "Crude oil prices to fall 50% to $30 by FY27, says JP Morgan. What could it mean for your stocks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/crude-oil-prices-to-fall-50-to-30-by-fy27-says-jp-morgan-what-could-it-mean-for-your-stocks/articleshow/125585278.cms",
            "description": "JP Morgan has predicted Brent crude could drop to $30 by FY27, a nearly 50% fall. Lower oil prices are likely to ease India’s import bill, improve the current account, and boost profits for airlines, tyre makers, and paint companies. However, upstream players like ONGC could face margin pressures amid global oversupply.",
            "pubDate": "2025-11-26T09:49:03.868183"
        },
        {
            "title": "India's Rs 6.5 lakh crore wedding splurge: 10 stocks that could benefit with up to 38% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-rs-6-5-lakh-crore-wedding-splurge-10-stocks-that-could-benefit-with-up-to-38-upside/slideshow/125581022.cms",
            "description": "India is in the middle one of its busiest wedding windows, with 4.6 million ceremonies projected between November 1 and December 14. The Confederation of All India Traders estimates spending of around Rs 6.5 lakh crore, creating a major consumption wave across fashion, jewellery, hospitality and home goods. Source: Nirmal Bang and Trendlyne.",
            "pubDate": "2025-11-26T09:49:03.868311"
        },
        {
            "title": "Time to select & focus on a few as EV inflection point comes closer: 7 auto ancillary stocks with upside potential of up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-select-focus-on-a-few-as-ev-inflection-point-comes-closer-7-auto-ancillary-stocks-with-upside-potential-of-up-to-39/articleshow/125584393.cms",
            "description": "If auto stocks are doing well on the back of the GST rate rationalisation, auto ancillary stocks cannot be far behind. But, at this point, there has to be a different way of looking at these stocks: Which ones have been able to make themselves relevant in the EV space? The reason is simple. With EV sales crossing a milestone, the inflection point everyone has been talking about might turn out to be closer than expected. So, the EV-ready auto ancillary stocks might attract more attention.",
            "pubDate": "2025-11-26T09:49:03.868409"
        },
        {
            "title": "Sebi mulls relaxed framework for issuing duplicate securities certificates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-mulls-relaxed-framework-for-issuing-duplicate-securities-certificates/articleshow/125584469.cms",
            "description": "\"Due to non-standardization of documents and different approaches followed by RTAs/listed companies, investors feel the pain of going for varied documentation for various listed companies,\" Sebi noted.",
            "pubDate": "2025-11-26T09:49:03.868506"
        },
        {
            "title": "Nykaa shares hit 3.5-yr high after stellar 76% rally from March 2025 lows. Still time to join the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-shares-hit-3-5-yr-high-after-stellar-76-rally-from-march-2025-lows-still-time-to-join-the-rally/articleshow/125584136.cms",
            "description": "Nykaa shares have surged nearly 76% from their March 2025 low and are now trading close to a 52-week high, reaching their strongest levels in over three years. The rally has lifted its market cap to about ₹77,200 crore.",
            "pubDate": "2025-11-26T09:49:03.868605"
        },
        {
            "title": "Japan's Nikkei surges after Wall Street's gains, tech leads charge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-surges-after-wall-streets-gains-tech-leads-charge/articleshow/125584011.cms",
            "description": "Wall Street extended its rally on Tuesday as a spate of economic data appeared to support the case for the U.S. Federal Reserve to implement its third and final rate cut of the year in December, while softness in the tech sector limited the Nasdaq's gains.",
            "pubDate": "2025-11-26T09:49:03.868705"
        },
        {
            "title": "European shares jump on Ukraine peace prospects, US rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-jump-on-ukraine-peace-prospects-us-rate-cut-hopes/articleshow/125583924.cms",
            "description": "The pan-European STOXX 600 closed up 0.91% at 568.01. Major regional bourses also ended higher, with Germany's DAX and France's CAC up 1% and 0.8%, respectively.",
            "pubDate": "2025-11-26T09:49:03.868801"
        },
        {
            "title": "Nuvama Research initiates Buy on Premier Energies shares with a target of Rs 1,270",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-research-initiates-buy-on-premier-energies-shares-with-a-target-of-rs-1270/articleshow/125583118.cms",
            "description": "Nuvama Research has initiated coverage on Premier Energies with a “BUY” rating, citing strong growth prospects in India’s expanding New Energy ecosystem. Backward integration, rising capacities, supportive policies, and robust cash flows position the company for sustained expansion. Despite medium-term margin pressures, Premier remains well placed to benefit from sectoral tailwinds and emerging technologies.",
            "pubDate": "2025-11-26T09:49:03.868895"
        },
        {
            "title": "Natco Pharma shares jump over 5% after three-day slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/natco-pharma-shares-jump-over-5-after-three-day-slump/articleshow/125582392.cms",
            "description": "Natco Pharma shares surged on Wednesday, bouncing back from a three-day decline that followed a US FDA inspection of its API manufacturing facility in Manali, Chennai, conducted from November 17–21, 2025. The inspection flagged seven Form-483 observations, which the company termed procedural and manageable.",
            "pubDate": "2025-11-26T09:49:03.868989"
        },
        {
            "title": "Reliance Power, Reliance Infrastructure shares rally up to 5% amid high trading volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-reliance-infrastructure-shares-rally-up-to-5-amid-high-trading-volumes/articleshow/125582104.cms",
            "description": "Reliance Power and Reliance Infrastructure saw strong intraday gains despite both stocks trading well below their yearly highs. Volumes softened against recent averages, yet sentiment improved following Reliance Power’s governance overhaul and clean-energy initiatives. The new Board of Management aims to strengthen oversight and support long-term value creation across the group.",
            "pubDate": "2025-11-26T09:49:03.869084"
        },
        {
            "title": "Excelsoft Technologies shares surge 6% after listing. More gains ahead or time to book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/excelsoft-technologies-shares-surge-6-after-listing-more-gains-ahead-or-time-to-book-profits/articleshow/125581504.cms",
            "description": "Excelsoft Technologies shares rose sharply after a strong D-Street debut on Wednesday. The stock touched an intraday high of Rs 142.65 on the BSE, after debuting at Rs 135 against an IPO price of Rs 120. With FY25 PAT up 172% and strong SaaS growth, analysts say that investors may book partial profits while holding for medium-term gains amid client concentration and valuation risks.",
            "pubDate": "2025-11-26T09:49:03.869179"
        },
        {
            "title": "Industrial Power Tariff Reform: Will it spark a new profit cycle?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/industrial-power-tariff-reform-will-it-spark-a-new-profit-cycle/articleshow/125581201.cms",
            "description": "The Draft Electricity (Amendment) Bill, 2025, aims to eliminate cross-subsidies, allow private distribution, and align tariffs with actual costs. By reducing electricity expenses for industries, the reforms could boost profits and margins, especially for energy-intensive sectors like steel, cement, aluminium, and data centres. States with distorted tariffs stand to gain the most from this structural shift.",
            "pubDate": "2025-11-26T09:49:03.869293"
        },
        {
            "title": "Rs 4 lakh crore rally! Sensex soars 1,000 pts, Nifty above 26,200; 7 factors driving D-St to near record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-4-lakh-crore-rally-in-1-day-key-factors-driving-sensex-nifty-to-near-record-high/articleshow/125580896.cms",
            "description": "Indian stock markets, Nifty and Sensex, surged on Wednesday, breaking a three-day losing streak. Hopes of a US Fed rate cut, easing FII outflows, declining crude oil prices, and a broad-based rally in global and domestic equities fueled the market's upward movement. Analysts anticipate a positive outlook for corporate earnings.",
            "pubDate": "2025-11-26T09:49:03.869387"
        },
        {
            "title": "NDL Ventures board approves merger of Hinduja Leyland Finance into NDL Ventures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ndl-ventures-board-approves-merger-of-hinduja-leyland-finance-into-ndl-ventures/articleshow/125580752.cms",
            "description": "NDL Ventures’ board has approved the merger of Hinduja Leyland Finance into the company, paving the way for a significant consolidation within the Hinduja Group. Under the Scheme of Merger, HLFL will be absorbed into NDL Ventures, with shareholders receiving 25 shares for every 10 held. The proposal now awaits regulatory and NCLT approvals.",
            "pubDate": "2025-11-26T09:49:03.869496"
        },
        {
            "title": "Tata Motors Passenger Vehicles shares rise 3% on reintroducing Sierra SUV under Rs 15 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-passenger-vehicles-shares-rise-3-on-reintroducing-sierra-suv-under-rs-15-lakh/articleshow/125580711.cms",
            "description": "Tata Motors' stock surged following the unveiling of the 2025 Sierra SUV, a revival of the iconic 1990s model. Priced competitively starting at Rs 11.49 lakh, it targets the mid-size SUV segment. Bookings open December 16, 2025, with deliveries in January 2026, offering multiple powertrain and variant options, including a future AWD version.",
            "pubDate": "2025-11-26T09:49:03.869597"
        },
        {
            "title": "MFs pull back: Stakes cut in 10 smallcap stocks after two quarters of buying",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mfs-pull-back-stakes-cut-in-10-smallcap-stocks-after-two-quarters-of-buying/slideshow/125587300.cms",
            "description": "MF holding declined to 20.26% in the September quarter from 20.37% in June ’25Previous quarters: Dec ’24: 19.45% | Mar ’25: 19.94% | Jun ’25: 20.37%Stock performance FY26: –32.63%",
            "pubDate": "2025-11-26T10:53:51.438672"
        },
        {
            "title": "Cricket stars Rohit Sharma, Tilak Verma to invest in smallcap multibagger stock’s preferential issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cricket-stars-rohit-sharma-tilak-verma-to-invest-in-smallcap-multibagger-stocks-preferential-issue/articleshow/125587710.cms",
            "description": "Swaraj Suiting’s Rs 103-crore preferential issue has drawn marquee interest from cricketers Rohit Sharma and Tilak Verma, who are among the proposed allottees. The smallcap multibagger—up nearly 900% in three years—is also planning a large warrant issuance and higher borrowing limits as it gears up for its next phase of expansion.Excerpt:  Swaraj Suiting’s Rs 103-crore preferential issue has drawn marquee interest from cricketers Rohit Sharma and Tilak Verma, who are among the proposed allottees. The smallcap multibagger—up nearly 900% in three years—is also planning a large warrant issuance and higher borrowing limits as it gears up for its next phase of expansion",
            "pubDate": "2025-11-26T11:09:38.528356"
        },
        {
            "title": "MFs pull back: Stakes cut in 10 smallcap stocks after two quarters of buying",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mfs-pull-back-stakes-cut-in-10-smallcap-stocks-after-two-quarters-of-buying/slideshow/125587693.cms",
            "description": "An analysis of mutual fund (MF) shareholding trends in BSE small-cap stocks over the last four quarters reveals a notable shift. During the September 2025 quarter, mutual funds trimmed their holdings in 79 stocks, marking a reversal after two consecutive quarters of accumulation — from December 2024 to March 2025, and again from March 2025 to June 2025.About 48 stocks from the list have delivered positive price returns in FY26 so far. In fact, eight stocks have seen their share prices rise more than 50%, with some gaining as much as 95% in FY26. However, it is equally important to note that not all stocks have shared this upside. We highlighted 10 stocks from the group that have declined by as much as 32% during FY26, underlining the growing divergence in performance within the broader market.Mutual funds are considered informed investors, often basing their decisions on in-depth research and long-term fundamentals. Mutual fund buying typically boosts investor confidence, but if they reduce their stakes after a period of steady accumulation, it’s worth paying attention. (Data Source: ACE Equity)",
            "pubDate": "2025-11-26T11:09:38.528480"
        },
        {
            "title": "Prabhudas Lilladher hikes Nifty's 12-month target to 29,094 on 5 tailwinds. Picks HAL, ICICI and 16 more stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prabhudas-lilladher-hikes-niftys-12-month-target-to-29094-on-5-tailwinds-picks-hal-icici-and-16-more-stocks-to-buy/articleshow/125587945.cms",
            "description": "Prabhudas remains more bullish on the largecaps, picking 11 stocks to buy from this pool. Meanwhile, in the mid and smallcap segments 7 scrips find a place taking the overall count of preferred picks to 18",
            "pubDate": "2025-11-26T11:27:26.724852"
        }
    ]
}