{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-10T19:25:46.789584",
    "items": [
        {
            "title": "BOJ eyes interest rate hike as wage momentum strengthens",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-eyes-interest-rate-hike-as-wage-momentum-strengthens/slideshow/125215222.cms",
            "description": "Bank of Japan policymakers see a growing case to raise interest rates in the near term. Several members highlighted the need to ensure that companies’ wage-hike momentum continues, which is crucial for sustainable inflation. Out of 13 opinions from the nine-member board, eight suggested either raising rates soon or setting conditions for a near-term hike. (Source: Reuters)",
            "pubDate": "2025-11-10T05:19:58.521618"
        },
        {
            "title": "Japan unveils new stimulus package to boost growth and stability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-unveils-new-stimulus-package-to-boost-growth-and-stability/slideshow/125215134.cms",
            "description": "The Japanese government has revealed a draft outline of its upcoming economic stimulus package, aimed at promoting growth, ensuring price stability, and making strategic investments. The draft was seen by Reuters on Monday. (Source: Reuters)",
            "pubDate": "2025-11-10T05:19:58.521752"
        },
        {
            "title": "A victim of its own hype! 3 reasons why Lenskart’s supposed blockbuster IPO turned into a listing dud",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-victim-of-its-own-hype-3-reasons-why-lenskarts-supposed-blockbuster-ipo-turned-into-a-listing-dud/articleshow/125214634.cms",
            "description": "Lenskart's much-anticipated IPO saw shares list at a discount, a stark contrast to pre-listing hype. Lofty valuations, questionable profit figures boosted by one-time gains, and a cautious market sentiment contributed to the disappointing debut. Investors now await sustained profitability and global expansion to gauge the company's true potential.",
            "pubDate": "2025-11-10T05:19:58.521860"
        },
        {
            "title": "PhysicsWallah IPO opens tomorrow: GMP among 10 things to know before investing in this pureplay edtech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallah-ipo-opens-tomorrow-gmp-among-10-things-to-know-before-investing-in-this-pureplay-edtech/slideshow/125214845.cms",
            "description": "India’s homegrown edtech unicorn PhysicsWallah is set to open its Rs 3,480 crore IPO for subscription on November 11. The company, founded by YouTuber-turned-entrepreneur Alakh Pandey, will become the first major pureplay edtech firm to go public in India. Here are 10 key things investors should know before applying.",
            "pubDate": "2025-11-10T05:19:58.521959"
        },
        {
            "title": "Lenskart shares make muted D-St debut, list at 3% discount to IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-make-muted-d-st-debut-list-at-3-discount-below-ipo-price/articleshow/125214047.cms",
            "description": "Lenskart Solutions made a subdued market debut, listing at ₹390 on the BSE and ₹395 on the NSE — about 3% below its ₹402 issue price. The weak listing followed a sharp drop in its grey market premium from ₹108 to zero, reflecting caution despite strong investor demand. The ₹7,278 crore IPO was subscribed 28 times, led by QIBs at 45 times.",
            "pubDate": "2025-11-10T05:19:58.522058"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/125213714.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-11-10T05:19:58.522156"
        },
        {
            "title": "Top 10 high dividend-yield stocks in 2025, offering returns of up to 10%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-10-high-dividend-yield-stocks-in-2025-offering-returns-of-up-to-10-do-you-own-any/slideshow/125214331.cms",
            "description": "Domestic brokerage firm SBI Securities’ latest Dividend Yield Monitor highlights companies that have consistently rewarded shareholders with strong payouts over the past three years. A dividend yield is a financial ratio that shows how much a company pays out in dividends each year relative to its stock price. It is a key metric for investors, particularly those focused on income generation, as it indicates the return on investment from dividends alone.",
            "pubDate": "2025-11-10T05:19:58.522253"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama raises target price on Cummins India; recommends buy on Lupin post Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-raises-target-price-on-cummins-india-recommends-buy-on-lupin-post-q2-results/articleshow/125214071.cms",
            "description": "Brokerages maintained a bullish stance on Cummins India, Lupin, and Amara Raja Energy & Mobility, citing strong earnings, margin expansion, and growth visibility. Nuvama raised targets across all three stocks after Q2FY26 results, highlighting resilience in demand, product expansion, and operational efficiency despite near-term cost pressures and selective market moderation.",
            "pubDate": "2025-11-10T05:19:58.522365"
        },
        {
            "title": "4 IPOs opening for subscription on Tuesday & all GMPs hint at positive listing gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/4-ipos-opening-for-subscription-on-tuesday-all-gmps-hint-at-positive-listing-gains/slideshow/125214032.cms",
            "description": "The primary market is gearing up for a busy week, with four IPOs opening for subscription on November 11 (Tuesday). These include PhysicsWallah, Emmvee Photovoltaic Power, Workmates Core2Cloud, and Mahamaya Lifesciences. Early trends in the grey market suggest that all four could see a positive debut.",
            "pubDate": "2025-11-10T05:19:58.522460"
        },
        {
            "title": "Neuland Labs shares soar 10%, hit 52-week high after Q2 PAT spikes 201% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/neuland-labs-shares-soar-10-hit-52-week-high-after-q2-pat-spikes-201-yoy/articleshow/125213849.cms",
            "description": "Neuland Laboratories’ shares hit a 52-week high after the company posted stellar Q2FY26 results. PAT surged 201.6% YoY to ₹96.5 crore, revenue rose 63.7% to ₹516.1 crore, and EBITDA jumped 138.8% to ₹156.9 crore, with margins expanding 960 bps to 30.4%, driven by strong operational performance and profitability.",
            "pubDate": "2025-11-10T05:19:58.522560"
        },
        {
            "title": "Sensex rises over 250 pts, Nifty reclaims 25,550 as global mood lifts on U.S. reopening hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-160-pts-nifty-reclaims-25500-as-global-mood-lifts-on-u-s-reopening-hopes/articleshow/125213706.cms",
            "description": "Indian stocks opened higher on Monday, with the Sensex and Nifty tracking gains across Asian peers. Investors are anticipating a resolution to the U.S. government shutdown and a robust corporate earnings season. This rebound follows last week's losses amid global market volatility.",
            "pubDate": "2025-11-10T05:19:58.522651"
        },
        {
            "title": "Will a pullback in $25 trillion global AI trade help Sensex shed its worst-performing tag?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-a-pullback-in-25-trillion-global-ai-trade-help-sensex-shed-its-worst-performing-tag/articleshow/125213804.cms",
            "description": "Global AI stock fatigue may shift investor focus to India. As AI valuations are questioned, capital could flow into markets like India, which have been left out of the recent tech rally. This could help Indian equities shed their worst-performing tag. Strong domestic fundamentals and expected earnings growth offer a compelling alternative for investors seeking diversification and balanced growth.",
            "pubDate": "2025-11-10T05:19:58.522744"
        },
        {
            "title": "Shipping Corporation of India shares plunge 7% as Q2 net profit tumbles 39% to Rs 176 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shipping-corporation-shares-in-focus-as-q2-net-profit-tumbles-39-to-rs-176-crore/articleshow/125213734.cms",
            "description": "Shipping Corporation of India  share price: Shipping Corporation of  India reported a 39% year-on-year drop in Q2 net profit to Rs 176 crore, with revenue slipping 8% to Rs 1,339 crore. The PSU declared a Rs 3 per share interim dividend for FY26 and fixed November 19 as the record date.",
            "pubDate": "2025-11-10T05:19:58.522839"
        },
        {
            "title": "Ola Electric shares slide 3% even as company rebuts ‘misleading’ report on battery tech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-as-company-rebuts-misleading-report-on-battery-tech/articleshow/125213704.cms",
            "description": "Ola Electric's stock took a hit on Monday amidst swirling rumors. The company swiftly dismissed a report from South Korean media alleging improper acquisition of foreign battery technology. Ola firmly stated it has no desire for obsolete technology and highlighted that its cutting-edge battery production is already underway, with recent certification attained for its battery packs.",
            "pubDate": "2025-11-10T05:19:58.522927"
        },
        {
            "title": "Anant Raj shares surge nearly 4% as Q2 PAT jumps 31% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anant-raj-shares-in-focus-as-q2-pat-jumps-31-yoy/articleshow/125213646.cms",
            "description": "Anant Raj shares: The company posted strong Q2FY26 results with PAT up 30.8% YoY to ₹138 crore and revenue rising 23% to ₹631 crore. Operating performance improved sharply, as EBITDA jumped 49.7% YoY to ₹168.4 crore.",
            "pubDate": "2025-11-10T05:19:58.523014"
        },
        {
            "title": "LIC ditches private banks, chooses SBI and Yes Bank. What’s driving this portfolio shift?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-ditches-private-banks-chooses-sbi-and-yes-bank-whats-driving-this-portfolio-shift/articleshow/125213623.cms",
            "description": "LIC significantly rebalanced its portfolio, divesting from major private banks like HDFC Bank and ICICI Bank to aggressively invest in State Bank of India and Yes Bank. This strategic shift highlights a growing confidence in the PSU banking sector's valuation and future prospects, even as foreign investors flock to private lenders.",
            "pubDate": "2025-11-10T05:19:58.523109"
        },
        {
            "title": "Balrampur Chini, other sugar stocks surge up to 7% as govt clears export quota, lifts duty on molasses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balrampur-chini-other-sugar-stocks-surge-up-to-7-as-govt-clears-export-quota-lifts-duty-on-molasses/articleshow/125215442.cms",
            "description": "Sugar stocks surged up to 7% after the government approved sugar exports and scrapped duties on a key by-product. Balrampur Chini rose 5.2%, Dhampur Sugar gained 6.4%, and Shree Renuka Sugars jumped 6.6%, boosted by policy support ahead of the new sugar season.",
            "pubDate": "2025-11-10T05:38:04.982143"
        },
        {
            "title": "Tata Motors Commercial Vehicles stock likely to list on D-Street this month. Here’s what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-commercial-vehicles-stock-likely-to-list-on-d-street-this-month-heres-what-to-expect/articleshow/125215308.cms",
            "description": "Tata Motors Commercial Vehicles stock is expected to list on Dalal Street this month. This marks the debut of India's largest truck and bus maker as a standalone company. Shareholders will receive one TMLCV share for every Tata Motors share held. The listing is anticipated to attract strong institutional interest.",
            "pubDate": "2025-11-10T05:38:04.982246"
        },
        {
            "title": "After Rs 11,000 cr already raised, Swiggy’s new QIP prompts critique. “No return left to dilute”, says Devina Mehra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-rs-11000-cr-already-raised-swiggys-new-qip-prompts-critique-no-return-left-to-dilute-says-devina-mehra/articleshow/125221434.cms",
            "description": "Swiggy’s new Rs 10,000 cr QIP raises concerns as investor Devina Mehra critiques repeated fundraises by loss-making startups, warning of limited returns and cautioning investors to focus on fundamentals amid growing hype in high-valuation tech listings.",
            "pubDate": "2025-11-10T10:11:56.415399"
        },
        {
            "title": "Goldman Sachs gives 4 themes, 11 stocks for India alpha hunters after largest Nifty underperformance in two decades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-gives-4-themes-11-stocks-for-india-alpha-hunters-after-largest-nifty-underperformance-in-two-decades/articleshow/125220363.cms",
            "description": "Goldman Sachs upgraded India to Overweight, setting a Nifty target of 29,000 by 2026. The brokerage cited strong earnings prospects and outlined four key investment themes driving future growth.",
            "pubDate": "2025-11-10T10:11:56.415527"
        },
        {
            "title": "​Goldman Sachs upgrades India to ‘Overweight’ with 29,000 Nifty target by 2026. Here’s what’s driving it",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-upgrades-india-to-overweight-with-29000-nifty-target-by-2026-heres-whats-driving-it/slideshow/125219961.cms",
            "description": "Global brokerage firm Goldman Sachs has upgraded India back to Overweight, citing a revival in growth momentum and an improved earnings outlook. The firm noted that Indian equities, which had underperformed peers through 2024, are now poised for a turnaround supported by stronger policy measures, stabilising profits, and easing macro headwinds.According to Goldman Sachs, the upgrade reflects growing optimism over India’s medium-term prospects amid improving domestic demand and supportive monetary policy. The brokerage expects the Nifty index to reach 29,000 by the end of 2026, implying an upside of about 14% from current levels, as structural drivers regain traction and foreign investor sentiment improves.",
            "pubDate": "2025-11-10T10:11:56.415632"
        },
        {
            "title": "Nuvama initiates coverage on Swiggy with ‘Buy’ rating, sets target at Rs 510 on strong food delivery momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-initiates-coverage-on-swiggy-with-buy-rating-sets-target-at-rs-510-on-strong-food-delivery-momentum/articleshow/125219972.cms",
            "description": "Nuvama Institutional Equities initiated coverage on Swiggy with a ‘Buy’ rating and a target price of ₹510, citing its strong scale, improving profitability in food delivery, and early recovery in quick commerce. The brokerage highlighted Swiggy’s turnaround in execution, noting it now outpaces Zomato’s growth and stands among India’s largest hyperlocal delivery players.",
            "pubDate": "2025-11-10T10:11:56.415733"
        },
        {
            "title": "Lenskart's hunt for engineers and a bride for its co-founder: Peyush Bansal’s candid IPO tale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskarts-hunt-for-engineers-and-a-bride-for-its-co-founder-peyush-bansals-candid-ipo-tale/articleshow/125219551.cms",
            "description": "Lenskart's founder shared personal stories at the company's listing ceremony.  The eyewear brand began with challenges, including convincing people to join a 'chashma ka company'.  A teacher's emotional reaction to new glasses highlighted the company's purpose.  Lenskart's shares debuted with caution, but the company remains a significant player in India's eyewear market.  Its technology and brand recognition are key strengths.",
            "pubDate": "2025-11-10T10:11:56.415840"
        },
        {
            "title": "GRSE shares surge 7% as Q2 net profit jumps 57% to Rs 154 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grse-shares-surge-7-as-q2-net-profit-jumps-57-to-rs-154-crore/articleshow/125219546.cms",
            "description": "Garden Reach Shipbuilders and Engineers shares surged up to 7% after the company posted strong Q2 and H1 FY26 results, supported by robust revenue growth, higher profitability, and a healthy order book. Management expressed confidence in sustaining growth momentum, backed by strong project execution and continued order visibility for the year ahead.",
            "pubDate": "2025-11-10T10:11:56.415939"
        },
        {
            "title": "FIIs and MFs bet big! 10 stocks they keep buying, up to 110% returns in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-and-mfs-bet-big-10-stocks-they-keep-buying-up-to-110-returns-in-a-year/slideshow/125219149.cms",
            "description": "Large institutional investors often serve as key trendsetters for individual investors, leveraging their in-depth research and analysis to identify promising investment opportunities that might otherwise be overlooked. This influence becomes particularly notable when both foreign institutional investors (FIIs) and mutual funds (MFs) simultaneously increase their stakes in the same stocks. ET Markets’ analysis reveals that major institutional investors—both FIIs and mutual funds (MFs)—have been steadily increasing their holdings in a select set of companies. Over the last three quarters of calendar year 2025, both FIIs and MFs raised their stakes in 26 stocks, each boasting a market capitalisation of over Rs 1,000 crore. Interestingly, 10 of these stocks have delivered strong gains, rising between 10% and 110% over the past year, with one stock more than doubling investors’ wealth. This consistent buying trend suggests institutional investors remain optimistic about these companies’ growth prospects. (Data Source: ACE Equity).",
            "pubDate": "2025-11-10T10:11:56.416041"
        },
        {
            "title": "Jefferies, other brokerage firms lower Trent target price up to Rs 4,300 amid growth deceleration, LFL pressure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-other-brokerage-firms-lower-trent-target-price-up-to-rs-4300-amid-growth-deceleration-lfl-pressure/articleshow/125218616.cms",
            "description": "Brokerages, including Jefferies, Motilal Oswal, Elara Capital, and HDFC Securities, have trimmed target prices for Trent to as low as Rs 4,300 following Q2 results, citing growth deceleration, weak like-for-like sales, and muted consumer sentiment. Despite stable margins, analysts flagged moderation in revenue momentum and advised caution amid rising competition and valuation concerns.",
            "pubDate": "2025-11-10T10:11:56.416138"
        },
        {
            "title": "Japan's Nikkei rises more than 1% as US Senate moves to end shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-more-than-1-as-us-senate-moves-to-end-shutdown/articleshow/125218367.cms",
            "description": "Japan's Nikkei surged over 1% to 50,911.76, mirroring positive U.S. stock futures on hopes of an end to the government shutdown. Advantest, Tokyo Electron, and SoftBank Group led gains, with smaller chip stocks also seeing significant jumps. Honda Motor fell after a profit forecast cut, while Mercari jumped on strong net profit.",
            "pubDate": "2025-11-10T10:11:56.416246"
        },
        {
            "title": "Lupin shares gain 3%, up for second straight session. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lupin-shares-gain-3-up-for-second-straight-session-heres-why/articleshow/125218327.cms",
            "description": "Lupin shares saw an uptick after Jefferies raised its target price and reiterated a “Buy” rating post-strong Q2 results. The US business hit a multi-year high with $315 million in sales, supported by new launches and robust margins, prompting upward revisions to FY26–FY27 earnings and growth outlook.",
            "pubDate": "2025-11-10T10:11:56.416344"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 29% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-29-in-1-year/articleshow/125217998.cms",
            "description": "As the Q2 numbers continue to pour in, many companies are witnessing upgrades by analysts. What is worth noting is that, after a long period of time, we are witnessing an upgrade in large-cap stocks. This is a clear bullish indication – and not just for the stock markets, but also for parts of the economy. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-11-10T10:11:56.416437"
        },
        {
            "title": "Nalco shares soar 9% after strong Q2 results, interim dividend cheer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nalco-shares-soar-9-after-strong-q2-results-interim-dividend-cheer/articleshow/125217989.cms",
            "description": "Shares of Nalco rose sharply on Monday after the PSU reported a 37% YoY surge in Q2 profit to Rs 1,430 crore and announced a hefty interim dividend of Rs 4 per share. Strong margins, higher aluminium realisations, and progress on refinery expansion projects further boosted investor sentiment and extended the stock’s rally.",
            "pubDate": "2025-11-10T10:11:56.416536"
        },
        {
            "title": "Lenskart after listing: 3 things it can do to win over investors and pull off a Zomato",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-after-listing-3-things-it-can-do-to-win-over-investors-and-pull-off-a-zomato/articleshow/125217402.cms",
            "description": "Lenskart’s much-anticipated market debut fell short of expectations, listing at ₹390 — about 3% below its issue price of ₹402. The stock later recovered to trade near its IPO price amid mild buying interest. The muted listing followed a sharp drop in grey market premium and cautious sentiment. Analysts drew parallels with other new-age listings — Paytm’s disappointing debut and Zomato’s later turnaround into a multibagger.",
            "pubDate": "2025-11-10T10:11:56.416630"
        },
        {
            "title": "Most QSR stocks in red for FY26; Westlife Foodworld, Jubilant FoodWorks shine amid sector blues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/most-qsr-stocks-in-red-for-fy26-westlife-foodworld-jubilant-foodworks-shine-amid-sector-blues/articleshow/125216878.cms",
            "description": "India’s quick service restaurant (QSR) sector has seen six of eight listed stocks decline in FY26, with losses dominating earnings, though Westlife Foodworld and Jubilant FoodWorks defy the downtrend with positive returns.",
            "pubDate": "2025-11-10T10:11:56.416722"
        },
        {
            "title": "China’s producer deflation eases, consumer prices edge up in October",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-producer-deflation-eases-consumer-prices-edge-up-in-october/slideshow/125216399.cms",
            "description": "China’s producer price deflation eased in October, while consumer prices returned to positive territory. The government has been stepping up efforts to curb over-capacity and cut-throat competition among firms, helping stabilise key sectors of the economy. (Source: Reuters)",
            "pubDate": "2025-11-10T10:11:56.416811"
        },
        {
            "title": "Lenskart shares climb over 3% in debut after weak open below IPO price. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-shares-climb-over-3-in-debut-after-weak-open-below-ipo-price-what-should-investors-do/articleshow/125215899.cms",
            "description": "Lenskart shares made a choppy debut, listing below the IPO price but rebounding over 3% intraday as investors balanced steep valuations with strong growth prospects. Analysts flagged rich pricing and thin margins, while some see long-term potential in India’s expanding eyewear market.",
            "pubDate": "2025-11-10T10:11:56.416901"
        },
        {
            "title": "Market Wrap: Sensex ends 319 pts higher, Nifty tops 25,570 as global sentiment brightens on U.S. reopening hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-ends-319-pts-higher-nifty-tops-25570-as-global-sentiment-brightens-on-u-s-reopening-hopes/articleshow/125221851.cms",
            "description": "Indian stock markets closed higher on Monday. The Sensex and Nifty saw gains, mirroring positive trends in Asian markets. Optimism grew as Washington neared a resolution to the US government shutdown. Investor sentiment was further boosted by strong quarterly earnings reports. This led to stock-specific rallies and an overall upward movement in the markets.",
            "pubDate": "2025-11-10T10:38:07.493139"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125231540.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-11-10T18:47:14.567590"
        },
        {
            "title": "Two Trades for Today: An IT services major for 6.3% gain, a large-cap capital goods stock for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-it-services-major-for-6-3-gain-a-large-cap-capital-goods-stock-for-almost-7-rise/articleshow/125231108.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-10T18:47:14.567887"
        },
        {
            "title": "Market Trading Guide: Buy Nykaa, BHEL and 3 more stocks on Tuesday for up to 20% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-nykaa-bhel-and-3-more-stocks-on-tuesday-for-up-to-20-gains/slideshow/125227786.cms",
            "description": "India's heartbeat index Nifty today ended its three-sessions losing streak to close positive, aided by strong gains in IT and pharma stocks. The trade was in a narrow range of 25,500–25,650 as the index felt resistance near the 50 EMA.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that the index failed to sustain above the 21 EMA on a closing basis, which is a signal that weakness may persist over the next 1-2 sessions. \"From a broader perspective, the index has taken support along the upper band of the falling channel on the daily timeframe, suggesting that the broader structure remains intact. However, a decisive move above 25,600 will be crucial to confirm the resumption of a directional upward move. Until then, the index is likely to continue its sideways consolidation phase,\" De said.Here are 5 stock recommendations for Tuesday:",
            "pubDate": "2025-11-10T18:47:14.567989"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/125228231.cms",
            "description": "Indian markets closed higher on Monday with Sensex up 319 points and Nifty rising 82 points, tracking global optimism over a potential US government shutdown resolution and strong Q2 earnings-driven investor sentiment.",
            "pubDate": "2025-11-10T18:47:14.568090"
        },
        {
            "title": "Tata Motors CV arm listing date announced. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-cv-arm-listing-date-announced-check-details/articleshow/125228095.cms",
            "description": "Tata Motors’ commercial vehicle arm (TMCV) will debut on exchanges on November 12, completing the automaker’s demerger into two listed entities—one for CVs and another for PVs, EVs, and JLR. Analysts see strong value unlocking potential.",
            "pubDate": "2025-11-10T18:47:14.568190"
        },
        {
            "title": "Block deal: BofA turns buyer, Goldman seller in Nifty stocks ICICI Bank and Apollo Hospitals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/block-deal-bofa-turns-buyer-goldman-seller-in-nifty-stocks-icici-bank-and-apollo-hospitals/articleshow/125228007.cms",
            "description": "BofA acquired ICICI Bank and Apollo Hospitals shares worth Rs 88 crore in Monday’s block deals, while Goldman Sachs was the seller. ICICI Bank closed marginally higher, whereas Apollo Hospitals slipped 1.4% amid mixed trading sentiment.",
            "pubDate": "2025-11-10T18:47:14.568284"
        },
        {
            "title": "S&P 500, Nasdaq soar over 1% on hopes of government reopening",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-soar-over-1-on-hopes-of-government-reopening/articleshow/125226926.cms",
            "description": "Wall Street's main indexes opened higher on Monday, with risk sentiment aided by signs of progress in Washington to end a record U.S. government shutdown that has stalled economic data releases and intensified concerns over the state of the economy.",
            "pubDate": "2025-11-10T18:47:14.568384"
        },
        {
            "title": "Sunday PropTech to investors: On track to deliver Rs 42 crore EBITDA in FY26, eyeing 3x growth in FY27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/proptech-to-investors-on-track-to-deliver-rs-42-crore-ebitda-in-fy26-eyeing-3x-growth-in-fy27/articleshow/125226373.cms",
            "description": "Sunday PropTech, backed by PRISM, anticipates a robust Rs 42 crore EBITDA by FY26, marking its first full operational year. The firm is actively pursuing 12 hotel acquisitions this fiscal, with seven already secured for its Sunday Hotels and Palette Hotels brands. Projections for FY27 show a significant threefold revenue and EBITDA surge, fueled by recent Rs 50 crore funding.",
            "pubDate": "2025-11-10T18:47:14.568516"
        },
        {
            "title": "8 midcapcap stocks with sales rising steadily over 4 quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-midcapcap-stocks-with-sales-rising-steadily-over-4-quarters/slideshow/125224205.cms",
            "description": "Increasing Quarterly Sales – For the past four quarters, these companies have consistently grown their net sales quarter after quarter. This steady upward trend signals strong business momentum and confidence. In the NSE midcap segment, eight stocks (excluding banking and financial companies) have stood out with continuous sales growth over the past four quarters, up to the September ’25 quarter, according to StockEdge Turnover Scans.",
            "pubDate": "2025-11-10T18:47:14.568615"
        },
        {
            "title": "Shriram Finance, One97 Comm among 9 financial services stocks that hit 52-week highs; gained up to 23% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-one97-comm-among-9-financial-services-stocks-that-hit-52-week-highs-gained-up-to-23-in-a-month/slideshow/125224080.cms",
            "description": "On Monday, the benchmark Sensex advanced nearly 319 points, ending at 83,535. Amid the market uptrend, nine stocks from the BSE Financial Services Index climbed to their highest levels in a year. These fresh highs are often viewed as bullish signals, indicating robust upward momentum and the potential for sustained gains.",
            "pubDate": "2025-11-10T18:47:14.568706"
        },
        {
            "title": "Gainers & Losers: GRSE, NALCO and Nykaa among 9 stocks that moved most on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-grse-nalco-and-nykaa-among-9-stocks-that-moved-most-on-monday/slideshow/125223595.cms",
            "description": "",
            "pubDate": "2025-11-10T18:47:14.568792"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-27/articleshow/125232695.cms",
            "description": "Here is a market reality: Even when the bulls are gaining ground, the bears are never far away. Now, if they do make an appearance, ask yourself one question before you react to them: Does it make sense for you to sell shares of, say, HDFC Bank, or for that matter any of your large-cap stocks that have reported good Q2 results? Certainly not. Doing so will mean your final return from the market would be less than optimal. So, stay bullish, stay with quality, and stay for the long term. Also, look at the macro picture of the sector you are interested in. If things are turning out fine, there is no reason why the stocks will not do well.",
            "pubDate": "2025-11-10T19:25:45.905230"
        }
    ]
}