{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-12T15:57:39.446857",
    "items": [
        {
            "title": "Zerodha to change how it releases margins on equity F&O expiry day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-to-change-how-it-releases-margins-on-equity-fo-expiry-day/articleshow/125917812.cms",
            "description": "Zerodha has updated its margin release policy for equity derivatives expiry days, now making funds available by 4 PM after cash market close. This change allows active traders to immediately redeploy capital into commodity markets, which trade until late evening, easing previous capital constraints.",
            "pubDate": "2025-12-12T01:50:08.175076"
        },
        {
            "title": "Asian stocks rise at open after S&P 500 hits record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-at-open-after-sp-500-hits-record-high/articleshow/125923717.cms",
            "description": "Asian stocks opened higher, mirroring record highs in US and global equities following the Federal Reserve's interest-rate cut. SoftBank Group saw a significant jump, while caution lingered for some tech names despite the broader rally. The market anticipates continued momentum into year-end and potentially 2026.",
            "pubDate": "2025-12-12T01:50:08.175183"
        },
        {
            "title": "GIFT Nifty up 110 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125917689.cms",
            "description": "Indian equities rose on Thursday, with the Nifty ending its three-day decline. Foreign institutional investors continued their selling streak for the eleventh consecutive session. Key economic data releases from India and the UK are anticipated today, while the Indian rupee hit an all-time low against the US dollar.",
            "pubDate": "2025-12-12T01:50:08.175282"
        },
        {
            "title": "Stocks in news: BEML, IndiGo, Jindal Steel, ITC Hotels, Glenmark Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-beml-indigo-jindal-steel-itc-hotels-glenmark-pharma/articleshow/125917645.cms",
            "description": "Indian markets saw a rebound on Thursday after three days of decline. Analysts suggest caution until a key resistance level is cleared. Investors should watch banking and IT stocks closely for market direction. Global market trends, especially from the US, will also play a role.",
            "pubDate": "2025-12-12T01:50:08.175380"
        },
        {
            "title": "Fairfax emerges as frontrunner to acquire government–LIC stake in IDBI Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fairfax-emerges-as-frontrunner-to-acquire-governmentlic-stake-in-idbi-bank/articleshow/125923675.cms",
            "description": "Fairfax Financial seems poised to take the lead in acquiring a significant stake in IDBI Bank, with Kotak Mahindra Bank hot on its heels. As financial bids draw near, there’s speculation about a potential deadline extension. Fairfax is leaning towards a full cash offer amidst the government and LIC's plans to offload more than 60% of the bank's shares.",
            "pubDate": "2025-12-12T01:50:08.175499"
        },
        {
            "title": "Oracle's 14.4% plunge weighs on Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracles-14-4-plunge-weighs-on-wall-street/articleshow/125923499.cms",
            "description": "The Nasdaq experienced a one-week low as Oracle's significant AI spending plans overshadowed a dovish Federal Reserve. Oracle's stock plummeted after its quarterly forecasts missed expectations, raising concerns about its AI cloud strategy burning cash. Technology stocks, including Nvidia and Broadcom, also declined, impacting the S&P 500 and semiconductor index.",
            "pubDate": "2025-12-12T01:50:08.175602"
        },
        {
            "title": "Despite the stress, big banks keep playing credit cards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-the-stress-big-banks-keep-playing-credit-cards/articleshow/125923546.cms",
            "description": "Several mid-sized lenders, including Kotak Mahindra Bank, RBL Bank, and IndusInd Bank, are slowing new credit card issuances due to ongoing sector stress and a focus on cleaning up books. This contrasts with larger banks like HDFC Bank and ICICI Bank, which continue aggressive portfolio expansion.",
            "pubDate": "2025-12-12T01:50:08.175884"
        },
        {
            "title": "Kotak Bank eyes mid-market loans amid slow big-corp demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-bank-eyes-mid-market-loans-amid-slow-big-corp-demand/articleshow/125923548.cms",
            "description": "Kotak Mahindra Bank is expanding its mid-market corporate loan book, targeting companies with ₹500 crore to ₹1,500 crore in turnover. This segment, which has grown over 35% compounded annually since its launch, is expected to see 20-25% growth over the next five years. The bank aims for this mid-market book to reach at least 20% of its total corporate portfolio.",
            "pubDate": "2025-12-12T01:50:08.175978"
        },
        {
            "title": "RBI relaxes rules on current, CC and OD accounts; threshold raised to ₹10 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-relaxes-rules-on-current-cc-and-od-accounts-threshold-raised-to-10-crore/articleshow/125923536.cms",
            "description": "The Reserve Bank of India has relaxed norms for business accounts. Customers can now open current, cash credit, and overdraft accounts more easily. The aggregate exposure limit for opening these accounts without restriction has been raised. New rules will be effective from April 2026. Banks will have specific criteria for maintaining accounts with higher exposures.",
            "pubDate": "2025-12-12T01:50:08.176254"
        },
        {
            "title": "Lenders to MSME units face concentration risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenders-to-msme-units-face-concentration-risk/articleshow/125923621.cms",
            "description": "MSME lenders face significant concentration risk as a small fraction of borrowers holds over half of the total outstanding loans. Despite this, the sector's portfolio quality improved, with the share of loans at risk declining. Public sector banks lead in the micro segment, while private banks dominate small and medium enterprises.",
            "pubDate": "2025-12-12T01:50:08.176343"
        },
        {
            "title": "NBCC  shares in focus on securing projects worth Rs 289 crore from NALCO, SAIL Bokaro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-shares-in-focus-on-securing-projects-worth-rs-289-crore-from-nalco-sail-bokaro/articleshow/125924486.cms",
            "description": "NBCC (India) Ltd will be in focus after securing two domestic project management consultancy contracts worth about Rs 289.39 crore from NALCO and SAIL Bokaro. The assignments include extensive civil, infrastructure, and desilting works, strengthening the company’s order book and expanding its role in major public-sector development projects.",
            "pubDate": "2025-12-12T03:14:13.409884"
        },
        {
            "title": "InterGlobe Aviation shares in focus as DGCA summons IndiGo CEO Pieter Elbers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/interglobe-aviation-shares-in-focus-as-dgca-summons-indigo-ceo-pieter-elbers/articleshow/125924462.cms",
            "description": "InterGlobe Aviation is expected to remain in focus after the DGCA summoned IndiGo CEO Pieter Elbers amid ongoing operational disruptions. The regulator seeks his assistance in its inquiry into widespread cancellations and crew-related issues. This development places additional attention on the airline’s strained operations and regulatory scrutiny as travel disruptions intensify.",
            "pubDate": "2025-12-12T03:14:13.410013"
        },
        {
            "title": "HDFC Bank among 4 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-among-4-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125924436.cms",
            "description": "On December 11, four Nifty50 stocks appeared in the RSI Trending Up scan on stockedge.com. An RSI moving above 50 suggests strengthening momentum and often acts as an early uptrend trigger, pointing to potential buying opportunities as price strength begins to build.",
            "pubDate": "2025-12-12T03:14:13.410116"
        },
        {
            "title": "Stocks to buy for 2026: Motilal Oswal initiates coverage on Inventurus Knowledge & Sagility; Morgan Stanley maintain overweight on Polycab",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-motilal-oswal-initiates-coverage-on-inventurus-knowledge-sagility-morgan-stanley-maintain-overweight-on-polycab/slideshow/125924165.cms",
            "description": "Brokerages remain optimistic across a diverse set of companies, signalling confidence in themes ranging from industrial manufacturing to renewable energy and specialised services.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-12T03:14:13.410212"
        },
        {
            "title": "Methodhub Software shares to list today. GMP indicates mild premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/methodhub-software-shares-to-list-today-gmp-indicates-mild-premium/articleshow/125924132.cms",
            "description": "Methodhub Software is set to debut on the BSE SME platform on December 12. The company's Initial Public Offering saw a robust subscription of 28.91 times. Despite this strong response, the grey market premium indicates moderate listing expectations. The IPO aims to raise funds for loan repayment, working capital, and expansion.",
            "pubDate": "2025-12-12T03:14:13.410314"
        },
        {
            "title": "Encompass Design IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/encompass-design-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/125924090.cms",
            "description": "Encompass Design India, operating as ScaleSauce, is set to list on the NSE SME platform on December 12. The IPO, which closed on December 9, saw a subscription of 2.19 times, with NIIs showing strong interest. The company, a consumer-brand builder in home, lifestyle, and food categories, aims to use IPO proceeds for infrastructure, working capital, and debt repayment.",
            "pubDate": "2025-12-12T03:14:13.410429"
        },
        {
            "title": "Flywings Simulator shares to debut today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/flywings-simulator-shares-to-debut-today-heres-what-gmp-indicates/articleshow/125924071.cms",
            "description": "Flywings Simulator, an aviation training firm, is set to debut on the NSE SME platform on December 12. The IPO, which closed on December 9, is trading at a 0% grey market premium, suggesting a listing around its issue price. The company plans to use IPO proceeds for pilot-training equipment and general corporate purposes.",
            "pubDate": "2025-12-12T03:14:13.410526"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/125924007.cms",
            "description": "As of December 11, 2025, 17 NSE-listed stocks with a market capitalisation of over Rs 1,000 crore closed above their 200-day moving average (DMA). Of these, we have highlighted the top 9 that posted gains of more than 2.5%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-12-12T03:14:13.410624"
        },
        {
            "title": "Dow, S&P 500 post record closes; Oracle drags on Nasdaq",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-sp-500-post-record-closes-oracle-drags-on-nasdaq/articleshow/125923866.cms",
            "description": "The S&P 500 and Dow Jones closed at record highs Thursday, driven by financial stocks after a less hawkish Federal Reserve. The Nasdaq lagged as Oracle's AI spending concerns and weak forecasts caused its shares to tumble, fueling fears of an AI bubble. Market rotation favored cyclicals and small caps amid anticipation of global growth reacceleration.",
            "pubDate": "2025-12-12T03:14:13.410718"
        },
        {
            "title": "India’s maritime sector at inflection point: A structural opportunity unfolds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-maritime-sector-at-inflection-point-a-structural-opportunity-unfolds/articleshow/125926629.cms",
            "description": "India’s maritime sector is entering a structural growth phase, supported by ambitious national visions, strong policy incentives, rising demand aggregation, and expanding shipbuilding and port capacity. As global trade shifts toward Asia and greener vessels, India is positioned to emerge as a major maritime power over the coming decades.",
            "pubDate": "2025-12-12T05:41:54.417303"
        },
        {
            "title": "Why global diversification is becoming essential for modern investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-global-diversification-is-becoming-essential-for-modern-investors/articleshow/125926422.cms",
            "description": "As investment boundaries fade, global diversification has become essential for long-term wealth creation, especially for investors in emerging markets like India. Spreading investments across geographies reduces dependence on a single economy, offers currency gains, provides access to global innovation, lowers volatility, and opens exposure to sectors underrepresented in domestic markets.",
            "pubDate": "2025-12-12T05:41:54.417406"
        },
        {
            "title": "Motilal Oswal picks 10 stocks to buy for what it sees as multi-trillion dollar opportunity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-picks-10-stocks-to-buy-for-what-it-sees-as-multi-trillion-dollar-opportunity/slideshow/125926369.cms",
            "description": "Motilal Oswal has identified a set of stocks it believes will benefit the most from what it calls India's coming multi-trillion-dollar economic opportunity. The picks cut across autos, financials, capital goods and healthcare, reflecting long-term trends of rising incomes, formalisation, digital adoption and a powerful capex cycle. Here are 10 names from the larger list that anchor this structural growth theme.",
            "pubDate": "2025-12-12T05:41:54.417500"
        },
        {
            "title": "GMDC shares jump 7% on Odisha coal mine project development, awards operating contract",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-shares-jump-7-on-odisha-coal-mine-project-development-awards-operating-contract/articleshow/125926376.cms",
            "description": "Gujarat Mineral Development Corporation shares rose significantly after the company awarded operational duties for its Baitarni-West coal mine in Odisha. This move follows the acquisition of forest and environmental clearances. The development marks a key step in GMDC's coal sector expansion. The company is focused on building a diversified mining business.",
            "pubDate": "2025-12-12T05:41:54.417595"
        },
        {
            "title": "Bruised but not beaten? Swiggy shares down 24% YTD, but a reveral may be on the cards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bruised-but-not-beaten-swiggy-shares-down-24-ytd-but-a-reveral-may-be-on-the-cards/articleshow/125926293.cms",
            "description": "Swiggy shares have rebounded modestly after a steep year-to-date decline, with analysts divided on the stock’s next direction. Some experts highlight improving momentum, strengthening support levels, and easing selling pressure, while others warn of bearish chart patterns and weakening demand zones. With key moving averages and resistance levels in focus, the stock’s upcoming movements will be crucial in confirming whether a true trend reversal is forming.",
            "pubDate": "2025-12-12T05:41:54.417690"
        },
        {
            "title": "Meesho shares slip 3% on day 3 of trading. Should you buy, share, hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-slip-3-on-day-3-of-trading-should-you-buy-share-hold/articleshow/125926289.cms",
            "description": "Meesho’s post-IPO fireworks eased on Friday as the stock slipped on day three of trading, prompting investors to reassess their next move after two sessions of sharp gains. The story breaks down what’s driving the volatility, what brokerages are advising, and whether this is the moment to buy, hold or book profits as Meesho transitions from a blockbuster debut to a more measured market reality.",
            "pubDate": "2025-12-12T05:41:54.417790"
        },
        {
            "title": "10 stocks created Rs 46 lakh crore wealth for investors in last 5 years. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-stocks-created-rs-46-lakh-crore-wealth-for-investors-in-last-5-years-do-you-own-any/slideshow/125925944.cms",
            "description": "India's biggest value creators have added Rs 46 lakh crore in shareholder wealth between 2020 and 2025. A mix of banks, tech, industrials and FMCG names dominate the list, showing how broad the market rally has been. These are the 10 companies that created the most wealth in the last five years. Source: Motilal Oswal",
            "pubDate": "2025-12-12T05:41:54.417910"
        },
        {
            "title": "L&T shares rise over 2% as Goldman Sachs upgrades to Buy. Check target price, upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-shares-rise-over-2-as-goldman-sachs-upgrades-to-buy-check-target-price-upside/articleshow/125925610.cms",
            "description": "Larsen & Toubro shares surged 2.5% to Rs 4,109 after Goldman Sachs upgraded the stock to 'Buy' with a Rs 5,000 target price. The brokerage cited strong growth visibility across segments, a healthy order backlog, and emerging sectors like defence and green hydrogen as key drivers for the re-rating.",
            "pubDate": "2025-12-12T05:41:54.418008"
        },
        {
            "title": "HSBC names 10 stocks that could rally in 2026. How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-names-10-stocks-that-could-rally-in-2026-how-many-do-you-own/slideshow/125925712.cms",
            "description": "Supported by lower inflation, tax reforms, and easier monetary policy, international brokerage firm HSBC believes Indian equities are set to be in a stronger position in 2026. Consensus forecasts point to 10% growth in FY26 and 16% in FY27 as the worst of earnings downgrades seems to be behind and recent results have boosted confidence in the growth outlook. Valuations are now more reasonable, with India’s premium over other emerging markets back to normal levels. Here are the top 10 stocks the brokerage is bullish on heading into 2026.",
            "pubDate": "2025-12-12T05:41:54.418101"
        },
        {
            "title": "Jefferies cuts IndiGo target price to Rs 6,035 due to business disruption",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-cuts-indigo-target-price-to-rs-6035-due-to-business-disruption/articleshow/125925568.cms",
            "description": "Jefferies cut IndiGo’s target price to ₹6,035 from ₹7,025, citing operational disruptions and higher costs that will dent near-term earnings. Despite trimming FY26–28 profit estimates by 13–53%, the brokerage kept its Buy rating, saying IndiGo’s strong market position and global expansion still support meaningful upside.",
            "pubDate": "2025-12-12T05:41:54.418196"
        },
        {
            "title": "Trump pushing for further Fed rate cuts amid leadership shuffle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-pushing-for-further-fed-rate-cuts-amid-leadership-shuffle/articleshow/125925524.cms",
            "description": "President Donald Trump has welcomed the recent Fed rate cut but is pushing for further easing, while the administration accelerates its search for Jerome Powell’s successor. Several candidates are being vetted as concerns grow over central bank independence, with the final choice expected to shape U.S. monetary policy and financial markets.",
            "pubDate": "2025-12-12T05:41:54.418289"
        },
        {
            "title": "Buy, Sell or Hold: Elara maintains buy on Nuvoco Vista; Motilal Oswal reiterates positive stance on Indian Hotels industry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-elara-maintains-buy-on-nuvoco-vista-motilal-oswal-reiterates-positive-stance-on-indian-hotels-industry/articleshow/125925494.cms",
            "description": "Brokerages remain optimistic on select Indian companies across cement, consumer, and hospitality sectors. Elara projects strong capacity expansion and margin growth for Nuvoco Vista, Morgan Stanley adopts a cautious stance on Brainbees Solutions due to slower core growth, while Motilal Oswal remains positive on Indian Hotels amid strong industry tailwinds and rising travel demand.",
            "pubDate": "2025-12-12T05:41:54.418382"
        },
        {
            "title": "IPO gold rush: Promoters, early investors cash out over Rs 1 lakh crore in record 2025 selling spree",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-gold-rush-promoters-early-investors-cash-out-over-rs-1-lakh-crore-in-record-2025-selling-spree/articleshow/125925445.cms",
            "description": "Indian IPOs are witnessing an unprecedented \"gold rush\" as promoters and early investors cashed out over Rs 1 lakh crore this year. This record selling spree, driven by market euphoria, saw existing shareholders pocketing 63% of total IPO proceeds. While concerns about inflated valuations arise, market participants see it as a rational exit opportunity amid strong liquidity.",
            "pubDate": "2025-12-12T05:41:54.418476"
        },
        {
            "title": "Sensex climbs over 450 pts, Nifty tops 26,000 as D-St builds on Fed-driven rebound",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-climbs-over-350-pts-nifty-tops-26000-as-d-st-builds-on-fed-driven-rebound/articleshow/125925359.cms",
            "description": "Indian equities opened higher on Friday, extending the previous day's relief rally fueled by the Federal Reserve's actions. Both the Sensex and Nifty saw gains, with investors maintaining a constructive outlook ahead of crucial domestic inflation data scheduled for release later today.",
            "pubDate": "2025-12-12T05:41:54.418571"
        },
        {
            "title": "HDFC Life, LIC, other insurance stocks in focus ahead of cabinet review of FDI limit hike proposal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-life-lic-other-insurance-stocks-in-focus-ahead-of-cabinet-review-of-fdi-limit-hike-proposal/articleshow/125925274.cms",
            "description": "Insurance stocks may stay active as the Union Cabinet is expected to consider the Insurance Amendment Bill on Friday. The proposal reportedly includes major sector reforms, including raising FDI in insurers to 100% and other changes aimed at modernising the industry.",
            "pubDate": "2025-12-12T05:41:54.418661"
        },
        {
            "title": "Adani Green Energy among 6 F&O stocks with sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-energy-among-6-fo-stocks-with-sharp-rise-in-futures-open-interest/slideshow/125925202.cms",
            "description": "As of December 11, futures open interest surged across nine stocks in the NSE F&O pack, driving a total OI increase of over 5% compared with the previous session. A rise in futures open interest indicates a growth in active, unexpired contracts for a security, reflecting more participants either opening new positions or adding to existing ones.",
            "pubDate": "2025-12-12T05:41:54.418750"
        },
        {
            "title": "Japan's Nikkei climbs on Wall Street relief rally; tech shares slip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-climbs-on-wall-street-relief-rally-tech-shares-slip/articleshow/125928412.cms",
            "description": "Japanese stocks surged on Friday, marking a third consecutive weekly gain, buoyed by positive Wall Street sentiment following a less hawkish US Federal Reserve. The Nikkei 225 closed higher, with the Topix reaching a record. Investors now await the Bank of Japan's policy decision next week, with caution expected early on. Tech stocks saw mixed performance, with some major decliners.",
            "pubDate": "2025-12-12T07:27:09.202190"
        },
        {
            "title": "From Rs 10 crore to Rs 10,600 crore! London's Prudential to pocket 108,170% return from ICICI Prudential AMC IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-rs-10-crore-to-rs-10600-crore-londons-prudential-to-pocket-108170-return-from-icici-prudential-amc-ipo/articleshow/125928078.cms",
            "description": "Prudential Corporation Holdings is set to make ₹10,603 crore from the ICICI Prudential AMC IPO, marking an extraordinary 108,170% return on shares bought 20 years ago for ₹2 each. The firm is selling 4.89 crore shares entirely via OFS at ₹2,165 apiece, reducing its stake from 49% by 10%.",
            "pubDate": "2025-12-12T07:27:09.202332"
        },
        {
            "title": "Hindustan Zinc shares rally 12% in 4 days. What’s powering this surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-rally-12-in-4-days-whats-powering-this-surge/articleshow/125927331.cms",
            "description": "Hindustan Zinc shares surged in four days to Rs 547, driven by soaring silver prices following the US Fed’s rate cuts. As silver more than doubles this year, analysts say the market is still underestimating Hindustan Zinc’s leverage to the metal, which contributes nearly half its EBIT. With strong global positioning, improving margins and rising investor interest, the stock is nearing its 52-week high.",
            "pubDate": "2025-12-12T07:27:09.202553"
        },
        {
            "title": "Refex Industries shares hit 20% lower circuit after Income Tax search at company premises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/refex-industries-shares-hit-20-lower-circuit-after-income-tax-search-at-company-premises/articleshow/125928940.cms",
            "description": "Refex Industries shares plummeted 20% after the Income Tax Department launched search operations at its registered office and group locations. The company stated its operations are unaffected and it's cooperating fully. This news follows recent order wins and steady September-quarter earnings, despite the stock's significant year-to-date decline.",
            "pubDate": "2025-12-12T07:50:52.777780"
        },
        {
            "title": "HCC shares slide 6% to 52-week low as Rs 1,000 crore rights issue opens today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcc-shares-slide-6-to-52-week-low-as-rs-1000-crore-rights-issue-opens-today/articleshow/125928898.cms",
            "description": "HCC shares fell sharply to a 52-week low as its Rs 1,000 crore rights issue opened on Friday, triggering investor caution. The offer includes nearly 80 crore new shares at Rs 12.50 each and remains open until December 22. Post-issue, HCC’s outstanding share count will rise significantly, assuming full subscription.",
            "pubDate": "2025-12-12T07:50:52.777905"
        },
        {
            "title": "Sebi faces privacy hurdles over asset disclosure proposal, chief says",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-faces-privacy-hurdles-over-asset-disclosure-proposal-chief-says/articleshow/125929225.cms",
            "description": "The head of India's markets regulator said on Friday the agency is grappling with privacy concerns as it weighs a panel's proposal requiring senior officers, including the chairperson, to disclose their financial assets and liabilities.",
            "pubDate": "2025-12-12T08:32:01.555925"
        },
        {
            "title": "Impending mergers equals opportunities? Probably yes, for some. 13 PSU banks, 8 with upside potential of up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/impending-mergers-equals-opportunities-probably-yes-for-some-13-psu-banks-8-with-upside-potential-of-up-to-28/articleshow/125928821.cms",
            "description": "When a change in a policy framework occurs, some things are inevitable. For instance, it brings both opportunities and complexity. One sector which has seen a big change is banking. Compared to the start of 2015, the picture is much cleaner and believable today. Which means that the street is now sure that when a bank’s NPA is pegged at 1%, it really is at that level. So, the government played an important role in the clean-up. And that is also why, on the regulatory side, policy continuity is important for banks. Now, after the clean-up, another round of mergers is coming. How will that pan out?",
            "pubDate": "2025-12-12T08:32:01.556027"
        },
        {
            "title": "AI bellwether Broadcom shares fall 5% a day after results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-bellwether-broadcom-shares-fall-5-a-day-after-results/articleshow/125929063.cms",
            "description": "Broadcom shares dropped 4.7% in Frankfurt on Friday a day after the company projected first-quarter revenue above Wall Street estimates, but said margins would fall due to a higher mix of AI revenue.",
            "pubDate": "2025-12-12T08:32:01.556185"
        },
        {
            "title": "These 14 stocks held by over 100 MFs in November month, soar up to 125%; do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-14-stocks-held-by-over-100-mfs-in-november-month-soar-up-to-125-do-you-own-any/slideshow/125930888.cms",
            "description": "When a large number of mutual fund schemes invest in the same stock, it typically reflects strong institutional conviction and often lifts retail investor confidence. As of November 2025, data indicates that 245 stocks were owned by more than 100 mutual fund schemes, highlighting broad-based institutional interest. ETMarkets’ analysis reveals that 101 of these stocks have delivered gains of more than 10% since the start of CY25, while 14 have jumped over 50% in under a year — including one that has turned into a multibagger. This pattern points to the potential resilience and momentum of stocks backed by extensive mutual fund participation. (Data Source: ACE MF, ACE Equity)",
            "pubDate": "2025-12-12T09:53:47.233266"
        },
        {
            "title": "IOC declares interim dividend of Rs 5 per share for FY26, sets December 18 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ioc-declares-interim-dividend-of-rs-5-per-share-for-fy26-sets-december-18-as-record-date/articleshow/125930734.cms",
            "description": "Indian Oil Corporation announced an interim dividend of Rs 5 per share for FY26, fixing 18 December 2026 as the record date. Shares rose intraday, backed by strong yearly returns and improved quarterly profits. The company continues to outperform benchmarks, supported by a consistent dividend history and stable operational performance.",
            "pubDate": "2025-12-12T09:53:47.233405"
        },
        {
            "title": "JSW Energy to raise up to Rs 10,000 cr via issue of securities, stock jumps 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-energy-to-raise-up-to-rs-10000-crore-names-new-cfo/articleshow/125930460.cms",
            "description": "JSW Energy to raise up to Rs 10,000 crore, names new CFO",
            "pubDate": "2025-12-12T09:53:47.233510"
        },
        {
            "title": "Gainers & Losers: New India Assurance,  Hindustan Zinc among 7 stocks in focus on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-new-india-assurance-hindustan-zinc-among-7-stocks-in-focus-on-friday/slideshow/125932635.cms",
            "description": "Indian headline indices closed with gains for the second consecutive session riding on strong action in consumer and energy stocks and well supported by IT and auto. The Nifty closed at 26,046.95, up 148.40 points or 0.57%, while the Sensex rose 449.53 points or 0.53% to finish at 85,267.66. Here are 6 stocks that saw action today:",
            "pubDate": "2025-12-12T11:55:33.001742"
        },
        {
            "title": "Hindustan Zinc and 7 other stocks hit 52-week highs; gains up to 15% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-and-7-other-stocks-hit-52-week-highs-gains-up-to-15-in-a-month/slideshow/125932487.cms",
            "description": "On Friday, the benchmark Sensex climbed 450 points to close at 85,268. Riding this uptrend, eight BSE 200 stocks hit new 52-week highs, marking their strongest levels in a year. Such breakouts typically signal bullish momentum and point to the potential for further short-term gains.",
            "pubDate": "2025-12-12T11:55:33.001872"
        },
        {
            "title": "Nifty may reach 30,000 in 2026, ICICI Direct says, bets on Bajaj Finserv, IOL, and 7 other stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-may-reach-30000-in-2026-icici-direct-says-bets-on-bajaj-finserv-iol-and-7-other-stocks/articleshow/125931809.cms",
            "description": "ICICI Direct expects Nifty to hit 30,000 by 2026, backed by a Cup & Handle breakout, strong long-term support zones, and historical post-correction rallies. The brokerage sees banks leading the next leg and identifies nine top stock picks, citing favourable technical setups and a supportive macro backdrop.",
            "pubDate": "2025-12-12T11:55:33.001975"
        },
        {
            "title": "PSU insurers rally up to 8% as cabinet clears 100% FDI. New India Assurance leads gainers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-insurers-rally-up-to-8-as-cabinet-clears-100-fdi-new-india-assurance-leads-gainers/articleshow/125931685.cms",
            "description": "State-run insurance stocks rallied after the Union Cabinet approved 100% FDI in the insurance sector, triggering strong market optimism. New India Assurance led the gains, followed by GIC, LIC, and private insurers such as ICICI Prudential and SBI Life. The reform aims to attract foreign capital, streamline licensing, and introduce composite licences, forming a key part of the government's “Insurance for All by 2047” vision.",
            "pubDate": "2025-12-12T11:55:33.002077"
        },
        {
            "title": "Market Wrap:  Sensex adds 450 pts, Nifty above 26,000 in Fed-driven market bounce",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-adds-450-pts-nifty-above-26000-in-fed-driven-market-bounce/articleshow/125931398.cms",
            "description": "Indian equities rose on Friday, with the Sensex and Nifty extending their Fed-driven rebound even as both ended the week lower. Metals and realty led gains, midcaps outperformed, and global sentiment improved after the U.S. rate cut. However, a weaker rupee, FII outflows, and tech-sector jitters capped enthusiasm.",
            "pubDate": "2025-12-12T11:55:33.002175"
        },
        {
            "title": "Jefferies pegs Nifty Dec 2026 target at 28,300 on improved EPS growth cushioning valuations; names top 10 picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-pegs-nifty-dec-2026-target-at-28300-on-improved-eps-growth-cushioning-valuations-names-top-10-picks/articleshow/125930959.cms",
            "description": "Jefferies forecasts Nifty at 28,300 by December 2026, expecting steady domestic flows, stronger EPS growth, macro stability and sector-wide earnings rebound to support a 10% upside from current levels.",
            "pubDate": "2025-12-12T11:55:33.002278"
        },
        {
            "title": "Despite repeated nudges, 62% of Zerodha users with holdings still don’t have a nominee: Nithin Kamath",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-repeated-nudges-62-of-zerodha-users-with-holdings-still-dont-have-a-nominee-nithin-kamath/articleshow/125934549.cms",
            "description": "Nithin Kamath says 62% of Zerodha users with holdings still lack nominees despite an online process, urging investors to notify nominees to prevent unclaimed assets as Sebi defers its nomination framework’s third phase.",
            "pubDate": "2025-12-12T13:10:59.240682"
        },
        {
            "title": "Why Zerodha says no to credit cards and personal loans, according to Nithin Kamath",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-zerodha-says-no-to-credit-cards-and-personal-loans-according-to-nithin-kamath/articleshow/125934929.cms",
            "description": "Nithin Kamath says Zerodha limits lending to loans against securities due to higher funding costs, tougher competition, and risks linked to unsecured credit. Lower-risk, collateral-backed loans align better with its philosophy and customer base, making them a natural extension of its broking business.",
            "pubDate": "2025-12-12T13:46:29.538462"
        },
        {
            "title": "Stock Market Holidays 2026: Full list from NSE has 7 long weekends, along with a surprise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holidays-2026-full-list-from-nse-has-7-long-weekends-along-with-a-surprise/articleshow/125934748.cms",
            "description": "NSE has released the 2026 trading holiday calendar with 15 market holidays, weekend festival dates, and details on the Muhurat Trading session. The schedule helps investors plan expiries, liquidity strategies and portfolio actions as global brokerages project a recovery year for equities.",
            "pubDate": "2025-12-12T13:46:29.538595"
        },
        {
            "title": "S&P 500, Nasdaq open lower, Dow rises as Broadcom adds to AI bubble angst",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-open-lower-dow-rises-as-broadcom-adds-to-ai-bubble-angst/articleshow/125935718.cms",
            "description": "The S&P 500 and the Nasdaq opened lower on Friday as Broadcom's latest results added to concerns about an AI-fueled bubble, dampening optimism stoked by the Federal Reserve's less-hawkish-than-expected signals on 2026 rate cuts.",
            "pubDate": "2025-12-12T14:54:57.918986"
        },
        {
            "title": "US Fed dissenters flag need for more data, inflation risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-dissenters-flag-need-for-more-data-inflation-risks/articleshow/125935578.cms",
            "description": "Two officials who voted against the Federal Reserve's decision to lower interest rates again this week cited a need for more economic data and too-hot inflation in explaining their decisions on Friday.",
            "pubDate": "2025-12-12T14:54:57.919089"
        },
        {
            "title": "Market responds to fundamentals, says Vijay Kedia as his latest SME IPO pick doubles money",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-responds-to-fundamentals-says-vijay-kedia-as-his-latest-sme-ipo-pick-doubles-money/articleshow/125935552.cms",
            "description": "Vijay Kedia said Exato Technologies’ stellar SME debut proves stock prices ultimately follow business fundamentals, as the AI-led tech firm nearly doubled on listing after a record 947× subscription across investor categories and strong financial performance supporting its growth story.",
            "pubDate": "2025-12-12T14:54:57.919280"
        },
        {
            "title": "LIC trimmed Adani Ports stake by 2% between 2022 and 2025. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-trimmed-adani-ports-stake-by-2-between-2022-and-2025-check-details/articleshow/125936050.cms",
            "description": "LIC has reduced its stake in Adani Ports to 7.34% by selling nearly 3.9 crore shares since 2022, even as the stock outperforms benchmarks and posts strong quarterly revenue and profit growth.",
            "pubDate": "2025-12-12T15:14:51.829359"
        },
        {
            "title": "Adani Green insider trading: Sebi ends case against Pranav Adani without any direction or penalty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-insider-trading-sebi-ends-case-against-pranav-adani-without-any-direction-or-penalty/articleshow/125936216.cms",
            "description": "Sebi has dropped insider trading charges against Pranav Adani and two others, ruling their Adani Green trades occurred after news of the SB Energy acquisition became public, making the information no longer price sensitive.",
            "pubDate": "2025-12-12T15:37:11.972073"
        },
        {
            "title": "Cannabis stocks surge on report Trump seeks to ease restrictions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cannabis-stocks-surge-on-report-trump-seeks-to-ease-restrictions/articleshow/125936236.cms",
            "description": "Shares of cannabis companies jumped on Friday after the Washington Post reported U.S. President Donald Trump is expected to push the government to dramatically loosen federal restrictions on marijuana.",
            "pubDate": "2025-12-12T15:57:38.903131"
        }
    ]
}