{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-25T17:01:23.759884",
    "items": [
        {
            "title": "IDFC First Bank Q3 Results: PAT falls 53% YoY on account of higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idfc-first-bank-q3-results-pat-falls-53-yoy-on-account-of-higher-provisions/articleshow/117554402.cms",
            "description": "Provisions for the quarter stood at Rs 1,338 crore as compared with Rs 655 crore in the year-ago quarter, driven by the higher slippages in the microfinance book. The bank said provisions were stable for the non-microfinance portfolio.",
            "pubDate": "2025-01-25T17:01:03.217615"
        },
        {
            "title": "Macrotech Developers Q3 profit rises 88% to Rs 944 cr on higher income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/macrotech-developers-q3-profit-rises-88-pc-to-rs-944-cr-on-higher-income/articleshow/117553377.cms",
            "description": "Macrotech Developers, operating under the Lodha brand, posted an 88% rise in net profit for Q3 FY25, hitting Rs 944.4 crore due to a surge in housing demand. Their total income increased to Rs 4,146.6 crore. The firm achieved its highest pre-sales of Rs 4,510 crore and recorded robust collections of Rs 4,290 crore.",
            "pubDate": "2025-01-25T17:01:03.217750"
        },
        {
            "title": "IDFC First Bank Q3 results: PAT declines 53% YoY; NII grows 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idfc-first-bank-q3-results-pat-declines-53-yoy-nii-grows-14/articleshow/117552553.cms",
            "description": "IDFC First Bank reported a 15% decline in net profit for Q3FY25, while its net interest income rose by 14%. The bank's gross NPA ratio improved to 1.94%, and customer deposits increased by 28.8% YoY. CASA deposits surged by 32.3%, and the CASA ratio stood at 47.7%.",
            "pubDate": "2025-01-25T17:01:03.217858"
        },
        {
            "title": "Strong fee income, reducing PSL gap helps Yes Bank post growth in profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/strong-fee-income-reducing-psl-gap-helps-yes-bank-post-growth-in-profit/articleshow/117552362.cms",
            "description": "Yes Bank's net profit surged to Rs 612 crore in the December 2024 quarter, driven by a robust growth in fee income, reduced RIDF deposits, and lower provisions due to improved asset quality. The bank's non-interest income grew by 27%, and its gross NPA ratio dropped to 1.6%. Additionally, SME and mid-large corporate advances increased by 27% year-on-year.",
            "pubDate": "2025-01-25T17:01:03.217960"
        },
        {
            "title": "NTPC Green Energy Q3 profit grows 18% to Rs 66 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ntpc-green-energy-q3-profit-grows-18-pc-to-rs-66-cr/articleshow/117551631.cms",
            "description": "NTPC Green Energy Ltd (NGEL) reported an 18% increase in net profit to Rs 65.61 crore for Q3 FY25, driven by higher income. The total income rose to Rs 581.46 crore. NGEL's subsidiary, NTPC Renewable Energy Limited, recently secured a 300 MW solar project from NHPC.",
            "pubDate": "2025-01-25T17:01:03.218059"
        },
        {
            "title": "ICICI Bank Q3 Results: PAT up 15% YoY to Rs 11,792 crore; NII grows 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q3-results-pat-up-15-yoy-to-rs-11792-crore-nii-grows-9/articleshow/117550086.cms",
            "description": "ICICI Bank on Saturday reported that its standalone Q3 profit after tax grew by 14.8% year-on-year (YoY) to Rs 11,792 crore while net interest income (NII) increased 9.1% YoY to Rs 20,371 crore during the December quarter.",
            "pubDate": "2025-01-25T17:01:03.218165"
        },
        {
            "title": "Yes Bank Q3 results: PAT jumps 164.5% at Rs 612.27 cr; NII advances 10.2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-q3-results-pat-jumps-multifold-at-rs-612-27-cr-interest-income-up-12/articleshow/117547192.cms",
            "description": "Meanwhile, the interest paid by the bank was Rs 5,605.62 crore for the same period, up by 12.8% from Rs 4,967.96 crore in the year-ago period.",
            "pubDate": "2025-01-25T17:01:03.218263"
        },
        {
            "title": "IndiGo flies high despite turbulence from a falling rupee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-flies-high-despite-turbulence-from-a-falling-rupee/articleshow/117528815.cms",
            "description": "IndiGo Q3 Results :  IndiGo reported a Q3FY25 profit of ₹2,499 crore, down 18% YoY due to currency fluctuations. Excluding this impact, profit rose 26%, driven by festive demand and strategic expansion.",
            "pubDate": "2025-01-25T17:01:03.218356"
        },
        {
            "title": "JSW Steel Q3 Results: Profit slumps 70% to Rs 719 crore on weak prices of steel",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q3-results-profit-slumps-70-to-rs-719-crore-on-weak-prices-of-steel/articleshow/117527101.cms",
            "description": "JSW Steel Q3 Results : JSW Steel's Q3FY25 net profit slumped 70% YoY to ₹719 crore due to weak steel prices, despite record production of 7.03 million tonnes and a 12% rise in sales volumes.",
            "pubDate": "2025-01-25T17:01:03.218452"
        },
        {
            "title": "DLF surpasses FY25 guidance with highest ever quarterly sales booking in Q3 FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dlf-surpasses-fy25-guidance-with-highest-ever-quarterly-sales-booking-in-q3-fy25/articleshow/117526889.cms",
            "description": "DLF reported a Q3FY25 net profit of ₹1,055 crore, up from ₹648 crore YoY, driven by record sales bookings of ₹12,093 crore, led by luxury project \"The Dahlias.\"",
            "pubDate": "2025-01-25T17:01:03.218549"
        },
        {
            "title": "CreditAccess Grameen Q3 Results: Company incurs Rs 100 crore loss on asset quality stress in microfinance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/creditaccess-grameen-q3-results-company-incurs-rs-100-crore-loss-on-asset-quality-stress-in-microfinance/articleshow/117526378.cms",
            "description": "CreditAccess Grameen Q3 Results: CreditAccess Grameen reported a Q3FY25 net loss of ₹100 crore, compared to a ₹353 crore profit last year, due to asset quality stress in the microfinance sector and increased provisions.",
            "pubDate": "2025-01-25T17:01:03.218656"
        },
        {
            "title": "Torrent Pharma Q3 Results: Net profit jumps 14% to Rs 503 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/torrent-pharma-q3-results-net-profit-jumps-14-to-rs-503-crore/articleshow/117526102.cms",
            "description": "Torrent Pharma reported a 14% YoY rise in Q3FY25 net profit to ₹503 crore, driven by strong India sales growth of 12% and revenue momentum in Germany.",
            "pubDate": "2025-01-25T17:01:03.218756"
        },
        {
            "title": "DLF Q3 Results: Cons PAT jumps 61% YoY to Rs 1,059 crore, revenue sees marginal uptick",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dlf-q3-results-cons-pat-jumps-61-yoy-to-rs-1059-crore-revenue-sees-marginal-uptick/articleshow/117525419.cms",
            "description": "DLF Q3 Results:  The net profit in the year-ago period was Rs 657 crore. Revenue from operations for the quarter was Rs 1,529 crore, showing a slight increase from Rs 1,521 crore in the same quarter last year.",
            "pubDate": "2025-01-25T17:01:03.218850"
        },
        {
            "title": "Shriram Finance Q3 Results: Profit shoots up 73% to Rs 3,249 crore; declares interim dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shriram-finance-q3-results-profit-shoots-up-73-to-rs-3249-crore-declares-interim-dividend/articleshow/117525157.cms",
            "description": "Shriram Finance Ltd, the flagship company of diversified conglomerate Shriram Group, on Friday, reported a 73 per cent surge in consolidated net profit to Rs 3,249 crore for the third quarter ended December 2024.",
            "pubDate": "2025-01-25T17:01:03.218937"
        },
        {
            "title": "Torrent Pharma Q3 Results: Net profit rises 14% YoY to Rs 503 cr; revenue at Rs 2,809 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/torrent-pharma-q3-results-net-profit-rises-14-yoy-to-rs-503-cr-revenue-at-rs-2809-cr/articleshow/117525096.cms",
            "description": "Torrent Pharmaceuticals on Friday said its profit after tax increased 14 per cent to Rs 503 crore for the third quarter ended December 2024, driven by robust performance in the domestic market.",
            "pubDate": "2025-01-25T17:01:03.219031"
        },
        {
            "title": "Bank of India Q3 Results: Profit rises 35% to Rs 2,517 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-india-q3-results-profit-rises-35-to-rs-2517-crore/articleshow/117525004.cms",
            "description": "The lenders' total income increased to Rs 19,957 crore during the third quarter of the ongoing fiscal against Rs 16,411 crore a year ago, BoI said in a regulatory filing.",
            "pubDate": "2025-01-25T17:01:03.219124"
        }
    ]
}