{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-27T17:15:34.732402",
    "items": [
        {
            "title": "Fed faces data void ahead of key US rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-faces-data-void-ahead-of-key-us-rate-decision/slideshow/124839871.cms",
            "description": "The Federal Reserve is widely expected to announce its second rate cut of the year on Wednesday, even as policymakers face an unusual challenge — making decisions without key economic data. A prolonged government shutdown has halted the release of vital indicators, leaving officials to assess the economy with limited visibility. (Source: AFP)",
            "pubDate": "2025-10-27T04:44:23.580622"
        },
        {
            "title": "China’s industrial profits surge again, offering fresh signs of recovery",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-industrial-profits-surge-again-offering-fresh-signs-of-recovery/slideshow/124839697.cms",
            "description": "China’s manufacturing sector showed renewed strength as industrial profits rose for the second consecutive month, raising hopes that the world’s second-largest economy may finally be stabilising after months of uneven growth. (Source: Reuters)",
            "pubDate": "2025-10-27T04:44:23.580759"
        },
        {
            "title": "Sammaan Capital among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sammaan-capital-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124839479.cms",
            "description": "As of October 24, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-27T04:44:23.580870"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124839371.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-10-27T04:44:23.580972"
        },
        {
            "title": "Jayaswal Neco Industries, Sammaan Capital among 9 stocks flashing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jayaswal-neco-industries-sammaan-capital-among-9-stocks-flashing-bullish-signals/slideshow/124839399.cms",
            "description": "On October 24, in the Nifty200 pack, nine stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-10-27T04:44:23.581073"
        },
        {
            "title": "Sensex rises over 450 pts, Nifty above 25,900 as US rate cut optimism lifts mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-250-pts-nifty-above-25850-as-us-rate-cut-optimism-lifts-mood/articleshow/124839293.cms",
            "description": "Indian equities surged on Monday, with the Sensex and Nifty rebounding after a brief pause. This upward movement was driven by softer-than-expected U.S. inflation data, which has fueled expectations of two additional interest rate cuts in 2025.",
            "pubDate": "2025-10-27T04:44:23.581204"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains underweight on Dixon Technologies; Elara recommends Accumulate on Kotak Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-underweight-on-dixon-technologies-elara-recommends-accumulate-on-kotak-bank/articleshow/124839212.cms",
            "description": "Brokerages show mixed sentiment on select stocks, with Elara Capital favoring Kotak Mahindra Bank and Coforge due to growth prospects. Conversely, Morgan Stanley is cautious on Dixon Technologies, citing increased competition from Chinese EMS players. This selective optimism highlights the market's focus on earnings visibility and competitive strength.",
            "pubDate": "2025-10-27T04:44:23.581306"
        },
        {
            "title": "Coforge shares rally 6% after Q2 net profit rockets 86% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-shares-in-focus-after-q2-net-profit-rockets-86-yoy-to-rs-376-crore-should-you-buy-sell-or-hold/articleshow/124839253.cms",
            "description": "Coforge's stock took off following impressive quarterly performance. The IT services company enjoyed an 86% increase in net profit alongside a 32% revenue boost. Analysts are upbeat, with several brokerages not only holding onto their buy ratings but also increasing target prices. The company’s robust order book, paired with management’s reassurances on growth, points to exciting opportunities on the horizon.",
            "pubDate": "2025-10-27T04:44:23.581404"
        },
        {
            "title": "6 IPOs to open subscription this week. GMPs suggest investors could bag returns up to 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/6-ipos-to-open-subscription-this-week-gmps-suggest-investors-could-bag-returns-up-to-17/slideshow/124839208.cms",
            "description": "India’s primary market is buzzing again as six IPOs hit the Street this week, together aiming to raise over Rs 1,800 crore across mainboard and SME platforms. From consumer names like Lenskart to smaller logistics and textile firms, investors have a range of options to pick from.",
            "pubDate": "2025-10-27T04:44:23.581500"
        },
        {
            "title": "Dr Reddy’s Laboratories shares fall over 1% on Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-laboratories-shares-in-focus-post-q2-results-should-you-buy-sell-or-hold/articleshow/124839110.cms",
            "description": "Despite an uptick in profits, Dr Reddy's Laboratories experienced a decline in share value. Analysts continue to express optimism, keeping a bullish outlook on the stock. While there are immediate hurdles to navigate, promising catalysts for growth lie ahead, notably with the anticipated launches of Semaglutide and Abatacept.",
            "pubDate": "2025-10-27T04:44:23.581599"
        },
        {
            "title": "Nifty Capital Markets index tops all sectors with 30% 1-yr rally. BSE, king of good times with 70% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-capital-markets-index-tops-all-sectors-with-30-1-yr-rally-bse-king-of-good-times-with-70-gains/articleshow/124839072.cms",
            "description": "Indian capital market stocks have shown remarkable performance, delivering up to 70% returns in the past year. This surge is attributed to increased financialization and digitalization of assets. Growing investor participation and robust trading volumes have benefited exchanges and brokers. While some stocks lagged, the overall outlook remains constructive for the sector.",
            "pubDate": "2025-10-27T04:44:23.581692"
        },
        {
            "title": "Kotak Mahindra Bank shares fall 3% after Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-post-q2-results-should-you-buy-sell-or-hold/articleshow/124839025.cms",
            "description": "Kotak Mahindra Bank shares: The bank’s Q2FY26 standalone net profit fell 2.3% YoY to ₹3,253 crore, even as NII rose 4% to ₹7,311 crore. NIM stood at 4.54% with a 4.70% cost of funds, while operating profit increased 3% YoY to ₹5,268 crore.",
            "pubDate": "2025-10-27T04:44:23.581787"
        },
        {
            "title": "Retail investors are shorting the structural story of auto stocks after GST windfall. What's happening?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-are-shorting-the-structural-story-of-auto-stocks-after-gst-windfall-whats-happening/articleshow/124838944.cms",
            "description": "Retail investors are showing caution towards Indian auto stocks despite GST reforms boosting festive sales. While mutual funds are buying, individual investors are trimming holdings, mirroring some foreign investor sentiment. Analysts suggest concerns about demand sustainability post-festivals and high valuations are driving this divergence, though long-term structural benefits from GST remain.",
            "pubDate": "2025-10-27T04:44:23.581880"
        },
        {
            "title": "AI is Reliance's new oil: How Mukesh Ambani's tech pivot could unlock $30 billion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-is-reliances-new-oil-how-mukesh-ambanis-tech-pivot-could-unlock-30-billion/articleshow/124838870.cms",
            "description": "Mukesh Ambani is steering Reliance Industries towards artificial intelligence, investing $15 billion in a bold tech pivot. This strategic shift aims to transform the conglomerate into a deep-tech powerhouse, potentially valued at $30 billion. Reliance is building AI infrastructure and partnering with tech giants like Meta and Google, while also developing its own AI products.",
            "pubDate": "2025-10-27T04:44:23.581975"
        },
        {
            "title": "Cochin Shipyard among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cochin-shipyard-among-5-stocks-showing-bullish-rsi-upswing/slideshow/124838213.cms",
            "description": "On October 24, in the Nifty200 pack, five stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-27T04:44:23.582067"
        },
        {
            "title": "Japan's Nikkei tops 50,000 mark for first time on stimulus euphoria",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-tops-50000-mark-for-first-time-on-stimulus-euphoria/articleshow/124838017.cms",
            "description": "Japan's Nikkei share average crossed the 50,000 mark for the first time on Monday. This milestone follows successive records driven by expectations of significant spending from the new prime minister, Sanae Takaichi. Investors are reacting positively to Takaichi's growth-focused policies and anticipated economic stimulus packages. The market has seen a strong upward trend since mid-July.",
            "pubDate": "2025-10-27T04:44:23.582177"
        },
        {
            "title": "Vedanta shares gain 2%, extend rally for 4th straight session. What’s behind the momentum?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-gain-2-extend-rally-for-4th-straight-session-whats-behind-the-momentum/articleshow/124840723.cms",
            "description": "Vedanta shares climbed up to 2% to Rs 504.50 on the NSE, marking a four-day rally and a 6% gain, as aluminium prices held firm above $2,850 per tonne on the LME. The metal’s uptrend has been driven by tight supply and robust demand, with production disruptions like Century Aluminum’s Iceland smelter slowdown adding further support.",
            "pubDate": "2025-10-27T05:36:09.924505"
        },
        {
            "title": "Hindalco shares jump over 6% in 3 days, hit record high on copper and aluminium rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindalco-shares-jump-over-6-in-3-days-hit-record-high-on-copper-and-aluminium-rally/articleshow/124840651.cms",
            "description": "Hindalco Industries shares reached a new record on Monday. This surge is fueled by increasing global metal prices and positive sentiment around a potential U.S.-China trade deal. Investors are now anticipating the company's September quarter earnings. Hindalco's strong performance in India and its Novelis business are key drivers. The company is a major player in aluminium and copper production.",
            "pubDate": "2025-10-27T05:36:09.924631"
        },
        {
            "title": "eClerx Services among 5 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eclerx-services-among-5-stocks-that-closed-above-vwap/slideshow/124840128.cms",
            "description": "On October 24, the closing prices of five stocks in the Nifty500 pack rallied over 1% above their VWAP (Volume Weighted Average Price), with a move above VWAP indicating a potential bullish trend, according to technical scan data from StockEdge.com.When the closing price rises above the VWAP, it means the stock closed higher than the average price at which it was traded during the day, with that average weighted by trading volume. Traders and investors often interpret this as a bullish signal, reflecting positive market sentiment.Stocks showing VWAP crossover signals:",
            "pubDate": "2025-10-27T05:36:09.924757"
        },
        {
            "title": "Sanctions shift the game: Revenue squeeze, not supply shock for Moscow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sanctions-shift-the-game-revenue-squeeze-not-supply-shock-for-moscow/slideshow/124840309.cms",
            "description": "Western sanctions on Russia keep making headlines, but the flow of crude oil rarely stops. The question now is — are these measures symbolic, or do they actually shift the balance of global energy trade? (Source: Reuters)",
            "pubDate": "2025-10-27T05:36:09.924869"
        },
        {
            "title": "Federal Bank shares rally 3% to hit record high. What's behind the frenzy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-shares-rally-3-to-hit-record-high-whats-behind-the-frenzy/articleshow/124841514.cms",
            "description": "Federal Bank shares hit a record high after Blackstone announced a $705 million investment for a 9.9% stake, making it the largest shareholder. This significant foreign capital inflow into India's financial sector signals potential banking reforms and increased global participation, as welcomed by industry leaders.",
            "pubDate": "2025-10-27T06:20:44.656785"
        },
        {
            "title": "Mining Multibaggers: FIIs raised stakes in these 5 stocks for 3 straight quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mining-multibaggers-fiis-raised-stakes-in-these-5-stocks-for-3-straight-quarters/slideshow/124841380.cms",
            "description": "Foreign Institutional Investors (FIIs) have steadily increased their holdings in about 125 BSE-listed companies over the past three quarters, using December 2024 as the base period. The analysis considers only those stocks with a market capitalisation above Rs 1,500 crore.Retail investors often pay close attention to the moves of large institutional players such as FIIs, whose investment decisions are typically driven by detailed research and analysis. Among the 125 stocks where FIIs have consistently raised their stakes during this period, more than half have delivered positive price returns over the past year. Notably, 63 of these stocks recorded double-digit gains. Within this group, 11 standout stocks surged between 80% and 200%, with five of them turning into multibaggers — more than doubling in value within just 12 months and significantly enhancing investor wealth. (Data Source: ACE Equity)",
            "pubDate": "2025-10-27T06:20:44.656915"
        },
        {
            "title": "Voda Idea shares surge 13% from day’s low as SC sees no impediment with Centre reconsidering issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-surge-11-after-supreme-court-allows-centre-to-reconsider-agr-dues-issue/articleshow/124841763.cms",
            "description": "Vodafone Idea shares surged over 11% after the government informed the Supreme Court it's willing to reconsider the telecom company's issues. The court saw no impediment, noting the government's equity stake and Vodafone Idea's large customer base as factors for review.",
            "pubDate": "2025-10-27T07:00:33.281882"
        },
        {
            "title": "European shares rise to record high on US-China trade optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-to-record-high-on-us-china-trade-optimism/articleshow/124844362.cms",
            "description": "European shares hit a fresh intraday record high on Monday, building on last week's gains, as signs of easing trade tensions between the United States and China boosted risk appetite.",
            "pubDate": "2025-10-27T08:51:04.804298"
        },
        {
            "title": "Japan's Nikkei tops 50,000 mark for first time on stimulus euphoria",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-tops-50000-mark-for-first-time-on-stimulus-euphoria/articleshow/124843582.cms",
            "description": "Japan's Nikkei share average surged past 50,000 for the first time, marking a significant milestone driven by expectations of substantial spending from the nation's new prime minister, Sanae Takaichi. The blue-chip index's rapid ascent reflects renewed market confidence and a proactive fiscal policy, with gains also boosted by global tech trends.",
            "pubDate": "2025-10-27T08:51:04.804443"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 24% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-24-in-1-year/articleshow/124843327.cms",
            "description": "After a very minor correction, both the Nifty and Sensex are moving higher. Also, market breadth is positive on most days, clearly indicating that the bulls are starting to party again. There is a high probability that the market will remain in the hand of the bulls, but, as investors, it is probably time to look at individual stocks and how things are shaping up in the sector they belong to. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-10-27T08:51:04.804652"
        },
        {
            "title": "Record high coming? Sensex surges over 700 points, Nifty crosses 26,000: 5 factors driving market rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/record-high-coming-sensex-surges-over-700-points-nifty-crosses-26000-5-factors-driving-market-rally/articleshow/124842925.cms",
            "description": "Indian stock markets surged on Monday. The Sensex and Nifty saw significant gains. This rally was fueled by encouraging U.S. inflation figures. Expectations for Federal Reserve rate cuts in 2025 increased. Positive developments in U.S.-China trade negotiations also boosted investor confidence. Global markets are showing a bullish trend.",
            "pubDate": "2025-10-27T08:51:04.804748"
        },
        {
            "title": "Stock Radar: 20% rally in a month! Shipping Corporation hits fresh 52-week high in October – will the rally continue?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-20-rally-in-a-month-shipping-corporation-hits-fresh-52-week-high-in-october-will-the-rally-continue/articleshow/124839012.cms",
            "description": "Shipping Corporation of India (SCI) stock has surged over 20% in a month, breaking out of an inverse head and shoulder pattern on weekly charts. Experts suggest buying for a target of Rs 289 in 3-4 weeks, citing strong technical indicators and a decisive breakout above Rs 240.",
            "pubDate": "2025-10-27T11:57:11.320182"
        },
        {
            "title": "Sebi proposes incentives to boost retail participation in debt securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-incentives-to-boost-retail-participation-in-debt-securities/articleshow/124848287.cms",
            "description": "India's markets regulator has proposed incentives for certain categories of retail investors to encourage them to invest in public issues of debt securities, a consultation paper showed on Monday.",
            "pubDate": "2025-10-27T11:57:11.320309"
        },
        {
            "title": "Zerodha to allow trading in U.S. stocks by 2026, Nithin Kamath says launch coming next quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-to-allow-trading-in-u-s-stocks-by-2026-nithin-kamath-says-launch-coming-next-quarter/articleshow/124847516.cms",
            "description": "Zerodha, India's largest stockbroker by revenue, is gearing up to let its users invest directly in the US stocks by early 2026, according to CEO Nithin Kamath, marking one of the firm's most anticipated product launches aimed at tapping growing demand for global investing.",
            "pubDate": "2025-10-27T11:57:11.320531"
        },
        {
            "title": "Explained: Why Tata Motors Commercial Vehicle shares aren’t visible in your trading app",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-tata-motors-commercial-vehicle-shares-arent-visible-in-your-trading-app/articleshow/124846802.cms",
            "description": "Tata Motors shareholders have received TML Commercial Vehicles (TMLCV) shares following the company’s demerger, but trading remains on hold pending BSE and NSE approvals. The shares will become tradable once listed. Brokerages view the split as a major value-unlocking move, enabling focused growth in both passenger and commercial vehicle segments.",
            "pubDate": "2025-10-27T11:57:11.320637"
        },
        {
            "title": "Sebi puts Vedanta Group's Sterlite Electric public listing on hold",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-puts-vedanta-groups-sterlite-electric-public-listing-on-hold/articleshow/124849613.cms",
            "description": "India's markets regulator has put Sterlite Electric's, the initial public offering (IPO) on hold, according to an update on the regulator's website on Monday.",
            "pubDate": "2025-10-27T12:37:03.566836"
        },
        {
            "title": "Vodafone Idea, SBI among 11 stocks hitting 52-week highs; up to 25% gains in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-sbi-among-11-stocks-hitting-52-week-highs-up-to-25-gains-in-a-month/slideshow/124849310.cms",
            "description": "On Monday, the benchmark Sensex advanced by nearly 567 points, closing at 84,779. During the rally, 11 stocks from the BSE Large-Cap Index touched their 52-week highs, marking their strongest levels in a year. Such breakouts are often seen by traders and investors as bullish signals, reflecting strong upward momentum and prospects for continued gains.",
            "pubDate": "2025-10-27T12:37:03.566975"
        },
        {
            "title": "Auto ancillary stocks: Time for re-rating? Clarity to emerge on winners; 6 auto ancillary stocks with upside potential of up to 33%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-ancillary-stocks-time-for-re-rating-clarity-to-emerge-on-winners-6-auto-ancillary-stocks-with-upside-potential-of-up-to-33/articleshow/124848647.cms",
            "description": "Auto ancillary companies can be put into four categories. First, those that were quick to understand and start work on EV transformation years back, even before auto majors announced their plans. Second, companies that were late because the OEM they supplied was itself not clear about its EV plans. Third, companies that were not able to anticipate the speed at which EV transition would happen. Fourth, companies that cannot make the transition because their products are not required in EVs. In the last two years, as OEMs have firmed up their plans, clarity is emerging on which of the auto ancillaries will emerge winners and be re-rated for the long term.",
            "pubDate": "2025-10-27T12:37:03.567087"
        },
        {
            "title": "Insider Shift: Promoters reduce stakes in 9 largecap stocks in September quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insider-shift-promoters-reduce-stakes-in-9-largecap-stocks-in-september-quarter/slideshow/124849036.cms",
            "description": "A decrease in promoter shareholding can indicate that a company may be raising funds for expansion, as promoters might sell their stakes to generate capital. However, for investors, such moves can also raise concerns about a possible misalignment between management's interests and shareholders'. In the NSE largecap segment, we have highlighted the top nine stocks where promoters trimmed their holdings in the September '25 quarter compared to the June '25 quarter, based on data from the StockEdge shareholding scan.",
            "pubDate": "2025-10-27T12:37:03.567195"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/124854193.cms",
            "description": "Indian markets ended higher on Monday as Sensex and Nifty snapped a six-day winning streak, with investors booking profits near record highs. Analysts remain optimistic, citing easing global headwinds, strong earnings outlook, and supportive domestic reforms.",
            "pubDate": "2025-10-27T17:15:25.448904"
        },
        {
            "title": "Qualcomm shares soar 20% on new AI chip launch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/qualcomm-shares-soar-20-on-new-ai-chip-launch/articleshow/124854015.cms",
            "description": "Shares in US chipmaker Qualcomm skyrocketed on Monday after the company unveiled two new artificial intelligence processors designed for data centers, marking a major push into a market dominated by rivals Nvidia and AMD.",
            "pubDate": "2025-10-27T17:15:25.449019"
        },
        {
            "title": "Market Trading Guide: Hindalco among 3 stocks to buy on Tuesday for up to 13% returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-hindalco-among-3-stocks-to-buy-on-tuesday-for-up-to-13-returns/slideshow/124853896.cms",
            "description": "Indian equities are seeing renewed momentum as traders look for fresh breakouts and rotation plays in metals, IT, and financials. Here are three technical picks with near-term upside potential, according to Axis Securities and Bonanza Portfolio analysts.",
            "pubDate": "2025-10-27T17:15:25.449114"
        },
        {
            "title": "Berkshire cut to 'underperform' by KBW, which cites Geico, tariffs, Warren Buffett's exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-cut-to-underperform-by-kbw-which-cites-geico-tariffs-warren-buffetts-exit/articleshow/124853553.cms",
            "description": "Berkshire Hathaway has been downgraded to \"underperform\" by Keefe, Bruyette & Woods, which said lower car insurance margins, tariffs, falling interest rates, smaller clean energy tax credits and Warren Buffett's departure will weigh on its share price.",
            "pubDate": "2025-10-27T17:15:25.449203"
        },
        {
            "title": "Two Trades for Today: A pharma & biotech firm for a 7.9% gain, a large-cap telecom service stock for an almost 6.5% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-pharma-biotech-firm-for-a-7-9-gain-a-large-cap-telecom-service-stock-for-an-almost-6-5-rise/articleshow/124853129.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-27T17:15:25.449292"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-27/articleshow/124852728.cms",
            "description": "After being relentless sellers for a large part of the calendar year 2025, FPI numbers for October have turned positive. This is the second time that they have turned net buyers this year. Earlier, we had a similar trend in April, May, and June. Why is this important? Because, even as FPIs were selling, constant buying by DIIs had maintained some sort of equilibrium. Now with both being buyers, there will be an impact on stock prices. Also, FPIs tend to invest in certain sectors and stocks of certain caps. So, it is time to have those stocks back on your watchlist.",
            "pubDate": "2025-10-27T17:15:25.449379"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124851422.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-10-27T17:15:25.449463"
        },
        {
            "title": "Strong order booking, project ramp ups to keep Coforge revenue upbeat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-order-booking-project-ramp-ups-to-keep-coforge-revenue-upbeat/articleshow/124851026.cms",
            "description": "Coforge shares rose 4% after strong Q2 results, driven by robust deal wins, margin expansion, and revenue growth ahead of peers. Analysts raised 12-month targets by 5–7%, citing improved visibility and stable attrition.",
            "pubDate": "2025-10-27T17:15:25.449557"
        },
        {
            "title": "US stocks rise to record highs on US-China trade deal hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-at-record-highs-on-us-china-trade-deal-hopes/articleshow/124850906.cms",
            "description": "Wall Street's main indexes notched record highs on Monday as expectations of a U.S.-China trade deal fueled risk-taking at the start of a week dominated by Big Tech earnings and a likely Federal Reserve rate cut.",
            "pubDate": "2025-10-27T17:15:25.449638"
        }
    ]
}