{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-17T06:00:34.091365",
    "items": [
        {
            "title": "Bumper IT buyback helps India ETF pull off rare index beat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bumper-it-buyback-helps-india-etf-pull-off-rare-index-beat/articleshow/126029614.cms",
            "description": "Aditya Birla Sun Life Nifty 50 ETF has outperformed its benchmark by nearly 12% this financial year, a feat achieved by strategically tendering shares into a buyback at a premium. This \"passive-plus\" approach, also benefiting its Nifty IT ETF, aims to offset fees and generate incremental alpha for investors.",
            "pubDate": "2025-12-17T03:09:56.362828"
        },
        {
            "title": "Mukul Agrawal, Ramesh Damani-backed Protean eGov Technologies shares in focus on 4.95% stake acquisition in NSDL Payments Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-ramesh-damani-backed-protean-egov-technologies-shares-in-focus-on-4-95-stake-acquisition-in-nsdl-payments-bank/articleshow/126029424.cms",
            "description": "Protean eGov Technologies is set to gain investor attention after announcing its acquisition of a 4.95% stake in NSDL Payments Bank. This strategic move aims to bolster Protean's digital financial infrastructure, fostering partnerships and developing scalable solutions for underserved segments. The collaboration leverages NSDL Payments Bank's digital-first platform to expand Protean's reach in citizen-centric financial services.",
            "pubDate": "2025-12-17T03:09:56.362962"
        },
        {
            "title": "Stocks to buy for 2026: JSW Infrastructure, Polycab India among 5 stocks that could give 18-40% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-jsw-infrastructure-polycab-india-among-5-stocks-that-could-give-18-40-return-in-1-year/slideshow/126029345.cms",
            "description": "Brokerage recommendations remain focused on companies with strong sectoral tailwinds, healthy balance sheets, and visible earnings growth, even as markets remain selective.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-17T03:09:56.363072"
        },
        {
            "title": "Vedanta shares in focus as NCLT approves demerger into independent listed companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-as-nclt-approves-demerger-into-independent-listed-companies/articleshow/126029388.cms",
            "description": "Vedanta's demerger plan has received formal approval from the NCLT. This will create five separate listed companies. Vedanta Aluminium, Vedanta Oil & Gas, Vedanta Power, and Vedanta Iron & Steel will become independent. The residual Vedanta Limited will house Hindustan Zinc. This move aims for sharper focus and independent capital access for each business.",
            "pubDate": "2025-12-17T03:09:56.363198"
        },
        {
            "title": "Shipwaves Online IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shipwaves-online-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/126029223.cms",
            "description": "Shipwaves Online is set to list on the BSE SME platform today with no grey market premium, indicating muted investor expectations for immediate listing gains. The company's Rs 56.35 crore IPO, which closed on December 12, offered shares at Rs 12 apiece.",
            "pubDate": "2025-12-17T03:09:56.363301"
        },
        {
            "title": "Unisem Agritech shares to list on BSE SME today. Check GMP and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unisem-agritech-shares-to-list-on-bse-sme-today-check-gmp-and-other-details/articleshow/126029111.cms",
            "description": "Unisem Agritech is set to list on the BSE SME platform on December 17, with grey market indicators suggesting a flat debut. The seed manufacturer's IPO, which saw moderate demand, aims to raise Rs 21.45 crore primarily for working capital. The company's post-listing performance will depend on its execution and ability to sustain growth in the competitive agri sector.",
            "pubDate": "2025-12-17T03:09:56.363400"
        },
        {
            "title": "Negative Breakout: These 13 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-13-stocks-cross-below-their-200-dmas/slideshow/126029032.cms",
            "description": "In the Nifty500 pack, 13 stocks' closing prices crossed below their 200 DMA (Daily Moving Averages) on December 16, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-12-17T03:09:56.363495"
        },
        {
            "title": "Wall Street ends mixed, healthcare and energy stocks weigh on S&P",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-ends-mixed-healthcare-and-energy-stocks-weigh-on-sp/articleshow/126028828.cms",
            "description": "The Nasdaq closed higher Tuesday, while the S&P 500 and Dow declined as investors assessed economic data for the Federal Reserve's policy outlook. Nonfarm payrolls saw a modest increase, but the unemployment rate rose. Investors are now pricing in significant interest rate cuts for next year.",
            "pubDate": "2025-12-17T03:09:56.363592"
        },
        {
            "title": "Asian stocks slip after US jobs data, oil rises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-slip-after-us-jobs-data-oil-rises/articleshow/126028619.cms",
            "description": "Asian shares dipped, mirroring Wall Street's decline as weak US jobs data failed to bolster expectations for Federal Reserve interest-rate cuts. Oil prices surged after President Trump announced a \"total and complete blockade\" of Venezuelan oil tankers, escalating tensions.",
            "pubDate": "2025-12-17T03:09:56.363689"
        },
        {
            "title": "Stocks in news: Ola Electric, Vedanta, Coal India, IOB, Lodha Developers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ola-electric-vedanta-coal-india-iob-lodha-developers/articleshow/126010813.cms",
            "description": "Markets ended lower on the weekly expiry day, mirroring weak global and domestic cues, with analysts suggesting a consolidation view for the Nifty. Continued currency deterioration could widen the trading range, potentially dragging the index below 25,700. A stock-specific approach with hedged positions is recommended due to prevailing volatility.",
            "pubDate": "2025-12-17T03:09:56.363786"
        },
        {
            "title": "GIFT Nifty up 10 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126010977.cms",
            "description": "Indian equities declined as caution prevailed due to persistent FII selling and a weakening rupee hitting new lows. Analysts anticipate sideways trading in the near term, lacking significant triggers. The rupee fell to an all-time low of 91.01 against the dollar, attributed to a widening trade deficit.",
            "pubDate": "2025-12-17T03:09:56.363884"
        },
        {
            "title": "Sebi alleges insider trading in Adani Group's open offer for NDTV",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-alleges-insider-trading-in-adani-groups-open-offer-for-ndtv/articleshow/126028477.cms",
            "description": "Sebi has alleged Pranav Adani shared price-sensitive information about Adani Group's NDTV open offer with his brothers-in-law, violating insider trading norms. The regulator served show cause notices, citing communication frequency during the UPSI period. This comes after Sebi recently dropped a similar case against Pranav Adani and his relatives due to lack of evidence.",
            "pubDate": "2025-12-17T03:09:56.363980"
        },
        {
            "title": "NSE turnover slides to two-year low as investors weigh uncertain returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-turnover-slides-to-two-year-low-as-investors-weigh-uncertain-returns/articleshow/126028314.cms",
            "description": "Investor interest in Indian equities has hit a nearly two-year low, with average daily turnover declining significantly. This subdued activity stems from uncertainty and underperformance in mid- and small-cap stocks, impacting retail investors, HNIs, and brokerages alike.",
            "pubDate": "2025-12-17T03:09:56.364074"
        },
        {
            "title": "India set for real GDP growth of 7.5% as inflation stays cool: Axis Bank chief economist Neelkanth Mishra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-set-for-real-gdp-growth-of-7-5-as-inflation-stays-cool-axis-bank-chief-economist-neelkanth-mishra/articleshow/126028498.cms",
            "description": "Axis Bank chief economist Neelkanth Mishra projects India's real GDP to grow 7.5% in the next fiscal, driven by reforms and supportive policies. Headline inflation is expected to remain within the RBI's comfort zone around 4%, with the central bank likely maintaining a softer monetary stance.",
            "pubDate": "2025-12-17T03:09:56.364289"
        },
        {
            "title": "SBI rejigs MD portfolios after Ranjan's elevation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-rejigs-md-portfolios-after-ranjans-elevation/articleshow/126028507.cms",
            "description": "State Bank of India's chairman CS Setty has reshuffled top management portfolios following the arrival of new MD Ravi Ranjan. Ranjan will now oversee risk, compliance, and stressed assets, while Rana Ashutosh Kumar Singh takes charge of international banking, global markets, and technology. The changes aim to streamline operations and leverage expertise across key banking functions.",
            "pubDate": "2025-12-17T03:09:56.364385"
        },
        {
            "title": "Zepto IPO, Swiggy QIP bad news for Eternal investors? Jefferies analysts decode",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zepto-ipo-swiggy-qip-bad-news-for-eternal-investors-jefferies-analysts-decode/articleshow/126031768.cms",
            "description": "Jefferies has reiterated its Buy rating on Eternal with a target price of Rs 480, citing strong growth prospects, improving unit economics and limited impact from Swiggy’s fundraising and Zepto’s potential IPO on competitive dynamics.",
            "pubDate": "2025-12-17T06:00:12.335476"
        },
        {
            "title": "Motilal Oswal initiates coverage on Astra Microwave, sees 24% upside. Here are 8 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-initiates-coverage-on-astra-microwave-sees-24-upside-here-are-8-reasons-why/articleshow/126031736.cms",
            "description": "Motilal Oswal has initiated coverage on Astra Microwave Products with a Buy rating and a target price of Rs 1,100, citing its transition to a full systems player, strong order visibility, expanding defence opportunities and improving margins.",
            "pubDate": "2025-12-17T06:00:12.335607"
        },
        {
            "title": "Coal India among 10 largecap stocks that are paying dividend yield of up to 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-among-10-largecap-stocks-that-are-paying-dividend-yield-of-up-to-7/slideshow/126030937.cms",
            "description": "Even as equity markets remained volatile, dividend-paying largecap stocks continued to offer investors a steady stream of income. Axis Direct’s latest report highlights the top 10 large-cap companies by dividend yield over the last 12 months, showcasing companies that have given consistent cash payouts. The list spans sectors such as metals, financials, oil and gas, and IT. Here’s the full list.",
            "pubDate": "2025-12-17T06:00:12.335718"
        },
        {
            "title": "Smallcap slump year throws up 15 multibaggers. Cupid tops chart with 440% rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-slump-year-throws-up-15-multibaggers-cupid-tops-chart-with-440-rally/articleshow/126031616.cms",
            "description": "Despite a weak year for smallcaps, 15 stocks delivered multibagger returns in 2025. Cupid led the pack with a 440% surge, far outperforming peers such as Indo Thai Securities and Kothari Industrial Corporation. The gains stood out even as the BSE Smallcap index lagged midcaps and largecaps.",
            "pubDate": "2025-12-17T06:00:12.335820"
        },
        {
            "title": "HDB Financial shares down 10% from listing peak. Jefferies says buy with Rs 900 target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdb-financial-shares-down-10-from-listing-peak-jefferies-says-buy-with-rs-900-target-price/articleshow/126031232.cms",
            "description": "HDB Financial Services shares have corrected about 10% from post-listing highs, but Jefferies sees the pullback as an attractive entry point, citing improving growth, stabilising asset quality and expectations of better returns over the medium term.",
            "pubDate": "2025-12-17T06:00:12.335918"
        },
        {
            "title": "Best medicine for volatile times: Don’t buy a stock, buy a business; 5 pharma stocks with upside potential of up to 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/best-medicine-for-volatile-times-dont-buy-a-stock-buy-a-business-5-pharma-stocks-with-upside-potential-of-up-to-43/articleshow/126030934.cms",
            "description": "Don’t buy a stock, buy a business, says our headline. It’s not as easy as it sounds. But it’s not too difficult either. While there are several ways to identify a good business, keep this one in mind: Look for businesses that fulfil a domestic as well as global “need”. One that offers a product or service where the demand never drops, whatever the state of the economy. Pharma is one such business.",
            "pubDate": "2025-12-17T06:00:12.336014"
        },
        {
            "title": "Shakti Pumps shares slip 5% on profit booking after 40% rally in four days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shakti-pumps-shares-slip-5-on-profit-booking-after-40-rally-in-four-days/articleshow/126031064.cms",
            "description": "Shakti Pumps shares fell sharply on Wednesday as investors booked profits after a sharp 40% rally in just four sessions. The recent surge was driven by multiple order wins in December.   On the technical front, the stock’s 14-day Relative Strength Index (RSI) stands at 65.4. An RSI below 30 indicates oversold conditions, while readings above 70 suggest overbought levels.",
            "pubDate": "2025-12-17T06:00:12.336111"
        },
        {
            "title": "Indraprastha Gas shares rally 5% as Nomura upgrades to Buy. Check target price, upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indraprastha-gas-shares-rally-5-as-nomura-upgrades-to-buy-check-target-price-upside-potential/articleshow/126030914.cms",
            "description": "Indraprastha Gas Ltd (IGL) shares surged after Nomura upgraded the stock to 'Buy' from 'Neutral', citing attractive valuations and margin tailwinds from softer gas prices. The brokerage assigned a target price of Rs 230, implying a 26% upside, as falling US Henry Hub and stable domestic gas prices are expected to boost profitability.",
            "pubDate": "2025-12-17T06:00:12.336207"
        },
        {
            "title": "How a legacy Tata bet helped Rekha Jhunjhunwala buck portfolio slump in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-a-legacy-tata-bet-helped-rekha-jhunjhunwala-buck-portfolio-slump-in-2025/articleshow/126030971.cms",
            "description": "Rekha Jhunjhunwala emerged as a rare outperformer in a tough 2025 for Indian equities, when many marquee investors were hit by the smallcap slump. Her portfolio of 25 listed stocks avoided major losses and ended the year slightly higher, with its value rising from about Rs 40,589 crore to Rs 41,379 crore, highlighting relative resilience in a challenging market cycle.",
            "pubDate": "2025-12-17T06:00:12.336305"
        },
        {
            "title": "Park Medi World  shares list at 4% discount to IPO price on exchanges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/park-medi-world-shares-list-at-4-discount-to-ipo-price-on-bse-nse/articleshow/126030402.cms",
            "description": "Park Medi World debuted on the stock market, listing at a discount of up to 4% despite strong IPO demand. The IPO saw an overall subscription of 8.52 times, with non-institutional investors leading the charge. The NII portion was subscribed nearly 16 times. The hospital chain’s shares opened below grey market expectations, reflecting cautious investor sentiment amid premium valuations, leverage concerns, and broader market conditions influencing debut-day performance.",
            "pubDate": "2025-12-17T06:00:12.336401"
        },
        {
            "title": "Nephrocare Health shares list at 7% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nephrocare-health-shares-list-at-7-premium-over-ipo-price/articleshow/126030392.cms",
            "description": "Nephrocare Health Services debuted on stock exchanges with a 7% premium, opening at Rs 491.70 on BSE and Rs 490 on NSE. The company's Rs 871.39 crore IPO saw robust demand, with QIBs and NIIs leading subscriptions. Nephrocare, India's largest dialysis provider, aims to use IPO proceeds for debt reduction and expansion.",
            "pubDate": "2025-12-17T06:00:12.336511"
        },
        {
            "title": "Why fractional ownership of shares is gaining traction among HNIs in global markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-fractional-ownership-of-shares-is-gaining-traction-among-hnis-in-global-markets/articleshow/126030436.cms",
            "description": "Fractional ownership of shares is emerging as a powerful portfolio tool for HNIs seeking precision, capital efficiency, and global diversification. Popular in US markets, fractional investing allows exposure to high-priced global stocks with exact allocations, enabling better rebalancing, liquidity management, and tactical strategies amid evolving cross-border investment opportunities.",
            "pubDate": "2025-12-17T06:00:12.336604"
        },
        {
            "title": "Balancing Growth and Safety: Building resilient portfolios amid global market swings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balancing-growth-and-safety-building-resilient-portfolios-amid-global-market-swings/articleshow/126030391.cms",
            "description": "Amid heightened global and domestic volatility, Indian equities retain long-term appeal, but HNIs are increasingly prioritising diversification, disciplined asset allocation and quality-focused strategies to manage near-term risks and build resilient portfolios.",
            "pubDate": "2025-12-17T06:00:12.336701"
        },
        {
            "title": "US jobs rebound masks softening trend, Fed seen holding steady in January",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-jobs-rebound-masks-softening-trend-fed-seen-holding-steady-in-january/articleshow/126030349.cms",
            "description": "US job growth rebounded in November, but a higher unemployment rate and data distortions reinforced signs of a cooling labour market, supporting expectations that the Federal Reserve will hold rates steady in the near term while keeping the door open for rate cuts later in 2026.",
            "pubDate": "2025-12-17T06:00:12.336789"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs reduces target on IndiGo marginally; Citi recommends buy on SBI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-reduces-target-on-indigo-marginally-citi-recommends-buy-on-sbi/articleshow/126030316.cms",
            "description": "Brokerage firms remain selectively bullish on Indian equities, with HDFC Securities, Goldman Sachs and Citi identifying medium-term upside potential in IndiaMART InterMESH, InterGlobe Aviation and State Bank of India, supported by strong market positions, visible growth drivers and stable fundamentals despite a mixed macro environment.",
            "pubDate": "2025-12-17T06:00:12.336883"
        },
        {
            "title": "Meesho shares surge 15% to fresh 52-week high as UBS initiates coverage with Buy call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-surge-9-as-ubs-initiates-coverage-with-buy-rating-check-target-price/articleshow/126030293.cms",
            "description": "Meesho's shares surged nearly 9.4% to an intraday high of Rs 187 after UBS initiated coverage with a Buy rating, citing strong growth potential. The stock is now up 76% from its IPO price, boosting co-founder Vidit Aatrey into the billionaire club. UBS predicts robust Net Merchandise Value growth driven by user expansion and increased ordering frequency.",
            "pubDate": "2025-12-17T06:00:12.336988"
        }
    ]
}