{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-30T20:14:38.525754",
    "items": [
        {
            "title": "Sundaram Home Finance Q2 Results: Profit drops 25% to Rs 44 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sundaram-home-finance-q2-results-profit-drops-25-to-rs-44-crore/articleshow/114785642.cms",
            "description": "During the second quarter, Sundaram Home Finance expanded its presence outside South India with new branches in Pune in Maharashtra and Indore in Madhya Pradesh, strengthening its already existing presence in the two states",
            "pubDate": "2024-10-30T20:14:20.383192"
        },
        {
            "title": "EFC arm gets SEBI nod for SM REIT, set to launch Rs 500 cr initial public offer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/efc-arm-gets-sebi-nod-for-sm-reit-set-to-launch-rs-500-cr-initial-public-offer/articleshow/114783045.cms",
            "description": "Managed office space provider EFC (I) Ltd, through its wholly owned step-down subsidiary, EFC REIT, has received the Securities & Exchange Board of India’s (SEBI) registration for EMBERSTONE SM REIT as a Small & Medium Real Estate Investment Trust (SM REIT).",
            "pubDate": "2024-10-30T20:14:20.383310"
        },
        {
            "title": "Unity Small Finance Bank Q2 Results: Profit rises 35% to Rs 187 crore, NPA down to 4.3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/unity-small-finance-bank-q2-results-profit-rises-35-to-rs-187-crore-npa-down-to-4-3/articleshow/114782947.cms",
            "description": "Centrum group promoted Unity Small Finance Bank said it earned a net profit of Rs 187 crore in the September quarter as compared with Rs 138 crore in the year ago period, (up 35% YoY) backed by Rs 18 crore recovery from written off accounts.",
            "pubDate": "2024-10-30T20:14:20.383451"
        },
        {
            "title": "Tata Power Q2 Results: Net profit jumps 51% YoY to Rs 1,533 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-power-q2-results-net-profit-jumps-51-yoy-to-rs-1533-crore/articleshow/114782152.cms",
            "description": "Tata Power Q2 Results: Revenue from operations declined 1% year-on-year to Rs 15,247 crore. Consolidated EBITDA for the quarter increased 23% to Rs 3,808 crore, driven by expanded solar manufacturing, favorable regulatory developments in distribution, and improved operational efficiency across business segments.",
            "pubDate": "2024-10-30T20:14:20.383568"
        },
        {
            "title": "Prudent Corporate Advisory Q2 Results: Profit up 69% YoY to Rs 51 cr, revenue grows by 51%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/prudent-corporate-advisory-q2-results-profit-up-69-yoy-to-rs-51-cr-revenue-grows-by-51/articleshow/114781831.cms",
            "description": "Prudent Corporate Advisory Services reported a 51% year-on-year (YoY) increase in revenue from operations, reaching Rs 286 crore for quarter ended September 2024, driven by a 53% rise in quarterly average AUM in mutual funds and a 36% growth in non-mutual fund revenue.",
            "pubDate": "2024-10-30T20:14:20.383669"
        },
        {
            "title": "L&T Q2 Results: Cons PAT rises 5% YoY to Rs 3,395 crore, revenue jumps 21%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-q2-results-cons-pat-rises-5-yoy-to-rs-3395-crore-revenue-jumps-21/articleshow/114779954.cms",
            "description": "L&T Q2 Results: L&T reported consolidated revenue of Rs 61,555 crore for the quarter ending September 30, 2024, marking a 21% YoY growth, driven by accelerated progress across its Projects & Manufacturing (P&M) portfolio. This revenue exceeded ET Now’s estimate of Rs 57,622 crore. International revenues reached Rs 32,057 crore, making up 52% of total revenue, largely due to a strong international P&M order book, according to the company’s filing.",
            "pubDate": "2024-10-30T20:14:20.383764"
        },
        {
            "title": "Dabur declares dividend of Rs 2.75 per share, fixes November 8 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dabur-declares-dividend-of-rs-2-75-per-share-fixes-november-8-as-record-date/articleshow/114777051.cms",
            "description": "Dabur's board announced an interim dividend of Rs 2.75 per share alongside its Q2 results for fiscal year 2025, with a record date of November 8. Shareholders will receive the dividend on November 22, as per regulatory filings.",
            "pubDate": "2024-10-30T20:14:20.383866"
        },
        {
            "title": "Dabur Q2 Results: PAT drops 17% YoY to Rs 425 crore; revenue falls 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dabur-q2-results-pat-drops-17-yoy-to-rs-425-crore-revenue-falls-5/articleshow/114773997.cms",
            "description": "Dabur Q2 Results:  Dabur India's consolidated net profit fell 17% to Rs 425 crore for the quarter ending September 2024, with revenue dropping 5% to Rs 3,029 crore. The company also announced an interim dividend of Rs 2.75 per share. The shift towards quick commerce impacted traditional sales channels. Dabur remains confident about future growth and recovery in demand.",
            "pubDate": "2024-10-30T20:14:20.383963"
        },
        {
            "title": "Results from Alphabet and Snap lift shares of online ad sellers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/results-from-alphabet-and-snap-lift-shares-of-online-ad-sellers/articleshow/114754615.cms",
            "description": "Online ad sellers gained over $100 billion in stock market value following strong quarterly results from Alphabet, Reddit, and Snap. Alphabet's stock rose 4% due to robust digital advertising and AI-driven cloud service demand. Meta and Amazon also saw stock increases, while Snap jumped 7% due to exceeding revenue and user growth expectations. Reddit surged 20% after forecasting higher-than-expected revenue.",
            "pubDate": "2024-10-30T20:14:20.384055"
        },
        {
            "title": "Q2 results today: L&T, Dabur among 77 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-lt-dabur-among-77-companies-to-announce-earnings-on-wednesday/articleshow/114754563.cms",
            "description": "L&T, Tata Power, and Dabur are key among 77 companies declaring Q2 earnings today. L&T's revenue is expected to rise by 16%, while Dabur may see a 5% year-on-year drop in revenue due to volume declines and distributor inventory corrections. Heavy rains impacted Dabur's out-of-home consumption.",
            "pubDate": "2024-10-30T20:14:20.384155"
        },
        {
            "title": "Cipla Q2 hit by seasonal chill, but investors need not worry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cipla-q2-hit-by-seasonal-chill-but-investors-need-not-worry/articleshow/114744318.cms",
            "description": "Cipla's September-quarter performance saw a 5.6% increase in consolidated net sales and a 15% rise in net profit despite slow seasonal growth in the anti-infectives category. The company expects a resurgence in growth due to seasonal respiratory illnesses and plans to address supply challenges and facility remediations in upcoming quarters.",
            "pubDate": "2024-10-30T20:14:20.384250"
        },
        {
            "title": "Canara Bank Q2 Results: Net profit rises 11% YoY to Rs 4,014 crore on lower provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/canara-bank-q2-results-net-profit-rises-11-yoy-to-rs-4014-crore-on-lower-provisions/articleshow/114737023.cms",
            "description": "Lower provisions helped Canara Bank report a 11.3% year-on-year rise in net profit for the September quarter at Rs 4,014 crore, while pre-provision operating profit remained almost flat on a slim rise in net interest income.",
            "pubDate": "2024-10-30T20:14:20.384346"
        },
        {
            "title": "Honeywell Automation India Q2 Results: Profit falls 5.6% to Rs 115 crore on sluggish demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/honeywell-automation-india-q2-results-profit-falls-5-6-to-rs-115-crore-on-sluggish-demand/articleshow/114735639.cms",
            "description": "Engineering firm Honeywell Automation India reported a 5.6% fall in its second-quarter profit on Tuesday, hurt by slowing demand. The Indian arm of U.S. conglomerate Honeywell International said its profit fell to 1.15 billion rupees ($13.7 million) for the three months ending Sept. 30 from 1.22 billion rupees a year ago.",
            "pubDate": "2024-10-30T20:14:20.384438"
        },
        {
            "title": "Marico Q2 Results: Net profit rises 20% to Rs 433 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/marico-q2-results-net-profit-rises-20-to-rs-433-crore/articleshow/114733934.cms",
            "description": "Homegrown FMCG major Marico Ltd on Tuesday reported an increase of 20.27 per cent in consolidated net profit to Rs 433 crore for the September quarter. It had posted a net profit of Rs 360 crore in the July-September quarter a year ago, Marico said in a regulatory filing.",
            "pubDate": "2024-10-30T20:14:20.384529"
        },
        {
            "title": "Northern Arc Capital Q2 Results: Profit rises 24% to Rs 98 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/northern-arc-capital-q2-results-profit-rises-24-to-rs-98-crore/articleshow/114733874.cms",
            "description": "NBFC firm Northern Arc Capital, which listed on the bourses last month, reported a 24 per cent increase in consolidated net profit to Rs 96 crore for the second quarter ended September 2024. The lender had earned a net profit of Rs 79 crore in the same quarter in the previous financial year.",
            "pubDate": "2024-10-30T20:14:20.384622"
        },
        {
            "title": "HUDCO Q2 Results: Net profit jumps 52% YoY to Rs 689 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hudco-q2-results-net-profit-jumps-52-yoy-to-rs-689-crore/articleshow/114733832.cms",
            "description": "HUDCO Q2 Results: Revenue from operations rose 35% year-on-year to Rs 2,518 crore, up from Rs 1,865 crore a year earlier. Sequentially, Hudco's profit increased 23% from Rs 558 crore in the June quarter, while revenue grew 15% quarter-on-quarter.",
            "pubDate": "2024-10-30T20:14:20.384716"
        }
    ]
}