{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-30T04:09:45.911394",
    "items": [
        {
            "title": "Hindustan Copper among 4 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-among-4-stocks-witness-5-year-swing-high-breakout/slideshow/126243108.cms",
            "description": "In the NSE list of stocks with a market capitalisation above Rs 1,000 crore, four counters witnessed a 5-year swing high at the close on December 29, indicating bullishness, according to technical scan data from StockEdge.A 5-year swing high represents the highest price a stock has reached over five years and acts as a key resistance level. While such moves are considered bullish, they are distinct from a 5-year breakout, which requires a decisive move beyond long-standing resistance.",
            "pubDate": "2025-12-30T03:18:15.496316"
        },
        {
            "title": "Lupin shares in focus after licensing pact with China’s Gan & Lee for GLP-1 drug",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lupin-shares-in-focus-after-licensing-pact-with-chinas-gan-lee-for-glp-1-drug/articleshow/126243069.cms",
            "description": "Lupin Ltd has secured exclusive rights in India for Bofanglutide, a novel fortnightly GLP-1 receptor agonist, through a licensing agreement with China's Gan & Lee Pharmaceuticals. This strategic move bolsters Lupin's diabetes and obesity treatment portfolio, offering a convenient and effective option for patients amidst a growing metabolic health challenge in India.",
            "pubDate": "2025-12-30T03:18:15.496440"
        },
        {
            "title": "RVNL shares in focus after emerging as L1 bidder for Rs 201 crore wagon workshop project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-after-emerging-as-l1-bidder-for-rs-201-crore-wagon-workshop-project/articleshow/126243057.cms",
            "description": "Rail Vikas Nigam Limited shares will be in focus after the company emerged as the lowest bidder for an East Coast Railway project worth Rs 201.23 crore. The order involves setting up a wagon POH workshop and strengthens RVNL’s domestic railway infrastructure order book.",
            "pubDate": "2025-12-30T03:18:15.496543"
        },
        {
            "title": "Shriram Finance shares in focus as CARE upgrades credit rating to AAA following MUFG deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-shares-in-focus-as-care-upgrades-credit-rating-to-aaa-following-mufg-deal/articleshow/126242795.cms",
            "description": "Shriram Finance shares could see action in trade today after a credit rating upgrade. This follows a significant deal with Japan's MUFG. The upgrade reflects strong performance and the strategic investment. Analysts are positive, raising target prices. The deal strengthens Shriram Finance's capital and future growth prospects. This development boosts confidence in India's lending sector.",
            "pubDate": "2025-12-30T03:18:15.496649"
        },
        {
            "title": "Kotak Mahindra Bank fixes January 14 as record date for upcoming stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-fixes-january-14-as-record-date-for-upcoming-stock-split/articleshow/126242758.cms",
            "description": "Kotak Mahindra Bank has fixed January 14, 2026, as the record date for its stock split, involving subdivision of equity shares from face value of Rs 5 to Rs 1. The move aims to improve liquidity and enhance retail investor participation in the stock.",
            "pubDate": "2025-12-30T03:18:15.496752"
        },
        {
            "title": "Honasa Consumer among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-among-4-stocks-showing-bullish-rsi-upswing/slideshow/126242731.cms",
            "description": "On December 29, four stocks in the Nifty 500 that gained over 3% were highlighted in the RSI Trending Up scan, based on data from StockEdge. It is considered an uptrend signal when the RSI crosses above 50 from lower levels, indicating strengthening momentum and potential upward price movement.",
            "pubDate": "2025-12-30T03:18:15.496859"
        },
        {
            "title": "BEL shares in focus after securing Rs 569 crore worth of defence orders since last disclosure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-after-securing-rs-569-crore-worth-of-defence-orders-since-last-disclosure/articleshow/126242581.cms",
            "description": "Bharat Electronics Limited (BEL) shares are set to gain attention following the announcement of new defence orders worth Rs 569 crore. These significant orders, spanning various strategic products like radars and communication equipment, bolster BEL's position in India's defence manufacturing. This comes as the Defence Acquisition Council also approved proposals worth Rs 79,000 crore, boosting the sector's outlook.",
            "pubDate": "2025-12-30T03:18:15.496973"
        },
        {
            "title": "Honasa Consumer shares in focus as promoter Varun Alagh raises stake via bulk deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-shares-in-focus-as-promoter-varun-alagh-raises-stake-via-bulk-deal/articleshow/126242566.cms",
            "description": "Honasa Consumer, Mamaearth's parent, is in focus as promoter Varun Alagh boosted his stake by acquiring shares from Fireside Ventures for Rs 50 crore. This move comes as the company shows improved profitability and revenue growth, despite its stock trading below its IPO price. The beauty and personal care firm operates popular brands like Mamaearth and The Derma Co.",
            "pubDate": "2025-12-30T03:18:15.497068"
        },
        {
            "title": "Sundrex Oil shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sundrex-oil-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126242484.cms",
            "description": "Sundrex Oil Company's IPO debuts on NSE SME with zero grey market premium, indicating subdued listing expectations despite steady fundamentals. The Rs 32.25 crore issue, entirely a fresh issue, saw moderate overall subscription, with retail investors driving demand.",
            "pubDate": "2025-12-30T03:18:15.497161"
        },
        {
            "title": "Shyam Dhani Industries IPO: Shares boast 97% GMP going into listing today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shyam-dhani-industries-ipo-shares-boast-97-gmp-going-into-listing-today/articleshow/126242467.cms",
            "description": "Shyam Dhani Industries IPO is set to list on the NSE SME platform today, with a strong grey market premium of around 97% indicating a potential listing price of Rs 110-112. The issue saw an overwhelming subscription of 988.29 times, driven by significant demand from all investor categories.",
            "pubDate": "2025-12-30T03:18:15.497256"
        },
        {
            "title": "Dachepalli Publishers IPO listing today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dachepalli-publishers-ipo-listing-today-heres-what-gmp-indicates/articleshow/126242453.cms",
            "description": "Dachepalli Publishers is set for a subdued debut on BSE SME, with grey market premiums indicating a listing near its issue price of Rs 102. The educational content provider, which raised Rs 40.39 crore, saw strong subscription from non-institutional investors. Investors will now focus on the company's execution and scaling capabilities in the competitive educational publishing market.",
            "pubDate": "2025-12-30T03:18:15.497348"
        },
        {
            "title": "Negative Breakout: These 14 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-14-stocks-cross-below-their-200-dmas/slideshow/126242439.cms",
            "description": "In the Nifty 500 segment, the closing prices of 14 stocks fell below their 200-day DMA (Daily Moving Average) on December 29, according to StockEdge’s technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-12-30T03:18:15.497442"
        },
        {
            "title": "EPW India IPO heads to listing with a 3% GMP. All you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/epw-india-ipo-heads-to-listing-with-a-3-gmp-all-you-need-to-know/articleshow/126242356.cms",
            "description": "EPW India's stock market debut is expected to be subdued. The grey market premium is low, indicating a cautious opening. The company raised funds for working capital and debt repayment. Its business involves refurbished IT hardware. Financials show strong growth. Future performance will depend on execution and financial management.",
            "pubDate": "2025-12-30T03:18:15.497538"
        },
        {
            "title": "GIFT Nifty down 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126242137.cms",
            "description": "Indian equity markets closed lower in a subdued session, impacted by consistent foreign institutional investor outflows and year-end caution. Analysts anticipate a narrow trading range for Indian equities in the near term, influenced by macro indicators and institutional flows. The India VIX saw a 6% rise, indicating increased market fear.",
            "pubDate": "2025-12-30T03:18:15.497631"
        },
        {
            "title": "Stocks in news: RIL, Waaree Energies, Arvind Fashions, Honasa Consumer, Mangalam Drugs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-waaree-energies-arvind-fashions-honasa-consumer-mangalam-drugs/articleshow/126242112.cms",
            "description": "Indian markets saw a slight dip on Monday, extending Friday's decline, with analysts anticipating consolidation ahead of the monthly expiry. Key stocks like RIL, Waaree Energies, Arvind Fashions, Honasa Consumer, and Mangalam Drugs are in focus due to significant corporate news and investor activity.",
            "pubDate": "2025-12-30T03:18:15.497721"
        },
        {
            "title": "Asian stock rally pauses, silver stays volatile",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stock-rally-pauses-silver-stays-volatile/articleshow/126242103.cms",
            "description": "Asian stocks paused their seven-day rally, mirroring tech-led declines on Wall Street. Gold and silver fluctuated after a sharp drop from record highs. Despite risks, strategists anticipate further gains for US stocks in 2026, with the Fed's meeting minutes awaited.",
            "pubDate": "2025-12-30T03:18:15.497810"
        },
        {
            "title": "Sensex falls over 200 pts, Nifty below 25,900 as foreign flow woes linger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-pts-nifty-below-25900-as-foreign-flow-woes-linger/articleshow/126243538.cms",
            "description": "Indian stock markets began Tuesday on a down note. The Sensex and Nifty continued their recent decline. Investors remained cautious. This was due to quiet year-end trading. Concerns about foreign fund flows also kept markets subdued. Trading volumes were thin. Risk appetite was limited.",
            "pubDate": "2025-12-30T04:09:39.132848"
        },
        {
            "title": "New Year stock picks 2026: Motilal Oswal suggests HCL Tech, Eternal among 11 names to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-year-stock-picks-2026-motilal-oswal-suggests-hcl-tech-eternal-among-11-names-to-buy/slideshow/126243646.cms",
            "description": "Motilal Oswal Wealth Management has laid out its latest top equity ideas, blending large, mid and selective growth names across sectors for the new year 2026. The picks are backed by detailed valuation metrics, earnings visibility and return ratios, offering a snapshot of where the brokerage sees risk-reward turning favourable over the next two to three years.",
            "pubDate": "2025-12-30T04:09:39.132966"
        },
        {
            "title": "Dixon Technologies among 5 F&O stocks that saw a sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-among-5-fo-stocks-that-saw-a-sharp-rise-in-futures-open-interest/slideshow/126243561.cms",
            "description": "As of December 29, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-30T04:09:39.133095"
        },
        {
            "title": "Japan's Nikkei gauge trims 2025 surge as techs take a breather",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-gauge-trims-2025-surge-as-techs-take-a-breather/articleshow/126243364.cms",
            "description": "Japan's Nikkei index saw a slight dip on Tuesday, with tech stocks leading the decline. Despite this, the Nikkei is on track for a significant annual gain, its third consecutive. SoftBank's acquisition news and a broader tech pullback from Wall Street contributed to the day's movements, though analysts suggest end-of-year adjustments are a key factor.",
            "pubDate": "2025-12-30T04:09:39.133193"
        },
        {
            "title": "Motilal Oswal picks 4 defence stocks with upside potential of up to 36% after DAC’s Rs 79,000 cr clearance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-picks-4-defence-stocks-with-upside-potential-of-up-to-36-after-dacs-rs-79000-cr-clearance/articleshow/126243355.cms",
            "description": "Motilal Oswal has turned bullish on select defence stocks after the Defence Acquisition Council approved capital proposals worth Rs 79,000 crore. The brokerage sees Bharat Electronics, Hindustan Aeronautics, Bharat Dynamics and Astra Microwave Products benefiting from a strong defence procurement pipeline over the medium term.",
            "pubDate": "2025-12-30T04:09:39.133291"
        },
        {
            "title": "Honasa Consumer, HEG among 5 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-heg-among-5-stocks-closed-crossing-above-vwap/slideshow/126243162.cms",
            "description": "On December 29, the closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-12-30T04:09:39.133386"
        }
    ]
}