{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-15T10:50:15.949630",
    "items": [
        {
            "title": "Elara Capital sees Nifty at 30,000 by March 2027",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elara-capital-sees-nifty-at-30000-by-march-2027/articleshow/126536553.cms",
            "description": "Elara Capital forecasts the Nifty index to reach 30,000 by March 2027. This projection suggests a potential 17% increase from current levels. The brokerage anticipates an earnings rebound will fuel this surge. Elara favors the consumption sector, particularly premiumization themes in discretionary spending, auto, jewelry, beauty, personal care, and hotels. NBFCs, private banks, and oil marketing companies are also preferred.",
            "pubDate": "2026-01-15T01:20:19.710897"
        },
        {
            "title": "Punjab & Sind, IOB plan Rs 7,000 crore share sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/punjab-sind-iob-plan-rs-7000-crore-share-sale/articleshow/126536492.cms",
            "description": "Indian Overseas Bank and Punjab & Sind Bank are set to raise ₹4,000 crore and ₹3,000 crore respectively through qualified institutional placements this quarter. IOB has secured necessary approvals and is appointing merchant bankers, while Punjab & Sind Bank will hold an EGM on January 21 to consider its equity capital raise.",
            "pubDate": "2026-01-15T01:20:19.711025"
        },
        {
            "title": "US, Europe dominate FPI flows, Singapore & Mauritius lose out",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-europe-dominate-fpi-flows-singapore-mauritius-lose-out/articleshow/126536302.cms",
            "description": "Overseas capital in Indian equities has shifted structurally, with US and European investors now dominating over traditional tax havens like Mauritius. Tighter tax norms and regulatory disclosures, including the principal purpose test and beneficial ownership rules, have reduced the appeal of Mauritius, leading to significant withdrawals from Indian equities in 2025.",
            "pubDate": "2026-01-15T01:20:19.711258"
        },
        {
            "title": "Loan-deposit ratio to stay high, banks set to go for CDs, bonds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/loan-deposit-ratio-to-stay-high-banks-set-to-go-for-cds-bonds/articleshow/126536528.cms",
            "description": "The pace of rise in bank profitability is likely to bottom out this fiscal year, and gradually improve in FY27 as funding pressures ease and net interest margins (NIMs) stabilise, the agency said in its outlook on the financial sector for FY27.",
            "pubDate": "2026-01-15T01:20:19.711365"
        },
        {
            "title": "Tiger Global's treaty 'abuse' case key to how money flows to India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tiger-globals-treaty-abuse-case-key-to-how-money-flows-to-india/articleshow/126536340.cms",
            "description": "International investors await a crucial Supreme Court verdict on Tiger Global's tax case. This ruling will significantly impact how foreign funds structure their investments in India. The decision could redefine tax implications for indirect transfers and the validity of tax residency certificates. Investors are closely watching for clarity on tax rules and their potential impact on future investment decisions.",
            "pubDate": "2026-01-15T01:20:19.711459"
        },
        {
            "title": "RBI issues new norms to improve grievance redressal mechanism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-tightens-complaint-review-norms-strengthens-role-of-internal-ombudsman/articleshow/126536407.cms",
            "description": "The Reserve Bank of India has enhanced its review mechanism for customer complaints within regulated entities, mandating a senior-level review before rejection or partial resolution. This move aims to ensure speedy and meaningful grievance redressal, with internal ombudsmen playing a key role in oversight and reporting to the board's customer service committee.",
            "pubDate": "2026-01-15T01:20:19.711644"
        },
        {
            "title": "SMBC gets RBI’s in-principle nod for fully-owned India subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-central-bank-allows-japans-sumitomo-mitsui-banking-to-set-up-local-unit/articleshow/126536519.cms",
            "description": "India's central bank has given Sumitomo Mitsui Banking Corp initial approval to establish a wholly-owned subsidiary. This move allows the Japanese bank greater operational freedom in India. Previously, Sumitomo Mitsui Banking Corp operated through a branch. The new subsidiary will be a separate legal entity, offering treatment similar to local banks.",
            "pubDate": "2026-01-15T01:20:19.711944"
        },
        {
            "title": "An emerging markets supercycle has just begun: Shuli Ren",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/an-emerging-markets-supercycle-has-just-begun-shuli-ren/articleshow/126537289.cms",
            "description": "Emerging markets are set for a long growth period. A weak dollar and global growth continue to support this trend. New opportunities are emerging in commodities like gold and copper. Countries like Venezuela and Saudi Arabia are opening up for investment. The AI boom is also creating demand for resources found in emerging markets, offering diverse investment potential.",
            "pubDate": "2026-01-15T03:10:29.050480"
        },
        {
            "title": "Asian shares set for weaker open, crude oil falls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-set-for-weaker-open-crude-oil-falls/articleshow/126536949.cms",
            "description": "Asia's benchmark share index is poised to dip from a record high following Wall Street's decline, driven by a rotation out of expensive technology stocks. Futures for Japan, Hong Kong, and China fell as the Nasdaq 100 dropped. Oil prices also decreased after President Trump indicated Iran would halt protester killings.",
            "pubDate": "2026-01-15T03:10:29.050583"
        },
        {
            "title": "Stock Market Holiday: Are NSE, BSE closed for trading today for Maharashtra Municipal election? Check Full List",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-are-nse-bse-closed-for-trading-today-for-maharashtra-municipal-election/articleshow/126530949.cms",
            "description": "NSE Holiday Today 2026: Both exchanges issued revised circulars confirming the trading holiday. The BSE clarified that equity derivatives contracts originally scheduled to expire on January 15, were revised to expire a day earlier, on January 14.",
            "pubDate": "2026-01-15T03:10:29.050771"
        },
        {
            "title": "Rising memory chip prices weigh down Dixon stock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-memory-chip-prices-weigh-down-dixon-stock/articleshow/126536621.cms",
            "description": "Dixon Technologies' stock faces pressure from rising memory chip costs and upcoming regulatory changes.  The company, a major Android handset maker, sees its stock decline.  Analysts point to government approvals, memory price surges impacting demand, and the end of the PLI scheme as key concerns.  Dixon is investing in component manufacturing and expanding capacity to navigate these challenges.",
            "pubDate": "2026-01-15T03:10:29.050866"
        },
        {
            "title": "Metal shares extend bull run as commodity rally shows no signs of fatigue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metal-shares-extend-bull-run-as-commodity-rally-shows-no-signs-of-fatigue/articleshow/126536576.cms",
            "description": "Indian metal producers are seeing record stock prices. Commodity prices are rising due to global uncertainty and industrial demand. Gold and silver have seen significant gains. Copper prices are also at record highs. Analysts have mixed views, with some advising caution on overbought stocks while others expect the rally to continue.",
            "pubDate": "2026-01-15T03:10:29.050962"
        },
        {
            "title": "Crude oil takes centre stage amid geopolitical storms, can it still offer investment opportunities?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/crude-oil-takes-centre-stage-amid-geopolitical-storms-can-it-still-offer-investment-opportunities/articleshow/126537656.cms",
            "description": "Crude oil prices remain volatile amid rising geopolitical risks across key regions. Analysts suggest oil is best used as a tactical hedge rather than a core investment, with energy equities offering more stable opportunities during uncertain global conditions.",
            "pubDate": "2026-01-15T04:11:05.899146"
        },
        {
            "title": "Toyota Industries' shares hit record as market hopes for higher buyout offer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/toyota-industries-shares-hit-record-as-market-hopes-for-higher-buyout-offer/articleshow/126537506.cms",
            "description": "Shares of forklift maker Toyota Industries reached a record high today. This surge followed an improved offer from Toyota Motor. Investors are trading above the new price, anticipating an even better deal. The initial proposal faced criticism for its unclear valuation. Toyota Motor raised its bid by 15% to 18,800 yen per share. The tender period is now open.",
            "pubDate": "2026-01-15T04:11:05.899264"
        },
        {
            "title": "Trip.com shares crash 22% in Hong Kong after antitrust probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trip-com-shares-crash-22-in-hong-kong-after-antitrust-probe/articleshow/126537487.cms",
            "description": "Hong Kong-listed shares of a major Chinese online travel agency plummeted after regulators launched an antitrust probe. The company is suspected of abusing its dominant market position. Analysts suggest this could impact sentiment but not necessarily its industry standing. Potential fines could reach hundreds of millions of dollars, and divestment is also a possibility.",
            "pubDate": "2026-01-15T04:11:05.899364"
        },
        {
            "title": "Nomura says United Spirits is at the cusp of a developing upcycle; initiates with Buy rating. 3 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-says-united-spirits-is-at-the-cusp-of-a-developing-upcycle-initiates-with-buy-rating-3-reasons-why/articleshow/126538479.cms",
            "description": "Nomura has initiated coverage on United Spirits with a Buy rating, citing premiumisation tailwinds, easing regulatory environment and innovation-led expansion. The brokerage sees a developing upcycle and expects margin expansion, healthy earnings growth and valuation comfort.",
            "pubDate": "2026-01-15T05:16:08.475435"
        },
        {
            "title": "Tech Mahindra Q3 Preview: Profit set to climb despite one-time labour code charges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-q3-preview-profit-set-to-climb-despite-one-time-labour-code-charges/articleshow/126538457.cms",
            "description": "Tech Mahindra is poised for steady revenue growth and improved profitability in the December quarter, driven by margin expansion and cost optimization. Brokerages anticipate a modest revenue increase of around 7% year-on-year, with profit after tax projected to surge approximately 40% YoY, outperforming many peers.",
            "pubDate": "2026-01-15T05:16:08.475563"
        },
        {
            "title": "5 stocks YES Securities expects to shine in 2026, with upsides up to 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-stocks-yes-securities-expects-to-shine-in-2026-with-upsides-up-to-26/slideshow/126538367.cms",
            "description": "Indian equities are entering 2026 against the backdrop of a structural upshift in the economy amid a changing global environment, according to YES Securities. The brokerage views select companies as well-positioned to navigate global uncertainty, thanks to strong balance sheets, an improving business mix, and sector-specific tailwinds. YES Securities has identified five high-conviction stocks, assigning 'Buy' ratings with upside potential of up to 26%",
            "pubDate": "2026-01-15T05:16:08.475678"
        },
        {
            "title": "Rs 8 lakh crore shock! Why 2026 winter is turning harsh for Sensex, Nifty and whether to buy the fear",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-8-lakh-crore-shock-why-2026-winter-is-turning-harsh-for-sensex-nifty-and-whether-to-buy-the-fear/articleshow/126538419.cms",
            "description": "Indian stock markets experienced their worst start to a year in a decade, with nearly Rs 8 lakh crore in market capitalization wiped out. Foreign institutional investors have pulled out $2 billion amid anxieties over a delayed India-US tariff deal and the upcoming Union Budget. Analysts anticipate continued range-bound trading until policy clarity emerges.",
            "pubDate": "2026-01-15T05:16:08.475779"
        },
        {
            "title": "Mumbai poll holiday for BSE, NSE draws flak from Zerodha's Nithin Kamath",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mumbai-poll-holiday-for-bse-nse-draws-flak-from-zerodha-co-founder-nithin-kamath/articleshow/126538141.cms",
            "description": "Indian stock exchanges observed a full trading holiday on Thursday, January 15, due to municipal elections in Maharashtra. Zerodha CEO Nithin Kamath criticized the closure, citing global market connectivity and poor planning. The debate intensified with Samir Arora questioning the consistency of such arguments, especially in light of markets opening on a Sunday for Budget Day.",
            "pubDate": "2026-01-15T05:16:08.475875"
        },
        {
            "title": "Bharat Coking Coal IPO listing delayed: Check revised allotment, refund and listing timeline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-coking-coal-ipo-listing-delayed-check-revised-allotment-refund-and-listing-timeline/slideshow/126538190.cms",
            "description": "The listing of Bharat Coking Coal, a subsidiary of Coal India, has been postponed due to municipal elections in Maharashtra. Investors will now have to wait three more days for the stock to debut on the exchanges.",
            "pubDate": "2026-01-15T05:16:08.475973"
        },
        {
            "title": "Shadowfax IPO in focus: GMP and 10 key takeaways for investors ahead of subscription",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shadowfax-ipo-in-focus-gmp-and-10-key-takeaways-for-investors-ahead-of-subscription/slideshow/126537896.cms",
            "description": "Shadowfax Technologies is set to hit the primary market with an IPO of Rs 1,907 crore. Ahead of the issue opening, the stock is trading at a grey market premium of around 13%, indicating optimistic listing expectations.",
            "pubDate": "2026-01-15T05:16:08.476068"
        },
        {
            "title": "NBFCs set for strongest earnings in nine quarters. 10 stock picks from Motilal Oswal ahead of Q3 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfcs-set-for-strongest-earnings-in-nine-quarters-10-stock-picks-from-motilal-oswal-ahead-of-q3-results/slideshow/126539098.cms",
            "description": "NBFC-lending companies are expected to deliver around 26% YoY PAT growth in Q3FY26, the strongest performance in nine quarters, driven by steady AUM growth, improving margins and controlled credit costs. Motilal Oswal expects NII and PPoP to grow around 16–17% YoY, with vehicle financiers, housing finance companies, and select retail lenders leading the cycle.",
            "pubDate": "2026-01-15T05:43:35.081824"
        },
        {
            "title": "Volume Shocker: 6 stocks see over 1 crore MF share additions in Dec’25; rally up to 20%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/volume-shocker-6-stocks-see-over-1-crore-mf-share-additions-in-dec25-rally-up-to-20/slideshow/126539800.cms",
            "description": "ETMarkets’ latest mutual fund analysis examined stocks that saw the highest increase in mutual fund shareholding in December 2025 compared with November 2025. The study found that 45 stocks recorded additions of more than 1 crore shares each, reflecting strong buying interest from mutual funds.To shortlist the best-performing names, we applied a second filter — selecting only those stocks that not only witnessed meaningful mutual fund accumulation but also delivered gains of over 10% since early December. This two-step screening process resulted in six standout stocks that combined strong institutional buying with robust price performance. At the same time, we identified five major laggards that declined more than 10% during the same period. (Data Source: ACE MF, ACE Equity)",
            "pubDate": "2026-01-15T06:55:48.404930"
        },
        {
            "title": "Infosys shares may jump up to 10% tomorrow if ADR is an indicator. Target prices go up to Rs 2,076",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-may-jump-up-to-10-tomorrow-if-adr-is-an-indicator-target-prices-go-up-to-rs-2076/articleshow/126540725.cms",
            "description": "Infosys is poised for strong buying after raising its FY26 constant-currency revenue growth guidance to 3-3.5%, signaling improved demand despite a challenging IT sector. The company's ADRs surged 10% overnight following the upgrade, with several brokerages reiterating 'Buy' ratings and increasing target prices.",
            "pubDate": "2026-01-15T07:41:31.655618"
        },
        {
            "title": "Nomura picks Infosys as top IT bet, sees FY26 guidance hike positive despite Q3 PAT decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-picks-infosys-as-top-it-pick-sees-fy26-guidance-hike-positive-despite-q3-pat-decline/articleshow/126540569.cms",
            "description": "Nomura retains a ‘Buy’ rating on Infosys with a target of Rs 1,810, despite a 2% YoY dip in Q3FY26 net profit. Revenue rose 9% YoY, large deals surged 94%, and the company raised FY26 growth guidance. Margins remain stable, with a strong focus on BFSI, EURS, and AI services.",
            "pubDate": "2026-01-15T07:41:31.655750"
        },
        {
            "title": "Mahindra’s SUV blitz draws Nomura’s top-pick call while Bajaj’s EV gamble leaves limited upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahindras-suv-blitz-draws-nomuras-top-pick-call-while-bajajs-ev-gamble-leaves-limited-upside/articleshow/126540129.cms",
            "description": "Mahindra & Mahindra's strong SUV bookings, driven by the XUV 7XO and XEV 9S, have led Nomura to name it their top auto pick. In contrast, Nomura maintains a neutral stance on Bajaj Auto's new electric scooter, favoring Ather Energy and TVS Motor for two-wheeler growth.",
            "pubDate": "2026-01-15T07:41:31.655970"
        },
        {
            "title": "SRF, Welspun Living among 12 midcap picks by Systematix Research with upside potential of up to 53%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/srf-welspun-living-among-12-midcap-picks-by-systematix-research-with-upside-potential-of-up-to-53/slideshow/126541899.cms",
            "description": "Brokerage firm Systematix Research anticipates healthy year-on-year momentum across the Indian speciality chemicals sector during Q3FY26, supported by volume-led growth and the commercialisation of strategic capex projects. While pricing in some segments may remain range-bound, companies like SRF are expected to benefit from a seasonal uptick in refrigerant and speciality chemical volumes.However, blended margins may still face pressure due to weakness in technical textiles. Based on its comprehensive sector view, Systematix has released its updated ratings and target prices for a range of midcap names across speciality chemicals, textiles, and diversified industries. Here are the top 12 midcap picks from the report, with upside potentials of up to 53%.",
            "pubDate": "2026-01-15T08:38:12.014310"
        },
        {
            "title": "Metal stocks surge up to 18% in 2026: Top 6 gainers powering the rally. How many in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metal-stocks-surge-up-to-18-in-2026-top-6-gainers-powering-the-rally-how-many-in-your-portfolio/slideshow/126541398.cms",
            "description": "Riding a powerful mix of global and domestic tailwinds, the Nifty Metal index has emerged as the joint-best performer so far in calendar year 2026, climbing 4.5%. Record-high silver prices, tightening copper supply chains, India’s safeguard duty and a renewed capex push have lifted investor appetite for metal stocks. Here are the six stocks that have driven the rally this year.",
            "pubDate": "2026-01-15T08:38:12.014443"
        },
        {
            "title": "Rs 1.4L cr shock hits Reliance: Will Q3 turn the tide?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-1-4l-cr-shock-hits-reliance-will-q3-turn-the-tide/videoshow/126542409.cms",
            "description": "Reliance Industries has had a rough start to 2026, with nearly Rs 1.4 lakh crore wiped off its market value and the stock down about 7% YTD. In this video, we break down what’s behind the selloff, from Russian crude concerns and slowing retail growth to changing investor expectations. We decode what to expect from RIL’s Q3 results, why energy may outperform even as retail stumbles, and whether crude worries are overdone. We also look ahead to 2026, which brokerages see as a “year of catalysts” for Mukesh-Ambani led conglomerate.",
            "pubDate": "2026-01-15T08:58:46.065515"
        },
        {
            "title": "Smaller private sector banks: Ready for a sustained re-rating? 8 stocks where analysts might be getting caught on the wrong foot",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smaller-private-sector-banks-ready-for-a-sustained-re-rating-8-stocks-where-analysts-might-be-getting-caught-on-the-wrong-foot/articleshow/126541857.cms",
            "description": "In the last six months, which sector has attracted maximum foreign direct investment? It has been either banks or financial services. And what is common to this FDI inflow? The money is pouring into relatively smaller entities, or those with troubled pasts. This is happening for a reason. It is an indication that a segment of the banking sector has reached a stage where interest in taking over the entire business has increased. What’s more, the regulators are fine with this. So a sustained re-rating of these entities can be expected.",
            "pubDate": "2026-01-15T08:58:46.065642"
        },
        {
            "title": "European shares gain as upbeat data and strong earnings lift sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-gain-as-upbeat-data-and-strong-earnings-lift-sentiment/articleshow/126543094.cms",
            "description": "European markets extended their rally on Thursday, buoyed by encouraging economic data and robust corporate earnings.  Strong results from TSMC propelled ASML to record highs, while Swedbank and Richemont also saw significant gains.  Positive economic indicators from Britain and Sweden further bolstered investor confidence, suggesting a resilient regional economy.",
            "pubDate": "2026-01-15T09:50:19.079188"
        },
        {
            "title": "ASML tops $500 billion market cap as TSMC results ignite semis rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asml-tops-500-billion-market-cap-as-tsmc-results-ignite-semis-rally/articleshow/126543055.cms",
            "description": "ASML shares have reached a record high. The Dutch chipmaking equipment maker's market value has crossed $500 billion. This makes ASML Europe's most valuable company. The surge was driven by strong results from TSMC. This news has boosted semiconductor stocks across Europe. ASML shares saw a significant increase.",
            "pubDate": "2026-01-15T09:50:19.079322"
        },
        {
            "title": "Top 10 smallcap stocks tumble up to 20% in 2026. Is your portfolio at risk?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-10-smallcap-stocks-tumble-up-to-20-in-2026-is-your-portfolio-at-risk/slideshow/126543265.cms",
            "description": "After a bruising 2025, when the Nifty Smallcap 100 index fell nearly 6%, 2026 is shaping up to be another difficult year, at least judging by January’s early trend. The index is already down about 2%, with several stocks sliding as much as 20% in just the first few trading sessions. Here are 10 stocks that have led the sell-off in the index at the start of the new year.",
            "pubDate": "2026-01-15T09:59:04.276606"
        },
        {
            "title": "Japan's Nikkei falls from record as tech shares retreat; Topix rises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-from-record-as-tech-shares-retreat-topix-rises/articleshow/126543124.cms",
            "description": "Japan's Nikkei share average retreated from a record high as a stronger yen impacted exporters and technology stock momentum waned. The benchmark Nikkei 225 fell 0.4%, while the broader Topix achieved a new all-time closing high. This mirrored a Wall Street trend where tech shares dragged down markets, with currency movements adding headwinds for Japanese firms.",
            "pubDate": "2026-01-15T09:59:04.276724"
        },
        {
            "title": "A case for rethinking Sebi’s new merchant banking rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-case-for-rethinking-sebis-new-merchant-banking-rules/articleshow/126544189.cms",
            "description": "PMS portfolios posted robust performances in 2025, with one-year returns climbing to nearly 42%, according to PMS Bazaar. Small-cap, multi-asset, thematic, and flexi-cap strategies dominated the leaderboard, led by Aequitas Investment Consultancy. The top 10 PMS performers reflect strong diversification, consistent execution, and varied investment approaches across market segments.",
            "pubDate": "2026-01-15T10:50:14.555758"
        },
        {
            "title": "PMS Tracker: 10 best performing PMS portfolios of 2025 with gains of up to 42%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pms-tracker-10-best-performing-pms-portfolios-of-2025-with-gains-of-up-to-42/slideshow/126544156.cms",
            "description": "Select Portfolio Management Services (PMS) portfolios delivered standout returns in 2025, with one-year gains climbing as high as 42%, according to data compiled by PMS Bazaar. The list below highlights the top 10 best-performing PMS portfolios of 2025, ranked purely on their one-year performance as reported by PMS Bazaar.",
            "pubDate": "2026-01-15T10:50:14.555880"
        }
    ]
}