{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-06T07:05:40.209725",
    "items": [
        {
            "title": "Vijay Kedia's Big Bets: 6 stocks surge up to 45% in 5 months — Do You Own Any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedias-big-bets-6-stocks-surge-up-to-45-in-5-months-do-you-own-any/slideshow/123731559.cms",
            "description": "Investors often keep a close watch on the portfolios of well-known figures in the financial markets. In this context, ETMarkets has analyzed the investment holdings of veteran investor Vijay Kedia. According to the latest data from the June 2025 quarter, Kedia holds publicly disclosed stakes in around 14 companies, with a combined value of approximately Rs 1,272 crore as of September 5. These include companies where his ownership exceeds 1%. A majority of these stocks have generated positive returns in FY26 so far. We have highlighted the top 6 performers and the biggest laggard from his portfolio—each showing gains or losses of over 10%. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-09-06T07:05:21.458846"
        },
        {
            "title": "Earnings recovery to drive market momentum: Mayuresh Joshi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-recovery-to-drive-market-momentum-mayuresh-joshi/articleshow/123730778.cms",
            "description": "Indian equity markets saw a 1% gain but stayed below 25,000, prompting analysis of underlying trends. GST rationalization is expected to boost volumes and margins from Q3, benefiting India Inc. Metals led sectoral gains, supported by potential US rate cuts and improved India-China ties. Despite positive indicators, markets remain cautious, awaiting earnings reset and resolution on US tariffs.",
            "pubDate": "2025-09-06T07:05:21.458969"
        },
        {
            "title": "Weakness in Bank Nifty holding back market rally: Rajesh Palviya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weakness-in-bank-nifty-holding-back-market-rally-rajesh-palviya/articleshow/123730755.cms",
            "description": "Equity markets remained steady this week. Nifty tested 25,000 but could not surpass it. Sectoral momentum offered support. Banking stocks are a drag. Rajesh Palviya suggests automobile, FMCG, metals, and new-age stocks are worth watching. BSE Ltd. gained attention after structural changes. National Aluminium and Bajaj Finance are Palviya's stock picks for the week.",
            "pubDate": "2025-09-06T07:05:21.459082"
        },
        {
            "title": "IPO Calendar: Urban Company to lead Rs 2,700 crore worth offers in a busy week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-calendar-urban-company-to-lead-rs-2700-crore-worth-offers-in-a-busy-week/articleshow/123730502.cms",
            "description": "The Indian primary market is buzzing with activity as Urban Company, Dev Accelerator, and Shringar House of Mangalsutra launch their IPOs, collectively aiming to raise over Rs 2,700 crore. Urban Company's Rs 1,900 crore tech IPO is highly anticipated, while Dev Accelerator taps into the flexible workspace trend.",
            "pubDate": "2025-09-06T07:05:21.459184"
        },
        {
            "title": "ICICI Bank among Motilal Oswal’s top 5 stock picks with upside potential of up to 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-among-motilal-oswals-top-5-stock-picks-with-upside-potential-of-up-to-26/slideshow/123730373.cms",
            "description": "Indian equity markets are cherishing the optimism around the proposed “GST 2.0” reforms. Index heavyweights are also providing strong support to the indices and have helped maintain the positive momentum through the week.With this, domestic brokerage firm Motilal Oswal has picked its top 5 bets on a fundamental basis for a horizon of 1 year, with an upside potential of up to 26%.",
            "pubDate": "2025-09-06T07:05:21.459306"
        },
        {
            "title": "Wall Street’s wealth engine powers through job-market anxiety",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-streets-wealth-engine-powers-through-job-market-anxiety/articleshow/123729738.cms",
            "description": "Recent economic data reveals a concerning trend: job growth is slowing in America, impacting workers' financial security. However, investors anticipate the Federal Reserve will intervene to protect their assets. Despite a slight market dip, bonds have rallied, and equities remain near record highs.",
            "pubDate": "2025-09-06T07:05:21.459406"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/123729522.cms",
            "description": "Global markets brace for a week of pivotal economic data from the U.S., China, and Japan, alongside key central bank meetings. Investors are keenly awaiting the U.S. inflation report, influencing potential Federal Reserve rate cuts. Political uncertainties in France and Norway add to the market's cautious sentiment.",
            "pubDate": "2025-09-06T07:05:21.459510"
        },
        {
            "title": "Wall Street Week Ahead-Inflation data looms for markets as stocks hover at records",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-inflation-data-looms-for-markets-as-stocks-hover-at-records/articleshow/123729511.cms",
            "description": "U.S. stock investors are bracing for a week filled with crucial inflation data amid tariff uncertainties and fluctuating government bond yields. Despite a strong year, the S&P 500 faces headwinds as valuations appear stretched and September historically poses challenges.",
            "pubDate": "2025-09-06T07:05:21.459603"
        },
        {
            "title": "Trump's short list for Fed: Hassett, Warsh and Waller",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-short-list-for-fed-hassett-warsh-and-waller/articleshow/123729470.cms",
            "description": "President Trump is considering Kevin Hassett, Kevin Warsh, and Christopher Waller to succeed Jerome Powell as Federal Reserve chair, seeking leadership aligned with his interest-rate cut demands. Trump has criticized Powell's cautious approach, citing concerns about the economy.",
            "pubDate": "2025-09-06T07:05:21.459693"
        },
        {
            "title": "US Treasury Secretary Bessent calls for big changes at Fed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-treasury-secretary-bessent-calls-for-big-changes-at-fed/articleshow/123729451.cms",
            "description": "U.S. Treasury Secretary Scott Bessent has urged a thorough review of the Federal Reserve, questioning its interest rate authority. He criticized the Fed's policies for allegedly fueling inflation and benefiting the wealthy, advocating for a shift in focus towards its core mandate.",
            "pubDate": "2025-09-06T07:05:21.459784"
        },
        {
            "title": "Fed's Goolsbee says he's undecided on Sept rate cut, defends Fed independence",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-goolsbee-says-hes-undecided-on-sept-rate-cut-defends-fed-independence/articleshow/123729432.cms",
            "description": "Chicago Fed President Austan Goolsbee remains undecided on a September rate cut despite recent job-market weakening data. He defended the Fed's independence, opposing any moves to undermine it. Goolsbee expects future nominees to take their roles seriously, amidst concerns about potential political influence from President Trump's nominee.",
            "pubDate": "2025-09-06T07:05:21.459873"
        },
        {
            "title": "US stocks end lower as jobs data fuels economic worries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-lower-as-jobs-data-fuels-economic-worries/articleshow/123729087.cms",
            "description": "The U.S. economy created 22,000 jobs last month instead of an estimated 75,000, confirming softening labor market conditions, according to the Labor Department report. The three major U.S. stock indexes initially rose and broke records following the data, as traders of futures tied to the Fed's policy rate boosted bets that the U.S. central bank will trim rates in quick succession, starting this month, with a 50-basis-point easing now on the table.",
            "pubDate": "2025-09-06T07:05:21.459962"
        },
        {
            "title": "Will Indian banks meet the SWIFT ISO 20022 implementation deadline?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-indian-banks-meet-the-swift-iso-20022-implementation-deadline/articleshow/123729013.cms",
            "description": "Indian banks are accelerating efforts to fully implement SWIFT's ISO 20022 messaging standard by the November 2025 deadline, driven by directives from the Ministry of Finance and the RBI. Several major banks, including SBI and ICICI Bank, have already migrated to the new system. Failure to comply with the deadline could result in payment disruptions and penalties.",
            "pubDate": "2025-09-06T07:05:21.460053"
        },
        {
            "title": "Will global cues and Fed rate cut hopes fuel a market recovery next week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-lower-us-rates-propel-indian-markets-to-new-heights-next-week/articleshow/123728878.cms",
            "description": "Indian equity indices ended flat amid choppy trading, with IT stocks declining due to US tariff concerns, offsetting auto sector gains fueled by GST cut hopes. For the week, however, markets gained 1%. Positive global cues and expectations of US rate cuts are expected to support a recovery next week, though Nifty faces resistance at 25,000.",
            "pubDate": "2025-09-06T07:05:21.460140"
        },
        {
            "title": "Kalyan Kumar set to lead Union Bank as Lalit Tyagi may join Central Bank amid reshuffle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-kumar-set-to-lead-union-bank-as-lalit-tyagi-joins-central-bank-amid-reshuffle/articleshow/123728842.cms",
            "description": "Kalyan Kumar is expected to lead Union Bank of India. Lalit Tyagi is likely to transfer to Central Bank of India. Asheesh Pandey is dropped from consideration for a top post. The Financial Services Institutions Bureau had recommended Pandey. Reserve Bank of India had previously raised concerns about Pandey. Union Bank has been without a head since June.",
            "pubDate": "2025-09-06T07:05:21.460253"
        },
        {
            "title": "BoB flags RCom loan accounts as fraud amid allegations of fund misuse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bob-flags-rcom-loan-accounts-as-fraud-amid-allegations-of-fund-misuse/articleshow/123728806.cms",
            "description": "Bank of Baroda has declared Reliance Communications' loan accounts, along with Anil Ambani, as fraudulent due to alleged fund misutilisation and improper transactions. This action follows similar declarations by SBI and Bank of India. Anil Ambani Group denies the allegations, asserting they will contest the claims in court, citing a consortium of 14 lenders and delayed proceedings.",
            "pubDate": "2025-09-06T07:05:21.460363"
        }
    ]
}