{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-20T11:41:10.494059",
    "items": [
        {
            "title": "Fujiyama Power Systems shares make weak debut, list at 4% descount to IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fujiyama-power-systems-shares-make-weak-debut-list-at-4-descount-to-ipo-price/articleshow/125452829.cms",
            "description": "Fujiyama Power Systems shares debuted on Dalal Street with a discount. The solar solutions company's IPO saw moderate interest. Fujiyama manufactures and sells a wide range of rooftop solar products. The company has a strong distribution network. Financials show robust growth. Analysts believe the issue is fully priced. Much will depend on market conditions.",
            "pubDate": "2025-11-20T04:39:57.444919"
        },
        {
            "title": "Barclays lifts S&P 500 target to 7,400 on megacap tech strength",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/barclays-lifts-sp-500-target-to-7400-on-megacap-tech-strength/slideshow/125453053.cms",
            "description": "Barclays has lifted its forecast for the S&P 500, projecting that the index will reach 7,400 by the end of 2026. This represents an expected gain of 11.4% from Wednesday’s close, reflecting the bank’s confidence in the market’s forward momentum. (Source: Reuters)",
            "pubDate": "2025-11-20T04:39:57.445056"
        },
        {
            "title": "The forgotten Tata stock: Will investors ever recover Rs 25,000 crore loss that keeps getting bigger?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-forgotten-tata-stock-will-investors-ever-recover-rs-25000-crore-loss-that-keeps-getting-bigger/articleshow/125452804.cms",
            "description": "Tata Technologies, once a dream listing, has seen its market value plummet by Rs 25,000 crore from its peak.  Revenue concentration on Tata Motors and JLR, coupled with their challenges, has led to uneven financial performance and cautious brokerage sentiment. Investors face a long road to recovery as the stock struggles to regain its footing.",
            "pubDate": "2025-11-20T04:39:57.445163"
        },
        {
            "title": "Groww shares fall 18% in 2 days. What’s triggering the fall in Billionbrains?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-fall-18-in-2-days-whats-triggering-the-fall-in-billionbrains/articleshow/125452642.cms",
            "description": "Groww shares experienced a significant decline, dropping as much as 9% to Rs 154 on Thursday. This profit-booking follows a substantial post-listing surge, with the stock now down 18% in two sessions amid concerns over stretched valuations and continued short-selling.",
            "pubDate": "2025-11-20T04:39:57.445315"
        },
        {
            "title": "No Rivalry? Pakistan may be getting hammered in cricket, but it's beating India in stock market returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/no-rivalry-pakistan-may-be-getting-hammered-in-cricket-but-its-beating-india-in-stock-market-returns/articleshow/125452592.cms",
            "description": "Pakistan's stock market has surged over 40% this year, outperforming India's relatively subdued 9% return. This rally is driven by retail investors shifting to equities amid low returns elsewhere and improved economic sentiment, with two ratings agencies upgrading the country. Indian markets faced headwinds from foreign investor outflows due to developed market performance and currency concerns, alongside slower earnings growth.",
            "pubDate": "2025-11-20T04:39:57.445451"
        },
        {
            "title": "Buy, Sell or Hold: ICICI Securities maintains Hold on NSDL; Motilal Oswal maintains buy on L&T",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sell-or-hold-icici-securities-maintains-hold-on-nsdl-motilal-oswal-maintains-buy-on-lt/articleshow/125452498.cms",
            "description": "Brokerages express optimism for select large-cap stocks, citing strong execution and growth potential. ICICI Securities maintains a 'Hold' on NSDL, anticipating market-share gains. Motilal Oswal reiterates 'Buy' ratings on L&T and Reliance Industries, highlighting L&T's order inflow visibility and RIL's New Energy advancements, including its battery GIGA factory.",
            "pubDate": "2025-11-20T04:39:57.445550"
        },
        {
            "title": "Sensex jumps 150 pts, Nifty tops 26,000 as foreign inflows, Nvidia-fuelled rally lift mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-150-pts-nifty-tops-26000-as-foreign-inflows-nvidia-fuelled-rally-lift-mood/articleshow/125452389.cms",
            "description": "Indian stocks opened higher on Thursday, with the Sensex and Nifty gaining ground. This rise was fueled by a fresh surge in foreign investment and a positive risk sentiment across Asian markets. Nvidia's strong earnings report significantly boosted global tech shares, contributing to the optimistic trading environment.",
            "pubDate": "2025-11-20T04:39:57.445645"
        },
        {
            "title": "L&T Technology Services among 4 stocks flashing bullish signals, hinting at a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-technology-services-among-4-stocks-flashing-bullish-signals-hinting-at-a-possible-uptrend/slideshow/125452482.cms",
            "description": "On November 19, in the NSE midcap pack, four stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.\"",
            "pubDate": "2025-11-20T04:39:57.445737"
        },
        {
            "title": "Japan's Nikkei up 4% after bumper Nvidia results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-up-4-after-bumper-nvidia-results/articleshow/125452244.cms",
            "description": "Japanese markets surged today, with the Nikkei climbing four percent, fueled by Nvidia's stellar earnings and booming AI chip demand.  The tech giant's \"off the charts\" sales of its latest hardware eased worries about overvalued tech stocks.  A weaker yen also boosted export-oriented companies, contributing to the positive sentiment.",
            "pubDate": "2025-11-20T04:39:57.445825"
        },
        {
            "title": "Infosys, Max Healthcare among 6 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-max-healthcare-among-6-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125452221.cms",
            "description": "On November 19, in the Nifty50 pack, six stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" indicates that the Relative Strength Index (RSI) values are increasing, suggesting a strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify opportunities for buying.",
            "pubDate": "2025-11-20T04:39:57.445925"
        },
        {
            "title": "Infosys share buyback begins: Should you participate in Rs 18,000 crore offer at 17% premium?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-share-buyback-begins-should-you-participate-in-rs-18000-crore-offer-at-17-premium/articleshow/125452101.cms",
            "description": "Infosys' Rs 18,000 crore share buyback, offering a 17% premium, opened today, closing November 26. Experts see it as a psychological floor for long-term investors and a profit-booking opportunity, signaling management confidence amid uncertain IT demand. While providing modest financial metric boosts, its impact is incremental, not transformative.",
            "pubDate": "2025-11-20T04:39:57.446042"
        },
        {
            "title": "Nvidia’s blowout earnings ignite global tech stocks. What it means for D-Street investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-euphoria-returns-nvidias-blowout-earnings-ignite-global-tech-stocks-d-st-braces-for-surge/articleshow/125452068.cms",
            "description": "Nvidia’s stunning quarterly performance sent a wave of relief through global markets. Analysts said the chipmaker’s powerful guidance restored confidence in the broader AI ecosystem, even as they warned that sentiment could reverse if future growth fails to keep pace. Indian equities, buoyed by IT strength and an upcoming Rs 18,000 crore Infosys buyback, are expected to mirror the global rebound as investors position for a tech-driven session on Dalal Street.",
            "pubDate": "2025-11-20T04:39:57.446146"
        },
        {
            "title": "Sula Vineyards shares fall over 1% as ICRA revises outlook to negative",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sula-vineyards-shares-in-focus-as-icra-revises-outlook-to-negative/articleshow/125452065.cms",
            "description": "Sula Vineyards’ opened in the red after ICRA revised its outlook to negative while reaffirming key ratings. The company posted weaker Q2 results, with profit, revenue and margins declining. Management attributed the softness to Telangana market disruptions but expects H2 improvement, supported by better margins, wine tourism growth and easing inventory pressures.",
            "pubDate": "2025-11-20T04:39:57.446245"
        },
        {
            "title": "Q2 earnings shows Rs 4 lakh crore-crisis may deepen in stock market's riskier corners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-earnings-shows-rs-4-lakh-crore-crisis-may-deepen-in-stock-markets-riskier-corners/articleshow/125452023.cms",
            "description": "Recent Q2 earnings reveal a troubling trend in India's stock market. Smallcap companies are experiencing the highest number of earnings misses, leading to a substantial Rs 4 lakh crore loss in market value this year. While mid-caps and large-caps show positive growth, the riskier smallcap segment faces continued weakness.",
            "pubDate": "2025-11-20T04:39:57.446339"
        },
        {
            "title": "Vikram Solar shares in spotlight as 3-month lock-in ends today; 93 lakh shares available to trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikram-solar-shares-in-spotlight-as-3-month-lock-in-ends-today-93-lakh-shares-available-to-trade/articleshow/125451733.cms",
            "description": "Vikram Solar’s three-month shareholder lock-in ends today, making 93 lakh shares worth Rs 275.7 crore eligible for trade. The newly listed firm, which debuted at Rs 340, is expanding aggressively across modules, cells and BESS, and recently posted sharp profit growth, though the stock remains 27% below its post-listing high.",
            "pubDate": "2025-11-20T04:39:57.446432"
        },
        {
            "title": "Barclays raises target, estimates 11% gain for S&P 500 by end-2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/barclays-raises-target-estimates-11-gain-for-sp-500-by-end-2026/articleshow/125451329.cms",
            "description": "Barclays strategists have boosted their S&P 500 year-end 2026 target to 7,400, anticipating an 11.4% rise driven by megacap tech strength and a supportive monetary and fiscal outlook. They foresee faster tech earnings growth, though acknowledge potential headwinds for other sectors due to inflation and unemployment.",
            "pubDate": "2025-11-20T04:39:57.446520"
        },
        {
            "title": "Anil Ambani’s Reliance Power shares rise 5%, snap 3-day fall. What’s behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anil-ambanis-reliance-power-shares-rise-5-snap-3-day-fall-whats-behind-the-surge/articleshow/125453959.cms",
            "description": "Reliance Power shares rose sharply after the company announced a major governance overhaul and key clean-energy milestones. The board approved a new Board of Management to strengthen oversight, while subsidiary Reliance NU Energies secured 4 GW solar and 6.5 GW BESS capacity.",
            "pubDate": "2025-11-20T05:38:39.867014"
        },
        {
            "title": "Swiggy back to square one as stock sinks 56% from peak, returns to IPO price. What's ahead?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-back-to-square-one-as-stock-sinks-56-from-peak-returns-to-ipo-price-whats-ahead/articleshow/125453876.cms",
            "description": "Swiggy's stock has fallen 56% from its peak, returning to its IPO price of Rs 390. Despite a 54% revenue jump, the company's net loss widened to Rs 1,092 crore in Q2FY26, primarily due to quick commerce expansion. Brokerages remain divided on its future prospects.",
            "pubDate": "2025-11-20T05:38:39.867141"
        },
        {
            "title": "QT ends sooner than expected as Fed prioritizes market calm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/qt-ends-sooner-than-expected-as-fed-prioritizes-market-calm/slideshow/125453790.cms",
            "description": "The Federal Reserve’s October meeting minutes show that “almost all” policymakers supported stopping the balance-sheet drawdown from 1 December. The early halt surprised markets, as expectations had pointed to a much later end. Only one member dissented, preferring an immediate stop. (Source: Reuters)",
            "pubDate": "2025-11-20T05:38:39.867245"
        },
        {
            "title": "JP Power shares rally nearly 30% in two days after Adani Group wins creditor nod for JP Associates acquisition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jp-power-shares-rally-nearly-30-in-two-days-after-adani-group-wins-creditor-nod-for-jp-associates-acquisition/articleshow/125453399.cms",
            "description": "JP Power News: Jaiprakash Power Ventures surged nearly 30% in two sessions after the Adani Group secured Committee of Creditors approval to acquire Jaiprakash Associates. The $1.5-billion deal marks a major step in the Jaypee Group’s insolvency process. Adani Enterprises received a Letter of Intent (LoI) from the Resolution Professional on November 19, 2025.",
            "pubDate": "2025-11-20T05:38:39.867342"
        },
        {
            "title": "Nvidia’s AI Tipping Point: Boom or Bubble?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nvidias-ai-tipping-point-boom-or-bubble/slideshow/125453343.cms",
            "description": "Huang argues the world is at a tipping point, not a bubble. He believes Nvidia-style accelerated computing will permeate everything—from writing software to running real-world robots. (Source: Reuters)",
            "pubDate": "2025-11-20T05:38:39.867438"
        },
        {
            "title": "ITC voluntary delists from Calcutta Stock Exchange",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-voluntary-delists-from-calcutta-stock-exchange/articleshow/125456227.cms",
            "description": "Diversified conglomerate ITC has successfully completed the voluntary delisting of its shares from the Calcutta Stock Exchange (CSE), effective November 20, 2025. While ITC's shares will continue trading on the NSE and BSE, the CSE, one of India's oldest exchanges, is exiting the business after regulatory issues. This move follows ITC's board approval earlier in October.",
            "pubDate": "2025-11-20T07:32:54.453293"
        },
        {
            "title": "For investors focused on a strong long-term portfolio: 5 large-caps from different sectors with upside potential of more than 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-focused-on-a-strong-long-term-portfolio-5-large-caps-from-different-sectors-with-upside-potential-of-more-than-25/articleshow/125455856.cms",
            "description": "Not every company can capitalise on every opportunity. Since liberalisation began in 1991, dozens of sectors have opened and countless companies have piled in. Some scaled; many stumbled. The difference between success and failure usually comes down to one thing: Management quality. And by “quality”, we mean the full stack: Spotting opportunities early, being bold at the right moments, deploying capital wisely, and knowing when to be cautious. Today, as India continues to be one of the most expensive stock markets globally, it is time to give due importance to something which we all tend to ignore.",
            "pubDate": "2025-11-20T07:32:54.453402"
        },
        {
            "title": "12 stocks down over 50% from their yearly high; are you holding any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-stocks-down-over-50-from-their-yearly-high-are-you-holding-any/slideshow/125455651.cms",
            "description": "Over the past year, the Indian equity markets have witnessed an impressive rally. The benchmark Nifty50 surged roughly 11%, while the broader Nifty500 climbed around 9%. Many investors have ridden this momentum, as both indices hover near their yearly highs, reflecting optimism and resilience in the market.However, amid this rally, a contrasting story emerges—one that demands attention. Not all stocks have shared in the market’s exuberance. Today, our analysis focuses on 12 Nifty500 stocks that have seen steep corrections, each falling more than 50% from their yearly highs. (Data Source: ACE Equity)",
            "pubDate": "2025-11-20T07:32:54.453504"
        },
        {
            "title": "Rs 8,600 crore wipeout! PhysicsWallah shares crash 19% from day 1 peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallah-shares-slide-9-in-sharp-reversal-from-debut-rally-m-cap-shrinks-by-rs-8600-crore-since-listing/articleshow/125455418.cms",
            "description": "PhysicsWallah’s early rally has unwound quickly, with the stock extending losses for a second straight session and its market value dropping from nearly Rs 46,300 crore on listing day to below Rs 37,700 crore. Analysts say the company’s strong brand and hybrid learning model support its long-term outlook but warn that competition, regulatory risks and profitability pressures could drive further volatility.",
            "pubDate": "2025-11-20T07:32:54.453590"
        },
        {
            "title": "Sammaan Capital shares jump 9% from day’s low as firm issues clarification on CBI probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sammaan-capital-shares-jump-9-from-days-low-as-firm-issues-clarification-on-cbi-probe/articleshow/125455381.cms",
            "description": "Sammaan Capital shares rebounded sharply on Thursday after the company clarified that no investigative or regulatory agency has any ongoing probe related to allegations in a 2019 PIL filed by a whistleblower forum. The Supreme Court also noted that no affidavit indicated wrongdoing by the firm, helping the stock recover following Tuesday’s sharp decline.",
            "pubDate": "2025-11-20T07:32:54.453674"
        },
        {
            "title": "AI doomsday? Not yet. Why Nvidia results are dragging the tech bulls back to work",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-doomsday-not-yet-why-nvidia-results-are-dragging-the-tech-bulls-back-to-work/articleshow/125454542.cms",
            "description": "Nvidia’s blockbuster earnings shattered fears of an AI slowdown, delivering a record revenue beat and reigniting a global tech rally. Surging demand for Blackwell GPUs, strong guidance, and accelerating data-center growth helped silence AI doomsday narratives. Markets across Asia rallied sharply as investors regained confidence that the AI boom is far from losing momentum.",
            "pubDate": "2025-11-20T07:32:54.453760"
        },
        {
            "title": "What are the likely trends that can trigger a rally in the market?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-are-the-likely-trends-that-can-trigger-a-rally-in-the-market/articleshow/125454486.cms",
            "description": "India's stock market has underperformed global peers due to stretched valuations and a dip in earnings growth. However, a consumption boom fueled by fiscal stimulus and rate cuts is expected to drive earnings recovery from Q3 FY26, potentially triggering a market rally. Global trends, especially US developments, will also play a crucial role.",
            "pubDate": "2025-11-20T07:32:54.453845"
        },
        {
            "title": "Stock Radar: Why is BSE stock poised for an up move towards 3000 levels; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-why-is-bse-stock-poised-for-an-up-move-towards-3000-levels-time-to-buy/articleshow/125435250.cms",
            "description": "BSE Ltd has broken out of a four-month trading range. Experts see bulls taking control. Traders with a high-risk profile can buy the stock. A target above 3000 levels is suggested in the next one to two months. The stock shows strong structural strength. Momentum indicators support an upward move. A stop loss of 2680 is advised.",
            "pubDate": "2025-11-20T11:41:01.832917"
        },
        {
            "title": "Physicswallah's mathematics puzzle: Stock ends 2% lower on BSE, 3% higher on NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallahs-mathematics-puzzle-stock-ends-2-lower-on-bse-3-higher-on-nse/articleshow/125460760.cms",
            "description": "PhysicsWallah’s stock delivered conflicting signals at Thursday’s close, finishing higher on the NSE and lower on the BSE in an unusual split that highlighted heightened volatility in the days following its blockbuster listing. The divergent closing prices came after a sharp intraday slide that erased significant market value.",
            "pubDate": "2025-11-20T11:41:01.833041"
        },
        {
            "title": "Tilaknagar Industries: Star investor Madhusudan Kela picks 34 lakh shares in Mansion House maker",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tilaknagar-industries-star-investor-madhusudan-kela-picks-34-lakh-shares-in-mansion-house-maker/articleshow/125458670.cms",
            "description": "Tilaknagar Industries strengthened its capital base by allotting equity shares to Singularity Equity Fund as it accelerates expansion beyond brandy, launches a premium pure malt whisky, and prepares to acquire Imperial Blue to deepen its presence in India’s growing spirits market.",
            "pubDate": "2025-11-20T11:41:01.833242"
        },
        {
            "title": "Nifty all-time high within striking distance. Who's throwing bears out of the market?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-all-time-high-within-striking-distance-whos-throwing-bears-out-the-market/articleshow/125458139.cms",
            "description": "Nifty and Sensex are nearing record-breaking milestones. Financial luminaries like Morgan Stanley and Goldman Sachs are exhibiting optimism about India's growth trajectory. They predict that Indian stocks will see remarkable gains ahead, driven by strong economic fundamentals and a surge in corporate earnings that reflect a thriving business environment.",
            "pubDate": "2025-11-20T11:41:01.833351"
        },
        {
            "title": "Zerodha staffer owns 3,100 stocks — nearly the entire NSE universe trading today. Here's what Nithin Kamath says",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-staffer-owns-3100-stocks-nearly-the-entire-nse-universe-trading-today-heres-what-nithin-kamath-says/articleshow/125458181.cms",
            "description": "Zerodha CEO Nithin Kamath revealed that a company colleague now holds an astonishing 3,100 stocks—nearly the entire NSE universe—pushing diversification to an extreme. Kamath’s post triggered witty reactions online, with users calling it a “personal mutual fund” and warning that excessive diversification, high costs, and microcap illiquidity could drag long-term returns.",
            "pubDate": "2025-11-20T11:41:01.833447"
        },
        {
            "title": "Nvidia Effect: This smallcap multibagger stock soars 6% after strong earnings from tech giant",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nvidia-effect-this-smallcap-multibagger-stock-soars-6-after-strong-earnings-from-tech-giant/articleshow/125457520.cms",
            "description": "Netweb Technologies shares: The stock jumped after Nvidia’s strong Q4 results boosted sentiment. The stock surged because Netweb has a deep partnership with Nvidia to build high-end computing systems, including Blackwell-powered AI servers.",
            "pubDate": "2025-11-20T11:41:01.833540"
        },
        {
            "title": "Japan's Nikkei snaps 4-day loss as Nvidia outlook boosts tech sector",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-snaps-4-day-loss-as-nvidia-outlook-boosts-tech-sector/articleshow/125456780.cms",
            "description": "The Nikkei 225 Index briefly climbed above the key psychological 50,000 figure before losing some momentum in the afternoon. The gauge closed up 2.7% at 49,823.94, while the broader Topix gained 1.7%.",
            "pubDate": "2025-11-20T11:41:01.833663"
        }
    ]
}