{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-21T06:42:38.866155",
    "items": [
        {
            "title": "Q3 results today: Eternal among 59 companies to report earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-eternal-among-59-companies-to-report-earnings-on-wednesday/articleshow/126910900.cms",
            "description": "Indian markets brace for a busy earnings day with 59 companies reporting Q3 results. Investors are keenly watching Eternal's expected strong revenue growth, driven by quick commerce expansion. Meanwhile, Dr. Reddy's Laboratories anticipates a muted quarter, primarily due to pressures in its US business offsetting gains elsewhere.",
            "pubDate": "2026-01-21T04:05:20.138325"
        },
        {
            "title": "J&K Bank stays on track; Q3 net profit rises 10.4% YoY despite Pahalgam attack and floods: MD & CEO Amitava Chatterjee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jk-bank-remains-firmly-on-track-despite-pahalgam-attack-and-floods-records-10-4-net-profit-yoy-in-q3-md-ceo-amitava-chatterjee-srinagar/articleshow/126927411.cms",
            "description": "Jammu and Kashmir Bank is on track for a fourth consecutive year of record profits, despite facing challenges like the Pahalgam attack and floods. The bank reported a 10.4% year-on-year rise in net profit to Rs 586.73 crore for the third quarter, driven by robust growth in advances and deposits, and improved asset quality.",
            "pubDate": "2026-01-21T04:52:37.913818"
        },
        {
            "title": "KPI Green Energy Q3 Results: Net profit grows 48% YoY to Rs 126 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kpi-green-energy-q3-results-net-profit-grows-48-yoy-to-rs-126-cr/articleshow/126941459.cms",
            "description": "KPI Green Energy reported a significant 48% surge in its consolidated net profit, reaching Rs 125.80 crore for the December quarter of 2025, driven by robust revenue growth. Total income climbed to Rs 676.05 crore. The company also announced a third interim dividend of 0.20 paisa per equity share for FY 2025-26.",
            "pubDate": "2026-01-21T06:42:38.138472"
        }
    ]
}