{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-13T14:47:29.832979",
    "items": [
        {
            "title": "Q2 results this week: RIL, HDFC Bank, Infosys among 145 companies to announce earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-this-week-ril-hdfc-bank-infosys-among-145-companies-to-announce-earnings/articleshow/114186223.cms",
            "description": "The second quarter earnings season is underway and as many as 145 companies will declare their results this week. Some of the marquee names include Axis Bank, Bajaj Auto, Reliance Industries, Tech Mahindra, Infosys, Nestle, HCL Tech among others.",
            "pubDate": "2024-10-13T14:47:08.942769"
        },
        {
            "title": "RIL Q2 Preview: PAT may fall 10% YoY; weak O2C seen hurting operational performance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q2-preview-pat-may-fall-10-yoy-weak-o2c-seen-hurting-operational-performance/articleshow/114185122.cms",
            "description": "Mukesh Ambani-led Reliance Industries (RIL) is likely to report muted earnings for the second quarter, hurt by weakness in the O2C (oil-to-chemicals) segment. The company will declare its results on October 14.",
            "pubDate": "2024-10-13T14:47:08.942888"
        },
        {
            "title": "HCL Tech Q2 preview: PAT may jump 5-15% YoY; up to 9% revenue growth seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-q2-results-preview-up-to-9-yoy-growth-seen-in-revenue-pat-may-jump-in-a-wide-range-of-5-15/articleshow/114184689.cms",
            "description": "India’s third largest IT company by way of market capitalisation, HCL Technologies is expected to report revenue growth at 7.1%-9.2% on a year-on-year basis for the quarter ended September 30, 2024. Estimates by five brokerages peg revenue figures between Rs 26,672 crore and Rs 28,710 crore in Q2FY25.",
            "pubDate": "2024-10-13T14:47:08.942998"
        },
        {
            "title": "Network18's Q2 net loss widens by 28% to Rs 152 crore amid continued investments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/network18s-q2-net-loss-widens-by-28-to-rs-152-crore-amid-continued-investments/articleshow/114177866.cms",
            "description": "Network18 Media & Investments reported a 28% YoY increase in net loss for the quarter ending 30th September, reaching Rs 152 crore. Losses rose due to sustained investments in digital and sports by its entertainment subsidiary Viacom18. Additionally, Network18 has completed its merger with TV18 and E18, creating India's leading platform-agnostic news media network.",
            "pubDate": "2024-10-13T14:47:08.943093"
        },
        {
            "title": "DMart Q2 Results: Standalone PAT jumps 8% YoY to Rs 710 crore, revenue up 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dmart-q2-results-standalone-pat-jumps-8-yoy-to-rs-710-crore-revenue-up-14/articleshow/114168339.cms",
            "description": "Avenue Supermarts, which opeartes DMart stores reported an 8% year-on-year jump in its September quarter standalone net profit at Rs 710.37 crore versus Rs 658.54 crore reported in the year ago period.",
            "pubDate": "2024-10-13T14:47:08.943192"
        },
        {
            "title": "Network18 Q2 Results: Cons loss widens YoY to Rs 221 crore, revenue falls 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/network18-q2-results-cons-loss-widens-yoy-to-rs-221-crore-revenue-falls-2/articleshow/114168156.cms",
            "description": "Network18 Media & Investments on Saturday widened its September quarter consolidated loss to Rs 221 versus Rs 83 crore reported by the company in the year ago period. It was also higher on a sequential basis as the company had reported a net loss at Rs 125 crore in Q1FY25.",
            "pubDate": "2024-10-13T14:47:08.943294"
        },
        {
            "title": "Arkade Developers Q1 profit jumps over 4 times to Rs 30.21 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/arkade-developers-q1-profit-jumps-over-4-times-to-rs-30-21-cr/articleshow/114150683.cms",
            "description": "Realty firm Arkade Developers Ltd, which got listed on the stock exchanges recently, has reported a more than four-fold jump in its consolidated net profit to Rs 30.21 crore for the first quarter of this fiscal year. Its profit stood at Rs 6.57 crore in the year-ago period.",
            "pubDate": "2024-10-13T14:47:08.943389"
        },
        {
            "title": "Just Dial Q2 Results: Net profit zooms 114% YoY to Rs 154 crore, revenue up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/just-dial-q2-results-net-profit-zooms-114-yoy-to-rs-154-crore-revenue-up-9/articleshow/114144021.cms",
            "description": "The company's net revenue from operations for the reported quarter was ₹285 crore, reflecting a 9% increase from ₹261 crore in the same quarter of the previous financial year.",
            "pubDate": "2024-10-13T14:47:08.943488"
        },
        {
            "title": "Q2 results today: Just Dial among 6 companies to announce earnings on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-just-dial-among-6-companies-to-announce-earnings-on-friday/articleshow/114134459.cms",
            "description": "Six companies, including Just Dial, are set to announce their second-quarter results on Friday. Analysts predict this quarter might be the weakest in four years for corporate India, with Nifty earnings projected to grow by just 2%. Just Dial is anticipated to show a 75% rise in profit year-on-year, driven by growth in paid campaigns and improved EBITDA margins.",
            "pubDate": "2024-10-13T14:47:08.943589"
        },
        {
            "title": "India deal lifts TCS Q2 revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-deal-lifts-tcs-q2-revenue/articleshow/114133737.cms",
            "description": "CEO K Krithivasan cited “some signs of improvement, most notably in financial services in North America,” acknowledging that the “demand outlook continues to remain cautious”, on an analyst call after earnings were announced. A planned press conference was cancelled due to the death of Ratan Tata.",
            "pubDate": "2024-10-13T14:47:08.943687"
        },
        {
            "title": "TCS clear of clouds for now, but rough weather ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-maintains-headcount-momentum-but-profitability-takes-hit-amid-deal-ramp-ups/articleshow/114125672.cms",
            "description": "On the positive side, the traction in new deals for the banks, financial services, and insurance (BFSI) vertical showed improvement and headcount increased year-on-year for the first time in five quarters. Given the seasonal weakness in the remaining two quarters of the current fiscal year, the overall growth and margin trajectory may show stress on a full year basis, which may weigh on the company’s stock price in the near term.",
            "pubDate": "2024-10-13T14:47:08.943792"
        },
        {
            "title": "Tata Elxsi Q2 Results: PAT rises 14% YoY to Rs 229 crore; revenue up 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-elxsi-q2-results-pat-rises-14-yoy-to-rs-229-crore-revenue-up-8/articleshow/114124635.cms",
            "description": "Tata Elxsi reported a 14% increase in net profit at Rs 229 crore for the second quarter. Revenue from operations grew by 8% to Rs 955 crore. Growth was driven by strong performance in emerging markets, particularly in transportation. A $50 million deal with a global OEM also contributed. Media and healthcare segments saw some declines.",
            "pubDate": "2024-10-13T14:47:08.943889"
        },
        {
            "title": "Anand Rathi Q2 Results: Cons PAT jumps 32% YoY to Rs 76 crore. Rs 7/share interim dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/anand-rathi-q2-results-cons-pat-jumps-32-yoy-to-rs-76-crore-rs-7/share-interim-dividend-declared/articleshow/114122978.cms",
            "description": "Anand Rathi Wealth posted a net profit of Rs 76 crores for Q2FY25, up 32% from the previous year. Total revenue rose 32% to Rs 250 crores. AUM grew by 57% to Rs 75,084 crores. The company welcomed 1,066 new client families in the first half of FY25. An interim dividend of Rs 7 per share was declared.",
            "pubDate": "2024-10-13T14:47:08.943990"
        },
        {
            "title": "IREDA Q2 Results: PAT jumps 36% YoY to Rs 388 crore, revenue up 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ireda-q2-results-pat-jumps-36-to-rs-388-crore-revenue-up-38/articleshow/114121650.cms",
            "description": "State-run Indian Renewable Energy Development Agency (IREDA) on Thursday reported a net profit of Rs 388 crore for the quarter ended September 30, 2024 which was up 36% over Rs 285 crore reported by the company in the year ago period. Revenue from operations in Q2FY25 stood at Rs 1,629 crore which was up by 38% against Rs 1,177 crore reported by the company in Q2FY24.",
            "pubDate": "2024-10-13T14:47:08.944082"
        },
        {
            "title": "TCS Q2 Results: Profit rises 5% YoY to Rs 11,909 crore, misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q2-results-profit-rises-5-yoy-to-rs-11909-crore-misses-estimates/articleshow/114119023.cms",
            "description": "TCS Q2 Results: Tata Consultancy Services (TCS), India's leading software exporter, reported a 5% growth in consolidated net profit, reaching Rs 11,909 crore for Q2 ended September 2024, compared to Rs 11,342 crore in the same period last year. However, this figure fell short of analysts' expectations, which estimated a profit of Rs 12,450 crore. Revenue from operations rose 8% year-on-year to Rs 64,259 crore.",
            "pubDate": "2024-10-13T14:47:08.944172"
        },
        {
            "title": "TCS to declare Q2 results today, but press conference cancelled after Ratan Tata's demise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-cancels-q2-earnings-press-conference-on-thursday-evening/articleshow/114105532.cms",
            "description": "Tata Consultancy Services (TCS) cancelled its Thursday evening press conference to announce second quarter results. TCS will still inform the exchanges about July-September performance after the board meeting. A call with analysts at 7 pm will proceed as planned. Ratan Tata's last rites are scheduled for Thursday after 4 pm in central Mumbai.",
            "pubDate": "2024-10-13T14:47:08.944265"
        }
    ]
}