{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-25T18:23:09.295153",
    "items": [
        {
            "title": "L&T shares in focus after strategic tie-up with BEL for 5th-gen fighter jet programme",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-shares-in-focus-after-strategic-tie-up-with-bel-for-5th-gen-fighter-jet-programme/articleshow/124104054.cms",
            "description": "Larsen & Toubro (L&T) and Bharat Electronics Ltd (BEL) have announced a strategic partnership to support the Indian Air Force’s Advanced Medium Combat Aircraft (AMCA) programme, a key element of India’s 5th-generation fighter jet initiative. The consortium will leverage L&T’s aerospace expertise and BEL’s defence electronics capabilities, advancing indigenous defence under the ‘Atmanirbhar Bharat’ initiative.",
            "pubDate": "2025-09-25T03:52:31.076646"
        },
        {
            "title": "Polycab India shares in focus as promoters likely set to offload Rs 887 crore equity via block deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/polycab-india-shares-in-focus-as-promoters-likely-set-to-offload-rs-887-crore-equity-via-block-deals/articleshow/124104003.cms",
            "description": "Polycab share price: Polycab India promoters plan to sell up to 0.81% stake via block deals worth around Rs 887 crore, with a floor price of Rs 7,300 per share. Multiple promoter group members, including Inder and Ajay Jaisinghani, are participating in the stake sale.",
            "pubDate": "2025-09-25T03:52:31.076775"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Zydus Lifesciences, Shree Cement among 5 stocks that could give 12-36% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-zydus-lifesciences-shree-cement-among-5-stocks-that-could-give-12-36-return/slideshow/124103780.cms",
            "description": "Brokerages remain optimistic on select stocks across pharma, cement, banking, consumer, and chemicals.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-25T03:52:31.076888"
        },
        {
            "title": "Waaree Energies shares in focus on Rs 300 crore investment in subsidiary for battery cell plant",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-in-focus-on-rs-300-crore-investment-in-subsidiary-for-battery-cell-plant/articleshow/124103943.cms",
            "description": "Waaree Energies share price: Waaree Energies has announced a Rs 300 crore investment in its wholly-owned subsidiary, Waaree Energy Storage Solutions Private Limited, to set up a 3.5 GWh lithium-ion battery cell plant. The infusion, via a rights issue, aims to boost the company’s renewable energy and energy storage capabilities.",
            "pubDate": "2025-09-25T03:52:31.076990"
        },
        {
            "title": "Nazara Technologies shares approach record date for 1:1 bonus issue, 1:2 stock split. What it means for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-technologies-shares-approach-record-date-for-11-bonus-issue-12-stock-split-what-it-means-for-investors/articleshow/124103663.cms",
            "description": "Nazara Technologies investors, take note. September 25 is the last day to buy shares for the bonus issue and stock split. Shares will trade ex-bonus and ex-split from September 26. The company announced a 1:1 bonus and a 1:2 stock split. This aims to improve liquidity and affordability. Investors will see their share count increase.",
            "pubDate": "2025-09-25T03:52:31.077086"
        },
        {
            "title": "Stock split, bonus issue alert! Last day to buy shares of these 6 cos to qualify for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-split-bonus-issue-alert-last-day-to-buy-shares-of-these-6-cos-to-qualify-for-eligibility/articleshow/124103630.cms",
            "description": "Investors, take note. Today is the final day to buy shares of companies like MOS Utility. This is to be eligible for upcoming stock splits and bonus issues. PVV Infra and RM Drip are splitting their stocks. Chandra Prabhu International and KKV Agro Powers are among those issuing bonus shares. Ensure shares are in your demat account by today's end.",
            "pubDate": "2025-09-25T03:52:31.077185"
        },
        {
            "title": "JD Cables IPO shares to list today; decent GMP keeps investors interested",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jd-cables-ipo-shares-to-list-today-decent-gmp-keeps-investors-interested/articleshow/124103456.cms",
            "description": "JD Cables, a Howrah-based manufacturer, will launch on the BSE SME platform. The IPO saw strong investor interest, subscribing 127.8 times. The IPO price was finalized at Rs 152 per share. Grey market activity indicates a premium. Retail investors, QIBs, and NIIs showed significant demand. The company will use IPO proceeds for working capital and debt repayment.",
            "pubDate": "2025-09-25T03:52:31.077277"
        },
        {
            "title": "Ivalue Infosolutions IPO listing today. GMP suggests cautious buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ivalue-infosolutions-ipo-listing-today-gmp-suggests-cautious-buzz/articleshow/124103397.cms",
            "description": "Bengaluru's Ivalue Infosolutions is set to launch on the market. Its Rs 560 crore IPO closed recently. The IPO was subscribed 1.82 times. Anchor investors invested Rs 168 crore. The company specializes in digital transformation. It operates in multiple countries. Revenue for FY25 reached Rs 942 crore. Net profit rose to Rs 85.3 crore.",
            "pubDate": "2025-09-25T03:52:31.077365"
        },
        {
            "title": "Netweb Tech, Samvardhana Motherson among 6 stocks close crossing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-tech-samvardhana-motherson-among-6-stocks-close-crossing-below-vwap/slideshow/124103373.cms",
            "description": "The closing prices of six stocks from Nifty500 dropped over 1.5% relative to the VWAP (Volume Weighted Average Price) on September 24, and a shift below the VWAP suggests a potential bearish trend, according to stockedge.com's technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.",
            "pubDate": "2025-09-25T03:52:31.077456"
        },
        {
            "title": "Premier Energies, JSW Holdings among 6 stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-jsw-holdings-among-6-stocks-showing-bullish-rsi-upswing/slideshow/124103246.cms",
            "description": "Six stocks from the Nifty500 pack that gained over 1% on September 24 were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-25T03:52:31.077567"
        },
        {
            "title": "Negative Breakout: These 10 stocks close cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-close-cross-below-their-200-dmas/slideshow/124102913.cms",
            "description": "In the Nifty200 pack, 10 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on September 24, according to stockedge.com's technical scan data. Trading below the 200 DMA is a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders to determine a particular stock's overall trend. Take a look:",
            "pubDate": "2025-09-25T03:52:31.077662"
        },
        {
            "title": "US equities end lower as valuation concerns creep in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-equities-end-lower-as-valuation-concerns-creep-in/articleshow/124102774.cms",
            "description": "U.S. stocks closed lower on Wednesday as investors took profits amid concerns about high valuations flagged by Fed Chair Powell. The market awaits key inflation data, while sectors showed mixed performance, with materials declining and energy rising. Company news included a surge for Lithium Americas and a drop for Micron Technology, influencing overall market sentiment.",
            "pubDate": "2025-09-25T03:52:31.077754"
        },
        {
            "title": "Asian stocks in tight range as global rally stalls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-in-tight-range-as-global-rally-stalls/articleshow/124102436.cms",
            "description": "Asian stocks showed mixed performance following Wall Street's losses, as an AI-driven rally showed signs of fatigue. Investors are closely watching policy risks, including US investigations into imports and concerns over visa issues affecting Korean investments. Attention is now shifting to upcoming economic data and potential impacts on market direction as October approaches.",
            "pubDate": "2025-09-25T03:52:31.077843"
        },
        {
            "title": "JSW plans Rs 7,000 crore NCDs for AkzoNobel buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-plans-rs-7000-crore-ncds-for-akzonobel-buy/articleshow/124102390.cms",
            "description": "JSW Group plans to raise funds for acquiring AkzoNobel India. The group will issue non-convertible debentures to raise ₹7,000 crore. JTPM Metal Traders will handle the issuance. The bonds have a tenure of four years and seven months. They offer an IRR of 8.5%. The NCDs are backed by corporate guarantees from JSW Group entities.",
            "pubDate": "2025-09-25T03:52:31.077940"
        },
        {
            "title": "Quest Global may sell up to 6% holding to raise over $200 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/quest-global-may-sell-up-to-6-holding-to-raise-over-200-million/articleshow/124102372.cms",
            "description": "Quest Global, the engineering services outsourcing firm, is planning a pre-IPO funding round aiming for a valuation between $3 billion and $3.5 billion. The company intends to sell a 5-6% stake, seeking $200-$225 million from a new investor, involving both primary and secondary share sales.",
            "pubDate": "2025-09-25T03:52:31.078036"
        },
        {
            "title": "Quadria Capital weighs Encube sale, keeps public float option alive, too",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/quadria-capital-weighs-encube-sale-keeps-public-float-option-alive-too/articleshow/124102344.cms",
            "description": "Quadria Capital is exploring options to sell its stake in Encube Ethicals. The healthcare investor considers both a controlling stake sale and an IPO. Encube Ethicals, a dermatology firm, is valued at $2.2 billion. KKR, Blackstone, and EQT show interest in acquiring a stake. JP Morgan is already mandated for the sale.",
            "pubDate": "2025-09-25T03:52:31.078130"
        },
        {
            "title": "Ganesh Infraworld plans Rs 200–250 crore share sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ganesh-infraworld-plans-rs-200250-crore-share-sale/articleshow/124106995.cms",
            "description": "Ganesh Infraworld, an EPC firm based in Kolkata, intends to raise funds. The company plans to secure Rs 200-250 crore through a qualified institutional placement soon. Ganesh Infraworld got listed on NSE SME Emerge platform last year. Since its debut, the company's stock has increased significantly. However, the company's shares experienced a slight dip recently.",
            "pubDate": "2025-09-25T06:50:54.048850"
        },
        {
            "title": "IPO Watch: Gurunanak Agriculture, Matrix Geo among 5 SME issues in focus. Who’s leading the GMP race?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-watch-gurunanak-agriculture-matrix-geo-among-5-sme-issues-in-focus-whos-leading-the-gmp-race/slideshow/124106921.cms",
            "description": "In the IPO-heavy week, SME IPOs have been drawing varied investor interest. Investors should track these five public issues on NSE: Gurunanak Agriculture India, Matrix Geo Solutions, Ecoline Exim, Prime Cable Industries, and Manas Polymers and Energies. Their respective grey market premiums (GMPs) provide an early glimpse of potential listing trends.",
            "pubDate": "2025-09-25T06:50:54.048962"
        },
        {
            "title": "Investing: Buying correct business & ignoring volatility in Nifty. 6 large-caps from different sectors with upside potential of up to 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investing-buying-correct-business-ignoring-volatility-in-nifty-6-large-caps-from-different-sectors-with-upside-potential-of-up-to-35/articleshow/124106341.cms",
            "description": "Here’s an interesting way to categorise Indian equity investors: Those who entered the market before Covid, and those who did so post-Covid. Now, a large majority of today’s investors would fall in the post-Covid category. Why is this worth mentioning at this juncture? Because it is perhaps for the first time that these investors are witnessing an extended correction – the market has been falling for close to a year now. Our message for these investors: Corrections or phases where stock prices fall are inevitable in the market. And may happen for global or domestic reasons. So, focus on investing in a “correct business” because it creates wealth even after weathering all storms. The question is: What is a correct business?",
            "pubDate": "2025-09-25T06:50:54.049068"
        },
        {
            "title": "SBI could receive $466 million in passive inflows if FII limit is raised",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-could-receive-466-million-in-passive-inflows-if-fii-limit-is-raised/articleshow/124106279.cms",
            "description": "State Bank of India could attract up to $466 million in passive inflows if the foreign investment limit for public-sector banks is raised from 20% to 26%, Nuvama Institutional Equities said. The move would allow higher MSCI index weightings. The government is reportedly considering the change as part of reforms to boost capital while retaining at least 51% public ownership in PSBs.",
            "pubDate": "2025-09-25T06:50:54.049158"
        },
        {
            "title": "Hindustan Copper shares rally over 6% on surge in global copper prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-surge-6-as-global-copper-prices-jump-on-halt-at-worlds-second-largest-mine/articleshow/124106115.cms",
            "description": "Hindustan Copper shares surged sharply after global copper prices spiked due to a production halt at Grasberg, the world’s second-largest copper mine in Indonesia. The mine suspension, caused by a fatal mudflow, tightened global supply and pushed copper futures to 15-month highs.",
            "pubDate": "2025-09-25T06:50:54.049248"
        },
        {
            "title": "Sebi hasn’t started consultation process to remove weekly expiry, says Nithin Kamath",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-hasnt-started-consultation-process-to-remove-weekly-expiry-says-nithin-kamath/articleshow/124105948.cms",
            "description": "Sebi has intensified scrutiny of the options market following surveys highlighting significant retail losses. The regulator floated the idea of extending derivative contract tenures last month and recently introduced measures such as delta-based open interest calculation. These changes could impact major market participants, potentially moderating trading volumes and reducing volatility, while Kamath acknowledged possible restrictions on weekly options or stricter suitability norms.",
            "pubDate": "2025-09-25T06:50:54.049334"
        },
        {
            "title": "Nine colours of Navratri, nine shades of financial wisdom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nine-colours-of-navratri-nine-shades-of-financial-wisdom/articleshow/124105771.cms",
            "description": "Axis Mutual Fund connects Navratri's nine colours with financial wisdom, urging investors to embrace qualities like peace, courage, and stability. It emphasizes building a secure financial foundation through diversified investments and disciplined budgeting. The article highlights the importance of early action, aligning ambition with prudence, and goal-based investing to secure loved ones' futures.",
            "pubDate": "2025-09-25T06:50:54.049419"
        },
        {
            "title": "Adani Power shares bounce back, rise 6% after 2-day selloff. What triggered the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-bounce-back-rise-6-after-2-day-selloff-what-triggered-the-surge/articleshow/124105678.cms",
            "description": "Adani Power shares rose sharply on Thursday after a two-day, 21% decline triggered by profit booking post-stock split and rally. Investor sentiment improved following Sebi’s regulatory clearance, a shareholder letter from Gautam Adani, and strong group financials, highlighting robust growth and key operational milestones.",
            "pubDate": "2025-09-25T06:50:54.049505"
        },
        {
            "title": "Dixon Technologies shares rise as UBS upgrades it to buy rating, sees 27% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-shares-rise-as-ubs-upgrades-it-to-buy-rating-sees-27-upside/articleshow/124105436.cms",
            "description": "Dixon Technologies shares: UBS upgraded the stock to a ‘Buy’ with a ₹23,000 target, implying ~27% upside. UBS highlighted Dixon’s expansion into non-semiconductor smartphone components, expecting EBITDA margins to rise 110 bps by FY28, outperforming consensus estimates.",
            "pubDate": "2025-09-25T06:50:54.049589"
        },
        {
            "title": "Citi re-initiates coverage on SBI with ‘buy’ rating, sets Rs 1,050 target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citi-re-initiates-coverage-on-sbi-with-buy-rating-sets-rs-1050-target-price/articleshow/124105409.cms",
            "description": "Citi has re-initiated coverage on State Bank of India (SBI) with a ‘Buy’ rating and a target price of Rs 1,050, citing strong credit growth, improved returns, and operational efficiencies. The brokerage expects FY26–FY27 loan growth of 13–14%, NIMs of 2.8–2.9%, and ROE of 14–15%. Risks include asset slippages, lower NIMs, and higher credit costs.",
            "pubDate": "2025-09-25T06:50:54.049675"
        },
        {
            "title": "China Moves to Strengthen Yuan Bonds in Hong Kong",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-moves-to-strengthen-yuan-bonds-in-hong-kong/slideshow/124105284.cms",
            "description": "China’s central bank will roll out a series of measures to support the development of Chinese yuan bonds in Hong Kong. The move aims to strengthen the offshore bond market and attract more investors. (Source: Reuters)",
            "pubDate": "2025-09-25T06:50:54.049761"
        },
        {
            "title": "Economists See RBI Keeping Interest Rate Steady at 5.50% Through 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/economists-see-rbi-keeping-interest-rate-steady-at-5-50-through-2025/slideshow/124105002.cms",
            "description": "The Reserve Bank of India is expected to keep its key interest rate at 5.50% on October 1 and for the rest of the year. The central bank is taking a cautious approach to gauge the impact of its past rate cuts on the economy. (Source: Reuters)",
            "pubDate": "2025-09-25T06:50:54.049846"
        },
        {
            "title": "India’s Rs 70,000 crore push for maritime dominance echoes on D-Street. Are shipbuilders next multibaggers?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-rs-70000-crore-push-for-maritime-dominance-echoes-on-d-street-are-shipbuilders-next-multibaggers/articleshow/124104649.cms",
            "description": "India's ambitious Rs 70,000 crore maritime push, including infrastructure status for large ships, aims to revolutionize shipbuilding. This initiative targets a significant increase in global market share, potentially generating 30 lakh jobs and attracting substantial investment.",
            "pubDate": "2025-09-25T06:50:54.049931"
        },
        {
            "title": "Japan’s Monetary Policy: Timing, Risks and Inflation Trends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-monetary-policy-timing-risks-and-inflation-trends/slideshow/124104564.cms",
            "description": "At the July meeting, the BOJ decided unanimously to keep borrowing costs steady. However, some members expressed support for resuming interest rate hikes in the future. Opinions on inflation were mixed: while some members felt it was still below the 2% target, others observed that inflation expectations were approaching or had already reached the target. (Source: Reuters)",
            "pubDate": "2025-09-25T06:50:54.050021"
        },
        {
            "title": "Sensex falls over 50 pts, Nifty below 25,050 as D-St extends losing streak to day 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-43-pts-nifty-above-25050-as-consumer-stocks-lift-d-st-mood/articleshow/124104328.cms",
            "description": "Indian equities traded flat on Thursday, recovering from early losses amid gains in consumption-focused stocks fueled by festive season expectations. Foreign outflows and U.S. visa restrictions created caution in the market. While broader markets showed positive movement, auto stocks declined due to concerns about Jaguar Land Rover's cyberattack impact.",
            "pubDate": "2025-09-25T06:50:54.050104"
        },
        {
            "title": "Chasing carmaker stocks? Here's the hidden $80 billion auto play that's quietly minting fortunes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chasing-carmaker-stocks-heres-the-hidden-80-billion-auto-play-thats-quietly-minting-fortunes/articleshow/124104436.cms",
            "description": "While car sales surge during Navratri due to GST cuts, the auto components industry emerges as a hidden investment gem. Companies supplying parts to major automakers are experiencing significant stock growth, outpacing the OEMs themselves. Factors like premiumization, EV transition, and government policies are fueling this growth, projecting the auto component market to reach $200 billion by 2030.",
            "pubDate": "2025-09-25T06:50:54.050188"
        },
        {
            "title": "Ashish Kacholia-backed smallcap stock soars 17% as board to mull bonus issue, stock split on Sept 27. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-smallcap-stock-soars-17-as-board-to-mull-bonus-issue-stock-split-on-sept-27-do-you-own/articleshow/124107386.cms",
            "description": "Fineotex Chemical shares surged 16.6% after the company announced a board meeting on September 27 to consider dividend declaration, stock split, and bonus shares. The agenda also includes raising authorised capital. Investor focus sharpened as ace investor Ashish Kacholia holds a 2.74% stake, amplifying market interest in corporate developments.",
            "pubDate": "2025-09-25T07:19:40.716717"
        },
        {
            "title": "NSE’s unlisted shares tumble 17% from May peak. Are late entrants paying the price?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nses-unlisted-shares-tumble-17-from-may-peak-are-late-entrants-paying-the-price/articleshow/124112032.cms",
            "description": "NSE’s unlisted shares have fallen 17% from their May peak amid Sebi scrutiny of weekly options and IPO speculation. The drop mirrors pressure on BSE and MCX, even as NSE prepares for its long-awaited listing and retains dominance in India’s equity market.",
            "pubDate": "2025-09-25T09:32:09.501119"
        },
        {
            "title": "NSE crosses 12 crore investors, women account for one in four",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-crosses-12-crore-investors-women-account-for-one-in-four/articleshow/124116156.cms",
            "description": "NSE’s investor base crossed 12 crore, with women representing one-fourth and nearly 40% under 30. Growth driven by streamlined KYC, financial literacy, and market buoyancy. SIP inflows, indirect participation, and investor education programs surged, while NSE-listed firms’ market cap reached Rs 460 lakh crore.",
            "pubDate": "2025-09-25T11:26:18.585347"
        },
        {
            "title": "Market Wrap: D-St extends losing run to 5th day, Sensex falls 556 points, Nifty slips below 24,900",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-st-extends-losing-run-to-5th-day-sensex-falls-556-points-nifty-slips-below-24900/articleshow/124114703.cms",
            "description": "Indian equities slid for a fifth straight session Thursday, with the Sensex and Nifty dragged lower by financial and IT shares as persistent foreign outflows and worries over U.S. visa curbs weighed on sentiment.",
            "pubDate": "2025-09-25T11:26:18.585477"
        },
        {
            "title": "Earnings Power: 11 High-Growth Small-caps stocks surge up to 105% in just 3 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-power-11-high-growth-small-caps-stocks-surge-up-to-105-in-just-3-months/slideshow/124114421.cms",
            "description": "In a striking turn of events, as many as 227 smallcap companies delivered a robust profit growth of over 50% in the June quarter compared to the same period last year. However, since the beginning of July, the BSE Smallcap index has declined by 1.68%. This modest drop in the broader index, however, conceals strong rallies in several individual stocks that have significantly outperformed.Nearly half of the high-growth pack managed to deliver positive returns, with about 78 of them clocking double-digit gains in less than three months. Among the star performers, 11 smallcap companies stood out, rewarding investors with staggering price gains ranging from 50% to as much as 105% between July and now. These companies with strong profit growth managed to defy market volatility, reaffirming the strength of select pockets within the smallcap segment. (Data Source: ACE Equity)",
            "pubDate": "2025-09-25T11:26:18.585606"
        },
        {
            "title": "10 IPOs close today. Check GMPs to not miss out on the buzzing ones",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-ipos-close-today-check-gmps-to-not-miss-out-on-the-buzzing-ones/slideshow/124113205.cms",
            "description": "As many as 10 IPOs that opened on Tuesday will close for subscription today. Investors who don’t want to miss out on the buzzing issues can check the GMPs to see where the money is flowing. Here’s how these IPOs are stacking up in the grey market:",
            "pubDate": "2025-09-25T11:26:18.585710"
        },
        {
            "title": "After Norges Bank stake purchase, Elara initiates a buy on CarTrade Tech, sees 50% upside post 160% 1-year rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-norges-bank-stake-purchase-elara-initiates-a-buy-on-cartrade-tech-sees-50-upside-post-160-1-year-rally/articleshow/124112734.cms",
            "description": "Elara Capital initiated coverage on CarTrade Tech with a Buy rating, targeting ₹3,590, implying 50% upside. The multibagger stock rallied 160% in a year, boosted by OLX India acquisition, asset-light model, and robust growth outlook.",
            "pubDate": "2025-09-25T11:26:18.585813"
        },
        {
            "title": "Jinkushal Industries IPO fully subscribed on day 1; Check GMP, other key details. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jinkushal-industries-ipo-fully-subscribed-on-day-1-check-gmp-other-key-details-should-you-invest/articleshow/124112652.cms",
            "description": "Jinkushal Industries’ Rs 116.15-crore IPO received strong investor response, fully subscribed on day one. The company, a leading non-OEM construction machinery exporter with international presence, plans to use proceeds for working capital. Retail investors led subscriptions, and the IPO carries a grey market premium of 17%, with long-term potential.",
            "pubDate": "2025-09-25T11:26:18.585915"
        },
        {
            "title": "Britannia, Nestle India to benefit most from GST2.0, says HSBC after upgrading stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/britannia-nestle-india-to-benefit-most-from-gst2-0-says-hsbc-after-upgrading-stocks/articleshow/124112535.cms",
            "description": "HSBC upgraded Britannia and Nestle to Hold from Reduce, citing GST cuts and better consumer sentiment. Both companies, with high exposure to impulse categories, are expected to see stronger EPS growth and improved valuation multiples.",
            "pubDate": "2025-09-25T11:26:18.586012"
        },
        {
            "title": "NSE unique investors base crosses 12 cr; 1 in 4 are women",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-unique-investors-base-crosses-12-cr-1-in-4-are-women/articleshow/124112523.cms",
            "description": "The unique investors' base on the National Stock Exchange of India (NSE) crossed the 12-crore mark on September 23, with the latest 1 crore addition taking place in just eight months, the bourse said on Thursday.",
            "pubDate": "2025-09-25T11:26:18.586106"
        },
        {
            "title": "HAL shares rise 2% as Ministry of Defence inks Rs 62,370 crore deal for 97 Tejas Mk-1A jets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-shares-rise-2-as-ministry-of-defence-inks-rs-62370-crore-deal-for-97-tejas-mk-1a-jets/articleshow/124117276.cms",
            "description": "Hindustan Aeronautics Limited (HAL) surged after securing a Rs 62,370 crore contract from the Ministry of Defence to supply 97 Tejas Mk-1A fighter jets, boosting indigenous defence manufacturing and strengthening the Indian Air Force’s fleet modernization plans.",
            "pubDate": "2025-09-25T11:58:55.968608"
        },
        {
            "title": "Stock Radar: Symmetrical Triangle formation on Graphite India makes it a good medium-term pick; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-symmetrical-triangle-formation-on-graphite-india-makes-it-a-good-medium-term-pick-check-target-stop-loss/articleshow/124086555.cms",
            "description": "Graphite India stock shows promising signs. Experts suggest a potential breakout. The stock might reach Rs 980 in 4–6 months. Technical analysis reveals a symmetrical triangle pattern. A breakout above Rs 650 could lead to higher levels. Tradebulls analyst recommends an accumulation strategy. Investors should consider a stop loss below Rs 480.",
            "pubDate": "2025-09-25T11:58:55.968735"
        },
        {
            "title": "US stocks open lower as investors reassess rate-cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-opens-lower-as-investors-reassess-rate-cut-hopes/articleshow/124120888.cms",
            "description": "Trading began on Wall Street with a dip in the main indexes on Thursday. Fresh economic data and a Federal Reserve official's comments influenced the market. The Dow Jones Industrial Average saw a slight decrease. The S&P 500 and Nasdaq Composite experienced more significant drops. Investors are reacting to the latest economic signals. Market watchers are keenly observing the situation.",
            "pubDate": "2025-09-25T13:58:58.111163"
        },
        {
            "title": "IT stocks continue to reel under pressure for 4th day on H-1B visa fee concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-continue-to-reel-under-pressure-for-4th-day-on-h-1b-visa-fee-concerns/articleshow/124118602.cms",
            "description": "IT stocks continued to slide for the fourth day in a row on Thursday as the staggering hike in US H-1B visa fees continues to hurt investor sentiment.",
            "pubDate": "2025-09-25T13:58:58.111288"
        },
        {
            "title": "Red Flags? DIIs reduce stakes in these 8 major stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/red-flags-diis-reduce-stakes-in-these-8-major-stocks/slideshow/124118245.cms",
            "description": "A decrease in DII (Domestic Institutional Investor) shareholding typically indicates that domestic investors are reducing their exposure to a particular stock. This could suggest a lack of confidence in the stock’s future performance, potential concerns about market conditions, or a shift in investment strategy. We have highlighted the top eight stocks in the Nifty500 with decreased DII shareholding in June '25 on a quarter-on-quarter basis, according to StockEdge's shareholding scan.",
            "pubDate": "2025-09-25T13:58:58.111418"
        },
        {
            "title": "TCS, United Breweries, and 5 other stocks hit 52-week lows; Slip up to 12% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-united-breweries-and-5-other-stocks-hit-52-week-lows-slip-up-to-12-in-a-month/slideshow/124117797.cms",
            "description": "On Thursday, the benchmark Sensex dropped sharply by around 555 points, closing at 81,159. Amid this broader market decline, seven stocks from the BSE 500 index sank to their fresh 52-week lows. A 52-week low represents the lowest price a stock has traded at over the past year. Many traders and investors consider this a key technical indicator when assessing a stock’s current valuation and anticipating potential price trends.",
            "pubDate": "2025-09-25T13:58:58.111525"
        },
        {
            "title": "Market Trading Guide: Buy RBL Bank, SAIL and 2 more stocks on Friday for up to 6% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-rbl-bank-sail-and-2-more-stocks-on-friday-for-up-to-6-gains/slideshow/124124045.cms",
            "description": "Indian benchmark indices ended in the red for the fifth day in a row amid selling pressure in auto, IT and financial stocks. Nifty slipped below 25,000 which is its 21 EMA on the daily timeframe, confirming increasing bearish sentiment.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said Nifty's fall below the crucial support level of 25,050, which also coincides with the 38.20% Fibonacci retracement of the previous rise from 24,400 to 25,450. “It appears that the bulls are stepping back, giving bears more control over the market. On the downside, immediate support is placed at 24,800; a break below this level could trigger a deeper and more serious correction. On the upside, resistance is seen at 25,000,\" De said.Here are 4 stock recommendations for Friday:",
            "pubDate": "2025-09-25T15:46:34.011526"
        },
        {
            "title": "Gainers & Losers: Hindustan Copper among 6 stocks that moved most on Thursday. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-hindustan-copper-urban-company-among-6-stocks-that-moved-most-on-thursday-heres-why/slideshow/124123544.cms",
            "description": "",
            "pubDate": "2025-09-25T15:46:34.011665"
        },
        {
            "title": "Infosys, Wipro  ADRs fall over 2% despite Accenture's upbeat FY25 revenue, EPS",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-adrs-fall-over-2-despite-accentures-upbeat-fy25-revenue-eps/articleshow/124122562.cms",
            "description": "Infosys and Wipro ADRs slipped after Accenture’s strong Q4 earnings beat estimates, with revenue rising 7% and AI-driven bookings boosting outlook. Despite robust growth, Accenture shares dipped 1.2%, sparking sentiment shifts across global IT stocks.",
            "pubDate": "2025-09-25T15:46:34.011777"
        },
        {
            "title": "971% multibagger Sigma Solve fined Rs 2 lakh by Sebi for misusing IPO Funds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/971-multibagger-sigma-solve-fined-rs-2-lakh-by-sebi-for-misusing-ipo-funds/articleshow/124124736.cms",
            "description": "Sebi has fined Sigma Solve Rs 2 lakh and its IPO merchant banker Beeline Broking Rs 1 lakh for misusing IPO proceeds. The smallcap, despite stellar returns, violated disclosure norms by exceeding limits on general corporate purpose allocation.",
            "pubDate": "2025-09-25T15:54:19.779101"
        },
        {
            "title": "Two Trades for Today: An integrated mining major for a 6.2% upmove, a large-cap exploration stock for almost 6% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-integrated-mining-major-for-a-6-2-upmove-a-large-cap-exploration-stock-for-almost-6-rise/articleshow/124124656.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-25T15:54:19.779222"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/124124957.cms",
            "description": "Indian markets fell for a fifth straight session Thursday as Sensex and Nifty declined nearly 0.7%. Selling in financials, IT, pharma, and healthcare, coupled with FII outflows and US trade concerns, kept sentiment weak despite gains in metals.",
            "pubDate": "2025-09-25T16:39:31.283272"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124124933.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-09-25T16:39:31.283381"
        },
        {
            "title": "These large- and mid-cap stocks can give more than 25% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-and-mid-cap-stocks-can-give-more-than-25-return-in-1-year-according-to-analysts/articleshow/124128692.cms",
            "description": "If you are surprised at the decline in the Nifty, don’t be. When IT stocks come under pressure, so does the Nifty. Why? Because they have a significant weightage in the index. IT stocks have been under pressure for four straight sessions. And there have been sessions when even the breadth in the mid-cap segment has not been too positive. But what we are witnessing appears to be profit-booking after three weeks of upward movement. Can this continue for more time? Surely yes. But then, investing is not about what will happen to the Nifty over the next week or a quarter. There are select stocks where the impact of GST would be positive and where new tailwinds have emerged.",
            "pubDate": "2025-09-25T18:23:08.456160"
        }
    ]
}