{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-17T17:53:18.816131",
    "items": [
        {
            "title": "National Insurance aims to boost solvency with RBC regime",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/national-insurance-aims-to-boost-solvency-with-rbc-regime/articleshow/114297495.cms",
            "description": "The state-owned insurer is grappling with a solvency shortfall of ₹8,000 crore, with its solvency margin dropping to negative 0.49%, far below the regulatory minimum of 1.5%.",
            "pubDate": "2024-10-17T00:55:12.721285"
        },
        {
            "title": "Jefferies cuts BSE rating on 'unfavourable' risk-reward",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-cuts-bse-rating-on-unfavourable-risk-reward/articleshow/114297481.cms",
            "description": "Jefferies said the recent run-up in BSE shares listed on the NSE was following the Securities and Exchange Board of India's new tighter regulations for equity futures and options.",
            "pubDate": "2024-10-17T00:55:12.721399"
        },
        {
            "title": "Market Trading Guide: Voltas, Ambuja Cements among 5 stock recommendations for Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-voltas-ambuja-cements-among-5-stock-recommendations-for-thursday/slideshow/114289779.cms",
            "description": "Indian headline indices struggled to gain momentum through the day after a sluggish start as weak global cues and the absence of new drivers weighed heavily on the markets. A broad-based sell-off led to declines across sectors, with IT, auto, and FMCG stocks being the biggest drag on the Nifty 50. At the closing time, the S&P BSE Sensex slipped by 318.76 points or 0.39% to settle at 81,501.36, while the Nifty dropped 86.00 points or 0.34% to finish at 24,971.30.Commenting on the day's action, expert Tejas Shah of JM Financial & BlinkX said that Nifty is showing indecisiveness at the current juncture. The 50-stock index formed a DOJI candle on its daily chart which indicates this indecisiveness and presently, Nifty is in 'No Man’s Land', Shah said. \"Broadly, Nifty is still trading in the range of 24,950 to 25,250 levels for the past few days and we need to wait and watch for either side breakout or breakdown for 250 to 300 points of directional move in Nifty. Support for Nifty is now seen at 24,950-25,000 and 24,700-750. On the higher side, immediate resistance for Nifty is at 25,100 levels and the next crucial resistance zone is at 25,250-300 levels,\" he added.Here are 5 stock recommendations for Thursday:",
            "pubDate": "2024-10-17T00:55:12.721502"
        },
        {
            "title": "Shorter settlement cycle for FPIs can lead to 'efficiency gains' of Rs 2,000 cr a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shorter-settlement-cycle-for-fpis-can-lead-to-efficiency-gains-of-rs-2000-cr-a-year/articleshow/114297418.cms",
            "description": "FPIs had raised concerns about delays in their access to sale proceeds beyond the standard T+1 settlement date. These delays were primarily due to the erstwhile process adopted for obtaining tax clearance on their net sale proceeds, to ensure compliance with FEMA Regulations.",
            "pubDate": "2024-10-17T00:55:12.721601"
        },
        {
            "title": "HDFC AMC's Q2 show fuels rally in MF stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amcs-q2-show-fuels-rally-in-mf-stocks/articleshow/114297407.cms",
            "description": "Aditya Birla Sun Life Asset Management Company surged 11.5% to end at ₹779, UTI AMC rose 7.6% to ₹1,326, HDFC AMC gained 5.8% to ₹4,833 and Nippon Life India AMC advanced 2% to ₹721.",
            "pubDate": "2024-10-17T00:55:12.721708"
        },
        {
            "title": "For Canadian funds, India's the goose laying golden nest eggs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-canadian-funds-indias-the-goose-laying-golden-nest-eggs/articleshow/114297327.cms",
            "description": "The Canada Pension Plan Investment Board (CPPIB), the largest Canadian investor in India, has been trimming its stakes in Indian stocks over the past year, while other funds Caisse de Depot et Placement du Quebec (CDPQ) and British Columbia Investment Management have kept their holdings in the country unchanged.",
            "pubDate": "2024-10-17T00:55:12.721814"
        },
        {
            "title": "Let market be volatile, you be tactical: 5 large-cap stocks from different sectors for tactical investing with an upside potential of up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/let-market-be-volatile-you-be-tactical-5-large-cap-stocks-from-different-sectors-for-tactical-investing-with-an-upside-potential-of-up-to-40/articleshow/114292199.cms",
            "description": "The markets, as we know, are in a volatile phase. But, given that the long-term trend is still bullish, how do you deal with the current situation if you have a surplus to invest? There are two options. One, sit out of the market and let this phase pass. Second, become a tactical investor. Rather than investing with an extremely long-term perspective, buy stocks for shorter terms with a clear focus on booking profits. For example, four weeks back, there was a tactical trade in metals. Now it is largely over. So, make a tactical trade, but only in select stocks. Even if for some reason you are not able to cash out in time, these would be good enough businesses to keep in your portfolio.",
            "pubDate": "2024-10-17T00:55:12.721912"
        },
        {
            "title": "Daily Trading Desk: 2 trades for short-term gains; specialty chemicals major and mid-cap engineering stock for almost 6% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/daily-trading-desk-2-trades-for-short-term-gains-specialty-chemicals-major-and-mid-cap-engineering-stock-for-almost-6-upmove/articleshow/114289588.cms",
            "description": "Select stocks gain momentum even in volatile markets.",
            "pubDate": "2024-10-17T00:55:12.722005"
        },
        {
            "title": "Stock Radar: Oberoi Realty stock up nearly 80% in a year; Should you buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-oberoi-realty-stock-up-nearly-80-in-a-year-should-you-buy-now/articleshow/114286517.cms",
            "description": "Oberoi Realty's stock has surged by nearly 80% in the past year, climbing from Rs 1,128 to Rs 2,028. This impressive rally follows a recent bounce back after the stock tested its 100-day moving average.  The upward momentum has propelled the stock past its 50-day moving average and through the neckline of a \"Cup & Handle\" pattern at Rs 1,950.",
            "pubDate": "2024-10-17T00:55:12.722095"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/114290846.cms",
            "description": "The Nifty and Sensex are correcting. A closer look, however, reveals that the correction is not as strong as it could have been. The correction has to be seen in the context that, at this time of the year, markets anyway tend to be more volatile. Yes, companies that are disappointing the street with their Q2 numbers are getting punished. But it is not leading to strong across-the-board weakness. At this point, there is a high probability that, given there are no global hiccups, this phase of correction will pass without major damage to individual stocks. ET Screener, powered by Refinitiv’s Stock Report Plus, lists quality stocks with high upside potential over the next 12 months, and having an average recommendation rating of “Buy” or \"Strong Buy\". This predefined screener is only available to ET Prime users.",
            "pubDate": "2024-10-17T00:55:12.722189"
        },
        {
            "title": "Payments Industry to touch $49 trillion by 2028: BCG",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-payments-industry-likely-to-grow-to-49-trillion-in-value-by-2028-bcg/articleshow/114297405.cms",
            "description": "The Indian payments industry is projected to grow to $49 trillion in value by 2028 from $30 trillion in 2023, with transaction volumes expected to increase to 434 billion. Revenue growth in this sector is forecasted at 11%, with credit cards and fund transfers leading the expansion.",
            "pubDate": "2024-10-17T00:55:12.722284"
        },
        {
            "title": "RIL fixes Oct 28 as record date for bonus issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-fixes-oct-28-as-record-date-for-bonus-issue/articleshow/114290106.cms",
            "description": "Shareholders who have RIL shares in their demat account before October 28, 2024 will be eligible for the bonus issue of shares.",
            "pubDate": "2024-10-17T00:55:12.722380"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-thursday/articleshow/114289923.cms",
            "description": "Indian indices declined for the second consecutive session on Wednesday, dragged by auto and IT stocks. Nifty 50 closed 0.34% lower at 24,971 points, and Sensex fell 0.39% to 81,501 points. Analysts predict a sideways trend with support at 24,900 and resistance at 25,200.",
            "pubDate": "2024-10-17T00:55:12.722476"
        },
        {
            "title": "Sebi mulls allowing Associations of Persons to open demat accounts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-mulls-allowing-associations-of-persons-to-open-demat-accounts/articleshow/114289859.cms",
            "description": "Markets regulator Sebi on Wednesday proposed allowing Associations of Persons (AOPs) to open demat accounts in their name to hold certain securities, excluding equity shares.",
            "pubDate": "2024-10-17T00:55:12.722564"
        },
        {
            "title": "New policy surrender rules, intense competition likely to affect HDFC Life’s H2 performance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-policy-surrender-rules-intense-competition-likely-to-affect-hdfc-lifes-h2-performance/articleshow/114289846.cms",
            "description": "The stock of HDFC Life recovered partially on Wednesday, gaining 1.9% after sliding by nearly 4% the previous day following the insurer’s second quarter result announcement. The stock reported weakness despite the double digit growth in premiums and improving market share.",
            "pubDate": "2024-10-17T00:55:12.722650"
        },
        {
            "title": "These 6 stocks hit 52-week highs, rallied up to 19% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-stocks-hit-52-week-highs-rallied-up-to-19-in-a-month/slideshow/114289591.cms",
            "description": "On Wednesday, India's benchmark index Sensex declined by about 319 points, closing at 81,501. Despite the market drop, six stocks from the BSE 200 index hit their 52-week highs. A 52-week high represents the highest price a stock has achieved in the past year, offering important insights for traders and investors. This benchmark helps assess a stock's current value and forecast its future potential.",
            "pubDate": "2024-10-17T00:55:12.722738"
        },
        {
            "title": "Adani Enterprises' QIP sees healthy demand, Rs 4,200 crore raised through issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-qip-sees-healthy-demand-raising-rs-4200-crore-through-the-issue/articleshow/114324969.cms",
            "description": "Adani Enterprises has raised nearly Rs 4200 crore through a qualified institutional placement. The QIP saw significant demand, with bids exceeding four times the deal size. The funds will be utilized for capital expenditure, debt repayment, and general corporate purposes. The company's focus spans airports, roads, new energy ecosystems, and data centers.",
            "pubDate": "2024-10-17T17:53:00.801341"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-friday/articleshow/114323492.cms",
            "description": "Indian indices fell for a third consecutive session, dragged by Bajaj Auto's weak festive sales warning and concerns over high valuations and foreign fund outflows. Sensex fell 495 points, and Nifty declined 221 points. Analyst Rupak De of LKP Securities said that the Nifty has found initial support in the 24,700–24,750 zone. A fall below 24,700 could lead to a significant correction in the market.",
            "pubDate": "2024-10-17T17:53:00.801481"
        },
        {
            "title": "These 6 stocks hit fresh 52-week highs, rallied up to 10% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-stocks-hit-fresh-52-week-highs-rallied-up-to-10-in-a-month/slideshow/114323064.cms",
            "description": "Indian headline indices fell for a third day in a row on Monday led by selling pressure in auto and bank stocks. Nifty briefly touched a two-month low during the day. Despite a late pullback, the 30-share S&P BSE Sensex fell by 0.61%, shedding 495 points to close at 81,006, while the broader NSE Nifty slipped by 0.89% or 221 points to finish at 24,749.8",
            "pubDate": "2024-10-17T17:53:00.801584"
        },
        {
            "title": "Market Trading Guide: Suven Pharma, CARE Ratings are stock recommendations for Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-suven-pharma-care-ratings-are-stock-recommendations-for-friday/slideshow/114322735.cms",
            "description": "Indian headline indices fell for a third day in a row on Monday led by selling pressure in auto and bank stocks. Nifty briefly touched a two-month low during the day. Despite a late pullback, the 30-share S&P BSE Sensex fell by 0.61%, shedding 495 points to close at 81,006, while the broader NSE Nifty slipped by 0.89% or 221 points to finish at 24,749.8.Commenting on the day's action, analyst Rupak De of LKP Securities said that he sees a likely downward move in the short term. \"The Nifty has found initial support in the 24,700–24,750 zone. On the daily chart, the Nifty has broken down from a bearish flag pattern, suggesting a possible downward move in the short term. The RSI is showing a bearish crossover and is declining,\" he said. He advised investors to be mindful of initiating short positions as the index has experienced a steep correction and is near a double-bottom support, which could trigger a near-term recovery toward 25,000. Conversely, a decisive fall below 24,700 could lead to a significant correction in the market, he warned.Here are 2 stock recommendations for Friday:",
            "pubDate": "2024-10-17T17:53:00.801683"
        },
        {
            "title": "Infosys, Wipro ADRs fall over 4% following Q2 earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-adrs-fall-over-4-following-q2-earnings-on-thursday/articleshow/114321311.cms",
            "description": "Infosys reported a 5% rise in Q2 net profit, reaching Rs 6,506 crore.  Driven by strong performance and mega-deals, the company raised its FY25 revenue growth guidance to 3.75%–4.5% from the previous 3-4%.",
            "pubDate": "2024-10-17T17:53:00.801785"
        },
        {
            "title": "Breakout Stocks: How to trade CAMS, Indigo Paints and Infosys on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-cams-indigo-paints-and-infosys-on-friday/slideshow/114320730.cms",
            "description": "Indian market closed in the red for the third day in a row on Thursday. The S&P BSE Sensex fell nearly 500 points while the Nifty50 closed below the 24,800 level.",
            "pubDate": "2024-10-17T17:53:00.801883"
        },
        {
            "title": "S&P 500, Dow hit fresh records on chip stock rally, upbeat retail sales data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-opens-at-record-high-on-retail-sales-data-chip-stocks-boost/articleshow/114320597.cms",
            "description": "Wall Street rose as the S&P 500 and Dow hit record highs, driven by surging chip stocks following TSMC’s robust forecast and strong retail sales. Despite gains, healthcare stocks declined, and analysts warned of stretched valuations and potential volatility ahead of the U.S. presidential election.",
            "pubDate": "2024-10-17T17:53:00.801977"
        },
        {
            "title": "Tech view: Nifty crucial support at 24,690, forms big red candle. How to trade tomorrow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-crucial-support-at-24690-forms-big-red-candle-how-to-trade-tomorrow/articleshow/114320368.cms",
            "description": "If Nifty stays below 24,690, it may fall further to 24,500–24,400 levels. On the upside, immediate resistance is at 25,000, with the 21-day Exponential Moving Average (21-DEMA) at 25,185, according to Hrishikesh Yedve of Asit C. Mehta Investment Intermediates.",
            "pubDate": "2024-10-17T17:53:00.802068"
        },
        {
            "title": "NSDL settles depository violation rule case with Sebi; pays Rs 3.12 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsdl-settles-depository-violation-rule-case-with-sebi-pays-rs-3-12-cr/articleshow/114319224.cms",
            "description": "The National Securities Depository Ltd (NSDL) on Thursday settled a case pertaining to alleged violation of depository rules with markets regulator Sebi after paying Rs 3.12 crore towards settlement amount.",
            "pubDate": "2024-10-17T17:53:00.802165"
        },
        {
            "title": "ECB cuts deposit rate by 25 bps to 3.25% as expected, says well on track to tame inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecb-cuts-deposit-rate-by-25-bps-to-3-25-as-expected-says-well-on-track-to-tame-inflation/articleshow/114318462.cms",
            "description": "The ECB cut its deposit rate by 25 basis points to 3.25%, citing sluggish economic growth and easing inflation. Policymakers express concern over high domestic inflation driven by wage increases and volatile energy costs. Further rate cuts are anticipated, though no commitments were made.",
            "pubDate": "2024-10-17T17:53:00.802258"
        },
        {
            "title": "LTIMindtree declares Rs 20/share interim dividend, sets October 25 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ltimindtree-declares-rs-20/share-interim-dividend-sets-october-25-as-record-date/articleshow/114318051.cms",
            "description": "LTIMindtree will give its shareholders a Rs 20 dividend for each share they own. To receive this payment, shareholders need to have their shares registered with the company by October 25th.",
            "pubDate": "2024-10-17T17:53:00.802351"
        },
        {
            "title": "Zomato board to consider fundraising via QIP on October 22",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zomato-board-to-consider-fundraising-plan-via-qip-mode-on-october-22/articleshow/114317714.cms",
            "description": "Zomato's board is scheduled to meet on October 22 to discuss raising funds through a qualified institutions placement (QIP) and to announce its September quarter earnings. The company previously reported a Rs 253 crore net profit for the April-June quarter, with significant revenue growth driven by Blinkit and Hyperpure.",
            "pubDate": "2024-10-17T17:53:00.802443"
        },
        {
            "title": "Infosys announces Rs 21/share interim dividend, fixes October 29 as record date. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-announces-rs-21-interim-dividend-fixes-october-29-as-record-date-check-details/articleshow/114314153.cms",
            "description": "Infosys declared an interim dividend of Rs 21 per share, with October 29 as the record date and November 8 as the payout date. The company reported a Q2 net profit of Rs 6,506 crore, a 5% YoY increase, and revised its FY25 revenue growth guidance to 3.75-4.5%.",
            "pubDate": "2024-10-17T17:53:00.802537"
        },
        {
            "title": "Sensex down 495 pts; Nifty settles below 24,800; banking, auto stocks drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-down-495-pts-nifty-settles-below-24800-banking-auto-stocks-drag/articleshow/114314362.cms",
            "description": "Indian equity indices fell for the third consecutive session, with the Nifty hitting a two-month low, and market capitalization dropping by Rs 6.03 lakh crore.",
            "pubDate": "2024-10-17T17:53:00.802630"
        },
        {
            "title": "Nikkei closes lower as chip stocks drag, investors focus on earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nikkei-closes-lower-as-chip-stocks-drag-investors-focus-on-earnings/articleshow/114312100.cms",
            "description": "Major technology stocks fell for a second session and dragged the Nikkei lower, after ASML's cut to annual sales forecast sparked concerns about demand, sending chip-related shares tumbling in the previous session.",
            "pubDate": "2024-10-17T17:53:00.802717"
        },
        {
            "title": "RBL Bank, IEX among 5 stocks with long unwinding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-iex-among-5-stocks-with-long-unwinding/slideshow/114312065.cms",
            "description": "Long unwinding refers to the selling of positions or stocks owned for a longer period either to book profit or to exit it in anticipation of impending bearishness. In Thursday's trading session, five stocks witnessed a long unwinding. Here's the list:",
            "pubDate": "2024-10-17T17:53:00.802807"
        }
    ]
}