{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-02T23:58:37.870784",
    "items": [
        {
            "title": "Samsung, SK Hynix shares leap after OpenAI chip deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-hit-record-as-chipmakers-surge-on-openai-deal/articleshow/124268756.cms",
            "description": "South Korean shares soared to a record high on Thursday, driven by a significant surge in chipmakers Samsung Electronics and SK Hynix. Both companies secured a major deal to supply memory chips for OpenAI's data centres, propelling the benchmark KOSPI over 3%.",
            "pubDate": "2025-10-02T04:22:19.012407"
        },
        {
            "title": "Japan's Nikkei rises after 4 days of losses as chip-related shares jump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-after-4-days-of-losses-as-chip-related-shares-jump/articleshow/124268732.cms",
            "description": "Japan's Nikkei share average posted a slight gain on Thursday, ending a four-session losing streak, primarily boosted by chip-related stocks tracking U.S. peers. However, the broader Topix index declined, with analysts suggesting the Nikkei's recovery might be brief due to cautious retail investors and overall negative market sentiment.",
            "pubDate": "2025-10-02T04:22:19.012540"
        },
        {
            "title": "Wall Street closes higher, boosted by healthcare as investors shrug off jobs data, US shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-higher-boosted-by-healthcare-as-investors-shrug-off-jobs-data-us-shutdown/articleshow/124268479.cms",
            "description": "Wall Street indexes closed higher Wednesday, primarily boosted by the healthcare sector following Pfizer's drug price agreement with President Trump. Investors largely overlooked weaker private payrolls data and the ongoing U.S. government shutdown, demonstrating historical market resilience. Technology stocks also contributed to gains, while the materials sector declined.",
            "pubDate": "2025-10-02T04:22:19.012655"
        },
        {
            "title": "Miners, gold stocks power Australian shares higher; Wall Street gains add lift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/miners-gold-stocks-power-australian-shares-higher-wall-street-gains-add-lift/articleshow/124268442.cms",
            "description": "Australian shares surged Thursday, driven by strong performances from miners and gold stocks, buoyed by positive Wall Street sentiment. The S&P/ASX 200 index climbed 0.7%, reaching 8,906.30 points. Miners advanced 1.9% on rising copper prices, while gold stocks hit a record high, up 2.5%, amid safe-haven demand. Banks and healthcare also contributed to the broad-based gains.",
            "pubDate": "2025-10-02T04:22:19.012762"
        },
        {
            "title": "Goldman Sachs' Rs 10,000 crore India portfolio: 4 stocks rally 50-155% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-rs-10000-crore-india-portfolio-4-stocks-rally-50-155-in-1-year/articleshow/124268424.cms",
            "description": "Goldman Sachs has secured significant gains, ranging from 50% to 155%, from its India portfolio companies over the past year. This impressive performance occurred despite Indian equities posting muted returns and facing FII selling. The global investment giant successfully identified high-performing stocks amidst market turbulence.",
            "pubDate": "2025-10-02T04:22:19.012877"
        },
        {
            "title": "Tech leads Asia share rally, gold near record high on Fed rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-leads-asia-share-rally-gold-near-record-high-on-fed-rate-cut-bets/articleshow/124268372.cms",
            "description": "Asian tech shares rallied Thursday. Gold reached a new record high. The dollar lost ground. A weak US labor report bolstered bets for Federal Reserve rate cuts. This market sentiment lifted indexes despite a US government shutdown. Oil prices also gained. Traders expect easier policy ahead, influencing global finance.",
            "pubDate": "2025-10-02T04:22:19.012982"
        },
        {
            "title": "FPIs continue selling equities in September, but at a slower pace",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-continue-selling-equities-in-september-but-at-a-slower-pace/articleshow/124268317.cms",
            "description": "Foreign portfolio investors continued as net sellers in Indian equities for September 2025, marking six out of nine months of outflows this year. A significant concern is their reduced primary market investment, totaling $5 billion despite heightened IPO activity. This contrasts sharply with last year's net purchases, though domestic funds provided strong support.",
            "pubDate": "2025-10-02T04:22:19.013085"
        },
        {
            "title": "Stock Market Holiday: Are BSE, NSE open or closed today for Dussehra and Gandhi Jayanti?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-are-bse-nse-open-or-closed-today-for-dussehra-and-gandhi-jayanti/articleshow/124262058.cms",
            "description": "Indian stock exchanges will remain shut on October 2 for Dussehra and Gandhi Jayanti, offering traders a break after recent volatility. The market has four more holidays this year, including a special afternoon Muhurat Trading session on October 21. Following a strong rebound, analysts anticipate sustained positive momentum for equities.",
            "pubDate": "2025-10-02T04:22:19.013211"
        },
        {
            "title": "Wealth creators from the past: Time to look at them again without bias? 5 large-caps, 4 with upside potential of up to 21%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-creators-from-the-past-time-to-look-at-them-again-without-bias-5-large-caps-4-with-upside-potential-of-up-to-21/articleshow/124271773.cms",
            "description": "However strong it may be, the fact is that every sector/company goes through a phase where it faces headwinds. And during such phases, the stocks tend to underperform even in a bull market. But companies with strong managements and some moat soon overcome challenges. Why? Because for a good business with able management, every headwind has a shelf life. Yes, investing in such stocks carry a slightly higher risk, and the capital invested in them may underperform. But once the valuation and business readjustment is over, the returns can be higher. So, these stocks are for investors who have the ability to take a logical risk with a defined capital exposed to them.",
            "pubDate": "2025-10-02T09:42:40.478666"
        },
        {
            "title": "Vedanta, Coal India among top 10 stocks in FY 25 with highest dividend yields",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-coal-india-among-top-10-stocks-in-fy-25-with-highest-dividend-yields/slideshow/124271767.cms",
            "description": "Dividends are a portion of a company’s profits that are distributed to its shareholders, typically on a quarterly or annual basis. These payouts are an important source of income for investors, especially those who prefer stable and recurring returns. Companies that consistently pay dividends are often viewed as financially sound and shareholder-friendly.This financial ratio measures how much a company returns to its shareholders in the form of dividends, relative to its current market price. Below are the top 10 dividend-yielding stocks in India for FY25, as compiled by SBI Securities. These companies have consistently paid dividends over the last three fiscal years — FY25, FY24, and FY23 — making them notable picks for income-focused investors:",
            "pubDate": "2025-10-02T09:42:40.478803"
        },
        {
            "title": "Only 9.5% of Indian households invest despite 63% market awareness: Sebi survey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/only-9-5-of-indian-households-invest-despite-63-market-awareness-sebi-survey/articleshow/124271135.cms",
            "description": "SEBI’s Investor Survey 2025, conducted with AMFI, NSE, BSE, NSDL, and CDSL, reveals a stark gap in India’s investment landscape. While 63% of households—around 213 million—are aware of at least one securities market product, only 9.5%, or about 32.1 million households, actively participate, highlighting the need for greater financial literacy, simpler investment platforms, and increased trust in markets.",
            "pubDate": "2025-10-02T09:42:40.478937"
        },
        {
            "title": "Dussehra 2025: 45 multibagger stocks deliver up to 11,400% returns in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dussehra-2025-45-multibagger-stocks-deliver-up-to-11400-returns-in-1-year/articleshow/124271013.cms",
            "description": "Between Dussehra 2024 and 2025, 45 Indian companies with market caps above Rs 1,000 crore delivered phenomenal multibagger returns, with the top 13 soaring up to 11,400%. RRP Semiconductor led the pack, followed by Elitecon International and Sumeet Industries. From agri to consumer stocks, investors who stayed invested turned lakhs into crores, highlighting pockets of explosive growth amid market caution.",
            "pubDate": "2025-10-02T09:42:40.479047"
        },
        {
            "title": "SEBI Investor survey 2025: 63% awareness, just 9.5% participation. Here are key findings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-investor-survey-2025-63-awareness-just-9-5-participation-here-are-key-findings/slideshow/124271110.cms",
            "description": "The SEBI Investor Survey 2025 is one of the largest household surveys on investor participation in India, conducted in association with AMFI, NSE, BSE, NSDL, and CDSL, and executed by Kantar. Covering over 90,000 households across 400 cities and 1,000 villages, it captures insights from investors, non-investors, lapsers, intenders, and intermediaries.The survey aims to assess awareness, penetration, barriers, motivators, and investor behavior in India’s securities market, offering a detailed snapshot of how households approach financial products and market participation.",
            "pubDate": "2025-10-02T09:42:40.479158"
        },
        {
            "title": "Biggest IPOs of 2025 coming: GMPs reveal investor favourites out of LG India, Tata Capital and WeWork",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biggest-ipos-of-2025-coming-gmps-reveal-investor-favourites-out-of-lg-india-tata-capital-and-wework/slideshow/124270908.cms",
            "description": "2025 has been a blockbuster year for the IPO market. October alone is lined up with some of the biggest issues of the year, featuring Tata Capital, LG India, and WeWork India. Grey Market Premiums (GMPs) give a peek into where investor sentiment is flowing.",
            "pubDate": "2025-10-02T09:42:40.479265"
        },
        {
            "title": "Market trading guide: Buy Hindustan Zinc, Fortis Health and 2 more stocks for up to 9% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-hindustan-zinc-fortis-health-and-2-more-stocks-for-up-to-9-gains/slideshow/124272959.cms",
            "description": "India’s benchmark indices, the Nifty and Sensex, ended their eight-day losing streak, led by private banks, auto, and IT stocks. The broader Nifty closed Wednesday’s session with a strong bullish candlestick following the RBI policy outcome and auto sales data.Commenting on the day’s action, Vatsal Bhuva, Technical Analyst at LKP Securities, said the Nifty reclaimed levels above its 100-day EMA at 24,750, which had previously acted as resistance. “The index has also retraced 61% of the Fibonacci move between the September 1 low and September 18 high at 25,453. On the derivative front, heavy put writing at 24,700–24,800 suggests a higher base, with maximum OI at 25,000. Overall, sentiment has turned positive, with support at 24,700 and resistance at 25,000–25,100,” Bhuva added.",
            "pubDate": "2025-10-02T10:59:05.113667"
        },
        {
            "title": "Axis Securities gives Nifty target of 25,500, names Bharti Airtel and Lupin among top 15 picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-gives-nifty-target-of-25500-names-bharti-airtel-and-lupin-among-top-15-picks/articleshow/124272808.cms",
            "description": "Axis Securities’ small-cap top picks include Mahanagar Gas, Kirloskar Brothers, Sansera Engineering, and Kalpataru Projects. The brokerage noted September’s market volatility after a strong May–August 2025 rally. Despite GST 2.0 reforms providing a positive trigger, momentum faltered due to delayed impact, currency depreciation, inventory overhang, foreign institutional selling, and uncertainty in global policy, especially from the US.",
            "pubDate": "2025-10-02T10:59:05.113803"
        },
        {
            "title": "Zerodha co-founder Nithin Kamath welcomes RBI’s move to raise share-backed loan limit to Rs 1 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-co-founder-nithin-kamath-welcomes-rbis-move-to-raise-share-backed-loan-limit-to-rs-1-crore/articleshow/124273735.cms",
            "description": "Zerodha CEO Nithin Kamath welcomed the RBI's decision to raise the loan against shares (LAS) limit from Rs 20 lakh to Rs 1 crore. He believes this 'good change' will popularize LAS, as many investors currently opt for high-interest personal loans or credit cards due to low awareness.",
            "pubDate": "2025-10-02T12:41:34.602246"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-friday/articleshow/124275258.cms",
            "description": "Indian stock markets ended an eight-day losing streak. Nifty and Sensex gained points, driven by private banks, auto, and IT stocks. Bajaj Broking noted a potential short-term bottom reversal. US and European markets also reached record highs on Thursday. Analysts offered support and resistance levels for the coming week. Markets remain closed for holidays.",
            "pubDate": "2025-10-02T14:21:37.851214"
        },
        {
            "title": "S&P 500, Nasdaq open at record highs as rate-cut bets offset shutdown fears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-open-at-record-highs-as-rate-cut-bets-offset-shutdown-fears/articleshow/124275056.cms",
            "description": "The S&P 500 and Nasdaq indexes opened at record highs on Thursday, fueled by renewed expectations for interest rate cuts. The Dow Jones also posted a modest gain at the open. Traders are now bracing for a data-light end to the week with few fresh catalysts, following these significant market movements.",
            "pubDate": "2025-10-02T14:21:37.851339"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124274947.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-10-02T14:21:37.851552"
        },
        {
            "title": "Two Trades for Today: A private sector banking major for a 4.6% upmove, a large-cap NBFC stock for almost 6% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-private-sector-banking-major-for-a-4-6-upmove-a-large-cap-nbfc-stock-for-almost-6-rise/articleshow/124275688.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-02T15:41:46.217860"
        },
        {
            "title": "These large- and mid-cap stocks can give more than 25% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-and-mid-cap-stocks-can-give-more-than-25-return-in-1-year-according-to-analysts/articleshow/124277794.cms",
            "description": "On the face of it, the RBI’s job is to decide on monetary policy. But the fact is that, as a banking regulator, it has the ability to direct resources to areas it feels require attention. What it did on Wednesday will have far-reaching effects on the economy – which is why the stock market reacted the way it did. The fact that banks have been allowed to finance M&As suggests a confidence that the Indian banking system has reached a stage where it can handle the risk of backing an entrepreneur’s assumptions about a merger or an acquisition. The grounds are probably being laid for a much more confident India.",
            "pubDate": "2025-10-02T18:39:08.731256"
        },
        {
            "title": "Stock Radar: Tata Motors stock showing signs of bottoming out after falling 30% from highs; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-tata-motors-stock-showing-signs-of-bottoming-out-after-falling-30-from-highs-time-to-buy/articleshow/124256020.cms",
            "description": "Tata Motors recently found support at the lower band of a Symmetrical Triangle pattern on daily charts, signaling a potential technical bounce back. Experts suggest short-term traders consider buying the stock for a target of Rs 710, with a strict stop-loss at Rs 650, despite a recent 30% fall.",
            "pubDate": "2025-10-02T23:58:37.266176"
        }
    ]
}