{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-31T09:32:14.305625",
    "items": [
        {
            "title": "Apple delivers strong quarter despite trade war challenges and ongoing artificial technology issues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apple-delivers-strong-quarter-despite-trade-war-challenges-and-ongoing-artificial-technology-issues/articleshow/124979671.cms",
            "description": "Apple announced strong financial results for its summer quarter.  iPhone 17 sales exceeded expectations, boosting revenue and profit.  Despite trade war tariffs, Apple maintained pricing.  The company's performance surpassed analyst forecasts.  Apple shares saw a significant surge following the announcement.  CEO Tim Cook expressed optimism for continued iPhone sales, especially during the holiday season.",
            "pubDate": "2025-10-31T03:56:31.283148"
        },
        {
            "title": "Mphasis Q2 Results: Net profit up 11% YoY to Rs 469 crore; revenue rises to Rs 3,902 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mphasis-q2-results-net-profit-up-11-yoy-to-rs-469-crore-revenue-rises-to-rs-3902-crore/articleshow/124986190.cms",
            "description": "Mphasis reported a 10.79% increase in net profit to Rs 469 crore for the July-September quarter, with revenue rising 10.34% to Rs 3,901.91 crore. The company's CEO highlighted strong total contract value wins of USD 528 million, driven by early investments in AI and a focus on new-gen services.",
            "pubDate": "2025-10-31T07:30:29.775378"
        },
        {
            "title": "Aditya Birla Capital Q2 Results: Profit rises 3% YoY to Rs 855 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/aditya-birla-capital-q2-results-profit-rises-3-yoy-to-rs-855-crore/articleshow/124984187.cms",
            "description": "In an impressive quarterly report, Aditya Birla Capital revealed a net profit surge for Q2 of FY26, reaching Rs 855 crore, up from Rs 834 crore year-on-year. This promising uptick in total income and a 10% increase in assets under management highlight the company's robust financial trajectory.",
            "pubDate": "2025-10-31T07:30:29.775515"
        },
        {
            "title": "Vedanta Q2 Results: Cons profit plunges 59% YoY to Rs 1,798 crore; revenue rises 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-q2-results-cons-profit-plunges-59-yoy-to-rs-1798-crore-revenue-rises-6/articleshow/124990157.cms",
            "description": "Vedanta Q2 Results: ​​The profit after tax (PAT) is attributable to the owners of the company. The company’s total revenue from operations for the quarter stood at Rs 39,868 crore, up 5.9% from Rs 37,634 crore in the corresponding period last year.",
            "pubDate": "2025-10-31T09:32:11.934739"
        },
        {
            "title": "Maruti Suzuki India Q2 Results: Cons PAT rises 8% YoY to Rs 3,349 crore; revenue jumps 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-india-q2-results-cons-pat-rises-8-yoy-to-rs-3349-crore-revenue-jumps-13/articleshow/124989679.cms",
            "description": "Maruti Suzuki Q2 Results: The company’s revenue from operations grew 13% YoY to Rs 42,344.20 crore, up from Rs 37,449.20 crore in the corresponding period of the previous financial year.",
            "pubDate": "2025-10-31T09:32:11.934867"
        },
        {
            "title": "Bharat Electronics Q2 Results: Standalone PAT up 18% YoY to Rs 1,286 crore, revenue rises 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bharat-electronics-q2-results-standalone-pat-up-18-yoy-to-rs-1286-crore-revenue-rises-26/articleshow/124989390.cms",
            "description": "Bharat Electronics Q2 Results: The company posted an 18% YoY rise in Q2 FY26 net profit to ₹1,286 crore, driven by strong operational performance. Revenue surged 26% to ₹5,764 crore, while profit before tax rose nearly 20% to ₹1,734 crore.",
            "pubDate": "2025-10-31T09:32:11.934977"
        }
    ]
}