{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-21T14:51:44.985594",
    "items": [
        {
            "title": "Unlisted NSE shares to become freely transferable as exchange eases approval process",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unlisted-nse-shares-to-become-freely-transferable-as-exchange-eases-approval-process/articleshow/119306994.cms",
            "description": "NSE shares will become easily transferable via the delivery instruction slip (DIS) mechanism from March 24, reducing transfer timelines from six months to just 3-5 days. The move eliminates manual KYC and verification, streamlining transactions in the high-demand unlisted market.",
            "pubDate": "2025-03-21T14:51:30.011115"
        },
        {
            "title": "US stocks open lower on tariff woes; FedEx falls on bleak forecast",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-on-tariff-woes-fedex-falls-on-bleak-forecast/articleshow/119306271.cms",
            "description": "Wall Street opened lower on Friday as investors continued to navigate the complex landscape of tariffs, with FedEx becoming the latest firm to adjust its annual projections due to economic uncertainties.",
            "pubDate": "2025-03-21T14:51:30.011242"
        },
        {
            "title": "9 Nifty microcaps that doubled in FY25 still show potential for further gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-nifty-microcaps-that-doubled-in-fy25-still-show-potential-for-further-gains/slideshow/119296834.cms",
            "description": "In FY25, the Nifty50 benchmark index has returned about 4%, while the Nifty Microcap 250 index has gained 10%. Notably, 34 Nifty microcap stocks have surged over 50%, with 9 stocks showing impressive gains of 100-450% (Data Source: ACE Equity).These 9 stocks not only delivered strong returns but also demonstrated solid fundamentals in a SWOT analysis, with their strengths far outweighing weaknesses, according to Trendlyne data.",
            "pubDate": "2025-03-21T14:51:30.011355"
        },
        {
            "title": "Two Sharp with ET: Is India giving up on PLI? Why Birla, Adani & JSW are racing into Copper",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-is-india-giving-up-on-pli-why-birla-adani-jsw-are-racing-into-copper/videoshow/119305948.cms",
            "description": "In this episode of Two Sharp with ET, Nisha Poddar dives into two major developments that could redefine India’s industrial strategy.First, is India quietly shelving its biggest manufacturing reform? According to a Reuters report, the Modi government is letting its $23 billion Production-Linked Incentive (PLI) scheme wind down—just four years after launch. The plan, meant to boost domestic production and reduce reliance on China, is not being extended, and companies that missed targets won’t get deadline relaxations. Second, copper is emerging as the new industrial battleground. As former U.S. President Donald Trump threatens tariffs on copper imports, global prices have surged past $10,000 a ton. Indian conglomerates are responding fast. These moves come as India struggles with a copper shortfall that’s vital for EVs, electronics, and clean energy infrastructure.",
            "pubDate": "2025-03-21T14:51:30.011459"
        },
        {
            "title": "India's Shapoorji Pallonji draws strong interest for debt sale: Reports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-shapoorji-pallonji-draws-strong-interest-for-debt-sale-reports/articleshow/119305743.cms",
            "description": "India's Shapoorji Pallonji Group has secured investor commitments of more than $4 billion for its debt sale in April, surpassing its funding target, two sources familiar with the matter said on Friday.",
            "pubDate": "2025-03-21T14:51:30.011562"
        },
        {
            "title": "NSE launches dedicated website for municipal bonds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-launches-dedicated-website-for-municipal-bonds/articleshow/119305687.cms",
            "description": "The National Stock Exchange (NSE) on Friday announced the launch of a dedicated website for municipal bonds in a bid to enhance the credibility and visibility of such bond markets in the country.",
            "pubDate": "2025-03-21T14:51:30.011661"
        },
        {
            "title": "BYD’s charm? At $1.2 billion, FII flow into China largest in last 5 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/byds-charm-at-1-2-billion-fii-flow-into-china-largest-in-last-5-months/articleshow/119302997.cms",
            "description": "China stocks:Foreign investors pumped $1.2 billion into Chinese equities this week, the largest inflow since October 2024. The surge was driven by rallies in EV giant BYD and Chinese AI firms, boosting confidence in China’s market rebound and attracting global fund managers.",
            "pubDate": "2025-03-21T14:51:30.011773"
        },
        {
            "title": "Zerodha means zero barriers and not zero brokerage: Nithin Kamath",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-means-zero-barriers-and-not-zero-brokerage-nithin-kamath/articleshow/119302608.cms",
            "description": "Zerodha:Zerodha founder Nithin Kamath claims that clients have saved ₹2,000-₹20,000 crore in brokerage fees over 10 years due to zero charges on equity delivery. He highlights how brokerage costs impact overall returns and emphasizes cost-conscious investing for better profitability.",
            "pubDate": "2025-03-21T14:51:30.011868"
        },
        {
            "title": "Sebi proposes relaxing rules for stock brokers to operate from GIFT city, may end NOC requirement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-relaxing-rules-for-stock-brokers-to-operate-from-gift-city-may-end-noc-requirement/articleshow/119301268.cms",
            "description": "Sebi:Sebi proposes removing the requirement for stock brokers to obtain a no-objection certificate (NOC) to operate in GIFT-IFSC under a Separate Business Unit (SBU). Regulatory oversight, risk management, and investor grievance redressal will fall under the respective authority’s jurisdiction.",
            "pubDate": "2025-03-21T14:51:30.011963"
        },
        {
            "title": "Bain Capital floats Rs 5,764 cr open offer to pick additional 26% in Manappuram Finance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bain-capital-floats-rs-5764-cr-open-offer-to-pick-additional-26-in-manappuram-finance/articleshow/119298849.cms",
            "description": "US-based private investment firm Bain Capital has launched Rs 5,764 crore open offer to acquire an additional 26 per cent stake in gold loan financier Manappuram Finance.",
            "pubDate": "2025-03-21T14:51:30.012061"
        },
        {
            "title": "Istanbul bourse trading halted for second time, main index down 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/istanbul-bourse-trading-halted-for-second-time-main-index-down-7/articleshow/119297153.cms",
            "description": "Trading on the Istanbul bourse was halted twice on Friday following heavy declines caused by the detention of Istanbul Mayor Ekrem Imamoglu, which led to nationwide protests. The benchmark BIST-100 index fell by 7.01%, while the central bank's policies to limit market volatility impacted the banking sector's stocks and costs.",
            "pubDate": "2025-03-21T14:51:30.012159"
        },
        {
            "title": "What to do with stocks of BSE, CDSL & others that live and breathe the stock market? Is the best behind them?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-to-do-with-stocks-of-bse-cdsl-others-that-live-and-breathe-the-stock-market-is-the-best-behind-them/articleshow/119295912.cms",
            "description": "Every bull run has a sector that stands out. Towards the end of the last bull run, a set of stocks that did extremely well were those related to the capital markets. From the stock exchange to the depositary to asset management companies… all did well. Even after all the mayhem of the past six months, on a one-year trailing returns basis these stocks are still in the green. But now a narrative has emerged that, because F&O segment volumes have dipped after the implementation of new rules in November 2024, these stocks are not as attractive. With stocks like BSE Limited seeing a sharp decline, the narrative has gathered strength. So, the question is: Should you sell, buy, or hold these stocks? The answer is different for each of them.",
            "pubDate": "2025-03-21T14:51:30.012253"
        },
        {
            "title": "Travel stocks drag European shares lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/travel-stocks-drag-european-shares-lower/articleshow/119296270.cms",
            "description": "European shares fell on Friday, led by travel stocks after a fire at Heathrow Airport, while investors continue to assess the effects of brewing trade tensions.",
            "pubDate": "2025-03-21T14:51:30.012344"
        },
        {
            "title": "Bajaj Finance, Chambal Fertilisers among 5 stocks that hit 52-week highs on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-chambal-fertilisers-among-5-stocks-that-hit-52-week-highs-on-friday/slideshow/119295876.cms",
            "description": "Indian equity indices rose on Friday, rebounding from a subdued start, buoyed by attractive valuations in large-cap stocks and renewed optimism over signs of easing foreign selling. Meanwhile, five stocks from the Nifty 500 index hit fresh 52-week highs and lows. Here's the list:",
            "pubDate": "2025-03-21T14:51:30.012438"
        },
        {
            "title": "L&T shares rise 2% after winning orders worth up to Rs 5,000 crore from Brigade Group",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lt-shares-rise-2-after-winning-orders-worth-up-to-rs-5000-crore-from-brigade-group/articleshow/119294318.cms",
            "description": "Shares of engineering and infrastructure conglomerate Larsen & Toubro (L&T) climbed as much as 2.4% on Friday to Rs 3,430 on the BSE after the company announced it had secured “large” orders from the Brigade Group for residential and commercial projects in Hyderabad and Chennai.",
            "pubDate": "2025-03-21T14:51:30.012528"
        }
    ]
}