{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-15T13:54:20.824324",
    "items": [
        {
            "title": "MCX India, IREDA and 4 other F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-india-ireda-and-4-other-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124566825.cms",
            "description": "As of October 14, there was a notable surge in futures open interest for six stocks in the NSE F&O segment, contributing to a total increase of over 6% compared with the previous trade. A significant uptick in futures open interest indicates substantial growth in the number of active, unexpired futures contracts for a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions in the futures market.",
            "pubDate": "2025-10-15T03:53:20.549976"
        },
        {
            "title": "IREDA, Tech Mahindra among 8 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ireda-tech-mahindra-among-8-stocks-showing-bullish-rsi-upswing/slideshow/124566764.cms",
            "description": "On October 14, eight stocks from the Nifty500 that gained over 1% were highlighted in the “RSI Trending Up” scan, based on data from StockEdge.com. An uptrend signal occurs when the Relative Strength Index (RSI) crosses above 50 from below. “RSI Trending Up” indicates rising RSI values, suggesting strengthening momentum in a stock’s price. This can signal potential upward movement and is often used by traders to identify buying opportunities.",
            "pubDate": "2025-10-15T03:53:20.550104"
        },
        {
            "title": "Tech Mahindra shares in focus as Q2 PAT falls 4% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-shares-in-focus-as-q2-pat-falls-4-yoy-should-you-buy-sell-or-hold/articleshow/124566210.cms",
            "description": "Tech Mahindra's Q2FY26 results are out. Net profit dipped year-on-year, but revenue saw an increase. Earnings Before Interest and Taxes showed strong growth. Brokerage firms have shared their views. Goldman Sachs, Morgan Stanley, and Nuvama have issued ratings and target price adjustments. Investors are reacting to these financial figures and expert opinions.",
            "pubDate": "2025-10-15T03:53:20.550220"
        },
        {
            "title": "Negative Breakout: These 10 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-cross-below-their-200-dmas/slideshow/124566162.cms",
            "description": "In the Nifty500 pack, 10 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on October 14, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-10-15T03:53:20.550326"
        },
        {
            "title": "Thyrocare, ICICI Lombard, 2 others declare interim dividends — are you in the list? Check record dates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thyrocare-icici-lombard-2-others-declare-interim-dividends-are-you-in-the-list-check-record-dates/slideshow/124565946.cms",
            "description": "Four BSE listed companies announced interim dividends for the financial year 2025-26 along with their Q2 earnings on Tuesday after market hours. These companies are Thyrocare, Tech Mahindra, Rama Phosphtes and ICICI Lombard General Insurance Company. Check dividend and record dates.",
            "pubDate": "2025-10-15T03:53:20.550430"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Zaggle, JustDial among 5 stocks that could give 15-47% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-zaggle-justdial-among-5-stocks-that-could-give-15-47-return/slideshow/124565833.cms",
            "description": "Brokerages have turned upbeat on select stocks across sectors, signaling strong growth potential and attractive valuations for the next 12 months.",
            "pubDate": "2025-10-15T03:53:20.550532"
        },
        {
            "title": "Wall Street ends mixed; banks rally on upbeat results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-mixed-banks-rally-on-upbeat-results/articleshow/124565601.cms",
            "description": "In a day of fluctuating sentiment, Indian stock markets responded to a blend of global influences. The robust earnings from US banks uplifted investor optimism, yet lingering trade disputes between the US and China loomed large over the scene. Additionally, statements from Federal Reserve Chair Jerome Powell regarding the economic outlook are adding layers of complexity to trading strategies.",
            "pubDate": "2025-10-15T03:53:20.550648"
        },
        {
            "title": "Asian stocks gain as rate-cut bets outweigh trade angst",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-gain-as-rate-cut-bets-outweigh-trade-angst/articleshow/124565260.cms",
            "description": "Asian stocks rebounded as Fed Chair Powell's comments reinforced expectations for an October rate cut, boosting sentiment despite renewed US-China trade tensions. While contracts for the S&P 500 remained little changed, gold traded near its peak, and crude oil hovered near a five-month low.",
            "pubDate": "2025-10-15T03:53:20.550746"
        },
        {
            "title": "ICICI Prudential plans to raise Rs 1,200 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-plans-to-raise-rs-1200-crore/articleshow/124565232.cms",
            "description": "ICICI Prudential Life Insurance plans to raise ₹1,200 crore via subordinated debt, exercising a call option on an existing issue due in November 2025. The insurer's solvency ratio, currently 213.2%, will remain comfortably above the regulatory 150% threshold even after this move.",
            "pubDate": "2025-10-15T03:53:20.550843"
        },
        {
            "title": "Stocks in news: Tech Mahindra, Axis Bank, Ola Electric, ICICI Lombard, Vedanta",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tech-mahindra-axis-bank-ola-electric-icici-lombard-vedanta/articleshow/124557127.cms",
            "description": "Markets closed marginally lower on Tuesday due to trade concerns, with Nifty approaching key support. Tech Mahindra reported better-than-expected Q2 revenue, while Ola Electric is poised to enter the energy storage market. Several other companies like Axis Bank and ICICI Lombard will announce Q2 results today.",
            "pubDate": "2025-10-15T03:53:20.550942"
        },
        {
            "title": "GIFT Nifty up 90 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124557180.cms",
            "description": "Indian equities declined on Tuesday, influenced by weak global markets and foreign fund outflows. Optimism surrounding India-US trade talks resurfaced as both nations prepare for discussions this week. Analysts anticipate a range-bound market, with global trends, FII flows, and Q2FY26 earnings shaping the near-term direction.",
            "pubDate": "2025-10-15T03:53:20.551037"
        },
        {
            "title": "LG eyes India's software strength for chips, AI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-eyes-indias-software-strength-for-chips-ai/articleshow/124565209.cms",
            "description": "LG Electronics is set to tap into India's software talent for its semiconductor, robotics, and AI product development. The company also aims to boost exports of components from India. This strategic move capitalizes on India's growing capabilities and cost-effectiveness. LG Electronics sees India as a key partner for innovation and global market expansion.",
            "pubDate": "2025-10-15T03:53:20.551135"
        },
        {
            "title": "Mistaken Identity: LG Balakrishnan shares surge as investors confuse it for LG Electronics India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mistaken-identity-lg-balakrishnan-shares-surge-as-investors-confuse-it-for-lg-electronics-india/articleshow/124565014.cms",
            "description": "Investors rushed to buy LG Electronics India shares on its stock market debut. Some mistakenly purchased shares of LG Balakrishnan and Bros, a different company. This led to a surge in LG Balakrishnan's stock price. The error was later realized, and the stock price reversed. Similar mix-ups have happened before in the market.",
            "pubDate": "2025-10-15T03:53:20.551232"
        },
        {
            "title": "Indian markets decline amid US-China tensions, precious metals hit all-time high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-markets-decline-amid-us-china-tensions-precious-metals-hit-all-time-high/articleshow/124564990.cms",
            "description": "Indian stock indices fell for a second day as global investor unease over US-China tensions weakened risk appetite. Gold prices hit a new all-time high, attracting funds from equities. Analysts anticipate a positive setup for Nifty and expect outperformance from Bank Nifty, with buying interest seen in banking and financial stocks.",
            "pubDate": "2025-10-15T03:53:20.551324"
        },
        {
            "title": "IMF raises India’s FY26 growth outlook to 6.6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-raises-indias-fy26-growth-outlook-to-6-6/articleshow/124565206.cms",
            "description": "The International Monetary Fund has increased India's economic growth forecast for the fiscal year 2026 to 6.6 percent. This positive outlook comes despite recent US tariffs on Indian goods. India is projected to achieve the highest growth rate among advanced economies, emerging markets, and developing countries for the current and next fiscal years.",
            "pubDate": "2025-10-15T03:53:20.551414"
        },
        {
            "title": "LG Electronics India soars 50% on debut, outshines Korean parent in market value",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-electronics-india-soars-50-on-debut-outshines-korean-parent-in-market-value/articleshow/124564953.cms",
            "description": "LG Electronics India debuted on Indian bourses with a 50% premium, surpassing its Korean parent in market value. Analysts suggest booking profits on listing gains, with potential re-entry opportunities after Q2 results, especially on dips towards ₹1,600-1,630.",
            "pubDate": "2025-10-15T03:53:20.551507"
        },
        {
            "title": "Kolte-Patil shares in focus as Q2 sales rise 9% QoQ to Rs 670 crore, acquires land for Rs 1,400 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kolte-patil-shares-in-focus-as-q2-sales-rise-9-qoq-to-rs-670-crore-acquires-land-for-rs-1400-crore/articleshow/124567160.cms",
            "description": "Kolte-Patil shares: The company reported Q2FY26 sales of ₹670 crore, up 9% sequentially but down 13% year-on-year, supported by steady demand across projects. Sales volume grew 2% QoQ to 0.86 million sq. ft., with its flagship township, Life Republic, contributing 0.51 million sq. ft.",
            "pubDate": "2025-10-15T04:10:52.538376"
        },
        {
            "title": "Sensex climbs over 300 pts, Nifty tops 25,250 as Fed rate cut hopes lift market sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-climbs-over-300-pts-nifty-tops-25250-as-fed-rate-cut-hopes-lift-market-sentiment/articleshow/124567055.cms",
            "description": "Indian stocks rebounded on Wednesday, ending a two-day decline as the Sensex and Nifty mirrored gains in Asian markets. Positive sentiment was fueled by increased expectations of a U.S. Federal Reserve rate cut and easing domestic retail inflation, suggesting a potential policy easing by the Reserve Bank of India in December.",
            "pubDate": "2025-10-15T04:10:52.538509"
        },
        {
            "title": "MCX India, BGR Energy and 2 other stocks that witnessed 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-india-bgr-energy-and-2-other-stocks-that-witnessed-5-year-swing-high-breakout/slideshow/124567076.cms",
            "description": "In the NSE list of stocks with a market capitalization over Rs 1,000 crore, four stocks witnessed a 5-year swing high at the close on October 14, indicating bullishness in these counters, according to Stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-10-15T04:10:52.538621"
        },
        {
            "title": "ICICI Lombard General Insurance shares zoom 6% after Q2 profit rises 18% YoY. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-lombard-general-insurance-shares-in-focus-after-q2-profit-rises-18-yoy-should-you-invest/articleshow/124567117.cms",
            "description": "ICICI Lombard reported an 18% YoY rise in Q2 FY26 net profit to Rs 819 crore, despite a 1.9% decline in gross direct premium income to Rs 6,596 crore. The combined ratio was 105.1% (103.8% ex-CAT), solvency remained strong at 2.73x, and the board declared an interim dividend of Rs 6.5 per share. Brokerages maintain a positive outlook with Buy/Neutral ratings.",
            "pubDate": "2025-10-15T04:10:52.538728"
        },
        {
            "title": "Buy, Sell or Hold: Nomura maintains neutral on Persistent Systems; Citi sees over 40% upside in ICICI Prudential Life",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nomura-maintains-neutral-on-persistent-systems-citi-sees-over-40-upside-in-icici-prudential-life/articleshow/124567040.cms",
            "description": "Brokerages are actively tracking mid-cap and financial companies. Nomura maintains a neutral stance on Persistent Systems. Citi sees strong upside for ICICI Prudential Life Insurance. Motilal Oswal reiterates a buy call on Cyient DLM. These firms focus on execution, margins, and growth for the upcoming quarters.",
            "pubDate": "2025-10-15T04:10:52.538834"
        },
        {
            "title": "Tata Motors demerger: CV arm awaits debut; listing date, price and what's next for 67 lakh shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-demerger-complete-cv-arm-valued-at-rs-260-per-share-awaits-listing-whats-next-for-67-lakh-shareholders/articleshow/124567036.cms",
            "description": "Following Tata Motors’ recent demerger, investors are now awaiting the separate listing of its commercial vehicle arm, Tata Motors Commercial Vehicles Ltd (TMLCV), valued at around ₹260.75 per share. The record date for the split was October 14, with eligible shareholders set to receive one TMLCV share for every Tata Motors share held.",
            "pubDate": "2025-10-15T04:10:52.538938"
        },
        {
            "title": "Persistent Systems shares rally 6% after 45% YoY surge in Q2 PAT. What brokerages say?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/persistent-systems-shares-in-focus-after-45-yoy-surge-in-q2-pat-what-brokerages-suggest/articleshow/124566994.cms",
            "description": "Persistent Systems shares surged on Wednesday after the company announced robust Q2 FY26 financial results. Net profit saw a significant 45.1% year-on-year jump. Revenue also grew strongly. Brokerages like Nuvama and Choice International Equities reiterated their positive ratings, citing strong deal momentum and growth potential, especially in AI. The company's performance exceeded expectations.",
            "pubDate": "2025-10-15T04:10:52.539046"
        },
        {
            "title": "Saatvik Green Energy shares in focus as subsidiary bags Rs 639-crore solar module orders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/saatvik-green-energy-shares-in-focus-as-subsidiary-bags-rs-639-crore-solar-module-orders/articleshow/124566968.cms",
            "description": "Saatvik Green Energy shares: Saatvik Solar Industries, a subsidiary of the company, secured new solar PV module supply orders worth ₹638.85 crore from three independent power producers and EPC firms, to be completed by June 2026. This marks its second major win in a week, following two earlier orders totaling ₹707 crore announced on October 7 — ₹488 crore from a leading Indian power producer and ₹219 crore from another client, both to be executed by FY26.",
            "pubDate": "2025-10-15T04:10:52.539146"
        },
        {
            "title": "Leela Palaces Hotels among 5 stocks that closed below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/leela-palaces-hotels-among-5-stocks-that-closed-below-vwap/slideshow/124566919.cms",
            "description": "On October 14, the closing prices of five stocks from the Nifty500 fell over 1.5% below their VWAP (Volume Weighted Average Price), according to StockEdge.com’s technical scan data. A move below the VWAP may signal a potential bearish trend.When a stock closes below its VWAP, it indicates that the closing price is lower than the average price at which it traded throughout the day, weighted by trading volume. This can suggest increased selling pressure.",
            "pubDate": "2025-10-15T04:10:52.539261"
        },
        {
            "title": "US labour market & Fed policy: Balancing jobs and inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-labour-market-fed-policy-balancing-jobs-and-inflation/slideshow/124567440.cms",
            "description": "Although the official September jobs report is delayed, available evidence indicates that layoffs and hiring remain low. Both households’ perceptions of job availability and firms’ perceptions of hiring difficulty continue to decline, suggesting limited strength in the labour market despite ongoing economic activity.",
            "pubDate": "2025-10-15T04:33:28.714039"
        },
        {
            "title": "Cyient DLM shares in focus after Q2 profit more than doubles despite revenue decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cyient-dlm-shares-in-focus-after-q2-profit-more-than-doubles-despite-revenue-decline/articleshow/124567300.cms",
            "description": "Cyient DLM reported a 113.3% YoY jump in Q2 FY26 net profit to Rs 32 crore, despite a 20.3% decline in revenue to Rs 310.6 crore due to the completion of a large defence order. EBITDA margin improved to 10%, aided by supply chain efficiencies and a favourable business mix. Order intake rose to Rs 497.7 crore, expanding the backlog.",
            "pubDate": "2025-10-15T04:33:28.714163"
        },
        {
            "title": "Nifty glitters before Diwali; post-Diwali fizzle may be just a market myth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-glitters-before-diwali-post-diwali-fizzle-may-be-just-a-market-myth/articleshow/124567208.cms",
            "description": "Nifty often shines before Diwali, but data shows the post-Diwali slump is largely a myth. While pre-Diwali optimism is evident, the market has shown positive returns in the week after the festival in recent years. Factors like steady SIP inflows and improving earnings provide structural support.",
            "pubDate": "2025-10-15T04:33:28.714279"
        },
        {
            "title": "Bank of Maharashtra shares gain 4% as Q2 net profit jumps 23%; NII over 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-maharashtra-shares-gain-4-as-q2-net-profit-jumps-23-nii-over-15/articleshow/124568181.cms",
            "description": "Bank of Maharashtra shares: The lender reported a 23% YoY jump in Q2FY26 net profit to ₹1,633 crore, with NII up 15.7% to ₹3,248 crore and operating profit rising 16.9% to ₹2,574 crore.",
            "pubDate": "2025-10-15T05:09:47.146260"
        },
        {
            "title": "IREDA shares slip nearly 3% a day after Q2 results as investors book profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ireda-shares-slip-nearly-3-a-day-after-q2-results-as-investors-book-profits/articleshow/124568089.cms",
            "description": "Shares of Indian Renewable Energy Development Agency (IREDA) fell 2.6% to Rs 153.35 after a strong Q2 FY26 showing. Despite a 41.5% YoY jump in net profit and robust operational metrics, investors booked profits, leading to a price correction. Loans and disbursements also saw significant growth.",
            "pubDate": "2025-10-15T05:09:47.146384"
        },
        {
            "title": "Diwali 2025 Picks: Nuvama selects 5 technically strong stocks poised for upside this Samvat 2082",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-2025-picks-nuvama-selects-5-technically-strong-stocks-poised-for-upside-this-samvat-2082/slideshow/124567866.cms",
            "description": "This Samvat 2082, earnings visibility remains strong, supported by healthy credit growth, a manufacturing rebound, and infrastructure spending, driving broad-based profitability. Market valuations are reasonable at around 19–20 times one-year forward Nifty earnings, though mid and small caps may consolidate after recent gains. Liquidity and sentiment are expected to remain positive, backed by domestic savings, government spending, and a resilient banking system. While short-term volatility from geopolitical events and commodity swings is possible, India’s domestic growth, policy stability, and earnings strength support a constructive medium-term outlook. Here are 5 stocks that Nuvama thinks can give meaningful returns this Diwali.",
            "pubDate": "2025-10-15T05:09:47.146491"
        },
        {
            "title": "LG Electronics India shares extend gains a day after 50% listing pop. More room for upside?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-electronics-india-shares-extend-gains-a-day-after-50-listing-pop-more-room-for-upside/articleshow/124567775.cms",
            "description": "LG Electronics India shares extended their post-listing gain, following a stellar debut with a 50% premium. The stock drew bullish coverage from multiple brokerages, with price targets ranging from Rs 1,700 to Rs 2,050. Analysts highlighted the company’s strong brand presence, robust manufacturing base, localization strategy, and leadership across key appliance categories as major growth drivers.",
            "pubDate": "2025-10-15T05:09:47.146593"
        },
        {
            "title": "After LG and Tata Capital, 5 big IPOs worth Rs 35,000 crore to watch out in next one month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-lg-and-tata-capital-5-big-ipos-worth-rs-35000-crore-to-watch-out-in-next-one-month/slideshow/124567719.cms",
            "description": "After LG and Tata Capital tested investor appetite, India’s primary market isn’t slowing down. Over the next few weeks, five major companies from fintech, asset management, and consumer electronics are preparing to raise more than Rs 35,000 crore through initial public offerings (IPOs). Here’s a look at the most anticipated listings in November.",
            "pubDate": "2025-10-15T05:09:47.146719"
        },
        {
            "title": "Nifty may have lost its spark since last Diwali, but 25 penny stocks made investors up to 540% richer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-may-have-lost-its-spark-since-last-diwali-but-25-penny-stocks-made-investors-up-to-540-richer/articleshow/124567551.cms",
            "description": "While major Indian stock indices saw modest gains, a surprising rally occurred in penny stocks. Over the past year, at least 25 low-priced stocks delivered returns of up to 540%, significantly outperforming larger counterparts. These microcap gains, often in sectors like infrastructure and finance, highlight a vibrant, albeit speculative, segment of the market.",
            "pubDate": "2025-10-15T05:09:47.146824"
        },
        {
            "title": "Ola Electric shares in focus on reports of likely expansion plans in energy segment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-on-reports-of-likely-expansion-plans-in-energy-segment/articleshow/124567524.cms",
            "description": "Ola Electric is poised to enter the energy sector with a new product launch on October 17, 2025, expanding beyond its EV core. Chairman Bhavish Aggarwal hinted at a strategic shift towards intelligent, portable, and personal power solutions. Industry speculation points towards a potential entry into Battery Energy Storage Systems (BESS), leveraging existing technology and manufacturing capacity.",
            "pubDate": "2025-10-15T05:09:47.146929"
        },
        {
            "title": "US labour market & Fed policy: Balancing jobs and inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-labour-market-fed-policy-balancing-jobs-and-inflation/slideshow/124567520.cms",
            "description": "The U.S. labour market remained in a low-hiring, low-firing state through September. Powell noted that despite this, the economy may be on a firmer trajectory than previously expected. Policymakers plan to take a meeting-by-meeting approach to interest rate decisions to balance labour market weakness with above-target inflation. (Source: Reuters)",
            "pubDate": "2025-10-15T05:09:47.147029"
        },
        {
            "title": "IMF raises 2025 global growth forecast to 3.2%, warns of US-China trade risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-raises-2025-global-growth-forecast-to-3-2-warns-of-us-china-trade-risk/slideshow/124568287.cms",
            "description": "IMF Managing Director Kristalina Georgieva highlighted the key factors supporting global growth. Most countries have avoided retaliating against U.S. tariffs, which has helped prevent a major escalation in global trade tensions. Trade is continuing largely according to existing rules, providing stability to the global economy. (Source: Reuters)",
            "pubDate": "2025-10-15T05:30:16.185618"
        },
        {
            "title": "Waaree Renewable shares crack over 10% in 2 days on profit booking despite robust Q2 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-shares-crack-over-10-in-2-days-on-profit-booking-despite-robust-q2-earnings/articleshow/124569398.cms",
            "description": "Waaree Renewable Technologies saw its shares dip significantly despite reporting record quarterly revenue and profits. Investors are booking gains after a strong rally, even as the solar firm's net profit more than doubled year-on-year. Expansion into battery storage and data centers are key drivers for the company's robust performance.",
            "pubDate": "2025-10-15T06:26:08.235924"
        },
        {
            "title": "Thyrocare Technologies shares soar 16% to fresh 52-week high after Q2 PAT grows 82% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thyrocare-technologies-shares-soar-16-to-fresh-52-week-high-after-q2-pat-grows-82-yoy/articleshow/124569287.cms",
            "description": "Thyrocare Technologies shares touched a fresh 52-week high on Wednesday after a stellar 82% YoY growth in Q2FY26 PAT. The company's Revenue rose 22% to Rs 216.53 crore, while EBITDA expanded 48–49% YoY. Further, the Thyrocare Technologies board also announced a 2:1 bonus.",
            "pubDate": "2025-10-15T06:26:08.236063"
        },
        {
            "title": "Massive Gains: 10 stocks backed by 100+ MFs rally up to 95% in 2025  so far. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/massive-gains-10-stocks-backed-by-100-mfs-rally-up-to-95-in-2025-so-far-do-you-own-any/slideshow/124568876.cms",
            "description": "When several mutual fund schemes own a stock, investor confidence typically rises. By September 2025, 229 stocks were held by over 100 schemes each, most posting strong gains. Of these, 10 standout names have jumped more than 50% in under 10 months — signalling robust market momentum. (Data Source: ACE MF, ACE Equity)",
            "pubDate": "2025-10-15T06:26:08.236185"
        },
        {
            "title": "Mirae Asset and Sharekhan Diwali Picks 2025: 10 stocks with up to 34% ROE and EPS to lead gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mirae-asset-and-sharekhan-diwali-picks-2025-10-stocks-with-up-to-34-roe-and-eps-to-lead-gains/slideshow/124568734.cms",
            "description": "As investors prepare for the new Samvat year, Mirae Asset and Sharekhan have listed 10 stocks to watch for the next 12 months — companies that combine strong earnings visibility, stable balance sheets, and consistent return ratios.",
            "pubDate": "2025-10-15T06:26:08.236291"
        },
        {
            "title": "Dull October listings hit unlisted shares as IPO-bound firms like Oyo, Groww, NSE slump up to 48% in two weeks - what went wrong?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dull-october-listings-hit-unlisted-shares-as-ipo-bound-firms-like-oyo-groww-nse-slump-up-to-48-in-two-weeks-what-went-wrong/articleshow/124568624.cms",
            "description": "Unlisted share prices of many companies planning IPOs have fallen sharply in October. This follows a dull period for new listings on the stock market. Some prominent firms have experienced significant drops in their unlisted share values. This trend has created uncertainty for investors in the pre-IPO market. Experts point to high valuations as a key reason for this correction.",
            "pubDate": "2025-10-15T06:26:08.236396"
        },
        {
            "title": "Deflation persists in China amid weak demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/deflation-persists-in-china-amid-weak-demand/slideshow/124568584.cms",
            "description": "Consumer and producer prices fell in September as a weak property market and trade tensions weighed on both consumer and business confidence. (Source: Reuters)",
            "pubDate": "2025-10-15T06:26:08.236498"
        },
        {
            "title": "Rubicon Research to Canara HSBC Life: 6 IPO listings could offer up to 30% in next two days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rubicon-research-to-canara-hsbc-life-6-ipo-listings-could-offer-up-to-30-in-next-two-days/slideshow/124570148.cms",
            "description": "A string of IPOs — from pharma to insurance — are set to make their market debut this week. With grey market premiums (GMPs) ranging from 0% to 30%, investor sentiment remains mixed, tilting towards selective optimism in large, well-subscribed issues.",
            "pubDate": "2025-10-15T06:56:52.953072"
        },
        {
            "title": "Tata Motors commercial vehicle shares valued at Rs 261 following demerger. What are analysts saying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-commercial-vehicle-shares-valued-at-rs-261-following-demerger-what-are-analysts-saying/articleshow/124570059.cms",
            "description": "Tata Motors’ demerger has spotlighted its newly separated commercial vehicle arm (TMLCV), valued at around Rs 260.75 per share. Shareholders will receive one TMLCV share for each existing TMPV share. Analysts say the move improves visibility and independent valuation, with TMPV supported by JLR profitability and new model launches, while TMLCV benefits from planned acquisitions and a robust order pipeline.",
            "pubDate": "2025-10-15T06:56:52.953205"
        },
        {
            "title": "Stock Radar: This pharma stock gives a breakout from downward sloping trendline; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-this-pharma-stock-gives-a-breakout-from-downward-sloping-trendline-check-target-stop-loss/articleshow/124551733.cms",
            "description": "Divi's Laboratories stock has broken out of a downward trendline, signalling a potential upward movement. Experts suggest medium-term traders can buy the stock with a target above 7,000 levels in the next 3-4 months. The stock has shown strong price action, trading above key moving averages and experiencing higher volume during the breakout.",
            "pubDate": "2025-10-15T11:51:37.065079"
        },
        {
            "title": "Gainers & Losers:  2 Tata stocks among 9 stocks that hogged limelight on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-2-tata-stocks-among-9-stocks-that-hogged-limelight-on-wednesday/slideshow/124575884.cms",
            "description": "",
            "pubDate": "2025-10-15T11:51:37.065221"
        },
        {
            "title": "Market Wrap: Sensex jumps 575 pts, Nifty reclaims 25,300 as D-St rebounds after 2-day slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-jumps-575-pts-nifty-reclaims-25300-as-d-st-rebounds-after-2-day-slump/articleshow/124574332.cms",
            "description": "Indian stock markets saw a strong rebound on Wednesday. The Sensex and Nifty both climbed, ending a two-day losing streak. Investors showed renewed confidence. This optimism was fueled by expectations of a U.S. Federal Reserve interest rate cut. Hopes for a corporate earnings rebound also boosted market sentiment. The Sensex closed higher by 575 points.",
            "pubDate": "2025-10-15T11:51:37.065371"
        },
        {
            "title": "Paytm set to ride credit boom, Axis Capital upgrades to buy call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-set-to-ride-credit-boom-axis-capital-upgrades-to-buy-call/articleshow/124574027.cms",
            "description": "Paytm upgraded to ‘Buy’ by Axis Capital as credit-linked payments, stabilising merchant revenue, and tight cost control drive growth; FY27–28 EBITDA estimates raised 33–46%, with a Rs 1,500 price target implying 20% upside amid robust digital finance expansion.",
            "pubDate": "2025-10-15T11:51:37.065488"
        },
        {
            "title": "2 out of 3 stocks listed in last 4 years trade below IPO price. Are investors becoming less forgiving?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2-out-of-3-stocks-listed-in-last-4-years-trade-below-ipo-price-are-investors-becoming-less-forgiving/articleshow/124573662.cms",
            "description": "India’s primary market shows signs of fatigue in 2025 despite record IPO activity. Kotak Institutional Equities reports rising fundraising but declining post-listing returns as investors turn valuation-conscious and selective, preferring large and mid-cap issues over smaller ones.",
            "pubDate": "2025-10-15T11:51:37.065593"
        },
        {
            "title": "Missed the LG Electronics India IPO? What should you do as stock trades 48% above issue price?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/missed-the-lg-electronics-india-ipo-what-should-you-do-as-stock-trades-48-above-issue-price/articleshow/124573078.cms",
            "description": "LG Electronics India debuted at a 50% premium after a record-breaking Rs 11,607 crore IPO, sparking FOMO among investors. Despite near-term caution due to stretched valuations, brokerages like Emkay and Motilal Oswal remain positive on long-term growth prospects.",
            "pubDate": "2025-10-15T11:51:37.065704"
        },
        {
            "title": "Did SKF India shares really crash 54% in intraday trade? Here’s the truth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/did-skf-india-shares-really-crash-54-in-intraday-trade-heres-the-truth/articleshow/124572621.cms",
            "description": "SKF India shares appeared to drop 54% intraday on October 15 due to the demerger of its automotive business, but the actual decline was 5%, with the stock hitting its lower circuit at ₹2,276.10 after adjustment.",
            "pubDate": "2025-10-15T11:51:37.065809"
        },
        {
            "title": "European stocks climb as LVMH boosts luxury sector",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-climb-as-lvmh-boosts-luxury-sector/articleshow/124572061.cms",
            "description": "European stocks climbed on Wednesday as upbeat results from France's LVMH sparked a rally in luxury groups and quelled concerns that slowing global growth and tariff wars are taking a toll on corporate health.",
            "pubDate": "2025-10-15T11:51:37.065912"
        },
        {
            "title": "Japan's Nikkei bounces back after tech-led slide; Mercari surges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-bounces-back-after-tech-led-slide-mercari-surges/articleshow/124571913.cms",
            "description": "Japan's Nikkei share gauge rebounded on Wednesday from its steepest drop since April, as investors piled back into tech stocks that were pummelled on concerns over China-U.S. trade friction.",
            "pubDate": "2025-10-15T11:51:37.066011"
        },
        {
            "title": "Diwali Muhurat Trading 2025: Date, time and significance of special trading session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-muhurat-trading-2025-date-time-and-significance-of-special-trading-session/articleshow/124571367.cms",
            "description": "Diwali Muhurat Trading  2025: As India celebrates Diwali, the stock markets will hold Muhurat Trading, a symbolic one-hour session on Tuesday, October 21, from 1:45 pm to 2:45 pm, marking the start of Samvat 2082. NSE and BSE will open for this special session, remaining closed for regular trading, symbolising prosperity, renewal, and optimism for investors in the new Hindu financial year.",
            "pubDate": "2025-10-15T11:51:37.066115"
        },
        {
            "title": "Motilal makes big prediction on silver, sets Rs 2.4 lakh target for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-makes-big-prediction-on-silver-sets-rs-2-4-lakh-target-for-2026/articleshow/124571285.cms",
            "description": "Motilal Oswal projects a strong silver rally in India, forecasting prices up to ₹2.40 lakh by end-2026, driven by structural supply deficits, rising demand from solar and EV sectors, and a weakening rupee. Supported by five consecutive years of global supply shortfalls, robust industrial consumption, and silver’s dual role as an industrial and safe-haven asset, domestic silver ETFs have surged nearly 70% YTD, with further gains expected as USD/INR trends toward 90.",
            "pubDate": "2025-10-15T11:51:37.066215"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to take advantage of support-based buying in index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-take-advantage-of-support-based-buying-in-index/articleshow/124571248.cms",
            "description": "Nifty ended near 25,150 after a volatile session on Tuesday, showing support-based buying at 25,050. Experts suggest a Bull Call Spread strategy to capitalise on a potential rebound, with resistance at 25,350–25,450 and support near 24,900–25,050, amid mixed options activity.",
            "pubDate": "2025-10-15T11:51:37.066337"
        },
        {
            "title": "RBL Bank shares up 5%, extend gains for second trading session. What’s fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-up-5-extend-gains-for-second-trading-session-whats-fuelling-the-rally/articleshow/124571241.cms",
            "description": "RBL Bank shares rose sharply on Wednesday after Emirates NDB Bank PJSC entered into advanced talks to invest Rs 15,000 crore, potentially becoming the largest shareholder in the private sector lender.  The investment will be in the form of preferential allotment of equity shares and warrants, to be followed by an open offer for an additional 26%.",
            "pubDate": "2025-10-15T11:51:37.066438"
        },
        {
            "title": "Sebi bars Nirman Agri Genetics and promoter from markets after finding IPO funds diverted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bars-nirman-agri-genetics-and-promoter-from-markets-after-finding-ipo-funds-diverted/articleshow/124571193.cms",
            "description": "Sebi has passed an interim order against Nirman Agri Genetics Ltd (NAGL) and promoter Pranav Kailas Bagal, restraining them from the securities market. Nearly 93% of the Rs 20.3 crore SME IPO proceeds were allegedly diverted to bogus and promoter-linked entities. The probe revealed conflicting fund disclosures and missing agreements, raising serious concerns about corporate governance and investor protection.",
            "pubDate": "2025-10-15T11:51:37.066541"
        },
        {
            "title": "For investors with a time horizon of 1 to 2 years: 5 mid-cap stocks from different sectors with upside potential of up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-a-time-horizon-of-1-to-2-years-5-mid-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-28/articleshow/124570696.cms",
            "description": "Around this time last year, the mood was upbeat. GDP numbers were good, and there was no talk of any kind of slowdown. A year later, we have literally come full circle. After a clear slowdown in earnings, we are back to hoping that the GST rate rationalisation, lower interest rates, and more money in the pocket of consumers will bring back growth. One thing remains constant, though: Valuations were high then, and they are still high in a large part of the market. But then, valuations have been high for a long time, and they are likely to remain so if growth makes a comeback.",
            "pubDate": "2025-10-15T11:51:37.066639"
        },
        {
            "title": "Diwali 2025: Kotak Securities’ 7 stock picks to watch this festive season",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-2025-kotak-securities-7-stock-picks-to-watch-this-festive-season/slideshow/124571089.cms",
            "description": "After a lackluster Samvat 2081, Indian equities are set for a cautious rebound, supported by improving earnings visibility, easing inflation, and fiscal support measures. Kotak Securities says it expects “some stability in earnings after large downgrades over the past 12-15 months” and sees strong growth in earnings in FY27. Against this backdrop, the brokerage has identified seven stocks it believes are best positioned to outperform in the year ahead.",
            "pubDate": "2025-10-15T11:51:37.066738"
        },
        {
            "title": "US stocks open higher on positive bank results, chip stocks' rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-on-positive-bank-results-chip-stocks-rally/articleshow/124581930.cms",
            "description": "Wall Street's main indexes opened higher on Wednesday, boosted by solid results from major banks, while chipmakers rallied after positive quarterly results from ASML.",
            "pubDate": "2025-10-15T13:54:17.620020"
        },
        {
            "title": "Axis Bank Q2: Profit tanks 26% YoY to ₹5,090 cr | NII up 2%, provisions surge 61%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-q2-profit-tanks-26-yoy-to-5090-cr-nii-up-2-provisions-surge-61/videoshow/124578606.cms",
            "description": "Axis Bank reported a 26% YoY drop in net profit for Q2FY26 at ₹5,090 crore, hurt by higher provisions and slower interest income growth. NII grew 2% YoY to ₹13,744 crore, while operating profit dipped 3%. Fee income rose 10%, driven by retail banking. Gross NPAs improved to 1.46% and net NPAs to 0.44%.",
            "pubDate": "2025-10-15T13:54:17.620145"
        },
        {
            "title": "20+ MFs added these 12 stocks in September '25; one turned multibagger. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/20-mfs-added-these-12-stocks-in-september-25-one-turned-multibagger-do-you-own-any/slideshow/124577672.cms",
            "description": "In September 2025, mutual funds (MFs) continued to show strong confidence in Indian equities, recording net investments of about Rs 46,442 crore for the month. ETMarkets’ analysis shows that 19 stocks were added to over 20 MF portfolios — higher than in August. Of these, 12 delivered double-digit returns in CY25, with one stock surging 155%, more than doubling investor wealth. (Data Source: ACE MF | ACE Equity)",
            "pubDate": "2025-10-15T13:54:17.620257"
        },
        {
            "title": "Cool Caps looks to raise over Rs 279 cr via rights issue, eyes migration to mainboard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cool-caps-looks-to-raise-over-rs-279-cr-via-rights-issue-eyes-migration-to-mainboard/articleshow/124578604.cms",
            "description": "Cool Caps Industries looks to raise around Rs 279.97 crore through its rights issue which closes for subscription on October 24, according to a statement.",
            "pubDate": "2025-10-15T13:54:17.620376"
        }
    ]
}