{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-05T12:30:32.832161",
    "items": [
        {
            "title": "Cupid shares fall another 20%; Tourism Finance recovers strongly, jumps 15%. Here's what happened",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-shares-fall-another-20-tourism-finance-recovers-strongly-jumps-15-heres-what-happened/articleshow/126344620.cms",
            "description": "Cupid and TFCI saw divergent moves after both hit lower circuits on Friday. Cupid extended its slide despite management clarification, while TFCI rebounded on fresh buying, including Ekta Halwasiya’s block deal. Cupid highlighted record Q3FY26 performance and a strong order book, whereas TFCI announced plans to co-sponsor two AIFs.",
            "pubDate": "2026-01-05T05:21:06.206476"
        },
        {
            "title": "Hindustan Copper shares gain 10% in three trading sessions. What should investors do in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-gain-10-in-three-trading-sessions-what-should-investors-do-in-2026/articleshow/126344504.cms",
            "description": "Hindustan Copper shares jumped on January 5, tracking a nearly 3% rise in LME copper prices. The stock has gained 10% over three sessions. Experts say copper fundamentals remain strong, driven by AI, data centres and green energy demand, while supply risks from mine disruptions and labour unrest support prices.",
            "pubDate": "2026-01-05T05:21:06.206589"
        },
        {
            "title": "Maruti Suzuki India, L&T among 4 Nifty stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-india-lt-among-4-nifty-stocks-witness-5-year-swing-high-breakout/slideshow/126343805.cms",
            "description": "In the Nifty50 pack, four stocks witnessed a 5-year swing high at the close on January 2, indicating bullishness in the counters, according to technical scan data from StockEdge.A 5-year swing high marks the highest price a stock has reached over the past five years and serves as an important resistance level. While such moves are viewed as bullish, they differ from a 5-year breakout, which requires a decisive move beyond long-standing resistance.",
            "pubDate": "2026-01-05T05:21:06.206689"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/126344104.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2026-01-05T05:21:06.206804"
        },
        {
            "title": "KNR Construction, other road & highway stocks tumble up to 53% in 2025. Budget is both a hope and hurdle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/knr-construction-other-road-highway-stocks-tumble-up-to-53-in-2025-budget-is-both-a-hope-and-hurdle/articleshow/126344265.cms",
            "description": "Indian road and highway stocks are experiencing significant declines. Investor appetite is low due to a flat Budget 2025 capex and reduced market share for listed developers. Experts are advising caution for investors. Companies are facing revenue contraction and volatile profitability. The outlook suggests continued stress in the road construction sector.",
            "pubDate": "2026-01-05T05:21:06.206907"
        },
        {
            "title": "Sensex falls over 200 pts, Nifty below 26,300 as Venezuela risk tempers earnings optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-200-pts-nifty-below-26300-as-venezuela-risk-tempers-earnings-optimism/articleshow/126344076.cms",
            "description": "Indian equities experienced volatility on Monday, with the Sensex and Nifty fluctuating as investors balanced positive corporate earnings against escalating geopolitical risks. Early gains were tempered by concerns over U.S. military actions in Venezuela, leading to a market caught between domestic support and global uncertainty.",
            "pubDate": "2026-01-05T05:21:06.207004"
        },
        {
            "title": "Buy, Sell or Hold: Citi maintains a buy on Devyani International; remains cautious on Infosys, HCL Tech & Mphasis",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-a-buy-on-devyani-international-remains-cautious-on-infosys-hcl-tech-mphasis/articleshow/126344074.cms",
            "description": "Brokerage views on Indian equities remain mixed, with Citi maintaining a Buy on Devyani International amid merger-led synergies, Morgan Stanley flagging limited near-term upside for Coal India, and continued caution on major IT stocks due to sluggish growth and margin pressures.",
            "pubDate": "2026-01-05T05:21:06.207101"
        },
        {
            "title": "Hindustan Copper vs Hindustan Zinc: Which stock should you add in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-vs-hindustan-zinc-which-stock-should-you-add-in-2026/articleshow/126343965.cms",
            "description": "Investors face a choice between Hindustan Copper and Hindustan Zinc for 2026. Copper's electrification demand supports Hindustan Copper, while silver's surge benefits Hindustan Zinc. Experts note strong rallies but caution about stretched valuations. Hindustan Copper offers operational clarity, but volatility is a concern. Hindustan Zinc is a strong silver play, though much upside may be priced in.",
            "pubDate": "2026-01-05T05:21:06.207193"
        },
        {
            "title": "Nykaa shares surge 3% on Q3 business update. Here’s everything you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-shares-in-focus-on-q3-business-update-heres-everything-you-need-to-know/articleshow/126343945.cms",
            "description": "FSN E-Commerce Ventures, the company behind Nykaa, reported a positive business update for Q3 FY2026, leading to a spike in its share values. Anticipating vigorous growth in its Beauty category, the company is optimistic about accelerated NSV gains. Additionally, the Fashion sector is expected to show signs of revival.",
            "pubDate": "2026-01-05T05:21:06.207292"
        },
        {
            "title": "ITC shares in focus as stock hits 3-year low, brokerages downgrade after steep excise duty hike on cigarettes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-shares-in-focus-as-stock-hits-3-year-low-brokerages-downgrade-after-steep-excise-duty-hike-on-cigarettes/articleshow/126343941.cms",
            "description": "ITC shares slid to a three-year low after a sharp tobacco tax hike triggered widespread brokerage downgrades. Analysts warn that higher excise and GST rates could force steep price increases, hurt cigarette volumes, and compress margins, prompting target cuts and cautious outlooks despite ITC’s diversified FMCG presence.",
            "pubDate": "2026-01-05T05:21:06.207388"
        },
        {
            "title": "Bajaj Finance shares in focus after Q3 update signals steady momentum as customer base, AUM climb",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-shares-in-focus-after-q3-update-signals-steady-momentum-as-customer-base-aum-climb/articleshow/126343925.cms",
            "description": "Bajaj Finance shares are set to be in focus after the lender’s December-quarter business update showed steady growth in customers, loan bookings and assets under management, reinforcing confidence after a strong September-quarter earnings performance.",
            "pubDate": "2026-01-05T05:21:06.207486"
        },
        {
            "title": "MCX stock & the metals mania: Volatility is winning but how much upside is really left?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-stock-the-metals-mania-volatility-is-winning-but-how-much-upside-is-really-left/articleshow/126343919.cms",
            "description": "Multi Commodity Exchange of India Ltd (MCX) shares have surged, driven by persistent commodity volatility rather than just price increases. Analysts emphasize that trading volumes, not commodity prices, fuel MCX's earnings, with operating leverage kicking in when activity remains elevated. The sustainability of this volatility dividend and its impact on MCX's valuation are key investor concerns.",
            "pubDate": "2026-01-05T05:21:06.207580"
        },
        {
            "title": "ONGC may receive $500 million of unpaid dividends if US lifts sanctions on Venezuelan oil",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-may-receive-500-million-of-unpaid-dividends-if-us-lifts-sanctions-on-venezuelan-oil/articleshow/126343883.cms",
            "description": "ONGC could unlock about US$500 million in unpaid dividends from its Venezuelan assets if US-led restructuring eases sanctions, Jefferies said. Recovery would bolster cash flows, balance sheet strength and investor sentiment, adding to robust profitability and valuation comfort, while reviving optionality from stalled Venezuelan projects.",
            "pubDate": "2026-01-05T05:21:06.207674"
        },
        {
            "title": "US-Venezuela tensions: Here’s how crude, gold, dollar are reacting on Monday morning",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-venezuela-tensions-heres-how-crude-gold-dollar-are-reacting-on-monday-morning/articleshow/126343855.cms",
            "description": "Global markets opened in 2026 on edge after a U.S. military operation led to the capture of Venezuela’s President Nicolas Maduro. The escalation has heightened geopolitical risk, triggering volatility across crude oil, precious metals, currencies and equities, as investors reassess supply risks, safe-haven demand and near-term market direction.",
            "pubDate": "2026-01-05T05:21:06.207786"
        },
        {
            "title": "RIL hits record high, ONGC and oil stocks rise up to 2% after Trump’s Venezuela move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-reliance-and-other-oil-linked-stocks-in-focus-after-u-s-raids-venezuela/articleshow/126343701.cms",
            "description": "Reliance Industries and other oil-linked stocks surged following a US military raid in Venezuela, reigniting geopolitical risks. ONGC, with stakes in Venezuelan projects, is expected to benefit from potential recovery of over $500 million in unpaid dividends, as highlighted by Jefferies.",
            "pubDate": "2026-01-05T05:21:06.207886"
        },
        {
            "title": "Swiggy among 7 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-among-7-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126343733.cms",
            "description": "On January 2, futures open interest rose sharply across seven F&O stocks, contributing to a cumulative increase of over 12% compared with the previous session, according to derivatives data. A surge in futures OI indicates a build-up of active contracts, suggesting fresh positioning or expansion of existing positions and rising trader participation.",
            "pubDate": "2026-01-05T05:21:06.207981"
        },
        {
            "title": "NHPC shares rally 10% in 5 days ahead of Rs 2,000 crore fundraising plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nhpc-shares-rally-10-in-5-days-ahead-of-rs-2000-crore-fundraising-plan/articleshow/126345324.cms",
            "description": "NHPC shares extended gains for a fifth straight session, rising over 10% in five days, supported by plans to raise Rs 2,000 crore through bond issuance and strong technical indicators.",
            "pubDate": "2026-01-05T05:52:42.310625"
        },
        {
            "title": "IDBI Bank shares slip 4% despite 12% YoY rise in total business in Q3 FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idbi-bank-shares-slip-4-despite-12-yoy-rise-in-total-business-in-q3-fy26/articleshow/126345251.cms",
            "description": "IDBI Bank shares slipped despite a strong December-quarter update. The bank reported a 12% year-on-year rise in total business to Rs 5.46 lakh crore, supported by healthy growth in deposits and credit.",
            "pubDate": "2026-01-05T05:52:42.310739"
        },
        {
            "title": "Bandhan Bank shares rise nearly 4% after December-quarter loans grow 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bandhan-bank-shares-rise-nearly-4-after-december-quarter-loans-grow-10/articleshow/126345194.cms",
            "description": "Bandhan Bank's shares surged following a positive business update, with loans and advances growing 10% year-on-year to Rs 1.45 lakh crore. While total deposits saw an 11.1% increase, a slight quarter-on-quarter dip and a declining CASA ratio were noted. Improved asset quality, with collection efficiency at 98.1%, provided investor comfort.",
            "pubDate": "2026-01-05T05:52:42.310836"
        },
        {
            "title": "Japan's Nikkei ends at over 2-month high as markets shrug off Venezuela tension",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-at-over-2-month-high-as-markets-shrug-off-venezuela-tension/articleshow/126347753.cms",
            "description": "Japan's Nikkei closed ‍at a more than two-month ​high on the first trading day of 2026, led ⁠by chip-related stocks, as investors brushed off the potential impact of U.S. military action in Venezuela.",
            "pubDate": "2026-01-05T07:57:52.194024"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-34/articleshow/126347601.cms",
            "description": "Our base case assumption is that the recent reforms – both GST and banking – have reinforced the case for being bullish on India at a macro level. Yet, when valuations are high (as they currently are), the probability of volatility hitting the street is always high. So, be ready for volatility, while being bullish. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2026-01-05T07:57:52.194129"
        },
        {
            "title": "Australian shares end flat as miners counter energy, consumer losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-end-flat-as-miners-counter-energy-consumer-losses/articleshow/126347052.cms",
            "description": "Australian shares ended Monday flat. Iron ore miners saw gains, while consumer discretionary and energy stocks declined. Trading volumes were notably low. Asian markets, however, experienced a significant surge, reaching record highs driven by artificial intelligence optimism. Australian equities did not mirror this trend. Miners climbed, while energy stocks reversed earlier gains. Interest rate-sensitive sectors faced pressure.",
            "pubDate": "2026-01-05T07:57:52.194238"
        },
        {
            "title": "Waaree Energies shares fall 5% amid heavy trade volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-fall-5-amid-heavy-trade-volumes/articleshow/126347015.cms",
            "description": "Waaree Energies shares dropped amid heavy selling, with volumes sharply above the recent average. The decline comes days after the stock’s inclusion in the NSE’s F&O segment from the January series, which appears to have triggered increased trading activity and volatility.",
            "pubDate": "2026-01-05T07:57:52.194335"
        },
        {
            "title": "Holding Coal India shares? Check record date to apply for Bharat Coking Coal IPO via shareholder quota",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/holding-coal-india-shares-check-record-date-to-apply-for-bharat-coking-coal-ipo-via-shareholder-quota/articleshow/126346777.cms",
            "description": "Coal India shareholders must be on the company’s register as of January 1 to apply under the shareholder quota for the Bharat Coking Coal IPO, which opens on January 9 and is entirely an offer for sale.",
            "pubDate": "2026-01-05T07:57:52.194438"
        },
        {
            "title": "US attacks Venezuela: 10 listed Indian companies that could see an impact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-attacks-venezuela-10-listed-indian-companies-that-could-see-an-impact/articleshow/126346464.cms",
            "description": "US military action in Venezuela impacts Indian companies with energy, engineering, and pharmaceutical ties. ONGC and Reliance Industries face potential shifts in oil supplies and valuations. Engineers India has an on-ground presence. Pharmaceutical firms like Sun Pharma and Glenmark Pharma operate through subsidiaries. Jindal Steel manages an iron ore complex. These developments highlight geopolitical risks for cross-border operations.",
            "pubDate": "2026-01-05T07:57:52.194535"
        },
        {
            "title": "BEL, HAL, other defence stocks jump up to 5% after US raids Venezuela",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-hal-other-defence-stocks-jump-up-to-5-after-us-raids-venezuela/articleshow/126345886.cms",
            "description": "Defence stocks witnessed a sharp uptick on Monday after the US launched a major military operation in Venezuela over the weekend, heightening geopolitical tensions. Investor interest rose across HAL, BEL, BDL, Solar Industries, and MTAR as markets priced in expectations of higher global defence spending.",
            "pubDate": "2026-01-05T07:57:52.194630"
        },
        {
            "title": "Tata Steel shares jump 10% in six days, just below 52-week high. What’s driving the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-jump-10-in-six-days-just-below-52-week-high-whats-driving-the-rally/articleshow/126345847.cms",
            "description": "Tata Steel shares have rallied over 10% in six sessions as management commentary on domestic expansion, capacity additions and policy support outweighed concerns around global pricing pressure and trade disruptions.",
            "pubDate": "2026-01-05T07:57:52.194725"
        },
        {
            "title": "Gandhar Oil Refinery shares zoom 17% on strong volumes amid US-Venezuela tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gandhar-oil-refinery-shares-zoom-17-on-strong-volumes-amid-us-venezuela-tensions/articleshow/126348526.cms",
            "description": "Gandhar Oil Refinery shares surged on heavy volumes, amid heightened investor interest possibly linked to US–Venezuela geopolitical tensions. Trading activity spiked sharply, with over 21 lakh shares exchanged versus a two-week average of 20,000, reflecting strong momentum in the stock.",
            "pubDate": "2026-01-05T08:33:06.977522"
        },
        {
            "title": "FIIs, Retail raise stakes in Q2; 11 stocks rally up to 75% in 3 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-retail-raise-stakes-in-q2-11-stocks-rally-up-to-75-in-3-months/slideshow/126348416.cms",
            "description": "For retail investors, tracking Foreign Institutional Investor (FII) activity can offer useful clues, as FIIs typically buy with high conviction. An analysis of the BSE universe shows 183 stocks with a market cap above Rs 2,500 crore saw increased stakes from both FIIs and retail investors in the September quarter.However, performance since early October has been mixed, with over half delivering negative returns amid market volatility. Still, 18 stocks gained 20–75% in just over three months, and 11 of them rose more than 25% during a period when both FIIs and retail investors increased their holdings. (Data Source: ACE Equity)",
            "pubDate": "2026-01-05T08:33:06.977631"
        },
        {
            "title": "Defence biggest theme of decade and not oil, natural resources or forex. Gurmeet Chadha explains why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-biggest-theme-of-decade-and-not-oil-natural-resources-or-forex-gurmeet-chadha-explains-why/articleshow/126349603.cms",
            "description": "Defence has emerged as the defining investment theme of the decade, says Gurmeet Chadha, emphasising that military strength now outweighs oil, natural resources or forex reserves in shaping national power. His remarks come amid geopolitical tensions between the US and Venezuela and a sharp rally in Indian defence stocks, underscoring strong structural momentum in the sector.",
            "pubDate": "2026-01-05T09:34:55.286221"
        },
        {
            "title": "China stocks rally as Shanghai benchmark tops 4,000 in first New Year trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-rally-as-shanghai-benchmark-tops-4000-in-first-new-year-trade/articleshow/126349514.cms",
            "description": "Chinese stocks kicked off 2026 with a strong rally, led by tech sectors, pushing the Shanghai Composite above 4,000 for the first time in nearly three months. Investors focused on innovation-led growth, particularly in AI and advanced manufacturing, despite ongoing structural challenges.",
            "pubDate": "2026-01-05T09:34:55.286332"
        },
        {
            "title": "IndusInd Bank among Axis Direct’s three weekly technical bets. Check list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-among-axis-directs-three-weekly-technical-bets-check-list/slideshow/126349470.cms",
            "description": "Axis Direct says Indian equities remain in a constructive phase, with the Nifty 50 closing at a fresh all-time high as buying interest emerged near key supports and momentum indicators turned positive. The brokerage expects the benchmark to trade with a positive bias within a defined range, with strength also evident in the Bank Nifty as higher highs and higher lows reinforce the uptrend. Against this backdrop, Axis Direct has identified select stocks offering medium-term trading opportunities over the next three to four weeks.",
            "pubDate": "2026-01-05T09:34:55.286433"
        },
        {
            "title": "Tata Motors CV shares may rally 16%, says InCred; 4 reasons behind the ‘Add’ call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-cv-shares-may-rally-16-says-incred-4-reasons-behind-the-add-call/articleshow/126349223.cms",
            "description": "InCred Equities has initiated coverage on Tata Motors’ commercial vehicle (CV) business with an Add rating and a price target of Rs 513, citing up to 16% upside. The brokerage highlights a turning CV cycle, strong brand recall, sustained profitability, and robust volume growth as key drivers. Tata Motors’ CV volumes are expected to grow faster than the industry through FY28.",
            "pubDate": "2026-01-05T09:34:55.286560"
        },
        {
            "title": "Ola Electric shares jump 16% in 2026 so far as turnaround signals stoke optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-jump-16-in-2026-so-far-as-turnaround-signals-stoke-optimism/articleshow/126348754.cms",
            "description": "Ola Electric shares have surged 16% in early 2026 as investors respond to signs of a business turnaround. Improved service execution under its Hyperservice programme, rising demand, and market share gains have boosted sentiment. New product traction and early profitability signals in the auto segment are also strengthening confidence in the company’s reset.",
            "pubDate": "2026-01-05T09:34:55.286668"
        },
        {
            "title": "AI-driven inflation is 2026's most overlooked risk, say investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-driven-inflation-is-2026s-most-overlooked-risk-say-investors/articleshow/126350984.cms",
            "description": "Global stock ​markets, riding high on AI euphoria at the start of 2026 may be disregarding one of the biggest threats that could spoil ⁠the party: a surge in inflation driven partly by the tech investment boom.",
            "pubDate": "2026-01-05T10:46:47.229676"
        },
        {
            "title": "HCL, Infosys fall 4%, as IT stocks drag Nifty in red. Here’s what spooked investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-infosys-fall-4-as-it-stocks-drag-nifty-in-red-heres-what-spooked-investors/articleshow/126350719.cms",
            "description": "IT stocks fell up to 3.7% on Monday ahead of the earnings season, which begins next week with the announcement of Q3 results by IT bellwether Tata Consultancy Services (TCS) and HCL Technologies.",
            "pubDate": "2026-01-05T10:46:47.229782"
        },
        {
            "title": "Market Wrap: Sensex down 322 points, Nifty below 26,300 as IT fall offsets earnings optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-down-322-points-nifty-below-26300-as-it-fall-offsets-earnings-optimism/articleshow/126350480.cms",
            "description": "Indian equities ended lower on Monday, with Nifty down 78 points and Sensex slipping 322 points. IT stocks and HDFC Bank led declines amid concerns over U.S. tariffs and rising funding costs. Small-caps outperformed, while experts note December GST rebound and early Q3 trends support cautious optimism ahead of earnings season.",
            "pubDate": "2026-01-05T10:46:47.229979"
        },
        {
            "title": "Adani Power shares may see another 23% growth, says JM Financial while initiating coverage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-may-see-another-23-growth-says-jm-financial-while-initiating-coverage/articleshow/126350139.cms",
            "description": "JM Financial initiates coverage on Adani Power with a Buy rating and a target of Rs 178, citing robust capacity expansion, strong execution and India’s growing thermal power demand as key growth drivers.",
            "pubDate": "2026-01-05T10:46:47.230077"
        },
        {
            "title": "From RIL to TCS: Stocks that moved market value for India's top 10 conglomerates in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-ril-to-tcs-stocks-that-added-and-wiped-out-market-value-for-indias-top-10-conglomerates-in-2025/articleshow/126350192.cms",
            "description": "India’s top 10 conglomerates saw a mixed 2025, with Reliance, HDFC, Adani, Bajaj, and Aditya Birla posting strong gains, while Tata and Godrej lost market value. Key drivers included telecom, metals, financial services, and autos, whereas IT and energy segments weighed on performance, highlighting divergent fortunes among India’s business giants.",
            "pubDate": "2026-01-05T10:46:47.230172"
        },
        {
            "title": "European stocks rise as defence shares lead after Venezuela shock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-rise-as-defence-shares-lead-after-venezuela-shock/articleshow/126349858.cms",
            "description": "European stocks traded firmer on Monday, ‍extending their early-year ​gains as investors bought defense stocks ⁠after U.S. military strikes on Venezuela stirred fresh geopolitical concerns.",
            "pubDate": "2026-01-05T10:46:47.230266"
        },
        {
            "title": "Gainers & Losers: Wipro and Waaree among 6 stocks that were major movers on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-wipro-and-waaree-among-6-stocks-that-were-major-movers-on-monday/slideshow/126351705.cms",
            "description": "Indian benchmark indices ended in the red on Monday, dragged by IT and energy stocks. Nifty settled at 26,250.30, down 78.25 points or 0.30%. Meanwhile, the BSE Sensex gained 322.39 points or 0.38% to finish at 85,439.62. Here are six stocks that saw action today:",
            "pubDate": "2026-01-05T11:21:55.143459"
        },
        {
            "title": "Long-term investors & investing: Different yet the same: 6 stocks from different sectors with an upside potential of up to 45%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/long-term-investors-investing-different-yet-the-same-6-stocks-from-different-sectors-with-an-upside-potential-of-up-to-45/articleshow/126351441.cms",
            "description": "While the market was open for trading on January 1, today is the day most market participants are back at their desks. So, what happens from today onward matters more than anything else. Now, there has been an ongoing debate on the street about valuations, and it could be settled one way or the other in 2026. Just remember: Valuation is a very subjective thing. Should it be defined by a single number? Or by a number justified by the narrative of the time?",
            "pubDate": "2026-01-05T11:21:55.143570"
        },
        {
            "title": "ICICI Prudential Life stock breaks out from symmetrical triangle pattern; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-life-stock-breaks-out-from-symmetrical-triangle-pattern-what-should-investors-do/articleshow/126304576.cms",
            "description": "ICICI Prudential Life Insurance has confirmed a bullish breakout from a symmetrical triangle formation on the daily charts, signalling a potential continuation of the ongoing uptrend. The stock is trading above all key moving averages, supported by strong momentum indicators such as RSI and MACD. Experts believe the technical structure favours further upside in the near term, with targets placed in the Rs 680 to Rs 730 range, while advising traders to maintain disciplined risk management through defined stop losses.",
            "pubDate": "2026-01-05T11:37:33.794345"
        },
        {
            "title": "Kotak Bank Q3 Updates: Net advances jump 16% YoY to Rs 4.8 lakh crore, deposits rise 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-bank-q3-updates-net-advances-jump-16-yoy-to-rs-4-8-lakh-crore-deposits-rise-15/articleshow/126353090.cms",
            "description": "Kotak Mahindra Bank reported robust Q3FY26 growth, with net advances rising 16% YoY to Rs 4.8 lakh crore and deposits increasing 15% to Rs 5.43 lakh crore. Sequentially, both advances and deposits saw steady improvement. CASA grew 12% YoY, while the stock remained resilient, delivering 19% returns over the past year. The numbers are provisional and part of Kotak Bank's quarterly updates. It will announce its detailed earnings later.",
            "pubDate": "2026-01-05T12:30:31.327407"
        },
        {
            "title": "Ashok Leyland, Eicher Motors among 7 auto stocks hit 52-week highs; gains up to 17% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-eicher-motors-among-7-auto-stocks-hit-52-week-highs-gains-up-to-17-in-a-month/slideshow/126352901.cms",
            "description": "On Monday, the benchmark Sensex fell 322 points to close at 85,439. Despite the broader market decline, seven stocks in the BSE Auto Index hit fresh 52-week highs, reaching their strongest levels in the past year. Such breakouts often indicate sustained bullish momentum and can signal further upside potential in the near term.",
            "pubDate": "2026-01-05T12:30:31.327520"
        }
    ]
}