{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-24T01:48:30.530832",
    "items": [
        {
            "title": "Sebi accuses executives at EY, PwC of insider trading",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-accuses-executives-at-ey-pwc-of-insider-trading/articleshow/127351094.cms",
            "description": "India's securities regulator has accused current and former executives from PwC, EY, Carlyle, and Advent. They allegedly breached insider trading rules concerning a 2022 Yes Bank share sale. The regulator claims unpublished price-sensitive information was shared, leading to unlawful gains. The notice follows an investigation into Yes Bank's share movements before a significant offering.",
            "pubDate": "2026-01-24T01:48:27.651019"
        },
        {
            "title": "Adani Group stocks slide up to 14% on US SEC heat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-slide-up-to-14-on-us-sec-heat/articleshow/127350409.cms",
            "description": "Adani Group stocks saw a sharp decline on Friday. This followed news that the US SEC is seeking court permission to email summons to founder Gautam Adani and nephew Sagar Adani. Allegations involve fraud and a bribery plot. The group's market value dropped by over $9 billion. Investors are advised to wait for clarity.",
            "pubDate": "2026-01-24T01:48:27.651145"
        },
        {
            "title": "RBI lines up a big liquidity push amid rupee's slideshow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-lines-up-a-big-liquidity-push-amid-rupees-slideshow/articleshow/127350000.cms",
            "description": "The Reserve Bank of India has announced three liquidity-boosting measures, including open market operations and a dollar-rupee swap, totaling approximately ₹1.92 lakh crore. These actions aim to enhance system liquidity and support the transmission of previous rate cuts. Experts anticipate further liquidity injections in the coming months.",
            "pubDate": "2026-01-24T01:48:27.651357"
        },
        {
            "title": "Sensex, Nifty slide nearly 1% as falling rupee, global tensions spark risk-off trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-slide-nearly-1-as-falling-rupee-global-tensions-spark-risk-off-trade/articleshow/127348656.cms",
            "description": "Indian stock markets ended a difficult week with a significant drop on Friday. The rupee hit new record lows, and global tensions fueled investor caution. Shares of Adani Group companies saw a sharp decline. Broader markets also experienced substantial losses. Investors are concerned about global uncertainty and potential conflicts.",
            "pubDate": "2026-01-24T01:48:27.651453"
        },
        {
            "title": "Three more global companies set to hop on India’s GCC train",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/three-more-global-companies-set-to-hop-on-indias-gcc-train/articleshow/127348472.cms",
            "description": "Videotelephony firm Zoom, telecom giant T-Mobile and low-cost airline Southwest Airlines are among the latest global companies considering the establishment of global capability centres (GCCs) in India, said people aware of the matter, adding that they are in talks with several states toward this end.",
            "pubDate": "2026-01-24T01:48:27.651569"
        }
    ]
}