{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-02T04:13:20.050227",
    "items": [
        {
            "title": "GM Breweries tops October charts with 75% gain as indices snap winning streak. Check other monthly winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gm-breweries-tops-october-charts-with-75-gain-as-indices-snap-winning-streak-check-other-monthly-winners/articleshow/125028673.cms",
            "description": "Indian equities concluded October with a muted performance, ending a four-week winning streak as benchmark indices saw marginal declines due to profit-booking and mixed global cues. Despite volatility, GM Breweries emerged as a top performer, surging 74.77% in the smallcap segment, while other stocks across BSE 500, midcap, and smallcap categories also posted significant monthly gains.",
            "pubDate": "2025-11-02T04:13:17.800325"
        },
        {
            "title": "FII activity, Q2 earnings among 7 factors to affect D-St this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-activity-q2-earnings-among-7-factors-to-affect-d-st-this-week/articleshow/125028606.cms",
            "description": "Indian markets closed marginally lower, ending a four-week winning streak amid profit-booking and mixed global cues. Key factors influencing the upcoming week include Q2 earnings from major companies, macroeconomic data releases, and global developments. FIIs were net sellers, while DIIs were net buyers on Friday.",
            "pubDate": "2025-11-02T04:13:17.800456"
        },
        {
            "title": "Berkshire Hathaway's profits rise 17% as Warren Buffett prepares to step down as CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-hathaways-profits-rise-17-as-warren-buffett-prepares-to-step-down-as-ceo/articleshow/125028559.cms",
            "description": "The profits of Warren Buffett 's company improved 17% thanks to a relatively mild hurricane season and more paper investment gains this year as Berkshire Hathaway prepares for the legendary 95-year-old investor to relinquish the CEO title in January.",
            "pubDate": "2025-11-02T04:13:17.800659"
        }
    ]
}