{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-08T11:33:20.035871",
    "items": [
        {
            "title": "Buy, Sell or Hold: Antique sees over 30% upside in Cyient DLM; JM Financial initiates coverage on Angel One",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-antique-sees-over-30-upside-in-cyient-dlm-jm-financial-initiates-coverage-on-angel-one/articleshow/123757402.cms",
            "description": "Brokerages remain bullish on select stocks, with Nomura backing Eternal for its food delivery and quick commerce leadership, Antique initiating coverage on Cyient DLM citing growth recovery and infrastructure strength, and JM Financial starting coverage on Angel One, highlighting its agile model, promoter backing, and resilient performance despite headwinds.",
            "pubDate": "2025-09-08T04:58:29.287417"
        },
        {
            "title": "Adani Power shares surge 5% after JV for 570 MW hydropower project in Bhutan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-surge-5-after-jv-for-570-mw-hydropower-project-in-bhutan/articleshow/123757327.cms",
            "description": "Adani Power shares jumped 5% to Rs 640.55 after the company signed a shareholders’ agreement with Bhutan’s Druk Green Power Corporation to set up a 570 MW hydroelectric project at Wangchhu. Signed on September 5, the pact involves forming a joint entity, marking Adani Power’s strategic entry into Bhutan’s hydropower sector and expanding its renewable energy footprint abroad.",
            "pubDate": "2025-09-08T04:58:29.287542"
        },
        {
            "title": "Technical picks: Dixon among 3 stocks to buy for up to 12% returns in short term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-dixon-among-3-stocks-to-buy-for-up-to-12-returns-in-short-term/slideshow/123757085.cms",
            "description": "Markets ended the last week on a mixed note, with benchmarks gaining over a percent, supported by strong domestic macroeconomic data and policy reforms. Investor sentiment was buoyed by stronger-than-expected Q1 GDP growth, reaffirming India’s relative resilience.\"A cautiously constructive stance is warranted in this data-heavy week. Investors should focus on quality names in domestic cyclicals such as autos, metals, and consumer discretionary, while retaining defensives like select FMCG and pharma as portfolio stabilizers,\" said Ajit Mishra – SVP, Research, Religare Broking.Here are three stocks to buy for returns up to 32% in the short run:",
            "pubDate": "2025-09-08T04:58:29.287665"
        },
        {
            "title": "Swiggy gets another buy call, this time from Nomura, with Rs 550 target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-gets-another-buy-call-this-time-from-nomura-with-rs-550-target-price/articleshow/123757301.cms",
            "description": "Swiggy's stock receives a 'buy' rating from Nomura, setting a target price of Rs 550, citing disciplined execution and improved breakeven visibility. Ongoing product innovations like Bolt are helping Swiggy gain market share against Zomato. Motilal Oswal also upgraded Swiggy to 'BUY', anticipating multiple tailwinds and raising food delivery growth estimates for FY26-27.",
            "pubDate": "2025-09-08T04:58:29.287777"
        },
        {
            "title": "CEAT shares can rally 16%, says Nuvama Institutional Equities: Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ceat-shares-can-rally-16-says-nuvama-institutional-equities-heres-why/articleshow/123757293.cms",
            "description": "With a price target of Rs 3,900, the domestic brokerage forecasts an upside potential of over 16% from the last closing price of Rs 3,353 per share on the NSE. CEAT shares have rallied 30% in the last six months.",
            "pubDate": "2025-09-08T04:58:29.287880"
        },
        {
            "title": "StanChart expects Fed to cut rates by 50 bps in September after weak US jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stanchart-expects-fed-to-cut-rates-by-50-bps-in-september-after-weak-us-jobs-data/articleshow/123757276.cms",
            "description": "Standard Chartered expects a 50 bps Fed rate cut in September after weak jobs data. BofA also sees two cuts this year. Further easing is unlikely due to inflation.",
            "pubDate": "2025-09-08T04:58:29.287978"
        },
        {
            "title": "Order now! With Zomato & Swiggy soaring, which stock should be in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/order-now-with-zomato-swiggy-soaring-which-stock-should-be-in-your-portfolio/articleshow/123757238.cms",
            "description": "Zomato and Swiggy have experienced significant growth, fueled by strong order volumes and improved quick commerce prospects. While GST rule changes initially caused concern, analysts believe the impact will be minimal as both companies adapt through platform fee adjustments.",
            "pubDate": "2025-09-08T04:58:29.288075"
        },
        {
            "title": "Maruti Suzuki expects 10% growth in small cars after GST 2.0. What it means for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-expects-10-growth-in-small-cars-after-gst-2-0-what-it-means-for-investors/articleshow/123757189.cms",
            "description": "Maruti Suzuki posted a 0.9% rise in consolidated Q1 net profit at Rs 3,792 crore, with revenue up 8% to Rs 38,605 crore. Operating EBIT, however, fell 19% as the automaker offered steeper discounts amid weak demand. The stock ended at Rs 14,903 on the NSE, gaining 1.64% and outperforming Nifty Auto with a 20% monthly rally.",
            "pubDate": "2025-09-08T04:58:29.288172"
        },
        {
            "title": "Vikram Solar shares zoom 7% after securing 336 MW module supply order from L&T",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikram-solar-shares-zoom-7-after-securing-336-mw-module-supply-order-from-lt/articleshow/123756470.cms",
            "description": "Vikram Solar's shares are set to gain attention following a significant 336 MW high-efficiency solar module order from Larsen & Toubro Construction. The modules, utilizing advanced Hypersol G12R N-type technology, will be deployed in Gujarat's Khavda Renewable Energy Park. This project is expected to improve efficiency and reduce the cost of solar energy.",
            "pubDate": "2025-09-08T04:58:29.288275"
        },
        {
            "title": "Gabbar turns hero with GST 2.0, but why are FIIs still haunted by Trump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gabbar-turns-hero-with-gst-2-0-but-why-are-fiis-still-haunted-by-trump/articleshow/123756986.cms",
            "description": "Despite GST 2.0's reforms aiming to boost consumption and corporate earnings, FIIs continue selling Indian stocks, driven by Trump's tariff concerns and global uncertainties. A significant FII exodus, reaching ₹1.4 lakh crore in 2025, persists despite domestic investor support. High valuations and the lure of cheaper markets further fuel the foreign investor skepticism.",
            "pubDate": "2025-09-08T04:58:29.288369"
        },
        {
            "title": "At multi-year highs: GMDC, M&M among 4 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-gmdc-mampm-among-4-stocks-witness-5-year-swing-high-breakout/slideshow/123756935.cms",
            "description": "A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-08T04:58:29.288463"
        },
        {
            "title": "Vodafone, Vedanta among 7 stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-vedanta-among-7-stocks-showing-rsi-trending-up/slideshow/123756888.cms",
            "description": "Nine stocks from the Nifty200 pack were highlighted in the RSI Trending Up scan on September 5, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-08T04:58:29.288556"
        },
        {
            "title": "Sensex up over 250 pts, Nifty50 above 24,800 on GST relief, Fed rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-over-150-pts-nifty50-above-24790-on-gst-relief-fed-rate-cut-bets/articleshow/123756599.cms",
            "description": "The positive sentiment on the D-Street was supported by the GST Council’s sweeping tax cuts and weak U.S. labour data, which have bolstered expectations of a Federal Reserve rate cut.",
            "pubDate": "2025-09-08T04:58:29.288665"
        },
        {
            "title": "Stocks to buy in 2025 for long term: ITC among 5 stocks that could give 14-31% returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-itc-birla-corp-among-5-stocks-that-could-give-14-31-return/slideshow/123756765.cms",
            "description": "Brokerages remain constructive on select stocks across sectors, citing strong growth visibility, strategic initiatives, and healthy upside potential from current levels.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-08T04:58:29.288761"
        },
        {
            "title": "NTPC Green Energy shares in focus after MoU to set up hydrogen fuel station at VOC Port",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-green-energy-shares-in-focus-after-mou-to-set-up-hydrogen-fuel-station-at-voc-port/articleshow/123756399.cms",
            "description": "NTPC Green Energy partners with V.O. Chidambaranar Port Authority to establish a green hydrogen fueling station and deploy hydrogen-powered trucks, promoting green energy technologies and decarbonization. The company's financial performance shows a strong increase in net profit and sales. Technically, the stock exhibits mixed signals, trading below longer-term moving averages but above shorter-term ones.",
            "pubDate": "2025-09-08T04:58:29.288858"
        },
        {
            "title": "BHEL shares rise 2% after 10-year deal with Singapore firm for hydrogen locomotives",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-shares-in-focus-after-10-year-deal-with-singapore-firm-for-hydrogen-locomotives/articleshow/123756288.cms",
            "description": "BHEL shares surged on Monday following a decade-long MoU with Horizon Fuel Cell Technologies to develop hydrogen fuel cell-based rolling stock. BHEL will supply equipment for MB Power's thermal power project. Despite these developments, the company reported a wider net loss in the June quarter, and technical indicators suggest bearish undertones in the stock's performance.",
            "pubDate": "2025-09-08T04:58:29.288949"
        },
        {
            "title": "Negative Breakout: ICICI Lombard, HPCL among 6 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-icici-lombard-hpcl-among-6-stocks-cross-below-their-200-dmas/slideshow/123758001.cms",
            "description": "In the Nifty200 pack, six stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on September 5, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-09-08T05:34:28.595583"
        },
        {
            "title": "Buy, Sell or Hold: Antique sees over 30% upside in Cyient DLM; JM Financial initiates coverage on Angel One",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-antique-sees-over-30-upside-in-cyient-dlm-jm-financial-initiates-coverage-on-angel-one/articleshow/123757687.cms",
            "description": "Brokerages remain bullish on select stocks, with Nomura backing Eternal for its food delivery and quick commerce leadership, Antique initiating coverage on Cyient DLM citing growth recovery and infrastructure strength, and JM Financial starting coverage on Angel One, highlighting its agile model, promoter backing, and resilient performance despite headwinds.",
            "pubDate": "2025-09-08T05:34:28.595708"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/123756134.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-09-08T05:34:28.595810"
        },
        {
            "title": "Varun Beverages, PG Electroplast among 7 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/varun-beverages-pg-electroplast-among-7-fampo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123757743.cms",
            "description": "As of September 5, there was a notable surge in futures open interest for seven stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-08T05:34:28.595930"
        },
        {
            "title": "Market analysts warn of Yen and bond volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-analysts-warn-of-yen-and-bond-volatility/slideshow/123758237.cms",
            "description": "Prime Minister Shigeru Ishiba announced his resignation at age 68, instructing the Liberal Democratic Party (LDP) to hold an emergency leadership race. He will continue his duties until a successor is elected. The resignation comes at a sensitive time for the world’s fourth-largest economy. (Source: Reuters)",
            "pubDate": "2025-09-08T05:59:18.674876"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-28/articleshow/123760386.cms",
            "description": "More than the Nifty and Sensex, it is positive market breadth which reflects the street’s underlying optimism. A part of this is probably thanks to the statement over the weekend indicating a possible thaw in the India-US relationship which has been in the freezer for some time. Also, the street has started to build in a bullish start to festive season sales. There is, of course, nothing wrong in being bullish, but keep your expectations in check and be nimble-footed at this point of time. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-09-08T07:42:26.994712"
        },
        {
            "title": "GST reforms to impact every citizen cutting across regions and income groups, says FM Nirmala Sitharaman",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-reforms-to-impact-every-citizen-cutting-across-regions-and-income-groups-says-fm-nirmala-sitharaman/articleshow/123760540.cms",
            "description": "Finance Minister Nirmala Sitharaman called GST rate cuts a landmark reform benefiting all Indians, especially the middle class. She dismissed political pressure claims, noted even critics’ praise, acknowledged state inputs, and stressed the reform focuses on people, not politics, promising relief and cheer before the festive season.",
            "pubDate": "2025-09-08T07:42:26.994831"
        },
        {
            "title": "Stocks to buy this week: Nykaa, RIL, IREDA among 8 stocks with up to 72% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-this-week-nykaa-ril-ireda-among-8-stocks-with-up-to-72-upside/slideshow/123759304.cms",
            "description": "The start to September series has been positive with Nifty ending the previous week with gains of 1.3% on. The momentum is expected to carry through this week on GST boost and festive season starting in two weeks. As Nifty trades above the 21 EMA, the short term trend looks sideways to slightly positive, says Rupak De, Senior Technical Analyst at LKP Securities. ETMarkets has compiled a list of 8 technical and fundamental picks recommended by top brokerages to buy this week. Take a look!",
            "pubDate": "2025-09-08T07:42:26.994938"
        },
        {
            "title": "GMDC shares rally over 35% in September, hit fresh 52-week high intraday. What’s behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-shares-rally-over-35-in-september-hit-fresh-52-week-high-intraday-whats-behind-the-surge/articleshow/123760501.cms",
            "description": "GMDC shares surged 35.5% in September, hitting a 52-week high on strong volumes, rare earth mining optimism, and government support. Despite weaker Q1 earnings, multibagger returns, zero debt, and strategic diversification keep investors bullish, though brokerages caution over high valuations and slow lignite ramp-up.",
            "pubDate": "2025-09-08T07:42:26.995036"
        },
        {
            "title": "Earnings uptick crucial for Nifty to cross 26,000 levels: Ambareesh Baliga",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-uptick-crucial-for-nifty-to-cross-26000-levels-ambareesh-baliga/articleshow/123760399.cms",
            "description": "The market briefly surged after the government’s GST rate rationalization, but experts caution the rally may be short-lived as expectations were already priced in. Ambareesh Baliga expects Nifty to trade between 24,200 and 26,000 levels, with earnings growth crucial for a breakout. Consumption-driven sectors may benefit during the upcoming festive season.",
            "pubDate": "2025-09-08T07:42:26.995130"
        },
        {
            "title": "Apollo Micro Systems shares slide 9% on profit booking",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-micro-systems-shares-slide-9-on-profit-booking/articleshow/123759640.cms",
            "description": "Apollo Micro Systems shares fell sharply on Monday amid profit booking after a strong rally of 62% in the past month and 175% over the last year. The stock remains technically bullish, trading above most key SMAs, with an RSI signalling short-term overbought conditions.",
            "pubDate": "2025-09-08T07:42:26.995250"
        },
        {
            "title": "FIIs cautious despite GST boost as earnings hold the key; 5 stocks to bet on now: Pramod Amthe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-cautious-despite-gst-boost-as-earnings-hold-the-key-5-stocks-to-bet-on-now-pramod-amthe/articleshow/123759443.cms",
            "description": "Despite a GST rate cut lifting sentiment, FIIs remain cautious on Indian equities, says InCred Capital’s Pramod Amthe, stressing earnings as the key trigger. He sees opportunities in autos, financials, and consumer discretionary, with high-conviction picks like Maruti, Bajaj Auto, Bajaj Finance, Shriram Transport, and TCPL Packaging.",
            "pubDate": "2025-09-08T07:42:26.995349"
        },
        {
            "title": "Tata Steel shares jump 3% to hit fresh 52-week high on strong sector tailwinds, brokerage optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-jump-3-to-hit-fresh-52-week-high-on-strong-sector-tailwinds-brokerage-optimism/articleshow/123759374.cms",
            "description": "Tata Steel shares surged to their 52-week high on Monday, banking on strong sector tailwinds, including India’s extended safeguard duty, China’s production curbs, and positive brokerage views. Morgan Stanley upgraded the stock to Overweight with a Rs 200 target, citing favourable demand and pricing trends.",
            "pubDate": "2025-09-08T07:42:26.995444"
        },
        {
            "title": "GST clarity and valuation levels could spur FII comeback: Chakri Lokapriya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-clarity-and-valuation-levels-could-spur-fii-comeback-chakri-lokapriya/articleshow/123759339.cms",
            "description": "Indian equity markets show cautious optimism amid global and domestic triggers. Chakri Lokapriya highlights falling INR, FII selling, and tariff uncertainty but points to fair valuations at 19–20x FY27 earnings. He stresses GST reforms as a structural positive that could drive earnings upgrades, boost demand, and attract fresh FII inflows.",
            "pubDate": "2025-09-08T07:42:26.995533"
        },
        {
            "title": "Netweb Technologies shares rally 50% in 6 days to hit record high. Here are 4 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-shares-rally-50-in-6-days-to-hit-record-high-here-are-4-reasons-why/articleshow/123759121.cms",
            "description": "Netweb Technologies shares surged 50% in six sessions to hit a record high, driven by a Rs 1,734 crore sovereign AI order, upbeat AGM outlook, robust Q1 earnings, and bullish technical signals. The stock has nearly doubled in the past six months.",
            "pubDate": "2025-09-08T07:42:26.995625"
        },
        {
            "title": "MosChip Tech shares jump 8%, extend winning streak to 7 days. What’s driving the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/moschip-tech-shares-jump-8-extend-winning-streak-to-7-days-whats-driving-the-rally/articleshow/123758736.cms",
            "description": "MosChip Technologies shares hit their 52-week high on Monday, riding on the back of trading volumes and government focus on boosting India’s semiconductor sector. The upcoming ISM 2.0 have fuelled investor optimism around the stock.",
            "pubDate": "2025-09-08T07:42:26.995718"
        },
        {
            "title": "ECB faces new challenges as France crisis looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecb-faces-new-challenges-as-france-crisis-looms/slideshow/123758660.cms",
            "description": "The ECB is expected to hold its key deposit rate steady at 2% this week, marking the second straight meeting without change. The central bank has shifted focus from fighting inflation to supporting growth, after multiple rate cuts over the past year. (Source: Reuters)",
            "pubDate": "2025-09-08T07:42:26.995811"
        },
        {
            "title": "Market Wrap: Auto, metal stocks lift Sensex up 76 points, Nifty above 24,770 on GST relief, Fed rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-auto-metal-stocks-lift-sensex-up-76-points-nifty-above-24770-on-gst-relief-fed-rate-cut-bets/articleshow/123763549.cms",
            "description": "Indian benchmark indices Sensex and Nifty closed in the green on Monday, lifted by auto and metal shares, as optimism over sweeping GST tax cuts and China’s steel reforms supported sentiment alongside expectations of a Federal Reserve rate cut this month.",
            "pubDate": "2025-09-08T10:34:48.584441"
        },
        {
            "title": "Midcaps outperform as key indices await fresh momentum;  Tata Motors, Havells among top trading bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcaps-outperform-as-key-indices-await-fresh-momentum-tata-motors-havells-among-top-trading-bets/articleshow/123763554.cms",
            "description": "Market sentiment stays cautiously optimistic with Nifty showing resilience despite sluggish moves. Analysts expect a gradual rise towards 25,000, while midcaps, Tata Motors, and Havells are emerging as strong trading opportunities amid bullish technical signals.",
            "pubDate": "2025-09-08T10:34:48.584564"
        },
        {
            "title": "9 Nifty500 stocks plunge over 20% in two months after FII pullback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-nifty500-stocks-plunge-over-20-in-two-months-after-fii-pullback/slideshow/123762357.cms",
            "description": "In a noteworthy shift, Foreign Institutional Investors (FIIs) cut their holdings in 251 companies from the Nifty 500 index during the June 2025 quarter. This broad-based pullback has coincided with sharp declines in many of these stocks. Since the end of June, most affected names have traded in the red, with 64 stocks losing over 10% in just a little more than two months. Alarmingly, nine have crashed by more than 20%, sparking concerns for retail investors. (Data: ACE Equity)",
            "pubDate": "2025-09-08T10:34:48.584691"
        },
        {
            "title": "Auto stocks rally up to 7% as OEMs M&M, Tata Motors, Ashok Leyland step on gas",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-stocks-rally-up-to-7-as-oems-mm-tata-motors-ashok-leyland-step-on-gas/articleshow/123763477.cms",
            "description": "Auto stocks surged on Monday with Bharat Forge up 7% and Ashok Leyland hitting a 52-week high. Nifty Auto index rose over 3%, supported by GST cuts and upbeat sector sentiment.",
            "pubDate": "2025-09-08T10:34:48.584790"
        },
        {
            "title": "Equirus Capital sees strong growth across Indian real estate segments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/equirus-capital-sees-strong-growth-across-indian-real-estate-segments/articleshow/123763426.cms",
            "description": "Equirus Capital highlighted strong momentum in India’s real estate sector, with robust growth across residential, commercial, and hospitality. Bengaluru emerged as a global hub, offering affordable office rentals, cost-effective workforce, and the highest commercial space absorption worldwide.",
            "pubDate": "2025-09-08T10:34:48.584887"
        },
        {
            "title": "Damani, Madhu Kela join Ranbir Kapoor to back this smallcap; acquire stake via bulk deals. Shares surge 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ramesh-damani-madhu-kela-join-ranbir-kapoor-to-back-this-smallcap-stock-acquire-stake-via-bulk-deals/articleshow/123762294.cms",
            "description": "Prime Focus attracted significant investments from market veterans like Ramesh Damani, Singularity AMC, and Utpal Sheth, leading its shares to surge by 10% on the BSE. These investors collectively acquired a 3.3% stake, amounting to approximately Rs 146.2 crore.",
            "pubDate": "2025-09-08T10:34:48.584985"
        },
        {
            "title": "Pharma stocks: Moving from ‘What if’ to ‘Maybe not’. 8 pharma stocks, 3 with upside potential above 22%; others not so high, but…",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-stocks-moving-from-what-if-to-maybe-not-8-pharma-stocks-3-with-upside-potential-above-22-others-not-so-high-but/articleshow/123761694.cms",
            "description": "There are two ways to look at the hope which the street is reflecting when it comes to a possible India-US tariff deal. One, it will bring down the tariffs (raised recently) on a number of products. Two, it removes the fear hanging over some companies and sectors that they may be put on the tariff list if the situation is not resolved. Now, which is the sector where the fear of a possible tariff hike is most palpable? The answer is pharma. The reason it has not been tariffed by President Trump is that any additional duty will mean higher medicine costs in the US. And it will lead to higher inflation. But then you don't know what he might do. So, there is an element of  “what if” at the moment, and getting that removed is good enough.",
            "pubDate": "2025-09-08T10:34:48.585082"
        },
        {
            "title": "FIIs still cautious, but India’s market story remains intact: Mark Matthews",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-still-cautious-but-indias-market-story-remains-intact-mark-matthews/articleshow/123762177.cms",
            "description": "Despite FIIs remaining cautious, Mark Matthews highlights India’s strong long-term fundamentals, driven by consumption growth, robust financials, and government reforms like GST cuts and tax adjustments. The country’s large, liquid market continues to attract investors, even amid renewed interest in China.",
            "pubDate": "2025-09-08T10:34:48.585172"
        },
        {
            "title": "Oversold bounce won’t last, softer oil prices ahead: Peter McGuire",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oversold-bounce-wont-last-softer-oil-prices-ahead-peter-mcguire/articleshow/123761974.cms",
            "description": "OPEC+ announced a fresh output hike, lifting Brent crude prices briefly before experts cautioned against a sustained rally. XM Australia’s Peter McGuire expects softer pricing, projecting crude in the high 50s within weeks. Russia’s compliance adds supply, raising concerns of a potential glut by mid-Q4, easing consumer inflation pressures.",
            "pubDate": "2025-09-08T10:34:48.585261"
        },
        {
            "title": "BSE proves bullet-proof after expiry day swapping with NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-proves-bullet-proof-after-expiry-day-swapping-with-nse/articleshow/123761882.cms",
            "description": "BSE outperformed expectations after shifting its weekly derivatives expiry to Thursday, boosting market share to 28.2% and premium turnover by 19%. Despite regulatory uncertainty and rising retail scrutiny, the strategic swap strengthened BSE’s positioning in the derivatives market, showcasing resilience amid volatility and competitive pressures.",
            "pubDate": "2025-09-08T10:34:48.585355"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Spread in Nifty to benefit from moderate upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-benefit-from-moderate-upside-potential/articleshow/123761789.cms",
            "description": "Nifty gained 1.29% this week, holding above key EMAs and Fibonacci support while facing resistance near 24,800. RSI signals mild bullishness, but option chain remains neutral. Experts suggest a Bull Call Spread to capture moderate upside with defined risk, supported by technical and monthly bullish setups.",
            "pubDate": "2025-09-08T10:34:48.585456"
        },
        {
            "title": "Blinkit can break-even in Q4, says Nomura; raises Eternal target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blinkit-can-break-even-in-q4-says-nomura-raises-eternal-target-price/articleshow/123761448.cms",
            "description": "Nomura raised Eternal’s target price to Rs 370, projecting a 12% rally driven by Blinkit’s shift to an inventory-led model, store expansion, and expected breakeven by FY26. Food delivery remains the cash engine with strong growth prospects, while competition poses near-term risks.",
            "pubDate": "2025-09-08T10:34:48.585555"
        },
        {
            "title": "Mahindra & Mahindra shares soar 14% in 4 days on GST boost. Analysts eye Rs 4,000 next",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahindra-mahindra-shares-soar-14-in-4-days-on-gst-boost-analysts-eye-rs-4000-next/articleshow/123761381.cms",
            "description": "Mahindra & Mahindra surged 14% in four sessions as GST 2.0 cuts auto tax slabs, boosting SUVs and tractors. Analysts expect near-term pullbacks but medium-term upside toward Rs 4,000, aided by festive season demand and structural reforms.",
            "pubDate": "2025-09-08T10:34:48.585665"
        },
        {
            "title": "European shares rise ahead of crucial French no-confidence vote",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-ahead-of-crucial-french-no-confidence-vote/articleshow/123761299.cms",
            "description": "European shares edged higher on Monday in a buoyant start to an event-filled week that is likely to be dominated by political uncertainty in France, which is all but certain to start looking for its fifth prime minister in three years.",
            "pubDate": "2025-09-08T10:34:48.585756"
        },
        {
            "title": "Japan's Topix hits record high, yen and bonds fall on PM Ishiba exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-topix-hits-record-high-yen-and-bonds-fall-on-pm-ishiba-exit/articleshow/123761261.cms",
            "description": "Japan's Topix share gauge reached a record high, the yen weakened and longer-dated bonds slid on Monday after Prime Minister Shigeru Ishiba's resignation stoked speculation that his successor will raise government spending.",
            "pubDate": "2025-09-08T10:34:48.585849"
        },
        {
            "title": "Rising consumer spending propels Japan’s economy amid global uncertainties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-consumer-spending-propels-japans-economy-amid-global-uncertainties/slideshow/123760790.cms",
            "description": "Japan’s economy expanded faster than initially estimated in the second quarter. Annualized GDP growth came in at 2.2%, up from the preliminary forecast of 1.0%, while quarter-on-quarter growth rose to 0.5% from the earlier estimate of 0.3%. This growth was largely driven by stronger private consumption, higher inventories, and increased corporate spending. (Source: Reuters)",
            "pubDate": "2025-09-08T10:34:48.585940"
        },
        {
            "title": "Explained: Why are Vedanta investors disappointed on Rs 17,000-crore Jaiprakash acquisition bid",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-are-vedanta-investors-disappointed-on-rs-17000-crore-jaiprakash-acquisition-bid/articleshow/123764338.cms",
            "description": "Vedanta’s Rs 17,000 crore bid for Jaiprakash Associates assets raises concerns over weak synergies, debt risks, and limited turnaround potential. Analysts question the addition of non-core, litigation-prone businesses, though the staggered payment eases cash flow pressure. Shares fell 2.2%, reflecting investor skepticism amid volatile markets.",
            "pubDate": "2025-09-08T11:33:18.433932"
        },
        {
            "title": "No sector mispriced, market remains efficient despite global uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/no-sector-mispriced-market-remains-efficient-despite-global-uncertainty/articleshow/123764225.cms",
            "description": "India’s consumption story is gaining momentum after GST cuts, with automakers, insurers, and FMCG firms set to benefit. Expert Mark Matthews highlights IT as undervalued, despite global uncertainties and tariff risks from the U.S. He believes India’s resilience and strategic positioning could support equities through consumption-driven growth and export sector recovery.",
            "pubDate": "2025-09-08T11:33:18.434071"
        },
        {
            "title": "GST cut a near-term cushion, but tariff uncertainties and global risks keep India’s growth outlook delicately poised: Suvodeep Rakshit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-cut-a-near-term-cushion-but-tariff-uncertainties-and-global-risks-keep-indias-growth-outlook-delicately-poised-suvodeep-rakshit/articleshow/123764140.cms",
            "description": "GST rate cuts could cushion India’s economy against 50% US tariffs, supporting GDP by 0.3–0.5%. Consumption, income tax relief, and festive demand bolster growth, while inflation may ease to 4–4.5%. RBI could cut rates if growth slips below 6.5%, with trade talks and policy measures shaping near-term outcomes.",
            "pubDate": "2025-09-08T11:33:18.434278"
        }
    ]
}