{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-10T18:20:34.282129",
    "items": [
        {
            "title": "IndusInd Bank sees net worth impacted by 2.35% after derivatives portfolio review",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-sees-adverse-impact-of-2-35-on-net-worth-following-derivatives-portfolio-review/articleshow/118853058.cms",
            "description": "IndusInd Bank's internal review has found discrepancies in its derivative portfolio, potentially impacting the bank's net worth by 2.35% by December 2024. This follows RBI's 2023 directions on derivatives. Although an external agency will verify findings, IndusInd Bank assures strong profitability to absorb the impact. Shares fell by 3.71% after the report.",
            "pubDate": "2025-03-10T18:20:20.993483"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/118852033.cms",
            "description": "Indian markets closed lower on Monday, with Nifty ending a three-day winning streak due to declines in Reliance Industries and IndusInd Bank. Global uncertainties, including U.S. tariffs and economic indicators, contributed to volatility, with analysts predicting near-term market fluctuations.",
            "pubDate": "2025-03-10T18:20:20.993615"
        },
        {
            "title": "Market Trading Guide: JK Cement, United Spirits are among 4 stock recommendations for Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-jk-cement-united-spirits-are-among-4-stock-recommendations-for-tuesday/slideshow/118850470.cms",
            "description": "Indian frontline indices gave-up their morning gains to end the session in the red. The auto and energy sectors were major laggards. While Nifty closed at 22,460.30, down by 92.20 points or 0.41% breaking its three sessions gaining streak, the BSE Sensex closed in the red at 74,038.24, declining by 294.34 points or 0.40%.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that Nifty is finding resistance at the 21 EMA on the daily chart, which led to a decline towards 22,400 on Monday. \"The Nifty remained volatile throughout the day. Going forward, 22,400 might continue to act as crucial support, and sentiment is unlikely to weaken unless Nifty falls below this level. On the higher end, resistance is placed at 22,750, above which the bulls might gain increased strength. The overall large-cap sentiment could also strengthen if Nifty moves above 22,750,\" De said.Here are 4 stock recommendations for Tuesday:",
            "pubDate": "2025-03-10T18:20:20.993731"
        },
        {
            "title": "Two Sharp with ET: Small, medium caps see Rs 4 lakh cr boom, 38 multibaggers’ value slashed to half",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-small-medium-caps-see-rs-4-lakh-cr-boom-38-multibaggers-value-slashed-to-half/videoshow/118851734.cms",
            "description": "Market staged a stunning comeback — Rs 4 lakh crore added in the previous 4 -5 days, shows ACE Equity data. The BSE Smallcap index’s 6.6% surge has fueled hopes of a turnaround. But, bear markets are tricky38 Multibaggers have lost half of the 1000% earning they made in 2024. Where are we headed, Nisha Poddar decodes.",
            "pubDate": "2025-03-10T18:20:20.993836"
        },
        {
            "title": "Investcorp Real Estate Yield Fund, six others settle AIF rule violation case with Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investcorp-real-estate-yield-fund-six-others-settle-aif-rule-violation-case-with-sebi/articleshow/118851513.cms",
            "description": "Investcorp Real Estate Yield Fund and six others have settled with markets regulator Sebi a case of flouting Alternate Investment Funds (AIF) rules on payment of Rs 25.5 lakh towards settlement amount. Apart from Investcorp Real Estate Yield Fund, Investcorp India Asset Managers, Ajay Kumar, Niraj Sirsalewal, Ritesh Vohra, Gaurav Sharma and IDBI Trusteeship Services Ltd have settled the case.",
            "pubDate": "2025-03-10T18:20:20.993941"
        },
        {
            "title": "Sebi launches certification course on AML, CFT provisions to benefit securities mkt intermediaries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-launches-certification-course-on-aml-cft-provisions-to-benefit-securities-mkt-intermediaries/articleshow/118851447.cms",
            "description": "Sebi on Monday said it has launched a certification course to foster knowledge about the concepts of Anti-Money Laundering (AML) and Combating the Financing of Terrorism (CFT) among the securities market intermediaries.",
            "pubDate": "2025-03-10T18:20:20.994043"
        },
        {
            "title": "A play in the power sector? 5 stocks related to transmission and grid modernization, with upside potential of 9 to 52%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-play-in-the-power-sector-5-stocks-related-to-transmission-and-grid-modernization-with-upside-potential-of-9-to-52/articleshow/118849635.cms",
            "description": "Power as a sector has seen a major improvement in its operating matrix. This has led to an across-the-board re-rating. But a deeper look reveals that there are some segments of the sector that are relatively better placed than others. Transmission is one of them. Once a transmission line is built, revenue is stable and it is literally a monopoly business. To put it in perspective: If a transmission line is laid between a plant in Dadri (power producing area) and Rajasthan (power consuming region), there is no scope or need for another line to come up. There are other factors, too, that make the transmission and distribution ecosystem better than others in the power sector.",
            "pubDate": "2025-03-10T18:20:20.994258"
        },
        {
            "title": "Nasdaq plummets over 3%, S&P 2% as tariff woes persist; Tesla falls 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nasdaq-crashes-300-points-sp-over-1-as-tariff-woes-persist-tesla-falls-5/articleshow/118849324.cms",
            "description": "US stocks: Wall Street's main indexes dropped on Monday amid concerns over a potential economic slowdown due to U.S. President Donald Trump's trade policies with Mexico, Canada, and China. Sectoral declines were led by technology stocks, and major banks such as JPMorgan Chase and Goldman Sachs also saw significant losses.",
            "pubDate": "2025-03-10T18:20:20.994354"
        },
        {
            "title": "Women in stock markets: 6 key things to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/women-in-stock-markets-6-key-things-to-know/slideshow/118849510.cms",
            "description": "The financial markets are full of opportunities, and more women than ever are stepping in to take charge of their investments. ET Markets caught up with Cheenu Gupta – SVP, Fund Management Equities, HSBC Mutual Fund to discuss how women can make smarter financial decisions. Top takeaways:",
            "pubDate": "2025-03-10T18:20:20.994451"
        },
        {
            "title": "These 6 stocks hit 52-week low, fallen up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-stocks-hit-52-week-low-fallen-up-to-25-in-a-month/slideshow/118848027.cms",
            "description": "On Monday, the benchmark Sensex dropped by 217 points, closing at 74,115. Amid this market decline, six stocks from the BSE 500 index hit their 52-week lows. A 52-week low represents the lowest price a stock has reached in the past year. While this could indicate a potential buying opportunity for stocks with strong fundamentals, it may also reflect underlying issues or negative trends within a company. Investors often use this metric to evaluate price movements and assess overall market sentiment.",
            "pubDate": "2025-03-10T18:20:20.994549"
        },
        {
            "title": "Breakout Stocks: How to trade Avanti Feeds and Aavas Financiers on Tuesday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-avanti-feeds-and-aavas-financiers-on-tuesday/slideshow/118846512.cms",
            "description": "Indian market remained volatile but closed in the red on Tuesday. The BSE Sensex was down more than 200 points while the Nifty50 closed below 22500 levels.",
            "pubDate": "2025-03-10T18:20:20.994741"
        },
        {
            "title": "Roshni Nadar Malhotra to become third richest Indian after dad Shiv Nadar gifts HCL stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/roshni-nadar-malhotra-to-become-indias-third-richest-person-after-hcl-stake-transfer/articleshow/118846022.cms",
            "description": "Roshni Nadar Malhotra becomes India's third-richest individual after receiving a 47% stake in HCL Corporation and Vama Delhi from her father, Shiv Nadar. The succession move cements her majority control over HCLTech and HCL Infosystems.",
            "pubDate": "2025-03-10T18:20:20.994836"
        },
        {
            "title": "Capital Infra Trust announces raising Rs 2,363 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capital-infra-trust-announces-raising-rs-2363-cr/articleshow/118843904.cms",
            "description": "Infrastructure investment trust Capital Infra Trust has announced raising Rs 2,363 crore through debt securities to strengthen its financial position. Established in September 2023, Capital Infra Trust InvIT is sponsored by Gawar Construction Limited.",
            "pubDate": "2025-03-10T18:20:20.994931"
        },
        {
            "title": "Jim Walker nailed the 2008 stock market crash. Now he has 4 bold predictions for 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jim-walker-nailed-the-2008-stock-market-crash-now-he-has-4-bold-predictions-for-2025/articleshow/118842665.cms",
            "description": "Aletheia Capital’s Chief Economist, Jim Walker, predicts a 10% decline in the US dollar, a painful but manageable economic slowdown, a long-term bullish trend in copper, and strong growth for Indian equities. He urges investors to double down on India, citing stable policies and economic expansion.",
            "pubDate": "2025-03-10T18:20:20.995024"
        }
    ]
}