{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-22T01:43:39.142762",
    "items": [
        {
            "title": "Asian shares rise as Japan rallies, dollar gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-rise-as-japan-rallies-dollar-gains/articleshow/124035302.cms",
            "description": "Asian markets saw gains, led by Japan, after its central bank addressed ETF concerns. Australian and South Korean shares also increased. US equity futures showed mixed performance amid H-1B visa fee worries. Trump touted progress on China issues. Wall Street reached new highs, fueled by rate cut prospects. Focus shifts to China's loan rates and upcoming economic data.",
            "pubDate": "2025-09-22T01:43:31.759716"
        },
        {
            "title": "Stocks in news: TCS, Infosys, Wipro, YES Bank, Shipping Corp, GRSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-infosys-wipro-yes-bank-shipping-corp-grse/articleshow/124030421.cms",
            "description": "Indian equities rose for the third week due to positive domestic and global cues, including optimism about India-US trade talks and a potential US Federal Reserve rate cut. However, concerns arose from Trump's H-1B visa policy. YES Bank gained confidence from SMBC's stake purchase, while IT stocks faced pressure. NTPC aims to secure uranium assets, and ONGC plans offshore drilling.",
            "pubDate": "2025-09-22T01:43:31.759838"
        },
        {
            "title": "Can Indian markets sustain their rise despite high valuations and global uncertainties?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-indian-markets-sustain-their-rise-despite-high-valuations-and-global-uncertainties/articleshow/124035226.cms",
            "description": "Despite global economic concerns, Indian stock markets are nearing record highs. Sensex and Nifty are close to peak levels. Domestic liquidity is driving the market. Foreign selling has receded. Investors are cautious due to high valuations and trade tensions. Some investors are shifting towards gold. Market participants are unsure about the sustainability of the rally.",
            "pubDate": "2025-09-22T01:43:31.760049"
        },
        {
            "title": "RBI sets up new panel to update, streamline financial regulations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-sets-up-new-panel-to-update-streamline-financial-regulations/articleshow/124035211.cms",
            "description": "Reserve Bank of India establishes a Regulatory Review Cell. This cell will streamline regulatory changes. It will also quicken the review process. Financial institutions can now flag redundant rules. They can also provide feedback on dated regulations. An advisory group, led by State Bank of India MD Rana Ashutosh Kumar Singh, will channel industry feedback.",
            "pubDate": "2025-09-22T01:43:31.760150"
        },
        {
            "title": "GIFT Nifty down 120 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124030478.cms",
            "description": "Indian equities experienced a slight dip on Friday after a three-day rally, as selling pressure emerged. However, analysts maintain a positive outlook, anticipating a consumption boost from upcoming GST rate cuts and Navratri festivities. The rupee strengthened, while FIIs remained net short in the futures market.",
            "pubDate": "2025-09-22T01:43:31.760248"
        },
        {
            "title": "Nifty faces stiff resistance as US visa concerns weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-faces-stiff-resistance-as-us-visa-concerns-weigh/articleshow/124035107.cms",
            "description": "Nifty extended its winning streak, surpassing a key resistance level, but analysts foresee challenges around 25,500-25,670. Despite potential headwinds from US visa policy changes impacting the IT sector, technical indicators suggest a bullish outlook. Experts advise traders to capitalize on dips, highlighting Samman Capital and Piramal Pharma as potential buys with specific targets and stop-loss levels.",
            "pubDate": "2025-09-22T01:43:31.760344"
        },
        {
            "title": "Will Trump's H-1B visa fee hike sink Indian IT stocks?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-trumps-h-1b-visa-fee-hike-sink-indian-it-stocks/articleshow/124035081.cms",
            "description": "Indian IT stocks are expected to face a sell-off following President Trump's increase in H-1B visa costs, potentially impacting profitability and prompting companies to rethink hiring strategies. While larger firms may manage, mid-tier companies heavily reliant on new visas could experience a sharper impact.",
            "pubDate": "2025-09-22T01:43:31.760437"
        },
        {
            "title": "Consumer services, IT, power see sharp FII outflows in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/consumer-services-it-power-see-sharp-fii-outflows-in-september/articleshow/124032126.cms",
            "description": "Foreign investors turned net sellers in the first half of September, offloading shares in consumer services, IT, and power sectors due to concerns over profitability and rising costs. Financial services saw renewed interest, driven by attractive valuations in state-owned lenders. Automobiles, capital goods, and metals & mining also attracted inflows, but overall, foreign investors remained cautious amid global uncertainty.",
            "pubDate": "2025-09-22T01:43:31.760656"
        }
    ]
}