{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-27T04:44:45.609275",
    "items": [
        {
            "title": "Fed faces data void ahead of key US rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-faces-data-void-ahead-of-key-us-rate-decision/slideshow/124839871.cms",
            "description": "The Federal Reserve is widely expected to announce its second rate cut of the year on Wednesday, even as policymakers face an unusual challenge — making decisions without key economic data. A prolonged government shutdown has halted the release of vital indicators, leaving officials to assess the economy with limited visibility. (Source: AFP)",
            "pubDate": "2025-10-27T04:44:23.580622"
        },
        {
            "title": "China’s industrial profits surge again, offering fresh signs of recovery",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-industrial-profits-surge-again-offering-fresh-signs-of-recovery/slideshow/124839697.cms",
            "description": "China’s manufacturing sector showed renewed strength as industrial profits rose for the second consecutive month, raising hopes that the world’s second-largest economy may finally be stabilising after months of uneven growth. (Source: Reuters)",
            "pubDate": "2025-10-27T04:44:23.580759"
        },
        {
            "title": "Sammaan Capital among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sammaan-capital-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124839479.cms",
            "description": "As of October 24, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-27T04:44:23.580870"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124839371.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-10-27T04:44:23.580972"
        },
        {
            "title": "Jayaswal Neco Industries, Sammaan Capital among 9 stocks flashing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jayaswal-neco-industries-sammaan-capital-among-9-stocks-flashing-bullish-signals/slideshow/124839399.cms",
            "description": "On October 24, in the Nifty200 pack, nine stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-10-27T04:44:23.581073"
        },
        {
            "title": "Sensex rises over 450 pts, Nifty above 25,900 as US rate cut optimism lifts mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-250-pts-nifty-above-25850-as-us-rate-cut-optimism-lifts-mood/articleshow/124839293.cms",
            "description": "Indian equities surged on Monday, with the Sensex and Nifty rebounding after a brief pause. This upward movement was driven by softer-than-expected U.S. inflation data, which has fueled expectations of two additional interest rate cuts in 2025.",
            "pubDate": "2025-10-27T04:44:23.581204"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains underweight on Dixon Technologies; Elara recommends Accumulate on Kotak Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-underweight-on-dixon-technologies-elara-recommends-accumulate-on-kotak-bank/articleshow/124839212.cms",
            "description": "Brokerages show mixed sentiment on select stocks, with Elara Capital favoring Kotak Mahindra Bank and Coforge due to growth prospects. Conversely, Morgan Stanley is cautious on Dixon Technologies, citing increased competition from Chinese EMS players. This selective optimism highlights the market's focus on earnings visibility and competitive strength.",
            "pubDate": "2025-10-27T04:44:23.581306"
        },
        {
            "title": "Coforge shares rally 6% after Q2 net profit rockets 86% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-shares-in-focus-after-q2-net-profit-rockets-86-yoy-to-rs-376-crore-should-you-buy-sell-or-hold/articleshow/124839253.cms",
            "description": "Coforge's stock took off following impressive quarterly performance. The IT services company enjoyed an 86% increase in net profit alongside a 32% revenue boost. Analysts are upbeat, with several brokerages not only holding onto their buy ratings but also increasing target prices. The company’s robust order book, paired with management’s reassurances on growth, points to exciting opportunities on the horizon.",
            "pubDate": "2025-10-27T04:44:23.581404"
        },
        {
            "title": "6 IPOs to open subscription this week. GMPs suggest investors could bag returns up to 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/6-ipos-to-open-subscription-this-week-gmps-suggest-investors-could-bag-returns-up-to-17/slideshow/124839208.cms",
            "description": "India’s primary market is buzzing again as six IPOs hit the Street this week, together aiming to raise over Rs 1,800 crore across mainboard and SME platforms. From consumer names like Lenskart to smaller logistics and textile firms, investors have a range of options to pick from.",
            "pubDate": "2025-10-27T04:44:23.581500"
        },
        {
            "title": "Dr Reddy’s Laboratories shares fall over 1% on Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-laboratories-shares-in-focus-post-q2-results-should-you-buy-sell-or-hold/articleshow/124839110.cms",
            "description": "Despite an uptick in profits, Dr Reddy's Laboratories experienced a decline in share value. Analysts continue to express optimism, keeping a bullish outlook on the stock. While there are immediate hurdles to navigate, promising catalysts for growth lie ahead, notably with the anticipated launches of Semaglutide and Abatacept.",
            "pubDate": "2025-10-27T04:44:23.581599"
        },
        {
            "title": "Nifty Capital Markets index tops all sectors with 30% 1-yr rally. BSE, king of good times with 70% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-capital-markets-index-tops-all-sectors-with-30-1-yr-rally-bse-king-of-good-times-with-70-gains/articleshow/124839072.cms",
            "description": "Indian capital market stocks have shown remarkable performance, delivering up to 70% returns in the past year. This surge is attributed to increased financialization and digitalization of assets. Growing investor participation and robust trading volumes have benefited exchanges and brokers. While some stocks lagged, the overall outlook remains constructive for the sector.",
            "pubDate": "2025-10-27T04:44:23.581692"
        },
        {
            "title": "Kotak Mahindra Bank shares fall 3% after Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-post-q2-results-should-you-buy-sell-or-hold/articleshow/124839025.cms",
            "description": "Kotak Mahindra Bank shares: The bank’s Q2FY26 standalone net profit fell 2.3% YoY to ₹3,253 crore, even as NII rose 4% to ₹7,311 crore. NIM stood at 4.54% with a 4.70% cost of funds, while operating profit increased 3% YoY to ₹5,268 crore.",
            "pubDate": "2025-10-27T04:44:23.581787"
        },
        {
            "title": "Retail investors are shorting the structural story of auto stocks after GST windfall. What's happening?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-are-shorting-the-structural-story-of-auto-stocks-after-gst-windfall-whats-happening/articleshow/124838944.cms",
            "description": "Retail investors are showing caution towards Indian auto stocks despite GST reforms boosting festive sales. While mutual funds are buying, individual investors are trimming holdings, mirroring some foreign investor sentiment. Analysts suggest concerns about demand sustainability post-festivals and high valuations are driving this divergence, though long-term structural benefits from GST remain.",
            "pubDate": "2025-10-27T04:44:23.581880"
        },
        {
            "title": "AI is Reliance's new oil: How Mukesh Ambani's tech pivot could unlock $30 billion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-is-reliances-new-oil-how-mukesh-ambanis-tech-pivot-could-unlock-30-billion/articleshow/124838870.cms",
            "description": "Mukesh Ambani is steering Reliance Industries towards artificial intelligence, investing $15 billion in a bold tech pivot. This strategic shift aims to transform the conglomerate into a deep-tech powerhouse, potentially valued at $30 billion. Reliance is building AI infrastructure and partnering with tech giants like Meta and Google, while also developing its own AI products.",
            "pubDate": "2025-10-27T04:44:23.581975"
        },
        {
            "title": "Cochin Shipyard among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cochin-shipyard-among-5-stocks-showing-bullish-rsi-upswing/slideshow/124838213.cms",
            "description": "On October 24, in the Nifty200 pack, five stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-27T04:44:23.582067"
        },
        {
            "title": "Japan's Nikkei tops 50,000 mark for first time on stimulus euphoria",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-tops-50000-mark-for-first-time-on-stimulus-euphoria/articleshow/124838017.cms",
            "description": "Japan's Nikkei share average crossed the 50,000 mark for the first time on Monday. This milestone follows successive records driven by expectations of significant spending from the new prime minister, Sanae Takaichi. Investors are reacting positively to Takaichi's growth-focused policies and anticipated economic stimulus packages. The market has seen a strong upward trend since mid-July.",
            "pubDate": "2025-10-27T04:44:23.582177"
        }
    ]
}