{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-17T15:37:53.392240",
    "items": [
        {
            "title": "How are Indian IT giants navigating AI demands and tariff uncertainty?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/how-are-indian-it-giants-navigating-ai-demands-and-tariff-uncertainty/articleshow/124617925.cms",
            "description": "Indian IT exporters are demonstrating strong deal wins, adapting to AI-driven client demands amidst a challenging business environment. Despite uncertainties, companies are strategically integrating AI, bolstering their pipelines and showing resilience. Improved hiring and a weaker rupee are expected to support performance in the latter half of the fiscal year.",
            "pubDate": "2025-10-17T01:00:40.557556"
        },
        {
            "title": "Wipro shares plunge over 4% after Q2 results miss Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-shares-in-focus-after-marginal-rise-in-q2-profit-missing-street-estimates/articleshow/124619330.cms",
            "description": "Wipro's stock saw a significant fall after its Q2 FY26 financial results failed to meet market expectations. The IT services firm reported a modest profit increase year-on-year, but it was below analyst predictions. Revenue also saw a slight rise. Following the announcement, brokerage Motilal Oswal reiterated its 'Sell' recommendation on Wipro shares.",
            "pubDate": "2025-10-17T04:33:39.935954"
        },
        {
            "title": "RIL Q2 results today: 10 things to track as investors nurse Rs 1.8 lakh crore loss after Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q2-results-today-10-things-to-track-as-investors-nurse-rs-1-8-lakh-crore-loss-after-q1/articleshow/124619189.cms",
            "description": "Reliance Industries will announce its September quarter results today. Investors are keenly watching for key performance indicators. The company's stock has seen a significant drop after the previous quarter's results. Analysts are focused on revenue growth, segment performance, and cash flow trends. Updates on strategic initiatives like the Jio IPO are also anticipated.",
            "pubDate": "2025-10-17T04:33:39.936111"
        },
        {
            "title": "ICICI Bank Q2 Preview: Profit growth seen up to 8.5% YoY; NII may rise 10% as NIMs contract.  9 things to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q2-preview-profit-growth-seen-up-to-8-5-yoy-nii-may-rise-10-as-nims-contract-9-things-to-watch/articleshow/124621922.cms",
            "description": "ICICI Bank is expected to post up to 8.5% YoY profit growth in Q2, supported by steady loan and deposit momentum. However, margin compression and lower treasury gains may weigh on sequential performance, according to estimates from Nomura, Emkay, Axis Securities, and YES Securities.",
            "pubDate": "2025-10-17T06:46:17.502613"
        },
        {
            "title": "Sunteck Realty Q2 Results: Profit rises 41% YoY to Rs 48.96 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sunteck-realty-q2-results-profit-rises-41-yoy-to-rs-48-96-crore/articleshow/124621660.cms",
            "description": "Sunteck Realty has announced strong financial results. The company's net profit surged by 41 percent in the second quarter of this fiscal year. This impressive growth was driven by higher income. Total income also saw a significant rise compared to the same period last year. Sunteck Realty is a prominent real estate developer in India.",
            "pubDate": "2025-10-17T06:46:17.502741"
        },
        {
            "title": "Yes Bank Q2 Preview: Robust PAT growth of up to 41% YoY seen, NII expected to rise up to 7%. 9 things to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-q2-preview-robust-pat-growth-of-up-to-41-yoy-seen-nii-expected-to-rise-up-to-7-9-things-to-watch/articleshow/124621321.cms",
            "description": "Yes Bank is expected to post robust Q2 earnings with up to 41% YoY growth in PAT and a 4–7% rise in NII, driven by healthy loan and deposit growth. However, sequential performance may soften due to weaker treasury gains and margin pressure, analysts said.",
            "pubDate": "2025-10-17T06:46:17.502859"
        },
        {
            "title": "HDFC Bank Q2 results preview: PAT may grow up to 9% YoY, NII to rise up to 6% amid margin squeeze. 9 metrics to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q2-results-preview-pat-may-grow-up-to-9-yoy-nii-to-rise-up-to-6-amid-margin-squeeze-9-metrics-to-track/articleshow/124620821.cms",
            "description": "HDFC Bank is set to announce its Q2 earnings on October 18. Analysts predict a modest profit growth of up to 9% year-on-year. Net Interest Income is expected to rise between 3% and 6%. Margins may face pressure due to rising funding costs. Investors will watch for management commentary on deposit growth and future margin trends.",
            "pubDate": "2025-10-17T06:46:17.502966"
        },
        {
            "title": "JSW Steel Q2 Results: Cons PAT soars sharply by 307% YoY to Rs 1,646 crore, revenue jumps 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q2-results-cons-pat-soars-sharply-by-307-yoy-to-rs-1646-crore-revenue-jumps-12/articleshow/124625736.cms",
            "description": "JSW Steel Q2 Results: JSW Steel on Friday reported its results for the second quarter ended September 2025, posting an impressive 307% YoY surge in its consolidated profit after tax (PAT) at Rs 1,646 crore, while its revenue from operations recorded a 12% YoY growth.",
            "pubDate": "2025-10-17T09:57:17.445314"
        },
        {
            "title": "PVR Inox Q2 Results: Multiplex chain turns profitable, reports net profit of Rs 105 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pvr-inox-q2-results-multiplex-chain-turns-profitable-reports-net-profit-of-rs-105-crore/articleshow/124625189.cms",
            "description": "PVR Inox has turned profitable in the second quarter of FY26, reporting a net profit of Rs 10.55 crore. Revenue from operations saw a significant jump of 12.3%. The company's EBITDA also rose substantially, indicating improved operational efficiency. This positive performance marks a strong turnaround for the film exhibition giant.",
            "pubDate": "2025-10-17T09:57:17.445452"
        },
        {
            "title": "Polycab India Q2 Results: Cons PAT soars 56% YoY to Rs 693 crore, revenue up 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/polycab-india-q2-results-cons-pat-soars-56-yoy-revenue-up-18/articleshow/124624802.cms",
            "description": "Polycab India reported a strong Q2 FY26 with a 55.65% YoY surge in net profit to Rs 692.96 crore, driven by a 17.8% YoY revenue increase to Rs 6,477.21 crore. The Wires and Cables segment was the primary growth driver, while the FMEG division showed steady momentum despite challenges in the fan category.",
            "pubDate": "2025-10-17T09:57:17.445578"
        },
        {
            "title": "Billionaire Anil Agarwal's company makes Rs 1,000 crore profit from silver in 3 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/billionaire-anil-agarwals-company-makes-rs-1000-crore-profit-from-silver-in-3-months/articleshow/124626522.cms",
            "description": "Vedanta Group’s Hindustan Zinc Ltd (HZL) posted a consolidated profit after tax of Rs 2,649 crore in Q2 FY26, up 19% sequentially, driven largely by silver, which contributed nearly Rs 1,060 crore or 40% of total profits. Silver revenue rose 10% QoQ to Rs 1,706 crore, highlighting HZL’s strategic edge in precious metals alongside its core zinc business.",
            "pubDate": "2025-10-17T10:18:31.277761"
        },
        {
            "title": "Hindustan ZInc Q2 results: Cons PAT jumps 14% YoY to Rs 2,649 crore, revenue rises 3.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindustan-zinc-q2-results-cons-pat-jumps-14-yoy-to-rs-2649-crore-revenue-rises-3-5/articleshow/124626417.cms",
            "description": "Hindustan Zinc (HZL) reported a 14% YoY rise in Q2 net profit to Rs 2,649 crore, with revenue up 3.5% at Rs 8,282 crore. Zinc and lead sales drove growth, while silver and wind energy segments also contributed, boosting margins and overall profitability.",
            "pubDate": "2025-10-17T10:18:31.277892"
        },
        {
            "title": "AU Small Finance Bank  Q2 Results: Net profits slips 2% YoY to Rs 561 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/au-small-finance-bank-q2-results-net-profits-slips-2-yoy-to-rs-561-crore/articleshow/124628267.cms",
            "description": "AU Small Finance Bank on Friday reported a 2 per cent dip in net profit at Rs 561 crore for the second quarter ended September 30, 2025.",
            "pubDate": "2025-10-17T11:24:11.199366"
        },
        {
            "title": "Havells Q2 Results: Profit jumps 19% YoY to Rs 318 crore, revenue up 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/havells-q2-results-profit-jumps-19-yoy-to-rs-318-crore-revenue-up-5/articleshow/124628156.cms",
            "description": "Consumer electrical goods maker Havells India on Friday reported a 18.86 per cent increase in consolidated net profit to Rs 318.28 crore in the September quarter of 2025-26.",
            "pubDate": "2025-10-17T11:24:11.199490"
        },
        {
            "title": "IndusInd Bank Q2 Preview: Profit likely to fall sharply amid weak treasury income, MFI stress. 8 things to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-q2-preview-profit-to-likely-fall-sharply-amid-weak-treasury-income-mfi-stress-8-things-to-watch/articleshow/124627251.cms",
            "description": "IndusInd Bank is likely to post up to 82% YoY fall in Q2 FY26 profit as higher provisions, weak treasury income, and margin pressure weigh on performance. Brokerages see muted loan and deposit growth amid asset-quality concerns.",
            "pubDate": "2025-10-17T11:24:11.199622"
        },
        {
            "title": "RIL Q2 Results: Cons PAT jumps 10% YoY to Rs 18,165 crore, revenue rises by 10%, Jio ARPU rises to Rs 211.4",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q2-results-cons-pat-jumps-10-yoy-to-rs-18165-crore-revenue-rises-by-10/videoshow/124635629.cms",
            "description": "Mukesh Ambani-led Reliance Industries (RIL) on Friday reported a 10% year-on-year growth in its consolidated Q2 net profit at Rs 18,165 crore versus Rs 16,563 crore reported in the year-ago period. The profit after tax (PAT) is attributable to the owners of the company.The company's revenue form operations in the quarter under review stood at Rs 2.59 lakh crore, which was up 10% over Rs 2.35 lakh crore in the corresponding quarter of the last financial year.While PAT missed Street's estimate of Rs 18,643 crore, the topline beat estimates of Rs 2.51 lakh crore.The gross revenue for RIL stood at Rs 2.83 lakh crore which was also up 10% on a YoY basis.The company's Earning's Before Interest, Taxes, Depreciation and Amortisation (EBITDA) in the quarter under review stood at Rs 50,367 crore, up 15% YoY. The EBITDA margin was reported at 17.8%, gaining 80 bps over the corresponding quarter of the last financial year.",
            "pubDate": "2025-10-17T15:37:33.819386"
        },
        {
            "title": "India Cements logs profit of Rs 8.81 cr in Q2; to invest Rs 2,014 cr on expansion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-cements-logs-profit-of-rs-8-81-cr-in-q2-to-invest-rs-2014-cr-on-expansion/articleshow/124634681.cms",
            "description": "India Cements Ltd (ICL), now part of the Aditya Birla Group firm, on Friday reported a consolidated net profit of Rs 8.81 crore in the September quarter of FY26.",
            "pubDate": "2025-10-17T15:37:33.819530"
        },
        {
            "title": "REC Q2 Results: Net profit rises 9% YoY to Rs 4,414.93 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rec-q2-results-net-profit-rises-9-yoy-to-rs-4414-93-crore/articleshow/124634340.cms",
            "description": "State-owned REC Ltd on Friday posted an over 9 per cent year-on-year increase in net profit to Rs 4,414.93 crore in September quarter, on higher income.",
            "pubDate": "2025-10-17T15:37:33.819636"
        },
        {
            "title": "JSW Steel Q2 profit soars fourfold on record output and higher sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q2-profit-soars-fourfold-on-record-output-and-higher-sales/articleshow/124634192.cms",
            "description": "JSW Steel’s Q2 net profit surged over fourfold YoY to Rs 7,115 crore, driven by record production, higher sales volumes, and improved profitability, though it fell short of analysts’ estimates.",
            "pubDate": "2025-10-17T15:37:33.819736"
        },
        {
            "title": "Dalmia Bharat Q2 Results: Profit soars fivefold to Rs 239 crore on higher sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dalmia-bharat-q2-results-profit-soars-fivefold-to-rs-239-crore-on-higher-sales/articleshow/124633942.cms",
            "description": "Dalmia Bharat posted a fivefold rise in Q2 net profit to Rs 239 crore, driven by improved operating performance, higher sales volumes, steady costs, and favorable logistics, despite rising raw material and fuel expenses.",
            "pubDate": "2025-10-17T15:37:33.819834"
        },
        {
            "title": "LTTS Q2 Results: Profit rises 3% to Rs 328 crore; revenue up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ltts-q2-results-profit-rises-3-to-rs-328-crore-revenue-up-16/articleshow/124633699.cms",
            "description": "L&T Technology Services (LTTS) on Friday reported a 2.8 per cent increase in consolidated net profit to Rs 328.7 crore in the quarter ending September 2025.",
            "pubDate": "2025-10-17T15:37:33.819957"
        },
        {
            "title": "Reliance Retail Q2 Results: Profit jumps 22% YoY to Rs 3,457 crore; revenue up 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-retail-q2-results-profit-jumps-22-yoy-to-rs-3457-crore/articleshow/124632653.cms",
            "description": "Reliance Retail Q2 Results: Reliance Retail achieved strong results in the second quarter. Net profit rose 22% year-on-year. Revenues saw a 19% increase. The grocery and lifestyle businesses were key growth drivers. Festive buying and operational excellence contributed to the performance. Investments in stores and digital platforms also played a role. The company expects GST rate changes to boost consumption further.",
            "pubDate": "2025-10-17T15:37:33.820054"
        },
        {
            "title": "Reliance Jio Q2 Results: Profit rises 13% YoY to Rs 7,379 crore; ARPU at Rs 211.4",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-jio-q2-results-profit-rises-13-yoy-to-rs-7379-crore/articleshow/124632219.cms",
            "description": "Reliance Jio Q2 results: Reliance Jio reported a strong second quarter with a 13% year-on-year net profit growth to Rs 7,379 crore and a 15% revenue increase to Rs 36,332 crore. The company saw its average revenue per user (ARPU) rise to Rs 211.4, supported by increased customer engagement and a surge in data usage.",
            "pubDate": "2025-10-17T15:37:33.820152"
        },
        {
            "title": "Reliance Industries Q2 Results: Cons PAT jumps 10% YoY to Rs 18,165 crore, revenue rises by 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q2-results-cons-pat-jumps-10-yoy-to-rs-18165-crore-revenue-rises-by-10/articleshow/124632181.cms",
            "description": "Reliance Industries Q2 Results: Mukesh Ambani-led Reliance Industries (RIL) on Friday reported a 10% year-on-year growth in its consolidated Q2 net profit at Rs 18,165 crore versus Rs 16,563 crore reported in the year-ago period.",
            "pubDate": "2025-10-17T15:37:33.820249"
        },
        {
            "title": "JSW Energy Q2 Results: Cons PAT falls 17% YoY to Rs 705 crore but revenue climbs 60%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-energy-q2-results-cons-pat-falls-17-yoy-to-rs-705-crore-but-revenue-climbs-60/articleshow/124631534.cms",
            "description": "JSW Energy reported a 17% year-on-year fall in consolidated net profit to Rs 705 crore for Q2, despite a 60% revenue surge to Rs 5,177 crore. EBITDA increased by 67% YoY to Rs 3,180 crore, driven by renewable capacity additions. The company affirmed its healthy balance sheet and credit ratings, with installed capacity at 13.2 GW.",
            "pubDate": "2025-10-17T15:37:33.820347"
        },
        {
            "title": "Bank of India Q2 Results: Net profit rises 7% to Rs 2,554 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-india-q2-results-net-profit-rises-7-to-rs-2554-crore/articleshow/124629981.cms",
            "description": "State-owned Bank of India (BoI) on Friday reported a 7.6 per cent rise in net profit to Rs 2,554 crore in the September quarter of FY26.The bank posted a net profit of Rs 2,374 crore in the July-September quarter a year ago.",
            "pubDate": "2025-10-17T15:37:33.820449"
        },
        {
            "title": "Dixon Technologies Q2 Results: Cons PAT soars 72% YoY to Rs 670 crore, revenue up 29%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dixon-technologies-q2-results-cons-pat-soars-72-yoy-to-rs-670-crore-revenue-up-29/articleshow/124629402.cms",
            "description": "Dixon Technologies posted a 72% YoY rise in Q2 net profit to Rs 670 crore on strong operational growth. Revenue increased 29% to Rs 14,855 crore, while EBITDA surged 152% year-on-year to Rs 1,057 crore.",
            "pubDate": "2025-10-17T15:37:33.820545"
        },
        {
            "title": "Tata Tech Q2 Results: Profit rises 5% YoY to Rs 166 crore on non-core business boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-tech-q2-results-profit-rises-5-yoy-to-rs-166-crore-on-non-core-business-boost/articleshow/124628944.cms",
            "description": "Indian engineering firm Tata Technologies reported a 5% rise in second-quarter profit on Friday, as growth in its non-automotive business cushioned weakness in its key auto-focused segment",
            "pubDate": "2025-10-17T15:37:33.820638"
        }
    ]
}