{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-17T16:08:58.031882",
    "items": [
        {
            "title": "CCI, Deepak Fertilisers among 10 high-conviction stock ideas that can rally up to 67%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cci-deepak-fertilisers-among-10-high-conviction-stock-ideas-that-can-rally-up-to-67/slideshow/123343064.cms",
            "description": "InCred Capital has highlighted ten high-conviction ideas in the midcap and smallcap space, with potential upsides of up to 67%. The brokerage sees strong growth triggers across logistics, pharma, fertilisers, specialty chemicals, retail, packaging, and spirits, backed by sectoral demand and structural tailwinds. Here are the 10 stocks that InCred believes can deliver outsized returns.",
            "pubDate": "2025-08-17T06:46:38.941232"
        },
        {
            "title": "Mcap of five of 10 most valued firms climbs Rs 60,675.94 cr; SBI, HDFC Bank biggest winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-five-of-10-most-valued-firms-climbs-rs-60675-94-cr-sbi-hdfc-bank-biggest-winners/articleshow/123342727.cms",
            "description": "The market capitalization of five of the top ten firms increased last week. State Bank of India and HDFC Bank were the top gainers. Reliance Industries retained its position as the most valued firm. However, LIC, Bajaj Finance, ICICI Bank, TCS and Hindustan Unilever experienced a decline in market capitalization.",
            "pubDate": "2025-08-17T06:46:38.941364"
        },
        {
            "title": "FPIs dump Indian equities worth Rs 21,000 cr in first half of Aug",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-dump-indian-equities-worth-rs-21000-cr-in-first-half-of-aug/articleshow/123342668.cms",
            "description": "Foreign investors offloaded nearly Rs 21,000 crore in Indian equities in the first half of August, bringing the year's total outflow to Rs 1.16 lakh crore. Trade tensions, weak earnings, and a weakening rupee contributed to this trend. However, a potential credit rating upgrade and easing US-Russia tensions could improve FPI sentiment.",
            "pubDate": "2025-08-17T06:46:38.941460"
        },
        {
            "title": "China’s $11 trillion stock market is a headache for both Xi and Trump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-11-trillion-stock-market-is-a-headache-for-both-xi-and-trump/articleshow/123342543.cms",
            "description": "At the heart of why consumers in China save so much and spend so little, and why Xi Jinping and Donald Trump will struggle to change that behavior even if they want to, lies the country’s stock market.",
            "pubDate": "2025-08-17T06:46:38.941563"
        },
        {
            "title": "Market Trading Guide: Manappuram Finance and 1 midcap are stocks to buy on Monday. Up to 6% upside seen in near term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-manappuram-finance-and-1-midcap-are-stocks-to-buy-on-monday-up-to-6-upside-seen-in-near-term/slideshow/123342404.cms",
            "description": "India’s headline indices ended flat on Thursday amid selling pressure in auto, FMCG and metal stocks, though bank and IT counters put up a fight. Nifty witnessed a lackluster trading session, remaining range-bound ahead of the Trump–Putin meeting on Friday.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities, said that the overall sentiment is likely to favour bullish trades as long as the index holds above 24,337. “On the higher side, resistance is placed at 24,660 and 24,850, while a fall below 24,337 could trigger a resumption of the bearish trend,” De noted.Here are the 2 stock recommendations for Monday:",
            "pubDate": "2025-08-17T06:46:38.941663"
        },
        {
            "title": "RIL, Paytm among 5 stocks to buy this week with up to 56% upside potential. Check why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-paytm-among-5-stocks-to-buy-this-week-with-up-to-56-upside-potential-check-why/slideshow/123342346.cms",
            "description": "With a slew of positive triggers like PM Narendra Modi's announcement of GST reforms in the Independence Day speech and Trump-Putin's arriving at an \"understanding\" on the Russia-Ukraine war issue, markets are expected to trade positively this week, says Anuj Gupta, Director at Ya Wealth Global Research. Nifty also ended its 6-week's losing streak, says Gupta, who recommends 5 stocks to buy this week to capitalise on the current market momentum:",
            "pubDate": "2025-08-17T06:46:38.941758"
        },
        {
            "title": "These 10 Penny stocks surged up to 80% in just a month, do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-penny-stocks-surged-up-to-80-in-just-a-month-do-you-own-any/slideshow/123342165.cms",
            "description": "",
            "pubDate": "2025-08-17T06:46:38.941850"
        },
        {
            "title": "Trump-Putin talk, GST reform and FII action among 9 factors to impact stock markets this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-putin-talk-gst-reform-and-fii-action-among-9-factors-to-impact-stock-markets-this-week/articleshow/123342132.cms",
            "description": "Indian benchmark indices finally ended their six-week losing spree to end 1% higher every week. A host of important domestic and global events scheduled for the week are likely to impact stock markets when they resume trading on Monday.",
            "pubDate": "2025-08-17T06:46:38.941940"
        },
        {
            "title": "The Barbell Advantage: Positioning for stability and opportunity in Indian fixed income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-barbell-advantage-positioning-for-stability-and-opportunity-in-indian-fixed-income/articleshow/123344161.cms",
            "description": "The global fixed income backdrop is shifting as the US Federal Reserve looks poised to deliver its first rate cut of the current cycle this September. Markets place the odds of a 25 basis point cut at nearly certain levels, with the target fed funds range expected to move from 4.25–4.50% down to 4.00–4.25%.",
            "pubDate": "2025-08-17T09:28:58.863199"
        },
        {
            "title": "Sebi plans review of MTF margin rules to streamline risk management",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-plans-review-of-mtf-margin-rules-to-streamline-risk-management/articleshow/123343951.cms",
            "description": "Markets regulator Sebi is looking to review the margin framework under margin trading funding (MTF) in a bid to streamline risk management at clearing corporations.",
            "pubDate": "2025-08-17T09:28:58.863316"
        },
        {
            "title": "Watch August 21–22 for possible market trend shift: Harshubh Mahesh Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/watch-august-2122-for-possible-market-trend-shift-harshubh-mahesh-shah/articleshow/123343736.cms",
            "description": "The Indian market ended its six-week losing streak, with Nifty50 gaining over 1% for the week ended August 14. Key support and resistance levels, along with intraday time clusters, highlighted precise trading opportunities. Traders should watch August 18–22 for potential reversals or trend shifts, focusing on highlighted Nifty zones for decision-making.",
            "pubDate": "2025-08-17T09:28:58.863518"
        },
        {
            "title": "Rs 5.6 lakh crore shock! Tata crown jewel hits worst patch since 2008 crisis. Time to panic or buy the fear?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-5-6-lakh-crore-shock-tata-crown-jewel-hits-worst-patch-since-2008-crisis-time-to-panic-or-buy-the-fear/articleshow/123343296.cms",
            "description": "TCS faces its steepest decline since 2008, losing ₹5.6 lakh crore in market value as FIIs exit IT stocks amid weak demand and AI disruption. While Nifty IT plunges 25% in 2025, mutual funds raise stakes, seeing value in TCS’s reset valuations and strong dividend yield.",
            "pubDate": "2025-08-17T09:28:58.863614"
        },
        {
            "title": "Two Trades for Today: An IT bellwether for a 4.45% rise, a large-cap NBFC stock for an almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-it-bellwether-for-a-4-45-rise-a-large-cap-nbfc-stock-for-an-almost-7-gain/articleshow/123347237.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-08-17T16:08:56.644680"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/123345501.cms",
            "description": "The Indian market was closed for a national holiday on Friday. On Thursday, the Sensex and Nifty closed higher, breaking a six-week losing run driven by trade tensions and muted quarterly earnings, with gains in Infosys after it agreed to buy a stake in Australia’s Versent Group.",
            "pubDate": "2025-08-17T16:08:56.644812"
        }
    ]
}