{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-28T10:17:35.306683",
    "items": [
        {
            "title": "Volatility is temporary, fundamental tailwinds are permanent: 5 mid-cap pharma stocks with an upside potential of up to 46%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/volatility-is-temporary-fundamental-tailwinds-are-permanent-5-mid-cap-pharma-stocks-with-an-upside-potential-of-up-to-46/articleshow/114689041.cms",
            "description": "Official Action Indicated (OAI). Not many investors may have heard of this. But they would surely have felt its impact. For, the moment OAI is triggered, the stock price slips sharply. OAI is nothing but the technical term used to describe an action of the US FDA. After inspecting a pharma firm’s plant it may recommend regulatory and/or administrative actions, if needed. There was a time when one would hear of US FDA inspections on Indian pharma plants every second day. The OIA could include a recommendation to stop sourcing drugs from that plant – or some less severe action. This is still happening, but not as often as before. And thereby hangs a tale.",
            "pubDate": "2024-10-28T10:17:14.562046"
        },
        {
            "title": "BHEL shares zoom 10% on posting Rs 106 crore profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-shares-zoom-10-on-posting-rs-106-crore-profit/articleshow/114689224.cms",
            "description": "BHEL shares zoomed 10% after reporting a net profit of Rs 106 crore in Q2FY25, compared to a loss of Rs 63 crore in Q2FY24. Revenue from operations stood at Rs 6,584 crore, up 28% YoY. BHEL shares have nearly doubled in the last year, giving 94% returns. However, they have declined 6.5% and 1.6% in the last 6 months and 3 months, respectively.",
            "pubDate": "2024-10-28T10:17:14.562217"
        },
        {
            "title": "Indian Hotels, BEL among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-hotels-bel-among-5-stocks-with-short-buildup/slideshow/114687373.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of the underlying stock in the Futures and Options segment. This indicates that more traders are expecting the prices to decline and are creating short positions. In Monday's trading session, five stocks saw fresh short positions being built. Here's the list:",
            "pubDate": "2024-10-28T10:17:14.562320"
        },
        {
            "title": "How the 2024 US elections could impact the DXY and Indian markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-the-2024-us-elections-could-impact-the-dxy-and-indian-markets/articleshow/114686854.cms",
            "description": "The U.S. presidential election will impact the global economy. Policies by Trump and Harris will influence the DXY, Indian rupee, and stock markets. Trump's tax cuts and tariffs might affect global demand for dollars, while Harris's capital gains tax and energy policies could weaken the dollar, impacting India’s trade and investment landscape.",
            "pubDate": "2024-10-28T10:17:14.562417"
        },
        {
            "title": "DLF shares rally 8% after reporting 122% YoY jump in Q2 PAT. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dlf-shares-rally-8-after-reporting-122-yoy-jump-in-q2-pat-should-you-invest/articleshow/114686176.cms",
            "description": "Revenue from operations for the reported quarter reached Rs 1,975 crore, marking a 46% increase from Rs 1,348 crore in the same period last year. Sequentially, net profit rose 114% in the quarter, compared to Rs 646 crore in the previous quarter.",
            "pubDate": "2024-10-28T10:17:14.562516"
        },
        {
            "title": "European shares rise as key data and US tech earnings loom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-as-key-data-and-us-tech-earnings-loom/articleshow/114685795.cms",
            "description": "European Central Bank Vice President Luis de Guindos' speech is due later in the day. Sweden's preliminary GDP figures and September retail sales are set to be released on Tuesday.",
            "pubDate": "2024-10-28T10:17:14.562616"
        },
        {
            "title": "Dr. Reddy’s shares trade ex-split today. Stock up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-shares-trade-ex-split-today-stock-up-2/articleshow/114685403.cms",
            "description": "The company further announced that each American Depositary Share (ADS) will continue to represent one equity share. Consequently, the number of ADSs held by each American Depositary Receipt holder will increase in line with the rise in equity shares.",
            "pubDate": "2024-10-28T10:17:14.562715"
        },
        {
            "title": "Waaree Energies: Early birds Madhu Kela, Ravi Dharamshi make multibagger returns in solar play",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-early-birds-madhu-kela-ravi-dharamshi-make-multibagger-returns-in-solar-play/articleshow/114685032.cms",
            "description": "Top investors, including Madhusudhan Kela and Ravi Dharamshi, have achieved significant returns on Waaree Energies, which listed at a premium on its IPO day. Despite initial investment challenges in 2021, the company's strong market position and favorable industry trends are expected to sustain future demand and returns.",
            "pubDate": "2024-10-28T10:17:14.562815"
        },
        {
            "title": "SpiceJet shares up 4% on launching 32 new flights to expand domestic, international connectivity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-up-4-on-launching-32-new-flights-to-expand-domestic-international-connectivity/articleshow/114682371.cms",
            "description": "SpiceJet Shares Price: SpiceJet shares rose 4.2% after announcing 32 new flights for winter, enhancing connectivity. The airline aims to improve customer experience with increased frequencies and routes.",
            "pubDate": "2024-10-28T10:17:14.562910"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 46%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-46/articleshow/114681007.cms",
            "description": "More than the Nifty and Sensex taking a beating, what has been bothering the street and worrying investors is the lack of market breadth these past few days. The risk of the situation getting worse if the indices remain under pressure is high. Also, with valuations still on the higher side, any recovery may take a while. In such a situation, what should bother you more? What happens in the market over the next few days or months? Or how a business is going to pan out? The business, of course. So here are select stocks that depict a strong upward trajectory in their overall average score which is based on five key pillars – earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2024-10-28T10:17:14.563001"
        },
        {
            "title": "Real estate developers raises Rs 12,801 crore via QIP this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/real-estate-developers-raises-rs-12801-crore-via-qip-this-year/articleshow/114680761.cms",
            "description": "The real estate sector raised Rs 12,801 crore via QIPs in 2024, reflecting strong investor confidence and robust post-pandemic recovery, with residential sales value increasing significantly.",
            "pubDate": "2024-10-28T10:17:14.563094"
        },
        {
            "title": "Nuvama Wealth Management Q2 revenue jumps 50%, operating PAT rises 77%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-wealth-management-q2-revenue-jumps-50-operating-pat-rises-77/articleshow/114680543.cms",
            "description": "Nuvama Wealth Management reported a 50% revenue increase to Rs 740 crore, with strong growth in wealth and asset management, and an optimistic outlook for India's economic future.",
            "pubDate": "2024-10-28T10:17:14.563191"
        },
        {
            "title": "Coal India shares tumble nearly 6% after Q2 PAT falls 22% YoY. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-shares-tumble-nearly-6-after-q2-pat-falls-22-yoy-should-you-invest/articleshow/114679344.cms",
            "description": "Coal India shares fell 5.6% after reporting a 22% profit decline. Analysts maintained buy ratings with revised target prices, citing challenges but a positive long-term outlook for coal demand.",
            "pubDate": "2024-10-28T10:17:14.563284"
        },
        {
            "title": "Waaree Energies shares drop 10% post listing. Should you buy them?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-drop-10-post-listing/articleshow/114679228.cms",
            "description": "Shares of Waaree Energies plunge nearly 10% post-debut as stock lists at a premium on BSE. The IPO received high investor interest, being subscribed 76 times. Funds from the IPO will be used to expand manufacturing capacity in India and the US.",
            "pubDate": "2024-10-28T10:17:14.563379"
        },
        {
            "title": "Reliance Industries shares turn ex-bonus today. Here's what shareholders need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-turn-ex-bonus-today-heres-what-shareholders-need-to-know/articleshow/114678488.cms",
            "description": "Reliance Share Price: Reliance Industries shares turned ex-bonus today with a 1:1 issue, marking its sixth and largest in Indian history. The stock has surged nearly 270% since the last bonus in 2017.",
            "pubDate": "2024-10-28T10:17:14.563473"
        },
        {
            "title": "HSBC cuts Ola’s target price to Rs 110, sees slower e2W penetration, service issues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-cuts-olas-target-price-to-rs-110-sees-slower-e2w-penetration-service-issues/articleshow/114677559.cms",
            "description": "HSBC lowered Ola Electric's target price to Rs 110, citing slower e2W penetration and service issues, yet maintains a ‘buy’ rating due to potential in EV growth and battery technology.",
            "pubDate": "2024-10-28T10:17:14.563566"
        }
    ]
}