{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-07T12:41:22.056244",
    "items": [
        {
            "title": "FII bears have never been this harsh on Nifty, but that may be the buy signal! Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-bears-have-never-been-this-harsh-on-nifty-but-that-may-be-the-buy-signal-heres-why/articleshow/124352568.cms",
            "description": "Foreign investors have sold a record $18 billion in Indian equities, with Nifty futures positioning collapsing to near all-time lows. However, market veterans suggest this extreme pessimism could signal a contrarian opportunity for a near-term rebound. Domestic investors remain confident, providing crucial support amidst global uncertainties and valuation concerns.",
            "pubDate": "2025-10-07T03:43:10.129444"
        },
        {
            "title": "Zydus Lifesciences shares in focus after 2 regulatory approvals from Health Canada, USFDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-shares-in-focus-after-2-regulatory-approvals-from-health-canada-usfda/articleshow/124352535.cms",
            "description": "Zydus Life shares: Zydus Lifesciences received regulatory approvals from Health Canada for generic Liothyronine tablets and from the USFDA for Deflazacort oral suspension, expanding its portfolio and supporting global operations in Canada and the U.S.",
            "pubDate": "2025-10-07T03:43:10.129582"
        },
        {
            "title": "Fortis Healthcare, BSE, and 5 other stocks showing Bullish Candlestick Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fortis-healthcare-bse-and-5-other-stocks-showing-bullish-candlestick-pattern/slideshow/124352224.cms",
            "description": "Seven stocks from the Nifty200 pack came to the bullish scanner of \"White Marubozu\" on October 6, according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-10-07T03:43:10.129715"
        },
        {
            "title": "Adani Green Energy shares in focus after $250 million foreign currency loan deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-energy-shares-in-focus-after-250-million-foreign-currency-loan-deal/articleshow/124352463.cms",
            "description": "Adani Green share price: Adani Green Energy has secured a $250 million foreign currency loan from a consortium of global banks, including DBS and DZ Bank, to refinance existing debt. The five-year facility at an 8.2% interest rate aligns with the group’s strategy to reduce leverage and manage funding costs.",
            "pubDate": "2025-10-07T03:43:10.129821"
        },
        {
            "title": "LTIMindtree among 8 stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ltimindtree-among-8-stocks-showing-bullish-rsi-upswing/slideshow/124352114.cms",
            "description": "Eight stocks from the NSE largecap pack were highlighted in the RSI Trending Up scan on October 8, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-07T03:43:10.129924"
        },
        {
            "title": "Stocks to buy in 2025 for long term: GHCL, Indigo among 5 stocks that could give 19-49% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-ghcl-indigo-among-5-stocks-that-could-give-19-49-return/slideshow/124352019.cms",
            "description": "Brokerages remain upbeat on select stocks across sectors, highlighting a mix of strong fundamentals, earnings visibility, and favorable industry dynamics for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-07T03:43:10.130025"
        },
        {
            "title": "Sodhani Capital IPO: Strong subscription, but listing may stay flat with no GMP premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sodhani-capital-ipo-strong-subscription-but-listing-may-stay-flat-with-no-gmp-premium/articleshow/124351902.cms",
            "description": "Sodhani Capital shares will debut on the BSE SME platform on October 7. The Jaipur-based firm's IPO saw strong investor demand, subscribing 4.79 times. Proceeds will fund office acquisition, brand building, and technology development. Sodhani Capital focuses on mutual fund distribution, serving retail and HNI clients. The company aims to expand its digital presence and app development post-listing.",
            "pubDate": "2025-10-07T03:43:10.130127"
        },
        {
            "title": "Om Metallogic shares to debut today. Muted GMP, moderate subscription suggest tepid listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/om-metallogic-shares-to-debut-today-muted-gmp-moderate-subscription-suggest-tepid-listing/articleshow/124351869.cms",
            "description": "Om Metallogic, a metal processing company focused on recycling, is set to list on the BSE SME platform on October 7. The company's Rs 22.35 crore IPO saw a subscription of 1.47 times, with retail investors showing the most interest. Ahead of its debut, the grey market premium is near zero, indicating a flat opening.",
            "pubDate": "2025-10-07T03:43:10.130224"
        },
        {
            "title": "Vijaypd Ceutical IPO: Modest response and flat GMP ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijaypd-ceutical-ipo-modest-response-and-flat-gmp-ahead-of-listing/articleshow/124351844.cms",
            "description": "Vijaypd Ceutical's NSE SME debut on October 7 sees muted investor expectations with a near-zero grey market premium, suggesting a listing close to its Rs 35 issue price. The Rs 19.25 crore IPO saw moderate subscription, primarily driven by non-institutional investors, indicating cautious sentiment amid a surge of SME listings.",
            "pubDate": "2025-10-07T03:43:10.130319"
        },
        {
            "title": "Ashish Kacholia and Mukul Agrawal-backed Suba Hotels IPO listing today. Check GMP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-and-mukul-agrawal-backed-suba-hotels-ipo-listing-today-check-gmp/articleshow/124351799.cms",
            "description": "Suba Hotels is set to list on the NSE SME platform on October 7. The company's Rs 75 crore IPO saw strong investor demand, with a subscription of 15.33 times. The grey market premium indicates a positive debut. Suba Hotels operates 88 hotels across 50 cities. Funds raised will support hotel upgrades and expansion plans.",
            "pubDate": "2025-10-07T03:43:10.130421"
        },
        {
            "title": "Dhillon Freight Carrier IPO listing. Muted GMP points to a steady debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dhillon-freight-carrier-ipo-listing-muted-gmp-points-to-a-steady-debut/articleshow/124351744.cms",
            "description": "Dhillon Freight Carrier is listing on the BSE SME platform on October 7. The company completed a Rs 10.08 crore IPO. Retail investors showed strong interest. The stock may list near its issue price. Dhillon Freight offers logistics solutions across several Indian states. The IPO funds will help expand its fleet and operations.",
            "pubDate": "2025-10-07T03:43:10.130520"
        },
        {
            "title": "Positive Breakout: These 9 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-close-cross-above-their-200-dmas/slideshow/124351480.cms",
            "description": "In the Nifty200 pack, nine stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 6, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-07T03:43:10.130615"
        },
        {
            "title": "US stock market keeps setting records as AI excitement keeps building",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-market-keeps-setting-records-as-ai-excitement-keeps-building/articleshow/124351410.cms",
            "description": "Wall Street reached new highs, driven by AI enthusiasm, with AMD soaring after an OpenAI chip deal. Concerns about inflated AI valuations persist as OpenAI expands its infrastructure partnerships. Meanwhile, international markets reacted to political shifts, with Japanese stocks rising and French stocks falling.",
            "pubDate": "2025-10-07T03:43:10.130725"
        },
        {
            "title": "S&P 500, Nasdaq reach all-time closing highs on AI dealmaking boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-reach-all-time-closing-highs-on-ai-dealmaking-boost/articleshow/124351334.cms",
            "description": "Indian markets saw a boost from global trends. The S&P 500 and Nasdaq touched record highs driven by artificial intelligence deals. AMD's partnership with OpenAI fueled this surge. Despite a US government shutdown, investor sentiment remained strong for AI-related companies. Upcoming earnings reports and economic data will be closely watched.",
            "pubDate": "2025-10-07T03:43:10.130823"
        },
        {
            "title": "Japan's Nikkei hits record high as chip-related stocks track US peers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-hits-record-high-as-chip-related-stocks-track-us-peers/articleshow/124351318.cms",
            "description": "Japan's Nikkei stock market reached an all-time peak on Tuesday. Chip-related stocks mirrored gains seen in the United States. However, the index saw its rise diminish as excitement surrounding a potential new leader of the ruling party cooled. Investors had previously bet on increased spending and loose monetary policy.",
            "pubDate": "2025-10-07T03:43:10.130915"
        },
        {
            "title": "Axis Securities bullish on RBL Bank: Cup & Handle pattern in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-bullish-on-rbl-bank-cup-handle-pattern-in-focus/videoshow/124344631.cms",
            "description": "“RBL Bank's stock chart is painting an intriguing picture, showing signs of a classic \"Cup with Handle\" pattern—a bullish signal that often hints at a potential upward surge. Traders can buy for a target of Rs 310 in the next few weeks,” Rajesh Palviya, Senior Vice President – Research (Head Technical & Derivatives), Axis Securities, said.",
            "pubDate": "2025-10-07T03:43:10.131010"
        },
        {
            "title": "Sensex jumps over 150 pts, Nifty tops 25,100 as D-St opens in green for day 4; financials, oil & gas stock rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-150-pts-nifty-tops-25100-as-d-st-opens-in-green-for-day-4-financials-stock-rally/articleshow/124352824.cms",
            "description": "Indian stocks opened higher on Tuesday, extending their winning streak to a fourth session. The Sensex and Nifty saw gains, driven by strong performance in financial and oil & gas sectors. Positive sentiment was fueled by the central bank's new lending reforms and encouraging company business updates.",
            "pubDate": "2025-10-07T04:00:33.009130"
        },
        {
            "title": "Buy, Sell or Hold: Antique recommends a buy on Trent; Nuvama raises target price on Electronics Mart",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-antique-recommends-a-buy-on-trent-nuvama-raises-target-price-on-electronics-mart/articleshow/124352748.cms",
            "description": "Brokerages remain bullish on Trent, Star Health, and Electronics Mart India, citing strong earnings visibility, expanding retail presence, margin recovery, and resilient consumer demand, with upside potential ranging from 15% to 47%.",
            "pubDate": "2025-10-07T04:00:33.009284"
        },
        {
            "title": "Trent shares slide 4% after weaker-than-expected Q2 business update. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-shares-slide-4-after-weaker-than-expected-q2-business-update-should-you-buy-sell-or-hold/articleshow/124353459.cms",
            "description": "Trent shares: The Tata Group firm posted a 17% year-on-year (YoY) rise in standalone revenue for the June quarter, reaching ₹5,002 crore compared to ₹4,260 crore in the same period last year. During the quarter, it also launched 40 Zudio stores and 13 Westside outlets.",
            "pubDate": "2025-10-07T04:57:24.063890"
        },
        {
            "title": "Fabtech Technologies shares list flat at IPO price of Rs 191 on exchanges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fabtech-technologies-shares-list-flat-at-ipo-price-of-rs-191-on-bse-nse/articleshow/124353323.cms",
            "description": "Fabtech Technologies debuted on the NSE and BSE at its IPO price of Rs 191 per share, aligning with grey market expectations. The company, a biopharma engineering firm specializing in turnkey projects, saw a 2.04x subscription, reflecting investor confidence in its growth story.",
            "pubDate": "2025-10-07T04:57:24.064011"
        },
        {
            "title": "Political shift spurs Yen weakness, markets anticipate stimulus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/political-shift-spurs-yen-weakness-markets-anticipate-stimulus/slideshow/124353559.cms",
            "description": "Finance Minister Katsunobu Kato emphasised the importance of stable currency movements that reflect economic fundamentals. He assured that the government will closely monitor the foreign exchange market to prevent excessive fluctuations and disorderly movements. Kato’s comments signal a cautious approach toward the yen’s recent weakness. (Source: Reuters)",
            "pubDate": "2025-10-07T04:57:24.064129"
        },
        {
            "title": "5 Nifty stocks with fresh buy calls that could offer up to 19% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-nifty-stocks-with-fresh-buy-calls-that-could-offer-up-to-19-return/slideshow/124353397.cms",
            "description": "Brokerages have turned bullish on select large-cap stocks this week, issuing fresh buy calls with potential upsides of up to 19%. The list includes names from automobiles, defense, infra, and finance—sectors that continue to drive Nifty’s momentum.",
            "pubDate": "2025-10-07T04:57:24.066584"
        },
        {
            "title": "LG & Tata Capital scream for attention in a crowded IPO market. Which is a better investment for you?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-tata-capital-scream-for-attention-in-a-crowded-ipo-market-which-is-a-better-investment-for-you/articleshow/124353264.cms",
            "description": "LG Electronics India and Tata Capital have launched significant IPOs, collectively worth over Rs 27,000 crore, creating a competitive investment landscape. While Tata Capital aims to bolster its lending business, LG Electronics India, a market leader in home appliances, is drawing investor attention with its strong financials and brand power.",
            "pubDate": "2025-10-07T04:57:24.066706"
        },
        {
            "title": "LTIMindtree shares in focus after clinching largest multi-year deal in its history",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ltimindtree-shares-in-focus-after-clinching-largest-multi-year-deal-in-its-history/articleshow/124353113.cms",
            "description": "LTIMindtree shares: LTIMindtree secured its largest-ever multi-year deal, valued at $580 million, with a global media and entertainment company to drive digital transformation. The announcement comes alongside strong Q1FY26 results, with 11% net profit growth and rising investor interest in the stock.",
            "pubDate": "2025-10-07T04:57:24.066807"
        },
        {
            "title": "Euro Stoxx 50 year-end target set at 5,800 by J.P. Morgan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/euro-stoxx-50-year-end-target-set-at-5800-by-j-p-morgan/slideshow/124353332.cms",
            "description": "J.P. Morgan has upgraded its stance on eurozone equities to “overweight” from neutral. Strategists, led by Mislav Matejka, highlighted that the region’s equities have become more attractive following months of underperformance and strong policy support. Since the first-quarter rally, the Euro Stoxx 50 has lagged the S&P 500 by nearly 18%, presenting a potential buying opportunity. (Source: Reuters)",
            "pubDate": "2025-10-07T04:57:24.066905"
        },
        {
            "title": "Aster DM Healthcare shares in focus as BSE, NSE clear merger with Quality Care India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aster-dm-healthcare-shares-in-focus-as-bse-nse-clear-merger-with-quality-care-india/articleshow/124352941.cms",
            "description": "Shares of Aster DM Healthcare may attract investor attention on October 7 after receiving no-objection letters from BSE and NSE for its merger with Quality Care India Ltd (QCIL). The board-approved scheme will amalgamate QCIL into Aster, subject to statutory and shareholder approvals. This regulatory clearance is a key step in the integration, aligning with SEBI’s listing norms and circulars on schemes of arrangement.",
            "pubDate": "2025-10-07T04:57:24.067003"
        },
        {
            "title": "Brigade Enterprises shares in focus after signing JDA for Rs 1,000 crore premium housing project in West Chennai",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brigade-enterprises-shares-in-focus-after-signing-jda-for-rs-1000-crore-premium-housing-project-in-west-chennai/articleshow/124352908.cms",
            "description": "Brigade Enterprises shares: Brigade Enterprises has signed a JDA for a 6.6-acre land parcel in West Chennai to develop a premium residential project with an estimated GDV of ₹1,000 crore. The project, featuring modern, ESG-compliant homes, will launch in 2026, strengthening the company’s presence in a key growth market.",
            "pubDate": "2025-10-07T04:57:24.067118"
        },
        {
            "title": "Reliance Power, Reliance Infrastructure shares in focus after Sebi issues show cause",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-reliance-infrastructure-shares-in-focus-after-sebi-issues-show-cause/articleshow/124352890.cms",
            "description": "Reliance Power and Reliance Infrastructure received Sebi Show Cause Notices related to CLE Private Limited, though both companies maintain no ongoing exposure, following earlier settlements and disclosures in this high-value regulatory case.",
            "pubDate": "2025-10-07T04:57:24.067216"
        },
        {
            "title": "KIOCL, Poonawalla Fincorp among 9 stocks witnessing a 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kiocl-poonawalla-fincorp-among-9-stocks-witnessing-a-5-year-swing-high-breakout/slideshow/124352854.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1000 crore, nine stocks witnessed a 5-year swing high at the close on October 6, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-10-07T04:57:24.067413"
        },
        {
            "title": "Tata Motors’ stock gains 7% in a week. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-stock-gains-7-in-a-week-should-you-buy-sell-or-hold/articleshow/124353989.cms",
            "description": "Tata Motors shares are trading at a four-month high, showing technical strength. However, the company faces challenges from JLR production issues and potential US tariffs. Analysts are divided on the stock's future. Investors are advised to watch for a breakout above Rs 740 or sustained moves beyond key averages before making investment decision.",
            "pubDate": "2025-10-07T05:16:29.674518"
        },
        {
            "title": "Hospital overcapacity fears overblown, says Jefferies; backs Max Health",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hospital-overcapacity-fears-overblown-says-jefferies-backs-max-health/articleshow/124353704.cms",
            "description": "Jefferies says planned expansions by leading hospital chains will not cause overcapacity in India, citing strong demand and low bed density compared to global standards. With about 32,000 beds to be added, the brokerage is bullish on Max Health, citing attractive valuations and robust growth prospects amid rising healthcare demand.",
            "pubDate": "2025-10-07T05:16:29.674648"
        },
        {
            "title": "For those with ability to think & invest beyond 2 years: 9 mid-caps from different sectors with upside potential of more than 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-those-with-ability-to-think-invest-beyond-2-years-9-mid-caps-from-different-sectors-with-upside-potential-of-more-than-23/articleshow/124357165.cms",
            "description": "As tailwinds of reforms bring in a better operating environment for the bulls, it is probably time to look at the mid-cap segment with a more bullish bias. Yes, they may appear to be more risky, but the risk of investing in mid-cap stocks can be reduced. The thing you need to do to reduce risk is to use a combination of both quantitative and qualitative criteria to assess stocks.",
            "pubDate": "2025-10-07T08:14:26.520307"
        },
        {
            "title": "Nykaa shares surge 9% in 2 days to hit new 52-week high after strong Q2FY26 update",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-shares-surge-9-in-2-days-to-hit-new-52-week-high-after-strong-q2fy26-update/articleshow/124356229.cms",
            "description": "Nykaa shares hit a 52-week high as Q2 FY2026 update showed strong momentum, with beauty and fashion verticals driving consolidated GMV and net revenue growth in the mid-twenties.",
            "pubDate": "2025-10-07T08:14:26.520436"
        },
        {
            "title": "These 27 stocks from 6 sectors are Motilal Oswal's top picks. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-27-stocks-from-6-sectors-are-motilal-oswals-top-picks-do-you-own-any/slideshow/124354676.cms",
            "description": "The past six months have brought a fair share of challenges for Indian equities — from US tariffs and global tensions to an active war — but policymakers have responded with a clear resolve to reform, using these setbacks to push long-term structural change. The September quarter (Q2 FY26) is likely to mark the bottom for earnings growth and a moderation in downgrades. It will also begin to show the early effects of the GST 2.0 measures on select sectors, with management commentary during the results season offering key insights into how these reforms could influence demand and profitability ahead. Here are Motilal Oswal’s top picks.",
            "pubDate": "2025-10-07T08:14:26.520544"
        },
        {
            "title": "Why Goldman Sachs sees more upside in gold as it raises target to $4,900 by 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-goldman-sachs-sees-more-upside-in-gold-as-it-raises-target-to-4900-by-2026/articleshow/124355201.cms",
            "description": "Goldman Sachs has significantly boosted its gold price forecast to $4,900 per ounce by December 2026, citing robust ETF inflows and anticipated central bank purchases.  Analysts believe risks lean towards further upside, driven by private sector diversification and potential U.S. interest rate cuts, pushing gold towards the $4,000 mark.",
            "pubDate": "2025-10-07T08:14:26.520646"
        },
        {
            "title": "Bank of India shares jump 3% after strong Q2 update; global business up 12% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-india-shares-jump-3-after-strong-q2-update-global-business-up-12-yoy/articleshow/124354914.cms",
            "description": "Bank of India shares rose 2.8% after a strong Q2 performance, driven by 11.8% YoY growth in global business. Domestic and global deposits, as well as gross advances, showed robust growth, reflecting healthy credit demand and strong retail traction.",
            "pubDate": "2025-10-07T08:14:26.520749"
        },
        {
            "title": "2047 & beyond - Building a nation where every citizen is insured",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2047-beyond-building-a-nation-where-every-citizen-is-insured/articleshow/124354784.cms",
            "description": "As India aims for Viksit Bharat by 2047, financial independence for every citizen is paramount. The IRDAI's 'Insurance for All' vision, supported by government schemes and industry innovations like Bima Trinity, is making insurance accessible and comprehensive. This drive aims to ensure no Indian faces financial ruin due to unforeseen events, fostering security and dignity.",
            "pubDate": "2025-10-07T08:14:26.520853"
        },
        {
            "title": "Metropolis Healthcare shares jump over 4% as revenue surges 23% YoY in Q2 update",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metropolis-healthcare-shares-jump-over-4-as-revenue-surges-23-yoy-in-q2-update/articleshow/124354563.cms",
            "description": "Metropolis Healthcare shares: As per its Q2FY26 business update, consolidated growth was driven by strong demand for preventive health check-ups through its TruHealth and wellness services.",
            "pubDate": "2025-10-07T08:14:26.520975"
        },
        {
            "title": "Netweb Technologies shares more than double in 3 months. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-shares-more-than-double-in-3-months-should-you-buy-sell-or-hold/articleshow/124354524.cms",
            "description": "Netweb Technologies shares are soaring, driven by strong demand for its artificial intelligence and cloud infrastructure solutions. The company has secured substantial orders, boosting its revenue and profitability outlook. Expansion in manufacturing and AI capabilities further fuels investor confidence. Analysts anticipate continued growth, making Netweb a key small-cap tech story.",
            "pubDate": "2025-10-07T08:14:26.521081"
        },
        {
            "title": "Tata Investment shares fall 9% in October after a sizzling 53% September rally. Has the frenzy run its course?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-shares-fall-9-in-october-after-a-sizzling-53-september-rally-has-the-frenzy-run-its-course/articleshow/124354342.cms",
            "description": "Tata Investment Corporation Ltd (TICL) shares are experiencing a pullback after a significant rally driven by the Tata Capital IPO and a stock split announcement. Investors are booking profits following a 35% surge last month, with the stock down nearly 9% in October.",
            "pubDate": "2025-10-07T08:14:26.521180"
        },
        {
            "title": "Investors turn to gold and bitcoin amid market uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-turn-to-gold-and-bitcoin-amid-market-uncertainty/slideshow/124354249.cms",
            "description": "The election of fiscal and monetary dove Sanae Takaichi lifted the Nikkei to record highs. Markets are pricing in expectations of revived government spending and loose monetary policy under her anticipated premiership. Meanwhile, the yen fell to a two-month low and Japanese government bond yields rose.",
            "pubDate": "2025-10-07T08:14:26.521281"
        },
        {
            "title": "Morgan Stanley stake and a 75% upside call: Why this newly listed stock is drawing attention",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/morgan-stanley-stake-and-a-75-upside-call-why-this-newly-listed-stock-is-drawing-attention/articleshow/124358970.cms",
            "description": "Pace Digitek shares gained attention after Morgan Stanley bought 12 lakh shares and Arihant Capital initiated coverage with a ‘Buy’ rating, citing strong growth potential in India’s renewable and telecom infrastructure sectors.",
            "pubDate": "2025-10-07T09:36:13.699342"
        },
        {
            "title": "Glottis investors stare at steep loss as stock crashes 37% from issue price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/glottis-investors-stare-at-steep-loss-as-stock-crashes-37-from-issue-price/articleshow/124358496.cms",
            "description": "Glottis Ltd shares experienced a sharp decline on their market debut. The stock fell significantly on both the BSE and NSE. This happened despite the company's established presence in the logistics sector. The IPO was priced at Rs 129 per share. The company raised Rs 307 crore through the IPO. Investor sentiment appeared subdued during the listing.",
            "pubDate": "2025-10-07T09:36:13.699472"
        },
        {
            "title": "15 stocks to shop for this Diwali; SBI Securities eyes up to 25% upside. Check list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/15-stocks-to-shop-for-this-diwali-sbi-securities-eyes-up-to-25-upside-check-list/slideshow/124358532.cms",
            "description": "Indian equities enter Samvat 2082 after a year of consolidation, but SBI Securities expects momentum to turn. The brokerage sees double-digit earnings growth ahead, aided by rate cuts, GST relief, and tax incentives. Against this backdrop, it has picked 15 stocks across sectors with potential upsides of up to 25%.",
            "pubDate": "2025-10-07T09:36:13.699580"
        },
        {
            "title": "Dabur India Q2 Update: GST reforms, portfolio resilience drive momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dabur-india-q2-update-gst-reforms-portfolio-resilience-drive-momentum/articleshow/124358457.cms",
            "description": "Dabur India announced that recent GST reforms cutting rates on key FMCG categories from 12–18% to 5% will boost affordability and consumer demand. Around 85% of its portfolio now falls under the 5% tax slab, covering core segments like oral care, hair oils, shampoos, juices, and OTC products. The company plans to pass on these benefits to consumers.",
            "pubDate": "2025-10-07T09:36:13.699682"
        },
        {
            "title": "10 Nifty500 stocks backed by MFs crash up to 50% from their highs — Are you in or out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-nifty500-stocks-backed-by-mfs-crash-up-to-50-from-their-highs-are-you-in-or-out/slideshow/124358185.cms",
            "description": "When big institutional investors like mutual funds invest in a stock, it’s usually a sign that the stock is worth noticing. Mutual funds conduct extensive research and focus on long-term growth, so they invest only with sound reasoning. So, what happens when some of their favorite stocks nosedive by as much as 50% from their peak?Amid ongoing market uncertainty, several well-owned stocks in the Nifty500 have taken a beating. But interestingly, mutual funds haven’t backed away. In fact, they’ve been doing quite the opposite—steadily increasing their stake in 141 stocks from the Nifty500 index over the past three quarters. Over half of these have rewarded investors with positive returns so far in CY25. But today, we focus not on the winners, but the worst performers from that list.Roughly 40 MF-backed stocks have dropped over 25% from their 52-week highs, with the top 10 laggards sliding anywhere between 40% to 50%. That’s a steep fall—even for long-term believers. Are these sharp corrections a golden bottom-fishing opportunity, or a warning sign that investors should be cautious about? Only time will tell. We break down the top 10 most beaten-down MF favorites. (Data Source: ACE Equity).",
            "pubDate": "2025-10-07T09:36:13.699789"
        },
        {
            "title": "$3 trillion in household gold sits idle while Indian companies seek capital: Nithin Kamath flags investment paradox",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/3-trillion-in-household-gold-sits-idle-while-indian-companies-seek-capital-nithin-kamath-flags-investment-paradox/articleshow/124363362.cms",
            "description": "Zerodha CEO Nithin Kamath highlighted that Indian households hold $3 trillion worth of idle gold, urging better ways to financialize it. He compared gold’s stability with equities’ higher but volatile returns from 1996–2025.",
            "pubDate": "2025-10-07T12:41:15.573762"
        },
        {
            "title": "Aswath Damodaran flags a \"fairly highly valued\" market, lays out 5 ways investors can respond",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aswath-damodaran-flags-a-fairly-highly-valued-market-lays-out-5-ways-investors-can-respond/articleshow/124362905.cms",
            "description": "NYU’s Aswath Damodaran warns that while U.S. stocks appear richly valued, timing a correction is risky. He highlights rising valuations, driven by major tech stocks, and offers five strategies for investors. Damodaran stresses that even when markets look overpriced, predicting corrections is highly uncertain and requires careful planning.",
            "pubDate": "2025-10-07T12:41:15.573885"
        },
        {
            "title": "Vishal Mega Mart, 9 other midcap stocks see promoters slash stakes significantly. Did you invest in any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vishal-mega-mart-9-other-midcap-stocks-see-promoters-slash-stakes-significantly-did-you-invest-in-any/slideshow/124361692.cms",
            "description": "A decrease in promoter shareholding can indicate that a company may be raising funds for expansion, as promoters might sell their stakes to generate capital. For investors, this trend can be a red flag, suggesting a potential misalignment of interests between management and shareholders. In the NSE midcap segment, we have highlighted the top 10 stocks where promoters reduced their holdings in the June '25 quarter compared to the March '25 quarter, according to the StockEdge shareholding scan.",
            "pubDate": "2025-10-07T12:41:15.574000"
        },
        {
            "title": "Stock Radar: Why this largecap Sensex stock is looking attractive on charts?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-why-this-largecap-sensex-stock-is-looking-attractive-on-charts/articleshow/124338055.cms",
            "description": "Larsen & Toubro recently broke above a 9-month consolidation on weekly charts, signaling potential for higher prices. Experts suggest buying the stock, targeting above 4,300 levels in the coming months. Technical indicators and derivatives data support this bullish outlook, with a Volatility Contraction Pattern also observed.",
            "pubDate": "2025-10-07T12:41:15.574100"
        },
        {
            "title": "Antique spots a turnaround thread in textiles, kicks off coverage on 3 stocks with buy call on 2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/antique-spots-a-turnaround-thread-in-textiles-kicks-off-coverage-on-3-stocks-with-buy-call-on-2/articleshow/124361243.cms",
            "description": "Antique Stock Broking expects India’s textile sector to enter a new growth cycle driven by policy support, easing tariffs, and rising man-made fibre demand. It recommends buying Nitin Spinners and Sanathan Textiles, while maintaining a hold on Vardhman Textiles.",
            "pubDate": "2025-10-07T12:41:15.574219"
        },
        {
            "title": "Market Wrap: Nifty extends winning run to Day 4, tops 25,100; Sensex gains 136 points on upbeat pre-earnings mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-nifty-extends-winning-run-to-day-4-tops-25100-sensex-gains-136-points-on-upbeat-pre-earnings-mood/articleshow/124360527.cms",
            "description": "Indian equity benchmarks Sensex and Nifty extended their gains for a fourth consecutive session on Tuesday, driven by strong performance in heavyweight financials. Optimism surrounding the Reserve Bank of India's new lending reforms and positive corporate updates ahead of September-quarter earnings bolstered market sentiment, with broader markets also advancing.",
            "pubDate": "2025-10-07T12:41:15.574325"
        }
    ]
}