{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-26T01:41:35.383830",
    "items": [
        {
            "title": "Asian stocks edge up in thin trade, silver hits record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-up-in-thin-trade-silver-hits-record/articleshow/126181016.cms",
            "description": "Asian stocks saw a slight rise on Friday. Japanese and South Korean markets gained as others remained closed for holidays. Silver reached a record high, and gold neared its all-time peak. This movement extends a year-end rally. Investors are watching for a 'Santa Claus Rally' to push stocks higher. China's yuan strengthened past 7 per dollar.",
            "pubDate": "2025-12-26T01:41:26.173544"
        },
        {
            "title": "Stocks in news: IndusInd Bank, Ola Electric, IndiGo, Castrol India, Sun Pharma, RIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indusind-bank-ola-electric-indigo-castrol-india-sun-pharma-ril/articleshow/126177085.cms",
            "description": "Indian markets saw a subdued trading session on Wednesday, ending marginally lower. This consolidation follows a recent surge. Analysts suggest a positive outlook, recommending buying on dips as the Nifty maintains its uptrend. Banking index participation is crucial for further upward movement.",
            "pubDate": "2025-12-26T01:41:26.173671"
        },
        {
            "title": "GIFT Nifty lower 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126177122.cms",
            "description": "Nifty closed marginally lower on Wednesday due to profit-booking in certain sectors. Analysts anticipate a narrow trading range for Indian equities this week, with limited triggers and reduced global market activity. The India VIX remains near historical lows, supporting a bullish sentiment.",
            "pubDate": "2025-12-26T01:41:26.173875"
        },
        {
            "title": "Analysts see 40% upside in Leela Palaces stock on expansion plans, growing travel demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/analysts-see-40-upside-in-leela-palaces-stock-on-expansion-plans-growing-travel-demand/articleshow/126180923.cms",
            "description": "Leela Palaces Hotels & Resorts stock has seen an uptick, driven by expansion plans and growing travel demand. The company's international foray into Dubai and domestic growth, coupled with a widening luxury hospitality demand-supply gap, positions it for future success. Analysts anticipate significant upside, with a 'BUY' rating and a target price of ₹600.",
            "pubDate": "2025-12-26T01:41:26.173997"
        },
        {
            "title": "Merchants crack QR code to secure loans from NBFCs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/merchants-crack-qr-code-to-secure-loans-from-nbfcs/articleshow/126180985.cms",
            "description": "Non-banking finance companies (NBFC) such as Aditya Birla Finance (ABFL), L&T Finance, Poonawala Fincorp, and SMFG India Credit are among those extending credit to small businesses, harnessing the technology backbone offered by payment firms such as BharatPe, Paytm and PhonePe.",
            "pubDate": "2025-12-26T01:41:26.174101"
        },
        {
            "title": "Investors warn of 'rot in private equity' as funds come up with circular deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-warn-of-rot-in-private-equity-as-funds-come-up-with-circular-deals/articleshow/126180887.cms",
            "description": "Private equity firms are increasingly using \"continuation vehicles\" to sell companies to themselves, booking paper gains amid a backlog of unsold businesses. This strategy allows firms to wait for better market conditions, but investors worry about questionable valuations and unrealistic projections, as exemplified by the bankruptcies of Wheel Pros and United Site Services.",
            "pubDate": "2025-12-26T01:41:26.174199"
        },
        {
            "title": "Jupiter Hospital, Reliance-backed co in race for Mumbai SevenHills",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-hospital-reliance-backed-co-in-race-for-mumbai-sevenhills/articleshow/126180902.cms",
            "description": "Two companies are vying to buy SevenHills Healthcare. NK Holdings, backed by Reliance, and Jupiter Hospital have offered similar amounts. The hospital faces a long legal dispute over land compensation. Creditors are reviewing the bids. The Visakhapatnam hospital was recently sold.",
            "pubDate": "2025-12-26T01:41:26.174389"
        },
        {
            "title": "RBI may pump in ₹1 lakh cr more for liquidity comfort",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-pump-in-1-lakh-cr-more-for-liquidity-comfort/articleshow/126180859.cms",
            "description": "The Reserve Bank of India may inject an additional ₹1 lakh crore in February-March 2026 to maintain surplus liquidity in the banking system. This move aims to encourage banks to lower lending rates and stimulate credit demand, addressing the current liquidity deficit caused by forex interventions and tax outflows.",
            "pubDate": "2025-12-26T01:41:26.174493"
        }
    ]
}