{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-20T13:36:06.994405",
    "items": [
        {
            "title": "Q1 results this week: Infosys, Bajaj Finance, Nestle, Eternal, Paytm, Kotak Mahindra Bank among 95 companies to announce earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q1-results-this-week-infosys-bajaj-finance-nestle-eternal-paytm-kotak-mahindra-bank-among-95-companies-to-announce-earnings/articleshow/122793687.cms",
            "description": "India Inc's Q1 FY26 earnings season intensifies, with 95 companies set to report results this week. Key players on the radar include Infosys, Zomato, UltraTech Cement, Paytm, Bajaj twins, Nestle India, and Kotak Mahindra Bank. The action kicks off July 21 with firms like CRISIL, Havells, and UltraTech. Market sentiment may hinge on these earnings.",
            "pubDate": "2025-07-20T05:32:43.485766"
        },
        {
            "title": "Market Trading Guide: Bajaj Finance, SAIL among 8 key stocks to buy on Monday. Up to 13% upside potential seen in near term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-bajaj-finance-sail-among-8-key-stocks-to-buy-on-monday-up-to-13-upside-potential-seen-in-near-term/slideshow/122793653.cms",
            "description": "India’s headline indices ended in the red on Friday recording their second successive fall amid selling pressure in the banks, auto and pharma stocks. Nifty remained under selling pressure, falling towards 24,900 where it found initial support.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said that the index stayed above the 50-day moving average (50 DMA) and appeared poised for a short-term pullback after a sharp correction. “However, it remains a ‘sell on rise’ as long as it trades below 25,260. On the downside, selling may intensify if it breaks below 24,900,” he said.Here are 8 stock recommendations for Monday:",
            "pubDate": "2025-07-20T05:32:43.485893"
        },
        {
            "title": "Q1 earnings, FII action among 8 factors that’ll steer D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q1-earnings-fii-action-among-8-factors-thatll-steer-d-street-this-week/articleshow/122793340.cms",
            "description": "Indian equities ended the week lower, with the Nifty slipping 0.7%. On Friday, it declined 143 points to close at 24,968. Despite holding above its 50-EMA, the index remained under pressure. Analysts flagged 24,900 as a key support; a breach could trigger further downside. Market direction this week hinges on crucial domestic and global cues.",
            "pubDate": "2025-07-20T05:32:43.486000"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/122795428.cms",
            "description": "The Indian market closed lower on Friday, weighed down by broad-based selling and weak earnings in key sectors. Out of 4,208 stocks on the BSE, 2,394 declined amid bearish sentiment. Stocks like DB Realty, Axis Bank, and Alok Industries saw sharp selling pressure, while only 1,657 stocks advanced. Overall market breadth remained negative, highlighting caution among investors.",
            "pubDate": "2025-07-20T08:53:46.075271"
        },
        {
            "title": "How to trade RIL shares after Q1 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-trade-ril-shares-after-q1-earnings/articleshow/122795242.cms",
            "description": "Reliance Industries reported a significant profit increase in Q1. Experts predict the company's stock price may rise further. Anuj Gupta suggests buying Reliance shares, targeting a price increase in the short term. Nilesh Jain advises accumulating shares on dips for long-term gains. Kranthi Bathini recommends a buy strategy for long-term investors. Jio and Reliance Retail are key growth drivers.",
            "pubDate": "2025-07-20T08:53:46.075443"
        },
        {
            "title": "IPO Tracker: 9 issues, 3 listings set to hit the market this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-spotlight-12-ipos-this-week-including-3-listings-and-9-subscription-opens/slideshow/122794280.cms",
            "description": "The IPO market is set for a packed and eventful week from July 21 to July 25, with a total of 12 notable IPO-related events scheduled across both the mainboard and SME segments. This includes the listing of three companies on the stock exchanges, along with nine new IPOs opening for public subscription—offering a range of opportunities for investors.One of the key highlights is the much-anticipated listing of Anthem Biosciences, a prominent player in the contract research and manufacturing services (CRAMS) space, focused on pharmaceuticals and biotechnology. The company’s IPO had a total issue size of Rs 3,395 crore, priced at Rs 579 per share, and was managed by JM Financial. With several high-profile listings and fresh IPOs hitting the market, the coming week is shaping up to be a pivotal period for IPO-focused investors.",
            "pubDate": "2025-07-20T08:53:46.075553"
        },
        {
            "title": "Nifty just in pause mode, all-time high possible before Diwali: Rahul Ghose",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-just-in-pause-mode-all-time-high-possible-before-diwali-rahul-ghose/articleshow/122795198.cms",
            "description": "Markets are currently taking a breather after a strong run. Global factors like FII outflows and geopolitical tensions are affecting the market. Nifty faces resistance at 25,300 and support around 24,500-24,800. Bank Nifty shows relative strength. Analysts advise watching for breakouts in Nifty and buying dips in Bank Nifty. Long positions are seen in Tata Consumer and Trent.",
            "pubDate": "2025-07-20T08:53:46.075648"
        },
        {
            "title": "FPIs exit secondary market in July, but stay active in IPOs. What’s fueling the shift?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-exit-secondary-market-in-july-but-stay-active-in-ipos-whats-fueling-the-shift/articleshow/122794621.cms",
            "description": "Foreign portfolio investors (FPIs) have turned net sellers in India’s secondary markets in July, offloading over Rs 10,000 crore in equities amid valuation concerns and underperformance. However, their primary market investments remain strong, indicating a shift in strategy. Despite near-term caution, FPIs continue to tap IPO and QIP opportunities, reflecting selective optimism toward Indian equities.",
            "pubDate": "2025-07-20T08:53:46.075753"
        },
        {
            "title": "Don’t fear volatility, focus on businesses: 5 mid-cap stocks from different sectors with upside potential of up to 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dont-fear-volatility-focus-on-businesses-5-mid-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-27/articleshow/122794220.cms",
            "description": "For all those who thought that a bullish market doesn't see volatility, the way the street has behaved in the last few days is a reminder that volatility is integral to any market. Now, is there any point in trying to guess when this phase of volatility will end? Not really. It may end this week, or it may continue for some time. That, however, does not mean you should continue to look at stocks with the bearish bias that six months of decline is bound to have created. So, be somewhat bullish, but not reckless. At this juncture, the key is to keep an eye on the Q1 earnings. That will play an important role in how things pan out in the medium term.",
            "pubDate": "2025-07-20T08:53:46.075849"
        },
        {
            "title": "M-cap of 6 of top-10 most valued firms slumps Rs 94,433 crore; TCS, RIL top laggards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/m-cap-of-6-of-top-10-most-valued-firms-slumps-rs-94433-crore-tcs-ril-top-laggards/articleshow/122794323.cms",
            "description": "The combined market valuation of 6 of the top-10 most valued firms declined by Rs 94,433.12 crore last week, with Tata Consultancy Services and Reliance Industries taking the biggest hit, in line with a bearish trend in equities.",
            "pubDate": "2025-07-20T08:53:46.075943"
        },
        {
            "title": "Corporate actions this week: LIC, Hero Moto and 23 other stocks to set record dates for dividends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corporate-actions-this-week-lic-hero-moto-23-more-stocks-to-have-record-dates-for-dividend-do-you-own-any/articleshow/122794271.cms",
            "description": "Several Indian companies, including Life Insurance Corporation of India, Hero MotoCorp, and Zydus Lifesciences, will soon set record dates for dividend distribution. Shree Cement and Thangamayil Jewellery's ex-date and record date is on July 21. Voltamp Transformers' ex-date and record date is on July 22.",
            "pubDate": "2025-07-20T08:53:46.076037"
        },
        {
            "title": "7 Penny stocks soar up to 700% in a year; 4 doubled investor wealth, do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-penny-stocks-soar-up-to-700-in-a-year-4-doubled-investor-wealth-do-you-own-any/slideshow/122793983.cms",
            "description": "Over the past year, seven penny stocks have delivered remarkable returns, gaining between 50% and a staggering 700% —yes, 700% in just one year. Interestingly, four of these stocks more than doubled investors’ wealth within this period. These high performers were identified using a focused set of criteria: each stock has a market capitalisation under Rs 1,000 crore, a share price below Rs 20, and a minimum recent trading volume of 5 lakh shares. This approach helps filter for low-priced, actively traded small stocks showing strong momentum (Data Source: ACE Equity).Penny stocks often attract attention due to their low entry price and the potential for explosive growth. But while the rewards can be impressive, the risks are equally high. These stocks typically carry low liquidity, high volatility, and limited financial transparency. Investors should proceed with caution —success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2025-07-20T08:53:46.076129"
        },
        {
            "title": "Will consumer stocks see a comeback this festive season? 12 stocks to keep an eye on even when analysts are not bullish",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-consumer-stocks-see-a-comeback-this-festive-season-12-stocks-to-keep-an-eye-on-even-when-analysts-are-not-bullish/articleshow/122797405.cms",
            "description": "It’s been a while since a finance minister decided to put more money in the hands of consumers. This was done by making changes in the tax rate for individuals. Then the RBI reduced interest rates, which meant lower EMIs. Now, what will consumers do when they have more money in their hands? They will either spend more, or save more. The probability that they will spend more is higher. And when consumers spend more, the money comes back into the economy. Now, there is an established route by which money tends to flow back into the economy. It initially goes to some sectors and companies which tend to have more sales whenever consumers have higher spending power.",
            "pubDate": "2025-07-20T13:36:00.634240"
        },
        {
            "title": "How global forces are reshaping base metal prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-global-forces-are-reshaping-base-metal-prices/articleshow/122797289.cms",
            "description": "Base metals like aluminium and copper are witnessing sharp volatility in 2025, driven by U.S. trade tariffs, a weakening dollar, geopolitical tensions, and China's evolving policies. While global supply chains face disruptions, demand remains mixed amid green energy transitions. As uncertainty persists, investors and industries must adopt flexible strategies to navigate this increasingly complex and globally influenced market.",
            "pubDate": "2025-07-20T13:36:00.634366"
        },
        {
            "title": "Apollo Tyres, Brigade Enterprises among 10 small-cap stocks trading below industry PE; may rally up to 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-tyres-brigade-enterprises-among-10-small-cap-stocks-trading-below-industry-pe-may-rally-up-to-43/slideshow/122796421.cms",
            "description": "Several BSE Small-Cap stocks are trading at lower price-to-earnings (PE) ratios than their industry averages, making them attractive for value investors. According to Trendlyne, names like Apollo Tyres, PNB Housing Finance, and Brigade Enterprises could see upside of up to 43% based on broker targets.",
            "pubDate": "2025-07-20T13:36:00.634478"
        },
        {
            "title": "July 22–25: Critical time windows could trigger Nifty reversals, says Harshubh Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/july-2225-critical-time-windows-could-trigger-nifty-reversals-says-harshubh-shah/articleshow/122797239.cms",
            "description": "Synopsis: Indian equities ended lower for the third consecutive week, with the Nifty slipping below 25,000 as FPI outflows crossed Rs 10,700 crore in July. Time-based technical analysis played out with precision, as key intraday time slots aligned with swing highs and lows. Analysts now expect sharp moves in the coming week, especially around July 22–25.",
            "pubDate": "2025-07-20T13:36:00.634579"
        },
        {
            "title": "How to Calculate Dividend Yield: A key metric for income investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-calculate-dividend-yield-a-key-metric-for-income-investors/slideshow/122796207.cms",
            "description": "",
            "pubDate": "2025-07-20T13:36:00.634679"
        },
        {
            "title": "Will meaningful profit growth continue to elude Corporate India?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-meaningful-profit-growth-continue-to-elude-corporate-india/articleshow/122795893.cms",
            "description": "Indian equities experienced unprecedented growth post-COVID, fueled by improved fundamentals. However, margin expansion is now limited due to global trade imbalances and subdued demand, with revenue growth tapering to low single digits. While corporate balance sheets are strong, cautious capex and high valuations suggest FY26 profit growth may struggle to meet optimistic expectations, advising a multi-asset investment strategy.",
            "pubDate": "2025-07-20T13:36:00.634780"
        }
    ]
}