{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-19T11:30:40.442888",
    "items": [
        {
            "title": "JSW Steel Q1 profit more than doubles to Rs 2,209 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q1-profit-more-than-doubles-to-rs-2209-crore/articleshow/122776704.cms",
            "description": "JSW Steel witnessed a significant surge in net profit during the June quarter. The profit more than doubled, reaching '2,209 crore. This boost was fueled by increased sales volume in India and reduced costs. Steel sales volume rose by 9% to 6.69 million tonnes. Revenue remained largely stable at '43,147 crore.",
            "pubDate": "2025-07-19T05:29:56.931159"
        },
        {
            "title": "Yes Bank to announce Q1 results today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-to-announce-q1-results-today-heres-what-to-expect/articleshow/122776604.cms",
            "description": "Yes Bank is expected to post a mixed Q1FY26 performance, with PAT forecast to rise 7–49% YoY and NII showing flat to slight growth. Brokerages differ on outlook, citing margin pressure and weak sequential trends in key metrics.",
            "pubDate": "2025-07-19T05:29:56.931300"
        },
        {
            "title": "Reliance Industries’ Q1 consolidated profit at record Rs 26,994 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q1-consolidated-profit-at-record-rs-26994-crore/articleshow/122776540.cms",
            "description": "Reliance Industries reported a significant 78% surge in its June quarter earnings, reaching a record ₹26,994 crore, fueled by robust growth in consumer businesses and a one-time gain from an Asian Paints stake sale. Jio Platforms saw a 25% profit increase, while Reliance Retail expanded its store network and digital presence.",
            "pubDate": "2025-07-19T05:29:56.931416"
        },
        {
            "title": "Yes Bank Q1 Results: PAT jumps 59% YoY to Rs 801 crore, NII up 5.7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-q1-results-pat-jumps-59-yoy-to-rs-801-crore-interest-income-falls-1-6/articleshow/122778951.cms",
            "description": "Yes Bank Q1 Results: Yes Bank on Saturday reported a 59% year-on-year (YoY) growth in its Q1FY26 standalone net profit at Rs 801 crore versus Rs 502 crore in the year-ago period.",
            "pubDate": "2025-07-19T07:51:46.647543"
        },
        {
            "title": "ICICI Bank Q1 Results: Net profit rises 15.5% YoY Rs 12,768 crore; NII up 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q1-results-net-profit-rises-15-5-yoy-rs-12768-crore-nii-up-11/articleshow/122780833.cms",
            "description": "The private sector lender posted a 10.6% increase YoY in net interest income (NII), which rose to Rs 21,635 crore in the June quarter from Rs 19,553 crore a year ago.",
            "pubDate": "2025-07-19T09:54:58.474209"
        },
        {
            "title": "HDFC Bank announces first ever bonus share issue at 1:1 ratio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-announces-11-bonus-issue-in-its-first-ever-bonus-share-issue/articleshow/122780791.cms",
            "description": "HDFC Bank, India's leading private sector lender, has declared its inaugural bonus issue, approving a 1:1 share allotment. Shareholders will receive one bonus share for each existing share held. The record date for determining eligibility for the bonus shares is set for August 27, 2025, marking a historic moment for the bank.",
            "pubDate": "2025-07-19T09:54:58.474334"
        },
        {
            "title": "HDFC Bank Q1 Results: PAT rises 12% YoY to Rs 18,155 crore; dividend of Rs 5 per share declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q1-results-pat-rises-12-yoy-to-rs-18155-crore-bank-announces-11-bonus-issue/articleshow/122780608.cms",
            "description": "HDFC Bank Q1 Results: HDFC Bank on Saturday reported a 12% year-on-year growth in its Q1FY26 standalone net profit at Rs 18,155 crore versus Rs 16,175 crore in the year-ago period.",
            "pubDate": "2025-07-19T09:54:58.474458"
        },
        {
            "title": "Reliance Power Q1 Results: Swings to net profit of Rs 45 crore; revenue dips 5% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-power-q1-results-swings-to-net-profit-of-rs-45-crore-revenue-dips-5-yoy/articleshow/122780656.cms",
            "description": "Reliance Power reported a consolidated net profit of Rs 44.68 crore for Q1 FY26, a turnaround from the previous year's loss, despite a 5.3% drop in revenue to Rs 1,885.58 crore. The company's board approved a Rs 6,000 crore fundraising plan and the issuance of debentures up to Rs 3,000 crore.",
            "pubDate": "2025-07-19T09:54:58.474562"
        },
        {
            "title": "Oriental Hotels reports Q1 standalone net profit at Rs 8.71 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oriental-hotels-reports-q1-standalone-net-profit-at-rs-8-71-crore/articleshow/122780426.cms",
            "description": "Oriental Hotels Ltd, an associate of The Indian Hotels Company Ltd, reported a standalone profit of Rs 8.71 crore for the April-June 2025 quarter, a significant increase from Rs 3.64 crore in the previous year. Revenue reached Rs 107 crore, a 26% rise attributed to asset upgrades and strong demand.",
            "pubDate": "2025-07-19T09:54:58.474669"
        },
        {
            "title": "RBL Bank Q1 Results: Net profit falls 46% YoY to Rs 200 crore; NII down 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rbl-bank-q1-results-net-profit-falls-46-yoy-to-rs-200-crore-nii-down-13-yoy/articleshow/122780002.cms",
            "description": "RBL Bank Q1 FY26 results: The bank's net profit decreased compared to last year. Net interest income also saw a drop. Operating expenses increased during the quarter. However, total deposits showed growth. The bank's capital adequacy remains strong. Gross non-performing assets saw a slight increase. Net NPA figures improved significantly. The bank maintains a conservative risk approach.",
            "pubDate": "2025-07-19T09:54:58.474767"
        },
        {
            "title": "Union Bank of India Q1 Results: PAT rises 12% to Rs 4,116 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/union-bank-of-india-q1-results-pat-rises-12-to-rs-4116-crore/articleshow/122781514.cms",
            "description": "Union Bank of India reported a 12% increase in net profit, reaching Rs 4,116 crore in the first quarter of this fiscal year, driven by improved interest earned and asset quality. Gross NPAs decreased to 3.52%, and net NPAs fell to 0.62%, boosting the bank's financial health. The bank's total business expanded by 5% to Rs 22,14,422 crore.",
            "pubDate": "2025-07-19T11:30:39.459534"
        },
        {
            "title": "Central Bank of India Q1 Results: Net profit surges 33% to Rs 1,169 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/central-bank-of-india-q1-results-net-profit-surges-33-to-rs-1169-crore/articleshow/122781433.cms",
            "description": "Central Bank of India announced a significant 33 percent rise in net profit, reaching Rs 1,169 crore for the first quarter. This growth is attributed to improved core income and reduced bad debts. The bank's total income increased to Rs 10,374 crore. Asset quality improved, with gross NPAs declining to 3.13 percent.",
            "pubDate": "2025-07-19T11:30:39.459660"
        }
    ]
}