{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-24T15:34:18.114074",
    "items": [
        {
            "title": "Ambuja Cements among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambuja-cements-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/126151955.cms",
            "description": "On December 23, futures open interest rose sharply across five F&O stocks, indicating a buildup of unexpired contracts, based on derivatives data. An increase in futures OI typically suggests fresh positioning or an expansion of existing positions, reflecting rising trader participation and improving confidence in near-term market moves.",
            "pubDate": "2025-12-24T03:17:02.936557"
        },
        {
            "title": "Coal India shares in focus after in-principle nod for listing of MCL, SECL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-shares-in-focus-after-in-principle-nod-for-listing-of-mcl-secl/articleshow/126151903.cms",
            "description": "Coal India shares are set to remain in focus after its board granted in-principle approval to list subsidiaries Mahanadi Coalfields and South Eastern Coalfields. The move follows directives from the Ministry of Coal and is subject to regulatory clearances, which could potentially unlock value and improve transparency in the coming financial year.",
            "pubDate": "2025-12-24T03:17:02.936688"
        },
        {
            "title": "Shriram Finance among 5 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-among-5-stocks-closed-crossing-above-vwap/slideshow/126151869.cms",
            "description": "On December 23, five stocks from the Nifty500 universe ended the session above their VWAP levels, based on data from stockedge.com. A close above VWAP indicates stronger buying interest during the day and may point to a developing short-term bullish trend supported by positive sentiment.",
            "pubDate": "2025-12-24T03:17:02.936793"
        },
        {
            "title": "Tata Steel among 5 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-among-5-nifty-stocks-showing-bullish-rsi-upswing/slideshow/126151812.cms",
            "description": "On December 23, within the Nifty50 universe, five stocks featured in the RSI Trending Up scan based on data from stockedge.com. An RSI move above 50 indicates strengthening momentum. Rising RSI values suggest improving price strength and may help traders identify early-stage upside opportunities.",
            "pubDate": "2025-12-24T03:17:02.936917"
        },
        {
            "title": "Adani Ports shares in focus on raising FY26 EBITDA, cargo outlook following NQXT acquisition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-shares-in-focus-on-raising-fy26-ebitda-cargo-outlook-following-nqxt-acquisition/articleshow/126151708.cms",
            "description": "Adani Ports revised its FY26 EBITDA and cargo volume targets upwards following the acquisition of Australia's North Queensland Export Terminal (NQXT). The company now projects Rs 22,350–23,350 crore EBITDA and 545–555 million metric tonnes cargo throughput by FY26, reinforcing its 2030 goal of 1 billion metric tonnes.",
            "pubDate": "2025-12-24T03:17:02.937025"
        },
        {
            "title": "TMPV shares in focus as company unveils major EV expansion roadmap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tmpv-shares-in-focus-as-company-unveils-major-ev-expansion-roadmap/articleshow/126151663.cms",
            "description": "Tata Motors Passenger Vehicles is set to make waves with an ambitious EV expansion, planning five new electric models by FY30, including the premium Avinya range.  A significant Rs 16,000-18,000 crore investment will fuel new launches, expand the lineup, and build extensive charging infrastructure, aiming to solidify market leadership and drive mass adoption of electric mobility across India.",
            "pubDate": "2025-12-24T03:17:02.937129"
        },
        {
            "title": "Stocks to buy for 2026: Ajanta Pharma, Aurobindo Pharma among 5 stocks that could give 10-30% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-ajanta-pharma-aurobindo-pharma-among-5-stocks-that-could-give-10-30-return-in-1-year/slideshow/126151144.cms",
            "description": "Brokerages remain upbeat on select stocks across pharmaceuticals, cement, building materials, and real estate, citing attractive valuations and strong upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-24T03:17:02.937225"
        },
        {
            "title": "MARC Technocrats heads for NSE SME debut. Here's what GMP suggests ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/marc-technocrats-heads-for-nse-sme-debut-heres-what-gmp-suggests-ahead-of-listing/articleshow/126151116.cms",
            "description": "MARC Technocrats shares will list on the NSE SME platform on December 24. The grey market premium is flat. The Rs 43 crore IPO saw strong demand, especially from retail investors. The company provides infrastructure consultancy services to government bodies. Financials show significant growth in revenue and profit. The issue price was fixed at Rs 93 per share.",
            "pubDate": "2025-12-24T03:17:02.937325"
        },
        {
            "title": "Global Ocean Logistics shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-ocean-logistics-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126151095.cms",
            "description": "Global Ocean Logistics is set to list on the BSE SME platform on December 24. The company's IPO saw strong demand, with a subscription of 13.64 times. Despite this, the grey market premium is flat. The Rs 30 crore IPO aims to fund business expansion and working capital. Global Ocean Logistics is a freight forwarding company with a pan-India presence.",
            "pubDate": "2025-12-24T03:17:02.937423"
        },
        {
            "title": "Positive Breakout: These 7 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-7-stocks-cross-above-their-200-dmas/slideshow/126151065.cms",
            "description": "In the Nifty500 pack, seven stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 23, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-24T03:17:02.937522"
        },
        {
            "title": "Jane Street hires DC lobbyists as India probe presses on",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-hires-dc-lobbyists-as-india-probe-presses-on/articleshow/126150803.cms",
            "description": "Global trading firm Jane Street is under intense regulatory scrutiny. India's SEBI is investigating alleged market manipulation, seeking millions in penalties. Simultaneously, Jane Street has begun lobbying in Washington, a significant shift after years of low profile. The firm denies wrongdoing in India and continues to post record profits, expanding its trading operations elsewhere.",
            "pubDate": "2025-12-24T03:17:02.937613"
        },
        {
            "title": "Asian stocks advance at open, gold tops $4,500",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-advance-at-open-gold-tops-4500/articleshow/126150738.cms",
            "description": "Asian stocks opened higher, following Wall Street's record rally fueled by robust US economic growth data. Gold, silver, and copper prices surged to new highs, while oil extended its gains amid geopolitical tensions. Despite strong US growth, bets on near-term Federal Reserve easing were scaled back as risk appetite remained firm heading into year-end.",
            "pubDate": "2025-12-24T03:17:02.937703"
        },
        {
            "title": "Can M&M Finance sustain its 27% rally amid improving margins?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-mm-finance-sustain-its-27-rally-amid-improving-margins/articleshow/126150661.cms",
            "description": "Mahindra & Mahindra Financial Services shares have surged significantly, outperforming the NBFC index due to strong Q2 performance. Robust auto financing, a GST rate cut, and improved net interest margins, driven by lower funding costs and higher fee income, are fueling this growth. Analysts anticipate continued momentum and an improved return on assets in the coming years.",
            "pubDate": "2025-12-24T03:17:02.937793"
        },
        {
            "title": "Stocks in news: Adani Ports, SJS Enterprises, Federal Bank, RIL, Tata Motors PV",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-adani-ports-sjs-enterprises-federal-bank-ril-tata-motors-pv/articleshow/126144159.cms",
            "description": "Indian markets paused after a recent rebound, ending flat as global cues guide direction amid a holiday-shortened week. Analysts anticipate consolidation but maintain a positive outlook. Key stocks in focus include Adani Ports, Federal Bank, RIL, and Tata Motors PV due to significant business developments and strategic expansions.",
            "pubDate": "2025-12-24T03:17:02.937916"
        },
        {
            "title": "Adani's cement biz merger may benefit Ambuja shareholders: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adanis-cement-biz-merger-seen-benefiting-ambuja-shareholders-analysts/articleshow/126150642.cms",
            "description": "Analysts view the Adani Group's proposed cement business merger favorably for Ambuja Cements shareholders, simplifying the group structure and removing management complexities. Share swap ratios are seen as neutral for ACC's minority shareholders and positive for Orient Cement's. The deal is expected to streamline operations and reporting across the integrated entity.",
            "pubDate": "2025-12-24T03:17:02.938013"
        },
        {
            "title": "GIFT Nifty up 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126144183.cms",
            "description": "Indian stock markets closed expiry day with small gains. Analysts anticipate lower trading volumes this week due to holidays. Markets are expected to hold steady at current levels. Global markets are showing positive signs. The VIX, a fear gauge, has fallen. Foreign investors were net sellers, while domestic investors were net buyers. The Rupee strengthened slightly against the dollar.",
            "pubDate": "2025-12-24T03:17:02.938111"
        },
        {
            "title": "Carnage-hit media stocks plunge up to 40% in 2025 but Ranbir Kapoor-backed scrip flashes Animal spirits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/carnage-hit-media-stocks-plunge-up-to-40-in-2025-but-ranbir-kapoor-backed-scrip-flashes-animal-spirits/articleshow/126152933.cms",
            "description": "The media sector is ending 2025 as a poor performer, with most Nifty Media index stocks experiencing double-digit declines. Prime Focus, however, stands out with significant gains. Analysts attribute the sector's struggles to a shift in consumer habits towards digital platforms and a lack of innovation in traditional media.",
            "pubDate": "2025-12-24T04:46:17.916511"
        },
        {
            "title": "Vikran Engineering shares zoom 15% on Rs 2,035 crore solar EPC order win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vikran-engineering-shares-zoom-15-on-rs-2035-crore-solar-epc-order-win/articleshow/126152655.cms",
            "description": "Vikran Engineering shares rose sharply on Wednesday after the company secured a Rs 2,035 crore EPC order from Onix Renewables for developing 600 MW AC solar projects in Maharashtra. The turnkey project, to be completed in 12 months, strengthens Vikran’s renewable energy portfolio and boosts its order book.",
            "pubDate": "2025-12-24T04:46:17.916628"
        },
        {
            "title": "NLC India among 7 stocks flashing bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nlc-india-among-7-stocks-flashing-bullish-signals-indicating-possible-uptrend/slideshow/126152039.cms",
            "description": "On December 23, seven NSE stocks featured in the White Marubozu bullish scanner, based on data from stockedge.com. A White Marubozu pattern forms when prices open at the session low and close at the high, highlighting sustained buying pressure and signalling potential upside continuation.",
            "pubDate": "2025-12-24T04:46:17.916728"
        },
        {
            "title": "Jaw-dropping 15,594% return as Sensex turns 40: How the wealth creation engine exploded from 549 to 86,000",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jaw-dropping-15594-return-as-sensex-turns-40-how-the-wealth-creation-engine-exploded-from-549-to-86000/articleshow/126152487.cms",
            "description": "The BSE Sensex has achieved remarkable wealth creation over four decades. It has grown from a modest start to a lifetime high, transforming into a democratized wealth engine for millions. This journey reflects India's economic transformation and its rise as a global powerhouse. The Sensex has become a true barometer of the Indian economy.",
            "pubDate": "2025-12-24T04:46:17.916827"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama maintains hold on Kajaria Ceramics; Goldman Sachs initiates coverage on Physics Wallah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-maintains-hold-on-kajaria-ceramics-goldman-sachs-initiates-coverage-on-physics-wallah/articleshow/126152462.cms",
            "description": "Brokerage houses present a mixed outlook on Indian equities, balancing execution strength, governance clarity, and valuation comfort. While Kajaria Ceramics focuses on cost optimisation amid industry headwinds, Cholamandalam Investment & Finance Company remains a preferred pick due to earnings visibility and governance confidence. PhysicsWallah’s growth prospects are acknowledged, though valuation and offline expansion risks temper optimism.",
            "pubDate": "2025-12-24T04:46:17.916927"
        },
        {
            "title": "Sensex gains over 100 pts, Nifty tops 26,200 on US economic growth optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-gains-over-50-pts-nifty-tops-26200-on-us-economic-growth-optimism/articleshow/126152440.cms",
            "description": "Indian stocks edged higher on Wednesday, with the Sensex and Nifty steadying after a flat close. Stronger U.S. economic growth data boosted risk appetite, though foreign fund outflows and thin year-end trading volumes tempered the optimism.",
            "pubDate": "2025-12-24T04:46:17.917028"
        },
        {
            "title": "Mukul Agrawal: The star investor who found 5 multibaggers in 2025 when others barely had any",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-the-star-investor-who-found-5-multibaggers-in-2025-when-others-barely-had-any/articleshow/126152372.cms",
            "description": "Despite a challenging market in 2025 that saw many portfolios decline, investor Mukul Agrawal's equity holdings featured five multibagger stocks. While his overall portfolio saw a slight dip, these select companies delivered significant returns, outperforming the broader market slump in small-cap stocks.",
            "pubDate": "2025-12-24T04:46:17.917124"
        },
        {
            "title": "Vietnam's stock market rises on signs of smooth power transition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vietnams-stock-market-rises-on-signs-of-smooth-power-transition/articleshow/126152270.cms",
            "description": "Vietnam's stock market hit a record high, extending its weekly rally as investors reacted positively to signs of political stability. A senior Communist Party meeting agreed on candidates for the next leadership, with party chief To Lam widely expected to retain his powerful post.",
            "pubDate": "2025-12-24T04:46:17.917230"
        },
        {
            "title": "Cholamandalam Investment and Finance shares in focus after company rejects governance allegations, brokerages reiterate buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cholamandalam-investment-and-finance-shares-in-focus-after-company-rejects-governance-allegations-brokerages-reiterate-buy-rating/articleshow/126152136.cms",
            "description": "Cholamandalam Investment and Finance Company shares are set to be in focus after the company rejected allegations of governance lapses, reaffirmed its guidance and highlighted strong liquidity and capital buffers. Brokerages including Motilal Oswal, Morgan Stanley and Jefferies reiterated their positive stance, citing improving disbursements and resilient fundamentals.",
            "pubDate": "2025-12-24T04:46:17.917329"
        },
        {
            "title": "Goldman Sachs initiates coverage on PhysicsWallah, sets target price of Rs 135 backed by strong revenue, EBIDTA projection",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-initiates-coverage-on-physicswallah-sets-target-price-of-rs-135-backed-by-strong-revenue-ebidta-projection/articleshow/126152126.cms",
            "description": "Goldman Sachs has initiated coverage on PhysicsWallah with a Neutral rating and a ₹135 target price, citing strong execution and a large market opportunity. It expects 24% revenue CAGR and over 80% EBITDA CAGR during FY25–30, driven by organic traffic, a stable competitive landscape, and a scalable pricing model.",
            "pubDate": "2025-12-24T04:46:17.917426"
        },
        {
            "title": "Hindustan Zinc shares jump 4% as silver prices breach $72 mark, rally over 140% in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-as-silver-prices-breach-72-mark-rally-over-140-in-2025/articleshow/126152104.cms",
            "description": "Hindustan Zinc shares: Silver prices hit record highs above $72/oz, up over 140% in 2025. The surge is driven by strong industrial demand, supply constraints, safe-haven buying, and expectations of looser US monetary policy, with MCX silver also touching fresh all-time highs in India.",
            "pubDate": "2025-12-24T04:46:17.917524"
        },
        {
            "title": "Websol Energy System shares rally 14% after Rs 73 crore tax bombshell is defused",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/websol-energy-system-shares-rally-14-after-rs-73-crore-tax-bombshell-is-defused/articleshow/126153108.cms",
            "description": "Websol Energy System shares jumped as much as 14% after the company won a key tax appeal, with authorities setting aside a Rs 73.04 crore demand for FY18. The ruling removes a major contingent liability from the solar firm’s books, triggering a sharp relief rally despite the stock being down 46% so far in 2025.",
            "pubDate": "2025-12-24T05:02:19.290275"
        },
        {
            "title": "India Inc sees first earnings upgrade after a gap of 5 quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-sees-first-earnings-upgrade-after-a-gap-of-5-quarters/articleshow/126153917.cms",
            "description": "India Inc has recorded its first aggregate earnings upgrade in five quarters, driven by mid- and large-cap firms, signaling a turnaround in the corporate profit cycle. Motilal Oswal raised FY26 PAT estimates by 2% after a series of cuts over the previous four quarters, marking a clear inflection in earnings revisions.",
            "pubDate": "2025-12-24T05:50:06.393435"
        },
        {
            "title": "Jefferies initiates coverage on Pine Labs with Rs 300 target price. Here's why it sees 28% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-initiates-coverage-on-pine-labs-with-rs-300-target-price-heres-why-it-sees-28-upside/articleshow/126153843.cms",
            "description": "Jefferies has initiated coverage on Pine Labs with a Buy rating, citing an earnings inflection point, strong revenue growth prospects, and improving profitability. Expansion across digital payments and operating leverage could drive a potential valuation re-rating.",
            "pubDate": "2025-12-24T05:50:06.393562"
        },
        {
            "title": "Below IPO price, anchor lock-ins for Citigroup-backed GK Energy and Saatvik Green end today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/below-ipo-price-anchor-lock-ins-for-citigroup-backed-gk-energy-and-saatvik-green-end-today/articleshow/126153750.cms",
            "description": "Anchor lock-ins for GK Energy and Saatvik Green Energy end today, releasing over 8 million shares into the market. Both stocks have fallen below their IPO prices despite strong listings and high subscription levels. GK Energy’s IPO was subscribed 93.6 times, while Saatvik Green drew nearly 7 times the overall demand.",
            "pubDate": "2025-12-24T05:50:06.393673"
        },
        {
            "title": "RVNL, IRCTC, Jupiter Wagons shares are running again. Should you ride railway stocks into the Union Budget?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-irctc-jupiter-wagons-shares-are-running-again-should-you-ride-railway-stocks-into-the-union-budget/articleshow/126153490.cms",
            "description": "Railway stocks are back in focus as RVNL, IRCTC, Jupiter Wagons and other rail-linked names rally ahead of the Union Budget 2026. Investors are eyeing potential increases in railway allocations, but analysts caution that pre-Budget spikes may be short-lived without sustained fundamentals.",
            "pubDate": "2025-12-24T05:50:06.393777"
        },
        {
            "title": "ESG and Wealth Preservation: How sustainable investing fits into HNI portfolios",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/esg-and-wealth-preservation-how-sustainable-investing-fits-into-hni-portfolios/articleshow/126153351.cms",
            "description": "For HNIs, investing is increasingly focused on capital protection, risk management and long-term sustainability, not just returns. ESG investing has become a key framework globally, shaping how investors assess business quality and influencing capital allocation decisions among U.S. investors, Indian HNIs and family offices.",
            "pubDate": "2025-12-24T05:50:06.393875"
        },
        {
            "title": "Jupiter Wagons shares jump 35% in four days following promoter stake hike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-wagons-shares-jump-35-in-four-days-following-promoter-stake-hike/articleshow/126154247.cms",
            "description": "Jupiter Wagons shares surged over 35% in four days after promoter Tatravagonka A.S. increased its stake to 19.24% through convertible warrant conversion. The acquisition was completed on December 19 and disclosed the same day in compliance with SEBI’s insider trading regulations. The move boosted investor confidence, reflecting promoter faith in long-term growth.",
            "pubDate": "2025-12-24T06:33:27.424413"
        },
        {
            "title": "Groww shares soar 9% with the stock up 76% from issue price. What’s fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-soar-9-with-the-stock-up-76-from-issue-price-whats-fuelling-the-rally/articleshow/126154665.cms",
            "description": "Groww shares jump 9.5% as investors cheer the stock’s upcoming BSE Large Cap index inclusion and the launch of its emergency trading platform, Groww Lite. The stock has surged 75.6% since its Rs 100 IPO.",
            "pubDate": "2025-12-24T07:24:12.210043"
        },
        {
            "title": "Bitcoin slips below $88K as holiday trading dries up liquidity. Should you brace for a breakout or breakdown?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bitcoin-slips-below-88k-as-holiday-trading-dries-up-liquidity-should-you-brace-for-a-breakout-or-breakdown/articleshow/126155754.cms",
            "description": "Bitcoin slipped below $88,000 amid thin holiday trading, with low liquidity amplifying modest sentiment shifts and increasing volatility risks. Profit booking and easing derivatives positions have kept prices range-bound, reflecting cautious market conviction rather than a strong bearish trend.",
            "pubDate": "2025-12-24T07:51:11.301793"
        },
        {
            "title": "Castrol India shares surge 9% after BP announces 65% stake sale in parent for $6 billion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/castrol-india-shares-surge-9-after-bp-announces-65-stake-sale-in-parent-for-6-billion/articleshow/126156686.cms",
            "description": "Castrol India shares surged 9% after BP announced the sale of a 65% stake in Castrol Limited to Stonepeak at an enterprise value of $10.1 billion. The transaction, expected to close by end-2026, is part of bp’s strategic divestment programme aimed at strengthening its balance sheet while retaining exposure to Castrol’s growth through a 35% stake.",
            "pubDate": "2025-12-24T08:55:23.122957"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Spread in Nifty to play bullish index sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-play-bullish-index-sentiment/articleshow/126156315.cms",
            "description": "Nifty traded in a tight range on Tuesday, forming a Doji-like pattern that signals market indecision. Despite this, the index continues to record higher highs and lows. Analysts suggest sustaining above 26,150 could trigger further upside, with a Bull Call Spread strategy recommended to capitalise on bullish sentiment.",
            "pubDate": "2025-12-24T08:55:23.123088"
        },
        {
            "title": "Forget the Nifty, look at these 50. If they make a comeback in 2026, then it is probably a bull market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/forget-the-nifty-look-at-these-50-if-they-make-a-comeback-in-2026-then-it-is-probably-a-bull-market/articleshow/126157400.cms",
            "description": "From being a set of stocks that had beaten the Nifty on all counts between 2021 and 2024, these stocks have been under pressure for the whole of 2025. But even though they have been under pressure as a set, 27 have delivered positive returns as compared to the same date last year; and only 23 are in the red. More than that, this set of stocks is suited both for investors and traders. Why? Because of the fact that most investors tend to trade with a bullish bias. So, as stocks where probability favours the bulls, it will be good to have them on your watchlist.",
            "pubDate": "2025-12-24T09:40:01.525946"
        },
        {
            "title": "These 12 smallcap multibaggers rallied every year for 3 years, surging 500-1,450%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-12-smallcap-multibaggers-rallied-every-year-for-3-years-surging-500-1450/slideshow/126157181.cms",
            "description": "The market script took an unexpected twist in CY25. While the Sensex marched ahead confidently, gaining 9.5%, the BSE Smallcap Index stumbled, slipping 6.5% over the same period. For smallcap investors, it felt like the music had suddenly stopped. But this short-term pain hides a much bigger story. Rewind the clock. In the previous two calendar years, smallcaps were the undisputed stars of Dalal Street. The BSE Smallcap Index crushed the Sensex with a wide margin—soaring nearly 48% in 2023 and adding another 30% in 2024. Put together, the index has delivered an impressive ~90% return over the last three years.Yet, smallcaps are never a smooth ride. Returns swung sharply from year to year, reminding investors of the segment’s volatile nature. And still, amid this inconsistency, a rare and remarkable group emerged. Twelve smallcap stocks defied the odds. Each of them delivered more than 50% gains in every single year over the last three calendar years. The result? A staggering cumulative rally of 500% to 1,450%. Yes, you read that right—each of these stocks multiplied investors’ wealth by over five times. In a market where indices zigzag, these outliers proved that extraordinary returns are possible—if you manage to spot the right smallcap stories early. (Data Source : ACE Equity)",
            "pubDate": "2025-12-24T09:40:01.526053"
        },
        {
            "title": "Manappuram, Muthoot Finance shares rally up to 7% to fresh peaks. What's pushing the gold lenders higher?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/manappuram-muthoot-finance-shares-rally-up-to-7-to-fresh-peaks-whats-pushing-the-gold-lenders-higher/articleshow/126157992.cms",
            "description": "Shares of Manappuram Finance and Muthoot Finance hit record highs on the BSE as domestic and global gold prices touched fresh peaks. Rising bullion prices, strong gold loan demand, and favourable brokerage outlooks have driven sharp gains in gold-backed lenders, significantly outperforming the broader market in 2025.",
            "pubDate": "2025-12-24T09:58:39.633968"
        },
        {
            "title": "Christmas Stock Market Holiday: Is stock market open tomorrow? Check NSE, BSE December 2025 holiday list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/christmas-stock-market-holiday-is-stock-market-open-tomorrow-check-nse-bse-december-2025-holiday-list/articleshow/126157769.cms",
            "description": "NSE Holidays 2025: Leading exchanges NSE and BSE will remain closed for trading on Thursday, December 25, due to the Christmas holiday. The commodity exchanges MCX and NCDEX will also take a day’s break and resume trading on Friday.",
            "pubDate": "2025-12-24T09:58:39.634059"
        },
        {
            "title": "Market Wrap: Sensex down 116 pts, Nifty below 26,150 as foreign outflows drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-down-116-pts-nifty-below-26150-as-foreign-outflows-drag/articleshow/126158225.cms",
            "description": "The Sensex fell 116 points, or 0.14%, to end at 85,408.70, while the Nifty 50 slipped 35 points, or 0.13%, to close at 26,142.10.",
            "pubDate": "2025-12-24T10:23:44.789167"
        },
        {
            "title": "Nuvama initiates coverage on Ashish Kacholia-backed stock with Rs 2,500 target, cites 3 bullish triggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-initiates-coverage-on-ashish-kacholia-backed-stock-with-rs-2500-target-cites-3-bullish-triggers/articleshow/126158167.cms",
            "description": "Nuvama Institutional Equities has initiated coverage on Knowledge Marine & Engineering Works with a ‘Buy’ rating and a target price of Rs 2,500, citing strong maritime sector tailwinds, a robust order book, superior margins, and execution strength across geographies. The brokerage expects sharp growth in revenue and profitability through FY28, supported by government-led infrastructure spending and green tug opportunities.",
            "pubDate": "2025-12-24T10:23:44.789287"
        },
        {
            "title": "Stock Radar: APL Apollo Tubes stock forms VCP pattern; consolidates around long-term averages; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-apl-apollo-tubes-stock-forms-vcp-pattern-consolidates-around-long-term-averages-check-target-stop-loss/articleshow/126140099.cms",
            "description": "APL Apollo Tubes has broken out of a two-month consolidation after forming a bullish VCP pattern, signalling renewed buying interest. Trading above key EMAs with strong volumes, the stock shows trend strength, though RSI indicates a short-term pause. Analysts expect a move toward Rs 2,100, with dips offering entry opportunities.",
            "pubDate": "2025-12-24T11:40:05.899239"
        },
        {
            "title": "Gainers & Losers: Groww, Kajaria Ceramics and 4 more stocks in focus on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-groww-kajaria-ceramics-and-4-more-stocks-in-focus-on-wednesday/slideshow/126159132.cms",
            "description": "",
            "pubDate": "2025-12-24T11:40:05.899346"
        },
        {
            "title": "Not skill or qualifications: Gurmeet Chadha says financial freedom came down to his digestive ability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/not-skill-or-qualifications-gurmeet-chadha-says-financial-freedom-came-down-to-his-digestive-ability/articleshow/126160086.cms",
            "description": "Market expert Gurmeet Chadha says his journey to financial independence was shaped not by skill or qualifications but by the ability to endure stock market volatility. Emphasising long-term investing and patience, he believes surviving market cycles and trusting India’s growth story are key to building wealth.",
            "pubDate": "2025-12-24T12:31:19.729164"
        },
        {
            "title": "Largecaps make a strong comeback in 2025: 6 stocks soar over 50%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/largecaps-make-a-strong-comeback-in-2025-6-stocks-soar-over-50/articleshow/126160585.cms",
            "description": "Largecap stocks staged a strong comeback in 2025 after two years of lagging midcaps and smallcaps. One-third of largecaps gained over 20%, with six soaring more than 50%. Technical indicators signal institutional buying and sustained momentum, suggesting largecaps may continue to lead heading into 2026.",
            "pubDate": "2025-12-24T13:09:54.989910"
        },
        {
            "title": "Vedanta, Shriram Finance among 7 largecap stocks hit 52-week highs; gains of up to 35% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shriram-finance-among-7-largecap-stocks-hit-52-week-highs-gains-of-up-to-35-in-a-month/slideshow/126160515.cms",
            "description": "Benchmark Sensex ended 116 points lower at 85,409 on Wednesday. Despite the broader market’s weakness, seven BSE large-cap stocks hit fresh 52-week highs, reaching their strongest levels in the past year. Such breakouts are often viewed as indicators of sustained bullish momentum and could point to further upside in the near term.",
            "pubDate": "2025-12-24T13:09:54.990022"
        },
        {
            "title": "ET Prime Special Series: Multibagger or IBC - Part 38: For this auto ancillary, EV transition is less about volumes, more about value",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-prime-special-series-multibagger-or-ibc-part-38-for-this-auto-ancillary-ev-transition-is-less-about-volumes-more-about-value/articleshow/126161063.cms",
            "description": "This story examines the evolution of a commercial vehicle-focused auto ancillary that has steadily expanded beyond its traditional products. It has built manufacturing scale while also adding software, engineering services, and digital solutions. The revenue mix shows a balance between OEM supplies, exports, aftermarket, and services, reducing reliance on any single segment. A key theme is the rise in content per vehicle, driven in part by electrification. While tariffs put exports under pressure, the company continues to invest in R&D and capacity. Technology depth, EV exposure, and system-level offerings are reshaping its long-term positioning.",
            "pubDate": "2025-12-24T14:09:11.954857"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 29%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-29-according-to-analysts/articleshow/126162034.cms",
            "description": "Is investing about what is going to happen in the markets in the next 40 days? The answer is a clear no. So, if you are planning to put fresh money into the market, especially in mid-caps, don’t bother about the Nifty or try to guess what will happen to the indices, or when they will start to recover. Focus on the fundamentals of the sector and company, and leave the rest to time to take care.",
            "pubDate": "2025-12-24T14:55:07.360541"
        },
        {
            "title": "US stocks trade flat ahead of Christmas break",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-trade-flat-ahead-of-christmas-break/articleshow/126162044.cms",
            "description": "Wall ‍Street ​indexes opened nearly flat ⁠in shortened Christmas Eve trading on ‌Wednesday, ‌as traders wait to ‌see whether stocks can extend record gains in a seasonally ​strong ​stretch for markets.",
            "pubDate": "2025-12-24T14:55:07.360666"
        },
        {
            "title": "Global diversification, strong domestic fundamentals key for investors in 2026: Experts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-diversification-strong-domestic-fundamentals-key-for-investors-in-2026-experts/articleshow/126162601.cms",
            "description": "Market experts on Wednesday advised investors to focus on global diversification alongside India's strengthening domestic fundamentals while planning their portfolios for 2026, citing currency depreciation risks and a structurally improving Indian economy.",
            "pubDate": "2025-12-24T15:34:16.821660"
        },
        {
            "title": "SFIO launches investigation against IndusInd Bank for accounting discrepancies in derivatives portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sfio-launches-investigation-against-indusind-bank-for-accounting-discrepancies-in-derivatives-portfolio/articleshow/126162484.cms",
            "description": "SFIO has initiated an investigation into IndusInd Bank over discrepancies in its derivatives trades and certain balance sheet accounts. The bank informed exchanges about receiving a formal notice and said it is cooperating fully with the probe under the Companies Act.",
            "pubDate": "2025-12-24T15:34:16.821766"
        }
    ]
}