{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-09T12:46:25.264459",
    "items": [
        {
            "title": "TCS revenue to inch up, margins may shrink in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-revenue-to-inch-up-margins-may-shrink-in-q2/articleshow/124402208.cms",
            "description": "TCS is poised to report a modest sequential revenue increase in dollar terms for the September quarter, following a prior decline. However, operating margins and net profit are anticipated to weaken due to lower employee utilization and the impact of partial salary hikes. Investors will be closely watching for insights into the deal pipeline and future outlook.",
            "pubDate": "2025-10-09T02:49:10.849764"
        },
        {
            "title": "TCS to announce Q2 results today: 10 things to track and how to trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-to-announce-q2-results-today-10-things-to-track-and-how-to-trade/articleshow/124403310.cms",
            "description": "Tata Consultancy Services announces its Q2 results today. Investors anticipate subdued growth and minimal margin changes. The company navigates challenges including employee separation, wage adjustments, and uncertain US demand. Key factors to watch include the impact of layoffs, US market outlook, revenue growth, and margin performance. Mega deals and vertical performance are also under scrutiny.",
            "pubDate": "2025-10-09T03:24:27.850235"
        },
        {
            "title": "TCS Q2 results: Top 10 takeaways from September quarter earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q2-results-top-10-takeaways-from-september-quarter-earnings/articleshow/124416997.cms",
            "description": "Tata Consultancy Services reported Q2FY26 revenue of Rs 65,799 crore, surpassing estimates, while PAT rose 1.4% YoY to Rs 12,075 crore. The company announced a Rs 11 interim dividend and highlighted AI infrastructure investments.",
            "pubDate": "2025-10-09T12:46:23.468883"
        },
        {
            "title": "TCS declares Rs 11 per share dividend, record date announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-declares-rs-11-per-share-dividend-record-date-announced/articleshow/124413574.cms",
            "description": "Tata Consultancy Services (TCS) declared a second interim dividend of Rs 11 per share after reporting a 1.4% YoY rise in Q2FY26 net profit to Rs 12,075 crore, with revenue up 2.4% to Rs 65,799 crore.",
            "pubDate": "2025-10-09T12:46:23.469008"
        },
        {
            "title": "TCS Q2 Results: Cons PAT rises 1.4% YoY to Rs 12,075 crore, misses street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q2-results-cons-pat-up-1-4-to-rs-12075-crore-misses-estimates/articleshow/124412115.cms",
            "description": "TCS Q2 Results: Tata Consultancy Services reported a 1.4% rise in Q2 net profit to Rs 12,075 crore, falling short of Street estimates. Revenue from operations grew 2.4% to Rs 65,799 crore, with a 3.7% sequential increase. The company announced an interim dividend of Rs 11 per equity share.",
            "pubDate": "2025-10-09T12:46:23.469114"
        }
    ]
}