{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-07T01:53:06.885654",
    "items": [
        {
            "title": "GIFT Nifty down 70 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126384755.cms",
            "description": "Indian equity markets experienced a second consecutive day of decline, driven by profit-booking in major stocks and escalating geopolitical concerns. Analysts anticipate a sideways trading range as positive Q3 business updates are countered by global uncertainties. The Nifty showed weakness after reaching a new high, with the trend expected to remain range-bound.",
            "pubDate": "2026-01-07T01:52:52.714852"
        },
        {
            "title": "Stocks in news: Titan, Tata Steel, JSW Steel, Pidilite Industries, M&M",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-titan-tata-steel-jsw-steel-pidilite-industries-mm/articleshow/126384740.cms",
            "description": "Markets saw a subdued session, continuing a mild correction after recent highs. Several companies are in focus today. Titan reported strong consumer business growth. Tata Steel and JSW Steel face antitrust allegations. Biocon is expanding its oncology biosimilar portfolio. Lodha Developers saw a 25% rise in sales bookings. Pidilite Industries completed a share swap deal.",
            "pubDate": "2026-01-07T01:52:52.714982"
        },
        {
            "title": "Asian stock rally eases as Japan slips, oil falls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stock-rally-eases-as-japan-slips-oil-falls/articleshow/126384723.cms",
            "description": "Asian markets took a break Wednesday after a strong start to the year. Japanese stocks dipped due to rising tensions with China. Meanwhile, US markets reached new record highs. Optimism around artificial intelligence and expectations of Federal Reserve interest rate cuts are driving investor sentiment. Investors are also watching upcoming economic data releases.",
            "pubDate": "2026-01-07T01:52:52.715087"
        },
        {
            "title": "Can Ashok Leyland sustain its rally after a 27% surge since November?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-ashok-leyland-sustain-its-rally-after-a-27-surge-since-november/articleshow/126384642.cms",
            "description": "Ashok Leyland shares are trading near record highs. The commercial vehicle maker saw strong sales growth in the December quarter. The company anticipates a better second half of FY26. This is due to lower taxes and increased infrastructure activity. Ashok Leyland is expanding its production capacity to meet rising demand.",
            "pubDate": "2026-01-07T01:52:52.715194"
        },
        {
            "title": "RIL market value falls Rs 94,000 crore in a day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-market-value-falls-rs-94000-crore-in-a-day/articleshow/126384505.cms",
            "description": "Reliance Industries shares saw a significant drop of 4.4 percent. This marked the biggest single-day fall in 18 months. The company denied a report about Russian oil heading to its Jamnagar refinery. Reliance stated no Russian crude oil deliveries were expected in January. The market value of the company decreased by approximately ₹94,000 crore.",
            "pubDate": "2026-01-07T01:52:52.715298"
        },
        {
            "title": "Sebi proposes a 30-day lag for use of price data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-a-30-day-lag-for-use-of-price-data/articleshow/126384489.cms",
            "description": "SEBI is proposing a 30-day lag for sharing listed companies' price data for educational purposes, aiming to prevent misuse while maintaining relevance. This move follows a ban on a financial influencer and a prior restriction on real-time data sharing to curb its use by online gaming platforms.",
            "pubDate": "2026-01-07T01:52:52.715394"
        },
        {
            "title": "Trent sees sharpest fall in six months after Q3 update spooks Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-falls-the-most-in-6-months-after-q3-update-spooks-street/articleshow/126384459.cms",
            "description": "Trent's shares plummeted over 8% on Tuesday, marking their steepest single-day fall in six months, following a disappointing third-quarter business update. Analysts cited a failure to meet revenue growth expectations and rich valuations as key concerns, suggesting investors might reduce their exposure to the stock.",
            "pubDate": "2026-01-07T01:52:52.715507"
        },
        {
            "title": "Profit-taking, geopolitical jitters drag indices lower for second straight session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/profit-taking-geopolitical-jitters-drag-indices-lower-in-second-straight-session/articleshow/126384395.cms",
            "description": "Index decline led by heavyweights amid geopolitical concerns Ongoing rally to be driven by Q3 earnings, govt's likely focus on capex-driven strategy, comfortable valuations: Analysts",
            "pubDate": "2026-01-07T01:52:52.715602"
        },
        {
            "title": "TPG nears deal to buy 30-40% stake in Nirmal Jain's IIFL Capital, open offer likely",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tpg-nears-deal-to-buy-30-40-stake-in-nirmal-jains-iifl-capital-open-offer-likely/articleshow/126384677.cms",
            "description": "US buyout group TPG Capital is nearing a deal to acquire a significant minority stake of 30-40% in Nirmal Jain's IIFL Capital Services. This move could position TPG as the largest shareholder, coinciding with Jain's plans to re-enter wealth management. The potential transaction, including an open offer, could be valued up to ₹8,000 crore.",
            "pubDate": "2026-01-07T01:52:52.715694"
        },
        {
            "title": "CalPERS, Enam among investors eye stake in Inox Clean Energy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/calpers-enam-among-investors-eye-atake-in-inox-clean-energy/articleshow/126384684.cms",
            "description": "Major investors are set to acquire a stake in Inox Clean Energy. This deal values the renewable energy firm at over $5 billion. The investment signals strong interest in India's clean energy sector. It will also fund Inox Clean Energy's expansion plans. The company is growing its renewable generation and solar manufacturing capacities.",
            "pubDate": "2026-01-07T01:52:52.715786"
        },
        {
            "title": "Govt, insurers and hospitals line up second consult to offer a healthy cover",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/govt-insurers-and-hospitals-line-up-second-consult-to-offer-a-healthy-cover/articleshow/126384433.cms",
            "description": "The meeting will be chaired by financial services secretary M Nagaraju, with representatives from the General Insurance Council, the Association of Healthcare Providers (India) and senior executives from insurers and hospital chains.",
            "pubDate": "2026-01-07T01:52:52.715970"
        },
        {
            "title": "Top NBFCs seek RBI nod to raise retail deposits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nbfcs-seek-rbi-nod-to-raise-retail-deposits/articleshow/126384420.cms",
            "description": "Except for a few NBFCs with legacy licences, most NBFCs are barred from raising retail deposits. Bajaj Finance, Shriram Finance, and Mahindra Finance are among the few NBFCs that are permitted to accept retail deposits. The governor met the CEOs of NBFCs, housing finance companies, microfinance institutions, and industry representatives on Monday.",
            "pubDate": "2026-01-07T01:52:52.716062"
        },
        {
            "title": "Microfinance disbursals, repayments picking up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/microfinance-disbursals-repayments-picking-up/articleshow/126384550.cms",
            "description": "The microfinance sector is showing signs of a turnaround, with several small finance banks and NBFC-MFIs reporting increased business volumes and improved repayments. While some lenders are experiencing growth, others, particularly smaller ones, continue to face challenges. The overall market has contracted, with Bandhan Bank actively cleansing its balance sheet by selling non-performing loans.",
            "pubDate": "2026-01-07T01:52:52.716151"
        },
        {
            "title": "Over 97% of bank accounts were insured at FY25 end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/over-97-of-bank-accounts-were-insured-at-fy25-end/articleshow/126384545.cms",
            "description": "As of March 2025, the DICGC insured 41.5% of total bank deposits by value, covering ₹100.12 lakh crore. The deposit insurance fund saw a 15.2% year-on-year increase, reaching ₹2.29 lakh crore. The RBI also approved a risk-based deposit insurance framework to enhance financial stability.",
            "pubDate": "2026-01-07T01:52:52.716238"
        }
    ]
}