{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-28T11:37:36.439125",
    "items": [
        {
            "title": "U.S. tariff hike can slash Indian auto component exporters’ earnings by up to Rs 4,500 crore, ICRA warns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/u-s-tariff-hike-can-slash-indian-auto-component-exporters-earnings-by-up-to-rs-4500-crore-icra-warns/articleshow/120693789.cms",
            "description": "ICRA projected that these extra expenses will shrink operating margins by 50 to 100 basis points in FY2026. According to the brokerage, the overall auto components sector may experience a 3–6% decline in operating profits, with exporters potentially facing a sharper drop of 10–15% in earnings.",
            "pubDate": "2025-04-28T11:37:19.869151"
        },
        {
            "title": "Stocks to Buy | Spotting Value: Dinshaw Irani  on sectors with strong potential for solid returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-spotting-value-dinshaw-irani-on-sectors-with-strong-potential-for-solid-returns/slideshow/120693273.cms",
            "description": "Market Expert Dinshaw Irani, in an interview to ET Now, said that FIIs have returned to the Indian market, with inflows of around $3.5–4 billion in the last two weeks. This reflects active money coming back, unlike the passive flows seen in ETFs. He sees this as a positive sign, but remains cautious as valuations appear stretched. Earnings reports are showing cuts across various sectors, making Irani cautious. Although fully invested, his approach remains cautious, with a 61-62% net exposure in long-short strategies.",
            "pubDate": "2025-04-28T11:37:19.869270"
        },
        {
            "title": "Vijay Kedia's portfolio takes a hit: 9 stocks down 15-50% in CY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedias-portfolio-takes-a-hit-9-stocks-down-15-50-in-cy25/slideshow/120693009.cms",
            "description": "Investors closely monitor the portfolios of prominent figures in the financial markets. In this regard, ETMarkets has examined the investment holdings of renowned investor Vijay Kedia. As of the latest data from the March 2025 quarter, Vijay Kedia has publicly disclosed stakes in around 15 companies, collectively valued at approximately Rs 1345 crore as of April 25. These holdings include companies where his stake exceeds 1%. The data indicates that most of these stocks have posted negative returns in CY25. We have highlighted the top nine underperforming stocks, which have experienced declines ranging from 15% to 50% in CY25 so far. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-04-28T11:37:19.869371"
        },
        {
            "title": "Defence stocks: In the short term it’s an event, in the long term a trend: 9 defence stocks with upside potential of up to 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-in-the-short-term-its-an-event-in-the-long-term-a-trend-9-defence-stocks-with-upside-potential-of-up-to-32/articleshow/120692472.cms",
            "description": "With tensions flaring up again between India and Pakistan, did you notice that it is naval moves that are making news, with missiles being fired from ships? Yes, the air force is also undertaking exercises, but somehow it is the navy that is visibly more active. Now, all this is a short-term reaction. The long-term reality is that if India is to become an economic super power, it needs much better defence capabilities. And these should not be dependent on foreign countries. Now, defence capabilities cannot be built overnight. So, ignore the short-term events and focus on defence as a long-term trend.",
            "pubDate": "2025-04-28T11:37:19.869488"
        },
        {
            "title": "How India-Pakistan tensions could impact market sentiment? Swaminathan Aiyar explains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-india-pakistan-tensions-could-impact-market-sentiment-swaminathan-aiyar-explains/articleshow/120691865.cms",
            "description": "Swaminathan Aiyar suggests that if India-Pakistan tensions remain controlled, market disruptions may be minimal. However, he warns that escalation could lead to significant economic consequences.",
            "pubDate": "2025-04-28T11:37:19.869586"
        },
        {
            "title": "China, HK stocks flat; rebound fades amid no new stimulus to counter US tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-hk-stocks-flat-rebound-fades-amid-no-new-stimulus-to-counter-us-tariffs/articleshow/120690975.cms",
            "description": "China and Hong Kong stocks barely moved on Monday after Beijing pledged to stabilise capital markets without announcing fresh stimulus to counter the hefty U.S. tariffs.",
            "pubDate": "2025-04-28T11:37:19.869681"
        },
        {
            "title": "Jio Financial Services, Polycab among 10 largecap stocks where FIIs cut stakes in Q4 FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-services-polycab-among-10-largecap-stocks-where-fiis-cut-stakes-in-q4-fy25/slideshow/120690953.cms",
            "description": "Foreign Institutional Investors (FIIs) trimmed their holdings in several large-cap stocks during the March quarter of FY25, according to StockEdge data. Here’s a look at 10 Nifty500 stocks where FIIs reduced their stakes:",
            "pubDate": "2025-04-28T11:37:19.869773"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and an upside potential of up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-an-upside-potential-of-up-to-40/articleshow/120690207.cms",
            "description": "Though the bulls continue to make a comeback, there is still uncertainty on the street. Some factor that no one had even thought about just a week back, may well emerge to influence stock movement. So, be bullish. But also be extra cautious. And be prepared for another bout of volatility in the market. Our selected stocks today depict a strong upward trajectory in their overall average score, which is based on five key pillars – earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-04-28T11:37:19.869862"
        },
        {
            "title": "European shares edge higher as investors await tariff updates, economic data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-higher-as-investors-await-tariff-updates-economic-data/articleshow/120690053.cms",
            "description": "European shares nudged higher on Monday, after registering a second consecutive weekly gain, as investors looked ahead to potential tariff developments and a busy week of earnings and economic data.",
            "pubDate": "2025-04-28T11:37:19.869952"
        },
        {
            "title": "Rich Dad, Poor Dad author Kiyosaki's latest riddle: What the poor buy too much of vs what the rich invest in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rich-dad-poor-dad-author-kiyosakis-latest-riddle-what-the-poor-buy-too-much-of-vs-what-the-rich-invest-in/articleshow/120689687.cms",
            "description": "Robert Kiyosaki, the author of Rich Dad Poor Dad, has shared a thought-provoking riddle on X, highlighting the contrasting spending habits of the rich and the poor. He suggests that the poor overspend on unnecessary items, while the wealthy prioritize acquiring assets.",
            "pubDate": "2025-04-28T11:37:19.870044"
        },
        {
            "title": "Sensex jumps 1,000 points to defy Pakistan tension. Can the stock market stay bulletproof?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-1000-points-to-defy-pakistan-tension-can-the-stock-market-stay-bulletproof/articleshow/120689767.cms",
            "description": "Despite escalating India-Pakistan tensions following a deadly attack, Indian stock markets surged, driven by strong earnings and substantial FII inflows. The Sensex and Nifty rallied, led by Reliance Industries and broad-based gains across sectors. While experts advise caution and monitoring geopolitical developments, historical data suggests limited long-term market impact from such conflicts, with investors focusing on macro trends and liquidity.",
            "pubDate": "2025-04-28T11:37:19.870136"
        },
        {
            "title": "MSCI Rejig: Nykaa may enter standard index with $210 million inflows, Adani Energy Solutions also a candidate",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/msci-rejig-nykaa-may-enter-standard-index-with-210-million-inflows-adani-energy-solutions-also-a-candidate/articleshow/120689663.cms",
            "description": "The MSCI India Standard Index rejig on May 13 may see Nykaa included, attracting $210 million in passive inflows. Adani Energy Solutions and Coromandel International have lower inclusion chances, while Thermax is likely to be excluded, potentially causing $120 million in outflows. Changes will take effect from June 3, 2025.",
            "pubDate": "2025-04-28T11:37:19.870329"
        },
        {
            "title": "Reliance Industries share price prediction: Brokerages see up to 31% upside after Q4 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-share-price-prediction-brokerages-see-up-to-31-upside-after-q4-results/articleshow/120689544.cms",
            "description": "Reliance Industries' Q4 earnings beat estimates with a 2% YoY profit rise to Rs 19,407 crore, driving a 4.4% stock rally. Brokerages raised targets up to Rs 1,708, citing strong growth prospects across energy, retail, and telecom segments, despite some softness in Jio’s performance and cautious capex outlook.",
            "pubDate": "2025-04-28T11:37:19.870441"
        },
        {
            "title": "How will US tariffs impact BOJ’s policy outlook?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-us-tariffs-impact-bojs-policy-outlook/slideshow/120689207.cms",
            "description": "The Bank of Japan is expected to keep interest rates steady when it announces its decision on Thursday. Given the growing risks to Japan's fragile economy, the BOJ is likely to maintain a cautious approach. The global economic environment, particularly US trade policy and tariffs, has increased uncertainty. This has led to concerns that the Japanese economy might face challenges that could delay future policy changes. BOJ Governor Kazuo Ueda's recent meeting in Washington may have provided further insight into these issues, influencing the BOJ’s upcoming decisions. (Source: Reuters)",
            "pubDate": "2025-04-28T11:37:19.870546"
        },
        {
            "title": "HAL, GRSE, other defence stocks rally up to 11% amid India-Pakistan tensions, Rafale deal announcement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-grse-other-defence-stocks-rally-up-11-amid-india-pakistan-tensions-rafale-deal-announcement/articleshow/120688443.cms",
            "description": "Shares of defence-related companies like Paras Defence, Garden Reach Shipbuilders, Data Patterns, Cochin Shipyard, Mazagon Dock Shipbuilders, and Hindustan Aeronautics rallied on Monday, amid heightened tensions at the Line of Control (LoC) following the recent Pahalgam terror attack and multiple ceasefire violations over the weekend.",
            "pubDate": "2025-04-28T11:37:19.870644"
        }
    ]
}