{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-08T23:41:26.929826",
    "items": [
        {
            "title": "Eternal shares in focus as 0.5% stake likely to be offloaded via Rs 1,500 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-in-focus-as-0-5-stake-likely-to-be-offloaded-via-rs-1500-crore-block-deal/articleshow/125824850.cms",
            "description": "Eternal, Zomato's parent company, will see a 0.5% stake offloaded by an institutional investor on December 8, valued up to Rs 1,500 crore at a slight discount. This stake sale occurs amidst significant capital-raising activities by rivals Zepto and Swiggy in the quick-commerce sector. Eternal's shares have shown mixed performance, with a recent decline despite positive year-to-date and six-month trends.",
            "pubDate": "2025-12-08T02:59:35.379065"
        },
        {
            "title": "IndiGo shares in focus on DGCA deadline extension, flight operations stabilisation update",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-on-dgca-deadline-extension-flight-operations-stabilisation-update/articleshow/125824811.cms",
            "description": "IndiGo's CEO has been granted an extension to respond to a DGCA show-cause notice regarding massive flight disruptions. The airline expects its network to stabilize by December 10, reporting improved on-time performance and reduced cancellations after implementing revised pilot duty norms.",
            "pubDate": "2025-12-08T02:59:35.379182"
        },
        {
            "title": "Negative Breakout: These 10 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-cross-below-their-200-dmas/slideshow/125824535.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 1,000 crore, 10 stocks fell more than 2.5% and their closing prices crossed below their 200-day moving average (200 DMA) on December 5, according to technical scan data from StockEdge.com. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-12-08T02:59:35.379282"
        },
        {
            "title": "Ravelcare shares to list today. Here's what GMP indicates ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ravelcare-shares-to-list-today-heres-what-gmp-indicates-ahead-of-debut/articleshow/125824590.cms",
            "description": "Ravelcare is set to list on the BSE SME platform on December 8. The company saw a strong subscription response for its IPO. It raised Rs 24.10 crore through a fresh issue of shares. The grey market premium indicates modest listing expectations. Ravelcare is a digital-first beauty and personal care brand.",
            "pubDate": "2025-12-08T02:59:35.379375"
        },
        {
            "title": "Clear Secured Services IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/clear-secured-services-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/125824574.cms",
            "description": "Clear Secured Services is set for its market debut on December 8 following a successful ₹85.60 crore IPO, which saw strong investor demand. The integrated facility management firm, offering diverse services to sectors like telecom and banking, aims to bolster its operations and repay debt with the raised capital. Investors will be watching its NSE-SME listing performance closely.",
            "pubDate": "2025-12-08T02:59:35.379473"
        },
        {
            "title": "Speb Adhesives shares to debut today. GMP hints at muted gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/speb-adhesives-shares-to-debut-today-gmp-hints-at-muted-gains/articleshow/125824566.cms",
            "description": "Speb Adhesives is set to debut on the NSE SME on December 8, following a moderately subscribed IPO. The company, a manufacturer of solvent-based synthetic rubber adhesives, raised funds for a new water-based adhesives facility. With steady financial growth and an expanding product range, market watchers will observe its listing performance.",
            "pubDate": "2025-12-08T02:59:35.379572"
        },
        {
            "title": "Invicta Diagnostic share to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/invicta-diagnostic-share-to-list-today-check-gmp-ahead-of-debut/articleshow/125824552.cms",
            "description": "Invicta Diagnostic is set to debut on the NSE SME platform on December 8, following a successful IPO that raised 28.12 crore. The company, operating under the PC Diagnostics brand, offers integrated pathology and radiology services across the Mumbai Metropolitan Region.  Its expansion plans, focused on new centers and equipment, aim to drive future growth.",
            "pubDate": "2025-12-08T02:59:35.379669"
        },
        {
            "title": "Astron Multigrain IPO to debut today. Here's what GMP suggests ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/astron-multigrain-ipo-to-debut-today-heres-what-gmp-suggests-ahead-of-listing/articleshow/125824492.cms",
            "description": "Astron Multigrain is set to list on the BSE SME platform on December 8 following a modest IPO that closed at ₹18.40 crore. The company, which manufactures instant noodles and other snacks, saw a 1.22 times overall subscription, with retail investors showing more interest than non-institutional investors. Proceeds will fund capital expenditure and working capital needs.",
            "pubDate": "2025-12-08T02:59:35.379762"
        },
        {
            "title": "GIFT Nifty down 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125824189.cms",
            "description": "Indian stock markets rose on Friday following a 25-basis-point rate cut by the RBI. Analysts anticipate consolidation with a positive outlook, supported by RBI's actions and steady domestic flows. Global markets showed mixed movements. Foreign portfolio investors were net sellers, while domestic institutional investors were net buyers. The Indian Rupee closed lower against the US dollar.",
            "pubDate": "2025-12-08T02:59:35.379857"
        },
        {
            "title": "Stocks in news: IndiGo, Bajaj Finserv, Eternal, Ola Electric, Fino Payments Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-indigo-bajaj-finserv-eternal-ola-electric-fino-payments-bank/articleshow/125824155.cms",
            "description": "Indian markets closed higher on Friday, showing resilience. Nifty's bounce from support suggests the uptrend may continue. IndiGo, Bajaj Finserv, Eternal, Ola Electric, and Fino Payments Bank are in focus. Bajaj Finserv plans expansion into pensions and wealth management. Ola Electric begins mass deliveries of new vehicles. RailTel and Cochin Shipyard secured new orders.",
            "pubDate": "2025-12-08T02:59:35.379989"
        },
        {
            "title": "Asian stocks tread water at the start of Fed week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-tread-water-at-the-start-of-fed-week/articleshow/125824137.cms",
            "description": "Asian stocks opened cautiously as traders assessed strained China-Japan relations and upcoming central bank decisions. Investor caution grew regarding the AI rally's sustainability, with markets anticipating policy announcements from major central banks amid renewed inflation pressures. The Federal Reserve's rate path for 2026 remains uncertain, balancing price pressures and economic activity.",
            "pubDate": "2025-12-08T02:59:35.380083"
        },
        {
            "title": "Will Nifty break past 26,350 for a fresh rally this week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-nifty-break-past-26350-for-a-fresh-rally-this-week/articleshow/125823932.cms",
            "description": "Nifty is expected to continue its uptrend, consolidating near record highs. Analysts suggest buying on dips, with a breakout potentially pushing the index towards 26,500-26,800. IndusInd Bank and PB Fintech are highlighted as top stock picks, with specific buy recommendations and targets.",
            "pubDate": "2025-12-08T02:59:35.380173"
        },
        {
            "title": "Bajaj Finserv plans foray into pension, wealth management in '26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-plans-foray-into-pension-wealth-management-in-26/articleshow/125823986.cms",
            "description": "Next year, Bajaj Finserv is paving the way for a dynamic foray into pensions and wealth management, setting the stage for a robust financial future. With ambitions to list its insurance arms in the next four to five years, this strategy is a cornerstone of their ambitious five-year roadmap aimed at tripling revenue by FY30.",
            "pubDate": "2025-12-08T02:59:35.380366"
        },
        {
            "title": "Banks unlikely to reduce deposit rates despite RBI easing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-unlikely-to-reduce-deposit-rates-despite-rbi-easing/articleshow/125823980.cms",
            "description": "Following the latest repo rate decrease, bankers foresee only slight adjustments to deposit rates. The landscape, characterized by sluggish savings yields and elevated credit-deposit ratios, restricts deeper cuts. Consequently, banks will experience continued margin pressure in the near term. However, a turnaround in profitability is anticipated later this fiscal year.",
            "pubDate": "2025-12-08T02:59:35.380460"
        },
        {
            "title": "RBI may need to inject further Rs 2 lakh crore to let rates transmit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-need-to-inject-further-2-lakh-crore-to-let-rates-transmit/articleshow/125823977.cms",
            "description": "To ensure the recent interest rate reduction truly benefits the economy, the Reserve Bank of India may have to infuse a staggering 1.5 lakh crore into the financial system. This move is seen as vital to offset the liquidity drains caused by advance tax payments and possible forex market interventions.",
            "pubDate": "2025-12-08T02:59:35.380554"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs backs healthcare leaders as bed expansion accelerates; Equirus flags SRF as a 2028 growth play",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-backs-healthcare-leaders-as-bed-expansion-accelerates-equirus-flags-srf-as-a-2028-growth-play/articleshow/125825600.cms",
            "description": "India's healthcare and chemicals sectors are poised for growth. Brokerages are recommending key companies like KIMS, Max Healthcare, and Apollo Hospitals for their expansion plans. SRF Ltd is also highlighted for its strategic positioning in speciality chemicals and refrigerant gases. Investors can look forward to potential gains as these sectors develop.",
            "pubDate": "2025-12-08T03:56:20.892187"
        },
        {
            "title": "ITC Hotels shares in focus as BAT offloads 9% stake through Rs 3,856 crore block deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-shares-in-focus-as-bat-offloads-9-stake-through-rs-3856-crore-block-deals/articleshow/125825573.cms",
            "description": "British American Tobacco’s affiliates sold a 9% stake worth about ₹3,856 crore through major block deals, drawing top global investors. The large transaction has renewed focus on the newly listed hotel chain, whose stock has been range-bound for weeks.",
            "pubDate": "2025-12-08T03:56:20.892324"
        },
        {
            "title": "M&M Financial Services among 5 stocks flashing bullish signals, indicating a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-financial-services-among-5-stocks-flashing-bullish-signals-indicating-a-possible-uptrend/slideshow/125825538.cms",
            "description": "On December 5, five stocks from the Nifty 500 pack entered the bullish scanner, known as \"White Marubozu\", according to StockEdge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-12-08T03:56:20.892428"
        },
        {
            "title": "Whirlpool of India shares in focus as $1 billion stake sale talks with Advent collapse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/whirlpool-of-india-shares-in-focus-as-1-billion-stake-sale-talks-with-advent-collapse/articleshow/125825403.cms",
            "description": "Acquisition talks between Advent International and Whirlpool Corp to sell a 31% stake in Whirlpool of India have collapsed over valuation differences. Advent reportedly sought a lower price, citing regulatory headwinds, while Whirlpool aimed to raise funds to repay debt. The failed deal would have significantly altered ownership. Whirlpool of India reported 16% FY24 revenue growth but faces intense competition.",
            "pubDate": "2025-12-08T03:56:20.892536"
        },
        {
            "title": "Ola Electric shares in focus as co begins mass deliveries of 4680 Bharat Cell powered vehicles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-in-focus-as-co-begins-mass-deliveries-of-4680-bharat-cell-powered-vehicles/articleshow/125825368.cms",
            "description": "Ola Electric has begun mass deliveries of the S1 Pro+ powered by its indigenously developed 4680 Bharat Cell, becoming the first Indian company to own both cell and battery manufacturing. The scooter promises better range, performance, and safety, strengthening India's ambition to emerge as a significant global EV manufacturing hub.",
            "pubDate": "2025-12-08T03:56:20.892634"
        },
        {
            "title": "Bajaj Finserv among 5 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-among-5-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125825324.cms",
            "description": "On December 5, in the Nifty50 pack, five stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. An RSI crossing above 50 suggests strengthening momentum. Rising RSI values indicate potential upward movement, helping traders identify early-stage buying opportunities.",
            "pubDate": "2025-12-08T03:56:20.892733"
        },
        {
            "title": "127 stock market champions of last 5 years plunge into their worst year in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/127-stock-market-champions-of-last-5-years-plunge-into-their-worst-year-in-2025/articleshow/125825229.cms",
            "description": "A significant market correction is underway as 127 stocks, previously consistent performers for five years, face their worst year in 2025. Once market darlings in sectors like capital goods and railways, these companies have seen sharp declines, with valuations peaking and leadership trends shifting. This reversal highlights a move away from indiscriminate momentum-chasing towards fundamental analysis.",
            "pubDate": "2025-12-08T03:56:20.892833"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/125825174.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-12-08T04:30:01.200692"
        },
        {
            "title": "Sensex, Nifty subdued as D-Street stays cautious ahead of Fed call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-subdued-as-d-street-stays-cautious-ahead-of-fed-call/articleshow/125825808.cms",
            "description": "Indian stock markets opened flat on Monday. Investors are watching the U.S. Federal Reserve's upcoming rate decision. The week also features significant IPO activity. Experts anticipate market volatility due to economic growth and corporate earnings revival. However, rupee depreciation and global bond yields pose challenges. Global markets showed mixed movements ahead of central bank meetings.",
            "pubDate": "2025-12-08T04:30:01.200839"
        },
        {
            "title": "Kaynes Technology among 6 F&O stocks with a sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-among-6-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125825848.cms",
            "description": "As of 5 December, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 6% compared with the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-08T04:30:01.200949"
        },
        {
            "title": "Powell walks tightrope as investors brace for split vote on interest rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/powell-walks-tightrope-as-investors-brace-for-split-vote-on-interest-rates/articleshow/125825792.cms",
            "description": "The upcoming Federal Reserve meeting is set to be unusually divisive, with policymakers split over a widely expected rate cut. Investors are watching not just the decision but also the level of dissent for clues about future policy direction. Mixed economic data and lingering uncertainty from the recent government shutdown add complexity to the outlook, even as markets largely expect a cut.",
            "pubDate": "2025-12-08T04:30:01.201050"
        },
        {
            "title": "Reliance Power shares fall over 4% after ED files chargesheet in fake bank guarantee case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-fall-over-4-after-ed-files-chargesheet-in-fake-bank-guarantee-case/articleshow/125826703.cms",
            "description": "Reliance Power shares dropped, continuing their decline after the Enforcement Directorate filed a chargesheet alleging a fake bank guarantee was used to win a government tender. The company claims it is the victim of fraud, but the chargesheet names several individuals and entities linked to the case.",
            "pubDate": "2025-12-08T05:14:45.140951"
        },
        {
            "title": "SpiceJet shares rise 13%, extending second-day rally amid IndiGo operational disruptions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-rise-13-extending-second-day-rally-amid-indigo-operational-disruptions/articleshow/125826345.cms",
            "description": "SpiceJet shares spiked intraday as operational disruptions at rival IndiGo boosted demand for its services. Despite the short-term rally, the stock remains fundamentally weak, with bearish technical indicators, high promoter pledging, and declining institutional interest. Q2 FY25 results further reflected stress, with revenue falling sharply and losses widening.",
            "pubDate": "2025-12-08T05:14:45.141045"
        },
        {
            "title": "Kaynes Technology shares down 19% in 3 days. Is a sharper correction looming?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-shares-down-19-in-3-days-is-a-sharper-correction-looming/articleshow/125826293.cms",
            "description": "Kaynes Technology shares continued their three-day decline, falling nearly 19% as investor concerns escalated following Kotak Equities’ report highlighting major inconsistencies in financial and related-party disclosures. Missing inter-company transactions, rising contingent liabilities, and accounting issues deepened the pressure.",
            "pubDate": "2025-12-08T05:14:45.141214"
        },
        {
            "title": "Brokerages split on 2025 US rate path after Morgan Stanley revises outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brokerages-split-on-2025-us-rate-path-after-morgan-stanley-revises-outlook/articleshow/125826203.cms",
            "description": "Morgan Stanley now expects the Federal Reserve to cut interest rates by a quarter-percentage point in December, aligning with J.P. Morgan and BofA Global Research. This shift follows softer economic data and dovish remarks from Fed officials. The firm anticipates further cuts in January and April, projecting a terminal rate of 3.0%-3.25%.",
            "pubDate": "2025-12-08T05:14:45.141300"
        },
        {
            "title": "Global markets brace for a packed week as Fed decision takes center stage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-markets-brace-for-a-packed-week-as-fed-decision-takes-center-stage/articleshow/125826183.cms",
            "description": "The upcoming U.S. Federal Reserve meeting is drawing intense market focus amid a rare internal split among policymakers over a potential rate cut. At the same time, major central banks globally — including those in Switzerland, Australia, Canada and Turkey — are set to announce policy decisions. Fresh data from China, persistent inflation risks, and currency pressures in Switzerland and Turkey add to the uncertainty. Despite mixed signals, investors remain broadly optimistic about 2026, though some warn that excessive confidence may be premature.",
            "pubDate": "2025-12-08T05:14:45.141380"
        },
        {
            "title": "IndiGo Fiasco: Brokerages cut target price amid large-scale flight cancellations, delays",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-fiasco-brokerages-cut-target-price-amid-large-scale-flight-cancellations-delays/articleshow/125826148.cms",
            "description": "IndiGo’s parent InterGlobe Aviation slumped, extending its seven-session slide to 15%, as major pilot duty-time rule changes caused record flight cancellations and prompted brokerages to cut price targets. Despite higher costs and operational setbacks, UBS retained its Buy call, citing IndiGo’s strong long-term growth and international expansion strategy.",
            "pubDate": "2025-12-08T05:14:45.141461"
        },
        {
            "title": "This smallcap penny stock is locked in 20% upper circuit on Birla Group’s exit. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-smallcap-penny-stock-is-locked-in-20-upper-circuit-on-birla-groups-exit-do-you-own/articleshow/125827235.cms",
            "description": "Kesoram Industries surged 20% after Frontier Warehousing acquired a 42.8% controlling stake through a block deal, marking the Birla family’s full exit from the company. The stake purchase follows the earlier demerger of Kesoram’s cement business into UltraTech, leaving the firm focused on its non-cement operations.",
            "pubDate": "2025-12-08T05:39:29.063154"
        },
        {
            "title": "Fino Payments Bank shares slide 6% despite landmark RBI nod for small finance bank conversion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fino-payments-bank-shares-slide-6-despite-landmark-rbi-nod-for-small-finance-bank-conversion/articleshow/125827273.cms",
            "description": "Fino Payments Bank fell 6% to Rs 295.75 even after becoming the first Payments Bank in India to get RBI’s in-principle approval to convert into a Small Finance Bank (SFB). The transition is aimed at expanding its product portfolio, lending operations, and customer reach.",
            "pubDate": "2025-12-08T05:51:21.664336"
        },
        {
            "title": "Meesho shares command 36% GMP ahead of December 10 listing. Check all details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-command-36-gmp-ahead-of-december-10-listing-check-all-details/articleshow/125827916.cms",
            "description": "Meesho shares are trading at a grey market premium of Rs 40–41, a 36% gain over the IPO price, ahead of the company’s market debut on December 10. IPO allotments will be finalized by December 8, with shares credited to demat accounts on December 9.",
            "pubDate": "2025-12-08T06:37:47.791797"
        },
        {
            "title": "Suzlon Energy share price target at Rs 76. Here’s what ICICI Securities, Motilal Oswal say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-share-price-target-at-rs-76-heres-what-icici-securities-motilal-oswal-say/articleshow/125828740.cms",
            "description": "Suzlon Energy shares saw a rise following positive analyst outlooks. Experts foresee significant growth driven by strong operational momentum and a growing order book. The company is poised to benefit from increased demand for wind energy. Analysts have reiterated their buy ratings, highlighting potential upside from current market levels. Suzlon's expansion plans and export market readiness are key factors.",
            "pubDate": "2025-12-08T07:27:17.797760"
        },
        {
            "title": "Warning Signal? FIIs cut stake in 11 smallcap stocks in the last 3 quarters; prices crash up to 70%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warning-signal-fiis-cut-stake-in-11-smallcap-stocks-in-the-last-3-quarters-prices-crash-up-to-70/slideshow/125828897.cms",
            "description": "Tracking where major institutional investors, especially Foreign Institutional Investors (FIIs), are placing their bets is crucial. Just as important is monitoring where they are consistently pulling back. According to the latest September 2025 shareholding data, FIIs have been steadily reducing their stakes in about 202 small-cap companies over the last three consecutive quarters.",
            "pubDate": "2025-12-08T07:27:17.797895"
        },
        {
            "title": "ICICI Securities sees up to 21% upside in ITC Hotels, initiates coverage with buy call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-securities-sees-up-to-21-upside-in-itc-hotels-initiates-coverage-with-buy-call/articleshow/125829428.cms",
            "description": "ICICI Securities has initiated coverage on ITC Hotels with a 'buy' rating and a target price of Rs 250. The brokerage anticipates a multi-year growth phase for the hospitality major. This growth is expected to be fueled by a rapid scale-up in managed properties and a strong net-cash position. The company's robust pipeline could expand its portfolio significantly by 2030.",
            "pubDate": "2025-12-08T07:42:58.024222"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 35 % in one year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-35-in-one-year/articleshow/125829087.cms",
            "description": "If the volatility the street is witnessing today is bothering you, just remember: Volatility is part of every market run thanks to periodic profit-booking. Can it continue? Probably yes. And given the fact that December is the month when FPIs tend to sell, there can be phases of correction in large-cap stocks. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-12-08T07:42:58.024324"
        },
        {
            "title": "Jio’s upcoming IPO likely to support telecom sector’s 12% CAGR ARPU growth by FY 28: JM Financial",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jios-upcoming-ipo-likely-to-support-telecom-sectors-12-cagr-arpu-growth-by-fy-28-jm-financial/articleshow/125829748.cms",
            "description": "JM Financial believes Reliance Jio’s planned IPO in 1HCY26 could be a major catalyst for India’s telecom sector, strengthening tariff-hike visibility, ARPU expansion and free cash flow for both Jio and Bharti Airtel. The brokerage projects ~12% ARPU CAGR through FY28, driven by tariff resets and premiumisation.",
            "pubDate": "2025-12-08T07:58:52.257468"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty amid bullish technicals, macro support",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-amid-bullish-technicals-macro-support/articleshow/125829542.cms",
            "description": "The Nifty index shows positive momentum. Technical indicators suggest continued strength. Economic factors like GDP figures and repo rate cuts support a bullish outlook. Experts recommend a buy-on-dips strategy. A Bull Call Spread is advised for traders to benefit from potential gains with defined risk. This strategy offers a good risk-reward for a steady uptrend.",
            "pubDate": "2025-12-08T07:58:52.257603"
        },
        {
            "title": "Adani Enterprises Rs 25,000 cr rights issue sees strong demand surge; RE price jumps 23% in 2 sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-rs-25000-cr-rights-issue-sees-strong-demand-surge-re-price-jumps-23-in-2-sessions/articleshow/125830602.cms",
            "description": "Adani Enterprises’ Rs 25,000 crore rights issue is seeing strong traction, with nearly half the bids coming in just two days. The Rights Entitlement price has surged 23%, signalling heightened investor interest. The discounted issue price and partly-paid structure are drawing global and domestic investors ahead of the December 10 RE trading deadline.",
            "pubDate": "2025-12-08T08:56:27.976508"
        },
        {
            "title": "Rs 37,000 crore gone in 6 days! Can IndiGo shares make a comeback?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-37000-crore-gone-in-6-days-can-indigo-shares-make-a-comeback/articleshow/125830516.cms",
            "description": "IndiGo shares have plunged over 16% in six sessions, erasing Rs 37,000 crore in market value as severe operational disruptions and new FDTL norms trigger widespread cancellations. Brokerages have slashed targets citing rising costs and pilot shortages, though some see long-term strength despite near-term turbulence and regulatory scrutiny.",
            "pubDate": "2025-12-08T08:56:27.976632"
        },
        {
            "title": "Japan's Nikkei buoyed by stable yen; SoftBank's slide caps gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-buoyed-by-stable-yen-softbanks-slide-caps-gains/articleshow/125831424.cms",
            "description": "Japan's Nikkei share average edged higher on Monday, supported by a pause in recent yen strength and a rebound in property shares, but was held back by sharp declines for heavyweight stock SoftBank Group.",
            "pubDate": "2025-12-08T09:46:24.875783"
        },
        {
            "title": "European shares slip as consumer stocks weigh; Unilever falls after Magnum demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-slip-as-consumer-stocks-weigh-unilever-falls-after-magnum-demerger/articleshow/125831347.cms",
            "description": "European shares were muted on Monday, with declines in consumer-facing stocks offsetting gains in industrials and healthcare stocks, while investors awaited the U.S. Federal Reserve's monetary policy meeting this week.",
            "pubDate": "2025-12-08T09:46:24.875889"
        },
        {
            "title": "Why stock market is falling today? Sensex crashes over 700 points, Nifty below 26,000 ahead of Fed meet. Key factors explained",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-falling-today-sensex-crashes-over-700-points-nifty-below-26000-ahead-of-fed-meet-key-factors-explained/articleshow/125831238.cms",
            "description": "Indian equity markets experienced a significant dip on Monday, with both Sensex and Nifty declining by nearly 1%. Investors cashed in on gains in small and midcap stocks, while foreign fund outflows and anticipation of the US Federal Reserve's policy decision added to the cautious mood. Selling pressure impacted major index components, leading to substantial intraday losses.",
            "pubDate": "2025-12-08T09:46:24.876088"
        },
        {
            "title": "Ambit initiates coverage on Tata Motors CV with ‘Buy’ rating, sets target price at Rs 430",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambit-initiates-coverage-on-tata-motors-cv-with-buy-rating-sets-target-price-at-rs-430/articleshow/125831666.cms",
            "description": "Ambit Capital has initiated coverage on Tata Motors’ CV business with a ‘Buy’ rating, citing market leadership, operating leverage and Iveco-driven global expansion. Strong revenue and EBITDA trends, improving execution, and strategic restructuring support long-term prospects, though market share volatility and execution risks remain key variables influencing potential re-rating momentum.",
            "pubDate": "2025-12-08T10:20:13.706893"
        },
        {
            "title": "Indian or MNC pharma companies? There are reasons to look at both: 5 pharma stocks with upside potential of up to 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-or-mnc-pharma-companies-there-are-reasons-to-look-at-both-5-pharma-stocks-with-upside-potential-of-up-to-38/articleshow/125832231.cms",
            "description": "Around two decades ago, as Indian pharma firms first began to move into the US market, they faced many challenges, the biggest of which was to take the regulator for granted.  And the fact is that they still do face challenges; but these are easily handled today as they have grown much bigger and are much more stable in overall terms.",
            "pubDate": "2025-12-08T10:56:01.733521"
        },
        {
            "title": "ICICI Prudential AMC IPO: Check ICICI Bank shareholder quota and cut-off date for eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-amc-ipo-check-icici-bank-shareholder-quota-and-cut-off-date-for-eligibility/articleshow/125832389.cms",
            "description": "ICICI Prudential AMC will open its IPO on December 12 as a pure offer for sale worth about Rs 10,600 crore. With strong AUM leadership, rising profitability, and low capital intensity, the AMC enters the market with favourable industry tailwinds, broad scheme offerings, and strong investor visibility through shareholder reservation.",
            "pubDate": "2025-12-08T10:56:01.733638"
        },
        {
            "title": "Gainers & Losers: Indigo, SpiceJet among 7 stocks that made headlines on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-indigo-spicejet-among-7-stocks-that-made-headlines-on-monday/slideshow/125833557.cms",
            "description": "",
            "pubDate": "2025-12-08T11:43:14.694035"
        },
        {
            "title": "US stocks open higher as investors await Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-investors-await-fed-rate-decision/articleshow/125837658.cms",
            "description": "Wall Street's main indexes opened modestly higher on Monday as investors priced in expectations that the Federal Reserve will deliver a long-awaited rate cut later this week in a meeting that is shaping up to be one of the most divisive in years.",
            "pubDate": "2025-12-08T14:44:17.873614"
        },
        {
            "title": "Two Trades for Today: A life insurance major for a 4.2% upmove; a mid-cap housing finance stock for an almost 6% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-life-insurance-major-for-a-4-2-upmove-a-mid-cap-housing-finance-stock-for-an-almost-6-rise/articleshow/125837454.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-08T14:44:17.873735"
        },
        {
            "title": "MCX Of India and 3 stocks hit 52-week highs & gain up to 15% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-of-india-and-3-stocks-hit-52-week-highs-amp-gain-up-to-15-in-a-month/slideshow/125834748.cms",
            "description": "On Monday, the benchmark Sensex dropped 610 points to close at 85,103. Despite the overall market decline, four BSE 500 stocks climbed to new 52-week highs, marking their strongest levels in a year. Such breakouts typically signal bullish momentum and the potential for further short-term gains.",
            "pubDate": "2025-12-08T14:44:17.873847"
        },
        {
            "title": "Berkshire Hathaway shakes up management as Buffett prepares handover to Abel",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-hathaway-shakes-up-management-as-buffett-prepares-handover-to-abel/articleshow/125837363.cms",
            "description": "Berkshire Hathaway announced a shakeup of its top management team on Monday, just weeks before Warren Buffett hands over the reins of the company to Greg Abel.",
            "pubDate": "2025-12-08T14:44:17.873945"
        },
        {
            "title": "Digital accessibility: Sebi comes out with format for compliance for registered entities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/digital-accessibility-sebi-comes-out-with-format-for-compliance-for-registered-entities/articleshow/125836110.cms",
            "description": "Markets regulator Sebi on Monday issued a format for registered entities to report their readiness and compliance with accessibility requirements for each investor-facing digital platform, ensuring these platforms can be effectively used by persons with disabilities.",
            "pubDate": "2025-12-08T14:44:17.874040"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125835773.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-08T14:44:17.874132"
        },
        {
            "title": "India's current bull run triggered a big wealth transfer from poor to rich: Shankar Sharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-current-bull-run-triggered-a-biggest-wealth-transfer-from-poor-to-rich-shankar-sharma/articleshow/125835645.cms",
            "description": "Shankar Sharma argues India’s bull market is enabling a massive wealth transfer from small investors to promoters, funds and intermediaries, driven largely by retail losses in F&O trading even as markets hit record highs.",
            "pubDate": "2025-12-08T14:44:17.874221"
        },
        {
            "title": "Sebi eases AIF rules, allows AI-only schemes & wider exemptions for large value funds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-eases-aif-rules-allows-ai-only-schemes-wider-exemptions-for-large-value-funds/articleshow/125835173.cms",
            "description": "Sebi introduced a new framework allowing AIFs to launch AI-only schemes for accredited investors, simplify compliance for LVFs, enable scheme migration with consent and provide key relaxations while strengthening reporting and oversight requirements.",
            "pubDate": "2025-12-08T14:44:17.874317"
        },
        {
            "title": "Sebi to change rules to prohibit usage of current live market data for investor education: Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-change-rules-to-prohibit-usage-of-current-live-market-data-for-investor-education-pandey/articleshow/125834914.cms",
            "description": "Sebi chairman Tuhin Kanta Pandey on Monday said the markets regulator will soon change the rules to prohibit the usage of current live market data for investor education.",
            "pubDate": "2025-12-08T14:44:17.874408"
        },
        {
            "title": "Cash-Rich & Growing: 10 stocks with rising operating cash flow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cash-rich-amp-growing-10-stocks-with-rising-operating-cash-flow/slideshow/125834547.cms",
            "description": "Rising cash from operations shows that a company is generating more cash from its core business activities. From the Nifty500 pack, we have highlighted the top 10 companies whose cash from operations has grown consistently each year over the past five fiscal years up to FY25, based on cash-flow scans from StockEdge.com. This trend indicates stronger profitability, improved resource management, and a positive financial outlook. It also suggests these companies rely less on external funding to support their operations.",
            "pubDate": "2025-12-08T14:44:17.874501"
        },
        {
            "title": "Fino Payments Bank shares plunge 11% after nod for small finance bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fino-payments-bank-shares-plunge-11-after-nod-for-small-finance-bank/articleshow/125839865.cms",
            "description": "Fino Payments Bank shares dropped significantly on Monday despite receiving an in-principle license to become a small finance bank. The Reserve Bank of India granted the license, but the holding company must reduce stakes held by key investors like Bharat Petroleum Corp and Blackstone GPV Capital Partners within 18 months.",
            "pubDate": "2025-12-08T17:27:32.567655"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/125839226.cms",
            "description": "Sensex and Nifty fell up to 1% as broad profit-booking, persistent FII outflows, currency weakness and caution ahead of the Fed decision weighed on sentiment, triggering volatility, technical weakness and widespread declines across sectors and stocks.",
            "pubDate": "2025-12-08T17:27:32.567778"
        },
        {
            "title": "These large-cap stocks have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-cap-stocks-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-25/articleshow/125841529.cms",
            "description": "All long-term investors know that corrections are part of every bull run. But the fact is that when a correction plays out, it is not easy to be rational. At this point of time, we are in a somewhat similar situation. Money, however, is made when one is able to think beyond what is happening in the short term. So, stick with companies where the quality of the balance sheet is strong and there is little need for further debt. The reason why we are focusing on the debt part is that when interest rates are low and there is easy liquidity, history tells us that many companies tend to go overboard and take on debt.",
            "pubDate": "2025-12-08T17:43:18.177299"
        },
        {
            "title": "Volatility is an opportunity, but with caveats: 5 mid-cap stocks from different sectors with an upside potential of up to 41%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/volatility-is-an-opportunity-but-with-caveats-5-mid-cap-stocks-from-different-sectors-with-an-upside-potential-of-up-to-41/articleshow/125842387.cms",
            "description": "There is little doubt that the overall picture as far as the market is concerned is bullish. But Monday’s trade, as well as the way the market has been behaving over the past few sessions, just goes to show that volatility cannot be wished away. Even in a bullish market, you will see profit-booking, rational shifting, consolidation, or distribution. Whenever the market attempts to move into a fresh phase of upward movement, these things do happen. So, even as you turn bullish, be prepared to deal with volatility. And that means being selective and cautious, especially if you are interested in the mid-cap segment.",
            "pubDate": "2025-12-08T18:36:54.585138"
        },
        {
            "title": "Stock Radar: Indus Towers stock on verge of a breakout from falling trendline resistance; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-indus-towers-stock-on-verge-of-a-breakout-from-falling-trendline-resistance-time-to-buy/articleshow/125833140.cms",
            "description": "Indus Towers is nearing a breakout from a falling trendline resistance on weekly charts, potentially signaling a move higher. Experts suggest buying above Rs 415-425 for targets around Rs 460. The stock is consolidating near this resistance, showing accumulation and a potential upward resolution.",
            "pubDate": "2025-12-08T23:41:26.050390"
        }
    ]
}