{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-06T12:12:45.488273",
    "items": [
        {
            "title": "Trump Media reports $19 mln loss in third quarter on TV streaming costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trump-media-reports-19-mln-loss-in-third-quarter-on-tv-streaming-costs/articleshow/114998215.cms",
            "description": "Trump Media & Technology Group faced a loss of $19.2 million in the third quarter. The company attributed this to legal fees and costs associated with its TV streaming deal. The company spent $12.1 million on legal fees related to acquiring TV streaming technology and its SPAC deal. Despite the loss, shares of the company rose slightly.",
            "pubDate": "2024-11-06T02:52:15.476523"
        },
        {
            "title": "Q2 results today: Tata Steel, Apollo Hospitals among 98 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-tata-steel-apollo-hospitals-among-98-companies-to-announce-earnings-on-wednesday/articleshow/114998164.cms",
            "description": "Get ready for a busy day in the Indian stock market. 63 companies will reveal their July-September earnings today.  Keep an eye on major players like Power Grid and Tata Steel.  Apollo Hospitals is expected to report strong numbers. Tata Steel might face challenges due to declining realizations.  Stay tuned for the detailed financial results and expert analysis.",
            "pubDate": "2024-11-06T02:52:15.476640"
        },
        {
            "title": "JK Tyres Q2 net falls 42% on weak demand, high natural rubber prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jk-tyres-q2-net-falls-42-on-weak-demand-high-natural-rubber-prices/articleshow/114997978.cms",
            "description": "JK Tyre & Industries' consolidated net profit plummeted by 42% in the September quarter, primarily due to a downturn in the commercial vehicle sector and a surge in natural rubber prices. Despite implementing price hikes, the company experienced a decline in revenue and margins.",
            "pubDate": "2024-11-06T02:52:15.476743"
        },
        {
            "title": "Raymond Lifestyle Q2 Results: Profit slides 70% YoY to Rs 42 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/raymond-lifestyle-q2-results-profit-slides-70-yoy-to-rs-42-crore/articleshow/115004234.cms",
            "description": "Raymond Lifestyle witnessed a significant 69.72% drop in its consolidated net profit for Q2 FY'25, reaching Rs 42.18 crore. This decline is attributed to subdued demand and inflationary pressures. Despite this, the company remains optimistic about the future, citing recent positive trends in the festive and wedding season and plans for retail expansion and new product launches.",
            "pubDate": "2024-11-06T07:52:09.517989"
        },
        {
            "title": "Apollo Hospitals Q2 Results: PAT soars 63% YoY to Rs 379 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-q2-results-pat-soars-63-yoy-to-rs-379-crore-beats-estimates/articleshow/115015723.cms",
            "description": "Apollo Hospitals Q2 Results: Revenue from operations rose 15% year-on-year to Rs 5,589 crore in the July-September 2024 period, surpassing ET Now’s poll estimate of Rs 5,485 crore. EBITDA for the second quarter reached Rs 816 crore, marking a 30% year-on-year increase.",
            "pubDate": "2024-11-06T12:12:44.860024"
        }
    ]
}