{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-19T04:52:56.618481",
    "items": [
        {
            "title": "HUL shares in focus after firm sets December 5 as record date for ice-cream business demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-in-focus-after-firm-sets-december-5-as-record-date-for-ice-cream-business-demerger/articleshow/125425976.cms",
            "description": "HUL shares: The company's board has fixed record date for the demerger of it's ice-cream division.",
            "pubDate": "2025-11-19T03:36:15.232151"
        },
        {
            "title": "KEC International shares in spotlight as Power Grid Corp bars firm from new tenders for 9 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kec-international-shares-in-spotlight-as-power-grid-corp-bars-firm-from-new-tenders-for-9-months/articleshow/125425964.cms",
            "description": "KEC International shares: The company sid that Power Grid has banned it for bidding for the utility tenders.",
            "pubDate": "2025-11-19T03:36:15.232260"
        },
        {
            "title": "Devyani International among 5 stocks that closed above VWAP, signaling a bullish shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/devyani-international-among-5-stocks-that-closed-above-vwap-signaling-a-bullish-shift/slideshow/125425832.cms",
            "description": "On November 18, the closing prices of five stocks in the Nifty500 pack rallied more than 1% above their VWAP (Volume-Weighted Average Price). A move above the VWAP indicates a potential bullish trend, according to technical scan data from stockedge.com.When the closing price rises above the VWAP, it signifies that the stock closed higher than the average price at which it traded throughout the day, with the average weighted by trading volume. This is often interpreted by traders and investors as a bullish signal, indicating strengthening market sentiment.",
            "pubDate": "2025-11-19T03:36:15.232370"
        },
        {
            "title": "Bombay Burmah among 7 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bombay-burmah-among-7-stocks-showing-bullish-rsi-upswing/slideshow/125425783.cms",
            "description": "On November 18, seven stocks from the Nifty500 pack were highlighted in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal occurs when the RSI value crosses above 50 from below. “RSI Trending Up” indicates that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock price. This can signal potential upward movement and may help traders identify buying opportunities.",
            "pubDate": "2025-11-19T03:36:15.232465"
        },
        {
            "title": "Inside the short-selling trap of Groww's near multibagger surge: What happened and what it means for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inside-the-short-selling-trap-of-growws-near-multibagger-surge-what-happened-and-what-it-means-for-investors/articleshow/125425202.cms",
            "description": "Groww shares faced unusual settlement problems after a strong rally. Over 30 lakh shares went into auction due to short sellers unable to deliver. A short squeeze intensified the price rise. While the auction settled deliveries, investors now watch for fundamental trading as extreme pressures ease. Valuations are a key concern for the future.",
            "pubDate": "2025-11-19T03:36:15.232560"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Sun Tv, Glenmark Pharma among 5 stocks that could give 17-33% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-sun-tv-glenmark-pharma-among-5-stocks-that-could-give-17-33-return/slideshow/125425104.cms",
            "description": "Analysts remain broadly bullish across sectors, with multiple brokerages issuing fresh Buy calls and highlighting meaningful upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-19T03:36:15.232655"
        },
        {
            "title": "Negative Breakout: These 12 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-12-stocks-cross-below-their-200-dmas/slideshow/125425040.cms",
            "description": "In the Nifty500 pack, 12 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on November 18, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-11-19T03:36:15.232749"
        },
        {
            "title": "S&P 500 ends down for a 4th day as valuation worries weigh, Home Depot drops",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-ends-down-for-a-4th-day-as-valuation-worries-weigh-home-depot-drops/articleshow/125424871.cms",
            "description": "Indian markets mirrored global sentiment as US stocks tumbled, driven by tech stock valuations and a weak Home Depot forecast. Investors eagerly await Nvidia's results amid AI exuberance concerns. Job market data also showed a cooling trend, adding to market jitters. Despite strong overall earnings, fears are circulating.",
            "pubDate": "2025-11-19T03:36:15.232840"
        },
        {
            "title": "US market slide frays investors' nerves with AI trade, rate-cut doubts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-slide-frays-investors-nerves-with-ai-trade-rate-cut-doubts/articleshow/125424665.cms",
            "description": "U.S. stocks are experiencing their biggest pullback in months, raising investor nerves ahead of key tests for the AI trade and interest rate cut expectations. Nvidia's earnings report and upcoming employment data will be crucial in determining the market's direction as investors assess economic health and potential Fed policy shifts.",
            "pubDate": "2025-11-19T03:36:15.232944"
        },
        {
            "title": "GIFT Nifty up 35 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125424454.cms",
            "description": "Equity markets declined on Tuesday as investors booked profits amid diminished expectations of a US Fed rate cut. Analysts suggest progress on the Indo-US trade deal and a strong domestic earnings outlook could revive confidence and support the Nifty's ascent towards 26,000. The India VIX rose, indicating increased market fear.",
            "pubDate": "2025-11-19T03:36:15.233047"
        },
        {
            "title": "Stocks in news: Groww, HUL, Infosys, Sequent Scientific, TCS, Azad Engineering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-groww-hul-infosys-sequent-scientific-tcs-azad-engineering/articleshow/125424423.cms",
            "description": "Indian markets experienced a volatile trading session on weekly expiry day, declining by nearly half a percent. This extends the current consolidation phase. Analysts suggest a cautiously optimistic undertone supported by firm domestic macro indicators. Several companies like Groww, HUL, Adani Ports, TCS, and Infosys are in focus due to recent developments and upcoming corporate actions.",
            "pubDate": "2025-11-19T03:36:15.233142"
        },
        {
            "title": "Asian shares fluctuate after three-day selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-fluctuate-after-three-day-selloff/articleshow/125424401.cms",
            "description": "Asian equities showed mixed performance as global markets reacted to Wall Street's sharp losses, particularly in tech stocks driven by AI concerns. Investors are closely watching Nvidia's earnings report and the Federal Reserve's potential interest rate decisions amid renewed market volatility and mixed economic data.",
            "pubDate": "2025-11-19T03:36:15.233235"
        },
        {
            "title": "FPIs favour Indian debt inclusion in Bloomberg's Global Aggregate Index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-favour-indian-debt-inclusion-in-bloombergs-global-aggregate-index/articleshow/125424343.cms",
            "description": "Foreign portfolio investors have offered positive feedback on Bloomberg Aggregate Index services, boosting the likelihood of Indian debt being included in the global index. Participants cited ease of trading, India's sovereign rating, and competitive bond returns as key factors. This follows India's inclusion in the emerging market local currency bond index earlier this year.",
            "pubDate": "2025-11-19T03:36:15.233325"
        },
        {
            "title": "ED widens probe into 50+ entities over penny stock laundering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ed-widens-probe-into-50-entities-over-penny-stock-laundering/articleshow/125424262.cms",
            "description": "The Enforcement Directorate is investigating over 50 individuals and firms for alleged money laundering through penny stock price rigging. Notices have been issued under the PMLA, requiring disclosure of financial information and associations with manipulated companies. This probe follows a raid on a tech firm, uncovering a syndicate involved in elaborate stock manipulation schemes.",
            "pubDate": "2025-11-19T03:36:15.233417"
        },
        {
            "title": "Why has CreditAccess Grameen fallen nearly 10% since its Q2 results?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-has-creditaccess-grameen-fallen-nearly-10-since-its-q2-results/articleshow/125424242.cms",
            "description": "CreditAccess Grameen's stock has declined due to concerns over higher credit costs stemming from delayed improvement in its portfolio at risk. Despite accelerated write-offs in H1 FY26, the company is focusing on customer accretion and enhancing borrower quality. Analysts anticipate improved return ratios in the latter half of the fiscal year.",
            "pubDate": "2025-11-19T03:36:15.233514"
        },
        {
            "title": "Operating in niche areas & having gone through many business cycles: 5 small-cap stocks that fit the bill for long-term investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/operating-in-niche-areas-having-gone-through-many-business-cycles-5-small-cap-stocks-that-fit-the-bill-for-long-term-investors/articleshow/125424158.cms",
            "description": "A few more weeks of the Nifty and Sensex moving upward, and investors will again start to look at small-cap stocks with interest. Nothing wrong with that. But when it comes to small-caps, just check if the company has some advantage. It could be a product, a brand, a niche segment, or that it meets certain financial criteria. If it has some of these, then buy it and ride the rally over the long term to create wealth. The key words here are long term.",
            "pubDate": "2025-11-19T03:36:15.233604"
        },
        {
            "title": "Groww shares hit 10% lower circuit after 90% relentless gain; analysts say book profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-hit-10-lower-circuit-after-90-relentless-gain-analysts-say-book-profits/articleshow/125427250.cms",
            "description": "Groww’s parent, Billionbrains Garage Venture, hit a 10% lower circuit after a steep post-listing rally of over 90%, signalling early selling pressure. Analysts attribute the decline to stretched valuations and rally fatigue, especially as peers like Angel One and Motilal Oswal trade at lower market caps. While the long-term story remains strong, experts caution that cyclical industry trends and potential regulatory changes could impact growth.",
            "pubDate": "2025-11-19T04:52:41.276154"
        },
        {
            "title": "Slowly, but surely! 6 brokers see earnings improving ahead after Q2 results. 50 stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/slowly-but-surely-6-brokers-see-earnings-improving-ahead-after-q2-results-50-stocks-to-buy/articleshow/125426959.cms",
            "description": "Indian companies are showing signs of earnings improvement following Q2 results, with six brokers anticipating steadier profit growth in upcoming quarters. While large-cap stocks appear safer, margins may have peaked. Analysts are optimistic but cautious, with around 50 buy-rated stocks identified across various sectors, including banking, autos, and IT.",
            "pubDate": "2025-11-19T04:52:41.276303"
        },
        {
            "title": "Big relief coming as India-US trade deal inches closer. 10 stocks with upside of 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-relief-coming-as-india-us-trade-deal-inches-closer-10-stocks-with-upside-of-34/slideshow/125427036.cms",
            "description": "Investor sentiment could turn positive after the government signaled that an India–US trade pact is nearing completion, with both sides close to resolving tariff-related issues. A smoother trade framework could boost export-oriented and globally linked sectors. These ten stocks, identified using data from Stock Reports Plus, may see tailwinds if the deal unlocks better market access.",
            "pubDate": "2025-11-19T04:52:41.276414"
        },
        {
            "title": "Tenneco Clean Air India shares make a healthy D-St debut, list at 27% premium on NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tenneco-clean-air-india-shares-make-a-healthy-d-st-debut-list-at-27-premium-on-nse/articleshow/125426901.cms",
            "description": "Tenneco Clean Air India shares: Tenneco Clean Air India made a strong market debut, listing at a 27% premium on the NSE and 25.4% on the BSE. The Rs 3,600-crore IPO, an entirely offer-for-sale issue, saw heavy institutional interest, with overall subscription at 61.79 times, led by QIBs at 174.78 times. The robust response highlights investor confidence in the company’s business model and global pedigree.",
            "pubDate": "2025-11-19T04:52:41.276519"
        },
        {
            "title": "Waaree Energies shares tumble 6% as Income Tax Department visits offices across India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-tumble-6-as-income-tax-department-visits-offices-across-india/articleshow/125426823.cms",
            "description": "Shares of Waaree Energies fell up to 6% after Income Tax officials visited its facilities for an investigation. The company, which reported strong Q2 net profit growth of 133% to Rs 842 crore, confirmed full cooperation with authorities. An interim dividend of Rs 2/share was recently paid.",
            "pubDate": "2025-11-19T04:52:41.276618"
        },
        {
            "title": "Foreign holdings of US treasuries slip for first time in six months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-holdings-of-us-treasuries-slip-for-first-time-in-six-months/slideshow/125426916.cms",
            "description": "Foreign holdings of U.S. Treasuries declined in September for the first time in six months, according to data released after the Treasury Department’s 43-day shutdown. The slight pullback comes ahead of the next update, with October data scheduled for release on December 18. (Source: Reuters)",
            "pubDate": "2025-11-19T04:52:41.276717"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama on Titagarh Rail System; Motilal Oswal initiates coverage on PB Fintech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-on-titagarh-rail-system-motilal-oswal-initiates-coverage-on-pb-fintech/articleshow/125426399.cms",
            "description": "The crypto market experienced a sharp downturn, wiping out nearly Rs 1 trillion in just six weeks as Bitcoin fell below USD 90,000. The sudden decline has triggered widespread investor concern and renewed fears of a major market crash in digital assets.",
            "pubDate": "2025-11-19T04:52:41.276819"
        },
        {
            "title": "2026 IPOs bigger & better: Focus on Reliance Jio, NSE, Flipkart, SBI MF, Zepto, PhonePe, more",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2026-ipos-bigger-better-focus-on-reliance-jio-nse-flipkart-sbi-mf-zepto-phonepe-more/slideshow/125426649.cms",
            "description": "India’s primary market is preparing for one of its biggest years, with Equirus Capital projecting IPO fundraising of nearly Rs 1.77 lakh crore in 2026. The pipeline includes some of the country’s most anticipated listings across technology, finance and telecom. Here are 10 biggest issues",
            "pubDate": "2025-11-19T04:52:41.276914"
        },
        {
            "title": "Sensex slips over 50 pts, Nifty drops below 25,900 as D-St awaits cues on India–US trade talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-50-pts-nifty-drops-below-25900-as-d-st-awaits-cues-on-indiaus-trade-talks/articleshow/125426441.cms",
            "description": "On a lackluster Wednesday, Indian stock markets registered a downturn, with the Sensex and Nifty both halting their upward momentum. Global sentiments echoed this caution, as traders awaited clearer signals regarding a prospective trade agreement between India and the US. The Sensex fell 82 points while the Nifty 50 experienced a 31-point decline right at the open.",
            "pubDate": "2025-11-19T04:52:41.277010"
        },
        {
            "title": "Worried about an AI stock bubble? That might be good news for Nifty bulls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/worried-about-an-ai-stock-bubble-that-might-be-good-news-for-nifty-bulls/articleshow/125426521.cms",
            "description": "Global investors are eyeing India as the AI stock frenzy shows signs of a bubble, potentially shifting capital from tech giants to Indian equities.  Experts suggest this rotation could boost India's Nifty50, which has lagged due to AI-driven flows into Taiwan and South Korea. India's market, less reliant on AI, offers a potential haven.",
            "pubDate": "2025-11-19T04:52:41.277106"
        },
        {
            "title": "KP Energy shares soar 8% on MoU with Inox Wind to develop 2.5 GW renewable projects across India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-kp-energy-shares-in-focus-on-mou-to-develop-2-5-gw-renewable-projects-across-india/articleshow/125426280.cms",
            "description": "Inox Wind and KP Energy have signed an exclusive MoU to jointly develop 2.5 GW of wind and wind-solar hybrid projects across multiple states. Inox Wind will supply turbines, engineering support, and handle turbine commissioning and O&M, while KP Energy will manage land, approvals, connectivity, and balance-of-plant EPC and O&M. The collaboration aims to streamline project execution and boost efficiency.",
            "pubDate": "2025-11-19T04:52:41.277219"
        },
        {
            "title": "Bharti Airtel among 5 stocks that witnessed 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-among-5-stocks-that-witnessed-5-year-swing-high-breakout/slideshow/125426160.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, five stocks witnessed a 5-year swing high at the close on November 18, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-11-19T04:52:41.277315"
        }
    ]
}