{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-27T10:43:42.088946",
    "items": [
        {
            "title": "RIL Q4 profit beats expectations: How will the stock react on Monday? key tips to trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q4-profit-beats-expectations-how-will-the-stock-react-on-monday-key-tips-to-trade/articleshow/120664691.cms",
            "description": "Reliance posted a 2% YoY profit increase to Rs 19,407 crore, beating expectations. Revenue surged 10% to Rs 2.64 lakh crore, driven by telecom and retail. Analysts suggest a range-bound strategy with a potential upside towards Rs 1,410-1,460, and a buy recommendation at current levels.",
            "pubDate": "2025-04-27T10:43:21.550902"
        },
        {
            "title": "UltraTech Cement Q4 Preview: Volume growth to support earnings; margins seen steady",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-q4-preview-volume-growth-to-support-earnings-margins-seen-steady/articleshow/120662154.cms",
            "description": "UltraTech Cement is expected to report strong Q4 results, driven by volume growth, acquisitions, and stable margins. Revenue and profit are likely to rise 12% and 8% YoY, respectively. While cost controls aid profitability, high base effects and regional pricing pressures may limit overall gains.",
            "pubDate": "2025-04-27T10:43:21.551043"
        },
        {
            "title": "IDFC First Bank Q4 Results: Standalone PAT falls 58% YoY to Rs 304 crore, NII up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idfc-first-bank-results-standalone-pat-falls-58-yoy-to-rs-304-crore/articleshow/120644897.cms",
            "description": "IDFC First Bank reported a 58% YoY drop in Q4 net profit to Rs 304 crore, impacted by a decline in its microfinance loan portfolio. Despite this, Net Interest Income rose by 9.8% to Rs 4,907 crore. The bank saw strong growth in customer deposits, increasing 25.2% YoY, with retail deposits up 26.4%.",
            "pubDate": "2025-04-27T10:43:21.551152"
        },
        {
            "title": "India Cements Q4 Results: Cons PAT at Rs 19 crore versus YoY loss, revenue falls 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-cements-q4-results-cons-pat-at-rs-19-crore-versus-yoy-loss-revenue-falls-3/articleshow/120643114.cms",
            "description": "India Cements reported a consolidated net profit of Rs 19 crore in Q4FY25, a significant turnaround from the Rs 50 crore loss in the same period last year, despite a 3% dip in revenue to Rs 1,197 crore. However, the company's profit after tax witnessed a substantial 84% decline on a QoQ basis.",
            "pubDate": "2025-04-27T10:43:21.551254"
        },
        {
            "title": "Cholamandalam Investment and Finance reports Q4 consolidated PAT at Rs 1,259.54 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cholamandalam-investment-and-finance-reports-q4-consolidated-pat-at-rs-1259-54-cr/articleshow/120642088.cms",
            "description": "Cholamandalam Investment and Finance Company reported a consolidated profit after tax of Rs 1,259.54 crore for the January-March 2025 quarter. The financial year saw profits surge to Rs 4,262.70 crore. Total income for the quarter reached Rs 7,136.91 crore, with total disbursements growing by 7% to Rs 26,417 crore. AUM stood at Rs 1,99,876 crore, marking a 30% increase.",
            "pubDate": "2025-04-27T10:43:21.551374"
        },
        {
            "title": "Hindustan Zinc profit zooms 47% in March quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindustan-zinc-profit-zooms-47-in-march-quarter/articleshow/120636810.cms",
            "description": "Hindustan Zinc's Q4 profit surged 47% to ₹3,003 crore, driven by higher zinc prices, lower input costs, and increased by-product sales. FY25 saw a 33% profit increase to ₹10,353 crore, with revenue up 18% to ₹34,083 crore. The company anticipates mined metal production of 1.12 million tonnes in FY26 and will invest $200-250 million in growth capex.",
            "pubDate": "2025-04-27T10:43:21.551479"
        },
        {
            "title": "Jio net profit surges 26% to Rs 7,000 crore on tariff hikes, user gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-net-profit-surges-26-to-rs-7000-crore-on-tariff-hikes-user-gains/articleshow/120636706.cms",
            "description": "Jio Platforms reported a 26% increase in fiscal fourth-quarter net profit, driven by tariff hikes and a growing subscriber base. The company's ARPU saw a slight rise, though it still lags behind Bharti Airtel. Jio gained 6.1 million users, expanding its total base to 488.2 million, with overall revenue and profit for fiscal year 2025 also showing significant growth.",
            "pubDate": "2025-04-27T10:43:21.551579"
        },
        {
            "title": "Maruti Q4 profit misses estimates, expenses a drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-q4-profit-misses-estimates-expenses-a-drag/articleshow/120636582.cms",
            "description": "Maruti Suzuki's Q4 profit dipped by 4.3%, missing estimates, despite higher revenue. Expenses increased during the quarter. However, the company achieved a record annual profit. Maruti Suzuki sold a record number of vehicles this quarter. Domestic sales saw modest growth, while exports rose. The company anticipates export growth to drive future performance.",
            "pubDate": "2025-04-27T10:43:21.551685"
        },
        {
            "title": "Reliance fires on all cylinders, powering profit past 6% in Q4FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-fires-on-all-cylinders-powering-profit-past-6-in-q4/articleshow/120636337.cms",
            "description": "Reliance Industries reported a 6.4% increase in its March-quarter net profit, driven by strong performances in its oil-to-chemicals and consumer-facing businesses. Jio Platforms saw a 25.7% rise in net profit, fueled by tariff hikes and subscriber growth. RIL's board has approved raising ₹25,000 crore through NCDs and acquiring Kandla GHA Transmission Ltd.",
            "pubDate": "2025-04-27T10:43:21.551785"
        },
        {
            "title": "RIL posts Rs 19,407 crore profit in March quarter; JioStar shines after merger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-posts-rs-19407-crore-profit-in-march-quarter-jiostar-shines-after-merger/videoshow/120625497.cms",
            "description": "India's leading conglomerate Reliance Industries Ltd (RIL) reported 2% growth in its consolidated net profit at Rs 19,407 crore for the fourth quarter ended March 2025. Revenue from operations in the same period increased 10% year-on-year (YoY) to Rs 2.64 lakh crore.The profit was well above the Street expectation of Rs 18,471 crore.The company's board has recommended a dividend of Rs 5.50 per equity share for FY25.",
            "pubDate": "2025-04-27T10:43:21.551882"
        },
        {
            "title": "JioStar posts Rs 229 crore net profit in first post-merger results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jiostar-posts-rs-229-crore-net-profit-in-first-post-merger-results/articleshow/120624369.cms",
            "description": "JioStar, the merged entity of Reliance, Disney, and Bodhi Tree, reported a net profit of Rs 229 crore on revenues of Rs 10,006 crore since the merger in November 2024. JioHotstar quickly amassed 280 million paid subscribers, becoming the world's second-largest platform.",
            "pubDate": "2025-04-27T10:43:21.551976"
        },
        {
            "title": "Reliance Retail Q4 Results: Cons PAT jumps 29% YoY to Rs 3,545 crore, revenue rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-retail-q4-results-cons-pat-jumps-29-yoy-to-rs-3545-crore-revenue-rises-16/articleshow/120623619.cms",
            "description": "Reliance Retail Q4 Results: Reliance Retail Ventures reported a robust 29% YoY increase in net profit for Q4FY25, reaching Rs 3,545 crore, driven by strong revenue growth of 16.3% to Rs 78,622 crore. The company's performance was fueled by improved efficiencies, innovative formats, and strategic investments in technology and customer experience.",
            "pubDate": "2025-04-27T10:43:21.552071"
        },
        {
            "title": "Reliance Jio Q4 Results: Cons PAT jumps 26% YoY to Rs 7,022 crore, ARPU rises to Rs 206",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-jio-q4-results-cons-pat-jumps-26-yoy-to-rs-7022-crore-revenue-up-18/articleshow/120623394.cms",
            "description": "Jio Platforms which houses Reliance Industries' (RIL) telecom and digital services business on Friday reported a 26% year-on-year jump in its March quarter consolidated net profit at Rs 7,022 crore versus Rs 5,587 crore in the year ago period.",
            "pubDate": "2025-04-27T10:43:21.552165"
        },
        {
            "title": "RIL Q4 Results: Profit rises 2% YoY to Rs 19,407 crore; beats street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q4-results-profit-rises-2-yoy-to-rs-19407-crore-rs-5-5-per-share-dividend-declared/articleshow/120623131.cms",
            "description": "India's leading conglomerate Reliance Industries Ltd (RIL) reported 2% growth in its consolidated net profit at Rs 19,407 crore for the fourth quarter ended March 2025. Revenue from operations in the same period increased 10% year-on-year (YoY) to Rs 2.64 lakh crore.",
            "pubDate": "2025-04-27T10:43:21.552261"
        },
        {
            "title": "Oriental Hotels Ltd clocks standalone Q4 profit at Rs 17.69 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oriental-hotels-ltd-clocks-standalone-q4-profit-at-rs-17-69-cr/articleshow/120622978.cms",
            "description": "Oriental Hotels Ltd, an associate company of The Indian Hotels Company Ltd, reported a standalone profit of Rs 17.69 crore for the January-March 2025 quarter, the company said on Friday. The city-based company had posted a profit of Rs 16.33 crore during the same quarter of the previous financial year.",
            "pubDate": "2025-04-27T10:43:21.552395"
        },
        {
            "title": "NDTV Q4 Results: Co posts Rs 61.97 crore loss, revenue up 8.3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ndtv-q4-results-co-posts-rs-61-97-crore-loss-revenue-up-8-3/articleshow/120622552.cms",
            "description": "News broadcaster New Delhi Television Ltd (NDTV) on Friday reported a consolidated net loss of Rs 61.97 crore for the fourth quarter ending March 2025 on account of strategic moves to scale its presence, modernise infrastructure, and unlock long-term value. The company had posted a consolidated net profit of Rs 8.68 crore in the January-March quarter last fiscal.",
            "pubDate": "2025-04-27T10:43:21.552504"
        }
    ]
}