{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-22T23:37:28.572480",
    "items": [
        {
            "title": "Asian stocks gain as hopes for year-end rally grow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-gain-as-hopes-for-year-end-rally-grow/articleshow/126112207.cms",
            "description": "Asian equities opened higher, mirroring gains in US stocks and fueling hopes for a year-end rally. Investors are closely watching China's loan prime rates and upcoming economic data from the UK, US, and Japan for clues on central bank policy. Meanwhile, oil prices climbed amid US actions in Venezuela, and Bitcoin and silver saw modest gains.",
            "pubDate": "2025-12-22T01:20:32.598832"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126106876.cms",
            "description": "Indian markets closed last week with small losses. Mixed economic data, a weaker rupee, and uncertainty about a trade deal with the US kept investors cautious. The upcoming week is shortened by the Christmas holiday. Trading volumes may be low. A Santa rally is possible, potentially pushing the Nifty higher. Foreign investors bought shares.",
            "pubDate": "2025-12-22T01:20:32.598953"
        },
        {
            "title": "Stocks in news: Infosys, Fortis Healthcare, Kotak Bank, SBI, Maruti Suzuki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-fortis-healthcare-kotak-bank-sbi-maruti-suzuki/articleshow/126106840.cms",
            "description": "Markets rebounded on Friday, tracking global cues, with Nifty reclaiming its 20-DEMA. Analysts advise a stock-specific approach, favoring banking, IT, auto, and metals. Key stocks in focus include Infosys, Fortis Healthcare, Kotak Bank, SBI, and Maruti Suzuki due to various developments.",
            "pubDate": "2025-12-22T01:20:32.599160"
        },
        {
            "title": "Will weddings, travel drive India's hotel sector to new heights in H2 FY26?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-weddings-travel-drive-indias-hotel-sector-to-new-heights-in-h2-fy26/articleshow/126112153.cms",
            "description": "India's hotel sector anticipates a strong rebound in the latter half of the fiscal year. Average room rates are expected to drive growth, with revenue per available room projected to increase. Key hotel stocks like Chalet Hotels, Indian Hotels, and Lemon Tree Hotels show promising upside. Major events and conferences will boost demand, particularly in cities like Mumbai.",
            "pubDate": "2025-12-22T01:20:32.599263"
        },
        {
            "title": "1Point1 Solutions to acquire Costa Rica BPM firm Netcom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/1point1-solutions-to-acquire-costa-rica-bpm-firm-netcom/articleshow/126112133.cms",
            "description": "1Point1 Solutions is set to acquire Costa Rica-based Netcom Business Contact Center for approximately ₹300 crore by March 2026. This strategic move aims to nearly double 1Point1's FY27 revenue, expand its AI-driven BPM services into the Americas, and enhance its domain expertise in financial services.",
            "pubDate": "2025-12-22T01:20:32.599366"
        },
        {
            "title": "Nifty to get support from rupee strength, FII inflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-to-get-support-from-rupee-strength-fii-inflows/articleshow/126112106.cms",
            "description": "Nifty's near-term outlook is cautiously positive. Improving technical signals, a stronger rupee, and renewed foreign investor buying are supporting the market. While resistance at 26,000 is a key level, a breakout could lead to further gains. Traders can consider buying Nifty around the current price with a stop loss below 25,700 for potential upside.",
            "pubDate": "2025-12-22T01:20:32.599468"
        },
        {
            "title": "Budget 2026: Private capex likely to gather steam next year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-private-capex-likely-to-gather-steam-next-year/articleshow/126112170.cms",
            "description": "Private investment is projected to surge in 2026, fueled by robust domestic consumption, reduced GST, government reforms, and favorable economic conditions like soft inflation and low interest rates. Continued government capital expenditure is expected to further stimulate private sector growth, particularly in consumer-focused segments.",
            "pubDate": "2025-12-22T01:20:32.599564"
        },
        {
            "title": "Credit weighs less on cards with RBI tightening norms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-weighs-less-on-cards-with-rbi-tightening-norms/articleshow/126112122.cms",
            "description": "Credit card outstandings, despite fewer delinquencies, fell to 4.7% of total retail loans in October 2025, from 5% a year earlier, Reserve Bank of India (RBI) data showed. Growth in outstanding credit card balances within total retail loans slowed sharply to 7.7% in October 2025, from 16.9% a year earlier.",
            "pubDate": "2025-12-22T01:20:32.599782"
        },
        {
            "title": "Sensex jumps over 450 pts, Nifty above 26,100 as rate-cut hopes, FII inflows lift D-St",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-450-pts-nifty-above-26100-as-rate-cut-hopes-fii-inflows-lift-d-st/articleshow/126113862.cms",
            "description": "Indian stocks surged on Monday, with the Sensex and Nifty breaking a three-week losing streak. Investor sentiment was boosted by foreign fund inflows and increasing anticipation of interest-rate cuts in the coming year. The Sensex climbed over 450 points, surpassing 85,400, while the Nifty 50 gained over 150 points, crossing 26,100.",
            "pubDate": "2025-12-22T04:11:38.663299"
        },
        {
            "title": "Nifty’s Santa rally isn’t just folklore: Why smallcap stocks could steal the spotlight this year-end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niftys-santa-rally-isnt-just-folklore-why-smallcap-stocks-could-steal-the-spotlight-this-year-end/articleshow/126113766.cms",
            "description": "Historical data reveals smallcap stocks have consistently outperformed during the year-end Santa rally, averaging 3.55% returns with a 100% success rate. Technical indicators suggest smaller stocks are poised for a comeback, with market breadth already tilting in their favor. The Nifty also shows potential for an upward move, aligning with the repeatable seasonal pattern.",
            "pubDate": "2025-12-22T04:11:38.663443"
        },
        {
            "title": "Ashok Leyland among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126113527.cms",
            "description": "As of December 19, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-22T04:11:38.663547"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley downgrades Titagarh Rail; Citi maintains buy on PB Fintech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-downgrades-titagarh-rail-citi-maintains-buy-on-pb-fintech/articleshow/126113738.cms",
            "description": "Brokerages offer mixed views on key stocks. Morgan Stanley downgrades Titagarh Rail Systems due to order visibility concerns but remains positive on Divi’s Laboratories for export recovery. Citi reiterates a Buy on PB Fintech, citing stable revenues. These insights guide investors towards selective market opportunities, balancing near-term challenges with long-term growth potential.",
            "pubDate": "2025-12-22T04:11:38.663649"
        },
        {
            "title": "Nomura initiates coverage on Tata Motors CV, predicts 22% upside potential on CV cycle recovery",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-initiates-coverage-on-tata-motors-cv-predits-22-upside-potential-on-cv-cycle-recovery/articleshow/126113568.cms",
            "description": "Nomura initiates coverage on Tata Motors Commercial Vehicles (TMCV) with a 'Buy' rating and a Rs 481 target price, anticipating a 22% upside. The brokerage believes TMCV is poised to benefit from an upcoming upcycle in the Indian MHCV segment, driven by favorable economic conditions and strategic global expansion through the Iveco acquisition.",
            "pubDate": "2025-12-22T04:11:38.663748"
        },
        {
            "title": "Hindustan Zinc shares in focus as silver hits fresh record high of $68. What’s next for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-as-silver-hits-fresh-record-high-of-68-whats-next-for-investors/articleshow/126113395.cms",
            "description": "Hindustan Zinc shares are set to gain attention as silver prices reach new peaks.  This surge, driven by supply and demand factors, is expected to boost the company's earnings significantly. Analysts are optimistic about future performance, projecting strong EPS growth.  Improved cost efficiency further supports this positive outlook for the mining giant.",
            "pubDate": "2025-12-22T04:11:38.663848"
        },
        {
            "title": "Shriram Finance and 3 other stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-and-3-other-stocks-witness-5-year-swing-high-breakout/slideshow/126113443.cms",
            "description": "In the Nifty500 segment, four stocks witnessed a 5-year swing high at the close on December 19, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-12-22T04:11:38.663943"
        },
        {
            "title": "Kaynes Technology among 5 stocks closing above VWAP, signalling bullish shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-among-5-stocks-closing-above-vwap-signalling-bullish-shift/slideshow/126113380.cms",
            "description": "On December 19, the closing prices of five stocks in the Nifty 500 pack rallied by over 1.5% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to Stockedge.com’s technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors, potentially indicating positive sentiment in the market.",
            "pubDate": "2025-12-22T04:11:38.664035"
        },
        {
            "title": "Infosys shares jump 3% after company clarifies about no material events as ADRs jump 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-after-adrs-jump-40-company-clarifies-no-material-events-behind-the-surge/articleshow/126113250.cms",
            "description": "Infosys shares are in focus after sharp volatility in its ADRs on the NYSE, driven by heavy trading volumes and sector-wide optimism. The company clarified there were no material developments behind the move. The rally followed strong Accenture results, reinforcing positive sentiment around Indian IT stocks and near-term sector momentum.",
            "pubDate": "2025-12-22T04:11:38.664132"
        },
        {
            "title": "RITES shares in focus on signing MoU with Botswana Government to modernise transport infrastructure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rites-shares-in-focus-on-signing-mou-with-botswana-government-to-modernise-transport-infrastructure/articleshow/126113144.cms",
            "description": "RITES shares are expected to gain attention. The company signed a Memorandum of Understanding with the Republic of Botswana. This agreement aims to develop and modernize Botswana's railway and transport infrastructure. RITES will provide technical expertise for upgrading transport systems. The collaboration includes rolling stock supply and workshop modernization. Broader infrastructure projects are also part of the plan.",
            "pubDate": "2025-12-22T04:11:38.664233"
        },
        {
            "title": "Varun Beverages shares in focus on approving Rs 1,119 crore Twizza acquisition, Citi expects 44% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/varun-beverages-shares-in-focus-on-approving-rs-1119-crore-twizza-acquisition-citi-expects-44-upside/articleshow/126113110.cms",
            "description": "Varun Beverages will acquire South Africa's Twizza for over Rs 1,100 crore. This deal is set to boost Bevco's market reach in South Africa. Global brokerage Citi has responded positively, maintaining a 'Buy' rating and a target price of Rs 675. The acquisition is expected to be completed by June 2026.",
            "pubDate": "2025-12-22T04:11:38.664331"
        },
        {
            "title": "Shriram Finance shares surge 3% as brokerages raise target price after MUFG’s Rs 39,640-crore deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-shares-in-focus-as-brokerages-raise-target-price-after-mufgs-rs-39640-crore-deal/articleshow/126113068.cms",
            "description": "Shriram Finance has reached an unprecedented peak in share value, fueled by optimistic assessments from brokerage firms regarding MUFG's 20% investment. This influx of capital is hailed as a robust affirmation of the company's financial health and growth trajectory.",
            "pubDate": "2025-12-22T04:11:38.664444"
        },
        {
            "title": "KPIT Technologies among 4 stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kpit-technologies-among-4-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126113063.cms",
            "description": "On December 19, four stocks in the Nifty200 pack appeared on the bullish scanner labelled “White Marubozu”, according to StockEdge.com’s technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or non-existent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-12-22T04:11:38.664542"
        },
        {
            "title": "Cipla among 5 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-among-5-nifty-stocks-showing-bullish-rsi-upswing/slideshow/126113017.cms",
            "description": "On December 19, in the Nifty50 pack, five stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. “RSI trending up” means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-12-22T04:11:38.664634"
        },
        {
            "title": "Stocks to buy for 2026: Max Healthcare, Amber Enterprises among 4 stocks that could give 20-40% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-max-healthcare-amber-enterprises-among-4-stocks-that-could-give-20-40-return-in-1-year/slideshow/126112778.cms",
            "description": "Brokerages remain constructive on select stocks across healthcare, real estate, manufacturing, and pharmaceuticals, highlighting strong business fundamentals and favourable sector tailwinds.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-22T04:11:38.664725"
        },
        {
            "title": "Neptune Logitek shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/neptune-logitek-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126112625.cms",
            "description": "Neptune Logitek's stock will list on December 22. Grey market indicators suggest a flat debut. The company's Rs 46.62 crore IPO was subscribed 1.61 times. Neptune Logitek provides integrated logistics solutions. Proceeds will fund truck purchases and debt repayment. Investor sentiment in the SME space remains cautious.",
            "pubDate": "2025-12-22T04:11:38.664817"
        },
        {
            "title": "Call or Put? How options shape profits, protection and strategy across markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/call-or-put-how-options-shape-profits-protection-and-strategy-across-markets/articleshow/126114782.cms",
            "description": "Options trading has gone mainstream, with calls and puts widely used across Indian, US and global markets for profits, protection and risk management. While options offer leverage, defined risk and hedging benefits, they also involve time decay and complexity, making disciplined strategy and understanding essential for investors.",
            "pubDate": "2025-12-22T05:13:50.455990"
        },
        {
            "title": "Jupiter Wagons shares rally over 11% following a promoter stake increase",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jupiter-wagons-shares-rally-over-11-following-a-promoter-stake-increase/articleshow/126114762.cms",
            "description": "The rally came after Jupiter Wagons informed the stock exchanges that its promoter, Tatravagonka A.S., had acquired additional equity shares through the conversion of convertible warrants.",
            "pubDate": "2025-12-22T05:13:50.456098"
        },
        {
            "title": "ICICI Prudential AMC shares rise another 2% on Day 2. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-amc-shares-rise-another-2-on-day-2-should-you-buy-sell-or-hold/articleshow/126114392.cms",
            "description": "ICICI Prudential AMC shares surged over 2% to an intraday high of Rs 2,645, extending their rally post a strong market debut. Brokerages like PL Capital and Centrum have issued Buy ratings, citing strong performance, superior equity yields, and robust revenue growth. The company's dominant position in equity AUM and expanding PMS/AIF platforms further bolster bullish outlooks.",
            "pubDate": "2025-12-22T05:13:50.456194"
        },
        {
            "title": "Ola Electric shares are down 60% in 2025. Is there a bottom-fishing opportunity here?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-are-down-60-in-2025-is-there-a-bottom-fishing-opportunity-here/articleshow/126114465.cms",
            "description": "Ola Electric shares saw a nearly 10% jump Friday after CEO Bhavish Aggarwal sold a portion of his stake to repay debt and eliminate promoter pledges. This move aims to reduce risk and volatility, though the stock remains down significantly year-to-date and from its peak, with technical indicators flashing caution.",
            "pubDate": "2025-12-22T05:13:50.456305"
        },
        {
            "title": "Ashish Kacholia-backed Knowledge Marine & Engineering Works shares tumble 51%. Should investors worry?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-knowledge-marine-engineering-works-shares-tumble-51-should-investors-worry/articleshow/126114396.cms",
            "description": "Shares of Knowledge Marine & Engineering Works fell 51% after turning ex-split, reflecting a technical price adjustment. The drop did not affect fundamentals, and the stock later rebounded over 11% intraday, leaving investors’ overall holding value unchanged.",
            "pubDate": "2025-12-22T05:13:50.456402"
        },
        {
            "title": "Santa rally on hold? Wall Street faces crosscurrents from AI and Fed uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/santa-rally-on-hold-wall-street-faces-crosscurrents-from-ai-and-fed-uncertainty/articleshow/126114356.cms",
            "description": "U.S. equities have seen a choppier-than-usual December, defying the typical year-end rally even as major indices remain on track for solid full-year gains in 2025. Recent volatility has been driven by concerns over heavy AI-related capital spending and uncertainty around the Federal Reserve’s interest-rate outlook.",
            "pubDate": "2025-12-22T05:13:50.456496"
        },
        {
            "title": "Festive Season, Fragile Markets: Investors brace for a busy finish",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/festive-season-fragile-markets-investors-brace-for-a-busy-finish/articleshow/126114322.cms",
            "description": "As the year-end approaches, global markets remain volatile amid mixed U.S. economic signals, geopolitical risks and uncertainty over a Santa rally. Investors are closely tracking key data releases, oil-market developments and central bank cues in Asia as a turbulent year draws to a close.",
            "pubDate": "2025-12-22T05:13:50.456593"
        },
        {
            "title": "GE Vernova T&D India shares jump over 10% after major HVDC contract win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ge-vernova-td-india-shares-jump-over-10-after-major-hvdc-contract-win/articleshow/126114274.cms",
            "description": "GE Vernova T&D India shares rose sharply after the company secured a large HVDC transmission project from AESL Projects Limited. While the order strengthens long-term growth visibility and underscores technical capabilities, the stock is trading near its peak with rich valuations, suggesting optimism may already be priced in.",
            "pubDate": "2025-12-22T05:13:50.456686"
        },
        {
            "title": "Is Nifty cheap for 2026 upside? Hidden valuation gaps challenge Wall Street's India rebound call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-nifty-cheap-for-2026-upside-hidden-valuation-gaps-challenge-wall-streets-india-rebound-call/articleshow/126114247.cms",
            "description": "Wall Street forecasts a Nifty rebound by 2026, driven by earnings recovery and easing rates. However, hidden valuation gaps, with many Nifty constituents trading at high multiples despite modest growth, challenge this optimism. Large financials and PSUs mask the elevated valuations in other sectors, suggesting selective stock picking over broad index gains.",
            "pubDate": "2025-12-22T05:13:50.456776"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/126114023.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-12-22T05:13:50.456866"
        },
        {
            "title": "Groww shares soar over 20% in just 3 days! What’s behind the surge today?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-soar-over-20-in-just-3-days-whats-behind-the-surge-today/articleshow/126114089.cms",
            "description": "Billionbrains Garage Ventures, parent of Groww, saw its shares surge over 20% after Jefferies initiated coverage with a Buy rating. The brokerage highlighted Groww's \"Robinhood-like\" strategy, expecting 35% earnings growth driven by new products and margin improvements, setting a target price of Rs 180.",
            "pubDate": "2025-12-22T05:13:50.456966"
        },
        {
            "title": "BSE eyes new monthly index options, revamps Bankex to take on Nifty Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-eyes-new-monthly-index-options-revamps-bankex-to-take-on-nifty-bank/articleshow/126113929.cms",
            "description": "BSE is launching new monthly index option products, including a revamped Bankex index with expanded constituents and a new weighting structure, to boost its derivatives market share. This strategy aims to attract traders beyond weekly expiries by offering more attractive, cheaper monthly options. The exchange is also developing other monthly derivative products and strengthening its GIFT City operations.",
            "pubDate": "2025-12-22T05:13:50.457060"
        },
        {
            "title": "Sensex rallies 1,000 points in 2 days, Nifty tops 26,100. Why is the stock market rising?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rallies-1000-points-in-2-days-nifty-tops-26100-why-is-the-stock-market-rising/articleshow/126114854.cms",
            "description": "Indian equities surged for a second day, with Sensex and Nifty climbing on a stronger rupee and positive global sentiment. Foreign institutional investors turned net buyers, contributing to the rally. This renewed investor confidence, driven by potential U.S. Federal Reserve rate cuts and domestic economic strength, signals a potential year-end market upswing.",
            "pubDate": "2025-12-22T05:40:31.460914"
        },
        {
            "title": "Cables & Wires industry enters a Rs 1.9-tn growth phase; KEI Industries, Polycab India top buys",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cables-wires-industry-enters-a-rs-1-9-tn-growth-phase-kei-industries-polycab-india-top-buys/articleshow/126115422.cms",
            "description": "India’s cables & wires industry is entering a multi-year growth phase, driven by infrastructure, renewables, railways, data centres and exports. With the market seen nearing Rs 1.9 trillion by FY30, companies like Polycab India and KEI Industries are well placed to benefit from strong demand visibility and resilient margins.",
            "pubDate": "2025-12-22T05:52:14.705734"
        },
        {
            "title": "Meesho shares slide 8% in 2 days. What’s behind the selloff after stock more than doubled from listing?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-slide-8-in-2-days-whats-behind-the-selloff-after-stock-more-than-doubled-from-listing/articleshow/126115390.cms",
            "description": "Meesho shares have fallen 8% over two sessions after surging more than 100% since its December 10 IPO. Low free-float, short-covering, and intense early demand are driving the pullback despite strong analyst support.",
            "pubDate": "2025-12-22T05:52:14.705867"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and an upside potential of up to 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-an-upside-potential-of-up-to-30/articleshow/126116972.cms",
            "description": "After staying under pressure for a while, the broader indices, the Nifty and Sensex, as well as market breadth are making a comeback. The questions to ask are: How sustainable will this upmove be? What will market breadth be like during this period? And one thing to be kept in mind: While the bulls are making a comeback, valuations are still high. So, keep an eye on fundamentals and how things are shaping up in the sector.",
            "pubDate": "2025-12-22T07:31:00.373768"
        },
        {
            "title": "Australian shares at over one-month high as miners and banks lead rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-at-over-one-month-high-as-miners-and-banks-lead-rally/articleshow/126116022.cms",
            "description": "Indian markets are buzzing as Australian shares surged for a third day, hitting a month-high driven by strong mining and broad buying. Analysts are calling it the 'Santa Claus rally,' with potential for further gains. Miners saw record highs, while gold stocks also climbed. Financials are showing resilience, with banks expected to benefit from anticipated interest rate trends into 2026.",
            "pubDate": "2025-12-22T07:31:00.373875"
        },
        {
            "title": "Nomura sees Ashok Leyland as key beneficiary of CV upcycle, sets target at Rs 196. Stock up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-sees-ashok-leyland-as-key-beneficiary-of-cv-upcycle-sets-target-at-rs-196-stock-up-2/articleshow/126115935.cms",
            "description": "Ashok Leyland shares hit a fresh 52-week high after Nomura reaffirmed its Buy rating and raised optimism around the commercial vehicle upcycle. The brokerage sees the company as a key beneficiary of improving CV demand, stronger volume growth and margin tailwinds, setting a target price of Rs 196 with healthy upside.",
            "pubDate": "2025-12-22T07:31:00.373972"
        },
        {
            "title": "Japan's Nikkei jumps on weaker yen, renewed AI optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-jumps-on-weaker-yen-renewed-ai-optimism/articleshow/126117283.cms",
            "description": "Japan's Nikkei share index surged for a second day. A weaker yen and strong AI investment sentiment fueled the gains. US stocks also rose on positive chipmaker forecasts. SoftBank Group, a key AI investor, saw a significant jump. This positive momentum is now visible in the Japanese market.",
            "pubDate": "2025-12-22T07:45:04.750484"
        },
        {
            "title": "IRCTC, Jupiter Wagons, other rail stocks surge up to 15%. Can Union Budget 2026 deliver a boost?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irctc-jupiter-wagons-other-rail-stocks-surge-up-to-15-can-union-budget-2026-deliver-a-boost/articleshow/126117864.cms",
            "description": "Railway stocks rallied on December 22 led by IRCTC, Jupiter Wagons, RailTel and RVNL on stock-specific triggers, including fare rationalisation and promoter buying. The bounce follows a weak 2025 for the sector, with hopes now pinned on higher railway capex in Budget 2026–27.",
            "pubDate": "2025-12-22T08:15:11.149106"
        },
        {
            "title": "Nifty to climb to 29,500 in 2026, ICICI Direct says, picks Bajaj Finance, Bank of Baroda among 7 top bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-to-climb-to-29500-in-2026-icici-direct-says-picks-bajaj-finance-bank-of-baroda-among-7-top-bets/articleshow/126117081.cms",
            "description": "ICICI Direct projects a stronger phase for Indian equities, targeting the Nifty 50 at 29,500 by December 2026, supported by an earnings revival, favourable macro conditions and more reasonable valuations. The brokerage highlights select stock picks and sectors while maintaining a constructive medium-term outlook for the market.",
            "pubDate": "2025-12-22T08:15:11.149426"
        },
        {
            "title": "HCC shares surge over 8%, extend rally for third day after securing major Railways contract",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcc-shares-surge-over-8-extend-rally-for-third-day-after-securing-major-railways-contract/articleshow/126115301.cms",
            "description": "Hindustan Construction Company shares climbed for a third straight session after its joint venture secured a Rs 901 crore railway tunnel project from Northeast Frontier Railway. While the order boosted sentiment, technical indicators continue to point to underlying weakness in the stock’s broader trend.",
            "pubDate": "2025-12-22T08:15:11.149902"
        },
        {
            "title": "Bajaj Finance, Bank of Baroda among 7 top bets for 2026 by ICICI Direct",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-bank-of-baroda-among-7-top-bets-for-2026-by-icici-direct/slideshow/126118287.cms",
            "description": "ICICI Direct expects Indian stocks to regain momentum as earnings revive and macro conditions stay supportive, pegging the Nifty 50 at 29,500 and the Sensex at 98,500 by December 2026. The brokerage values the Nifty at 21x FY28E earnings, with EPS projected at Rs 1,400, implying a 15% CAGR over FY26–FY28. With Q2 FY26 marking a turning point in earnings growth and valuations seen as reasonable, ICICI Direct believes select stocks are well placed to outperform. These seven names are its high-conviction bets for CY26.",
            "pubDate": "2025-12-22T09:01:04.466007"
        },
        {
            "title": "Gurmeet Chadha sees Indian bond yields aligning with developed economies, reveals 5-year portfolio strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gurmeet-chadha-sees-indian-bond-yields-aligning-with-developed-economies-reveals-5-year-portfolio-strategy/articleshow/126118205.cms",
            "description": "Wealth management expert Gurmeet Chadha has reiterated a structurally positive outlook on India’s economy and markets, citing falling borrowing costs and rising foreign interest. He expects Indian bond yields to decline over the next few years and favours a portfolio heavily weighted towards equities, reflecting confidence in India’s long-term growth prospects.",
            "pubDate": "2025-12-22T09:01:04.466164"
        },
        {
            "title": "FIIs backed 12 stocks for 3 quarters; 7 turned multibaggers in CY25. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-backed-12-stocks-for-3-quarters-7-turned-multibaggers-in-cy25-do-you-own-any/slideshow/126118301.cms",
            "description": "Despite being net sellers of Indian equities worth Rs 1.61 lakh crore in CY25, FIIs have selectively increased stakes in certain stocks, signalling targeted conviction. Around 125 BSE-listed companies saw steady FII buying over the last three quarters. Filtering for market caps above Rs 2,000 crore, 20 stocks have surged 50%–3,650%, with seven emerging as multibaggers. We highlight 12 stocks up over 70% this year.",
            "pubDate": "2025-12-22T09:01:04.466272"
        },
        {
            "title": "IT stocks rally up to 4% after soft US labour data and benign inflation raise Fed rate cut hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-rally-up-to-4-after-soft-us-labour-data-and-benign-inflation-raise-fed-rate-cut-hopes/articleshow/126119748.cms",
            "description": "IT stocks jumped up to 4% as softer US labour data and easing inflation revived hopes of a Fed rate cut. The Nifty IT index rose over 2% for a fourth straight session, led by Persistent Systems, Infosys, Wipro and Tech Mahindra, as lower borrowing costs are expected to support global tech spending.",
            "pubDate": "2025-12-22T10:00:46.932350"
        },
        {
            "title": "Gujarat Kidney and Super Specialty IPO Day 1: Issue subscribed 90%; GMP, price band and key details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-kidney-and-super-specialty-ipo-day-1-issue-subscribed-90-gmp-price-band-and-key-details/articleshow/126119581.cms",
            "description": "The Gujarat Kidney and Super Specialty IPO received a strong response on its opening day, with 90% subscription led by robust retail participation. While grey market signals point to a steady listing, analysts have flagged valuation concerns and advised caution given the company’s aggressive expansion plans and premium pricing.",
            "pubDate": "2025-12-22T10:00:46.932477"
        },
        {
            "title": "Axis Securities sees Nifty at 28,100 by 2026: Key growth drivers, top 9 stock picks, and 5 sector themes explained",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-sees-nifty-at-28100-by-2026-key-growth-drivers-top-9-stock-picks-and-5-sector-themes-explained/articleshow/126119388.cms",
            "description": "Axis Securities has set a base-case Nifty target of 28,100 for December 2026, expecting markets to shift from valuation-led consolidation to an earnings-driven cycle. Improving macro fundamentals, resilient domestic demand, rising corporate earnings and strong domestic liquidity are seen supporting equities, with a buy-on-dips strategy recommended despite global and currency-related risks.",
            "pubDate": "2025-12-22T10:00:46.932693"
        },
        {
            "title": "BSE shares jump 3% on plans to launch new monthly index options, revamp Bankex",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-jump-3-on-plans-to-launch-new-monthly-index-options-revamp-bankex/articleshow/126119226.cms",
            "description": "BSE shares witnessed an uptick on Monday after an ET report suggested that the exchange plans to launch new monthly index option products and revamp the Bankex index. The move aims to boost BSE’s derivatives market share beyond weekly expiries, with management betting on cheaper monthly options and improved liquidity to deepen trader participation.",
            "pubDate": "2025-12-22T10:00:46.932791"
        },
        {
            "title": "European shares steady after record close entering holiday week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-steady-after-record-close-entering-holiday-week/articleshow/126118888.cms",
            "description": "European shares held steady on Monday, with gains in tech and commodity-linked stocks providing support, as investors started ‌a holiday-shortened ‌week on a tepid note following the previous session's record-high close.",
            "pubDate": "2025-12-22T10:00:46.932884"
        },
        {
            "title": "India regains investor favour as China slips, BofA fund manager survey shows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-regains-investor-favour-as-china-slips-bofa-fund-manager-survey-shows/articleshow/126120449.cms",
            "description": "India has regained favour with global investors, moving to a mild overweight in BofA’s latest Asia Fund Manager Survey, even as China slipped into underweight territory. The shift highlights India’s appeal as a diversification play amid selective risk-taking, while Japan remains the region’s top investment choice.",
            "pubDate": "2025-12-22T10:57:18.411499"
        },
        {
            "title": "Nithin Kamath explains why most stock brokers don't own the tech that keeps trades running",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nithin-kamath-explains-why-most-stock-brokers-dont-own-the-tech-that-keeps-trades-running/articleshow/126121130.cms",
            "description": "Zerodha founder Nithin Kamath explains why most brokers do not own their core trading technology, highlighting the risks, regulatory complexity and high costs involved in building in-house OMS and RMS systems.",
            "pubDate": "2025-12-22T11:17:01.380505"
        },
        {
            "title": "Indian ETF AUM crosses Rs 10 lakh crore mark, doubles in 3 years: Zerodha Fund House",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-etf-aum-crosses-rs-10-lakh-crore-mark-doubles-in-3-years-zerodha-fund-house/articleshow/126121403.cms",
            "description": "India’s ETF industry has crossed a major milestone, with assets under management surpassing Rs 10 lakh crore as of October 2025, according to Zerodha Fund House. ETF AUM has doubled in just three years, driven by rising retail participation, deeper liquidity, and growing investor interest beyond equities into gold and silver ETFs.",
            "pubDate": "2025-12-22T11:31:32.086227"
        },
        {
            "title": "Gainers & Losers: Meesho among 7 stocks that hogged limelight on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-meesho-among-7-stocks-that-hogged-limelight-on-monday/slideshow/126121173.cms",
            "description": "",
            "pubDate": "2025-12-22T11:31:32.086346"
        },
        {
            "title": "Two Trades for Today: A global telecom giant for a 5.2% upmove; a mid-cap sugar producing stock for an almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-global-telecom-giant-for-a-5-2-upmove-a-mid-cap-sugar-producing-stock-for-an-almost-6-gain/articleshow/126122956.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-22T13:22:39.349010"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/126122610.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-22T13:22:39.349104"
        },
        {
            "title": "Vedanta, Samvardhana Motherson among 8 largecap stocks hit 52-week highs; gains of up to 32% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-samvardhana-motherson-among-8-largecap-stocks-hit-52-week-highs-gains-of-up-to-32-in-a-month/slideshow/126122344.cms",
            "description": "Benchmark Sensex advanced 638 points to close at 85,567 on Monday. Riding the market rally, eight BSE large-cap stocks scaled fresh 52-week highs, reaching their strongest levels in the past year. These breakouts are often viewed as indicators of sustained bullish momentum and may hint at further near-term gains.",
            "pubDate": "2025-12-22T13:22:39.349185"
        },
        {
            "title": "These 9 largecap stocks delivered more than 50% EBITDA growth in Q2FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-largecap-stocks-delivered-more-than-50-ebitda-growth-in-q2fy26/slideshow/126122197.cms",
            "description": "Quarterly EBITDA growth suggests that companies are seeing higher earnings before interest, taxes, depreciation, and amortisation, indicating enhanced profitability and operational efficiency. Among the NSE large-cap segment, these 9 stocks have recorded over 50% EBITDA growth in the September '25 quarter compared to the same period last year, according to StockEdge profitability. This growth may indicate stronger demand, effective cost management, and overall business vitality, which is positive news for investors and stakeholders.",
            "pubDate": "2025-12-22T13:22:39.349263"
        },
        {
            "title": "Groww launches backup trading portal to protect traders during outages",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-launches-backup-trading-portal-to-protect-traders-during-outages/articleshow/126124121.cms",
            "description": "Stock broking platform Groww on Monday said it has launched 'Groww Lite', a web-based emergency trading portal, to safeguard users during platform outages and technical glitches.",
            "pubDate": "2025-12-22T15:00:35.959532"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/126124768.cms",
            "description": "Indian equities ended higher as a stronger rupee, global optimism and expectations of US Fed rate cuts boosted sentiment. Sensex and Nifty gained sharply, led by IT and metals, while technical indicators signalled continued short-term bullish momentum.",
            "pubDate": "2025-12-22T16:44:19.137672"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of at least 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-at-least-25/articleshow/126124631.cms",
            "description": "After a year of clear bearish bias, it appears that Nifty and Sensex are making serious attempts to move out into a different territory. Now, the big question is: Which sector will lead this breakout? There are many contenders. And another question: Which sector will sustain the upward movement when it starts? The answer is clear, the sector or sectors where the probability of Q3 earning numbers being good are high. So, look forward to the coming earnings season.",
            "pubDate": "2025-12-22T16:44:19.137800"
        },
        {
            "title": "Market Trading Guide: Buy MCX and IIFL Capital on Tuesday for up to 10% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-mcx-and-iifl-capital-on-tuesday-for-up-to-10-gains/slideshow/126124662.cms",
            "description": "Nifty closed with strong gains for the second session in a row propelled by IT stocks and well supported by auto and financials. It continues to move higher, following a falling wedge breakout, indicating improving bullish sentiment in the short term. Commenting on the current trends, Rupak De, Senior Technical Analyst at LKP Securities said that the RSI has delivered a downward consolidation breakout on the daily timeframe, signaling strong positive momentum in the market. In his view, the trend is likely to favor the bulls as long as the index remains above 25,900, making a buy-on-dips strategy favorable. On the higher end, 26,315 may act as immediate resistance, above which a further rally could unfold, he added.Here are 2 stock recommendations for Monday:",
            "pubDate": "2025-12-22T16:44:19.137911"
        },
        {
            "title": "Stock Radar: City Union Bank stock hits fresh record high in December 2025; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-city-union-bank-stock-hits-fresh-record-high-in-december-2025-what-should-investors-do/articleshow/126119014.cms",
            "description": "City Union Bank stock experienced a significant 5-year breakout on monthly charts in November, continuing its rally into December and reaching fresh record highs. Experts suggest short-term traders can target Rs 300 in the coming weeks, citing strong technical indicators and a positive chart pattern.",
            "pubDate": "2025-12-22T23:37:27.794046"
        }
    ]
}