{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-21T06:28:30.408161",
    "items": [
        {
            "title": "Nvidia's AI chip demand still booming but slowing sales growth worries investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nvidias-ai-chip-demand-still-booming-but-slowing-sales-growth-worries-investors/articleshow/115508587.cms",
            "description": "Nvidia, the world's most valuable firm, predicted its slowest revenue growth in seven quarters, falling short of investor expectations. Despite exceeding initial sales projections for its new AI chips, supply chain issues and high demand are impacting the company's growth and margins. While Nvidia's third-quarter earnings surpassed estimates, its data center segment experienced slower growth.",
            "pubDate": "2024-11-21T06:28:27.642578"
        },
        {
            "title": "ReNew Q2 Results: Net profit jumps 31% YoY to Rs 494 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/renew-q2-net-profit-grows-31-pc-to-rs-494-crore/articleshow/115479918.cms",
            "description": "ReNew's total income in the second quarter also rose to Rs 2,988.7 crore (USD 357 million) from Rs 2,863.2 crore (USD 342 million) during the same period last financial year.",
            "pubDate": "2024-11-21T06:28:27.642698"
        },
        {
            "title": "Waaree Energies Q2 Results: PAT rises 15% YoY to Rs 362 crore, revenue up 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/waaree-energies-q2-results-pat-rises-15-yoy-to-rs-362-crore-revenue-up-1/articleshow/115423727.cms",
            "description": "Waaree Energies Q2FY25 Results: Waaree Energies reported a 15% YoY increase in Q2 net profit to Rs 362 crore. Revenue rose 1% YoY to Rs 3,574 crore. Other income doubled to Rs 89 crore. The company listed with a 70% premium but has corrected post-Trump's win.",
            "pubDate": "2024-11-21T06:28:27.642804"
        },
        {
            "title": "Q2FY25 review: Weak quarter as Nifty delivers just 4% YoY earnings growth; RIL, BPCL among major drags",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2fy25-review-weak-quarter-as-nifty-delivers-just-4-yoy-earnings-growth-ril-bpcl-among-major-drags/articleshow/115411326.cms",
            "description": "India's corporate earnings for Q2 FY25 showed a modest 4% YoY profit growth, slightly surpassing the 3% estimate. This marks the second consecutive quarter of single-digit growth since mid-2020. While key players like SBI, ICICI Bank, and Hindalco boosted earnings, sectors like oil, metals, and energy, including BPCL, JSW Steel, and Reliance, weighed down overall performance, according to MOFSL.",
            "pubDate": "2024-11-21T06:28:27.642909"
        }
    ]
}