{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-15T13:43:52.663929",
    "items": [
        {
            "title": "Trump vs. Fed: The Battle Over Governor Lisa Cook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-vs-fed-the-battle-over-governor-lisa-cook/slideshow/123892207.cms",
            "description": "The Trump administration renewed its request to a federal appeals court to allow the firing of Federal Reserve Governor Lisa Cook. This move comes ahead of the Fed’s upcoming interest rate vote. The administration argues that Cook’s legal reasoning for remaining on the board is without merit. (Source: Reuters)",
            "pubDate": "2025-09-15T04:51:15.504140"
        },
        {
            "title": "5 FII-backed penny stocks surge up to 500% in one year. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-fii-backed-penny-stocks-surge-up-to-500-in-one-year-do-you-own-any/slideshow/123891862.cms",
            "description": "Even as broader smallcaps have struggled this year, a handful of penny stocks with tiny foreign institutional investor (FII) presence have turned into multibaggers over the past year. With gains ranging from 50-500%, these names have caught the eye of traders betting on high-risk, high-reward opportunities. Here are five such stocks that have quietly delivered massive returns.",
            "pubDate": "2025-09-15T04:51:15.504271"
        },
        {
            "title": "Rs 6 lakh crore boom in 1 month! How PM Modi's GST cuts shook the stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-6-lakh-crore-boom-in-1-month-how-pm-modis-gst-cuts-shook-the-stock-market/articleshow/123891542.cms",
            "description": "Prime Minister Narendra Modi's GST rationalization led to a Rs 6 lakh crore stock market rally. Auto and consumer durable stocks emerged as big winners. Small cars and two-wheelers now attract lower GST. Analysts predict a boost in consumption and economic growth. Companies anticipate increased sales volume, especially in economy segments. Experts see a potential 'Lollapalooza effect' on aggregate demand.",
            "pubDate": "2025-09-15T04:51:15.504380"
        },
        {
            "title": "Buy, Sell or Hold: Antique sees over 30% upside in HAL; HSBC upgrades NTPC to buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-antique-sees-over-30-upside-in-hal-hsbc-upgrades-ntpc-to-buy-rating/articleshow/123891517.cms",
            "description": "Brokerages are optimistic on select frontline stocks, emphasizing strong earnings visibility and long-term growth. Antique stays positive on HAL due to improving supply chains, while HSBC upgrades NTPC to Buy, citing expansion into battery storage, nuclear power, and capex clarity.",
            "pubDate": "2025-09-15T04:51:15.504482"
        },
        {
            "title": "Sensex falls over 50 pts, Nifty below 25,100 as IT weakness offsets gains in auto stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-and-nifty-50-open-flat-as-it-weakness-offsets-gains-in-auto-players/articleshow/123891213.cms",
            "description": "Indian stock markets, Sensex and Nifty, started the week cautiously. This mirrored a similar trend in Asian markets. Investors are awaiting the U.S. Federal Reserve's policy meeting. They also anticipate progress in India's trade talks with Washington. The Sensex closed slightly higher. The Nifty 50 also saw a marginal increase. Market participants are keenly observing global cues.",
            "pubDate": "2025-09-15T04:51:15.504582"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/123891430.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-09-15T04:51:15.504681"
        },
        {
            "title": "KRBL shares crash 13% after independent director quits over governance concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/krbl-shares-in-focus-as-independent-director-quits-over-governance-concerns/articleshow/123891498.cms",
            "description": "KRBL shares: Independent director Anil Kumar Chaudhary resigned, citing corporate governance concerns. He highlighted issues like inconsistent meeting records, withheld information, and unexplained write-offs that undermine oversight and stakeholder interests.",
            "pubDate": "2025-09-15T04:51:15.504831"
        },
        {
            "title": "Vedanta shares rise 2% as subsidiary settles long-standing EPC disputes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-as-subsidiary-settles-long-standing-epc-disputes/articleshow/123891481.cms",
            "description": "Vedanta's shares experienced a surge of 2.2% following its subsidiary, Talwandi Sabo Power Limited (TSPL), reaching a settlement agreement with SEPCO Electric Power Construction Corporation. This agreement resolves long-standing disputes related to EPC contracts for a 3x660 MW thermal power project, leading to the withdrawal of pending arbitration proceedings and strengthening TSPL's operational position.",
            "pubDate": "2025-09-15T04:51:15.504934"
        },
        {
            "title": "Tata Tech shares rise 3% after €75 million acquisition of Germany's ES-Tec Group",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-tech-shares-in-focus-as-75-million-acquisition-targets-earnings-boost/articleshow/123891428.cms",
            "description": "Tata Technologies will acquire Germany’s ES-Tec Group for €75 million in cash. The deal, expected to close by December 2025, will boost its earnings from the first full year and enhance its ER&D capabilities in next-gen mobility and systems engineering.",
            "pubDate": "2025-09-15T04:51:15.505031"
        },
        {
            "title": "GMDC, Hindustan Copper among 5 stocks that closed above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-hindustan-copper-among-5-stocks-that-closed-above-vwap/slideshow/123891389.cms",
            "description": "On September 12, the closing prices of five stocks in the Nifty500 pack rallied more than 2% above their VWAP (Volume Weighted Average Price), according to technical scan data from stockedge.com. A move above the VWAP is often seen as a potential bullish signal.When the closing price rises above the VWAP, it indicates that the stock ended the day higher than its average traded price, with the average weighted by trading volume. This is generally interpreted by traders and investors as a sign of positive sentiment in the market.Stocks closing above VWAP on September 12:",
            "pubDate": "2025-09-15T04:51:15.505126"
        },
        {
            "title": "Info Edge shares in focus after whistleblower complaint at 99acres unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/info-edge-shares-in-focus-after-whistleblower-complaint-at-99acres-unit/articleshow/123891309.cms",
            "description": "Info Edge shares: A whistleblower complaint alleged policy breaches at its 99acres unit. An independent investigation has been launched, though the company said there’s no material financial impact.",
            "pubDate": "2025-09-15T04:51:15.505223"
        },
        {
            "title": "Sebi’s equity tag for REITs to help unlock liquidity, index entry, global capital flows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-equity-tag-for-reits-to-help-unlock-liquidity-index-entry-global-capital-flows/articleshow/123891246.cms",
            "description": "SEBI's reclassification of Indian REITs as equity instruments is poised to boost the real estate sector. This move aligns India with global practices, paving the way for index inclusion and increased institutional investment. The decision is expected to enhance liquidity, broaden investor participation, and attract significant capital inflows into the growing Indian real estate market.",
            "pubDate": "2025-09-15T04:51:15.505325"
        },
        {
            "title": "NBCC, HFCL, among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-hfcl-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123891229.cms",
            "description": "There was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5.5% as of September 12, as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-15T04:51:15.505421"
        },
        {
            "title": "RailTel shares rally 8% after bagging Rs 210 crore order from Bihar Education Council",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railtel-shares-in-focus-after-bagging-rs-210-crore-order-from-bihar-education-council/articleshow/123891175.cms",
            "description": "RailTel share price: RailTel has bagged a Rs 210 crore order from Bihar Education Project Council under the PM SHRI scheme to supply digital infrastructure and related services aimed at enhancing education quality in the state. The project is slated for completion by September 2026.",
            "pubDate": "2025-09-15T04:51:15.505518"
        },
        {
            "title": "RIL, SBI Life, IRCTC among 13 stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-sbi-life-irctc-among-13-stocks-showing-rsi-trending-up/slideshow/123891148.cms",
            "description": "A total of 13 stocks from the Nifty200 pack were highlighted in the RSI Trending Up scan on September 12, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-15T04:51:15.505611"
        },
        {
            "title": "Adani Power shares jump 3% after 25-year, 2,400 MW power supply deal with Bihar Govt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-in-focus-after-25-year-2400-mw-power-supply-seal-with-bihar-govt/articleshow/123890722.cms",
            "description": "Adani Power share price: Adani Power signed a 25-year power supply agreement with Bihar State Power Generation Company for a 2,400 MW ultra supercritical thermal power plant in Bhagalpur district.  The $3 billion DBFOO project is expected to strengthen Bihar’s power availability and generate thousands of jobs.",
            "pubDate": "2025-09-15T04:51:15.505722"
        },
        {
            "title": "JBM Auto up 4%, extends rally for second day after subsidiary secures $100M investment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jbm-auto-up-4-extends-rally-for-second-day-after-subsidiary-secures-100m-investment/articleshow/123892503.cms",
            "description": "JBM Auto shares rose sharply on Monday, extending a two-day rally after its subsidiary, JBM Ecolife Mobility, secured a $100M IFC investment. The deal will fund 1,455 electric buses across India, reinforcing the country’s push for sustainable public transport.",
            "pubDate": "2025-09-15T05:20:18.290032"
        },
        {
            "title": "Gold prices firm above Rs 1.09 lakh/10 grams ahead of Fed meet. What's next?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-prices-firm-above-rs-1-09-lakh/10-grams-ahead-of-fed-meet-whats-next/articleshow/123892470.cms",
            "description": "Gold October futures traded above ₹1.09 lakh per 10 grams despite early profit booking ahead of the FOMC meeting, while silver December futures remained flat with a slight negative bias. Both metals gained last week, with gold reaching a record $3,700/oz and silver hitting a 14-year high on safe-haven demand and rate cut expectations.",
            "pubDate": "2025-09-15T05:20:18.290157"
        },
        {
            "title": "Ircon International, RVNL, other railway stocks rally up to 9% amid heavy trade volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ircon-international-rvnl-other-railway-stocks-rally-up-to-9-amid-heavy-trade-volumes/articleshow/123893104.cms",
            "description": "Railway stocks surged on Monday, with some counters rallying up to 9% on heavy volumes. Ircon International led the gains, followed by RVNL, Titagarh Rail, Texmaco Rail, and IRFC, while IRCTC saw modest growth. The sector’s rally was driven by strong buying interest.",
            "pubDate": "2025-09-15T05:45:01.962895"
        },
        {
            "title": "Bull run: 5 penny stocks under Rs 5 jump up to 225% in 1 year, turning multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bull-run-5-penny-stocks-under-rs-5-jump-up-to-225-in-1-year-turning-multibaggers/slideshow/123893051.cms",
            "description": "Penny stocks often come with high risk, but in the past year some of them have minted serious wealth. A few counters trading below Rs 5 have delivered returns of up to 225%, making them multibaggers. Here are the top 5 performers.",
            "pubDate": "2025-09-15T05:45:01.963017"
        },
        {
            "title": "Stocks to buy this week: IREDA, BEL among 7 stocks with potential upside of up to 21%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-this-week-ireda-bel-among-7-stocks-with-potential-upside-of-up-to-21/slideshow/123892971.cms",
            "description": "Nifty ended the previous week with gains of 1.5% with the index surpassing its immediate resistance at 25,100. Centrum Broking's Nilesh Jain said that Nifty trading above all key short-term and long-term moving averages is a positive sign and the strategy should be a buy on declines. ETMarkets has compiled 7 stocks to buy this week for a potential upside of 21%. Take a look!",
            "pubDate": "2025-09-15T05:45:01.963122"
        },
        {
            "title": "Shakti Pumps India shares zoom 13% in 2 sessions: What’s fuelling the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shakti-pumps-india-shares-zoom-13-in-2-sessions-whats-fuelling-the-rally/articleshow/123894265.cms",
            "description": "Shakti Pumps’ shares surged after farmers in Maharashtra fully booked the second tranche of solar pumps under the state’s subsidy scheme. With orders for 22,451 pumps worth ₹616.30 crore across two tranches, the company is well-positioned to deliver, backed by its strong presence and track record.",
            "pubDate": "2025-09-15T06:36:16.677289"
        },
        {
            "title": "Global central bank moves in focus as investors eye rate cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-central-bank-moves-in-focus-as-investors-eye-rate-cuts/articleshow/123894196.cms",
            "description": "Global markets are focused on upcoming central bank actions, especially a possible US Federal Reserve rate cut. Rajeev Agrawal highlighted uncertainty around capital flows and equity valuations. With the Bank of England and Bank of Japan also set to decide, shifting interest rate policies are expected to guide investor sentiment worldwide.",
            "pubDate": "2025-09-15T06:36:16.677507"
        },
        {
            "title": "HAL, Cochin Shipyard, BEML and other defence stocks rally as govt reviews Rs 2 lakh crore IAF jet deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hal-cochin-shipyard-beml-and-other-defence-stocks-rally-as-govt-reviews-rs-2-lakh-crore-iaf-jet-deal/articleshow/123894095.cms",
            "description": "Indian defence stocks continue to attract investor attention amid optimism over long-term sector growth and major deals like the Rafale project. Experts highlight strong order books at HAL, Mazagon Dock, and Cochin Shipyard, while cautioning that near-term valuations may be elevated. Government initiatives like Make in India and Aatmanirbhar Bharat support the structural growth story and indigenous defence production.",
            "pubDate": "2025-09-15T06:36:16.677718"
        },
        {
            "title": "LIC MF’s Toshniwal backs IT, banks, retail NBFCs; cautions on FMCG and staples",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-mfs-toshniwal-backs-it-banks-retail-nbfcs-cautions-on-fmcg-and-staples/articleshow/123893526.cms",
            "description": "Jaiprakash Toshniwal of LIC MF Asset Management sees a positive turn for Indian stocks. Festive demand and a resilient economy are key factors. He favors IT, banking, and retail NBFCs. He advises caution on overvalued staples. He notes improved conditions in the metals sector. Domestic factors and steady foreign investment should support markets.",
            "pubDate": "2025-09-15T06:36:16.677819"
        },
        {
            "title": "What Sebi chief's weekly expiry remark means for BSE. Explained with 5 scenarios",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-sebi-chiefs-weekly-expiry-remark-means-for-bse-explained-with-5-scenarios/articleshow/123893248.cms",
            "description": "SEBI’s board didn’t announce changes to derivative contracts but plans to release a consultation paper soon. Potential tweaks, such as altering expiries or contract sizes, could impact exchange earnings, especially for BSE, according to a Nuvama report.",
            "pubDate": "2025-09-15T06:36:16.677916"
        },
        {
            "title": "Jefferies initiates coverage on 3 alcohol stocks, calls one of them dark horse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-initiates-coverage-on-3-alcohol-stocks-calls-one-of-them-dark-horse/articleshow/123893180.cms",
            "description": "Jefferies initiates coverage on Indian spirits firms United Spirits, Radico Khaitan, and Allied Blenders with “Buy” ratings, citing premiumisation as a key growth driver. Radico is the top pick, while Allied is called a “dark horse” with potential for a turnaround.",
            "pubDate": "2025-09-15T06:36:16.678012"
        },
        {
            "title": "Infosys and other IT stocks slip up to 2% as profit-taking sets in after buyback-fueled rally, Fed caution looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-and-other-it-stocks-slip-up-to-2-as-profit-taking-sets-in-after-buyback-fueled-rally-fed-caution-looms/articleshow/123894359.cms",
            "description": "Infosys and other Indian IT shares fell on Monday as investors booked profits after last week’s 4.3% sector rally, spurred by Infosys’ record Rs 18,000 crore buyback. Rising caution ahead of the US Federal Reserve’s policy meeting also weighed on sentiment. The Nifty IT index declined 1%, with Infosys slipping 1.6% to Rs 1,501.40.",
            "pubDate": "2025-09-15T06:53:29.835112"
        },
        {
            "title": "Defence stocks: Buy, sell, hold? Answer lies in understanding business & diversification: 9 stocks, 5 with upside potential of over 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-buy-sell-hold-answer-lies-in-understanding-business-diversification-9-stocks-5-with-upside-potential-of-over-32/articleshow/123894693.cms",
            "description": "Ahead of the 2024 general elections, defence sector stocks were grabbing all the attention. They were also getting re-rated. Then came a phase where they underperformed. Operation Sindoor brought them back into the limelight. In the last few days, defence stocks are again moving higher. Why is it happening? And should you focus on one stock, or look at a broader spectrum of defence stocks? Before you take any decision, it is important to understand the nuances of each company because that will determine whether you make money from these stocks or not.",
            "pubDate": "2025-09-15T07:09:52.692354"
        },
        {
            "title": "Vodafone Idea shares jump 7% as telco’s AGR plea reportedly gets Sept 19 hearing date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-jump-7-as-telcos-agr-plea-reportedly-gets-sept-19-hearing-date/articleshow/123894458.cms",
            "description": "Vodafone Idea shares surged nearly 7% after the telco’s petition challenging DoT’s additional AGR dues was reportedly scheduled for a hearing on September 19. The company seeks to quash the Rs 9,450 crore demand, citing duplication and accounting discrepancies, while funding talks continue.",
            "pubDate": "2025-09-15T07:09:52.692485"
        },
        {
            "title": "Should Sebi ban weekly options? Here’s what Zerodha’s Nithin Kamath thinks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/should-sebi-ban-weekly-options-heres-what-zerodhas-nithin-kamath-thinks/articleshow/123899256.cms",
            "description": "As speculation grows around Sebi’s upcoming consultation paper that may propose a ban on weekly index expiries, Zerodha founder and CEO Nithin Kamath said a complete ban would make sense from an outsider’s perspective. In a post on X, he added he wouldn’t be surprised if Sebi tightened rules to make F&O trading harder for retail investors.",
            "pubDate": "2025-09-15T10:47:29.172726"
        },
        {
            "title": "Market Wrap: Sensex slips 119 points, Nifty snaps 8-day winning run as IT, auto stocks drag ahead of Fed decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slips-119-points-nifty-snaps-8-day-winning-run-as-it-auto-stocks-drag-ahead-of-fed-decision/articleshow/123898842.cms",
            "description": "Indian equities ended lower on Monday, with the Nifty 50 breaking an eight-session winning streak, as weakness in IT and auto shares dragged benchmarks lower.",
            "pubDate": "2025-09-15T10:47:29.172886"
        },
        {
            "title": "SBI MF and JioBlackRock among eight AMCs hit by over Rs 3,000 crore AUM fall in August",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-mf-and-jioblackrock-among-eight-amcs-hit-by-over-rs-3000-crore-aum-fall-in-august/slideshow/123899053.cms",
            "description": "Eight mutual funds saw a decline of over Rs 3,000 crore in their respective AUMs in August. At present, there are 48 AMCs, including one new entrant. Of the remaining 47, 21 reported a decline in AUM (Source: ACE MF).",
            "pubDate": "2025-09-15T10:47:29.172988"
        },
        {
            "title": "​Mazagon Dock shares among Axis Securities' top 3 technical betsfornext 3-4 weeks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mazagon-dock-shares-among-axis-securities-top-3-technical-betsfornext-3-4-weeks/slideshow/123898854.cms",
            "description": "The Nifty index wrapped up the previous week on a strong footing, closing at 25,114 with a weekly gain of 373 points. Buying momentum remained robust, largely supported by optimism surrounding a potential US Fed rate cut later this month.The index has been consolidating within the 25,250–24,350 range for the past several weeks, and traders are closely watching for a breakout. With technical indicators showing strength, Axis Securities has shared three top technical picks for the next 3-4 weeks:",
            "pubDate": "2025-09-15T10:47:29.173086"
        },
        {
            "title": "Bajaj Group’s Maharashtra Scooters announces 1,600% dividend, stock rises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-groups-maharashtra-scooters-announces-1600-dividend-stock-up-3/articleshow/123898305.cms",
            "description": "Maharashtra Scooters, a Bajaj Group company, declared a massive interim dividend of Rs 160 per share (1,600% of face value), sending shares up nearly 3% on Monday. The record date is September 22, with payouts expected around October 13, 2025.",
            "pubDate": "2025-09-15T10:47:29.173182"
        },
        {
            "title": "This multibagger smallcap stock is up 13% as govt mulls big tax breaks for data centers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-multibagger-smallcap-stock-is-up-13-as-govt-mulls-big-tax-breaks-for-data-centers/articleshow/123898201.cms",
            "description": "Shares of Anant Raj Ltd. surged 13% to Rs 604, emerging as the top gainer on the NSE Smallcap Index, after reports said the government may grant tax exemptions of up to 20 years for data centre developers. The company, which has expanded into data centres and cloud services, also reported strong Q1 earnings growth.",
            "pubDate": "2025-09-15T10:47:29.173283"
        },
        {
            "title": "Sebi’s exit load cut a ‘hygiene change’, says Feroze Azeez",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-exit-load-cut-a-hygiene-change-says-feroze-azeez/articleshow/123898082.cms",
            "description": "SEBI’s new rules—cutting mutual fund exit load caps to 3% and reclassifying REITs as equities—were termed “progressive” by Anand Rathi Wealth’s Feroze Azeez, though he stressed their practical impact will differ across funds, assets, and investors.",
            "pubDate": "2025-09-15T10:47:29.173376"
        },
        {
            "title": "Why Shankar Sharma calls data centre stocks a bubble and enthusiasm around them a \"hope trade\"",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-shankar-sharma-calls-data-centre-stocks-a-bubble-and-enthusiasm-around-them-a-hope-trade/articleshow/123898043.cms",
            "description": "Data centre stocks surged over 12%, but Shankar Sharma warned the rally is a ‘hope trade.’ He likened the business to telecom towers, citing heavy capex, weak economics, low ROI, and high customer bargaining power.",
            "pubDate": "2025-09-15T10:47:29.173466"
        },
        {
            "title": "Bank Nifty to drive market rally; defence, alcobev stocks in focus: Pankaj Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-nifty-to-drive-market-rally-defence-alcobev-stocks-in-focus-pankaj-pandey/articleshow/123896824.cms",
            "description": "Indian equities are poised for gains this week, driven by banking and IT sectors, according to Pankaj Pandey. He anticipates Bank Nifty leading the rally, potentially reaching 25,800, despite previous FII selling pressure. Pandey highlights strong growth visibility in the defence sector, with potential ₹8-10 lakh crore orders in the coming years.",
            "pubDate": "2025-09-15T10:47:29.173565"
        },
        {
            "title": "Should Eternal, Swiggy investors worry as Amazon enters quick commerce?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/should-eternal-swiggy-investors-worry-as-amazon-enters-quick-commerce/articleshow/123896720.cms",
            "description": "Amazon’s 10-minute delivery service, Amazon Now, has expanded to Mumbai, adding pressure to quick commerce in India. However, analysts from Emkay, JM Financial, Nomura, and Morgan Stanley believe its entry won’t yet intensify competition for players like Eternal (Blinkit) and Swiggy.",
            "pubDate": "2025-09-15T10:47:29.173659"
        },
        {
            "title": "Not just US Fed, 14 other central banks to hold monetary policy meetings this week. What to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/not-just-us-fed-14-other-central-banks-to-hold-monetary-policy-meetings-this-week-what-to-expect/articleshow/123896642.cms",
            "description": "Global markets brace for a volatile week as fifteen central banks, including the U.S. Federal Reserve, the Bank of England, the Bank of Japan, and the European Central Bank, are set to announce key policy decisions. The U.S. Federal Reserve is expected to cut rates amidst a cooling labor market, while the ECB is likely to hold steady.",
            "pubDate": "2025-09-15T10:47:29.173747"
        },
        {
            "title": "15+ MFs add these 10 stocks in August '25; 4 stocks rally over 50% in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/15-mfs-add-these-10-stocks-in-august-25-4-stocks-rally-over-50-in-fy26/slideshow/123896810.cms",
            "description": "In August 2025, mutual funds (MFs) maintained strong confidence in Indian equities, with net investments totaling about Rs 70,534 crore for the month. According to an analysis by ETMarkets, 13 stocks were added to the portfolios of at least 15 mutual fund schemes during the month of August —an increase from July 2025. Of these 13 stocks, 10 have delivered positive returns so far in FY26, with 4 of them surging over 50%.However, not all bets have paid off. Three stocks namely Clean Science and Technology, Infosys, and Sona BLW Precision Forgings — despite being popular among fund houses, have struggled to find their footing this fiscal, posting negative returns so far. (Data Source: ACE MF | ACE Equity)",
            "pubDate": "2025-09-15T10:47:29.173856"
        },
        {
            "title": "Sigachi Industries shares rally 9% ahead of dividend record date of September 16",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sigachi-industries-shares-rally-9-ahead-of-dividend-record-date-of-september-16/articleshow/123896058.cms",
            "description": "Sigachi Industries’ shares surged ahead of its dividend record date on September 16. The board has recommended a 10% dividend, and trading volumes spiked well above recent averages.",
            "pubDate": "2025-09-15T10:47:29.173953"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 23% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-23-in-1-year/articleshow/123895955.cms",
            "description": "After four weeks of upward movement both at the index and market breadth levels, it is natural for some profit-booking to emerge. But given the GST rate rationalisation (which may boost consumption) and a likely India-US trade deal, the bias can be expected to be towards the bulls even in case of volatility. But as investors, you need to be selective and not forget that earnings are slowing and valuations are not cheap. The selected stocks on our list today depict a strong upward trajectory in their overall average score which is based on five key pillars, i.e., earnings, fundamentals, relative valuation, risk and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-09-15T10:47:29.174043"
        },
        {
            "title": "European shares lifted by banking stocks, Rubis shines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-lifted-by-banking-stocks-rubis-shines/articleshow/123895514.cms",
            "description": "A report of bids for Rubis from CVC Capital Partners and Trafigura lifted the fuel retailer's shares 6.7% to the top of the STOXX 600 index. The French company is valued at about $3.5 billion.",
            "pubDate": "2025-09-15T10:47:29.174135"
        },
        {
            "title": "Metals remain attractive; consumer staples face pricing challenge: Kenneth Andrade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metals-remain-attractive-consumer-staples-face-pricing-challenge-kenneth-andrade/articleshow/123895256.cms",
            "description": "Kenneth Andrade of Old Bridge Capital remains positive on Indian metals due to cost advantages and capital efficiency. He's cautious about non-discretionary consumer goods, awaiting a litmus test this quarter. The focus fund's 11% cash position stems from inflows, to be deployed in existing sectors like pharma, metals, tech, and auto.",
            "pubDate": "2025-09-15T10:47:29.174222"
        },
        {
            "title": "Former Axis MF fund manager pays fine to settle Sebi rules violation case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/former-axis-mf-fund-manager-pays-fine-to-settle-sebi-rules-violation-case/articleshow/123902872.cms",
            "description": "Sebi has settled proceedings against Deepak Agrawal, a former Axis MF fund manager, after he paid ₹85.8 lakh and surrendered over 43,000 mutual fund units. This action follows allegations of violating market norms, including sharing stock tips and divulging sensitive information. Agrawal settled without admitting or denying the charges.",
            "pubDate": "2025-09-15T13:43:45.684069"
        },
        {
            "title": "Maharashtra Scooters, Bajaj Finance among 11 stocks that hit 52-week highs&ralliedup to 35% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maharashtra-scooters-bajaj-finance-among-11-stocks-that-hit-52-week-highs-rallied-up-to-35-in-a-month/slideshow/123902559.cms",
            "description": "On Monday, the benchmark Sensex dipped by approximately 119 points, closing at 81,785. Despite the broader market weakness, 11 stocks from the BSE 500 index climbed to their 52-week highs, marking their highest levels in a year. These breakout moves are often viewed by traders and investors as bullish signals, suggesting strong upward momentum and the potential for further gains.",
            "pubDate": "2025-09-15T13:43:45.684219"
        },
        {
            "title": "Highway tendering likely to pick up in H2, Toll growth strong: CareEdge Ratings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/highway-tendering-likely-to-pick-up-in-h2-toll-growth-strong-careedge-ratings/articleshow/123902239.cms",
            "description": "Highway tendering remained muted in H1 FY26 due to revised norms and approval delays, but CareEdge expects strong momentum in H2 with over 125 projects identified, despite construction bottlenecks and 7–10% growth moderation.",
            "pubDate": "2025-09-15T13:43:45.684359"
        },
        {
            "title": "8 midcap stocks post highest quarterly profits in 10 quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-midcap-stocks-post-highest-quarterly-profits-in-10-quarters/slideshow/123901480.cms",
            "description": "Achieving the highest quarterly net profit in the last 10 quarters indicates strong financial performance and growth for the company. In the NSE midcap segment, eight companies have stood out by posting profits more than 25% higher than their previous highest profits in the last 10 quarters, according to stockedge.com's profitability scan data.This record profit suggests effective management, improved operations, and possibly favorable market conditions. It enhances investor confidence and positions the company as a leader in its sector, signaling potential for sustained future growth. Overall, it reflects a positive trend that can attract further investment interest.",
            "pubDate": "2025-09-15T13:43:45.684477"
        },
        {
            "title": "Stock Radar: Fortis Healthcare stock hit fresh record high in September; what should investors do – buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-fortis-healthcare-stock-hit-fresh-record-high-in-september-what-should-investors-do-buy-or-book-profits/articleshow/123853999.cms",
            "description": "Fortis Healthcare Ltd. reached a new record high in September, signaling a potentially continued rally. Experts suggest short-term traders consider buying the stock, either immediately or on dips, targeting Rs 1,050 within the next 3-4 weeks. The stock demonstrates positive momentum, trading above key moving averages, with analysts recommending a buy with a stop-loss at Rs 930.",
            "pubDate": "2025-09-15T13:43:45.684596"
        },
        {
            "title": "Elon Musk buys $1 billion worth of Tesla shares from open market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musk-purchases-about-1-billion-worth-of-tesla-shares/articleshow/123899932.cms",
            "description": "Elon Musk, Tesla's CEO, recently bought company shares worth $1 billion. This purchase occurred on Friday across multiple transactions. It marks Musk's first open market stock purchase since February 2020. He acquired approximately 2.57 million shares. Tesla's stock performance has been strong over the past year. The company is also seeking shareholder approval for a new pay package for Musk.",
            "pubDate": "2025-09-15T13:43:45.684708"
        },
        {
            "title": "Realty stocks fall up to 66% in 1 year but Elara sees up to 85% gains by Sobha, 6 others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/realty-stocks-fall-up-to-66-in-1-year-but-elara-sees-up-to-85-gains-by-sobha-6-others/slideshow/123899917.cms",
            "description": "Realty stocks have been battered over the past one year, with Nifty Realty declining 14% and stocks falling as much as 66%.Brokerage Elara Capital now sees a turnaround in certain stocks based on multiple levers. One is the luxury sales volume YoY increase remaining broad-based while inventory overhang stable QoQ in Tier I cities. Secondly, strong offtake in new launches and preference for branded players remaining intact. In its view, 7 realty names are poised for up to 85% growth. Here are stocks to buy and accumulate:",
            "pubDate": "2025-09-15T13:43:45.684828"
        }
    ]
}