{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-21T17:08:17.868270",
    "items": [
        {
            "title": "Asian stocks drop after Wall Street, bonds steady",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-drop-after-wall-street-bonds-steady/articleshow/126898819.cms",
            "description": "Asian markets fell Wednesday, mirroring a Wall Street slump. Investors reacted to trade tensions over Greenland and bond market volatility. Gold prices reached a new record. Japanese, South Korean, and Australian stocks opened lower. US Treasury yields saw a significant rise. Global funds are pulling back from American assets. This situation highlights growing investor unease.",
            "pubDate": "2026-01-21T00:56:49.464375"
        },
        {
            "title": "Wall Street posts biggest daily drop in three months, Trump Greenland tariff threat triggers wide selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-posts-biggest-daily-drop-in-three-months-trump-greenland-tariff-threat-triggers-wide-selloff/articleshow/126897472.cms",
            "description": "Major Wall Street indexes experienced their largest one-day drops in three months, driven by renewed tariff threats from President Trump against Europe. This \"risk-off\" sentiment boosted gold to record highs and pressured U.S. Treasuries, while Bitcoin also declined. The selloff, triggered by Trump's proposed tariffs on European goods, raises concerns about market volatility.",
            "pubDate": "2026-01-21T00:56:49.464498"
        },
        {
            "title": "Narmadesh Brass shares to debut today on BSE SME platform. Check GMP and other detaills",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/narmadesh-brass-shares-to-debut-today-on-bse-sme-platform-check-gmp-and-other-detaills/articleshow/126914204.cms",
            "description": "The ₹44.87 crore fixed-price IPO of Narmadesh Brass was open for subscription from January 12 to January 16. Priced at ₹515 per share, the issue included a fresh share issuance worth ₹36.09 crore along with an offer for sale amounting to ₹8.78 crore.",
            "pubDate": "2026-01-21T02:57:46.353788"
        },
        {
            "title": "Negative Breakout: These 12 stocks cross below their 200 DMA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-12-stocks-cross-below-their-200-dma/slideshow/126913633.cms",
            "description": "In the Nifty200 pack, 12 stocks' closing prices crossed below their 200 DMA (Daily Moving Averages) on January 20, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock.",
            "pubDate": "2026-01-21T02:57:46.353893"
        },
        {
            "title": "Foreign funds return to Indian tech stocks on AI growth bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-funds-return-to-indian-tech-stocks-on-ai-growth-bets/articleshow/126912698.cms",
            "description": "Foreign investors are returning to Indian IT stocks, driven by the rising adoption of artificial intelligence and improved business visibility. Companies such as TCS, Infosys and HCL Tech are seeing strong AI-led growth, reviving sector sentiment despite near-term earnings pressure and uneven performance across firms.",
            "pubDate": "2026-01-21T02:57:46.353982"
        },
        {
            "title": "Investors eye Budget to unlock gains in state companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-eye-budget-to-unlock-gains-in-state-companies/articleshow/126910699.cms",
            "description": "Indian state-run stocks are poised for further outperformance as investors anticipate the upcoming budget to signal renewed stake sales for fund-raising and economic support. Attractive valuations and a potential government push for disinvestments are boosting these companies, which currently trade at a significant discount to their asset values.",
            "pubDate": "2026-01-21T02:57:46.354064"
        },
        {
            "title": "Warren Buffett's successor eyes selling off Berkshire Hathaway's 325 million Kraft Heinz shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffetts-successor-eyes-selling-off-berkshire-hathaways-325-million-kraft-heinz-shares/articleshow/126909405.cms",
            "description": "Warren Buffett's successor, Greg Abel, is signaling a potential shift at Berkshire Hathaway. Kraft Heinz disclosed that Berkshire, its largest shareholder, may sell its substantial stake. This move, if completed, could mark a departure from Buffett's acquisition-focused strategy, with Abel potentially reviewing all company holdings for performance.",
            "pubDate": "2026-01-21T02:57:46.354142"
        },
        {
            "title": "BHEL slides almost 5% in a weak market despite ‘strong’ Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-slides-almost-5-in-a-weak-market-despite-strong-q3/articleshow/126905602.cms",
            "description": "On Tuesday, Bharat Heavy Electricals' stock suffered a notable plunge of more than 4%, representing its most dramatic decline in five months. This downturn stemmed from investor concerns over margin pressures revealed in the company's third-quarter report. Analysts are optimistic, predicting that improvements in margins could surface once new contracts are underway post-fiscal year 2026.",
            "pubDate": "2026-01-21T02:57:46.354225"
        },
        {
            "title": "D-Street has an upside & downside on Hindustan Zinc",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-has-an-upside-downside-on-hindustan-zinc/articleshow/126905166.cms",
            "description": "Hindustan Zinc's December quarter results have drawn mixed reactions from brokerages. While analysts are impressed by the company's robust operating performance, they express caution regarding the stock's high valuation. Price targets from various firms suggest potential downside or modest upside from current levels.",
            "pubDate": "2026-01-21T02:57:46.354307"
        },
        {
            "title": "IT earnings recovery not quite made to order, but seen on track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-earnings-recovery-not-quite-made-to-order-but-seen-on-track/articleshow/126903785.cms",
            "description": "Despite strong order bookings, the BSE Infotech index has seen minimal gains, reflecting investor concerns over project execution delays slowing revenue growth. Analysts anticipate a gradual recovery driven by large deal ramp-ups and AI opportunities, though short-term trends remain subject to geopolitical factors.",
            "pubDate": "2026-01-21T02:57:46.354387"
        },
        {
            "title": "With nearly Rs 10 lk cr m-cap lost, D-Street shivers as winds blow in from Greenland",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/with-nearly-rs-10-lk-cr-m-cap-lost-d-street-shivers-as-winds-blow-in-from-greenland/articleshow/126901683.cms",
            "description": "Indian markets experienced their steepest single-day plunge in nine months, with the Nifty and Sensex falling significantly. This sell-off was driven by heightened geopolitical uncertainty surrounding US President Trump's Greenland plans and threatened tariffs on European nations. The fear gauge jumped, while gold and silver extended their record-breaking rally.",
            "pubDate": "2026-01-21T02:57:46.354483"
        },
        {
            "title": "Gift Nifty signals positive start for the day; here's the trading setup for the session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-signals-negative-start-for-the-day-heres-the-trading-setup-for-the-session/articleshow/126900271.cms",
            "description": "Indian stock markets saw a sharp correction on Wednesday. The Nifty closed 353 points lower, and the Sensex fell by 1066 points. Analysts suggest the market is oversold, and a pullback rally is possible. Global markets also experienced declines, influenced by trade tensions and bond market volatility. The Indian Rupee hit a record low against the US dollar.",
            "pubDate": "2026-01-21T02:57:46.354563"
        },
        {
            "title": "Stocks in news: Eternal, Tata Motors, Restaurant Brands Asia, AU Small Finance Bank, RBL Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-eternal-tata-motors-restaurant-brands-asia-au-small-finance-bank-rbl-bank/articleshow/126899405.cms",
            "description": "Indian markets saw a decline on Tuesday due to widespread selling and weak global sentiment. Analysts are watching key sectors like banking and IT for potential rebounds. Several companies including Eternal, Tata Motors, and AU Small Finance Bank are in focus due to news and third-quarter results.",
            "pubDate": "2026-01-21T02:57:46.354640"
        },
        {
            "title": "Shoppers Stop shares tumble over 12% after Q3 profit falls to Rs 16 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shoppers-stop-shares-tumble-over-12-after-q3-profit-falls-to-rs-16-crore/articleshow/126930966.cms",
            "description": "Shoppers Stop shares plummeted over 12% after the retail chain reported a 69.13% decline in consolidated net profit to Rs 16.12 crore for the December quarter of FY26. This drop was attributed to a shifted festival period and uneven consumption trends, despite a marginal 2.63% increase in revenue from operations.",
            "pubDate": "2026-01-21T05:18:42.465102"
        },
        {
            "title": "Tata Teleservices shares slide 6% in 2 days after Q3 results. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-teleservices-shares-slide-6-in-2-days-after-q3-results-heres-why/articleshow/126929793.cms",
            "description": "Shares of Tata Teleservices (Maharashtra) have fallen more than 6% in two sessions after its December-quarter results, as investors looked beyond a sharp narrowing of losses and focused on an 11.5% year-on-year decline in revenue and weak technical indicators that signalled continued near-term pressure on the stock.",
            "pubDate": "2026-01-21T05:18:42.465227"
        },
        {
            "title": "Budget 2026 bets! Axis picks 26 stocks to watch out for on February 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-bets-axis-picks-26-stocks-to-watch-out-for-on-february-1/slideshow/126925737.cms",
            "description": "With the Union Budget 2026 set to be unveiled on February 1, Axis Securities has identified 26 stocks across eight key sectors that could be in focus as policy announcements shape market direction. The picks are anchored in themes such as infrastructure spending, consumption recovery, manufacturing push, offering investors a curated list of stocks to watch as budget-related triggers unfold.",
            "pubDate": "2026-01-21T05:18:42.465356"
        },
        {
            "title": "United Spirits shares fall over 3% after Q3 earnings fail to cheer investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/united-spirits-shares-fall-over-3-after-q3-earnings-fail-to-cheer-investors/articleshow/126930462.cms",
            "description": "United Spirits shares dropped more than three percent on Wednesday. The Diageo-controlled liquor maker's third-quarter revenue growth did not excite investors. The company's net profit rose by over twenty-four percent to Rs 418 crore. However, revenue from operations saw a modest increase of two point seven one percent.",
            "pubDate": "2026-01-21T05:18:42.465469"
        },
        {
            "title": "Amagi Media Labs shares list at 12% discount to IPO price on BSE, NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amagi-media-labs-shares-list-at-12-discount-to-ipo-price-on-bse-nse/articleshow/126926657.cms",
            "description": "Amagi Media Labs made a weak market debut, listing at a 12% discount despite strong subscription demand. The Rs 1,789 crore IPO comprised a fresh issue of shares worth Rs 816 crore and an offer for sale of Rs 972.62 crore. The IPO was open for subscription between January 13 and January 16, with allotment finalised on January 19.",
            "pubDate": "2026-01-21T05:18:42.465568"
        },
        {
            "title": "HSBC, CLSA upgrade CreditAccess Grameen after strong Q3; stock zooms 10%. Check target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-clsa-upgrade-creditaccess-grameen-after-q3-stock-jumps-10-check-target-price/articleshow/126926304.cms",
            "description": "CreditAccess Grameen shares jumped significantly after HSBC and CLSA upgraded the stock to Buy. This followed strong December quarter results. The company reported a substantial net profit increase driven by margin expansion and lower provisions. Asset quality improved, and new borrowers were added. Robust liquidity and a healthy capital position were also noted.",
            "pubDate": "2026-01-21T05:18:42.465668"
        },
        {
            "title": "Buy, sell, or hold? Nuvama hikes Persistent Systems target; Motilal Oswal reiterates buy on CEAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-hikes-persistent-systems-target-motilal-oswal-reiterates-buy-on-ceat/articleshow/126924583.cms",
            "description": "Brokerages maintain a positive outlook on select IT services, consumer staples, and auto ancillary stocks, citing strong operational performance and growth potential. Nuvama reiterates a 'Buy' on Persistent Systems and United Spirits, while Motilal Oswal maintains a bullish stance on CEAT, highlighting margin improvements and favorable industry dynamics.",
            "pubDate": "2026-01-21T05:18:42.465764"
        },
        {
            "title": "Sensex falls over 150 pts, Nifty tests 25,250 as selloff pressure, FII outflows weigh on sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-150-pts-nifty-tests-25250-as-selloff-pressure-fii-outflows-weigh-on-sentiment/articleshow/126923000.cms",
            "description": "Indian equities opened lower on Wednesday, extending the previous session's sharp selloff and pushing the Sensex and Nifty to over three-month lows. Persistent foreign fund outflows, mixed corporate earnings, and ongoing global trade and geopolitical concerns continue to dampen market sentiment.",
            "pubDate": "2026-01-21T05:18:42.465858"
        },
        {
            "title": "Oberoi Realty among 5 F&O stocks with sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oberoi-realty-among-5-fo-stocks-with-sharp-rise-in-futures-open-interest/slideshow/126922259.cms",
            "description": "As of January 20, futures open interest surged by more than 10% in five stocks from the NSE F&O segment compared with the previous trading session. A sharp rise in futures open interest indicates an increase in the number of outstanding, unexpired contracts in a stock, suggesting fresh position-building or an expansion of existing positions by market participants.",
            "pubDate": "2026-01-21T05:18:42.465949"
        },
        {
            "title": "Ceat, Newgen Software among 5 stocks that closed below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ceat-newgen-software-among-5-stocks-that-closed-below-vwap/slideshow/126921525.cms",
            "description": "On January 20, the closing prices of five stocks from the Nifty 500 universe slipped more than 2.5% below their respective VWAPs (Volume Weighted Average Price), signalling a potential bearish trend, according to StockEdge.com’s technical scan data.A close below the VWAP indicates that the stock ended the session below its average traded price for the day, weighted by volume. This is often interpreted as a sign of increased selling pressure.",
            "pubDate": "2026-01-21T05:18:42.466042"
        },
        {
            "title": "Adani stocks: How LIC, GQG and FIIs reshuffled their portfolios in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-stocks-how-lic-gqg-and-fiis-reshuffled-their-portfolios-in-q3/articleshow/126920943.cms",
            "description": "LIC and GQG reshuffled their Adani Group portfolios in the December quarter. LIC reduced holdings in Adani Enterprises and Adani Ports but increased its stake in ACC. GQG booked profits in Adani Ports and Adani Power. Foreign Institutional Investors saw mixed movements across Adani stocks. Mutual funds also adjusted their positions.",
            "pubDate": "2026-01-21T05:18:42.466134"
        },
        {
            "title": "Baazar Style Retail shares decline 5% on Cupid's warrant deal announcement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-baazar-style-retail-shares-in-focus-on-strategic-warrant-deal/articleshow/126920470.cms",
            "description": "Shares of Cupid Ltd and Baazar Style Retail are set to remain in focus after Cupid proposed a strategic investment in the retailer through convertible equity warrants. Baazar Style Retail’s board approved a preferential issue of 1.01 crore warrants at Rs 328.25 apiece, raising Rs 331.53 crore in cash, subject to regulatory and shareholder approvals.",
            "pubDate": "2026-01-21T05:18:42.466230"
        },
        {
            "title": "Stocks to buy in 2026: Havells India, JK Cement among 5 stocks that could give double digit return in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-havells-india-jk-cement-among-5-stocks-that-could-give-double-digit-return-in-long-term/slideshow/126919730.cms",
            "description": "Brokerage views on select stocks remain constructive, reflecting a mix of growth visibility, valuation comfort, and sector-specific tailwinds.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-21T05:18:42.466340"
        },
        {
            "title": "Tata Motors shares rise over 1% after BNP Paribas buys Rs 152 crore stake via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-after-bnp-paribas-buys-rs-152-crore-stake-via-block-deal/articleshow/126919020.cms",
            "description": "Tata Motors Commercial Vehicles shares saw a rise on Wednesday. This followed a significant stake acquisition by BNP Paribas on Tuesday. The French banking major purchased over 35.43 lakh shares. Goldman Sachs was the seller in this block deal. The stock has shown strong short-term performance. Institutional interest and technical indicators suggest continued investor attention.",
            "pubDate": "2026-01-21T05:18:42.466434"
        },
        {
            "title": "Persistent Systems shares tumble over 3% after Q3 results: Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/persistent-systems-shares-in-focus-after-q3-results-should-you-buy-sell-or-hold/articleshow/126917077.cms",
            "description": "Amidst a slight downturn in share prices on Wednesday, Persistent Systems continues to draw analysts' praise following its December quarterly performance. With margins exceeding expectations and a string of successful deals, the outlook remains bright; however, some analysts are calling for more transparency regarding the durability of these margin gains.",
            "pubDate": "2026-01-21T05:18:42.466531"
        },
        {
            "title": "Tips Music among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tips-music-among-5-stocks-showing-bullish-rsi-upswing/slideshow/126918042.cms",
            "description": "On January 20, five NSE-listed stocks with a market capitalisation exceeding Rs 1,000 crore appeared in the RSI Trending Up scan, based on data from StockEdge.com. An uptrend signal is generated when the RSI crosses above 50 from below, reflecting strengthening price momentum and improving sentiment.",
            "pubDate": "2026-01-21T05:18:42.466622"
        },
        {
            "title": "India EU trade deal closer than ever: Jefferies lists 4 sectoral winners for stock market investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-eu-trade-deal-closer-than-ever-jefferies-lists-4-sectoral-winners-for-stock-market-investors/articleshow/126938736.cms",
            "description": "India’s proposed free trade agreement with the EU is nearing completion, with Jefferies identifying textiles, autos, electronics and pharma as key beneficiaries. The brokerage sees tariff relief, regulatory easing and deeper supply chain integration supporting Indian exporters while agri and dairy remain excluded.",
            "pubDate": "2026-01-21T06:42:34.830201"
        },
        {
            "title": "MRPL shares jump 7% after three day decline, eyes Venezuelan oil purchases",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mrpl-shares-jump-7-after-three-day-decline-eyes-venezuelan-oil-purchases/articleshow/126935820.cms",
            "description": "MRPL shares rebounded sharply after a three day decline as investors took comfort from strong Q3 earnings and the company’s move to explore Venezuelan crude purchases while halting Russian imports to comply with international sanctions.",
            "pubDate": "2026-01-21T06:42:34.830325"
        },
        {
            "title": "Rs 6 lakh crore wiped out! Sensex crashes 1,000 points, Nifty slips below 25,000. 5 factors behind today’s market meltdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-today-rs-3-lakh-crore-gone-sensex-cracks-over-700-points-nifty-below-25100-5-key-factors-behind-the-stock-market-fall-today/articleshow/126933526.cms",
            "description": "Sensex Crash Today: Indian equities experienced a significant selloff for the third consecutive session, with the BSE Sensex and Nifty 50 tumbling due to global uncertainties and weak domestic earnings. Escalating tensions from U.S. President Trump's threats, a depreciating rupee, and persistent foreign fund outflows further eroded investor confidence, leading to substantial wealth destruction.",
            "pubDate": "2026-01-21T06:42:34.830522"
        },
        {
            "title": "Reliance Industries shares tumble to deepest oversold level in 5 years. Should you buy the dip before Jio IPO?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-tumble-to-deepest-oversold-level-in-5-years-should-you-buy-the-dip-before-jio-ipo/articleshow/126932941.cms",
            "description": "Reliance Industries shares have seen a significant drop, reaching their most oversold point in five years. Concerns about a slowdown in the retail business and potential hits to O2C margins are impacting the stock. Despite these challenges, analysts remain largely positive, with most recommending a buy or add.",
            "pubDate": "2026-01-21T06:42:34.830627"
        },
        {
            "title": "Kalyan Jewellers shares tank 14%, fall for 9th consecutive session. Should investors exit?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-jewellers-shares-tank-14-fall-for-9th-consecutive-session-should-investors-exit/articleshow/126943018.cms",
            "description": "Kalyan Jewellers shares plunged 14% to Rs 390, marking a ninth consecutive session of decline, down 25% in that period. This bearish run coincides with gold prices hitting record highs, potentially impacting consumer purchasing decisions. Despite this, the company reported a robust 42% year-on-year revenue jump in Q3 FY2026, driven by strong festive demand and international growth.",
            "pubDate": "2026-01-21T07:04:49.417076"
        },
        {
            "title": "Amagi Media Labs shares rally 13% after discount listing tests investor conviction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amagi-media-labs-shares-rally-13-after-discount-listing-tests-investor-conviction/articleshow/126943436.cms",
            "description": "Amagi Media Labs shares rebounded sharply on their debut day, rising nearly 13% from opening levels after listing at a double-digit discount to the issue price. The recovery came despite a muted start that mirrored grey market expectations, as strong institutional and non-institutional demand in the IPO underscored investor confidence in the company’s connected TV and ad-tech growth story.",
            "pubDate": "2026-01-21T07:04:49.417208"
        },
        {
            "title": "Blackstone said to weigh $500 million India IPO for PGP Glass",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstone-said-to-weigh-500-million-india-ipo-for-pgp-glass/articleshow/126947711.cms",
            "description": "Blackstone Inc. is exploring a public offering for its Indian glass packaging firm, PGP Glass Pvt. The deal could raise up to $500 million. Discussions are ongoing with banks for a potential valuation of $4 billion. This move comes as India's IPO market shows strong performance. PGP Glass specializes in glass packaging for various sectors.",
            "pubDate": "2026-01-21T07:38:42.303624"
        },
        {
            "title": "Netflix shares drop 7% in Europe after Q4 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netflix-shares-drop-7-in-europe-after-q4-results/articleshow/126951602.cms",
            "description": "Netflix ‍shares listed ​in Frankfurt fell ⁠in early trade on Wednesday despite beating expectations ‌for ‌fourth quarter revenue and earnings, ‌as the company remains locked in a fierce bidding war for Warner ​Bros Discovery.",
            "pubDate": "2026-01-21T07:54:23.449629"
        },
        {
            "title": "From bloodbath to bounce: Sensex erases 1,000 point shock, Nifty above 25,250 as bargain hunters step in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-bloodbath-to-bounce-sensex-erases-1000-point-shock-nifty-above-25250-as-bargain-hunters-step-in/articleshow/126951532.cms",
            "description": "Indian equities staged a sharp midday rebound after erasing nearly Rs 6 lakh crore in market value earlier in the session, with the Sensex and Nifty clawing back into positive territory. Bargain buying in heavyweight stocks drove the pullback, though analysts warned the recovery appeared more reflexive than a sustained turnaround.",
            "pubDate": "2026-01-21T08:19:17.790560"
        },
        {
            "title": "Eternal shares soar 6% ahead of Q3 results today. Here’s what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-soar-6-head-of-q3-results-today-heres-what-to-expect/articleshow/126951986.cms",
            "description": "Eternal's stock saw a significant jump today. The company is set to announce its third quarter results. Strong growth is anticipated, boosted by Blinkit's new model and quick commerce. Analysts expect revenue to surge. However, focus will be on Blinkit's losses and overall margin trends. Food delivery growth is steady. Blinkit's expansion continues, but profitability remains a concern.",
            "pubDate": "2026-01-21T08:19:17.790692"
        },
        {
            "title": "European shares extend selloff on trade jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-extend-selloff-on-trade-jitters/articleshow/126956781.cms",
            "description": "European shares dipped on Wednesday, deepening a selloff sparked by renewed trade tensions linked ‌to Greenland, ‌which overpowered the impact of upbeat corporate updates.",
            "pubDate": "2026-01-21T08:50:23.261479"
        },
        {
            "title": "Midcap Meltdown: 14 stocks crash up to 50% in just 3 months. Is your portfolio at risk?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcap-meltdown-14-stocks-crash-up-to-50-in-just-3-months-is-your-portfolio-at-risk/slideshow/126956693.cms",
            "description": "Over the last three months, the Indian equity market has shifted decisively. The Sensex slipped 2.5%, but the real damage lies below the surface. The BSE Midcap Index fell nearly 4%, yet that headline masks a much deeper churn: 103 of 144 midcap stocks delivered negative returns, meaning over two-thirds of the space has been under pressure.The intensity of the correction is stark. Fourteen midcap stocks have plunged 20% to 50% in just three months—sharp, sentiment-shaking declines that have wiped out sizable investor wealth in little time. Most now trade well below their 52-week highs, underscoring a clear shift in market mood. (Data Source: ACE Equity)",
            "pubDate": "2026-01-21T08:50:23.261583"
        },
        {
            "title": "Rekha Jhunjhunwala ups promoter stake by 1,253 bps to 15.57% in Star Health in December quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-ups-promoter-stake-by-1253-bps-to-15-57-in-star-health-in-december-quarter/articleshow/126964941.cms",
            "description": "Rekha Jhunjhunwala increased her promoter stake in Star Health to 15.57% in the December quarter amid persistent stock underperformance. The move comes as the insurer reported weaker profitability and continued to trade below key moving averages.",
            "pubDate": "2026-01-21T10:01:18.440954"
        },
        {
            "title": "A Word a Day to Budget 2026 - Fiscal deficit: What the government needs to borrow, and how it impacts the stock market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-word-a-day-to-budget-2026-fiscal-deficit-what-the-government-needs-to-borrow-and-how-it-impacts-the-stock-market/articleshow/126967367.cms",
            "description": "In this mini series in the 10-day run-up to Budget 2026, we will every day take up and explain one word/term that is used in the budget. It will help you as investors to better understand the document that is the primary instrument through which the government's fiscal policy is articulated and implemented. This is important, as the decisions announced in the budget impact every part of the economy, including the stock market. Our word/term for the day is: Fiscal deficit. Just this number moving by a few basis points here or there will make the Nifty or Sensex move up or down strongly.",
            "pubDate": "2026-01-21T10:39:17.646177"
        },
        {
            "title": "‘Pray that stocks don’t fall’: Nithin Kamath warns Rs 1.1 lakh crore margin trading boom has worrying risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pray-that-stocks-dont-fall-nithin-kamath-warns-rs-1-1-lakh-crore-margin-trading-boom-has-worrying-risks/articleshow/126967922.cms",
            "description": "Zerodha CEO Nithin Kamath has warned that the rapid rise in margin trading facilities to over Rs 1.1 lakh crore poses structural risks to Indian equities, cautioning that leveraged positions could worsen market stress during a sharp correction.",
            "pubDate": "2026-01-21T10:39:17.646300"
        },
        {
            "title": "Jio valuation may jump to $190 billion by 2028, says CLSA, raises RIL target price to Rs 1,800",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-valuation-may-jump-to-190-billion-by-2028-says-clsa-raises-ril-target-price-to-rs-1800/articleshow/126973813.cms",
            "description": "CLSA expects Jio Platforms’ valuation to surge toward $190 billion by 2028, driven by a potential IPO, accelerating free cash flow, 5G monetisation and subscriber growth, lifting Reliance Industries’ target price despite more cautious assumptions for retail and new energy.",
            "pubDate": "2026-01-21T10:59:38.264021"
        },
        {
            "title": "Aditya Birla Capital dips after hitting fresh record earlier in January 2026; buy the dip or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-capital-dips-after-hitting-fresh-record-earlier-in-january-2026-buy-the-dip-or-book-profits/articleshow/126786770.cms",
            "description": "Aditya Birla Capital slipped after hitting record highs earlier in January 2026. Analysts say the stock’s broader uptrend remains intact, with technical indicators suggesting buy-on-dips opportunities for short-term traders targeting Rs 388, despite near-term consolidation pressures.",
            "pubDate": "2026-01-21T11:45:43.305188"
        },
        {
            "title": "Insurance firms boost stakes in 12 largecap stocks in Q3FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurance-firms-boost-stakes-in-12-largecap-stocks-in-q3fy26/slideshow/126979929.cms",
            "description": "An increase in insurance shareholding indicates that insurance companies have raised their stakes in a company during the current quarter compared to the previous one. In the NSE largecap segment, we highlighted the top 12 stocks that saw a rise in insurance shareholding from the September ’25 quarter to the December ’25 quarter, based on data from the StocksEdge shareholding scan.This growth in holdings often signals increasing confidence among insurers in these stocks, reflecting positive market sentiment. Since insurance firms typically invest after thorough analysis, the trend may also suggest a strategic shift towards enhancing returns through equity investments.",
            "pubDate": "2026-01-21T11:45:43.305321"
        },
        {
            "title": "Vedanta’s Rs 2,500 crore ESOP windfall turns factory floors into shareholder ranks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedantas-rs-2500-crore-esop-windfall-turns-factory-floors-into-shareholder-ranks/articleshow/126984395.cms",
            "description": "Vedanta has created one of India’s widest employee-wealth programmes, generating Rs 2,500 crore in benefits over five years through ultra-low-priced ESOPs. Its latest Rs 500 crore grant brings 1,200 employees—many freshers—into the shareholder fold. With 40% workforce coverage.",
            "pubDate": "2026-01-21T12:37:14.532987"
        },
        {
            "title": "Union Budget FY27: These 6 calls could end the fiscal drag, Nuvama says",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-budget-fy27-these-6-calls-could-end-the-fiscal-drag-nuvama-says/articleshow/126983458.cms",
            "description": "India’s economy appears to be bottoming out, but Nuvama warns FY27 Budget support may be modest. While fiscal consolidation could pause and capex rise, limited stimulus and global headwinds may restrain earnings recovery and keep markets defensively positioned.",
            "pubDate": "2026-01-21T12:37:14.533101"
        },
        {
            "title": "Watch out! Gold, silver on MCX, ETFs trading at premium to international rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/watch-out-gold-silver-on-mcx-etfs-trading-at-premium-to-international-rates/articleshow/126989236.cms",
            "description": "Gold and silver in India are trading at unusually high premiums over global prices as traders price in fears of a customs duty hike in the Union Budget, triggering sharp MCX, ETF gains and arbitrage distortions despite a bullish long-term outlook.",
            "pubDate": "2026-01-21T14:01:46.981983"
        },
        {
            "title": "ITC, Siemens Energy India and 8 other stocks hit 52-week lows; slip up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-siemens-energy-india-and-8-other-stocks-hit-52-week-lows-slip-up-to-20-in-a-month/slideshow/126988732.cms",
            "description": "Benchmark Sensex dropped roughly 270 points, closing at 81,910 on Wednesday. Amid the broader market decline, 10 stocks from the BSE Large-Cap index hit fresh 52-week lows. A 52-week low marks the lowest price at which a stock has traded over the past year and is closely monitored by traders and investors as an important technical indicator of valuation and potential future price movements.",
            "pubDate": "2026-01-21T14:01:46.982105"
        },
        {
            "title": "Two Trades for Today: A large-cap infrastructure stock for a 4.25% rise, an auto ancillary mid-cap for a 6% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-large-cap-infrastructure-stock-for-a-4-25-rise-an-auto-ancillary-mid-cap-for-a-6-upmove/articleshow/127000268.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-21T14:40:40.141188"
        },
        {
            "title": "Sebi's rap on the knuckles: Investment adviser pulled up for routing client money through employee account",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-rap-on-the-knuckles-investment-adviser-pulled-up-for-routing-client-money-through-employee-account/articleshow/127000141.cms",
            "description": "SEBI reprimanded Ankur Jain of Winway Research for multiple regulatory breaches, including routing client funds through employee accounts, charging overlapping fees, failing to maintain call records, and not resolving SCORES complaints, rejecting his defense explanations.",
            "pubDate": "2026-01-21T14:40:40.141317"
        },
        {
            "title": "Gainers & Losers: Eternal, Amagi Media among 7 stocks under spotlight on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-eternal-amagi-media-among-7-stocks-under-spotlight-on-wednesday/slideshow/126993607.cms",
            "description": "Indian headline indices ended with declines for the third day in a row amid selling pressure in financials and consumer stocks. While Nifty ended the day at 25,157.50, down 75 points or 0.30%, the BSE Sensex closed at 81,909.63, falling by 270.84 points or 0.33%. Here are 7 stocks that saw action today:",
            "pubDate": "2026-01-21T14:40:40.141423"
        },
        {
            "title": "Market Trading Guide: Buy Dalmia Bharat and CreditAccess Grameen on Thursday for up to 12% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-dalmia-bharat-and-creditaccess-grameen-on-thursday-for-up-to-12-upside/articleshow/127006827.cms",
            "description": "Nifty extended its decline for a third session, slipping below the 200-DMA intraday amid selling in financials and consumer stocks. Analysts warn of near-term volatility, highlighting key support and resistance levels and recommending Dalmia Bharat and CreditAccess Grameen.",
            "pubDate": "2026-01-21T15:41:01.512615"
        },
        {
            "title": "RBL Bank bulk deal: BNP Paribas sells 60 lakh shares worth Rs 178 crore; BofA picks up stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-bulk-deal-bnp-paribas-sells-60-lakh-shares-worth-rs-178-crore-bofa-picks-up-stake/articleshow/127012394.cms",
            "description": "BNP Paribas sold 60 lakh RBL Bank shares via a bulk deal, reducing its stake, while BofA Securities bought in. The transaction came amid recent stock weakness, despite strong one-year returns, improved asset quality, and robust profit growth.",
            "pubDate": "2026-01-21T16:02:02.684236"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/127013243.cms",
            "description": "Indian markets stayed volatile as global risks, weak banking and IT earnings, and a falling rupee hurt sentiment. Late value buying trimmed losses, while analysts warned volatility may persist, with selective accumulation opportunities emerging amid resilient domestic demand ahead soon.",
            "pubDate": "2026-01-21T17:08:17.308538"
        }
    ]
}