{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-13T18:41:20.516259",
    "items": [
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124516932.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-10-13T04:18:07.807426"
        },
        {
            "title": "Sensex falls over 400 pts, Nifty slips below 25,200 as global trade tensions flare",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-400-pts-nifty-slips-below-25200-as-global-trade-tensions-flare/articleshow/124517045.cms",
            "description": "Indian benchmark indices Sensex and Nifty opened lower Monday, impacted by financial and oil & gas sector declines. Renewed global trade tensions, fueled by U.S. President Trump's actions against Beijing and China's rare earth export restrictions, rattled investor sentiment. Investors also closely monitored the market debut of Tata Capital, the year's largest IPO.",
            "pubDate": "2025-10-13T04:18:07.807551"
        },
        {
            "title": "PG Electroplast and 6 other stocks showing a bullish candlestick pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pg-electroplast-and-6-other-stocks-showing-a-bullish-candlestick-pattern/slideshow/124516391.cms",
            "description": "On October 10, six stocks from the Nifty500 pack appeared on the bullish “White Marubozu” scanner, according to technical data from stockedge.com.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for the period and the closing price is the highest. Represented by a long white (or green) candle with no upper shadow and a small or nonexistent lower shadow, it signals strong buying pressure throughout the session.Traders view this pattern as an indication that buyers dominated from open to close, often using it to gauge potential upward momentum in the near term.Stocks forming the White Marubozu pattern:",
            "pubDate": "2025-10-13T04:18:07.807660"
        },
        {
            "title": "Waaree Renewable Technologies shares soar 10% as profit more than doubles in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-technologies-shares-in-focus-as-profit-more-than-doubles-in-q2/articleshow/124516962.cms",
            "description": "Waaree Renewable Technologies shares: It reported a more than twofold jump in consolidated net profit to Rs 116.34 crore in Q2 FY25 from Rs 53.51 crore a year earlier, driven by record revenues and strong project execution. The company attributed the performance to sectoral tailwinds and its expansion into new energy segments such as battery storage systems and data centres.",
            "pubDate": "2025-10-13T04:18:07.807764"
        },
        {
            "title": "Buy, Sell or Hold: Kfin Tech gets double upgrade from Citi; Motilal Oswal recommends buy on D-Mart post Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-kfin-tech-gets-double-upgrade-from-citi-motilal-oswal-recommends-buy-on-d-mart-post-q2-results/articleshow/124516838.cms",
            "description": "Brokerages turned bullish on select stocks — Citi on KFin Technologies, JM Financial on Anant Raj Ltd, and Motilal Oswal on Avenue Supermarts (DMart) — highlighting strong operations, expansion momentum, and an improving earnings outlook as key positives.",
            "pubDate": "2025-10-13T04:18:07.807867"
        },
        {
            "title": "Avenue Supermarts shares fall 2% even as Q2 net profit rises 4% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/avenue-supermarts-shares-in-focus-as-q2-net-profit-rises-4-yoy/articleshow/124516767.cms",
            "description": "Avenue Supermarts shares saw a dip on Monday. The company reported a modest 4% rise in net profit for the September quarter. Revenue from operations showed a healthy 15% year-on-year increase. Despite adding new stores, profit margins experienced a slight decline. The company passed on GST benefits to customers. The stock has performed well year-to-date.",
            "pubDate": "2025-10-13T04:18:07.807976"
        },
        {
            "title": "BLS International Services shares crash 18% after MEA imposes 2-year ban on tenders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bls-international-services-shares-in-focus-as-mea-bans-firm-from-tenders-for-2-years/articleshow/124516755.cms",
            "description": "BLS International Services shares: BLS International Services shares plunged 18% after the Ministry of External Affairs barred it from future tenders for two years due to allegations. The company is reviewing the order and exploring legal options, stating current operations and financials remain unaffected. Indian Missions contributed 12% to Q1 FY26 revenue.",
            "pubDate": "2025-10-13T04:18:07.808075"
        },
        {
            "title": "NTPC Green Energy edge lower despite MoU with Japan’s ENEOS for green hydrogen supply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-green-energy-shares-in-focus-after-mou-with-japans-eneos-for-green-hydrogen-supply/articleshow/124516715.cms",
            "description": "Shares of NTPC Green Energy Ltd (NGEL) could see attention after signing an MoU with Japan’s ENEOS to explore green methanol and hydrogen derivative supplies. The agreement, part of NGEL’s Green Hydrogen Hub at Pudimadaka, aims to boost India’s clean energy exports and decarbonisation efforts. NGEL closed 1.5% higher on Friday, trading below most key moving averages amid a neutral RSI.",
            "pubDate": "2025-10-13T04:18:07.808174"
        },
        {
            "title": "Tata Elxsi, Yes Bank among 6 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-elxsi-yes-bank-among-6-fampo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124516254.cms",
            "description": "As of October 10, there was a notable rise in futures open interest (OI) for nine stocks in the NSE F&O segment, contributing to an overall increase of over 6% compared to the previous session.A sharp uptick in futures open interest indicates a significant expansion in the number of active, unexpired futures contracts for a particular security. This trend reflects growing market participation, with traders either opening new positions or adding to existing ones in the derivatives market.Stocks with the highest increase in open interest:",
            "pubDate": "2025-10-13T04:18:07.808286"
        },
        {
            "title": "Cipla among 6 largecap stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-among-6-largecap-stocks-showing-bullish-rsi-upswing/slideshow/124516117.cms",
            "description": "On October 10, several NSE largecap stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal is generated when the RSI (Relative Strength Index) crosses above 50 from below.“RSI trending up” indicates that the RSI values are rising, reflecting strengthening momentum in a stock’s price. This suggests potential upward movement and can help traders identify possible buying opportunities.",
            "pubDate": "2025-10-13T04:18:07.808391"
        },
        {
            "title": "Positive Breakout: These 8 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-cross-above-their-200-dmas/slideshow/124516027.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on October 10, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-10-13T04:18:07.808490"
        },
        {
            "title": "Stocks to buy in 2025 for long term: HDFC Life, SBI Life among 4 stocks that could give 12-24% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-hdfc-life-sbi-life-among-4-stocks-that-could-give-12-24-return/slideshow/124515928.cms",
            "description": "Brokerages remain optimistic on select financial and IT names, highlighting strong growth prospects and improving fundamentals for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-13T04:18:07.808585"
        },
        {
            "title": "Last day to buy Tata Investment shares ahead of stock split record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-tata-investment-shares-ahead-of-stock-split-record-date/articleshow/124515763.cms",
            "description": "The company has fixed Tuesday as the record date to determine shareholders eligible for the stock split in the ratio of 1:10. Under the split, each existing equity share of face value Rs 10 will be subdivided into 10 equity shares of face value Re 1 each, fully paid up.",
            "pubDate": "2025-10-13T04:18:07.808681"
        },
        {
            "title": "Asian shares off to shaky start, but Wall Street futures bounce",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-off-to-shaky-start-but-wall-street-futures-bounce/articleshow/124514946.cms",
            "description": "Asian markets opened with caution on Monday due to renewed trade tensions between the U.S. and China. However, Wall Street futures indicated a potential rebound. Investors are also awaiting corporate earnings reports and guidance from the U.S. Federal Reserve. Political developments in Japan and Europe are also influencing market sentiment. Gold prices saw an increase, reflecting demand for safe-haven assets.",
            "pubDate": "2025-10-13T04:18:07.808774"
        },
        {
            "title": "GIFT Nifty down 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124503077.cms",
            "description": "Indian stocks climbed on Friday, propelled by financial sector strength and renewed foreign investor interest.  Despite a slight drag from Tata Consultancy Services' results, the market sentiment remained positive, with analysts anticipating further gains.  The rupee also saw a modest recovery against the dollar, signaling increased investor confidence.",
            "pubDate": "2025-10-13T04:18:07.808868"
        },
        {
            "title": "Stocks in news: Tata Motors, Avenue Supermarts, Welspun Enterprises, Infosys",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tata-motors-avenue-supermarts-tata-capital-listing-and-more/articleshow/124503013.cms",
            "description": "Indian stock markets finished higher on Friday. Financial stocks and foreign investor inflows boosted the Sensex and Nifty. Tata Consultancy Services' weaker earnings limited broader gains. Several companies like Avenue Supermarts, Tata Motors, and Infosys will be in focus. Tata Motors' stock will trade as a consolidated entity for the last time on Monday.",
            "pubDate": "2025-10-13T04:18:07.808968"
        },
        {
            "title": "Anil Ambani’s Reliance stocks tumble up to 10%. Here’s what is behind the steep selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anil-ambanis-reliance-stocks-tumble-up-to-10-heres-what-is-behind-the-steep-selloff/articleshow/124518594.cms",
            "description": "Shares of Reliance Power and Reliance Infrastructure fell sharply after the ED arrested senior executive Ashok Kumar Pal over alleged fake bank guarantees and invoicing. The investigation, linked to Rs 3,000 crore Yes Bank loans, is part of a broader PMLA probe into the Anil Ambani Group’s financial irregularities.",
            "pubDate": "2025-10-13T05:52:23.310729"
        },
        {
            "title": "Tata Capital shares edge lower after flat debut. Should you buy, sell or hold the stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-capital-shares-edge-lower-after-flat-debut-should-you-buy-sell-or-hold-the-stock/articleshow/124518515.cms",
            "description": "Tata Capital shares slipped below the listing price after a flat debut on Monday. However, brokerages like Emkay Global and JM Financial maintained an ‘Add’ rating, citing strong Tata Group backing, AAA credit rating, and diversified loan book. Analysts expect steady AUM growth and long-term value despite near-term valuation limits.",
            "pubDate": "2025-10-13T05:52:23.310853"
        },
        {
            "title": "US inflation edges higher as Fed and Trump downplay risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-inflation-edges-higher-as-fed-and-trump-downplay-risks/slideshow/124518539.cms",
            "description": "US inflation has increased in three of the last four months, slightly higher than a year ago. Despite this, President Trump and some Federal Reserve officials have downplayed its significance, giving the impression that inflation is under control. (Source: AP)",
            "pubDate": "2025-10-13T05:52:23.310961"
        },
        {
            "title": "Furloughs, layoffs, and deadlock: Inside the federal shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/furloughs-layoffs-and-deadlock-inside-the-federal-shutdown/slideshow/124518455.cms",
            "description": "The government shutdown has entered its twelfth day, leaving hundreds of thousands of federal workers furloughed without pay. As the stalemate continues in Congress, deeper workforce cuts are expected, adding to the uncertainty faced by federal employees and their families. (Source: AP)",
            "pubDate": "2025-10-13T05:52:23.311078"
        },
        {
            "title": "Tata Capital gets 2 buy calls on Day 1. Check target prices and post-listing strategy for 2025's biggest IPO investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-capital-gets-2-buy-calls-on-day-1-check-target-prices-valuation-and-strategy-for-ipo-investors/articleshow/124517913.cms",
            "description": "Tata Capital received buy ratings from Emkay and JM Financial on its first trading day, despite a muted listing at Rs 330, just 1% above the IPO price. Both brokerages set a target of Rs 360, signaling 10% upside. Analysts cited Tata Group parentage, strong brand, and improving financials as key drivers for potential long-term returns.",
            "pubDate": "2025-10-13T05:52:23.311187"
        },
        {
            "title": "Tata Capital shares make weak debut, list at just 1% premium after 2025’s biggest IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-capital-shares-make-a-weak-d-st-debut-list-at-just-1-2-premium-after-2025s-biggest-ipo/articleshow/124517498.cms",
            "description": "Tata Capital share price: Tata Capital shares debuted on stock exchanges with a modest gain. The IPO saw strong demand from institutional investors. Proceeds will bolster the company's capital base for future lending. Tata Capital has shown steady revenue and profit growth in recent fiscal years. This listing marks a significant step for the Tata Group's financial services arm.",
            "pubDate": "2025-10-13T05:52:23.311289"
        },
        {
            "title": "MapmyIndia shares jump 8% after Railway Minister's tweet favouring Google Maps rival",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mapmyindia-shares-jump-8-after-railway-ministers-tweet-favouring-google-maps-rival/articleshow/124517370.cms",
            "description": "Railway Minister Ashwini Vaishnaw tested the Indian navigation app Mappls by MapmyIndia, praised its features, and encouraged public use. He also announced that Indian Railways will soon sign an MoU with the Google Maps rival, highlighting the app’s advanced capabilities in a social media post.",
            "pubDate": "2025-10-13T05:52:23.311387"
        },
        {
            "title": "Nifty gives zero returns in a year: 3 tests reveal whether to be greedy or fearful this Diwali",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-gives-zero-returns-in-a-year-3-tests-reveal-whether-to-be-greedy-or-fearful-this-diwali/articleshow/124517265.cms",
            "description": "With Nifty trading near year-ago levels, Samvat 2081 has seen a time correction rather than a price correction, amid slowing earnings, valuation concerns, Trump tariff overhangs, and FII outflows. Analysts say valuations are in neutral territory, limiting re-rating potential but providing a stable base. Earnings revival from H2FY26 and a possible US–India trade deal could support a medium-term recovery despite short-term caution.",
            "pubDate": "2025-10-13T05:52:23.311480"
        },
        {
            "title": "European shares steady after Friday's selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-steady-after-fridays-selloff/articleshow/124521905.cms",
            "description": "European shares steadied on Monday, aided by a bounce in technology and mining stocks, after worries about growing U.S.-China trade tensions hammered markets on Friday.",
            "pubDate": "2025-10-13T08:44:41.061974"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 28% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-28-in-1-year/articleshow/124520842.cms",
            "description": "Thanks to US President Trump’s move on China, volatility is back in the global markets. The only positive: The Indian market has shown some relative outperformance. But, as we often said, it is best to ignore what is happening to the Nifty and Sensex and focus on the sector and industry of the stocks you plan to buy. Given the GST rate rationalisation and other global developments, many sectors are seeing some fundamental changes. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-10-13T08:44:41.062101"
        },
        {
            "title": "Fed’s Musalem signals room for one more rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-musalem-signals-room-for-one-more-rate-cut/slideshow/124518735.cms",
            "description": "St. Louis Fed President Alberto Musalem said there could be room for one more interest rate cut to support the labour market. However, he urged caution, noting that inflation is still significantly above the Fed’s 2% target. (Source: Reuters)",
            "pubDate": "2025-10-13T08:44:41.062213"
        },
        {
            "title": "Vodafone Idea shares slide 2% after Supreme Court defers AGR plea hearing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-slide-2-after-supreme-court-defers-agr-plea-hearing/articleshow/124520903.cms",
            "description": "Vodafone Idea shares saw a dip on Monday after the Supreme Court deferred its AGR plea hearing to October 27. The delay prolongs uncertainty over the telecom giant’s Rs 5,606 crore liability, even as the government hints at a possible one-time settlement to ease financial strain.",
            "pubDate": "2025-10-13T08:44:41.062317"
        },
        {
            "title": "AU Small Finance Bank shares can rally 19%, says Jefferies after initiating coverage with Buy rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-bank-shares-can-rally-19-says-jefferies-after-initiating-coverage-with-buy-rating/articleshow/124520757.cms",
            "description": "Jefferies has initiated coverage on AU Small Finance Bank with a Buy rating and a target price of Rs 910, implying a 19% upside. The brokerage highlighted AU’s transition to a universal bank by mid-2026, which is expected to lower funding costs, boost fee income, ease regulatory requirements, strengthen the brand, and improve talent retention.",
            "pubDate": "2025-10-13T08:44:41.062418"
        },
        {
            "title": "YES Bank shares rally 10% in 3 days. What’s behind the surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-rally-10-in-3-days-whats-behind-the-surge/articleshow/124519992.cms",
            "description": "YES Bank shares have surged 10% over the past three sessions, touching a fresh 52-week high, as investors pile in ahead of quarterly earnings and amid renewed optimism following Japanese lender Sumitomo Mitsui Banking Corporation’s (SMBC) stake purchase.",
            "pubDate": "2025-10-13T08:44:41.062522"
        },
        {
            "title": "Tata Motors demerger: Stock slides 7% in 7 days. Will the restructuring spark gains or more volatility?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-demerger-stock-slides-7-in-7-days-will-the-restructuring-spark-gains-or-more-volatility/articleshow/124519522.cms",
            "description": "Tata Motors shares fell 7% in the last seven trading sessions as the auto major prepares to split its commercial and passenger vehicle businesses this week. The restructuring, effective October 1, aims to unlock investor value but has caused short-term volatility. Analysts remain cautiously optimistic, anticipating a potential rally post-restructuring and JLR's production restart.",
            "pubDate": "2025-10-13T08:44:41.062619"
        },
        {
            "title": "Tata Capital listed on NSE with minor gains; Tata Sons vows sustainable growth, value creation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-capital-listed-on-nse-with-minor-gains-tata-sons-vows-sustainable-growth-value-creation/videoshow/124519525.cms",
            "description": "Tata Capital a company from the Tata Group made its debut on the National Stock Exchange (NSE) on Monday, marking a significant milestone in the company's journey. On the NSE, the shares listed at Rs 330 per share, a premium of 1.23 per cent to its IPO price of Rs 326. The Rs 15,512-crore issue had an IPO price band of Rs 310-326 per share. This is one of the highest IPOs in terms of issue size this year. Speaking at the listing event in Mumbai, Saurabh Agrawal, Group Chief Financial Officer and Executive Director of Tata Sons, said the listing represents the beginning of a new phase for the company as it steps into the public market.",
            "pubDate": "2025-10-13T08:44:41.062715"
        },
        {
            "title": "UK’s Investec initiates coverage on Adani Ports, sees up to 23% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uks-investec-initiates-coverage-on-adani-ports-sees-up-to-23-upside/articleshow/124519216.cms",
            "description": "UK-based Investec initiated coverage on Adani Ports with a buy rating and a target price of Rs 1,715, implying 23.5% upside from the previous close. The brokerage highlighted strong organic growth potential, efficient operations, a robust balance sheet, and deleveraging, projecting 15% revenue CAGR over FY25–30. Adani Ports’ integrated logistics and marine services further enhance long-term growth prospects.",
            "pubDate": "2025-10-13T08:44:41.062834"
        },
        {
            "title": "China holds the upper hand in trade standoff with US: Shaun Rein",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-holds-the-upper-hand-in-trade-standoff-with-us-shaun-rein/articleshow/124519150.cms",
            "description": "A trade war looms between the US and China. Expert Shaun Rein believes China can endure economic hostilities better than the US. He criticizes US policy as inconsistent and driven by personal motives. China has reduced its reliance on the US, diversifying trade and investments. Beijing holds leverage, potentially impacting the US dollar's global role.",
            "pubDate": "2025-10-13T08:44:41.062932"
        },
        {
            "title": "Ashish Kacholia's latest buy is an SME stock with 1,350% returns in 3 years. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholias-latest-buy-is-an-sme-stock-with-1350-returns-in-3-years-check-details/articleshow/124519114.cms",
            "description": "Ashish Kacholia has acquired a 2.71% stake in V-Marc India, a smallcap multibagger delivering 1,350% returns over three years. The stock, trading above key moving averages, remains in an overbought zone, reflecting strong momentum amid the ace investor’s growing portfolio.",
            "pubDate": "2025-10-13T08:44:41.063029"
        },
        {
            "title": "WeWork Management bulk deal: CLSA sells 8.4 lakh shares in recently listed stock for Rs 52 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wework-management-bulk-deal-clsa-sells-8-4-lakh-shares-in-recently-listed-stock-for-rs-52-crore/articleshow/124529820.cms",
            "description": "Global markets company CLSA sold over 8 lakh shares in WeWork India Management on Monday. The deal size reached Rs 52 crore. WeWork India shares continued their decline for a second day. The stock is trading below its IPO price. The company's recent IPO saw lukewarm response from retail investors. Qualified Institutional Buyers drove the subscription.",
            "pubDate": "2025-10-13T15:20:54.677718"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124529728.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-10-13T15:20:54.677838"
        },
        {
            "title": "​Indian Bank, SBI, and 8 other stocks hit 52-week high; gain up to 13% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-bank-sbi-and-8-other-stocks-hit-52-week-high-on-october-13-gain-up-to-13-in-a-month/slideshow/124528397.cms",
            "description": "The benchmark Sensex fell about 174 points to close at 82,327 on Monday, October 13. Despite the dip, 10 BSE 500 stocks hit their 52-week highs, signaling strong bullish momentum and hinting at potential further upside for traders and investors.",
            "pubDate": "2025-10-13T15:20:54.677947"
        },
        {
            "title": "Dow Jones soars 500 points, Nasdaq, S&P 500 up 1% after Trump cools rhetoric on China",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-jones-soars-500-points-nasdaq-sp-500-up-1-after-trump-cools-rhetoric-on-china/articleshow/124528974.cms",
            "description": "U.S. stocks rallied Monday after President Trump eased concerns about China tariffs, stating \"it will all be fine.\" This sharp turnaround from Friday's threats offered hope for global trade, potentially allowing a rolling recovery to continue. The market's volatility echoes past swings, with strategists suggesting conditions could support a recovery into 2026.",
            "pubDate": "2025-10-13T15:20:54.678048"
        },
        {
            "title": "Stock Radar: Falling trendline breakout! This telecom infrastructure stock is showing signs of reversal – what should traders do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-falling-trendline-breakout-this-telecom-infrastructure-stock-is-showing-signs-of-reversal-what-should-traders-do/articleshow/124522834.cms",
            "description": "Indus Towers stock is showing a bullish reversal. The stock broke a falling trendline, indicating bulls are taking control. Experts suggest buying the stock for a target of Rs 395 in the coming weeks. The stock bottomed out after hitting a 52-week low and has rallied more than 13% from those lows. This marks the start of a fresh reversal.",
            "pubDate": "2025-10-13T15:20:54.678154"
        },
        {
            "title": "HDFC AMC to consider first-ever bonus issue tomorrow. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-amc-to-consider-first-ever-bonus-issue-tomorrow-check-details/articleshow/124525500.cms",
            "description": "HDFC AMC shares rose 2.5% to Rs 5,658 after the company announced its board will meet on October 15 to consider issuing bonus shares for the first time since its 2018 listing. The meeting will also review Q2 results.",
            "pubDate": "2025-10-13T15:20:54.678251"
        },
        {
            "title": "Gainers & Losers: Tata Investment among 8 stocks that hogged limelight on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-tata-investment-among-8-stocks-that-hogged-limelight-on-monday/slideshow/124525025.cms",
            "description": "",
            "pubDate": "2025-10-13T15:20:54.678345"
        },
        {
            "title": "9 Nifty500 stocks with soaring EV/EBITDA ratios; a sign of growth or overvaluation?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-nifty500-stocks-with-soaring-ev/ebitda-ratios-a-sign-of-growth-or-overvaluation/slideshow/124525064.cms",
            "description": "The EV/EBITDA ratio is used to compare the total enterprise value of a business to the EBITDA it generates annually. We have highlighted the top nine companies from the Nifty500 that have shown a consistent increase in their EV/EBITDA ratio, based on valuation scans by StockEdge.com.A consistently rising EV/EBITDA ratio means the company's valuation is growing faster than its earnings. This may indicate investor confidence in future growth, but it could also suggest the stock is becoming more expensive relative to its earnings—posing a potential risk if earnings growth doesn’t keep pace.",
            "pubDate": "2025-10-13T15:20:54.678459"
        },
        {
            "title": "Market Wrap: Sensex slips 173 pts, Nifty below 25,250 as US-China tariff tensions weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slips-173-pts-nifty-below-25250-as-us-china-tariff-tensions-weigh/articleshow/124523832.cms",
            "description": "Indian equity benchmarks Sensex and Nifty closed lower on Monday, with IT stocks experiencing significant declines. This downturn was triggered by renewed U.S.-China trade tensions, as President Trump escalated tariff threats following Beijing's tightening of rare earth export curbs, impacting investor sentiment.",
            "pubDate": "2025-10-13T15:20:54.678559"
        },
        {
            "title": "Festive Delights: 9 smallcaps rally over 10% in pre-Diwali week, turn multibaggers in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/festive-delights-9-smallcaps-rally-over-10-in-pre-diwali-week-turn-multibaggers-in-a-year/slideshow/124524152.cms",
            "description": "As Diwali 2025 approaches and markets optimism builds, a look back at last year’s trends offers fascinating insights. We observed an interesting market pattern: in the pre-Diwali week last year, 296 smallcap stocks registered double-digit gains, signalling strong momentum across the broader market ahead of the festival.However, out of these 296 stocks, a 207 delivered negative returns over the past year. This suggests that while Diwali euphoria temporarily lifted many names, the rally fizzled out in most cases once the fireworks ended. In contrast, 39 smallcap stocks not only delivered 10%+ returns before Diwali 2024 but continued their rally afterwards — offering sustained gains ranging from 25% to a staggering 200% over the last 12 months. Among these consistent outperformers, nine stocks emerged as true multibaggers, each delivering 100% or more returns since Diwali 2024 — effectively doubling in value. It’s important to note, however, that past performance does not guarantee future results. (Data Source: ACE Equity)",
            "pubDate": "2025-10-13T15:20:54.678657"
        },
        {
            "title": "Zenith Infotech, promoters settle Sebi case for Rs 3.56 crore, closing 12-year legal battle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zenith-infotech-promoters-settle-sebi-case-for-rs-3-56-crore-closing-12-year-legal-battle/articleshow/124523569.cms",
            "description": "Zenith Infotech and promoters Rajkumar and Akash Saraf settled a 12-year Sebi case by paying Rs 3.56 crore, ending allegations of asset stripping and disclosure lapses. The court approved the settlement, lifting all restrictions and providing the company and its directors a clean legal closure.",
            "pubDate": "2025-10-13T15:20:54.678752"
        },
        {
            "title": "With the tariff threat headache over, time to focus on them again? 8 pharma stocks with upside potential of up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/with-the-tariff-threat-headache-over-time-to-focus-on-them-again-8-pharma-stocks-with-upside-potential-of-up-to-39/articleshow/124522940.cms",
            "description": "With a clear indication that no additional or special tariff will be imposed by the US on generic drugs, there is a sense of relief among Indian drug companies. The US healthcare system, too, must be relieved, given that India is the biggest supplier of generic drugs to the American market. Any increase in the cost of these medicines would have led to a disruption in the US healthcare system. Now that the tariff threat – which has been troubling Indian companies for the past year – is seemingly a thing of the past, will things get better on the street for Indian pharma companies?",
            "pubDate": "2025-10-13T15:20:54.678846"
        },
        {
            "title": "Diwali Picks 2025: Anand Rathi selects 6 stocks with upside potential of up to 29%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-picks-2025-anand-rathi-selects-6-stocks-with-upside-potential-of-up-to-29-do-you-own-any/slideshow/124522647.cms",
            "description": "Domestic brokerage Anand Rathi Investment Services presents its top Diwali 2025 stock picks, selected based on strong fundamentals, sectoral tailwinds, and growth potential over the next 12 months. These six companies span diverse industries, including retail, beverages, stock exchanges, automotive components, solar pumps, and digital logistics platforms. The picks aim to capitalize on revenue expansions, margin improvements, capacity additions, and structural industry opportunities, with rigorous financial and market analysis backing each recommendation. Here’s the full list.",
            "pubDate": "2025-10-13T15:20:54.678941"
        },
        {
            "title": "As Nifty & Sensex recover, these large-caps have ‘strong buy’, ‘buy’ recos, with an upside potential of more than 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-nifty-sensex-recover-these-large-caps-have-strong-buy-buy-recos-with-an-upside-potential-of-more-than-28/articleshow/124534387.cms",
            "description": "There’s this old saying in the stock market: Even when the bulls are in control, you can never write off the bears. They have and will make an appearance at regular intervals, sometimes in the form of volatile corrections (whatever be the reason, domestic or global). At this point, the bias is toward the bulls. And this bias may become more pronounced over a period of time. One caveat, though: There should not be trouble in the global market because of the China-US tariff tussle. As an investor, it is important to track the fundamental development in sectors and stay with fundamentally good stocks.",
            "pubDate": "2025-10-13T18:41:17.184227"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/124531883.cms",
            "description": "Indian markets closed lower on Monday, led by IT stocks, as renewed US-China trade tensions and a US government shutdown dampened investor sentiment. Analysts noted profit booking in consumption sectors and mixed Q2 earnings, though mid- and small-cap stocks showed resilience. The Nifty defended its support at 25,200, with a bullish outlook above 25,050.",
            "pubDate": "2025-10-13T18:41:17.184356"
        },
        {
            "title": "Two Trades for Today: A PSU banking stock for a 6.4% rise, a  mid-cap industrial products maker for almost 6% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-psu-banking-stock-for-a-6-4-rise-a-mid-cap-industrial-products-maker-for-almost-6-upmove/articleshow/124531353.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-13T18:41:17.184567"
        },
        {
            "title": "Market Trading Guide: Buy Eternal, CDSL and 3 other stocks on Tuesday for up to 10% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-eternal-cdsl-and-3-other-stocks-on-tuesday-for-up-to-10-gains/articleshow/124530478.cms",
            "description": "Indian benchmark indices Nifty saw a sell-off in FMCG and IT stocks, ending a two-session gain amid weak global cues. Analysts suggest Nifty remains bullish above 25,050, with potential upside towards 25,400. Fresh call writing at 25,300 indicates a resistance level, while 25,200 acts as strong support.",
            "pubDate": "2025-10-13T18:41:17.184672"
        },
        {
            "title": "Sebi asks companies to give reasons, valuations for related party transactions in revised disclosures guidelines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-asks-companies-to-give-reasons-valuations-for-related-party-transactions-in-revised-disclosures-guidelines/articleshow/124530637.cms",
            "description": "Sebi has issued new guidelines for listed companies seeking approval for related party transactions (RPTs). Companies must now provide detailed justifications, valuation reports, and turnover percentages to audit committees and shareholders. However, smaller RPTs below 1% of turnover or Rs 10 crore are exempted from these stringent disclosure norms.",
            "pubDate": "2025-10-13T18:41:17.184779"
        }
    ]
}