{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-30T03:20:09.071596",
    "items": [
        {
            "title": "Positive Breakout: These 13 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-13-stocks-close-cross-above-their-200-dmas/slideshow/124223828.cms",
            "description": "The closing prices of 13 stocks from the Nifty500 pack crossed above their 200 DMA (Daily Moving Averages) on September 29, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-30T02:36:00.471126"
        },
        {
            "title": "Wall Street indexes climb as investors brush off government shutdown uncertainties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-climb-as-investors-brush-off-government-shutdown-uncertainties/articleshow/124223656.cms",
            "description": "Wall Street indexes closed higher on Monday. Nasdaq led gains driven by technology stocks. Investors focused on artificial intelligence and future interest rate cuts. Concerns over a potential US government shutdown were largely overlooked. Market experts noted investor focus on economic resilience. This positive sentiment propelled major indices upwards.",
            "pubDate": "2025-09-30T02:36:00.471263"
        },
        {
            "title": "Technical breakout fuels bullish outlook on Canara Bank, say Rajesh Palviya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-breakout-fuels-bullish-outlook-on-canara-bank-say-rajesh-palviya/videoshow/124216081.cms",
            "description": "“The chart for Canara Bank shows a bullish trend in recent months, with the price moving up from its lows. Traders can buy for a target of Rs 140-145 in the short-term,” Rajesh Palviya, Senior Vice President – Research (Head Technical & Derivatives), Axis Securities, said.",
            "pubDate": "2025-09-30T02:36:00.471386"
        },
        {
            "title": "Asian shares flat; gold hits record, dollar drops on shutdown fears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-flat-gold-hits-record-dollar-drops-on-shutdown-fears/articleshow/124223323.cms",
            "description": "Global markets reacted to US government shutdown fears. Gold reached a new record high. The dollar saw losses. US equity futures dipped while Asian shares remained flat. Treasuries gained. Investors worried about delayed economic data, including the jobs report. China announced capital to boost growth. Australia's central bank held rates steady. Oil prices declined.",
            "pubDate": "2025-09-30T02:36:00.471524"
        },
        {
            "title": "Stocks in news: L&T, M&M, Tata Motors, Reliance Power, BEL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-lt-mm-tata-motors-reliance-power-bel/articleshow/124217150.cms",
            "description": "Markets saw volatility but ended flat after a recent slide. L&T secured a $700 million facility. M&M sold its Sampo Rosenlew stake. Premier Energies won $19.95 million solar contracts. Reliance Power sold Indonesian coal entities. BEL secured Rs 1092 crore orders. IRFC inked two loan agreements. Tata Motors faced a rating downgrade. Godrej Agrovet received a Sebi warning.",
            "pubDate": "2025-09-30T02:36:00.471645"
        },
        {
            "title": "GIFT Nifty up 5 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124217445.cms",
            "description": "Indian equities closed flat on Monday amidst mixed global cues and ahead of RBI's MPC decision, with analysts expecting near-term consolidation. Foreign portfolio investors net sold shares worth Rs 2,831 crore. The rupee hit an all-time closing low of 88.79 against the US dollar due to persistent foreign capital outflows and risk-off sentiments.",
            "pubDate": "2025-09-30T02:36:00.471756"
        },
        {
            "title": "SBI sees major growth in credit card business as HDFC Bank holds the top spot",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-sees-major-growth-in-credit-card-business-as-hdfc-bank-holds-the-top-spot/articleshow/124223165.cms",
            "description": "SBI's credit card business experienced a significant post-Covid surge, driven by its youth-focused expansion. HDFC Bank maintained its dominant position in both card issuance and transaction value. Conversely, Standard Chartered Bank faced a sharp decline in both the volume and value of its credit card operations.",
            "pubDate": "2025-09-30T02:36:00.471870"
        },
        {
            "title": "Can MAS Financial regain momentum after a 10% slide?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-mas-financial-regain-momentum-after-a-10-slide/articleshow/124223131.cms",
            "description": "MAS Financial Services stock declined ten percent over two months. Its June quarter net profit rose slower despite higher interest income. Asset quality showed a slight dip. The company projects twenty to twenty-five percent AUM growth this fiscal year. It also expects improved disbursements in the second half.",
            "pubDate": "2025-09-30T02:36:00.471983"
        },
        {
            "title": "Sebi bars Man Industries, executives from market for two years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bars-man-industries-executives-from-market-for-two-years/articleshow/124223125.cms",
            "description": "Sebi has barred Man Industries and three senior executives, including its chairman, from the securities market for two years. This action follows alleged diversion of funds to subsidiaries and misrepresentation of financials. A forensic audit revealed non-disclosure of related party transactions and material events, alongside fund rotation.",
            "pubDate": "2025-09-30T02:36:00.472095"
        },
        {
            "title": "Stock Radar: Canara Bank stock gives a breakout from falling channel to hit fresh 52-week high in September; will the rally continue in October?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-canara-bank-stock-gives-a-breakout-from-falling-channel-to-hit-fresh-52-week-high-in-september-will-the-rally-continue-in-october/articleshow/124210304.cms",
            "description": "Canara Bank has broken out from a falling channel on weekly charts, hitting a fresh 52-week high, with experts suggesting the rally will continue. Short-term traders can buy the stock for a target of Rs 140-145 in the coming weeks, supported by strong technical indicators and rising volumes.",
            "pubDate": "2025-09-30T02:36:00.472208"
        },
        {
            "title": "RBI unveils norms to enable faster transmission of rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-unveils-norms-to-enable-faster-transmission-of-rates/articleshow/124223101.cms",
            "description": "Under the revised directions on interest rate on advances, banks will now be allowed to reduce spread components on floating rate loans before the current three-year lock-in period, a move aimed at benefiting borrowers. This could result in faster transmission of rate cuts, leading to lower EMIs or interest outgo. Additionally, banks may offer borrowers the option to switch to fixed-rate loans at the time of interest rate resets, though this will no longer be mandatory.",
            "pubDate": "2025-09-30T02:36:00.472323"
        },
        {
            "title": "Stocks to buy in 2025 for long term: TVS Motor, Mahanagar Gas among 5 stocks that could give 20-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-tvs-motor-mahanagar-gas-among-5-stocks-that-could-give-20-30-return/slideshow/124224542.cms",
            "description": "Brokerages remain optimistic on select stocks across autos, energy, metals, and renewables, citing strong growth potential and healthy upside.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-30T03:19:59.517647"
        },
        {
            "title": "Ecoline Exim IPO debuts today. GMP signals flat listing ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecoline-exim-ipo-debuts-today-gmp-signals-flat-listing-ahead/articleshow/124224418.cms",
            "description": "Sustainable packaging manufacturer Ecoline Exim, with exports to over 27 countries, is set to list on the NSE SME platform on September 30. Its IPO drew healthy institutional participation, but subdued retail interest and zero GMP point to cautious listing-day sentiment.",
            "pubDate": "2025-09-30T03:19:59.517781"
        },
        {
            "title": "Matrix Geo Solutions IPO listing today: GMP suggests cautious debut despite strong subscription",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/matrix-geo-solutions-ipo-listing-today-gmp-suggests-cautious-debut-despite-strong-subscription/articleshow/124224388.cms",
            "description": "Matrix Geo Solutions IPO closed with healthy investor interest. The company will list on NSE SME on September 30. The issue was subscribed 7.69 times overall. Qualified institutional buyers led demand. The firm specializes in geospatial and drone technology. It shows strong financial growth. Proceeds will fund equipment and working capital. Grey market premium indicates a restrained listing outlook.",
            "pubDate": "2025-09-30T03:19:59.517900"
        },
        {
            "title": "True Colors IPO listing today. GMP hints at muted listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/true-colors-ipo-listing-today-gmp-hints-at-muted-listing/articleshow/124224354.cms",
            "description": "True Colors, a digital textile printing solutions provider, will debut on the BSE SME platform on September 30. Its IPO saw strong investor demand, subscribed over 45 times. Despite this, grey market signals indicate limited listing gains. The company reported significant revenue and profit growth recently. It focuses on digital textile printing solutions.",
            "pubDate": "2025-09-30T03:19:59.518006"
        },
        {
            "title": "Tata Motors shares in focus as Moody’s downgrades outlook after JLR cyber incident",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-as-moodys-downgrades-outlook-after-jlr-cyber-incident/articleshow/124224310.cms",
            "description": "Tata Motors share price: Moody’s downgraded Tata Motors’ outlook to negative after a cyberattack at JLR halted production. The company's FY26 EBITDA is expected to take a massive hit due to this attack. While JLR has started a phased restart, prolonged disruptions could further affect earnings and cash flows, Moody’s added.",
            "pubDate": "2025-09-30T03:19:59.518111"
        },
        {
            "title": "Power Finance Corporation among 7 stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-finance-corporation-among-7-stocks-showing-bullish-rsi-upswing/slideshow/124224278.cms",
            "description": "Seven stocks from the NSE large cap pack were highlighted in the RSI Trending Up scan on September 29, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-30T03:19:59.518237"
        },
        {
            "title": "Aptus Pharma shares to debut today. Here's what GMP indicates ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aptus-pharma-shares-to-debut-today-heres-what-gmp-indicates-ahead-of-listing/articleshow/124224165.cms",
            "description": "Aptus Pharma will debut on the BSE SME platform on September 30. Its initial public offering closed with high investor participation. The IPO was subscribed over 22 times across categories. Retail and high net worth individuals showed significant demand. The company distributes pharmaceutical formulations. It reported revenue and profit growth. Proceeds will fund working capital and new office infrastructure.",
            "pubDate": "2025-09-30T03:19:59.518339"
        },
        {
            "title": "Subros among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/subros-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/124224135.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, six stocks witnessed a 5-year swing high at the close on September 29, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-30T03:19:59.518438"
        },
        {
            "title": "BharatRohan Airborne Innovations IPO GMP suggests a cautious listing outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharatrohan-airborne-innovations-ipo-gmp-suggests-a-cautious-listing-outlook/articleshow/124223965.cms",
            "description": "Agritech startup BharatRohan Airborne Innovations, leveraging drones and hyperspectral imaging, saw robust demand for its ₹45.04 crore IPO with 10.07x subscription, but muted grey market signals point to a moderate listing.",
            "pubDate": "2025-09-30T03:19:59.518537"
        }
    ]
}