{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-17T23:51:15.064543",
    "items": [
        {
            "title": "Asian stocks have cautious start, Bitcoin in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-have-cautious-start-bitcoin-in-focus/articleshow/125373908.cms",
            "description": "Asian markets opened with caution. Investors await crucial US economic data. Uncertainty surrounds the US Federal Reserve's next move. Japan and Australia saw slight dips. South Korea's equities climbed. Bitcoin's gains have largely vanished. Oil prices are down, while gold is up. This week promises significant market movements.",
            "pubDate": "2025-11-17T01:13:14.277302"
        },
        {
            "title": "Stocks in news: Kotak Mahindra Bank, Websol, Glenmark Pharma, Minda Corp, Anant Raj",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-kotak-mahindra-bank-websol-glenmark-pharma-minda-corp-anant-raj/articleshow/125367018.cms",
            "description": "Indian markets experienced volatility, ending with modest gains as equities grapple with conflicting signals and cautious sentiment due to US market corrections. Kotak Mahindra Bank's board will consider a stock split, while Godrej Properties plans significant housing unit launches. NTPC aims for a substantial share in India's nuclear capacity, and Websol Energy System is exploring a large solar manufacturing facility.",
            "pubDate": "2025-11-17T01:13:14.277424"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125367104.cms",
            "description": "Indian equities closed higher on Friday. Nifty gained 31 points, reaching 25,910. Easing retail inflation and a strong corporate earnings season provided a supportive backdrop. Analysts anticipate markets to remain firm. A potential India-US trade deal could drive further gains. Foreign portfolio investors were net sellers, while domestic institutional investors were net buyers.",
            "pubDate": "2025-11-17T01:13:14.277840"
        },
        {
            "title": "Will Nifty break past the 26,000–26,100 hurdle this week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-nifty-break-past-the-2600026100-hurdle-this-week/articleshow/125373721.cms",
            "description": "Nifty is poised for further gains, with analysts eyeing a decisive move above 26,000-26,100 for the next rally leg. Key support is seen at 25,500-25,750. Banking and IT strength are supporting the index, with expectations of retesting previous highs.",
            "pubDate": "2025-11-17T01:13:14.277940"
        },
        {
            "title": "What do Bihar Poll results spell for market, economy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-do-bihar-poll-results-spell-for-market-economy/articleshow/125373673.cms",
            "description": "Bihar election results highlight the impact of cash transfers on voter turnout and electoral success. While markets anticipate a positive reaction to the NDA's victory, concerns are rising over the fiscal deficit implications of such populist spending. Brokerages note that increased subsidy spending could push states' fiscal deficits beyond the 3% GDP ceiling.",
            "pubDate": "2025-11-17T01:13:14.278038"
        },
        {
            "title": "Private credit finds deeper funding pools at home",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/private-credit-finds-deeper-funding-pools-at-home/articleshow/125373768.cms",
            "description": "India's private credit sector is becoming the new darling for wealthy investors and family offices. With stock markets frequently in turmoil, these high-net-worth individuals are turning their gaze toward high-yield opportunities that private credit provides.",
            "pubDate": "2025-11-17T01:13:14.278225"
        },
        {
            "title": "RBI's  moratorium on loan repayments could help exporters take a breath amid uncertainties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbis-moratorium-on-loan-repayments-could-help-exporters-take-a-breath-amid-uncertainties/articleshow/125373764.cms",
            "description": "The Reserve Bank of India is stepping up to assist exporters with a key moratorium on loan repayments. This timely intervention is designed to give businesses the flexibility they need to adapt to the shifting tides of global commerce and pursue fresh avenues for growth.",
            "pubDate": "2025-11-17T01:13:14.278320"
        },
        {
            "title": "Anant Raj shares in focus on Rs 4,500-crore investment plan in Andhra Pradesh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anant-raj-shares-in-focus-on-rs-4500-crore-investment-plan-in-andhra-pradesh/articleshow/125375373.cms",
            "description": "Anant Raj will be in focus after announcing a Rs 4,500 crore investment to set up a data centre and IT park in Andhra Pradesh through its subsidiary ARCPL. The project is expected to create 16,000 jobs and add to its ongoing 307 MW data centre capacity expansion. Strong Q2FY26 results, rising revenues, and new real estate project clearances further highlight the company’s growth momentum.",
            "pubDate": "2025-11-17T03:41:19.705831"
        },
        {
            "title": "Alembic Pharmaceuticals shares in focus after USFDA nod for key hypertension drug",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alembic-pharmaceuticals-shares-in-focus-after-usfda-nod-for-key-hypertension-drug/articleshow/125375170.cms",
            "description": "Alembic Pharmaceuticals will be in focus after securing final USFDA approval for Diltiazem Hydrochloride Tablets, a widely used treatment for high blood pressure and angina. The drug is deemed therapeutically equivalent to Bausch Health’s Cardizem. With this approval, Alembic’s total ANDA count rises to 230. The stock closed at Rs 904.20 on Friday, down 14% so far in 2025.",
            "pubDate": "2025-11-17T03:41:19.705955"
        },
        {
            "title": "Muthoot Finance among 6 stocks witnessing 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muthoot-finance-among-6-stocks-witnessing-5-year-swing-high-breakouts/slideshow/125375147.cms",
            "description": "In the NSE list of stocks with a market cap above Rs 1,000 crore, six stocks hit a 5-year swing high at the close on November 14, indicating bullish momentum, according to technical scan data from StockEdge.A 5-year swing high represents the highest price a stock has reached within five years. This level often acts as a significant resistance zone where the price has historically struggled to move higher. Reaching this point can be viewed as a bullish signal, suggesting potential for further upside. However, this differs from a 5-year breakout, which occurs when a stock decisively surpasses a resistance level that has held for five years or more.",
            "pubDate": "2025-11-17T03:41:19.706063"
        },
        {
            "title": "Maruti Suzuki shares in focus as company recalls 39,506 Grand Vitara units",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-shares-in-focus-as-company-recalls-39506-grand-vitara-units/articleshow/125375068.cms",
            "description": "Maruti Suzuki will be in focus after recalling 39,506 Grand Vitara SUVs manufactured between December 2024 and April 2025 due to faulty fuel-level indicators. The company will inspect and replace parts free of cost. The recall comes as the Grand Vitara remains a top performer, driven by rising demand for its Strong Hybrid variants. Maruti’s stock closed at Rs 15,678 on Friday.",
            "pubDate": "2025-11-17T03:41:19.706176"
        },
        {
            "title": "DOMS Industries, Amber Enterprises among 7 stocks showing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/doms-industries-amber-enterprises-among-7-stocks-showing-bullish-signals/slideshow/125375010.cms",
            "description": "On November 14, in the Nifty500 pack, seven stocks appeared in the bullish White Marubozu scanner, according to technical scan data from StockEdge. A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for the period and the closing price is the highest.Characterised by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it signals strong buying pressure throughout the session. Traders interpret this as a sign that buyers were in control from open to close, often using the pattern to make informed decisions about future price movements.",
            "pubDate": "2025-11-17T03:41:19.706277"
        },
        {
            "title": "Godrej Consumer and 5 other stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-and-5-other-stocks-showing-bullish-rsi-upswing/slideshow/125374938.cms",
            "description": "On November 14, in the NSE large-cap segment, six stocks appeared in the RSI Trending Up scan based on data from StockEdge. An uptrend signal is generated when the RSI crosses above 50 from below. “RSI trending up” indicates rising Relative Strength Index (RSI) values, suggesting strengthening price momentum. This may point to potential upward movement and is often used by traders to identify buying opportunities.",
            "pubDate": "2025-11-17T03:41:19.706396"
        },
        {
            "title": "Tata Motors PV shares in focus on JLR  guidance cut, Q2 net profit on one-time gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-pv-shares-in-focus-on-jlr-guidance-cut-q2-net-profit-on-one-time-gain/articleshow/125374708.cms",
            "description": "Tata Motors shares are under investor watch. The company reported weak September quarter results. Its luxury unit, Jaguar Land Rover, also cut its guidance. This follows a cyber incident impacting Jaguar Land Rover's performance. Despite challenges, Tata Motors' domestic operations showed resilience. The company's multi-powertrain portfolio, including EVs, drove growth.",
            "pubDate": "2025-11-17T03:41:19.706499"
        },
        {
            "title": "Kotak Mahindra Bank shares in focus as board considers first stock split in 15 years. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-as-board-considers-first-stock-split-in-15-years-check-details/articleshow/125374669.cms",
            "description": "Kotak Mahindra Bank's board will consider a share split proposal on November 21, potentially making its stock more accessible. The bank's Q2 earnings met expectations, though margins saw a sequential dip. Analysts remain cautious, citing underperformance in NIM and slippage trends compared to peers.",
            "pubDate": "2025-11-17T03:41:19.706595"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Centum Electronics, SJVN among 5 stocks that could give 15-59% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-centum-electronics-sjvn-among-5-stocks-that-could-give-15-59-return/slideshow/125374631.cms",
            "description": "Analysts remain broadly optimistic across defence, infrastructure, power, and engineering names, with multiple brokerages issuing Buy calls backed by strong order books, sector tailwinds, and improving earnings visibility.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-17T03:41:19.706687"
        },
        {
            "title": "Autoriders International approach record date for 5:1 bonus issue. Last day to buy shares to qualify",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/autoriders-international-approach-record-date-for-51-bonus-issue-last-day-to-buy-shares-to-qualify/articleshow/125374453.cms",
            "description": "Today is the final chance for investors to buy Autoriders International shares for a 5:1 bonus issue. Shareholders will receive five extra shares for every one they hold. The stock becomes ex-bonus on November 18. This corporate action capitalizes the company's free reserves. Bonus shares will automatically appear in demat accounts. Investors must complete purchases today for eligibility.",
            "pubDate": "2025-11-17T03:41:19.706787"
        },
        {
            "title": "Asian Paints shares to trade ex-dividend on Nov 18 for Rs 4.50 interim payout. Check payment date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-shares-to-trade-ex-dividend-on-nov-18-for-rs-4-50-interim-payout-check-payment-date/articleshow/125374424.cms",
            "description": "Asian Paints shares will trade ex-dividend on November 18 for its interim dividend of Rs 4.50 per equity share. Investors must own the stock before this date to be eligible for the payout. The company recently reported a 43% year-on-year growth in consolidated net profit for Q2.",
            "pubDate": "2025-11-17T03:41:19.706878"
        },
        {
            "title": "Adani Enterprises’ Rs 24,930 crore rights issue hits record date today. Here’s what lies ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-rs-24930-crore-rights-issue-hits-record-date-today-heres-what-lies-ahead/articleshow/125374393.cms",
            "description": "Adani Enterprises Limited's major rights issue has set its record date. Eligible shareholders can now look forward to the subscription window opening soon. This significant equity raise will be structured with a staggered payment plan. Key dates for application and future payments are now in focus for investors.",
            "pubDate": "2025-11-17T03:41:19.706970"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/125374364.cms",
            "description": "In the Nifty500 pack, 11 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on November 14, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-11-17T03:41:19.707064"
        },
        {
            "title": "Ideaforge Technology shares in focus as co lands over Rs 100 crore in defence orders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ideaforge-technology-shares-in-focus-as-co-lands-over-rs-100-crore-in-defence-orders/articleshow/125375503.cms",
            "description": "Ideaforge Technology shares: IdeaForge has won over ₹100 crore in new defence orders, including a ₹75-crore Indian Army contract for its next-gen Zolt tactical drone after rigorous EW field trials, plus a ₹30-crore order for its SWITCH 2 VTOL drone.",
            "pubDate": "2025-11-17T04:02:38.707526"
        },
        {
            "title": "From Ola to BSE and Tata stocks: Retail investors bet Rs 18,000 crore on these 10 stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-ola-to-bse-and-tata-stocks-retail-investors-bet-rs-18000-crore-on-these-10-stocks/articleshow/125375457.cms",
            "description": "Retail investors injected over ₹18,000 crore into ten diverse stocks, including BSE, TCS, and Ola Electric, during the September 2025 quarter. Despite market volatility, individual investors showed a contrarian approach, increasing holdings in beaten-down stocks while divesting from some financial heavyweights. This sustained retail participation highlights their significant and growing influence in the Indian stock market.",
            "pubDate": "2025-11-17T04:02:38.707670"
        },
        {
            "title": "Groww shares continue stellar surge, up 60% from issue price. What are analysts saying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-continue-stellar-surge-up-60-from-issue-price-what-are-analysts-saying/articleshow/125377187.cms",
            "description": "Groww parent Billionbrains Garage Ventures extended its post-listing rally for a third session, jumping up to 8% to ₹160, now delivering 60% gains over its ₹100 IPO price. The ₹6,632-crore IPO was strongly subscribed 17x, driven by QIB demand, with retail at 9x and NIIs at 14x.",
            "pubDate": "2025-11-17T05:37:20.922517"
        },
        {
            "title": "BOJ faces pressure to delay rate hike after weak GDP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-faces-pressure-to-delay-rate-hike-after-weak-gdp/slideshow/125377072.cms",
            "description": "Japan’s economy shrank nearly 2% (Jul–Sep). First contraction in six quarters; driven mainly by export declines. (Source: Reuters)",
            "pubDate": "2025-11-17T05:37:20.922642"
        },
        {
            "title": "Nifty Bank surges to record high, crossing the 58,900 mark as both PSUs and private lenders rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-bank-surges-to-record-high-crossing-the-58900-mark-as-both-psus-and-private-lenders-rally/articleshow/125376416.cms",
            "description": "Indian banking stocks surged on Monday, propelling the Nifty Bank index to a new record high. Strong performances from Canara Bank, IDFC First Bank, AU Small Finance Bank, and Kotak Mahindra Bank energized broader markets. This rally followed positive earnings reports and renewed investor confidence after the NDA's victory in the Bihar Elections 2025.",
            "pubDate": "2025-11-17T05:37:20.922790"
        },
        {
            "title": "Fed officials split on December rate cut as markets shift bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-officials-split-on-december-rate-cut-as-markets-shift-bets/slideshow/125376577.cms",
            "description": "US agencies have begun outlining plans to release the economic data that was delayed by the government shutdown. As this process began, several Federal Reserve officials repeated their concerns about inflation, even as the Fed’s most dovish policymaker argued that the data available so far support another rate cut (Source: Reuters).",
            "pubDate": "2025-11-17T05:37:20.922898"
        },
        {
            "title": "V2 Retail shares jump 5% as firm swings to net profit in Q2, posts strong Q2 revenue growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/v2-retail-shares-jump-5-as-firm-swings-to-net-profit-in-q2-posts-strong-q2-revenue-growth/articleshow/125376384.cms",
            "description": "V2 Retail delivered a strong Q2 and H1 performance, driven by robust revenue growth, higher margins, and aggressive store expansion. Improved profitability, strong volume gains, and rising full-price sales supported results. Management highlighted strategic merchandising and supply chain execution as the company strengthens its position in the value fashion segment.",
            "pubDate": "2025-11-17T05:37:20.922997"
        },
        {
            "title": "Nitin Raheja bullish on Nifty amid GST cuts and festive demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nitin-raheja-bullish-on-nifty-amid-gst-cuts-and-festive-demand/articleshow/125376317.cms",
            "description": "Nifty nears all-time highs as a surprisingly strong earnings season validates market confidence. Early signals suggest the second half of the fiscal year will be encouraging, with potential benefits from GST rate cuts and festive demand. The quick-service restaurant (QSR) sector is also poised for a cyclical revival after a period of stagnation.",
            "pubDate": "2025-11-17T05:37:20.923097"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley upgrades Hero MotoCorp; Goldman Sachs cuts target on Tata Motors PV",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-upgrades-hero-motocorp-goldman-sachs-cuts-target-on-tata-motors-pv/articleshow/125376361.cms",
            "description": "Global brokerages offered a mixed outlook on Indian market leaders, with Morgan Stanley bullish on Indian Hotels and Hero MotoCorp due to strong positioning and improving demand, while Goldman Sachs turned cautious on Tata Motors PV amid JLR disruptions and weaker guidance. The updates highlight shifting expectations across autos and hospitality.",
            "pubDate": "2025-11-17T05:37:20.923192"
        },
        {
            "title": "Mamaearth glows with 47% rally as Honasa hits reset after a 64% crash. Is an IPO-price comeback next?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mamaearth-glows-with-47-rally-as-honasa-hits-reset-after-a-64-crash-is-an-ipo-price-comeback-next/articleshow/125376302.cms",
            "description": "Honasa Consumer, parent of Mamaearth, shows a 47% rally from its lows, driven by a strong Q2 performance and distribution revamp. Notwithstanding the stock slipping below the IPO price, analysts are upgrading ratings, with JM Financial and ICICI Securities seeing a positive outlook and potential for further gains, targeting Rs 330 and Rs 400, respectively.",
            "pubDate": "2025-11-17T05:37:20.923284"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/125375499.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-11-17T05:37:20.923373"
        },
        {
            "title": "Motilal’s stocks to buy post Q2: Suzlon, Airtel, Adani Ports offer up to 28% return potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilals-stocks-to-buy-post-q2-suzlon-airtel-adani-ports-offer-up-to-28-return-potential/slideshow/125376098.cms",
            "description": "The earnings season is behind now and Motilal Oswal Financial Services (MOFSL) has released a fresh list of high-conviction stock ideas across sectors—from solar and telecom to banking, autos, aviation and ports—highlighting upside potential ranging from 11% to 28%. Here's the list of stocks to buy and why.",
            "pubDate": "2025-11-17T05:37:20.923465"
        },
        {
            "title": "Wealth destroyer to multibagger! A Vijay Shekhar Sharma plot twist for Paytm that small investors are ignoring",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-destroyer-to-multibagger-a-vijay-shekhar-sharma-plot-twist-for-paytm-that-small-investors-are-ignoring/articleshow/125375819.cms",
            "description": "Paytm is making a strong comeback after facing regulatory challenges. The company is now focusing on its core payment business and expanding financial services. New AI-driven products are also being developed. This strategic shift has led to improved financial performance and has attracted significant interest from domestic institutions. Retail investors are overlooking this turnaround.",
            "pubDate": "2025-11-17T05:37:20.923553"
        },
        {
            "title": "Sensex jumps over 200 pts, Nifty tops 25,950 as earnings optimism lifts mood; bank index hits new high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-200-pts-nifty-tops-25950-as-earnings-optimism-lifts-mood/articleshow/125375635.cms",
            "description": "Indian stocks climbed on Monday, buoyed by positive second-quarter earnings forecasts. The S&P BSE Sensex and NSE Nifty 50 both saw gains, though investors remained cautious due to ongoing uncertainty surrounding a potential U.S.-India trade deal.",
            "pubDate": "2025-11-17T05:37:20.923644"
        },
        {
            "title": "Tourism shares drag down Nikkei amid China-Japan spat over Taiwan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tourism-shares-drag-down-nikkei-amid-china-japan-spat-over-taiwan/articleshow/125379499.cms",
            "description": "Japan's Nikkei closed slightly lower as tourism stocks tumbled following China's travel warning amid escalating Taiwan tensions. Retailers like Isetan Mitsukoshi and Shiseido saw significant drops. However, technology and financial stocks provided some support, with Tokyo Electron and Sumitomo Mitsui Financial Group posting gains.",
            "pubDate": "2025-11-17T08:00:01.988931"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of more than 26% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-more-than-26-in-1-year/articleshow/125379132.cms",
            "description": "The way things have panned out in the last few weeks clearly indicates that there is a higher probability of the market staying bullish. There is  positivity both at the index level and in terms of market breadth. What needs to be watched is whether, in the coming months, we will see a return of FPI flows. If that happens, it is very likely that the bulls will get even bolder. Hints on this will come in the last month of 2025. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-11-17T08:00:01.989063"
        },
        {
            "title": "Trump invests in corporate bonds from policy-boosted sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-invests-in-corporate-bonds-from-policy-boosted-sectors/slideshow/125378786.cms",
            "description": "US President Donald Trump purchased at least Rs 82 million worth of corporate and municipal bonds between late August and early October, according to new financial disclosures. The filings show more than 175 transactions, reflecting an aggressive investment phase.",
            "pubDate": "2025-11-17T08:00:01.989182"
        },
        {
            "title": "Tata Motors (CV) shares slide over 3% in first post-listing earnings test. What should investors do now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-cv-shares-slide-over-3-in-first-post-listing-earnings-test-what-should-investors-do-now/articleshow/125379001.cms",
            "description": "Tata Motors (CV) shares fell, extending last week’s slide, after its first post-listing quarterly results showed a sharp swing to a consolidated net loss of ₹867 crore in Q2 FY26 versus a ₹498 crore profit a year earlier. The weak print, following the November 12 demerger and listing, has revived debate on whether the newly listed CV stock is a buy, sell, or hold.",
            "pubDate": "2025-11-17T08:00:01.989293"
        },
        {
            "title": "Narayana Hrudayalaya shares climb 10% as Q2 net profit rises 30% to Rs 258.3 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/narayana-hrudayalaya-shares-climb-10-as-q2-net-profit-rises-30-to-rs-258-3-crore/articleshow/125378332.cms",
            "description": "Narayana Hrudayalaya shares saw a significant jump following strong quarterly results. The healthcare chain reported robust growth in revenue and profit for the September quarter. Both Indian and Cayman Islands operations contributed to this impressive performance. The company's net profit and operating revenue increased substantially year-on-year. This positive financial update has boosted investor confidence.",
            "pubDate": "2025-11-17T08:00:01.989420"
        },
        {
            "title": "IRB Infrastructure shares soar 7% on Rs 9,270 crore project win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irb-infrastructure-shares-soar-7-on-rs-9270-crore-project-win/articleshow/125377551.cms",
            "description": "IRB Infrastructure shares rose sharply on Monday after the company bagged NHAI’s Rs 9,270-crore TOT-17 project, its highest-valued 20-year monetisation award. The award covers 366 kilometres across the Lucknow–Ayodhya–Gorakhpur corridor on NH-27, along with a section of the Lucknow–Varanasi route on NH-731. The order win is being seen as a major boost to IRB’s portfolio, toll revenue outlook and asset base.",
            "pubDate": "2025-11-17T08:00:01.989528"
        },
        {
            "title": "European shares steady as investors pause ahead of US data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-steady-as-investors-pause-ahead-of-us-data/articleshow/125381078.cms",
            "description": "EUROPE-STOCKS/ (URGENT)European shares steady as investors pause ahead of US data",
            "pubDate": "2025-11-17T09:39:35.672099"
        },
        {
            "title": "PhysicsWallah shares to list tomorrow, GMP hints at 9% listing pop. What to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallah-shares-to-list-tomorrow-gmp-hints-at-9-listing-pop-what-to-expect/articleshow/125380413.cms",
            "description": "​PhysicsWallah shares will list on the BSE and NSE on November 18, with the Rs 3,480 crore IPO, one of the largest ever from India’s edtech sector, drawing tepid overall subscription of 1.92 times but a late uptick in grey market sentiment.",
            "pubDate": "2025-11-17T09:39:35.672227"
        },
        {
            "title": "Rs 9,400 crore stake! Groww's dominance on Dalal Street turns founder Lalit Keshre into a billionaire",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-9400-crore-stake-growws-dominance-on-dalal-street-turns-founder-lalit-keshre-into-a-billionaire/articleshow/125380083.cms",
            "description": "Groww's founder Lalit Keshre has joined the billionaire ranks with his stake valued at nearly Rs 9,400 crore, following the company's impressive 68% share price surge post-IPO. Keshre emphasized the listing's focus on trust and accountability, aiming to strengthen the brand, expand infrastructure, and scale new businesses for long-term growth.",
            "pubDate": "2025-11-17T09:39:35.672558"
        },
        {
            "title": "NDA’s landslide Bihar triumph adds strong boost to Indian equities’ rebound narrative, says Motilal Oswal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ndas-landslide-bihar-triumph-adds-strong-boost-to-indian-equities-rebound-narrative-says-motilal-oswal/articleshow/125383778.cms",
            "description": "Motilal Oswal says the Bihar poll mandate strengthens policy continuity and boosts market confidence, adding momentum to improving earnings, supportive reforms, easing political concerns and macro tailwinds that may aid a more durable market uptrend.",
            "pubDate": "2025-11-17T11:07:49.676252"
        },
        {
            "title": "Market Wrap: Sensex ends 388 pts higher, Nifty reclaims 26,000 as RBI relief lifts financial stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-ends-388-pts-higher-nifty-reclaims-26000-as-rbi-relief-lifts-financial-stocks/articleshow/125382479.cms",
            "description": "Indian stocks surged for a sixth consecutive session, with the Sensex and Nifty closing higher. Investors reacted positively to the Reserve Bank of India's new support measures for exporters facing tariff disruptions. Financial stocks spearheaded the gains, supported by optimistic second-quarter earnings forecasts.",
            "pubDate": "2025-11-17T11:07:49.676379"
        },
        {
            "title": "LG Electronics India shares may rally up to 17%, Motilal Oswal says, flagging margin comeback, other triggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lg-electronics-india-shares-may-rally-up-to-17-motilal-oswal-says-flagging-margin-comeback-other-triggers/articleshow/125382405.cms",
            "description": "Motilal Oswal has reaffirmed a ‘Buy’ on LG Electronics India, saying the market is overlooking its margin recovery and premiumisation-led growth. Despite a weak Q2 marked by softer demand and cost pressures, the brokerage sees up to 17% upside, backed by localisation, premium product mix, and a deeper B2B push across HVAC and display solutions.",
            "pubDate": "2025-11-17T11:07:49.676608"
        },
        {
            "title": "Stock Radar: Torrent Pharma stock breaks out from Cup & Handle formation; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-torrent-pharma-stock-breaks-out-from-cup-handle-formation-check-target-stop-loss/articleshow/125326070.cms",
            "description": "Torrent Pharma Ltd. has achieved a fresh record high after breaking out from a Cup & Handle formation on weekly charts. Experts suggest medium-term traders can buy the stock for a target of Rs 4,400 in the next 3-4 months, anticipating further uptrend continuation.",
            "pubDate": "2025-11-17T11:45:17.858798"
        },
        {
            "title": "Gainers & Losers: Groww, Pine Labs & 4 more stocks hog limelight on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-groww-pine-labs-4-more-stocks-hog-limelight-on-monday/slideshow/125383844.cms",
            "description": "",
            "pubDate": "2025-11-17T11:45:17.858925"
        },
        {
            "title": "FIIs raise stakes in 9 strong-margin smallcaps; 2 turn multibaggers. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-raise-stakes-in-9-strong-margin-smallcaps-2-turn-multibaggers-do-you-own-any/slideshow/125379983.cms",
            "description": "A quiet but significant rally is unfolding in smallcaps. Forty-two companies have delivered a rare combination of strong fundamentals and rising FII interest, each maintaining PAT margins above 20% for four straight quarters through September 2025, while FIIs increased their stakes during the same period.Sixteen of these stocks have already posted double-digit returns in CY25, and nine standouts have surged 25% to 300% in just 10 months, reflecting how robust financials are driving sharp market outperformance.",
            "pubDate": "2025-11-17T11:45:17.859664"
        },
        {
            "title": "Sebi aiming to double number of equity investors in 3-5 years: Tuhin Kanta Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-aiming-to-double-number-of-equity-investors-in-3-5-years-tuhin-kanta-pandey/articleshow/125386178.cms",
            "description": "Pandey cited findings of a survey conducted by Sebi recently, which points to eagerness to invest with over a fifth of the respondents saying they plan to invest in the securities market through some route.",
            "pubDate": "2025-11-17T13:58:58.871376"
        },
        {
            "title": "These 9 midcap stocks post 100%+ EBITDA growth in September quarter. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-midcap-stocks-post-100-ebitda-growth-in-september-quarter-do-you-own-any/slideshow/125385960.cms",
            "description": "Quarterly EBITDA growth reflects higher earnings before interest, taxes, depreciation, and amortisation, signalling improved profitability and operational efficiency. Among NSE midcaps, nine stocks recorded over 100% EBITDA growth in Q2FY26, highlighting robust demand, efficient cost management, and strong business performance—positive for investors and stakeholders",
            "pubDate": "2025-11-17T13:58:58.871498"
        },
        {
            "title": "Sebi in advanced stages of comprehensive review of stock brokers regulations: Tuhin Kanta Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-in-advanced-stages-of-comprehensive-review-of-stock-brokers-regulations-tuhin-kanta-pandey/articleshow/125385042.cms",
            "description": "Sebi is close to finalising a major revamp of stock broker and market regulations, aiming to modernise outdated rules, remove ambiguities and streamline compliance. The regulator is also advancing changes in mutual fund norms to create a clearer, future-ready framework",
            "pubDate": "2025-11-17T13:58:58.871599"
        },
        {
            "title": "Asian Paints, Marico among 8 stocks that hit 52-week highs; gains up to 18% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-marico-among-8-stocks-that-hit-52-week-highs-gains-up-to-18-in-a-month/slideshow/125384935.cms",
            "description": "On Monday, the benchmark Sensex gained 388 points to settle at 84,950. During the uptrend, eight stocks within the BSE 100 Index touched their 52-week highs, marking their strongest levels in a year. Traders and investors generally view such breakouts as bullish signals, indicating strong upward momentum and the possibility of further short-term price gains",
            "pubDate": "2025-11-17T13:58:58.871701"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125388018.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-11-17T14:53:06.658790"
        },
        {
            "title": "US stocks fall as focus shifts to Nvidia earnings, economic data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-fall-as-focus-shifts-to-nvidia-earnings-economic-data/articleshow/125388040.cms",
            "description": "Wall Street's main indexes fell at the open on Monday, heading into a packed week that includes AI bellwether Nvidia's results and the resumption of government data releases.",
            "pubDate": "2025-11-17T14:53:06.658923"
        },
        {
            "title": "Two Trades for Today: A housing finance major for a gain of 7.5%, a large-cap two-wheeler stock for an almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-housing-finance-major-for-a-gain-of-7-5-a-large-cap-two-wheeler-stock-for-an-almost-7-rise/articleshow/125387675.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-17T14:53:06.659148"
        },
        {
            "title": "Peter Thiel's fund offloaded Nvidia stake in September quarter, filing shows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/peter-thiels-fund-offloaded-nvidia-stake-in-september-quarter-filing-shows/articleshow/125387831.cms",
            "description": "The fund, Thiel Macro, sold around 537,742 shares in the AI chip frontrunner in the quarter, the filing showed on Friday. The stake would have been worth around $100 million, as of the company's closing price on September 30",
            "pubDate": "2025-11-17T14:53:06.659243"
        },
        {
            "title": "Google parent Alphabet shares jump 5% after Berkshire Hathaway makes rare tech bet with $4.9 billion stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/google-parent-alphabet-shares-jump-5-after-berkshire-hathaway-makes-rare-tech-bet-with-4-9-billion-stake/articleshow/125388869.cms",
            "description": "Berkshire Hathaway's significant investment in Alphabet, valued at $4.93 billion, signals a strong endorsement of the tech giant's artificial intelligence capabilities. This rare tech bet by the conglomerate, under Warren Buffett's leadership, comes as Alphabet emerges as the top-performing \"Magnificent Seven\" stock this year, driven by AI advancements and a robust ad business.",
            "pubDate": "2025-11-17T15:53:54.987982"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/125388877.cms",
            "description": "Indian markets rose for a sixth straight session, supported by financial stocks and strong earnings sentiment. Nifty reclaimed key levels as technical indicators turned bullish, with analysts highlighting favourable risk-reward, improving momentum and steady buying interest across several active counters",
            "pubDate": "2025-11-17T15:53:54.988110"
        },
        {
            "title": "Market Trading Guide: Buy HCL Tech, India Cements and 3 more stocks on Tuesday for up to 8% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-hcl-tech-india-cements-and-3-more-stocks-on-tuesday-for-up-to-8-gains/slideshow/125388838.cms",
            "description": "Headline index Nifty ended positive for a fifth day in a row aided by strong buying action in financials and auto stocks. A breakout from this consolidation zone was witnessed on the daily chart, confirming renewed bullish momentum. Commenting on the day's Vatsal Bhuva, Technical Analyst at LKP Securities said that today's breakout highlights the strong grip of bulls on the index. \"As long as the index sustains above 58,000, where its 20-day EMA is positioned, it remains a buy-on-dip candidate. Immediate support lies at 58,200, while potential resistance is expected around 59,300 and 59,500 levels,\" he said.Here are 2 stock recommendations for Tuesday:",
            "pubDate": "2025-11-17T15:53:54.988220"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-25/articleshow/125391234.cms",
            "description": "For the past six months, headlines have obsessed over the Nifty moving below 25,000 or crossing 26,000. But does this in any way matter to the bottom line of a pharma firm that is close to announcing a US FDA approval for one of its drugs? Or to engineering and capital good giants that have been getting orders from the growing data centres in India? Why are we bringing this up at this point of time? Because, the moment the Nifty crosses its all time high, many investors will start feeling more bullish. Nothing wrong with that. Just make sure that you are logically bullish – that is, look at some key points before being bullish.",
            "pubDate": "2025-11-17T17:53:48.724452"
        },
        {
            "title": "Stock Radar: Biocon stock hits fresh 52-week high in November 2025; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-biocon-stock-hits-fresh-52-week-high-in-november-2025-check-target-stop-loss/articleshow/125382194.cms",
            "description": "Biocon stock has crossed a significant resistance level. Experts recommend buying the stock for potential gains in the coming weeks. The pharma stock showed a strong bounce back in November, rising over 10% in a week. This momentum helped it break out from a multi-year resistance mark. The Supertrend indicator signals continued upside momentum.",
            "pubDate": "2025-11-17T23:51:14.076595"
        }
    ]
}