{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-13T10:40:51.680026",
    "items": [
        {
            "title": "Sebi’s new norms: FPI path to India eased; new rulebook for IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-new-norms-fpi-path-to-india-eased-new-rulebook-for-ipos/articleshow/123863084.cms",
            "description": "The Securities and Exchange Board of India is set to ease Foreign Portfolio Investors entry norms. This move aims to counter their withdrawal from the Indian equity market. Sebi will also relax IPO issue sizes for large Indian companies. Insurance companies and pension funds will get a quota in IPO anchor books.",
            "pubDate": "2025-09-13T03:54:33.230336"
        },
        {
            "title": "Wall Street coasts to the finish of its best week in the last 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-coasts-to-the-finish-of-its-best-week-in-the-last-5/articleshow/123863060.cms",
            "description": "Wall Street concluded its strongest week in five, hovering near record highs as investors anticipate a Federal Reserve interest rate cut. The S&P 500 remained relatively stable, while the Dow Jones Industrial Average declined, and the Nasdaq composite increased.",
            "pubDate": "2025-09-13T03:54:33.230461"
        },
        {
            "title": "Wall Street Week Ahead: Investors seek Fed's view of shaky labor market as rate cut looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-seek-feds-view-of-shaky-labor-market-as-rate-cut-looms/articleshow/123863039.cms",
            "description": "Investors anticipate the Federal Reserve will likely cut interest rates next week, potentially the first time in nine months, amid concerns about a weakening U.S. labor market. Despite recent inflation data, a rate cut is widely expected, with speculation focusing on the size of the reduction.",
            "pubDate": "2025-09-13T03:54:33.230696"
        },
        {
            "title": "NARCL to auction Rs 3,700 crore Wind World debt; Omkara files anchor offer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/narcl-to-auction-wind-world-debt-omkara-files-anchor-offer/articleshow/123863230.cms",
            "description": "National Asset Reconstruction Company is selling Wind World's debt. The reserve bid is ₹1,250 crore. Omkara ARC has emerged as the anchor bidder. They offered around ₹1,250 crore. NARCL acquired the distressed company's loans 18 months ago. The acquisition amount was ₹672 crore. The resolution process is underway. The Swiss Challenge auction is expected to wrap up soon.",
            "pubDate": "2025-09-13T04:31:22.619999"
        },
        {
            "title": "Nifty closes above 25,000 for a 2nd day, points to more gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-closes-above-25000-for-a-2nd-day-points-to-more-gains/articleshow/123863208.cms",
            "description": "Domestic equities marked a second consecutive week of gains, propelled by a surge in IT stocks following positive remarks from Donald Trump on India and Infosys' share buyback announcement. The NSE Nifty closed above 25,000, fueling optimism for further gains, while the Volatility Index declined, signaling reduced market risk.",
            "pubDate": "2025-09-13T04:31:22.620131"
        },
        {
            "title": "Concurrent Gainers: 11 BSE 200 stocks gained for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-11-bse-200-stocks-gained-for-5-days-in-a-row/slideshow/123864069.cms",
            "description": "Over the five trading sessions leading up to September 12, the Sensex posted a steady upward trend, gaining 1.5% or 1,194 points to settle at 81,905. Notably, the benchmark index closed in positive territory on each of those five days, reflecting sustained investor confidence. What makes this rally more interesting is that 11 stocks from the BSE 200 index managed to log gains in every single session during this period, highlighting consistent buying interest in select counters. (Data Source: ACE Equity)",
            "pubDate": "2025-09-13T05:39:07.549538"
        },
        {
            "title": "These 11 mutual fund favourite stocks plunge up to 40% in 2025 so far",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-11-mutual-fund-favourite-stocks-plunge-up-to-40-in-2025-so-far/slideshow/123863922.cms",
            "description": "Investor sentiment often strengthens when a stock is widely held across multiple mutual fund (MF) schemes — a sign of perceived stability and long-term potential. But even these popular names aren’t immune to sharp corrections.As of August 2025, 232 stocks were held by over 100 mutual fund schemes. Yet nearly 100 of them have delivered negative returns in CY25. ETMarkets’ analysis highlights 12 such stocks that have plunged 25–50% this year — a reminder that even heavily owned stocks aren’t guaranteed winners. Diversification and vigilance remain key. (Data: ACE MF, ACE Equity)",
            "pubDate": "2025-09-13T05:39:07.549668"
        },
        {
            "title": "Europe's STOXX 600 slips as French rating review looms; still ends week higher",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-600-slips-as-french-rating-review-looms-still-ends-week-higher/articleshow/123863523.cms",
            "description": "European shares closed the week mostly higher. Investors were cautious about France's credit rating. Healthcare stocks saw losses, with Novartis and Zealand Pharma declining. Aerospace and defence stocks rose due to geopolitical tensions. Banks rebounded after a weak period. French stocks outperformed despite political concerns. Ocado shares fell after Kroger's review of warehouse investments.",
            "pubDate": "2025-09-13T05:39:07.549779"
        },
        {
            "title": "Global stocks edge up with dollar, bond yields as Fed rate cuts loom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-edge-up-with-dollar-bond-yields-as-fed-rate-cuts-loom/articleshow/123863492.cms",
            "description": "Global equities saw a slight increase following a record close, while U.S. Treasury yields rebounded amid fluctuating rate cut expectations. U.S. consumer sentiment declined, with rising inflation expectations fueling investor concerns. Wall Street showed mixed performance after recent record highs, as investors await Federal Reserve Chair Jerome Powell's upcoming statements.",
            "pubDate": "2025-09-13T05:39:07.549878"
        },
        {
            "title": "GST 2.0 to enhance persistency in life insurance plans; HDFC Life, Niva Bupa top buys: Siddhartha Khemka",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-2-0-to-enhance-persistency-in-life-insurance-plans-hdfc-life-niva-bupa-top-buys-siddhartha-khemka/articleshow/123866042.cms",
            "description": "The GST Council’s move to exempt retail health and life insurance from 18% tax will lower premiums, boost affordability, and accelerate penetration, positioning insurers for stronger growth despite short-term transition disruptions and ITC-related adjustments.",
            "pubDate": "2025-09-13T07:46:18.420671"
        },
        {
            "title": "Infosys share buyback: Size, price, dates and other key things to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-share-buyback-size-price-dates-and-other-key-things-to-know/articleshow/123865706.cms",
            "description": "Infosys announced its biggest-ever Rs 18,000-crore share buyback, offering Rs 1,800 per share — nearly an 18% premium to market price. This is its first tender-route buyback since 2017 and aligns with its capital allocation policy to return 85% of free cash flow.",
            "pubDate": "2025-09-13T07:46:18.420801"
        },
        {
            "title": "Upside potential up to 23%: Motilal Oswal’s latest top 5 fundamental stock picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/upside-potential-up-to-23-motilal-oswals-latest-top-5-fundamental-stock-picks/slideshow/123865232.cms",
            "description": "Indian equities closed higher on Friday, with the Nifty 50 extending its winning streak to eight straight sessions. Softer U.S. labour market data eased worries stemming from a hotter-than-expected inflation print, reinforcing hopes that the Federal Reserve may soon start cutting interest rates.Adding to the positive mood were indications of progress towards reviving U.S.-India trade relations, which further buoyed investor sentiment. With this, domestic brokerage firm Motilal Oswal has picked its top 5 bets on a fundamental basis for a horizon of 1 year, with an upside potential of up to 23% from their Thursday’s closing price:",
            "pubDate": "2025-09-13T07:46:18.420926"
        },
        {
            "title": "Mid- and small-cap mania: Why retail investors need to rebalance toward largecaps",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mid-and-small-cap-mania-why-retail-investors-need-to-rebalance-toward-largecaps/articleshow/123864952.cms",
            "description": "AMFI data shows retail investors dangerously overweight in mid- and small-cap funds despite stretched valuations, while large-cap allocations remain underweight. Valuation multiples highlight rising risks, with experts warning of fragility, volatility, and misaligned portfolios. Large caps now offer better entry opportunities.",
            "pubDate": "2025-09-13T07:46:18.421034"
        },
        {
            "title": "Explained: SWAGAT-FI is a diplomatic passport for fleeing FIIs. How will it work?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-swagat-fi-is-a-diplomatic-passport-for-fleeing-fiis-how-will-it-work/articleshow/123864781.cms",
            "description": "Sebi’s new SWAGAT-FI framework offers “diplomatic passport” status to trusted foreign investors like sovereign funds and pensions, easing entry, extending registration validity to 10 years, and simplifying compliance — a move aimed at stabilising FII flows and attracting long-term global capital.",
            "pubDate": "2025-09-13T07:46:18.421143"
        },
        {
            "title": "Invest Rs 30,000, get assured Rs 24 lakh daily: An offer that got an investment advisor barred by Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/invest-rs-30000-get-assured-rs-24-lakh-daily-an-offer-that-got-an-investment-advisor-barred-by-sebi/articleshow/123867523.cms",
            "description": "Sebi has cancelled the registration of Shilpa Garg’s Highlight Investment Research for fraud and mis-selling after she promised astronomical returns, failed to redress grievances, and went unresponsive. She is barred from offering investment advisory services.",
            "pubDate": "2025-09-13T10:40:49.397464"
        },
        {
            "title": "Smallcap rally: Sigachi Industries, MTAR, and this Ramesh Damani stock in weekly top 10 chart, rise up to 37%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-rally-sigachi-industries-mtar-and-this-ramesh-damani-stock-in-weekly-top-10-chart-rise-up-to-37/slideshow/123867502.cms",
            "description": "Smallcap stocks witnessed strong investor interest in the week gone by as the BSE Smallcap index closed with 1.5% gains. Nearly 57% (550) of the stocks in the index settled in the green while 50 ended with double-digit rise. Here are the top 10 weekly performers:",
            "pubDate": "2025-09-13T10:40:49.397599"
        },
        {
            "title": "Weekly wrap: 8 BSE 500 stocks deliver double-digit returns. Infosys joins top Sensex gainers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-wrap-8-bse-500-stocks-deliver-double-digit-returns-infosys-joins-top-sensex-gainers/articleshow/123866624.cms",
            "description": "Markets posted modest weekly gains with 64% of BSE 500 stocks closing positive. Dilip Buildcon led gainers with 18%, while Godfrey Phillips India topped losers with 9%. Sectoral strength came from capital goods and IT, while consumer durables lagged.",
            "pubDate": "2025-09-13T10:40:49.397712"
        },
        {
            "title": "Gold hits record highs but is the rally sustainable?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-hits-record-highs-but-is-the-rally-sustainable/articleshow/123866185.cms",
            "description": "Gold prices have surged past $3,600 globally and ₹1,09,000 in India, driven by recession fears, U.S. policy uncertainty, geopolitical tensions, and shifting global power dynamics that reinforce gold’s role as the ultimate safe-haven asset.",
            "pubDate": "2025-09-13T10:40:49.397812"
        }
    ]
}