{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-01T17:33:52.818983",
    "items": [
        {
            "title": "Adani Ports registers record net profit worth Rs 11,061 crore in FY25, up 37%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-ports-registers-record-net-profit-worth-rs-11061-crore-in-fy25-up-37/videoshow/120799468.cms",
            "description": "Adani Ports and SEZ on Thursday reported an all-time high net profit in the just concluded financial year 2024-25, the company's earnings results showed. The Adani Group's ports business logged a net profit (profit after tax) worth Rs 11,061 crore in the entire fiscal, up 37 per cent. In the January-March quarter, the net profits rose 50 per cent to Rs 3,023 crore. In the January-March quarter of 2023-24, the net profits were at Rs 2,015 crore. Coming to revenue from operations, Adani Ports and SEZ reported a 16 per cent rise in revenue to Rs 31,079 crore, as against Rs 26,711 crore in 2023-24. In the January-March 2025 quarter, the revenue from operations were at Rs 8,488 crore, up 23 per cent from Rs 6,897 crore in the year ago period. The ports business of Adani Group reported an all-time high cargo volume at 450 million tonne; Mundra became the first port in India to cross 200 million tonne in a single year. APSEZ announced results for the quarter and twelve months ending March 2025.",
            "pubDate": "2025-05-01T17:33:33.740096"
        },
        {
            "title": "KKR looks to deploy $116 billion cash in choppy market after profit boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kkr-looks-to-deploy-116-billion-cash-in-choppy-market-after-profit-boost/articleshow/120799282.cms",
            "description": "Investment firm KKR reports a profit increase. This is despite market fluctuations. The company plans to use its capital for new opportunities. KKR is focusing on retail investors. They launched new funds with lower fees. These funds will allow access to public and private credit. KKR aims to expand into private equity and real estate.",
            "pubDate": "2025-05-01T17:33:33.740221"
        },
        {
            "title": "Gloomy retail earnings show consumers are feeling the pinch of US tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gloomy-retail-earnings-show-consumers-are-feeling-the-pinch-of-us-tariffs/articleshow/120798633.cms",
            "description": "Lackluster quarterly results from consumer-facing companies including McDonald's and Harley-Davidson are the latest sign that American shoppers are curbing spending amid shifting U.S. trade policies.",
            "pubDate": "2025-05-01T17:33:33.740328"
        },
        {
            "title": "Home First Finance Q4 Results: Profit rises 25.4% YoY; AUM up 31%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/home-first-finance-q4-results-profit-rises-25-4-yoy-aum-up-31/articleshow/120797613.cms",
            "description": "Home First Finance reported a 25.4% YoY rise in Q4 net profit, driven by a 31% increase in assets under management. It raised Rs 1,250 crore through a qualified institutional placement, boosting net worth to Rs 3,751 crore.",
            "pubDate": "2025-05-01T17:33:33.740434"
        },
        {
            "title": "Big Tech's fortunes diverge as AI powers cloud, tariffs hit consumer electronics",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/big-techs-fortunes-diverge-as-ai-powers-cloud-tariffs-hit-consumer-electronics/articleshow/120796867.cms",
            "description": "The fortunes of Big Tech are diverging in a rapidly changing business landscape, as demand for artificial intelligence fuels growth in cloud and digital ads while consumer electronics take a battering from President Donald Trump's global trade war.",
            "pubDate": "2025-05-01T17:33:33.740539"
        },
        {
            "title": "NYSE-parent ICE's first-quarter profit rises on robust trading volume",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nyse-parent-ices-first-quarter-profit-rises-on-robust-trading-volume/articleshow/120794471.cms",
            "description": "Intercontinental Exchange reported an increase in first-quarter profit on Thursday, as it benefited from strong trading volumes in energy and options segments.",
            "pubDate": "2025-05-01T17:33:33.740657"
        },
        {
            "title": "Eternal Q4 Results: PAT tanks 78% YoY to Rs 39 crore on higher expenses, revenue jumps 64%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-q4-results-pat-falls-78-yoy-to-rs-39-crore-revenue-jumps-64/articleshow/120791777.cms",
            "description": "Eternal Q4 Results: Food delivery company Eternal (formerly Zomato) saw its net profit fall by 78% year-on-year (YoY) to Rs 39 crore in the March 2025 quarter. Revenue from operations increased 64% YoY to Rs 5,833 crore.",
            "pubDate": "2025-05-01T17:33:33.740757"
        },
        {
            "title": "Adani Enterprises Q4 Results: PAT surges 752% YoY to Rs 3,845 crore on exceptional gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-enterprises-q4-results-pat-surges-752-yoy-to-rs-3845-crore-on-exceptional-gain/articleshow/120791260.cms",
            "description": "Adani Enterprises Q4 Results: Adani Enterprises reported a significant 752% surge in Q4 profit, driven by an exceptional gain, despite an 8% revenue decline due to lower IRM volume. The company's EBITDA rose 19%, fueled by strong performance in green hydrogen, renewable energy, and airports businesses. Looking ahead, Adani Enterprises plans to raise Rs 15,000 crore and expand its key verticals.",
            "pubDate": "2025-05-01T17:33:33.740854"
        },
        {
            "title": "Adani Ports Q4 Results: Net profit rises 50% YoY to Rs 3,023 crore, revenue jumps 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-ports-q4-results-net-profit-rises-50-yoy-to-rs-3023-crore-revenue-jumps-23/articleshow/120787924.cms",
            "description": "Adani Ports reported a robust 50% YoY increase in net profit, reaching Rs 3,023 crore in Q4, driven by strong cargo and logistics growth. Revenue surged 23% to Rs 8,488 crore, with Mundra Port setting a new record. The company is expanding internationally and anticipates continued growth with revenue guidance of Rs 36,000–38,000 crore for FY26.",
            "pubDate": "2025-05-01T17:33:33.740947"
        },
        {
            "title": "Microsoft reports strong results driven by cloud and AI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/microsoft-reports-strong-results-driven-by-cloud-and-ai/articleshow/120782313.cms",
            "description": "Technology giant Microsoft posted robust quarterly results on Wednesday, with revenue rising 13 percent to $70.1 billion, powered by a strong performance in its cloud computing and artificial intelligence businesses. The company's Intelligent Cloud segment, a key part of Microsoft's business, showed particularly strong growth with revenue of $26.8 billion, up 21 percent.",
            "pubDate": "2025-05-01T17:33:33.741041"
        },
        {
            "title": "Q4 results today: Adani Enterprises, Eternal among 14 companies to announce earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q4-results-today-adani-enterprises-eternal-among-14-companies-to-announce-earnings-on-thursday/articleshow/120781793.cms",
            "description": "Indian companies are gearing up to release their Q4 earnings, with Adani Enterprises and Adani Ports among the key names. All eyes are on Eternal, formerly Zomato, which is expected to reveal strong revenue growth, fueled by Hyperpure and Blinkit. However, profitability might suffer, with analysts predicting a potential profit dip or even a loss.",
            "pubDate": "2025-05-01T17:33:33.741136"
        },
        {
            "title": "Eternal to announce Q4 results today: Profit to take severe hit even as revenue growth seen strong",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-to-announce-q4-results-today-profit-to-take-severe-hit-even-as-revenue-growth-seen-strong/articleshow/120781639.cms",
            "description": "Eternal, formerly Zomato, anticipates strong revenue growth in Q4, fueled by Hyperpure and Blinkit. However, profitability is expected to decline significantly, with analysts projecting a substantial drop in profit after tax or even a loss. While food delivery margins are expected to improve slightly, Blinkit's expansion may lead to EBITDA losses due to new store additions.",
            "pubDate": "2025-05-01T17:33:33.741231"
        },
        {
            "title": "Indus Towers Q4 net falls 4% on accounting impact, finance cost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indus-towers-q4-net-falls-4-on-accounting-impact-finance-cost/articleshow/120781189.cms",
            "description": "Indus said one of its large customers (Vodafone Idea), which accounts for a substantial part of revenue and receivables, has cleared all undisputed overdue amounts in March 2025, resulting in a significant reduction in the allowance for doubtful receivables. As a result, the fiscal fourth-quarter results reflected a write-back of Rs 226 crore in the provision for doubtful receivables.",
            "pubDate": "2025-05-01T17:33:33.741329"
        },
        {
            "title": "Ujjivan Small Finance Bank Q4 Results: Profit falls 75% to Rs 83 crore amid rising credit costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ujjivan-small-finance-bank-q4-results-profit-falls-75-to-rs-83-crore-amid-rising-credit-costs/articleshow/120769473.cms",
            "description": "Ujjivan Small Finance Bank's Q4 net profit plummeted 75% to Rs 83.4 crore due to higher credit costs and reduced net interest income. While total income saw a rise, a significant surge in expenditure, particularly interest payments and employee costs, impacted profitability.",
            "pubDate": "2025-05-01T17:33:33.741423"
        },
        {
            "title": "Equitas Bank Q4 net profit plunges 80% amid rising credit costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/equitas-bank-q4-net-profit-plunges-80-amid-rising-credit-costs/articleshow/120769351.cms",
            "description": "Equitas Small Finance Bank’s Q4 profit fell 80% YoY to Rs 42 crore due to higher credit costs and muted earnings. While microfinance slippages stayed elevated, the bank sees improving collections ahead. Growth in secured loans and strategic investments could support future performance. Deposits and advances rose 19% and 11%, respectively.",
            "pubDate": "2025-05-01T17:33:33.741522"
        },
        {
            "title": "Mindspace REIT Q4 Results: Net income rises 13% to Rs 540 crore; Ramesh Nair elevated as MD & CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mindspace-reit-q4-results-net-income-rises-13-to-rs-540-crore-ramesh-nair-elevated-as-md-ceo/articleshow/120766814.cms",
            "description": "Mindspace Business Parks REIT announced a 13% increase in net operating income, reaching Rs 540 crore for the quarter ended March, and declared a distribution of Rs 392 crore. CEO Ramesh Nair has been appointed as Managing Director. The company achieved record-breaking leasing and occupancy rates, with a positive outlook for long-term growth driven by strategic acquisitions and development.",
            "pubDate": "2025-05-01T17:33:33.741631"
        }
    ]
}