{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-13T02:52:06.793873",
    "items": [
        {
            "title": "Ajit Jain sells half of his Class A shares in Berkshire Hathaway",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ajit-jain-sells-half-of-his-class-a-shares-in-berkshire-hathaway/articleshow/113307536.cms",
            "description": "Ajit Jain, vice chair of insurance operations at Berkshire Hathaway, sold $139 million worth of Class A shares in the company. Jain disposed of 200 shares at approximately $695,418 each, leaving him with control of 166 shares. Jain joined Berkshire Hathaway in 1986 and has been praised by Warren Buffett for his contributions to the firm.",
            "pubDate": "2024-09-13T02:50:53.811973"
        },
        {
            "title": "Sebi approves 10x hike in NSE’s share capital",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-approves-10x-hike-in-nses-share-capital/articleshow/113307513.cms",
            "description": "The Securities and Exchange Board of India has approved amendments to the National Stock Exchange's memorandum of association, allowing a 10-fold increase in authorised share capital to ₹500 crore. This will facilitate the bourse's proposed four-for-one bonus issue and provide flexibility for issuing fresh shares during its public offering.",
            "pubDate": "2024-09-13T02:50:53.812086"
        },
        {
            "title": "MFs add stocks with focus on likely rate cuts, cheaper oil",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mfs-add-stocks-with-focus-on-likely-rate-cuts-cheaper-oil/articleshow/113307457.cms",
            "description": "In August, mutual fund managers focused on stocks poised to benefit from potential rate cuts and falling crude prices, accumulating shares in paints, tyre companies, and select banks and NBFCs like Kotak and IndusInd.",
            "pubDate": "2024-09-13T02:50:53.812190"
        },
        {
            "title": "D-Street sees new highs as Beijing homes in on mortgage rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-sees-new-highs-as-beijing-homes-in-on-mortgage-rate-cut/articleshow/113307259.cms",
            "description": "India's key stock indices surged nearly 2% to all-time highs on Thursday, driven by China's decision to cut interest rates on mortgages. The Sensex briefly crossed 83,000, led by gains in Bharti Airtel, NTPC, Mahindra & Mahindra and JSW Steel. The NSE Nifty also saw significant gains, closing at a record high.",
            "pubDate": "2024-09-13T02:50:53.812287"
        },
        {
            "title": "Investors in North India take the equity plunge, numbers quadruple in 4 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-in-north-india-take-the-equity-plunge-nos-quadruple-in-4-years/articleshow/113307090.cms",
            "description": "North Indian savers are increasingly investing in equities, with the number of investors on the National Stock Exchange quadrupling since FY20. Improved internet connectivity and financial literacy have contributed to this trend. Uttar Pradesh has seen significant growth, while Maharashtra and Gujarat's shares have declined.",
            "pubDate": "2024-09-13T02:50:53.812381"
        },
        {
            "title": "GIFT Nifty signals a positive start for D-Street. Here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-signals-a-positive-start-for-d-street-heres-the-trading-setup-for-todays-session/articleshow/113307060.cms",
            "description": "Indian equities saw a strong performance on Thursday, with Nifty reaching a new high above 25,400 levels. This surge was driven by robust buying from foreign institutional investors and retail participants. Key factors to watch include India's inflation data. The rupee also saw a slight gain amid positive domestic equity trends and foreign fund inflows.",
            "pubDate": "2024-09-13T02:50:53.812480"
        },
        {
            "title": "Yen advances, treasuries rise as Fed move nears: Markets Wrap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yen-advances-treasuries-rise-as-fed-move-nears-markets-wrap/articleshow/113307011.cms",
            "description": "The yen strengthened against the dollar, while falling Treasury yields boosted emerging-market currencies in Asia. Stocks in the region fluctuated as markets awaited next week's Federal Reserve policy meeting. Data showed US producer prices rose slightly in August, maintaining expectations for a rate cut. Japan's central bank is unlikely to hike rates at its upcoming meeting.",
            "pubDate": "2024-09-13T02:50:53.812571"
        },
        {
            "title": "Dixon Technologies stock showing signs of reversal; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-stock-showing-signs-of-reversal-time-to-buy/videoshow/113306979.cms",
            "description": "“Dixon Technologies stock has formed a  Bullish Harami candlestick pattern on the daily chart, signaling a  potential bullish reversal. Traders can buy for a target of Rs 13500 in  the next 3-4 weeks,” Kkunal V. Parar, Vice-President of Technical  Research and Algo, Choice Broking, said.",
            "pubDate": "2024-09-13T02:50:53.812665"
        },
        {
            "title": "Wall Street indexes close up; data keeps smaller Fed rate cut in view",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-close-up-data-keeps-smaller-fed-rate-cut-in-view/articleshow/113306968.cms",
            "description": "Wall Street's main indexes closed higher after inflation data supported expectations for a 25-basis point rate cut by the Federal Reserve. The producer price index rose more than expected, while initial unemployment claims met estimates. Moderna's weak revenue forecast made it the S&P 500's biggest percentage loser.",
            "pubDate": "2024-09-13T02:50:53.812757"
        },
        {
            "title": "Stocks in news: IRCTC, Patanjali Foods, SBI Cards, BLS International, Tata Power",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-irctc-patanjali-foods-sbi-cards-bls-international-tata-power/articleshow/113306944.cms",
            "description": "Domestic markets hit a new high, gaining nearly two percent. Key stocks in focus include IRCTC, Patanjali Foods, SBI Cards, BLS International, and Tata Power due to various developments. LIC increased its stake in IRCTC to 9.3%, while SBI Cards plans to raise Rs 5,000 crore. BPCL approved two joint ventures for energy transition initiatives.",
            "pubDate": "2024-09-13T02:50:53.812854"
        },
        {
            "title": "Weekly Top Mid & Small cap Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-mid-small-cap-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/113299222.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analysis, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools - earnings, fundamentals, relative valuation, risk and price momentum.",
            "pubDate": "2024-09-13T02:50:53.812943"
        },
        {
            "title": "Daily Trading Desk: An engineering stock for 7% gain & an FMCG stock poised for 5% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/daily-trading-desk-an-engineering-stock-for-7-gain-an-fmcg-stock-poised-for-5-rise/articleshow/113298199.cms",
            "description": "Defensive FMCG and capital goods stocks are gaining momentum yet again.",
            "pubDate": "2024-09-13T02:50:53.813030"
        },
        {
            "title": "Stock Radar: 100% rally in 1 year! Dixon Technologies takes support above 50-DMA and bounces back; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-100-rally-in-1-year-dixon-technologies-takes-support-above-50-dma-and-bounces-back-time-to-buy/articleshow/113293583.cms",
            "description": "Dixon Technologies' stock price experienced a remarkable 145% surge in one year, rising from Rs 5,176 to Rs 12,693. It reached an all-time high of Rs 13,633 on August 26, 2024, before experiencing some profit-taking. However, the stock found support above its 50-day moving average, which has been a key support level throughout 2024.",
            "pubDate": "2024-09-13T02:50:53.813122"
        },
        {
            "title": "Vaccine maker Moderna forecasts lower sales next year, shares tumble 17% to near four-year low",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vaccine-maker-moderna-forecasts-lower-sales-next-year-shares-tumble-17-to-near-four-year-low/articleshow/113300377.cms",
            "description": "Moderna has delayed its break-even goal by two years, pushing it to 2028, due to slower regulatory processes for key products like flu and cancer vaccines. The company expects lower sales in 2025 compared to this year and plans cost-saving measures, including cuts in research and development.",
            "pubDate": "2024-09-13T02:50:53.813213"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-friday/articleshow/113299120.cms",
            "description": "Sensex and Nifty50 hit record highs on Thursday, driven by gains in commodity stocks and expectations of China cutting mortgage rates. The Nifty rose 1.89% to 25,388, while the Sensex increased 1.77% to 82,962. Analysts foresee continued gains with key resistance at 25,500.",
            "pubDate": "2024-09-13T02:50:53.813300"
        },
        {
            "title": "Draghi report on EU economy is 'severe but just': ECB's Lagarde",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/draghi-report-on-eu-economy-is-severe-but-just-ecbs-lagarde/articleshow/113298600.cms",
            "description": "European Central Bank chief Christine Lagarde said Thursday a report written by her predecessor Mario Draghi calling for sweeping reforms to boost the EU economy was \"severe\" but \"just\". \"It's a formidable report in that it poses a diagnosis which is severe but which is just in our view,\" Lagarde said at a press conference.",
            "pubDate": "2024-09-13T02:50:53.813386"
        }
    ]
}