{
    "title": "RSS Feed",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-03T17:12:49.427222",
    "items": [
        {
            "title": "Piyush Goyal assures help to exporters to deal with global trade uncertainties",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/piyush-goyal-assures-help-to-exporters-to-deal-with-global-trade-uncertainties/articleshow/123681111.cms",
            "description": "Commerce Minister Piyush Goyal has assured exporters of government support in navigating steep US tariffs. He urged them to enhance product quality, diversify supply chains, and explore new markets. The government is committed to creating a supportive ecosystem through various initiatives and policy interventions. India's exports rebounded in July, with a significant increase in trade with the US.",
            "pubDate": "Wed, 03 Sep 2025 21:18:56 +0530"
        },
        {
            "title": "GST has been contributing a substantial part of revenue kitty: JNU Professor Praveen Jha",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-has-been-contributing-a-substantial-part-of-revenue-kitty-jnu-professor-praveen-jha/videoshow/123680781.cms",
            "description": "",
            "pubDate": "Wed, 03 Sep 2025 20:53:54 +0530"
        },
        {
            "title": "Guwahati Tea Auction Centre records impressive growth in sales during April – August with 76.94 mn kgs of teas sold",
            "link": "https://economictimes.indiatimes.com/news/economy/agriculture/guwahati-tea-auction-centre-records-impressive-growth-in-sales-during-april-august-with-76-94-mn-kgs-of-teas-sold/articleshow/123680052.cms",
            "description": "Guwahati Tea Auction Centre (GTAC) experienced substantial tea sales growth from April to August 2025. Total tea sales reached 76.94 million kgs, with CTC and Dust varieties at 72.70 million kgs and Orthodox teas at 4.24 million kgs. While Orthodox teas showed strong price appreciation, CTC and Dust prices corrected slightly, remaining above 2023 levels, indicating a dynamic market.",
            "pubDate": "Wed, 03 Sep 2025 20:42:13 +0530"
        },
        {
            "title": "FDI up 15 pc to USD 18.62 bn in Apr-June FY26; inflow from US triples",
            "link": "https://economictimes.indiatimes.com/news/economy/indicators/fdi-up-15-pc-to-usd-18-62-bn-in-apr-june-fy26-inflow-from-us-triples/articleshow/123680374.cms",
            "description": "Foreign Direct Investment in India increased by 15 percent, reaching 18.62 billion US dollars during April to June. The United States became the largest investor, contributing 5.61 billion US dollars. Karnataka received the highest inflow of investments. The government has implemented investor-friendly policies and reforms across various sectors. These reforms aim to liberalize FDI norms and attract more overseas investments.",
            "pubDate": "Wed, 03 Sep 2025 20:18:17 +0530"
        },
        {
            "title": "GST Council okays fast registration for non-risky businesses, seven-day refund window",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-approves-quicker-registration-seven-day-refund-window-and-tax-relief-for-exporters/articleshow/123680135.cms",
            "description": "The GST Council is likely to approve reforms aimed at easing compliance for small businesses, including faster registration and refunds. Amendments to the place of supply definition will benefit Global Capacity Centres and ITES, while rate rationalization discussions continue. The council also addressed post-sales discounts and appellate tribunal issues, focusing on reducing litigation and supporting small taxpayers and exporters.",
            "pubDate": "Wed, 03 Sep 2025 20:09:11 +0530"
        },
        {
            "title": "GST on footwear, apparels priced at Rs 2,500 cut to 5%",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-on-footwear-apparels-priced-at-rs-2500-likely-cut-to-5/articleshow/123679325.cms",
            "description": "The GST Council has likely approved reducing the GST rate on footwear and apparel priced up to Rs 2,500 to 5%. Previously, this rate applied only to items priced up to Rs 1,000. The council also decided to eliminate the 12% and 28% slabs, shifting most items to the 5% and 18% categories.",
            "pubDate": "Wed, 03 Sep 2025 18:51:11 +0530"
        },
        {
            "title": "Jaishankar on how India is balancing relations with conflicting partners: 'we were quite easy ..'",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/jaishankar-on-how-india-is-balancing-relations-with-conflicting-partners-we-were-quite-easy-/videoshow/123678581.cms",
            "description": "",
            "pubDate": "Wed, 03 Sep 2025 18:06:58 +0530"
        },
        {
            "title": "Sberbank publishes guide for Indian entrepreneurs planning to localise biz in Russia",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/sberbank-publishes-guide-for-indian-entrepreneurs-planning-to-localise-biz-in-russia/articleshow/123677175.cms",
            "description": "Sberbank aims to facilitate the India-Russia trade relationship, targeting USD 100 billion in bilateral trade by 2030. To achieve this, Sberbank is providing resources for businesses looking to expand into each other's markets. While current trade stands at USD 63 billion, dominated by energy, there's a push for diversification, especially after trade reached USD 68.7 billion in 2024-25.",
            "pubDate": "Wed, 03 Sep 2025 16:56:13 +0530"
        },
        {
            "title": "Govt sets up committee to examine tax, export clearance issues of manufacturing sector",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/govt-sets-up-committee-to-examine-tax-export-clearance-issues-of-manufacturing-sector/articleshow/123676457.cms",
            "description": "Amidst high tariffs imposed by the US, the government has formed a committee to address tax and export clearance issues faced by manufacturing units. The committee, comprising representatives from various ministries and industry bodies, will examine existing tax structures and procedures, identify sector-specific challenges, and recommend global best practices to enhance export competitiveness.",
            "pubDate": "Wed, 03 Sep 2025 16:20:19 +0530"
        },
        {
            "title": "India-EFTA trade pact with sustainability clause to take effect on October 1",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-efta-trade-pact-with-sustainability-clause-to-take-effect-on-october-1/articleshow/123675109.cms",
            "description": "The free trade agreement between India and the EFTA bloc, set to take effect on October 1, includes legally binding provisions on trade and sustainable development. India has secured a USD 100 billion investment commitment over 15 years, leading to the creation of one million direct jobs. Switzerland gains improved market access for 94.",
            "pubDate": "Wed, 03 Sep 2025 15:18:40 +0530"
        },
        {
            "title": "The art of consensus: How a divided India came together for GST",
            "link": "https://economictimes.indiatimes.com/news/economy/finance/the-art-of-consensus-how-a-divided-india-came-together-for-gst/articleshow/123674679.cms",
            "description": "The GST Council is meeting to discuss potential rate changes, including a two-slab structure and a luxury item tax. States are seeking revenue loss compensation as the Centre plans to end the compensation cess. The original GST rollout in 2017 was a landmark achievement of political consensus, uniting India through bipartisan cooperation.",
            "pubDate": "Wed, 03 Sep 2025 15:07:57 +0530"
        },
        {
            "title": "EAM Jaishankar assures ‘special attention’ to German companies investing in India",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/eam-jaishankar-assures-special-attention-to-german-companies-investing-in-india/articleshow/123674722.cms",
            "description": "​​Speaking at a joint press conference with his German counterpart, Jaishankar reiterated that India remains fully committed to continuously improving the ease of doing business in this country and assured him minister that any concerns that German companies may have in India, coming to India, establishing themselves, working in India, New Delhi would be prepared to give it \"special attention.”",
            "pubDate": "Wed, 03 Sep 2025 15:01:44 +0530"
        },
        {
            "title": "Textiles Minister assesses MSP operations for cotton procurement ahead of Kharif season",
            "link": "https://economictimes.indiatimes.com/news/economy/agriculture/textiles-minister-assesses-msp-operations-for-cotton-procurement-ahead-of-kharif-season/articleshow/123674394.cms",
            "description": "Union Textiles Minister Giriraj Singh reviewed MSP operations for cotton procurement starting October 1, 2025, assuring seamless procurement via the 'Kapas-Kisaan' app for farmer registration and direct payments. The initiative aims for a digitally empowered cotton ecosystem with transparent, faceless processes and uniform procurement norms.",
            "pubDate": "Wed, 03 Sep 2025 14:44:22 +0530"
        },
        {
            "title": "GST Council starts two today meeting to discuss two slabs, tax cuts",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-starts-two-today-meeting-meet-to-discuss-two-slabs-tax-cuts/articleshow/123672352.cms",
            "description": "The GST Council convened to deliberate on a proposal to streamline tax slabs, potentially reducing rates for essential items and luxury goods. While states generally support the plan, some opposition-led regions seek revenue loss compensation. The proposed reforms aim to boost consumption, ease business operations, and simplify compliance, with potential economic benefits.",
            "pubDate": "Wed, 03 Sep 2025 13:08:00 +0530"
        },
        {
            "title": "India counting on Germany's support to expedite trade talks with EU",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-counting-on-germanys-support-to-expedite-trade-talks-with-eu/articleshow/123672014.cms",
            "description": "Indian Foreign Minister Subrahmanyam Jaishankar urged German counterpart Johann Wadephul for support in strengthening ties with the European Union and advancing free trade agreement discussions. Wadephul is visiting India for two days, having been in Bengaluru on Tuesday.",
            "pubDate": "Wed, 03 Sep 2025 12:33:48 +0530"
        },
        {
            "title": "Sitharaman: Next- gen GST reforms will be open, transparent, business-friendly",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/sitharaman-next-gen-gst-reforms-will-be-open-transparent-business-friendly/videoshow/123671619.cms",
            "description": "",
            "pubDate": "Wed, 03 Sep 2025 12:14:04 +0530"
        },
        {
            "title": "Opposition-ruled states meet ahead of GST Council, seek compensation to approve reform agenda",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/opposition-ruled-states-meet-ahead-of-gst-council-seek-compensation-to-nod-reform-agenda/articleshow/123670750.cms",
            "description": "Opposition-ruled states met ahead of the GST Council meeting, seeking compensation for revenue loss following GST rate rejig. They fear losses from slab removals, while the Centre believes lower prices will boost consumption. The GST Council will discuss a proposal to reduce the number of tax rates and a special rate on select items, potentially impacting prices of various goods.",
            "pubDate": "Wed, 03 Sep 2025 11:29:56 +0530"
        },
        {
            "title": "Govt likely to roll out four schemes to help exporters facing 50% US tariffs: Report",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/india-us-trump-tariffs-relief-schemes-msme-support-export-promotion-mission/articleshow/123670407.cms",
            "description": "In response to Washington's tariff hike, the Indian government is preparing a support package for exporters, potentially including credit and liquidity measures akin to those during the Covid-19 pandemic. The focus is on aiding MSMEs in sectors like textiles, gems, and engineering goods to withstand the impact, maintain jobs, and explore new markets.",
            "pubDate": "Wed, 03 Sep 2025 11:27:56 +0530"
        },
        {
            "title": "GST Council meet begins to deliver on PM Modi's Diwali gift promise: What's coming for auto, insurance, personal care and electronic sectors?",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-headed-by-nirmala-sitharaman-meet-begins-to-deliver-on-pm-modis-diwali-gift-promise-whats-coming-for-auto-insurance-personal-care-and-electronic-sectors/articleshow/123669809.cms",
            "description": "Chaired by Finance Minister Nirmala Sitharaman, the GST Council is convening for two days to discuss a significant overhaul of the Goods and Services Tax. The proposed reforms aim to reduce tax rates on everyday items, potentially shifting most goods from the 12% bracket to 5% and from 28% to 18%.",
            "pubDate": "Wed, 03 Sep 2025 11:20:58 +0530"
        },
        {
            "title": "India service sector growth hit 15-year high in August but inflation intensifies: PMI data",
            "link": "https://economictimes.indiatimes.com/news/economy/indicators/india-service-sector-growth-hit-15-year-high-in-august-but-inflation-intensifies-pmi-data/articleshow/123669856.cms",
            "description": "India's services sector experienced a significant surge in August, reaching a 15-year high driven by robust demand. This surge also led to the fastest increase in prices in over a decade. Business confidence improved, fueled by advertising plans and positive demand forecasts, despite modest employment growth. The Composite PMI hit a 17-year high, indicating broad economic momentum.",
            "pubDate": "Wed, 03 Sep 2025 10:38:06 +0530"
        },
        {
            "title": "50% tariffs driving India towards Russia, China, says US' Ro Khanna; vows to protect bipartisan ties against 'Trump's ego'",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/50-tariffs-driving-india-towards-russia-china-says-us-ro-khanna-vows-to-protect-bipartisan-ties-against-trumps-ego/articleshow/123669126.cms",
            "description": "Khanna, who co-chairs the US-India Caucus, said the 50% duties were not only hurting Indian exporters of products such as leather and textiles but also undermining American manufacturers. The California Democrat accused Trump of jeopardising a strategic partnership out of personal grievances. He added that the alliance with India was too vital to be put at risk.",
            "pubDate": "Wed, 03 Sep 2025 09:52:51 +0530"
        },
        {
            "title": "GST Council Meeting: Hour of GST 2.0 arrives; all eyes on Team Modi's Diwali gifts for Indian economy",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-council-meeting-hour-of-gst-2-0-arrives-all-eyes-on-team-modis-diwali-gifts-for-indian-economy/articleshow/123668868.cms",
            "description": "The keenly-watched GST Council meeting is underway. It will potentially overhauling India's tax structure by reducing it to two primary slabs of 5% and 18%, alongside a 40% rate for luxury items. This reform aims to boost consumption and simplify compliance, but faces opposition from states concerned about revenue losses and compensation mechanisms, particularly regarding the compensation cess.",
            "pubDate": "Wed, 03 Sep 2025 09:33:47 +0530"
        },
        {
            "title": "Trump has no understanding of economics, India holds 21st century's deciding vote and justified tariff policies: Edward Price",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/trump-has-no-understanding-of-economics-india-holds-21st-centurys-deciding-vote-and-justified-tariff-policies-edward-price/articleshow/123668703.cms",
            "description": "An analyst criticizes Donald Trump's India policy. Edward Price warns trade disputes harm relations. Trump's tariffs misunderstand economics. India's policies are justified for development. Price suggests India may align with China, Russia. Modi reminds the US of his options. Price recommends removing tariffs and offering an apology. He emphasizes India's importance in US-China competition.",
            "pubDate": "Wed, 03 Sep 2025 09:16:59 +0530"
        },
        {
            "title": "GST 2.0 &amp; the great Indian price puzzle: Middle class cheer or boardroom bonus?",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/gst-2-0-the-great-indian-price-puzzle-middle-class-cheer-or-boardroom-bonus/articleshow/123667802.cms",
            "description": "India is on the verge of GST 2.0, aiming to simplify the tax structure and boost demand. Essential goods may see reduced rates, benefiting consumers, while companies could strategically reprice products. The reform balances revenue concerns with the potential for increased consumption, impacting both household budgets and corporate strategies.",
            "pubDate": "Wed, 03 Sep 2025 08:55:32 +0530"
        },
        {
            "title": "Motown unclear what route cess will take past GST 2.0",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/motown-unclear-what-route-cess-will-take-past-gst-2-0/articleshow/123664147.cms",
            "description": "Indian automakers and retailers may face losses on over 600,000 unsold vehicles. This is due to unclear GST compensation cess rules. The industry wants the government to abolish the cess. They seek a mechanism for credit losses after the GST revamp. The GST Council will discuss levy changes soon. Some companies are limiting dispatches of larger vehicles.",
            "pubDate": "Wed, 03 Sep 2025 06:00:00 +0530"
        },
        {
            "title": "Hope to finalise US trade pact by November, says Piyush Goyal",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/hope-to-finalise-us-trade-pact-by-november-says-piyush-goyal/articleshow/123663871.cms",
            "description": "Piyush Goyal anticipates concluding a trade agreement with the US by November. Trade talks with the European Union are progressing well. Relations with China are improving as border tensions decrease. India has already finalized trade agreements with Mauritius, Australia, EFTA, the UK, and the UAE. India aims to be self-reliant by ensuring resilient supply chains.",
            "pubDate": "Wed, 03 Sep 2025 05:00:00 +0530"
        },
        {
            "title": "ET Graphics | G 2.0: A reform story",
            "link": "https://economictimes.indiatimes.com/news/economy/finance/et-graphics-g-2-0-a-reform-story/articleshow/123664320.cms",
            "description": "The Goods and Services Tax Council is set to commence a two-day meeting on Wednesday to discuss significant reforms to the GST structure, which was implemented eight years ago. Prime Minister Narendra Modi has called the proposed changes a 'Diwali gift,' as the Centre aims to lessen the tax burden on the general public and simplify compliance procedures for businesses.",
            "pubDate": "Wed, 03 Sep 2025 01:52:15 +0530"
        },
        {
            "title": "States to gain from GST rate rationalisation: Report",
            "link": "https://economictimes.indiatimes.com/news/economy/finance/states-to-gain-from-gst-rate-rationalisation-report/articleshow/123664296.cms",
            "description": "An SBI Research report projects states to be 'net gainers' from the proposed GST rate rationalization, with revenue exceeding ₹14.10 lakh crore this fiscal year. While an initial dip is possible, states are expected to gain ₹10 lakh crore in state GST and ₹4.1 lakh crore through devolution in FY26.",
            "pubDate": "Wed, 03 Sep 2025 01:38:33 +0530"
        },
        {
            "title": "India ups the tempo in diversifying trade deals",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/india-ups-the-tempo-in-diversifying-trade-deals/articleshow/123664274.cms",
            "description": "India is accelerating its efforts to diversify export markets amid trade tensions with the US, actively pursuing new trade agreements with the Eurasian Economic Union (EAEU), the European Union (EU), and the South African Customs Union (SACU).",
            "pubDate": "Wed, 03 Sep 2025 01:33:31 +0530"
        },
        {
            "title": "Fitment panel clears two-slab GST structure",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/fitment-panel-clears-two-slab-gst-structure/articleshow/123664265.cms",
            "description": "The GST Council is set to consider a proposal for a simplified two-slab GST structure of 5% and 18%, along with a 40% rate for sin and luxury goods. This move, recommended by the fitment committee, aims to lower the tax burden on common household items, potentially reducing it by 12-15%.",
            "pubDate": "Wed, 03 Sep 2025 01:30:32 +0530"
        },
        {
            "title": "Tax exemption for global funds extended to FY31",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/tax-exemption-for-global-funds-extended-to-fy31/articleshow/123663856.cms",
            "description": "The CBDT has extended the tax exemption timeline for sovereign wealth and pension funds investing in India. Originally set to expire in FY25, the deadline is now extended to FY31, offering significant relief to these entities. This amendment encourages continued investment in infrastructure and priority sectors under Section 10(23FE) of the Income Tax Act.",
            "pubDate": "Wed, 03 Sep 2025 00:43:27 +0530"
        },
        {
            "title": "Yellow pea imports hit prices; government urges import curbs",
            "link": "https://economictimes.indiatimes.com/news/economy/foreign-trade/yellow-pea-imports-hit-prices-government-urges-import-curbs/articleshow/123663317.cms",
            "description": "The Ministry of Consumer Affairs has urged the Commerce Ministry to restrict duty-free yellow pea imports, as they are undercutting domestic pulse prices. This move follows concerns raised by the agriculture minister and industry bodies about the impact on local farmers and pulse production.",
            "pubDate": "Wed, 03 Sep 2025 00:18:12 +0530"
        },
        {
            "title": "Budget 2026-27 preparation to begin on October 9: Finance Ministry",
            "link": "https://economictimes.indiatimes.com/news/economy/policy/budget-2026-27-preparation-to-begin-on-october-9-finance-ministry/articleshow/123663116.cms",
            "description": "India's finance ministry is set to begin crafting the Union Budget for 2026-27 amidst new US tariffs and global economic uncertainties, starting October 9. The budget aims to navigate these challenges while advancing reforms to boost growth and employment. Ministries are urged to provide realistic projections and align allocations with approved plans, avoiding liability transfers between Finance Commission cycles.",
            "pubDate": "Wed, 03 Sep 2025 00:08:33 +0530"
        }
    ]
}