{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-12T06:20:41.496934",
    "items": [
        {
            "title": "After asset quality hit, small finance banks to sharpen risk controls for 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-asset-quality-hit-small-finance-banks-to-sharpen-risk-controls-for-2026/articleshow/126473364.cms",
            "description": "Small finance banks are strengthening their risk management. They plan to reduce unsecured loans and boost secured lending like vehicle and housing loans. Credit guarantee schemes will cover more microfinance loans. This strategy aims to prevent asset quality issues. Banks like ESAF, Suryoday, Ujjivan, and Utkarsh are implementing these changes to ensure stability and growth.",
            "pubDate": "2026-01-12T00:49:46.034135"
        },
        {
            "title": "Nifty in a bear hug, needs to break above 26,100 levels: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-in-a-bear-hug-needs-to-break-above-26100-levels-analysts/articleshow/126473318.cms",
            "description": "Indian equity markets face a bearish outlook as the Nifty breaks key supports. Analysts predict further declines, with the Nifty potentially testing the 25,300 to 25,350 levels. Sentiment is unlikely to improve without a strong rebound above 26,100. Investors are advised to adopt a sell-on-rise strategy.",
            "pubDate": "2026-01-12T00:49:46.034261"
        },
        {
            "title": "Stocks in news: TCS, HCL Tech, DMart, ICICI Lombard, RIL, Lemon Tree Hotels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-hcl-tech-dmart-icici-lombard-ril-lemon-tree-hotels/articleshow/126467395.cms",
            "description": "Markets extended their decline on Friday, mirroring weak global cues and disrupting the Nifty's short-term up move. Several companies like TCS, HCL Tech, and RIL are in focus due to Q3 results and significant investment announcements, including Adani Group's Rs 1.5 lakh crore commitment in Kutch.",
            "pubDate": "2026-01-12T00:49:46.034474"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126467426.cms",
            "description": "Indian equity benchmarks extended their losing streak for the fifth consecutive session, closing lower amid weak global cues and geopolitical tensions. Today, Q3 earnings from TCS and HCL Tech will be in focus, alongside potential US trade policy commentary. The market sentiment appears decisively negative, with the India VIX rising.",
            "pubDate": "2026-01-12T00:49:46.034573"
        },
        {
            "title": "Credit demand zooms as policy eases, outstanding bank credit crossed Rs 200 lakh cr for the first time on Dec 31, 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-demand-zooms-as-policy-eases-outstanding-bank-credit-crossed-rs-200-lakh-cr-for-the-first-time-on-dec-31-2025/articleshow/126473384.cms",
            "description": "India's credit demand is surging. Lower taxes and supportive monetary policy are fueling investment. Outstanding bank credit has crossed a major milestone. This growth surpasses projections, indicating a strong economic rebound. Auto loans, small and mid-sized companies, and home loans are key drivers. Investment intentions are translating into spending, creating a positive environment.",
            "pubDate": "2026-01-12T00:49:46.034766"
        },
        {
            "title": "IEX shares extend slide to 35% from peak amid market coupling overhang: Buy or avoid?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-extend-slide-to-35-from-peak-amid-market-coupling-overhang-buy-or-avoid/articleshow/126475848.cms",
            "description": "Indian Energy Exchange (IEX) shares have plummeted 35% from their peak, driven by regulatory uncertainty surrounding the market coupling order. Experts advise caution, citing weak technicals and potential dilution of IEX's market dominance, though some see value if a favorable outcome is reached.",
            "pubDate": "2026-01-12T05:31:04.516385"
        },
        {
            "title": "IEX shares rebound 3%, snap 2-day fall. Should investors buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-rebound-3-snap-2-day-fall-should-investors-buy-sell-or-hold/articleshow/126475788.cms",
            "description": "Indian Energy Exchange shares saw a jump on January 12, recovering from a recent dip. The company is challenging a regulatory order on market coupling. Analysts offer divided opinions, with some seeing upside potential while others warn of regulatory risks. The exchange reported strong electricity traded volumes for the third quarter of FY26, with lower power prices observed.",
            "pubDate": "2026-01-12T05:31:04.516505"
        },
        {
            "title": "Vodafone Idea among 5 stocks that closed crossing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-among-5-stocks-that-closed-crossing-below-vwap/slideshow/126474882.cms",
            "description": "On January 9, the closing prices of five Nifty500 stocks fell more than 1.5% below their respective VWAPs (Volume Weighted Average Price), indicating a potential bearish trend, according to technical scan data from StockEdge.com.When a stock closes below its VWAP, it means the closing price is lower than the average price at which it traded during the day, weighted by trading volume. This is often seen as a sign of increased selling pressure.",
            "pubDate": "2026-01-12T05:31:04.516612"
        },
        {
            "title": "Lemon Tree Hotels shares rally 4% as Warburg Pincus checks in; Nuvama sees 19% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lemon-tree-hotels-shares-rally-4-as-warburg-pincus-checks-in-nuvama-sees-19-upside/articleshow/126475510.cms",
            "description": "Lemon Tree Hotels' shares rose following a strategic reorganisation and a Rs 960 crore investment from Warburg Pincus. The company will split into an asset-light management entity and an asset-heavy development arm, with Fleur Hotels to be separately listed. Nuvama maintains a 'Buy' rating, seeing potential upside from the asset-light model's re-rating.",
            "pubDate": "2026-01-12T05:31:04.516714"
        },
        {
            "title": "After blockbuster 2025, metal stocks tumble up to 10% weekly this year. What’s ahead?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-blockbuster-2025-metal-stocks-tumble-up-to-10-weekly-this-year-whats-ahead/articleshow/126475490.cms",
            "description": "Metal stocks experienced a dip in early 2026, with some declining up to 10% due to profit-booking and US tariff concerns. Despite this, market experts highlight strong sector fundamentals and favorable momentum, suggesting selective stock picking for potential upside. The Nifty Metal index saw a 3% weekly decline, though some analysts remain positive on the long-term outlook.",
            "pubDate": "2026-01-12T05:31:04.516812"
        },
        {
            "title": "D-St investors lose Rs 17 lakh crore in 6 days as Sensex slumps 2,700 pts, Nifty sinks 3%. What’s driving the selloff?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-today-sensex-slides-2700-pts-in-6-days-nifty-sinks-3-rs-17-lakh-crore-wiped-out-in-6-days-whats-driving-the-selloff/articleshow/126475026.cms",
            "description": "Indian equities experienced a significant slump on Monday, with the Sensex and Nifty extending their selloff and erasing nearly Rs 17 lakh crore in market value. Investor unease stems from uncertainty surrounding U.S. tariff policy and global geopolitical events, prolonging a policy overhang and spiking the India VIX.",
            "pubDate": "2026-01-12T05:31:04.516906"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/126475115.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2026-01-12T05:31:04.516997"
        },
        {
            "title": "BHEL shares tumble 6% as Chinese import fears resurface. Should investors buy this dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-shares-tumble-15-in-just-two-sessions-should-investors-buy-this-dip/articleshow/126475178.cms",
            "description": "Bharat Heavy Electricals Ltd (BHEL) shares dropped significantly as India considers easing restrictions on Chinese firms bidding for government contracts, raising concerns about increased competition. While some experts see this as a negative development, others believe component-level easing could benefit BHEL by reducing import costs and improving execution.",
            "pubDate": "2026-01-12T05:31:04.517112"
        },
        {
            "title": "Sensex suffers the worst start to a year in a decade. What this selloff means for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-suffers-the-worst-start-to-a-year-in-a-decade-what-this-selloff-means-for-investors/articleshow/126475158.cms",
            "description": "India's equity markets experienced their worst start to a year in a decade as the BSE Sensex fell 1.93% in the first ten days of 2026. Geopolitical tensions, trade deal uncertainties, and sustained foreign institutional investor selling contributed to a broad-based sell-off, particularly impacting cyclical sectors. Analysts advise caution, focusing on quality large-cap stocks amidst expected continued volatility.",
            "pubDate": "2026-01-12T05:31:04.517213"
        },
        {
            "title": "Hyundai Motor India shares plunge 20% from all-time peak. Will Q3 help turn the tide?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-shares-plunge-20-from-all-time-peak-will-q3-help-turn-the-tide/articleshow/126475053.cms",
            "description": "Hyundai Motor India shares are down 20% from peak as GST 2.0 benefits remain limited and margin pressures persist. Analysts see Q3 revenue growth support from exports, but caution on demand, valuation and new plant-related costs.",
            "pubDate": "2026-01-12T05:31:04.517308"
        },
        {
            "title": "DMart shares rise 3% as Q3 profit jumps 18% YoY. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dmart-parent-avenue-supermarts-shares-in-focus-after-18-yoy-rise-in-q3-profit-what-should-investors-do/articleshow/126474934.cms",
            "description": "DMart shares: DMart's parent company, Avenue Supermarts, saw its stock rise after reporting an 18.3% profit jump for the third quarter of FY2026. Revenue also grew by 13.3%. While profitability improved, concerns exist about slowing growth in some areas. Analysts have varied outlooks, with some maintaining a hold and others reiterating a buy rating.",
            "pubDate": "2026-01-12T05:31:04.517403"
        },
        {
            "title": "IREDA shares jump 4% after reporting 15% YoY growth in Q3 PAT, 28% surge in revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ireda-shares-in-focus-after-reporting-15-yoy-jump-in-q3-pat-28-surge-in-revenue/articleshow/126474909.cms",
            "description": "IREDA share price surged on Monday following robust third-quarter financial results. The company reported a significant 15.4% year-on-year jump in net profit to Rs 1,381.36 crore, with revenue from operations climbing 28.2%. Loan sanctions and disbursements also showed strong growth, highlighting the firm's expanding presence in the renewable energy sector.",
            "pubDate": "2026-01-12T05:31:04.517495"
        },
        {
            "title": "Will Q3 earnings finally end 6 quarters of pain? 70 stocks to watch out for now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-q3-earnings-finally-end-6-quarters-of-pain-70-stocks-to-watch-out-for-now/articleshow/126474784.cms",
            "description": "India's Q3 earnings season is set to deliver the strongest profit growth in two years. Brokerages forecast a sharp turnaround after six quarters of disappointing results. Financials and autos are expected to lead the gains. However, export-facing sectors face headwinds. The market is watching to see if this marks a sustained recovery or a false dawn.",
            "pubDate": "2026-01-12T05:31:04.517581"
        },
        {
            "title": "Adani Ports shares in focus after flagging Rs 1.5 lakh crore investment push in Kutch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-shares-in-focus-after-flagging-rs-1-5-lakh-crore-investment-push-in-kutch/articleshow/126474744.cms",
            "description": "Shares of Adani Ports & SEZ Ltd are set to be in focus after managing director Karan Adani said the Adani Group will invest Rs 1.5 lakh crore over the next five years in Gujarat’s Kutch region. Speaking at the Vibrant Gujarat Regional Conference, he outlined plans to double Mundra port capacity over the next decade and commission the full 37 GW Khavda renewable energy project by 2030, underscoring the group’s long-term expansion strategy aligned with India’s national development priorities.",
            "pubDate": "2026-01-12T05:31:04.517672"
        },
        {
            "title": "Tejas Networks shares plunge 8%, hit 52-week low as Q3 loss widens, revenue tanks 88% YoY. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tejas-networks-shares-in-focus-as-q3-loss-widens-revenue-tanks-88-yoy-check-details/articleshow/126474743.cms",
            "description": "Tejas Networks has hit a troubling 52-week low in its share prices following a significant loss reported for the December quarter. This decline can be attributed to a drastic reduction in sales figures and challenges with deferred purchase orders from BSNL.",
            "pubDate": "2026-01-12T05:31:04.517767"
        },
        {
            "title": "BHEL among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126474724.cms",
            "description": "On January 9, futures open interest rose sharply across multiple F&O stocks, resulting in an overall increase of over 8% compared with the previous session. A rise in open interest signals an expansion in outstanding futures contracts, pointing to fresh positioning or scaling up of existing positions by traders.",
            "pubDate": "2026-01-12T05:31:04.517858"
        },
        {
            "title": "Hindustan Zinc shares rise 3% as silver hits fresh record high over $83. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-rise-3-as-silver-hits-fresh-record-high-over-83-what-should-investors-do/articleshow/126476455.cms",
            "description": "Hindustan Zinc shares surged on Monday, mirroring a significant jump in silver prices driven by global tensions and Federal Reserve concerns. The company, a major silver producer, is benefiting from rising metal prices and improved cost efficiency. Analysts remain optimistic, citing a constructive technical outlook and strong earnings potential, with a target price suggesting further upside.",
            "pubDate": "2026-01-12T05:53:47.066500"
        },
        {
            "title": "Manappuram Finance stock rises 4% following clarification on Bain Capital deal reports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/manappuram-finance-stock-rises-4-following-clarification-on-bain-capital-deal-reports/articleshow/126476336.cms",
            "description": "Manappuram Finance shares rose nearly 4% after the company clarified that its proposed Bain Capital deal is progressing as planned, with most RBI approvals already in place and final regulatory clearance awaited, easing investor concerns.",
            "pubDate": "2026-01-12T05:53:47.066610"
        },
        {
            "title": "Waaree Energies, Premier Energies shares rally up to 5% after China moves to curb solar export rebates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-premier-energies-shares-rally-up-to-5-after-china-moves-to-curb-solar-export-rebates/articleshow/126476642.cms",
            "description": "Shares of Waaree Energies and Premier Energies jumped up to 5% on January 12 after China announced plans to cancel or cut export tax rebates on solar and battery products, a move that could ease global pricing pressure. The rebound comes after sharp corrections in both stocks amid sustained underperformance.",
            "pubDate": "2026-01-12T06:20:40.824984"
        }
    ]
}