{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-12T03:14:21.497504",
    "items": [
        {
            "title": "Zerodha to change how it releases margins on equity F&O expiry day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-to-change-how-it-releases-margins-on-equity-fo-expiry-day/articleshow/125917812.cms",
            "description": "Zerodha has updated its margin release policy for equity derivatives expiry days, now making funds available by 4 PM after cash market close. This change allows active traders to immediately redeploy capital into commodity markets, which trade until late evening, easing previous capital constraints.",
            "pubDate": "2025-12-12T01:50:08.175076"
        },
        {
            "title": "Asian stocks rise at open after S&P 500 hits record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-at-open-after-sp-500-hits-record-high/articleshow/125923717.cms",
            "description": "Asian stocks opened higher, mirroring record highs in US and global equities following the Federal Reserve's interest-rate cut. SoftBank Group saw a significant jump, while caution lingered for some tech names despite the broader rally. The market anticipates continued momentum into year-end and potentially 2026.",
            "pubDate": "2025-12-12T01:50:08.175183"
        },
        {
            "title": "GIFT Nifty up 110 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125917689.cms",
            "description": "Indian equities rose on Thursday, with the Nifty ending its three-day decline. Foreign institutional investors continued their selling streak for the eleventh consecutive session. Key economic data releases from India and the UK are anticipated today, while the Indian rupee hit an all-time low against the US dollar.",
            "pubDate": "2025-12-12T01:50:08.175282"
        },
        {
            "title": "Stocks in news: BEML, IndiGo, Jindal Steel, ITC Hotels, Glenmark Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-beml-indigo-jindal-steel-itc-hotels-glenmark-pharma/articleshow/125917645.cms",
            "description": "Indian markets saw a rebound on Thursday after three days of decline. Analysts suggest caution until a key resistance level is cleared. Investors should watch banking and IT stocks closely for market direction. Global market trends, especially from the US, will also play a role.",
            "pubDate": "2025-12-12T01:50:08.175380"
        },
        {
            "title": "Fairfax emerges as frontrunner to acquire government–LIC stake in IDBI Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fairfax-emerges-as-frontrunner-to-acquire-governmentlic-stake-in-idbi-bank/articleshow/125923675.cms",
            "description": "Fairfax Financial seems poised to take the lead in acquiring a significant stake in IDBI Bank, with Kotak Mahindra Bank hot on its heels. As financial bids draw near, there’s speculation about a potential deadline extension. Fairfax is leaning towards a full cash offer amidst the government and LIC's plans to offload more than 60% of the bank's shares.",
            "pubDate": "2025-12-12T01:50:08.175499"
        },
        {
            "title": "Oracle's 14.4% plunge weighs on Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracles-14-4-plunge-weighs-on-wall-street/articleshow/125923499.cms",
            "description": "The Nasdaq experienced a one-week low as Oracle's significant AI spending plans overshadowed a dovish Federal Reserve. Oracle's stock plummeted after its quarterly forecasts missed expectations, raising concerns about its AI cloud strategy burning cash. Technology stocks, including Nvidia and Broadcom, also declined, impacting the S&P 500 and semiconductor index.",
            "pubDate": "2025-12-12T01:50:08.175602"
        },
        {
            "title": "Despite the stress, big banks keep playing credit cards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-the-stress-big-banks-keep-playing-credit-cards/articleshow/125923546.cms",
            "description": "Several mid-sized lenders, including Kotak Mahindra Bank, RBL Bank, and IndusInd Bank, are slowing new credit card issuances due to ongoing sector stress and a focus on cleaning up books. This contrasts with larger banks like HDFC Bank and ICICI Bank, which continue aggressive portfolio expansion.",
            "pubDate": "2025-12-12T01:50:08.175884"
        },
        {
            "title": "Kotak Bank eyes mid-market loans amid slow big-corp demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-bank-eyes-mid-market-loans-amid-slow-big-corp-demand/articleshow/125923548.cms",
            "description": "Kotak Mahindra Bank is expanding its mid-market corporate loan book, targeting companies with ₹500 crore to ₹1,500 crore in turnover. This segment, which has grown over 35% compounded annually since its launch, is expected to see 20-25% growth over the next five years. The bank aims for this mid-market book to reach at least 20% of its total corporate portfolio.",
            "pubDate": "2025-12-12T01:50:08.175978"
        },
        {
            "title": "RBI relaxes rules on current, CC and OD accounts; threshold raised to ₹10 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-relaxes-rules-on-current-cc-and-od-accounts-threshold-raised-to-10-crore/articleshow/125923536.cms",
            "description": "The Reserve Bank of India has relaxed norms for business accounts. Customers can now open current, cash credit, and overdraft accounts more easily. The aggregate exposure limit for opening these accounts without restriction has been raised. New rules will be effective from April 2026. Banks will have specific criteria for maintaining accounts with higher exposures.",
            "pubDate": "2025-12-12T01:50:08.176254"
        },
        {
            "title": "Lenders to MSME units face concentration risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenders-to-msme-units-face-concentration-risk/articleshow/125923621.cms",
            "description": "MSME lenders face significant concentration risk as a small fraction of borrowers holds over half of the total outstanding loans. Despite this, the sector's portfolio quality improved, with the share of loans at risk declining. Public sector banks lead in the micro segment, while private banks dominate small and medium enterprises.",
            "pubDate": "2025-12-12T01:50:08.176343"
        },
        {
            "title": "NBCC  shares in focus on securing projects worth Rs 289 crore from NALCO, SAIL Bokaro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-shares-in-focus-on-securing-projects-worth-rs-289-crore-from-nalco-sail-bokaro/articleshow/125924486.cms",
            "description": "NBCC (India) Ltd will be in focus after securing two domestic project management consultancy contracts worth about Rs 289.39 crore from NALCO and SAIL Bokaro. The assignments include extensive civil, infrastructure, and desilting works, strengthening the company’s order book and expanding its role in major public-sector development projects.",
            "pubDate": "2025-12-12T03:14:13.409884"
        },
        {
            "title": "InterGlobe Aviation shares in focus as DGCA summons IndiGo CEO Pieter Elbers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/interglobe-aviation-shares-in-focus-as-dgca-summons-indigo-ceo-pieter-elbers/articleshow/125924462.cms",
            "description": "InterGlobe Aviation is expected to remain in focus after the DGCA summoned IndiGo CEO Pieter Elbers amid ongoing operational disruptions. The regulator seeks his assistance in its inquiry into widespread cancellations and crew-related issues. This development places additional attention on the airline’s strained operations and regulatory scrutiny as travel disruptions intensify.",
            "pubDate": "2025-12-12T03:14:13.410013"
        },
        {
            "title": "HDFC Bank among 4 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-among-4-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125924436.cms",
            "description": "On December 11, four Nifty50 stocks appeared in the RSI Trending Up scan on stockedge.com. An RSI moving above 50 suggests strengthening momentum and often acts as an early uptrend trigger, pointing to potential buying opportunities as price strength begins to build.",
            "pubDate": "2025-12-12T03:14:13.410116"
        },
        {
            "title": "Stocks to buy for 2026: Motilal Oswal initiates coverage on Inventurus Knowledge & Sagility; Morgan Stanley maintain overweight on Polycab",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-motilal-oswal-initiates-coverage-on-inventurus-knowledge-sagility-morgan-stanley-maintain-overweight-on-polycab/slideshow/125924165.cms",
            "description": "Brokerages remain optimistic across a diverse set of companies, signalling confidence in themes ranging from industrial manufacturing to renewable energy and specialised services.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-12T03:14:13.410212"
        },
        {
            "title": "Methodhub Software shares to list today. GMP indicates mild premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/methodhub-software-shares-to-list-today-gmp-indicates-mild-premium/articleshow/125924132.cms",
            "description": "Methodhub Software is set to debut on the BSE SME platform on December 12. The company's Initial Public Offering saw a robust subscription of 28.91 times. Despite this strong response, the grey market premium indicates moderate listing expectations. The IPO aims to raise funds for loan repayment, working capital, and expansion.",
            "pubDate": "2025-12-12T03:14:13.410314"
        },
        {
            "title": "Encompass Design IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/encompass-design-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/125924090.cms",
            "description": "Encompass Design India, operating as ScaleSauce, is set to list on the NSE SME platform on December 12. The IPO, which closed on December 9, saw a subscription of 2.19 times, with NIIs showing strong interest. The company, a consumer-brand builder in home, lifestyle, and food categories, aims to use IPO proceeds for infrastructure, working capital, and debt repayment.",
            "pubDate": "2025-12-12T03:14:13.410429"
        },
        {
            "title": "Flywings Simulator shares to debut today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/flywings-simulator-shares-to-debut-today-heres-what-gmp-indicates/articleshow/125924071.cms",
            "description": "Flywings Simulator, an aviation training firm, is set to debut on the NSE SME platform on December 12. The IPO, which closed on December 9, is trading at a 0% grey market premium, suggesting a listing around its issue price. The company plans to use IPO proceeds for pilot-training equipment and general corporate purposes.",
            "pubDate": "2025-12-12T03:14:13.410526"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/125924007.cms",
            "description": "As of December 11, 2025, 17 NSE-listed stocks with a market capitalisation of over Rs 1,000 crore closed above their 200-day moving average (DMA). Of these, we have highlighted the top 9 that posted gains of more than 2.5%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-12-12T03:14:13.410624"
        },
        {
            "title": "Dow, S&P 500 post record closes; Oracle drags on Nasdaq",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-sp-500-post-record-closes-oracle-drags-on-nasdaq/articleshow/125923866.cms",
            "description": "The S&P 500 and Dow Jones closed at record highs Thursday, driven by financial stocks after a less hawkish Federal Reserve. The Nasdaq lagged as Oracle's AI spending concerns and weak forecasts caused its shares to tumble, fueling fears of an AI bubble. Market rotation favored cyclicals and small caps amid anticipation of global growth reacceleration.",
            "pubDate": "2025-12-12T03:14:13.410718"
        }
    ]
}