{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-19T08:17:54.239437",
    "items": [
        {
            "title": "What Tiger Global ruling means for foreign investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-tiger-global-ruling-means-for-foreign-investors/articleshow/126665134.cms",
            "description": "A Supreme Court ruling impacts foreign investors in India. Investors can no longer use only a Tax Residency Certificate for tax benefits. Tax authorities will now examine the business substance of overseas investment structures. This affects private equity and other foreign portfolio investors, particularly those using Mauritius and Singapore.",
            "pubDate": "2026-01-19T00:53:33.892248"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126650964.cms",
            "description": "Indian equity markets closed marginally higher on Friday, buoyed by positive sentiment in the IT and banking sectors. Analysts anticipate a sideways trading range in the near term, with stock-specific movements driven by earnings and trade developments. Geopolitical escalations remain a key risk factor.",
            "pubDate": "2026-01-19T00:53:33.892346"
        },
        {
            "title": "Stocks in news: RIL, ICICI Bank, HDFC Bank, Bharat Coking Coal, Tata Technologies, Wipro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-icici-bank-hdfc-bank-bharat-coking-coal-tata-technologies-wipro/articleshow/126650792.cms",
            "description": "Indian markets ended marginally higher, extending their consolidation phase. Investors await key Q3 earnings from Reliance Industries, HDFC Bank, and ICICI Bank for directional cues. Analysts advise a selective, stock-specific approach, focusing on IT, financials, and metals amid volatility.",
            "pubDate": "2026-01-19T00:53:33.892520"
        },
        {
            "title": "China's tech stock boom pushes past economic malaise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-tech-stock-boom-pushes-past-economic-malaise/articleshow/126665015.cms",
            "description": "China's tech sector is experiencing a significant rally in early 2026, driven by advancements in AI, commercial rockets, robotics, and flying cars. This surge in homegrown technologies is outperforming global benchmarks, fueled by investor optimism about China's ambition to lead in AI and high-level chips, even amidst economic fragilities.",
            "pubDate": "2026-01-19T00:53:33.892602"
        },
        {
            "title": "Nifty needs 25,900 break for fresh upside amid volatility: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-needs-25900-break-for-fresh-upside-amid-volatility-analysts/articleshow/126664873.cms",
            "description": "Indian markets are experiencing indecision and rising volatility. Analysts highlight key levels for Nifty. A close above 25,900 could boost the index towards 26,300. Conversely, a break below 25,500 may signal further declines. Traders are advised to await clear direction. Top stock picks include Canara Bank, Tech Mahindra, Rail Vikas Nigam, Bank of India, and Ultratech Cement.",
            "pubDate": "2026-01-19T00:53:33.892688"
        },
        {
            "title": "Sun Pharma looks to rise in US with $10 billion Organon buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-looks-to-rise-inus-with-10-billion-organon-buy/articleshow/126665159.cms",
            "description": "India's largest drugmaker, Sun Pharma, is considering a major acquisition. The company is evaluating the purchase of US-based Organon, a specialist in women's health. This potential deal is valued at around $10 billion. A successful acquisition would be a significant move for Sun Pharma, strengthening its presence in the US market.",
            "pubDate": "2026-01-19T00:53:33.892847"
        },
        {
            "title": "Priority sector lending: RBI asks HDFC, ICICI banks to make extra provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/priority-sector-lending-rbi-asks-hdfc-icici-banks-to-make-extra-provisions/articleshow/126665058.cms",
            "description": "ICICI Bank and HDFC Bank have been instructed by a regulator to make significant one-time provisions. ICICI Bank must set aside an additional Rs 1,283 crore, while HDFC Bank is required to allocate Rs 500 crore. The regulator has also urged both banks to identify and address shortcomings in their loan portfolios. These adjustments are necessary to ensure compliance with Priority Sector Lending (PSL) norms.",
            "pubDate": "2026-01-19T00:53:33.892928"
        },
        {
            "title": "India needs to narrow the insurance protection gap: Swiss Re",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-needs-to-narrow-the-insurance-protection-gap-swiss-re/articleshow/126664972.cms",
            "description": "India's total property exposure is now estimated at $26-29 trillion, according to a global reinsurer. A significant portion of this exposure is located in areas prone to natural disasters. These regions are characterized by a high concentration of economic assets that coincide with risks such as floods, cyclones, and earthquakes.",
            "pubDate": "2026-01-19T00:53:33.893006"
        },
        {
            "title": "Cutting risk cuts microfin's portfolio, recovery way off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cutting-risk-cuts-microfins-portfolio-recovery-way-off/articleshow/126664958.cms",
            "description": "Microfinance loan portfolios have been declining since April 2024, according to industry leaders. This trend began after reaching a high of Rs 3.43 lakh crore. The decrease is attributed to loan repayments exceeding new loan disbursements across the sector.",
            "pubDate": "2026-01-19T00:53:33.893089"
        },
        {
            "title": "Negative Breakout: These 11 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-11-stocks-cross-below-their-200-dmas/slideshow/126665789.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, 11 stocks' closing prices crossed below their 200 DMA (Daily Moving Averages) on January 16, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2026-01-19T03:00:22.971715"
        },
        {
            "title": "Defrail Technologies shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defrail-technologies-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126665736.cms",
            "description": "Defrail Technologies' shares are trading at a 23% grey market premium ahead of their BSE SME listing on January 19. The Rs 14 crore IPO, priced at Rs 74, was oversubscribed 105 times, indicating strong investor interest. The company, a manufacturer of rubber parts for automotive, railways, and defence, is expected to list around Rs 90-92.",
            "pubDate": "2026-01-19T03:00:22.971830"
        },
        {
            "title": "Asian stocks dip, gold hits record as tariff woes return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-dip-gold-hits-record-as-tariff-woes-return/articleshow/126665337.cms",
            "description": "Markets reacted negatively as US President Donald Trump proposed new tariffs on eight European nations. This move revived tariff concerns, causing risk assets to slip and safe-haven demand to strengthen. Gold and silver prices surged to record highs. Equity futures slumped, and the dollar weakened.",
            "pubDate": "2026-01-19T03:00:22.971917"
        },
        {
            "title": "Wipro shares crash 9.5%, brokerages see downside till Rs 220. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-crash-9-5-brokerages-see-downside-till-rs-220-what-should-investors-do/articleshow/126667733.cms",
            "description": "Wipro shares dropped significantly following its third-quarter financial results. The IT firm provided a cautious growth forecast for the upcoming quarter. Global brokerage Jefferies has issued a low target price for Wipro stock. Analysts anticipate limited earnings growth for the company in the coming years. This outlook suggests potential adjustments in the stock's valuation.",
            "pubDate": "2026-01-19T04:15:23.321116"
        },
        {
            "title": "Buy, Sell, or Hold?  Citi retains ‘Buy’ on HDFC Bank and Reliance Industries post Q3 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-retains-buy-on-hdfc-bank-and-reliance-industries-post-q3-results/articleshow/126667785.cms",
            "description": "At the same time, Citi’s reaffirmed faith in Reliance Industries highlights the resilience of its diversified business portfolio, with near-term weakness in the retail segment viewed as temporary, given a robust balance sheet and steady progress in its new energy ventures.",
            "pubDate": "2026-01-19T04:15:23.321268"
        },
        {
            "title": "LTIMindtree among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ltimindtree-among-6-stocks-showing-bullish-rsi-upswing/slideshow/126667102.cms",
            "description": "On January 16, six stocks from the NSE large-cap universe appeared in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from below is considered an uptrend signal, reflecting strengthening momentum and growing bullish sentiment, which traders monitor to spot potential buying opportunities.",
            "pubDate": "2026-01-19T04:15:23.321387"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/126667627.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardised scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2026-01-19T04:15:23.321494"
        },
        {
            "title": "Retail algo trading is no longer a shortcut. It is becoming the new standard in India’s F&O markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-algo-trading-is-no-longer-a-shortcut-it-is-becoming-the-new-standard-in-indias-fo-markets/articleshow/126667698.cms",
            "description": "Retail algorithmic trading in India is rapidly becoming mainstream as SEBI’s 2025 framework brings structure, transparency, and safety. With regulated strategies, built-in risk controls, and faster execution, algos are reshaping how retail traders approach F&O markets.",
            "pubDate": "2026-01-19T04:15:23.321601"
        },
        {
            "title": "As FIIs pull out and drag India stock market returns, will billion-dollar SIP inflows crack?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-fiis-pull-out-and-drag-india-stock-market-returns-will-billion-dollar-sip-inflows-crack/articleshow/126667546.cms",
            "description": "Indian stock markets face headwinds as foreign investors divest, yet SIP inflows remain robust, hitting record highs. Despite market volatility and mid/small-cap corrections, disciplined SIP investors are benefiting from rupee-cost averaging. Experts believe domestic flows now provide a strong buffer against FII selling, ensuring market stability.",
            "pubDate": "2026-01-19T04:15:23.321705"
        },
        {
            "title": "Sensex falls 300 points, Nifty below 25,600 on fresh trade-war fears and mixed earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-300-points-nifty-below-25600-on-fresh-trade-war-fears-and-mixed-earnings/articleshow/126667539.cms",
            "description": "Indian equities opened lower on Monday, with both the Sensex and Nifty experiencing declines. This downturn was attributed to renewed concerns about escalating global trade tensions and a mixed performance in earnings reports from major companies. Investors adopted a cautious stance early in the trading session.",
            "pubDate": "2026-01-19T04:15:23.321839"
        },
        {
            "title": "Dixon, Kaynes, PG Electroplast shares crash up to 53%. Time to buy the fear?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-kaynes-pg-electroplast-shares-crash-up-to-53-time-to-buy-the-fear/articleshow/126667426.cms",
            "description": "Shares of Dixon, Kaynes, and PG Electroplast have fallen sharply. This correction follows a period of strong growth driven by government policies and global supply chain shifts. Investors are now evaluating if the current stock prices offer value. Experts hold differing views on whether the sector is undervalued. Upcoming earnings reports will be crucial for future performance.",
            "pubDate": "2026-01-19T04:15:23.321947"
        },
        {
            "title": "Yes Bank shares in focus after 55% YoY spike in Q3 profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-after-55-yoy-spike-in-q3-profit/articleshow/126667346.cms",
            "description": "Yes Bank shares: The bank posted a strong Q3FY26 performance, with standalone net profit rising 55% year-on-year to Rs 952 crore and up 45% sequentially. While interest income dipped marginally, net interest income grew 11% and margins improved to 2.6%, supported by lower interest expenses.",
            "pubDate": "2026-01-19T04:15:23.322049"
        },
        {
            "title": "Polycab shares in focus after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/polycab-shares-in-focus-after-q3-results-should-you-buy-sell-or-hold/articleshow/126667262.cms",
            "description": "Polycab India’s December-quarter results delivered strong revenue and profit growth but also exposed margin pressures from higher costs. While the stock fell ahead of the results, most brokerages remain bullish, citing robust volumes and structural demand tailwinds, even as a few flag margins as the key risk going forward.",
            "pubDate": "2026-01-19T04:15:23.322150"
        },
        {
            "title": "Jane Street India unit saw trading gains soar 494% before curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-india-unit-saw-trading-gains-soar-494-before-curbs/articleshow/126667211.cms",
            "description": "Jane Street Group’s India unit posted a sharp surge in trading gains in FY25, reporting nearly six-fold growth before regulatory curbs halted its operations over alleged market manipulation. Net trading gains rose to Rs 47 billion, while after-tax profit jumped 494% year-on-year, underscoring the scale of profits earned ahead of the regulator’s action.",
            "pubDate": "2026-01-19T04:15:23.322251"
        },
        {
            "title": "RIL shares slip 3% after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-after-q3-results-profit-rises-marginally-revenue-up-11/articleshow/126667159.cms",
            "description": "RIL share price: Reliance Industries shares dipped after the company reported a marginal 0.56% year-on-year rise in net profit to Rs 18,645 crore for the December quarter. Despite muted profit growth, revenue increased 11% YoY to Rs 2.69 lakh crore, driven by strong performance in Jio and O2C segments. Brokerages maintain a positive outlook, citing new energy initiatives and potential for recovery.",
            "pubDate": "2026-01-19T04:15:23.322356"
        },
        {
            "title": "RBL Bank shares in focus as Q3 net profit rockets 555% to Rs 214 crore. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-as-q3-net-profit-rockets-555-to-rs-214-crore-what-should-investors-do/articleshow/126666958.cms",
            "description": "RBL Bank reported a significant 555% surge in Q3FY26 net profit to Rs 214 crore, driven by strong other income despite higher provisions. Analysts maintain positive ratings, citing expected business growth and improving asset quality, though some note mixed outcomes from credit card slippages.",
            "pubDate": "2026-01-19T04:15:23.322462"
        },
        {
            "title": "ICICI Bank shares fall 3% after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-shares-in-focus-after-q3-results-should-you-buy-sell-or-hold/articleshow/126666806.cms",
            "description": "ICICI Bank share price: ICICI Bank’s Q3 FY26 earnings have put the stock in focus after a headline profit decline masked steady core performance. While one-off agri-related provisions weighed on net profit, stable margins, healthy loan growth and resilient asset quality have kept brokerages bullish, sharpening the debate on whether investors should buy, sell or hold the stock.",
            "pubDate": "2026-01-19T04:15:23.322568"
        },
        {
            "title": "HDFC Bank shares fall 1% after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-in-focus-as-q3-net-profit-jumps-11-to-rs-18654-crore-should-you-buy-sell-or-hold/articleshow/126666729.cms",
            "description": "HDFC Bank's net profit rose 11% in the December quarter, surpassing expectations. Analysts are positive, with several reiterating Buy ratings and setting target prices. The bank's performance was steady, with improving margins and loan growth momentum. Management expressed confidence in future outperformance. Asset quality remains strong. Investors can look forward to potential upside.",
            "pubDate": "2026-01-19T04:15:23.322671"
        },
        {
            "title": "Maruti Suzuki shares in focus after Rs 35,000-crore Gujarat plant investment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-shares-in-focus-after-rs-35000-crore-gujarat-plant-investment/articleshow/126666578.cms",
            "description": "Maruti Suzuki announced a significant Rs 35,000 crore investment to establish a new manufacturing facility in Gujarat, aiming for an annual production capacity of 10 lakh vehicles. This expansion is part of the company's strategy to boost overall manufacturing to 4 million units annually, meeting rising domestic and export demand.",
            "pubDate": "2026-01-19T04:15:23.322787"
        },
        {
            "title": "Tech Mahindra shares rally 4% after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-shares-rally-4-after-q3-results-should-you-buy-sell-or-hold/articleshow/126668166.cms",
            "description": "Tech Mahindra shares rose after the IT services firm reported strong Q3 results and its highest deal wins in five years, prompting brokerages to reassess the stock. While improving margins and a turnaround in the communications business have bolstered optimism, analysts remain divided on whether current valuations justify further upside.",
            "pubDate": "2026-01-19T05:02:49.833220"
        },
        {
            "title": "Bharat Coking Coal shares make blockbuster D-St debut, list at 97% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-coking-coal-shares-list-at-97-premium-over-ipo-price/articleshow/126668041.cms",
            "description": "Bharat Coking Coal share price: Bharat Coking Coal shares surged on their stock market debut, listing at a significant premium to their IPO price. The company's Rs 1,071 crore offer for sale, entirely from promoter Coal India, was heavily oversubscribed, indicating strong investor confidence in its dominant position in India's coking coal market.",
            "pubDate": "2026-01-19T05:02:49.833345"
        },
        {
            "title": "Tata Motors PV shares fall over 4%. What’s triggering the selloff?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-pv-shares-fall-over-4-snap-2-day-gaining-streak-whats-triggering-the-selloff/articleshow/126667912.cms",
            "description": "Tata Motors shares fell sharply after Donald Trump threatened new tariffs on European countries. This news impacted Jaguar Land Rover, which has substantial sales in the US. The company is already facing challenges from a cyberattack that disrupted production.  Despite these issues, higher-margin models are performing well.  The market is closely watching these developments.",
            "pubDate": "2026-01-19T05:02:49.833545"
        },
        {
            "title": "Why is stock market falling today? Sensex cracks over 600 points, Nifty below 25,550. 5 key factors behind today's sell-off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-falling-today-sensex-cracks-over-600-points-nifty-below-25550-5-key-factors-behind-todays-sell-off/articleshow/126668757.cms",
            "description": "Indian stock markets experienced a significant downturn on Monday.  Global trade war concerns resurfaced following U.S. President Donald Trump's tariff threats.  Domestically, disappointing earnings from major companies like Reliance Industries and ICICI Bank added to the selling pressure.  The market capitalization of BSE-listed firms saw a substantial decline.  Investors are advised to watch developments closely.",
            "pubDate": "2026-01-19T05:40:04.361053"
        },
        {
            "title": "IFCI shares surges 30% in 5 days on NSE IPO buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ifci-shares-surges-30-in-5-days-on-nse-ipo-buzz/articleshow/126669668.cms",
            "description": "The stock has seen notable swings in recent periods. While it has gained about 11% over the past year, its performance over the last three years has been far stronger, delivering a surge of more than 365% and highlighting robust long-term growth.",
            "pubDate": "2026-01-19T05:58:03.791553"
        },
        {
            "title": "Bharat Coking Coal shares fall 7% after stellar debut at 97% premium. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-coking-coal-shares-fall-7-after-stellar-debut-at-97-premium-should-you-buy-sell-or-hold/articleshow/126669608.cms",
            "description": "BCCL shares fell 7% after debuting at a 97% premium. Analysts suggest short-term profit booking but retain a long-term hold view due to Coal India backing, strategic importance in steel, and expected recovery in volumes and earnings from FY2027.",
            "pubDate": "2026-01-19T05:58:03.791688"
        },
        {
            "title": "Railways stocks: Will this budget put them back on track? 8 stocks from the railways ecosystem, some where analysts are bullish & bearish",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railways-stocks-will-this-budget-put-them-back-on-track-8-stocks-from-the-railways-ecosystem-some-where-analysts-are-bullish-bearish/articleshow/126669369.cms",
            "description": "Dalal Street often has typical cycles ahead of major events. Till a few years back, when a separate railway budget was presented, some railways-related stocks used to see a bullish build-up a few days before budget day. Then, on the day of the budget itself, they would see a spike – only to lose all the gains the very next day. And the cycle repeated the next year. This especially involved companies making anti-collision systems or laying railway tracks. Now that there is no separate budget, how will railways-related stocks behave?",
            "pubDate": "2026-01-19T05:58:03.791793"
        },
        {
            "title": "Bharat Coking Coal shares poised to deliver best listing day gains since December 2024. Too late to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-coking-coal-shares-poised-to-deliver-best-listing-day-gains-since-december-2024-too-late-to-buy/articleshow/126671496.cms",
            "description": "Bharat Coking Coal shares surged after a 97% premium debut and are set to post the strongest listing gains since December 2024. Analysts advise partial profit booking, while cautioning against chasing the stock amid expected post-listing volatility.",
            "pubDate": "2026-01-19T07:38:04.727064"
        },
        {
            "title": "South Korean shares hit record high as automakers rally on AI hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-shares-hit-record-high-as-automakers-rally-on-ai-hopes/articleshow/126672504.cms",
            "description": "South Korean shares rose more than 1% to a record high on Monday, led by ‌a rally ‌in automakers on optimism around artificial intelligence and robot technologies.",
            "pubDate": "2026-01-19T08:17:53.017519"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential up to 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-up-to-35/articleshow/126672024.cms",
            "description": "It may not appear to be directly related to the Indian stock market. But news that the EU may impose retaliatory tariffs on US imports if President Trump insists on a forceful takeover of Greenland will impact global industry. And if global industry feels pain, tremors will be felt across Indian industry as well. And the stock market will have to price in those developments. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2026-01-19T08:17:53.017636"
        }
    ]
}