{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-17T05:42:19.847545",
    "items": [
        {
            "title": "Samvardhana Motherson shares slip 4% as brokerages cut target price post Q3 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/samvardhana-motherson-shares-slip-4-as-brokerages-cut-target-price-post-q3-results/articleshow/118319693.cms",
            "description": "Samvardhana Motherson share price: Revenue from operations grew by nearly 8% year-on-year (YoY), reaching Rs 27,666 crore, up from Rs 25,644 crore in Q3 FY24. EBITDA increased to Rs 2,776 crore, while expenses rose 7% to Rs 26,559 crore. The company's net profit margin improved to 3.6%, compared to 2.5% a year earlier.",
            "pubDate": "2025-02-17T05:42:02.443643"
        },
        {
            "title": "2 Adani Group stocks among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2-adani-group-stocks-among-5-stocks-with-short-buildup/slideshow/118319645.cms",
            "description": "A short buildup occurs when open interest and trading volumes rise, accompanied by a decrease in the stock price in the Futures and Options segment. This suggests that traders are anticipating further price declines and are establishing short positions. In Monday's trading session, five stocks saw notable short positions. Here's the list:",
            "pubDate": "2025-02-17T05:42:02.443773"
        },
        {
            "title": "Kalyan Jewellers, Paytm among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-jewellers-paytm-among-5-stocks-with-long-buildup/slideshow/118319406.cms",
            "description": "A long buildup occurs when both open interest (OI) and trading volumes rise alongside an increase in the underlying stock price, signaling a bullish trend in the Futures and Options segment. In Monday's trading session, five stocks witnessed fresh long positions. Here's the list:",
            "pubDate": "2025-02-17T05:42:02.443886"
        },
        {
            "title": "These 4 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/118319000.cms",
            "description": "As of February 14, there was a notable surge in futures open interest for seven stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% compared to the previous trading session. A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-02-17T05:42:02.444100"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/118318556.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-02-17T05:42:02.444198"
        },
        {
            "title": "Stock Radar: Redington breaks out of inverse Head & Shoulder pattern in February; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-redington-breaks-out-of-inverse-head-shoulder-pattern-in-february-time-to-buy/articleshow/118251087.cms",
            "description": "The stock hit a high of Rs 237 on April 22, 2024, but lost momentum, finding support above 150 in October before rebounding. Its price action since April formed an inverse Head & Shoulders pattern on weekly charts, gaining strength after testing the 50-EMA in December. Last week, it broke out, reaching a record Rs 248 on February 14, 2025. This breakout signals a potential trend reversal from bearish to bullish, as the inverse Head & Shoulders pattern often marks the end of a downtrend.",
            "pubDate": "2025-02-17T05:42:02.444304"
        },
        {
            "title": "Stocks to buy today: Jefferies sees over 50% upside in Amber Enterprises; Citi maintains a buy on IGL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-jefferies-sees-over-50-upside-in-amber-enterprises-citi-maintains-a-buy-on-igl/articleshow/118318261.cms",
            "description": "Jefferies remains positive on Amber Enterprises, anticipating strong growth in the domestic air conditioner (AC) industry and an expanding electronics business, fueled by anti-dumping duties on PCBs.",
            "pubDate": "2025-02-17T05:42:02.444427"
        },
        {
            "title": "IPOs rescue investors in four months of market meltdown as big names struggle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipos-rescue-investors-in-four-months-of-market-meltdown-as-big-names-struggled/articleshow/118318086.cms",
            "description": "Over the past four months, nearly two-thirds of recent IPOs have maintained their value, despite a general market decline. Strong investor interest and confidence in the future potential of newly listed companies have helped them weather the downturn better than established stocks.",
            "pubDate": "2025-02-17T05:42:02.444538"
        },
        {
            "title": "Stocks to buy today: ITC, Bharti Airtel top 6 trading ideas for 17 February 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-itc-bharti-airtel-top-6-trading-ideas-for-17-february-2025/articleshow/118318032.cms",
            "description": "The Nifty50 formed a triple bottom around 22,780 on the daily scale, indicating strong support. However, the red candle on both the daily and weekly charts signals a lack of strength in the upside recovery, according to experts.",
            "pubDate": "2025-02-17T05:42:02.444641"
        },
        {
            "title": "RIL, M&M drag Sensex over 500 points lower; Nifty below 23,800",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-mm-drag-sensex-400-points-lower-nifty-below-23900/articleshow/118317845.cms",
            "description": "Indian benchmark indices were down for the ninth consecutive session, with the BSE Sensex dropping 299 points and the Nifty50 declining 74 points. Key index players like Reliance Industries and Infosys weighed the market, while sectors like Auto and IT also saw declines. Noteworthy losses were reported by Rail Vikas Nigam Ltd and Easy Trip Planners.",
            "pubDate": "2025-02-17T05:42:02.444738"
        },
        {
            "title": "Easy Trip Planners shares slide 5% as Q3 profit declines 26% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/easy-trip-planners-shares-in-focus-as-q3-profit-declines-26-yoy/articleshow/118317801.cms",
            "description": "Shares of Easy Trip Planners fell by 5% after reporting a 26.3% decline in net profit for Q3 FY25, down to Rs 33.6 crore. Revenue from operations declined by 6.5% to Rs 150.5 crore. Gross booking revenue saw strong growth, particularly in non-air segments and the Dubai market.",
            "pubDate": "2025-02-17T05:42:02.444834"
        },
        {
            "title": "These 3 stocks show RSI Trending Up on February 14",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-3-stocks-show-rsi-trending-up-on-february-14/slideshow/118317707.cms",
            "description": "On February 14, three stocks from the Nifty 500 pack appeared in the RSI Trending Up scan, according to data from stockedge.com. An uptrend signal occurs when the RSI value crosses above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are rising, indicating strengthening momentum in the stock price. This can signal potential upward movement and may help traders identify buying opportunities.",
            "pubDate": "2025-02-17T05:42:02.444929"
        },
        {
            "title": "Citi projects 46% upside for Indus Towers, cites positive growth outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citi-projects-46-upside-for-indus-towers-cites-positive-growth-outlook/articleshow/118317552.cms",
            "description": "Citi's positive outlook is based on several key factors. The brokerage expects Indus Towers to experience strong growth over the next 1-2 years, primarily driven by new network rollouts from major telecom operators like Vodafone Idea and Bharti Airtel.",
            "pubDate": "2025-02-17T05:42:02.445024"
        },
        {
            "title": "Positive Breakout: These 3 stocks crossed above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-3-stocks-crossed-above-their-200-dmas/slideshow/118317457.cms",
            "description": "In the Nifty200 pack, three stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on February 14, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-02-17T05:42:02.445118"
        },
        {
            "title": "Utkarsh SFB shares crack 14% after posting flat NII, net loss of Rs 168 crore in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/utkarsh-sfb-shares-in-focus-after-q3-nii-remains-flat-posts-net-loss-of-rs-168-cr/articleshow/118317285.cms",
            "description": "Utkarsh SFB share price: The lender also reported a net loss of Rs 168 crore for Q3FY25, a significant decline compared to the net profit of Rs 116 crore recorded in the same quarter last year.",
            "pubDate": "2025-02-17T05:42:02.445210"
        }
    ]
}