{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-08T11:42:44.653175",
    "items": [
        {
            "title": "Torrent Pharma Q2 PAT jumps 30% YoY to Rs 591 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/torrent-pharma-q2-pat-jumps-30-yoy-to-rs-591-crore/articleshow/125178686.cms",
            "description": "In a remarkable financial turn, Torrent Pharmaceuticals has disclosed a staggering 30% rise in after-tax profit for the September quarter, reaching ₹591 crore. This impressive growth is attributed to thriving sales in various markets, which escalated their total revenue to ₹3,302 crore.",
            "pubDate": "2025-11-08T06:48:58.628611"
        },
        {
            "title": "Signature Global Q2 Results: Net loss widens to Rs 47 crore, revenue drops",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/signature-global-q2-results-net-loss-widens-to-rs-47-crore-revenue-drops/articleshow/125180593.cms",
            "description": "Realty firm Signature Global posted a net loss of Rs 46.86 crore in the July-September period of FY26. This follows a net profit in the same period last year. Total income also saw a significant drop. For the first six months of the fiscal, the company reported a net loss of Rs 12.42 crore.",
            "pubDate": "2025-11-08T07:35:57.211379"
        },
        {
            "title": "JSW Cement Q2 Results: Co swings to Rs 75 crore profit on robust sales, volume growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-cement-q2-results-co-swings-to-rs-75-crore-profit-on-robust-sales-volume-growth/articleshow/125181046.cms",
            "description": "JSW Cement reported a profit of Rs 75.36 crore for the September quarter of FY26, a significant turnaround from a loss of Rs 75.82 crore in the same period last year. This improvement was driven by double-digit growth in sales volume, reaching 3.11 million tonnes. The company also reduced its net debt by Rs 1,335 crore following IPO proceeds.",
            "pubDate": "2025-11-08T08:59:06.565188"
        },
        {
            "title": "SBC Exports Q2 profit rises twofold to Rs 11 cr on new order wins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbc-exports-q2-profit-rises-twofold-to-rs-11-cr-on-new-order-wins/articleshow/125183600.cms",
            "description": "SBC Exports Ltd reported a significant profit jump in the September quarter of FY26. Profit after tax doubled to Rs 11.36 crore. This growth was driven by new order wins. Revenue also saw a substantial increase of 28.49 percent. The company secured several work orders and export contracts.",
            "pubDate": "2025-11-08T11:42:43.433525"
        }
    ]
}