{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-31T21:47:04.854969",
    "items": [
        {
            "title": "Tata Investment Q2 Results: Cons revenue jumps 15% YoY to Rs 142 crore. Net profit flat at Rs 124 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-investment-q2-results-cons-revenue-grows-15-yoy-to-rs-142-crore-net-profit-flat-at-rs-124-crore/articleshow/114818822.cms",
            "description": "Tata Investment Corporation reported a flat net profit of Rs 124 crore in Q2FY25. Total revenue stood at Rs 142.48 crore, up 15% YoY. Dividend income was Rs 102.14 crore, while interest income was down YoY and QoQ. The stock closed at Rs 6,890, up 1.74% on Thursday",
            "pubDate": "2024-10-31T21:47:02.030212"
        },
        {
            "title": "Q2 results today: Tata Investment among 7 companies to announce earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-tata-investment-among-7-companies-to-announce-earnings-on-thursday/articleshow/114799311.cms",
            "description": "Tata Investment, along with six other companies, is set to announce their July-September 2024 quarterly results today. Tata Investment had previously reported a strong performance in Q1FY25, with a 117% sequential increase in net profit. The company also delivered significant returns over the last year, outperforming broader market indices.",
            "pubDate": "2024-10-31T21:47:02.030342"
        },
        {
            "title": "Samsung posts weaker profit recovery as it misses out on AI boom",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/samsung-posts-weaker-profit-recovery-as-it-misses-out-on-ai-boom/articleshow/114799168.cms",
            "description": "Samsung Electronics reported a higher profit for the third quarter compared to last year, albeit with a slower recovery pace. The company faces challenges in monetizing the AI boom amid competition from TSMC and SK Hynix. Its chip division saw a decrease in profits, and the mobile devices business also experienced a dip in operating profit.",
            "pubDate": "2024-10-31T21:47:02.030442"
        },
        {
            "title": "Microsoft beats expectations, but AI concerns force shares down",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/microsoft-beats-expectations-but-ai-concerns-force-shares-down/articleshow/114799137.cms",
            "description": "Microsoft delivered solid quarterly results on Wednesday, beating analyst expectations with revenue jumping 16 percent to $65.6 billion, but questions were raised about the company's big spending on the AI boom. During the quarter, Microsoft also returned $9.0 billion to shareholders through dividends and share repurchases, helping pump up share value.",
            "pubDate": "2024-10-31T21:47:02.030540"
        },
        {
            "title": "Meta shows strong growth as AI spending surges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/meta-shows-strong-growth-as-ai-spending-surges/articleshow/114799099.cms",
            "description": "Facebook owner Meta saw net income and revenues top expectations on Wednesday as the company said it would expand investments into artificial intelligence, drawing nervousness from investors. Like its Big Tech peers, Meta is rushing into artificial intelligence as it tries to build revenue streams away from its social media core business.",
            "pubDate": "2024-10-31T21:47:02.030682"
        }
    ]
}