{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-21T06:47:40.146709",
    "items": [
        {
            "title": "At multi-year highs: These 3 stocks witnessed 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-3-stocks-witnessed-5-year-swing-high-breakouts/slideshow/114410843.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 10,000 crore, we have collated a list of three stocks that witnessed a 5-year swing high at the close on October 21, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2024-10-21T03:30:42.379216"
        },
        {
            "title": "JM Financial shares in spotlight after RBI lifts restrictions on co’s non-banking unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-shares-in-spotlight-after-rbi-lifts-restrictions-on-cos-non-banking-unit/articleshow/114410541.cms",
            "description": "Shares of JM Financial will be closely watched after the RBI lifted a ten-month ban on its subsidiary, JM Financial Products Ltd, allowing it to resume business activities tied to funding for shares and bonds following rectification of previous regulatory violations and governance issues.",
            "pubDate": "2024-10-21T03:30:42.379344"
        },
        {
            "title": "Kotak Bank shares in focus after Q2 profit rises 5% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-bank-shares-in-focus-after-q2-profit-rises-5-yoy/articleshow/114410057.cms",
            "description": "Kotak Mahindra Bank Share Price: The bank's net interest income (NII) for Q2FY25 increased 11% YoY to Rs 7,020 crore, from Rs 6,297 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-21T03:30:42.379449"
        },
        {
            "title": "Bajaj Housing Finance shares in focus ahead of Q2 results today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-finance-shares-in-focus-ahead-of-q2-results-today/articleshow/114410021.cms",
            "description": "Continuing a trend seen in the previous two quarters, the AUM grew by Rs 5,480 crore during the September quarter. The company’s loan assets stood at nearly Rs 89,860 crore at the end of the September quarter, up from Rs 70,954 crore the previous year.",
            "pubDate": "2024-10-21T03:30:42.379549"
        },
        {
            "title": "Reliance Infra shares in spotlight as Rs 6,000 crore fundraising plan gets shareholders' nod",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infra-shares-in-spotlight-as-rs-6000-crore-fundraising-plan-gets-shareholders-nod/articleshow/114409987.cms",
            "description": "Reliance Infrastructure's plan to raise Rs 6,000 crore by preferential share issue and QIP receives 98% shareholder approval. The fundraising includes Rs 3,014 crore from preferential allotment and Rs 3,000 crore via QIP, aiming to expand operations, invest in subsidiaries, and reduce debt.",
            "pubDate": "2024-10-21T03:30:42.379646"
        },
        {
            "title": "Tech Mahindra shares likely in focus after reporting 153% YoY jump in Q2 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-tech-mahindra-shares-likely-in-focus-after-reporting-153-yoy-jump-in-q2-pat/articleshow/114391565.cms",
            "description": "While announcing the quarterly numbers, the Mahindra Group company also declared an interim dividend of Rs 15 per equity share and fixed November 1 as the record date for determining eligibility of shareholders.",
            "pubDate": "2024-10-21T03:30:42.379747"
        },
        {
            "title": "Stock to watch: Kotak Bank shares likely to remain in focus after reporting Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-kotak-bank-shares-likely-to-remain-in-focus-after-reporting-q2-results/articleshow/114391651.cms",
            "description": "On a consolidated level, Kotak's PAT rose 13% YoY to Rs 5,044 crore. The total assets under management as of September-end were Rs 680,838 crore up 37% YoY over Rs 498,342 crore in Q2 of FY24.",
            "pubDate": "2024-10-21T03:30:42.379845"
        },
        {
            "title": "Jio Financial shares in focus on 3% YoY Q2 net profit jump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-shares-in-focus-on-3-yoy-q2-net-profit-jump/articleshow/114399910.cms",
            "description": "Jio Financial Share Price: Revenue from operations in the reported quarter stood at Rs 693.50 crore, up 14% over Rs 608.04 crore posted by the company in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-21T03:30:42.379939"
        },
        {
            "title": "Tata Consumer shares in focus after company's Q2 net profit beats Street's estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-consumer-shares-in-focus-after-companys-q2-net-profit-beats-streets-estimates/articleshow/114400040.cms",
            "description": "Tata Consumer Share Price: The revenue from operations in the reported quarter stood at Rs 4,214 crore, up 13% over Rs 3,734 crore posted by the company in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-21T03:30:42.380034"
        },
        {
            "title": "RBL Bank shares likely to remain in focus as Q2 PAT declines 24% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-rbl-bank-shares-likely-to-remain-in-focus-as-q2-pat-declines-24-yoy/articleshow/114391489.cms",
            "description": "On a half-yearly basis, RBL Bank’s net profit also witnessed an increase of 2% YoY to Rs 594 crore and the NIMs were reported at 5.35%.",
            "pubDate": "2024-10-21T03:30:42.380129"
        },
        {
            "title": "PG Electroplast shares in focus on Rs 1,500 crore fundraise plans via QIP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-pg-electroplast-shares-in-focus-on-rs-1500-crore-fundraise-plans-via-qip/articleshow/114391431.cms",
            "description": "PG Electroplast Share Price: The company has further informed that the board also approved the draft notice for an extra-ordinary general meeting (EGM) to seek shareholder approval for issuing the securities through a special resolution.",
            "pubDate": "2024-10-21T03:30:42.380218"
        },
        {
            "title": "Stock Radar | Orient Cement rallies 16% rally in a week; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-orient-cement-rallies-16-rally-in-a-week-time-to-buy/videoshow/114409659.cms",
            "description": "“Orient Cement stock has formed a Cup & Handle pattern on broader charts and once again caught up a renewed bullish momentum with a fresh breakout. Traders can buy for a target of Rs 390 in the next 5-6 weeks,” Shitij Gandhi, Senior Technical Analyst, SMC Global Securities, said.",
            "pubDate": "2024-10-21T03:30:42.380308"
        },
        {
            "title": "Big movers on D-Street: What should investors do with Jio Financial, Tata Consumer and ZEE?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-street-what-should-investors-do-with-jio-financial-tata-consumer-and-zee/articleshow/114409526.cms",
            "description": "Stocks that were in focus include names like Jio Financial, which rose 0.14%, Tata Consumer, which gained 0.6%, and ZEE, whose shares jumped 3.8% on Friday.",
            "pubDate": "2024-10-21T03:30:42.380393"
        },
        {
            "title": "GIFT Nifty up 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/114409208.cms",
            "description": "In the absence of any major triggers, market participants will focus on upcoming earnings for direction. In today's trade, shares of banking heavyweights HDFC Bank and Kotak Bank will be in focus following Q2 results.",
            "pubDate": "2024-10-21T03:30:42.380482"
        },
        {
            "title": "Stocks in news: Bajaj Housing, HDFC Bank, Kotak Bank, Jio Financial, Tata Consumer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-bajaj-housing-hdfc-bank-kotak-bank-jio-financial-tata-consumer/articleshow/114409166.cms",
            "description": "The private sector lender reported Q2 profit growth of 5% year-on-year (YoY) to Rs 16,821 crore, which was above Street estimates.",
            "pubDate": "2024-10-21T03:30:42.380566"
        },
        {
            "title": "Asian shares in tight range, gold at record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-in-tight-range-gold-at-record-high/articleshow/114409136.cms",
            "description": "Australian stocks gained, while Japanese equities slipped and Hong Kong equity futures signaled declines. US futures rose after the S&P 500 notched up a sixth straight weekly increase, its longest winning streak this year following a slew of corporate results and signs the world’s largest economy remains robust.",
            "pubDate": "2024-10-21T03:30:42.380691"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/114413146.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2024-10-21T04:44:54.012000"
        },
        {
            "title": "Oberoi Realty shares in focus as company achieves Rs 1,350 crore gross bookings for new project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oberoi-realty-shares-in-focus-as-company-achieves-rs-1350-crore-gross-bookings-for-new-project/articleshow/114413188.cms",
            "description": "The first phase of the development consists of 5 residential towers with expansive gardens and bookings for 2 towers, which commenced on 18 th October 2024.",
            "pubDate": "2024-10-21T04:44:54.012130"
        },
        {
            "title": "Bullish Momentum: 7 stocks with White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-7-stocks-with-white-marubozu-pattern/slideshow/114412568.cms",
            "description": "On October 18, seven stocks with market cap over Rs 1000 crore came to the bullish scanner of \"White Marubozu\", according tostockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2024-10-21T04:44:54.012233"
        },
        {
            "title": "Stock Radar: Hindalco breaks out from cup & handle pattern after 50% rally in a year; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-hindalco-breaks-out-from-cup-handle-pattern-after-50-rally-in-a-year-time-to-buy/articleshow/114391491.cms",
            "description": "Hindalco Industries has experienced over a 50% rally in the aluminum sector and has recently broken out from a 3-year Cup & Handle pattern. Experts suggest short-term buys for high-risk traders with targets of Rs 840, while maintaining a stop loss below Rs 680.",
            "pubDate": "2024-10-21T04:44:54.012335"
        },
        {
            "title": "Stocks to buy today: Vedanta, BEML among top 9 trading ideas for 21 October 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-vedanta-beml-among-top-9-trading-ideas-for-21-october-2024/articleshow/114413109.cms",
            "description": "On the options front, the maximum Call OI is placed at 26000 and then towards 25000 strikes while the maximum Put OI is placed at 24000 and then towards 24500 strikes",
            "pubDate": "2024-10-21T04:44:54.012442"
        },
        {
            "title": "F&O Radar: Deploy Bear Put Spread in Nifty for potential gains from bearish sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bear-put-spread-in-nifty-for-potential-gains-from-bearish-sentiment/articleshow/114413041.cms",
            "description": "Geopolitical tensions and weak earnings pressured Indian markets, with Nifty facing resistance at 25,100. A bearish sentiment suggests using a Bear Put Spread strategy for potential gains.",
            "pubDate": "2024-10-21T04:44:54.012540"
        },
        {
            "title": "Hot stocks: Brokerage view on HDFC Bank, RBL Bank, Tech Mahindra and IndiaMart",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerage-view-on-hdfc-bank-rbl-bank-tech-mahindra-and-indiamart/articleshow/114412867.cms",
            "description": "IIFL has an add rating on RBL Bank while Nuvama has downgraded IndiaMart to reduce, while also reducing its target price.",
            "pubDate": "2024-10-21T04:44:54.012639"
        },
        {
            "title": "HDFC Bank shares jump 3% on Q2 beat, IPO nod. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-jump-3-on-q2-beat-ipo-nod-should-you-buy-sell-or-hold/articleshow/114412623.cms",
            "description": "Shares of HDFC Bank rose 3% to Rs 1,734 on BSE after it reported a 5.3% YoY rise in PAT for Q2, surpassing Street estimates. The bank received board approval for the IPO of its NBFC subsidiary HDB Financial Services. Loan and deposit growth trends varied, with overall robust performance noted.",
            "pubDate": "2024-10-21T04:44:54.012733"
        },
        {
            "title": "$10 billion sale! FII selling breaks all records. Is it just about China?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-billion-sale-fii-selling-breaks-all-records-is-it-just-about-china/articleshow/114412636.cms",
            "description": "Foreign institutional investors have withdrawn nearly $10 billion from the Indian stock market in October, marking a record high. Contributing to this sell-off are concerns over China's economic stimuli, overvaluation of Indian equities, a tepid corporate earnings season, and a stronger dollar impacting emerging markets.",
            "pubDate": "2024-10-21T04:44:54.012832"
        },
        {
            "title": "Monday blues! Sensex down over 300 points, Nifty below 24,750; IT stocks drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/no-monday-blues-hdfc-bank-ril-lift-sensex-over-450-points-nifty-above-24950/articleshow/114412426.cms",
            "description": "Indian benchmark equity indices fell on Monday, led by drops in Kotak Mahindra Bank and IT stocks amid mixed global cues. The BSE Sensex decreased by 315 points, while the Nifty50 fell by 129 points. Early trade saw gains in HDFC Bank, Tech Mahindra, and Axis Bank.",
            "pubDate": "2024-10-21T04:44:54.012926"
        },
        {
            "title": "Positive Breakout: These 5 stocks close cross above their 200 DMA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-5-stocks-close-cross-above-their-200-dma/slideshow/114412290.cms",
            "description": "In the Nifty200 pack, five stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on October 18, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2024-10-21T04:44:54.013017"
        },
        {
            "title": "China cuts benchmark loan prime rates by 25 bps",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-cuts-benchmark-loan-prime-rates-by-25-bps/articleshow/114412047.cms",
            "description": "The one-year loan prime rate (LPR) was lowered by 25 basis points to 3.10 from 3.35%, while the five-year LPR was cut by the same margin to 3.6% from 3.85% previously.",
            "pubDate": "2024-10-21T04:44:54.013106"
        },
        {
            "title": "Diwali Technical Picks 2024: 7 stock recommendations for your portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-technical-picks-2024-7-stock-recommendations-for-your-portfolio/slideshow/114414458.cms",
            "description": "This Diwali, domestic brokerage firm Anand Rathi has selected a range of promising stocks that, based on technical parameters, show potential for solid returns over the next year. The list includes stocks like Tata Technologies, IRB Infra, Hindustan Zinc, and BEML. Here's a closer look at the picks:",
            "pubDate": "2024-10-21T05:36:24.613164"
        },
        {
            "title": "Tech Mahindra shares jump 4% after Q2 PAT jumps 153%. Here’s what brokerages say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-shares-jump-4-after-q2-pat-jumps-153-heres-what-brokerages-say/articleshow/114414248.cms",
            "description": "While announcing the quarterly numbers, the Mahindra Group company also declared an interim dividend of Rs 15 per equity share and fixed November 1 as the record date for determining eligibility of shareholders.",
            "pubDate": "2024-10-21T05:36:24.613290"
        },
        {
            "title": "Kotak Mahindra Bank shares fall over 4% as Q2 margins slip, NPAs rise. What brokerages say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-fall-over-4-as-q2-margins-slip-npas-rise-what-brokerages-say/articleshow/114414159.cms",
            "description": "Kotak Mahindra Bank shares fell over 4% as net interest margins declined and asset quality worsened. Brokerages cut earnings estimates and target prices, citing rising NPAs and slower growth.",
            "pubDate": "2024-10-21T05:36:24.613396"
        },
        {
            "title": "IndiaMart shares tumble 18% after Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indiamart-shares-tumble-18-after-q2-results-should-you-buy-sell-or-hold/articleshow/114414078.cms",
            "description": "The company also reported an 18% jump in its revenue on a year-on-year basis (YoY) at Rs 348 crore for the second quarter ended September 2024, which stood at Rs 295 crore in the same quarter of the previous fiscal year.",
            "pubDate": "2024-10-21T05:36:24.613499"
        },
        {
            "title": "GRSE stock rises 5% after securing defence contract of Rs 491 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grse-stock-rises-5-after-securing-defence-contract-of-rs-491-crore/articleshow/114413977.cms",
            "description": "Shares of Garden Reach Shipbuilders & Engineers Ltd (GRSE) climbed 5% to Rs 1,847 on the BSE during Monday's trading session, following the company's receipt of a Letter of Intent from the Naval Physical & Oceanographic Laboratory (NPOL), which is part of the Ministry of Defence’s DRDO.",
            "pubDate": "2024-10-21T05:36:24.613595"
        },
        {
            "title": "RBL Bank shares hit 10% lower circuit as Q2 PAT declines 24% YoY. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-hit-10-lower-circuit-as-q2-pat-declines-24-yoy-should-you-invest/articleshow/114413878.cms",
            "description": "Meanwhile, the bank also reported a 24% YoY growth in its operating profit to Rs 910 crore for the reporting period. On a half-yearly basis, RBL Bank’s net profit also witnessed an increase of 2% YoY to Rs 594 crore and the NIMs were reported at 5.35%.",
            "pubDate": "2024-10-21T05:36:24.613745"
        },
        {
            "title": "Hindustan Zinc shares in focus after Q2 profit jumps 35% YoY to Rs 2,327 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-after-q2-profit-jumps-35-yoy-to-rs-2327-crore/articleshow/114413386.cms",
            "description": "Hindustan Zinc's net profit rose 35% to ₹2,327 crore, driven by increased revenues. The company plans a 26% equity investment in Serentica Renewable and declared a ₹19 interim dividend.",
            "pubDate": "2024-10-21T05:36:24.613848"
        },
        {
            "title": "Technical picks: ICICI Bank, Wipro among 6 stocks poised for up to 10% gains in short term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-icici-bank-wipro-among-6-stocks-poised-for-up-to-10-gains-in-short-term/slideshow/114413502.cms",
            "description": "The Nifty50 and S&P BSE Sensex fell by 0.44% and 0.19%, respectively, last week, dragged by losses in auto, metal, and information technology stocks. Meanwhile, a number of analysts have identified several stocks with the potential to deliver up to 10% returns in the near term. Here are 6 technical picks:",
            "pubDate": "2024-10-21T05:36:24.614036"
        },
        {
            "title": "Manappuram Finance shares slide 17% in 2 days. What brokerages say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/manappuram-finance-shares-slide-17-in-2-days-what-brokerages-say/articleshow/114416708.cms",
            "description": "The restrictions will be effective from October 21, 2024 on four NBFCs Asirvad Micro Finance (a subsidiary of Manappuram Finance), Arohan Financial Services, DMI Finance, and Navi Finserv.",
            "pubDate": "2024-10-21T06:47:31.299748"
        },
        {
            "title": "Smallcap stock surges 10% after reporting 70% YoY jump in Q2 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stock-surges-10-after-reporting-70-yoy-jump-in-q2-pat/articleshow/114416261.cms",
            "description": "Shares of Netweb Technologies soared to a record Rs 2,949.65 on BSE, following a 69.7% YoY rise in PAT to Rs 25.7 crore for Q2FY24. The company also reported a 71% YoY income increase, a strong order book, and significant AI systems income growth.",
            "pubDate": "2024-10-21T06:47:31.299871"
        },
        {
            "title": "IndusInd Bank, BPCL among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-bpcl-among-5-stocks-with-short-buildup/slideshow/114416401.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of the underlying stock in the Futures and Options segment. This indicates that more traders are expecting the prices to decline and are creating short positions. In Monday's trading session, five stocks saw fresh short positions being built. Here's the list:",
            "pubDate": "2024-10-21T06:47:31.300016"
        },
        {
            "title": "Tech Mahindra, Oberoi Realty among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-oberoi-realty-among-5-stocks-with-long-buildup/slideshow/114416137.cms",
            "description": "A long buildup occurs when open interest and trading volumes increase alongside a rise in the underlying stock price in the Futures and Options segment, signaling a bullish market trend. In Monday's trading session, five stocks saw fresh long positions. Here’s the list:",
            "pubDate": "2024-10-21T06:47:31.300114"
        },
        {
            "title": "Bajaj Finance Q2 results preview: NII may jump by up to 28% YoY on loan growth, NIMs to decline sequentially",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-q2-results-preview-nii-may-jump-by-up-to-28-yoy-on-loan-growth-nims-to-decline-sequentially/articleshow/114415916.cms",
            "description": "Bajaj Finance is projected to report a net interest income of Rs 8,810-9,187 crore and profit after tax of Rs 4,030-6,083 crore for Q2FY25, reflecting significant year-on-year growth.",
            "pubDate": "2024-10-21T06:47:31.300217"
        },
        {
            "title": "Tejas Networks shares hit 20% upper circuit on robust Q2 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tejas-networks-shares-hit-20-upper-circuit-on-robust-q2-earnings/articleshow/114415742.cms",
            "description": "Tejas Networks shares surged 20% to Rs 1,427.55 on Monday after the company reported a return to profitability in Q2 FY25. The profit after tax (PAT) reached Rs 275 crore, compared to a net loss of Rs 13 crore last year. Consolidated revenue soared six-fold to Rs 2,811 crore, up from Rs 396 crore in the same quarter last year.",
            "pubDate": "2024-10-21T06:47:31.300317"
        },
        {
            "title": "Tata Consumer shares tanks nearly 10% as Q2 results disappoint. Brokerages slash target prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-consumer-shares-tanks-nearly-10-as-q2-results-disappoint-brokerages-slash-target-prices/articleshow/114415669.cms",
            "description": "Revenue from operations for the reported quarter stood at Rs 4,214 crore, up 13% from Rs 3,734 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-21T06:47:31.300415"
        },
        {
            "title": "Suraj Estate raises Rs 343 crore through preferential issue of equity, share warrants",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suraj-estate-raises-rs-343-crore-through-preferential-issue-of-equity-share-warrants/articleshow/114415512.cms",
            "description": "Suraj Estate Developers raised Rs 343 crores through equity shares and convertible warrants, targeting land acquisitions and working capital. The funds will enhance growth in residential and commercial real estate.",
            "pubDate": "2024-10-21T06:47:31.300506"
        }
    ]
}