{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-15T09:59:08.716911",
    "items": [
        {
            "title": "Q3 results today: HDFC Life, Jio Financial among 27 companies to report earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-hdfc-life-jio-financial-among-27-companies-to-report-earnings-on-thursday/articleshow/126537262.cms",
            "description": "Thursday brings Q3 earnings for 27 companies. Investors will focus on HDFC Life Insurance, Angel One, and Jio Financial Services. Key metrics to watch include demand conditions, margins, and future outlook. Brokerages anticipate steady growth for HDFC Life, while Angel One may see a mixed quarter due to regulatory shifts.",
            "pubDate": "2026-01-15T03:10:24.280108"
        },
        {
            "title": "Lower rates to weigh on large housing finance companies in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lower-rates-to-weigh-on-large-housing-finance-companies-in-q3/articleshow/126536502.cms",
            "description": "Housing finance companies face a challenging December quarter with slower growth and squeezed margins due to aggressive bank competition. While large firms grapple with lower rates, affordable housing lenders are expected to maintain profitability by keeping their lending rates steady. Analysts anticipate stable asset quality despite some localized stress.",
            "pubDate": "2026-01-15T03:10:24.280230"
        },
        {
            "title": "Anand Rathi Share Q3 net profit up over 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/anand-rathi-share-q3-net-profit-up-over-32/articleshow/126536429.cms",
            "description": "Anand Rathi Share and Stock Brokers reported strong financial results for the December quarter. The company's net profit surged by 32.6% compared to the previous quarter and an impressive 71.8% year-on-year. Operating revenue also saw a healthy increase of 9.2% sequentially and 21.5% from the same period last year. These figures highlight robust growth for the brokerage firm.",
            "pubDate": "2026-01-15T03:10:24.280359"
        },
        {
            "title": "Large deal wins power Infosys Q3 performance; labour code impact weighs on margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/large-deal-wins-power-infosys-q3-performance-labour-code-impact-weighs-on-margins/articleshow/126536320.cms",
            "description": "Infosys secured significant large deals in the December quarter, exceeding revenue expectations.  A one-time impact from labor code changes affected profits. The company also increased its FY26 revenue growth forecast.  This follows positive results from peers like TCS and HCL Tech.  Clients are adopting new AI technology platforms.  Infosys saw its headcount rise and attrition rates fall.",
            "pubDate": "2026-01-15T03:10:24.280461"
        },
        {
            "title": "Wipro Q3 Preview: Revenue may rise 4% YoY; margins under pressure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q3-preview-revenue-may-rise-4-yoy-margins-under-pressure/articleshow/126539218.cms",
            "description": "Wipro is expected to post muted Q3 performance, with revenue rising about 4% YoY and margins remaining under pressure due to furloughs, deal ramp-up costs and acquisition integration. Brokerages see flat profit growth and limited sequential momentum, while Q4 guidance and large deal conversions will be key investor focus areas.",
            "pubDate": "2026-01-15T06:55:46.841105"
        },
        {
            "title": "RIL Q3 Preview: Strong O2C, Jio to aid revenue growth; retail growth seen lagging",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q3-preview-strong-o2c-jio-to-aid-revenue-growth-retail-growth-seen-lagging/articleshow/126541446.cms",
            "description": "Reliance Industries is expected to report steady Q3 growth, driven by strong oil-to-chemicals margins and robust Jio performance, while retail and upstream oil & gas segments remain under pressure. Brokerages project mid-single digit revenue and profit growth, with digital and O2C earnings offsetting softer performance in other segments.",
            "pubDate": "2026-01-15T09:59:07.998387"
        }
    ]
}