{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-22T17:55:49.158037",
    "items": [
        {
            "title": "Drug companies set for improved revenue growth in June quarter amid US market challenges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/drug-companies-set-for-improved-revenue-growth-in-june-quarter-amid-us-market-challenges/articleshow/122824606.cms",
            "description": "Indian pharma and healthcare companies anticipate improved revenue and profit in the June 2025 quarter, fueled by domestic market growth. However, US pricing pressure, particularly for Revlimid generics, may impact some firms. Hospital chains are poised for better performance due to increased operational beds, while individual companies like Lupin expect strong US growth and margin expansion.",
            "pubDate": "2025-07-22T04:50:18.907555"
        },
        {
            "title": "Havells Q1 standalone profit dips 14% to Rs 352 crore on weak AC sales; cables, switchgears shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/havells-q1-standalone-profit-dips-14-to-rs-352-crore-on-weak-ac-sales-cables-switchgears-shine/articleshow/122818920.cms",
            "description": "Havells India reported a 14% YoY drop in Q1 net profit at Rs 352 crore, with net sales down 6% due to a weak summer hitting AC, fan, and cooler sales. However, its cables and switchgear segments posted strong growth, partly offsetting losses from the Lloyd appliance segment.",
            "pubDate": "2025-07-22T04:50:18.907704"
        },
        {
            "title": "PNB Housing Q1 profit jumps 23% to Rs 534 crore on loan growth, NIM boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnb-housing-q1-profit-jumps-23-to-rs-534-crore-on-loan-growth-nim-boost/articleshow/122818857.cms",
            "description": "PNB Housing Finance posted a 23% YoY rise in Q1 net profit at Rs 534 crore, aided by strong loan growth, improved NIM of 3.74%, and better asset quality. Gross NPAs fell to 1.06%, and retail disbursements in affordable and emerging segments surged, contributing 50% of total.",
            "pubDate": "2025-07-22T04:50:18.907819"
        },
        {
            "title": "Dhanlaxmi Bank Q1 profit at Rs 12 crore despite higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dhanlaxmi-bank-q1-profit-at-rs-12-crore-despite-higher-provisions/articleshow/122818535.cms",
            "description": "Dhanlaxmi Bank posted a Q1 FY26 net profit of Rs 12.18 crore versus a Rs 8 crore loss a year ago. This turnaround came despite a spike in provisions. Asset quality improved, with gross NPAs falling to 3.22%, and total income rose to Rs 407 crore from Rs 338 crore last year.",
            "pubDate": "2025-07-22T04:50:18.907920"
        },
        {
            "title": "Choice International Q1 Results: Profit jumps 50% to Rs 48 crore, revenue up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/choice-international-q1-results-profit-jumps-50-to-rs-48-crore-revenue-up-16/articleshow/122818255.cms",
            "description": "Financial services company Choice International on Monday reported a 50 per cent rise in its consolidated profit after tax to Rs 47.96 crore for the quarter ended on June 30, 2025, driven by broad-based growth across its business verticals and operational efficiency.",
            "pubDate": "2025-07-22T04:50:18.908021"
        },
        {
            "title": "UCO Bank Q1 profit rises 10% to Rs 607 crore; NIM guidance revised",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/uco-bank-q1-profit-rises-10-to-rs-607-crore-nim-guidance-revised/articleshow/122817689.cms",
            "description": "UCO Bank posted a 10% YoY rise in Q1FY26 net profit at Rs 607 crore, aided by strong treasury gains. Despite higher provisions and lower NIM, gross advances grew 16.48% while deposits rose 11.37% YoY.",
            "pubDate": "2025-07-22T04:50:18.908120"
        },
        {
            "title": "Uco Bank Q1 Results: PAT jumps 10% YoY to Rs 607 crore, NII up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/uco-bank-q1-results-pat-jumps-10-yoy-to-rs-607-crore-nii-up-7/articleshow/122816409.cms",
            "description": "Uco Bank reported a 10% YoY increase in standalone net profit, reaching Rs 607 crore in Q1FY26, while net interest income rose by 7% to Rs 2,403 crore. Despite positive YoY growth, PAT experienced a 7% sequential decline compared to Q4FY25.",
            "pubDate": "2025-07-22T04:50:18.908214"
        },
        {
            "title": "Eternal Q1 Results: Zomato parent reports 90% YoY profit fall despite 70% revenue jump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-q1-results-pat-plunges-90-yoy-to-rs-25-crore-revenue-surges-70/articleshow/122812552.cms",
            "description": "Eternal Q1 Results FY26: Zomato's parent company reported a significant 90% YoY drop in net profit for Q1FY26, landing at Rs 25 crore. Despite this dip, revenue surged 70% to Rs 7,167 crore. The profit decline stems from ongoing investments in quick commerce and going-out ventures. However, Zomato shares jumped over 7% following the earnings announcement.",
            "pubDate": "2025-07-22T04:50:18.908309"
        },
        {
            "title": "IDBI Bank Q1 Results: Standalone profit jumps 17% YoY to Rs 2,007 cr, NII drops 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idbi-bank-q1-results-standalone-profit-jumps-17-yoy-to-rs-2007-crore-interest-income-up-5/articleshow/122811521.cms",
            "description": "IDBI Bank announced a 17% year-on-year increase in its standalone net profit for Q1FY26, reaching Rs 2,007 crore compared to Rs 1,719 crore in the same period last year. The private lender's Net Interest Income (NII) for Q1FY26 stood at Rs 3,166 crore, slightly lower than the Rs 3,233 crore reported in Q1FY25, marking a 2% decrease.",
            "pubDate": "2025-07-22T04:50:18.908399"
        },
        {
            "title": "UltraTech Cement Q1 Results: Cons PAT surges 49% YoY to Rs 2,226 crore, revenue jumps 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-q1-results-cons-pat-surges-49-yoy-to-rs-2226-crore-revenue-jumps-13/articleshow/122811028.cms",
            "description": "UltraTech Cement Q1 Results: The Aditya Birla Group company's revenue stood at Rs 21,275 crore, up 13% from Rs 18,818 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-07-22T04:50:18.908497"
        },
        {
            "title": "Dixon sees margin boost in FY26, bets big on camera and display units",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dixon-sees-margin-boost-in-fy26-bets-big-on-camera-and-display-units/articleshow/122841196.cms",
            "description": "Dixon Technologies expects its operating margins to improve by 120-130 basis points in FY26 and go up even higher in FY27 after a full ramp-up of its new component business, with management expecting to more than compensate for the loss in PLI sops after the scheme ends next year.",
            "pubDate": "2025-07-22T17:55:31.260591"
        },
        {
            "title": "Dalmia Bharat’s profit surges nearly 3 times on improved pricing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dalmia-bharats-profit-surges-nearly-3-times-on-improved-pricing/articleshow/122841112.cms",
            "description": "Dalmia Bharat’s consolidated net profit surged nearly three times on year in the June quarter to Rs 345 crore, helped by an improvement in net sales realisations, which offset the impact of lower sales volumes.",
            "pubDate": "2025-07-22T17:55:31.260706"
        },
        {
            "title": "Mahindra Finance Q1 Results: Net profit rises 6% to Rs 529 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mahindra-finance-q1-results-net-profit-rises-6-to-rs-529-crore/articleshow/122840307.cms",
            "description": "Mahindra Finance on Tuesday reported a 6 per cent increase in consolidated net profit to Rs 529 crore in the June quarter.",
            "pubDate": "2025-07-22T17:55:31.260807"
        },
        {
            "title": "Dalmia Bharat Q1 Results: Net profit rises 3-fold to Rs 395 crore, revenue flat at Rs 3,636 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dalmia-bharat-q1-results-net-profit-rises-3-fold-to-rs-395-crore-revenue-flat-at-rs-3636-crore/articleshow/122840131.cms",
            "description": "Cement maker Dalmia Bharat Ltd on Tuesday reported a nearly three-fold increase in its consolidated net profit of Rs 395 crore in the June quarter, mainly helped by improved sales realisation and reduction in expenses.",
            "pubDate": "2025-07-22T17:55:31.260902"
        },
        {
            "title": "IRFC Q1 Results: PAT rises 11% YoY to Rs 1,746 crore; co hits highs in quarterly profit, income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irfc-q1-results-pat-rises-11-yoy-to-rs-1746-crore-co-hits-highs-in-quarterly-profit-income/articleshow/122839933.cms",
            "description": "Aluminium prices are climbing steadily, supported by US tariffs on Mexican imports, restricted Chinese output, and rising European demand. MCX futures and global contracts show bullish momentum, with technical indicators confirming sustained upward trends in the metal’s pricing.",
            "pubDate": "2025-07-22T17:55:31.261123"
        },
        {
            "title": "Schloss Bangalore reports revenues of Rs 275 crore for Q1FY26, PAT at Rs 9 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/schloss-bangalore-reports-revenues-of-rs-275-crore-for-q1fy26-pat-at-rs-9-crore/articleshow/122839669.cms",
            "description": "Schloss Bangalore, operator of The Leela Palaces Hotels and Resorts has reported consolidated revenue from operations of Rs 275 crore for the quarter ended June, up 21% year on year. The chain posted a profit of Rs 9 crore for the quarter compared to a loss of Rs 75.4 crore in the corresponding period of the previous fiscal.",
            "pubDate": "2025-07-22T17:55:31.261241"
        },
        {
            "title": "Schloss Bangalore Q1 results: Leela Palace operator reports Rs 9 crore PAT vs Rs 75 crore YoY loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/schloss-bangalore-q1-results-leela-palace-operator-reports-rs-9-crore-pat-vs-rs-75-crore-yoy-loss/articleshow/122838262.cms",
            "description": "Schloss Bangalore, operator of The Leela Hotels, posted a Rs 9 crore Q1 profit versus a Rs 75 crore loss last year. Revenue rose 20% YoY to Rs 275 crore, with strong EBITDA growth and margin expansion driven by luxury demand and operational efficiency.",
            "pubDate": "2025-07-22T17:55:31.261343"
        },
        {
            "title": "UltraTech Q1 net profit jumps 49% on higher sales, meets D-Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-q1-net-profit-jumps-49-on-higher-sales-meets-d-street-estimates/articleshow/122837786.cms",
            "description": "UltraTech Cement may consider merging India Cements by 2027 or 2028 after operational turnaround and cost assessment. The focus is on aligning processes, improving EBITDA, and integrating operations before any merger decision is finalized.",
            "pubDate": "2025-07-22T17:55:31.261438"
        },
        {
            "title": "Dixon Technologies Q1 Results: Net profit doubles YoY to Rs 280 crore; revenue soars 95%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dixon-technologies-q1-results-net-profit-soars-100-yoy-to-rs-280-crore-revenue-up-95-yoy/articleshow/122836022.cms",
            "description": "Dixon Technologies reported a consolidated net profit of Rs 280.02 crore for Q1 ended June 2025, a 100% YoY surge. Revenue from operations rose 95% YoY to Rs 12,835.66 crore, while EBITDA increased by 89% to Rs 484 crore. The company's net debt increased to Rs 214 crore, and its PAT margin improved slightly to 2.2%.",
            "pubDate": "2025-07-22T17:55:31.261531"
        },
        {
            "title": "Dr Reddy’s Q1 Results Preview: PAT may grow up to 15% YoY, revenue to surge up to 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-q1-results-preview-pat-may-grow-up-to-15-yoy-revenue-to-surge-up-to-19/articleshow/122835637.cms",
            "description": "Dr Reddy’s Q1FY26 earnings are expected to show steady revenue growth and resilient domestic demand, with mixed profit estimates ranging from a 2% decline to 15% growth. US performance may be tempered by lower Revlimid sales, while domestic strength continues to support margins.",
            "pubDate": "2025-07-22T17:55:31.261625"
        },
        {
            "title": "Paytm Q1 Results: Co swings to black, logs Rs 122 crore profit vs YoY loss; revenue jumps 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/paytm-q1-results-co-swing-to-profit-at-rs-122-crore-vs-yoy-loss-revenue-jumps-28/articleshow/122835189.cms",
            "description": "Paytm Q1 Results: Paytm's parent company, One 97 Communications, reported a profit in the first quarter of fiscal year 2026. The company's net gain was Rs 122.5 crore. Revenue from operations increased by 28% to Rs 1,917 crore.",
            "pubDate": "2025-07-22T17:55:31.261716"
        },
        {
            "title": "DCM Shriram Q1 Results: Profit jumps 13% to Rs 114 cr, revenue rises to Rs 3,477 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dcm-shriram-q1-results-profit-jumps-13-to-rs-114-cr-revenue-rises-to-rs-3477-cr/articleshow/122833319.cms",
            "description": "DCM Shriram Limited announced a 13 percent rise in net profit for the June quarter. The company's total income also increased significantly. However, a retrospective duty on ethanol exports impacted earnings. Ajay Shriram and Vikram Shriram expressed concerns about sugar policy. The company is also expanding into advanced materials with an acquisition.",
            "pubDate": "2025-07-22T17:55:31.261808"
        },
        {
            "title": "ZEE Q1 Results: Cons PAT jumps 22% YoY to Rs 144 crore, but revenue falls 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zee-q1-results-cons-pat-jumps-22-yoy-to-rs-144-crore-but-revenue-falls-14/articleshow/122833080.cms",
            "description": "ZEE Q1 Results: However, the company’s revenue from operations declined 14% to Rs 1,825 crore, down from Rs 2,130 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-07-22T17:55:31.261898"
        },
        {
            "title": "Colgate-Palmolive Q1 Results: Profit dips 12% on rising competition, tepid urban demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/colgate-palmolive-q1-results-profit-dips-12-on-rising-competition-tepid-urban-demand/articleshow/122833103.cms",
            "description": "Colgate Palmolive India reported a decline in first-quarter profit on Tuesday, as feeble urban demand and intensified competition in its core oral care business weighed on sales.",
            "pubDate": "2025-07-22T17:55:31.261989"
        },
        {
            "title": "Parag Milk Foods Q1 Results: Profit flat at Rs 27.58 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/parag-milk-foods-q1-results-profit-flat-at-rs-27-58-crore/articleshow/122833002.cms",
            "description": "Parag Milk Foods Ltd has reported a flat consolidated net profit at Rs 27.58 crore for the quarter ended June.",
            "pubDate": "2025-07-22T17:55:31.262080"
        },
        {
            "title": "Infosys Q1 earnings preview: Brokerages expect strong show with up to 10% profit growth, stable margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q1-earnings-preview-brokerages-expect-strong-show-with-up-to-10-profit-growth-stable-margins/articleshow/122832260.cms",
            "description": "Infosys is set to report a seasonally strong Q1 on July 23, with net profit expected to rise 7–10% YoY and revenue by 6–7%. While deal momentum and acquisitions aid growth, analysts flag margin pressures. Key metrics, guidance, and commentary on BFSI demand will be closely watched.",
            "pubDate": "2025-07-22T17:55:31.262172"
        }
    ]
}