{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-01T04:42:33.259594",
    "items": [
        {
            "title": "HUL shares rally 8% as brokerages raise target prices after Q1 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-rally-8-as-brokerages-raise-target-prices-after-q1-results-should-you-buy-sell-or-hold/articleshow/123034895.cms",
            "description": "Hindustan Unilever's shares surged following a seven-quarter high revenue growth of 5% in Q1 FY26, prompting brokerages to raise target prices. The company's net profit rose 7.6% YoY, with analysts citing improved macro conditions and strategic interventions by the new CEO as drivers for future growth and margin recovery. Brokerages largely recommend holding or accumulating the stock.",
            "pubDate": "2025-08-01T04:42:20.372467"
        },
        {
            "title": "Reliance Power, Reliance Infrastructure shares fall up to nearly 5% as ED summons Anil Ambani in Rs 17,000 cr loan fraud probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-reliance-infrastructure-shares-fall-up-to-nearly-5-as-ed-summons-anil-ambani-in-rs-17000-cr-loan-fraud-probe/articleshow/123034545.cms",
            "description": "Reliance Power and Reliance Infrastructure shares declined following the Enforcement Directorate's summons to Anil Ambani over an alleged Rs 17,000-crore loan fraud. The ED's investigation involves searches at multiple locations and focuses on suspected fund diversions. SEBI has also submitted findings on Reliance Infrastructure's dealings with CLE Pvt Ltd, alleging disclosure violations and related-party transaction breaches.",
            "pubDate": "2025-08-01T04:42:20.372609"
        },
        {
            "title": "These 7 stocks closed crossing above VWAP on July 31",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-stocks-closed-crossing-above-vwap-on-july-31/slideshow/123034399.cms",
            "description": "The closing prices of seven stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on July 31, according to stockedge.com's technical scan data. A shift above the VWAP is seen as a potential bullish trend.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-01T04:42:20.372719"
        },
        {
            "title": "TACO trade or duck for cover? How Sensex, Nifty traders should play Trump tariff tantrum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/taco-trade-or-duck-for-cover-how-sensex-nifty-traders-should-play-trump-tariff-tantrum/articleshow/123034447.cms",
            "description": "Following Trump's tariff announcement, Indian traders are divided. Some are betting on Trump softening his stance, while others fear the impact on India's safe haven status. Experts suggest key sectors like IT, consumption, and financials remain strong. However, concerns linger about potential capital outflows and the impact on specific sectors like pharma and auto ancillaries.",
            "pubDate": "2025-08-01T04:42:20.372828"
        },
        {
            "title": "Sensex falls over 150 pts, Nifty below 24,750 as Trump tariffs keep investors on edge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-250-pts-nifty-below-24750-as-trump-tariffs-keep-investors-on-edge/articleshow/123034194.cms",
            "description": "Indian benchmark indices Sensex and Nifty50 opened lower on Friday following the U.S. imposition of steep tariffs on several trading partners, including reaffirming a 25% duty on imports from India. Investors viewed the tariff announcement as a pressure tactic and remained hopeful for resolution through ongoing negotiations. Sun Pharma dropped nearly 5% after reporting a decline in consolidated net profit.",
            "pubDate": "2025-08-01T04:42:20.372936"
        },
        {
            "title": "Negative Breakout: 5 stocks crossed below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-5-stocks-crossed-below-their-200-dmas/slideshow/123034323.cms",
            "description": "In the Nifty200 pack, five stocks closed below their 200-day moving average (200 DMA) on July 31, according to technical scan data from StockEdge.com.Trading below the 200 DMA is considered a bearish signal, as it suggests the stock has moved below its long-term trend line. The 200 DMA is widely used by traders to gauge the overall directional trend of a stock. Here’s the list:",
            "pubDate": "2025-08-01T04:42:20.373039"
        },
        {
            "title": "Maruti Suzuki shares in focus after Q1 beat estimates. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-shares-in-focus-after-q1-beat-estimates-should-you-buy-sell-or-hold/articleshow/123034112.cms",
            "description": "Maruti Suzuki posted a marginal 0.9% YoY rise in consolidated net profit to Rs 3,792 crore for Q1FY26, with revenue growing 8% to Rs 38,605 crore. On a standalone basis, profit and revenue beat ET NOW estimates, while EBITDA came in higher at Rs 3,996 crore. The performance reflects resilience despite cost pressures and modest top-line growth.",
            "pubDate": "2025-08-01T04:42:20.373144"
        },
        {
            "title": "Eicher Motors shares jump 3% after Q1 PAT rises 9% YoY. Should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eicher-motors-shares-in-focus-after-q1-pat-rises-9-yoy-should-you-buy/articleshow/123034083.cms",
            "description": "Eicher Motors reported a 9% YoY rise in Q1FY26 net profit to Rs 1,205 crore, with revenue up 15% to Rs 5,042 crore, driven by strong Royal Enfield sales. However, sequential numbers declined. Avendus raised its target price to Rs 5,850, citing steady growth strategy and rising EBITDA per vehicle. Margins are projected to stabilise around 25.5% by FY27.",
            "pubDate": "2025-08-01T04:42:20.373249"
        },
        {
            "title": "PB Fintech shares slip 2% after reporting Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pb-fintech-shares-in-focus-after-q1-profit-surges-41-yoy-to-rs-85-crore/articleshow/123033998.cms",
            "description": "PB Fintech's shares experienced a dip despite reporting a strong Q1FY26 performance, with a 41% YoY rise in consolidated net profit to Rs 85 crore and a 33% jump in operating revenue to Rs 1,348 crore. The company's insurance premium and renewal revenue witnessed substantial growth, while the credit business showed improvement.",
            "pubDate": "2025-08-01T04:42:20.373565"
        },
        {
            "title": "5 stocks show RSI trending up on July 31",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-stocks-show-rsi-trending-up-on-july-31/slideshow/123033913.cms",
            "description": "On July 31, five stocks from the Nifty500 pack were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. An RSI trending up signal is generated when the Relative Strength Index (RSI) crosses above 50 from below, indicating a potential uptrend. Rising RSI values suggest strengthening momentum in a stock’s price and may point to possible buying opportunities for traders.",
            "pubDate": "2025-08-01T04:42:20.373761"
        },
        {
            "title": "Alkyl Amines Chemicals, Hyundai Motor among 8 stocks with White Marubozu Pattern on July 31",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alkyl-amines-chemicals-hyundai-motor-among-8-stocks-with-white-marubozu-pattern-on-july-31/slideshow/123033766.cms",
            "description": "Eight stocks from the NSE list of stocks with a market cap over Rs 10,000 crore came to the bullish scanner of \"White Marubozu\" on July 31, according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-08-01T04:42:20.373951"
        },
        {
            "title": "GE Vernova, Fortis Healthcare among 5 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ge-vernova-fortis-healthcare-among-5-stocks-witness-5-year-swing-high-breakout/slideshow/123033495.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, seven stocks witnessed a 5-year swing high at the close on July 31, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-08-01T04:42:20.374047"
        }
    ]
}