{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-13T01:41:29.227115",
    "items": [
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126494969.cms",
            "description": "Indian equity benchmarks rebounded from Monday's lows, closing in positive territory. Analysts anticipate a sideways market with stock-specific movements as the earnings season commences. The Nifty faces resistance around 26000-26100, with support at 25650, while India VIX saw a 4% increase.",
            "pubDate": "2026-01-13T01:41:19.109729"
        },
        {
            "title": "Stocks in news: TCS, HCL Tech, Ola Electric, RIL, Just Dial",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-hcl-tech-ola-electric-ril-just-dial/articleshow/126494943.cms",
            "description": "Markets closed positively despite volatility, with IT majors TCS and HCL Tech reporting profit declines in their December quarter results. Ola Electric launched its first battery energy storage system, Shakti, while Indian Hotels secured trademark registration for the 'Taj' sonic sound. L&T will fully acquire L&T Sapura Shipping, and Reliance Industries confirmed its battery storage manufacturing plans remain on track.",
            "pubDate": "2026-01-13T01:41:19.109860"
        },
        {
            "title": "Asian shares rise on valuations, dollar declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-rise-on-valuations-dollar-declines/articleshow/126494912.cms",
            "description": "Asian shares surged to near record highs, outperforming the S&P 500 as investors shifted focus beyond US markets due to cheaper valuations and unpredictable US foreign policy. Concerns over the Federal Reserve's independence and upcoming US inflation data present key risks this week.",
            "pubDate": "2026-01-13T01:41:19.109990"
        },
        {
            "title": "Domestic markets bounce back after US ambassador calms trade jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/domestic-markets-bounce-back-after-us-ambassador-calms-trade-jitters/articleshow/126494860.cms",
            "description": "Indian stock markets bounced back on Monday, ending a five-day decline. This recovery followed assurances from the US ambassador regarding upcoming trade discussions. Markets had previously fallen due to concerns over potential US tariffs. The Nifty and Sensex both saw gains, recovering from earlier lows. Analysts suggest ongoing trade talks and the upcoming budget will influence market direction.",
            "pubDate": "2026-01-13T01:41:19.110099"
        },
        {
            "title": "Bajaj Housing raises Rs 509 crore via NCDs at 7.10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-raises-rs-509-crore-via-ncds-at-7-10/articleshow/126494762.cms",
            "description": "Bajaj Housing Finance has successfully raised ₹509 crore through non-convertible debentures. This move follows a period of strong business growth for the company. Their assets under management saw a significant increase of 23% year-on-year. The mortgage lender also reported a substantial rise in disbursements during the third quarter, indicating robust performance and expansion in their operations.",
            "pubDate": "2026-01-13T01:41:19.110204"
        },
        {
            "title": "NSE shares surge after IPO clouds seem to clear",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-shares-surge-after-ipo-clouds-seem-to-clear/articleshow/126494736.cms",
            "description": "National Stock Exchange shares climbed past ₹2,000. This surge followed SEBI chief's comments on an upcoming IPO clearance. Investor interest has rekindled. NSE shares saw increased demand and trading volumes. The exchange's IPO is expected soon. This development has boosted sentiment for the unlisted stock.",
            "pubDate": "2026-01-13T01:41:19.110301"
        },
        {
            "title": "'India can be global AI use case capital': MeitY secy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-can-be-global-ai-use-case-capital-meity-secy/articleshow/126494754.cms",
            "description": "India is set to become a global hub for AI applications. The country will foster its own AI infrastructure, including large language models and data centers. This initiative aligns with the goal of democratizing AI resources. India's role as a trusted partner in value chains is recognized. Discussions on global AI policy will take place at an upcoming summit.",
            "pubDate": "2026-01-13T01:41:19.110492"
        },
        {
            "title": "Banks bank on cash recyclers in new ATM cycle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-bank-on-cash-recyclers-in-new-atm-cycle/articleshow/126494796.cms",
            "description": "Indian banks are set to deploy nearly 17,350 ATMs in the coming months. A significant majority of these will be advanced cash recyclers. This move signals a shift towards modern technology for better efficiency and lower costs. Banks are prioritizing smarter machines that reduce cash handling needs and improve service availability.",
            "pubDate": "2026-01-13T01:41:19.110587"
        },
        {
            "title": "Shriram-MUFG deal may test rules on non-compete fee for promoters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-mufg-deal-may-test-rules-on-non-compete-fee-for-promoters/articleshow/126494747.cms",
            "description": "The non-compete payment —amounting nearly 5% of the deal value—is intended to prevent Shriram Ownership Trust (SOT), the promoter entity, from launching a rival lending business under the Shriram brand or any other name.",
            "pubDate": "2026-01-13T01:41:19.110683"
        },
        {
            "title": "Distribution costs weigh on value of insurance products",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/distribution-costs-weigh-on-value-of-insurance-products/articleshow/126494800.cms",
            "description": "Insurance product value is shrinking due to high commissions and operating expenses. Experts highlight concerns with credit-linked life, non-linked, motor third-party, and retail health policies. Despite tax reforms, these costs impact customer returns. Industry growth has stagnated while expenses climb. A committee is now examining distribution costs.",
            "pubDate": "2026-01-13T01:41:19.110778"
        }
    ]
}