{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-31T23:35:52.171866",
    "items": [
        {
            "title": "IIFL Capital Services and 3 other stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iifl-capital-services-and-3-other-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126263173.cms",
            "description": "On December 30, in the NSE list of stocks with a market cap over Rs 10,000 crore, four stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-12-31T03:41:30.353221"
        },
        {
            "title": "RITES shares in focus on winning $3.6 million international locomotive supply order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rites-shares-in-focus-on-winning-3-6-million-international-locomotive-supply-order/articleshow/126263063.cms",
            "description": "RITES Ltd shares will be in focus after the company secured an international order worth USD 3.6 million from Zimbabwe for supplying in-service Cape gauge diesel-electric locomotives. The three-month contract underscores RITES’ overseas execution capabilities, even as the stock has faced sustained pressure across longer timeframes.",
            "pubDate": "2025-12-31T03:41:30.353352"
        },
        {
            "title": "Cupid, Ashok Leyland among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-ashok-leyland-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/126263050.cms",
            "description": "In the NSE list of stocks with a market capitalisation above Rs 1,000 crore, six counters witnessed a 5-year swing high at the close on December 30, signalling bullishness, according to technical scan data from StockEdge.A 5-year swing high marks the highest price a stock has reached over five years and acts as a key resistance level. While such moves are considered bullish, they differ from a 5-year breakout, which requires a decisive move beyond long-standing resistance.",
            "pubDate": "2025-12-31T03:41:30.353462"
        },
        {
            "title": "Tata Steel, JSW Steel, and other steel stocks in focus as India imposes a three-year import levy of up to 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-jsw-steel-and-other-steel-stocks-in-focus-as-india-imposes-a-three-year-import-levy-of-up-to-12/articleshow/126262950.cms",
            "description": "Shares of steelmakers such as Tata Steel and JSW Steel may remain in focus after India imposed a three-year safeguard duty of up to 12% on select steel imports. The phased tariff aims to curb cheap inflows, protect domestic producers, and align with global trade measures amid rising import pressures.",
            "pubDate": "2025-12-31T03:41:30.353568"
        },
        {
            "title": "Jindal Steel among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jindal-steel-among-4-stocks-showing-bullish-rsi-upswing/slideshow/126262860.cms",
            "description": "On December 30, four stocks from the Nifty500 universe that gained over 3% were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" indicates that the Relative Strength Index (RSI) values are increasing, suggesting a strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify opportunities for buying.",
            "pubDate": "2025-12-31T03:41:30.353667"
        },
        {
            "title": "Power Grid shares in focus after winning 2,000 MWh battery energy storage project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-grid-shares-in-focus-after-winning-2000-mwh-battery-energy-storage-project/articleshow/126262783.cms",
            "description": "Power Grid Corporation of India has won a 2,000 MWh battery energy storage project in Andhra Pradesh under tariff-based competitive bidding. The BOO project, backed by viability gap funding, strengthens grid flexibility. Shares ended flat despite recent underperformance across timeframes. The company received the award letter on December twenty-nine officially.",
            "pubDate": "2025-12-31T03:41:30.353775"
        },
        {
            "title": "Premier Energies shares in focus on multiple order wins worth Rs 2,307 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-shares-in-focus-on-multiple-order-wins-worth-rs-2307-crore/articleshow/126262770.cms",
            "description": "Premier Energies secured new orders worth Rs 2,307.30 crore for execution in FY27-FY28, bolstering its medium-term revenue visibility. These orders from leading domestic IPPs and customers reflect confidence in the company's product quality and execution capabilities. The new contracts align with Premier Energies' ongoing capacity expansion plans, reinforcing its position in India's solar manufacturing ecosystem.",
            "pubDate": "2025-12-31T03:41:30.353876"
        },
        {
            "title": "Bharat Forge shares in focus after Rs 1,662 crore contract win from Defence Ministry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-forge-shares-in-focus-after-rs-1662-crore-contract-win-from-defence-ministry/articleshow/126262719.cms",
            "description": "Bharat Forge Limited has secured its largest small arms contract. The Ministry of Defence awarded the company a deal worth Rs 1,661.9 crore. This contract is for supplying 255,128 Close Quarter Battle Carbines to the Indian Army. The carbines are indigenously designed and developed. Execution of this significant contract is expected to begin within five years.",
            "pubDate": "2025-12-31T03:41:30.353976"
        },
        {
            "title": "IndiGo shares in focus on receiving Rs 458 crore GST demand order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-on-receiving-rs-458-crore-gst-demand-order/articleshow/126262697.cms",
            "description": "IndiGo Airlines is under scrutiny following substantial tax demand orders from the Goods and Services Tax department. The airline has received a penalty of Rs 458.26 crore for financial years 2018-19 to 2022-23. IndiGo believes these orders are incorrect and plans to contest them legally. A separate order for Rs 14.59 lakh was also received for financial year 2021-22.",
            "pubDate": "2025-12-31T03:41:30.354093"
        },
        {
            "title": "Apollo Techno Industries shares to debut today. GMP steady ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-techno-industries-shares-to-debut-today-gmp-steady-ahead-of-listing/articleshow/126262394.cms",
            "description": "Apollo Techno Industries is set to list on the BSE SME platform with a modest grey market premium, following a highly subscribed Rs 48 crore IPO. The company, a player in trenchless technology for infrastructure, saw strong demand from all investor categories.",
            "pubDate": "2025-12-31T03:41:30.354191"
        },
        {
            "title": "Bai Kakaji Polymers shares to list today. Here's what GMP suggests",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bai-kakaji-polymers-shares-to-list-today-heres-what-gmp-suggests/articleshow/126262384.cms",
            "description": "Bai Kakaji Polymers is set to debut on the BSE SME platform on December 31. The company's Rs 105 crore IPO saw steady demand, with a 2% grey market premium indicating cautious investor sentiment. The funds raised will primarily be used to repay borrowings and for capacity expansion.",
            "pubDate": "2025-12-31T03:41:30.354282"
        },
        {
            "title": "Admach Systems IPO eyes steady listing as GMP indicates 5% premium over issue price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/admach-systems-ipo-eyes-steady-listing-as-gmp-indicates-5-premium-over-issue-price/articleshow/126262369.cms",
            "description": "Admach Systems is set to list on the BSE SME platform on December 31, with a modest 5% grey market premium indicating cautious investor sentiment. The Rs 42.6 crore IPO, priced at Rs 239 per share, saw strong demand from non-institutional investors.",
            "pubDate": "2025-12-31T03:41:30.354374"
        },
        {
            "title": "Nanta Tech IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nanta-tech-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/126262346.cms",
            "description": "Nanta Tech's initial public offering is set to list on the BSE SME platform. The grey market indicates a premium of around 11% over the issue price. The company received a healthy response from investors. Nanta Tech operates in audio-visual integration, technology distribution, service robotics, and software development. Proceeds will fund an experience centre and working capital.",
            "pubDate": "2025-12-31T03:41:30.354466"
        },
        {
            "title": "Dhara Rail Projects IPO set for listing as GMP signals 10% premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dhara-rail-projects-ipo-set-for-listing-as-gmp-signals-10-premium/articleshow/126262335.cms",
            "description": "Dhara Rail Projects lists on the NSE SME platform today. The IPO saw strong investor demand, with grey market trends suggesting a premium. The company focuses on railway rolling stock maintenance and repair. Proceeds will fund working capital and debt reduction. Dhara Rail Projects has a significant order book, indicating future revenue.",
            "pubDate": "2025-12-31T03:41:30.354559"
        },
        {
            "title": "Positive Breakout: These 10 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-cross-above-their-200-dmas/slideshow/126262315.cms",
            "description": "As of December 30, 2025, 15 NSE-listed stocks with a market capitalisation of over Rs 1,000 crore closed above their 200-day moving average (DMA). Of these, we have highlighted the top 10 that posted gains of more than 2%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-12-31T03:41:30.354653"
        },
        {
            "title": "Stock Market Holiday for New Year 2026: Are NSE, BSE closed on January 1? Check Here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-for-new-year-2026-are-nse-bse-closed-on-january-1-check-here/articleshow/126256410.cms",
            "description": "NSE Holidays for New Year 2026: NSE and BSE will remain open for trading on January 1, even as most major global markets stay shut. Commodity exchanges MCX and NCDEX will be open during the day session but will remain closed in the evening session.",
            "pubDate": "2025-12-31T03:41:30.354742"
        },
        {
            "title": "Buy, Sell or Hold: Motilal Oswal maintains buy on V-Mart Retail; Morgan Stanley recommends underweight on L&T Finance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-motilal-oswal-maintains-buy-on-v-mart-retail-morgan-stanley-recommends-underweight-on-lt-finance/articleshow/126263703.cms",
            "description": "Top brokerages highlight selective opportunities across Indian equities, with Motilal Oswal bullish on V-Mart Retail and VA Tech Wabag, while Morgan Stanley remains cautious on L&T Finance despite earnings upgrades.",
            "pubDate": "2025-12-31T04:23:55.258350"
        },
        {
            "title": "Hindustan Copper shares down 3% as metal prices slip over 1% on-year end profit taking. What are analysts saying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-down-3-as-metal-prices-slip-over-1-on-year-end-profit-taking-what-are-analysts-saying/articleshow/126263494.cms",
            "description": "Hindustan Copper shares dipped as investors booked profits after a significant surge, driven by record copper prices in 2025.  Global supply disruptions and strong demand from electrification and AI infrastructure fueled copper's rise, positioning the company for substantial year-end gains. Analysts advise a 'buy on dips' strategy amid near-term caution.",
            "pubDate": "2025-12-31T04:23:55.258497"
        },
        {
            "title": "Coforge, SRF among 6 F&O stocks with sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-srf-among-6-fo-stocks-with-sharp-rise-in-futures-open-interest/slideshow/126263293.cms",
            "description": "As of December 30, futures open interest (OI) saw a notable surge in nine stocks in the NSE F&O segment, with OI rising by over 5% compared with the previous trading session. A sharp increase in futures open interest indicates growth in the number of active, unexpired futures contracts in a particular security. This trend suggests that more participants are either initiating fresh positions or adding to their existing positions in the futures market.",
            "pubDate": "2025-12-31T04:23:55.258603"
        },
        {
            "title": "Sensex rises over 200 pts, Nifty reclaims 26,000 in year-end bounce",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-200-pts-nifty-reclaims-26000-in-year-end-bounce/articleshow/126263441.cms",
            "description": "Indian equities opened higher on Wednesday, ending a four-session losing streak on the final trading day of the year. Bargain hunting boosted the Sensex and Nifty, despite ongoing concerns about sustained foreign fund outflows. The Sensex gained 220 points, and the Nifty 50 climbed 77 points at the session's start.",
            "pubDate": "2025-12-31T04:23:55.258703"
        },
        {
            "title": "Sensex, Nifty end 2025 as world’s worst performers. Can 2026 change the script?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-end-2025-as-worlds-worst-performers-can-2026-change-the-script/articleshow/126263345.cms",
            "description": "Indian stock markets ended 2025 as the world's worst performers. Foreign investors pulled out billions due to currency depreciation and expensive valuations. However, 2026 offers hope. Supportive policies, easing trade risks, and potential rate cuts are expected to boost domestic growth and earnings. This could lead to a market recovery, attracting renewed investor interest.",
            "pubDate": "2025-12-31T04:23:55.258806"
        },
        {
            "title": "SIP sahi hai! Mutual fund investors win big with 97% success rate in treacherous 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sip-sahi-hai-mutual-fund-investors-win-big-with-97-success-rate-in-treacherous-2025/articleshow/126263316.cms",
            "description": "Indian markets faced a tough year in 2025, becoming the world's worst performers. However, investors using Systematic Investment Plans (SIPs) saw remarkable success. A staggering 97% of mutual fund schemes delivered positive returns, with some achieving XIRR up to 37%. This demonstrates the power of disciplined, regular investing over market timing. SIPs helped investors navigate volatility and achieve wealth creation.",
            "pubDate": "2025-12-31T04:23:55.258904"
        },
        {
            "title": "Deepak Fertilisers and Petrochemicals shares rally 5% after recent decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/deepak-fertilisers-and-petrochemicals-shares-rally-5-after-recent-decline/articleshow/126264501.cms",
            "description": "Deepak Fertilisers shares rose on Wednesday, rebounding after a two-day decline amid renewed buying interest. The stock saw intraday volatility between Rs 1,233 and Rs 1,284 and is valued at a market cap of Rs 15,262.15 crore. While up just 7% over the past year, the stock has gained nearly 80% in three years and 708% in five, highlighting strong long-term wealth creation.",
            "pubDate": "2025-12-31T05:24:03.016482"
        },
        {
            "title": "Smallcap multibagger stock jumps 13% after securing Rs 249 crore order from RBI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-multibagger-stock-jumps-13-after-securing-rs-249-crore-order-from-rbi/articleshow/126264320.cms",
            "description": "Dynacons Systems & Solutions Ltd shares saw a significant jump. The company secured a major software project from the Reserve Bank of India. This prestigious contract is valued at Rs 249.15 crore. The project involves implementation, maintenance, and learning services for the RBI's Enterprise Applications Platform. It will be executed over five years across the entire RBI ecosystem.",
            "pubDate": "2025-12-31T05:24:03.016608"
        },
        {
            "title": "New year stock picks 2026: Why M&M, Marico, Hindustan Petroleum offer up to 20% potential upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-year-stock-picks-2026-why-mm-marico-hindustan-petroleum-offer-up-to-20-potential-upside/slideshow/126263770.cms",
            "description": "As markets step into 2026 amid shifting global cues, volatile flows, and divergent sectoral trends, stock selection is set to matter more than broad index moves. Analysts believe 2026 will reward companies with strong balance sheets, earnings visibility and pricing power, even as macro uncertainties—from interest rates to geopolitical risks—linger. But investors willing to ride momentum could consider three stocks suggested by Sumeet Bagadia, Executive Director at Choice Broking to make handsome gains up to 20%. Take a look!",
            "pubDate": "2025-12-31T05:24:03.016713"
        },
        {
            "title": "Nifty Bank welcomes Yes Bank, Union Bank as rejig comes into effect today. Which stocks will see outflows?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-bank-welcomes-yes-bank-union-bank-as-rejig-comes-into-effect-today-which-stocks-will-see-outflows/articleshow/126264340.cms",
            "description": "The Nifty Bank index has welcomed Yes Bank and Union Bank today. This structural change will see significant inflows for these new entrants. However, ICICI Bank and HDFC Bank are projected to experience the largest outflows. Other banking stocks will also see adjustments in their index weights.",
            "pubDate": "2025-12-31T05:24:03.016815"
        },
        {
            "title": "KPI Green Energy shares skyrocket 27% in 2 days on strong volume",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kpi-green-energy-shares-skyrocket-27-in-2-days-on-strong-volume/articleshow/126264169.cms",
            "description": "KPI Green Energy shares surged sharply on strong volumes, with technical indicators signalling sustained bullish momentum amid improving sentiment in the renewable energy space.",
            "pubDate": "2025-12-31T05:24:03.016917"
        },
        {
            "title": "January jinx weighs for Nifty bulls: 80% failure rate in last 10 years linked to FII selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/january-jinx-weighs-for-nifty-bulls-80-failure-rate-in-last-10-years-linked-to-fii-selling/articleshow/126264052.cms",
            "description": "January has historically been a challenging month for Indian equities, with the Nifty ending in the red eight out of the last ten years. Foreign investors have largely been net sellers, contributing to weak sentiment. However, domestic institutional investors have consistently stepped in as net buyers, providing crucial support and cushioning market declines.",
            "pubDate": "2025-12-31T05:24:03.017015"
        },
        {
            "title": "Why India’s markets stayed resilient in a year few celebrated",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-indias-markets-stayed-resilient-in-a-year-few-celebrated/articleshow/126263900.cms",
            "description": "Despite a volatile year, the Nifty 50 closed 2025 near 26,000, marking the 10th consecutive positive year.  Fixed income also showed resilience with falling yields.  This strength in Indian markets, driven by economic and business upturns, fuels optimism for 2026, even as investor sentiment lags.",
            "pubDate": "2025-12-31T05:24:03.017111"
        },
        {
            "title": "Will Berkshire Hathaway still be a millionaire maker after Warren Buffett? The $700 billion question facing investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-berkshire-hathaway-still-be-a-millionaire-maker-after-warren-buffett-the-700-billion-question-facing-investors/articleshow/126263860.cms",
            "description": "Warren Buffett’s exit as CEO marks the end of a six-decade era at Berkshire Hathaway, where investing in the stock was largely a bet on his leadership. As he hands over control to longtime deputy Greg Abel on December 31, investors are questioning whether Berkshire can continue to generate outsized wealth without the Oracle of Omaha at the helm.",
            "pubDate": "2025-12-31T05:24:03.017202"
        },
        {
            "title": "The Great Divide: When the mood overtakes the math",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-great-divide-when-the-mood-overtakes-the-math/articleshow/126263831.cms",
            "description": "Indian markets experienced significant shocks, including a depreciating rupee and massive FII sell-offs, despite a robust macro environment. This disconnect, driven by AI trade flows and trade deal delays, led to broader market carnage. However, with valuations normalizing and reforms accelerating, 2026 could see a shift as the rupee stabilizes and FII flows potentially return.",
            "pubDate": "2025-12-31T05:24:03.017293"
        },
        {
            "title": "IFCI shares gain over 7% after stake sale in NEDFi for Rs 122 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ifci-shares-gain-over-7-after-stake-sale-in-nedfi-for-rs-122-crore/articleshow/126264807.cms",
            "description": "IFCI shares rise 7.3% to Rs 54.12 after selling 10% stake in NEDFi for Rs 121.77 crore. Despite trading below 52-week high, strong institutional interest, robust quarterly net profit, and mild bullish technical indicators highlight improving investor confidence.",
            "pubDate": "2025-12-31T05:54:08.582671"
        },
        {
            "title": "Smallcap multibagger stock shoots up another 58% in a month. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-multibagger-stock-shoots-up-another-58-in-a-month-do-you-own/articleshow/126264776.cms",
            "description": "Cupid Ltd shares soar to a record Rs 519.90, posting a 58% one-month gain and 584% yearly surge. Recent updates include promoter pledge reduction and board approval for a Saudi FMCG facility, while technicals signal strong momentum amid high investor interest.",
            "pubDate": "2025-12-31T05:54:08.582798"
        },
        {
            "title": "Warren Buffett retires today: Berkshire faces its first dawn without the Oracle of Omaha",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-retires-today-berkshire-faces-its-first-dawn-without-the-oracle-of-omaha/articleshow/126264753.cms",
            "description": "Warren Buffett concludes his long tenure as Berkshire Hathaway CEO today. Gregory Abel assumes day-to-day leadership. Investors now assess Berkshire's future without Buffett's direct operational guidance. The conglomerate, built into a financial giant, faces new challenges in capital allocation and governance. Buffett's philosophy of patience and enjoyment of work remains, but his singular influence departs.",
            "pubDate": "2025-12-31T05:54:08.583024"
        },
        {
            "title": "The 11 big trades of 2025: Bubbles, cockroaches and a 367% jump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-11-big-trades-of-2025-bubbles-cockroaches-and-a-367-jump/articleshow/126264587.cms",
            "description": "2025 saw wild swings in global markets, from record-breaking gold and meme-like Fannie-Freddie gains to geopolitical-driven defense rallies and AI trades. Investors chased high-conviction bets in crypto, Turkish carry trades, and Japanese bonds, facing both spectacular wins and sudden wipeouts. Bloomberg highlights the year’s 11 most eye-catching trades, exposing market bubbles, fragile narratives, and lessons for 2026’s risk-conscious investors.",
            "pubDate": "2025-12-31T05:54:08.583124"
        },
        {
            "title": "IT stocks: Will they make a comeback in 2026 and prove analysts wrong? 9 stocks one should keep an eye on",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-stocks-will-they-make-a-comeback-in-2026-and-prove-analysts-wrong-9-stocks-one-should-keep-an-eye-on/articleshow/126266759.cms",
            "description": "It is now close to three years that IT stocks (or what are commonly called software stocks on the street) have been under performing. A number of reasons have been given for this under performance: From AI hitting growth to an overall slowdown in tech spending. But it is not the first time that IT companies have faced challenges. And they have always shown the ability to adapt and make a comeback. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks along with detailed company analysis focusing on five key components - earnings, fundamentals, relative valuation, risk and price momentum to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2025-12-31T07:33:54.623247"
        },
        {
            "title": "After 850% annual surge, Elitecon International shares rise 5% to upper circuit. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-850-annual-surge-elitecon-international-shares-rise-5-to-upper-circuit-do-you-own/articleshow/126265861.cms",
            "description": "Elitecon International shares hit the 5% upper circuit on the final trading day of 2025, extending the small-cap’s extraordinary 850% rise over the past year. The move comes after recent volatility, an expansion in borrowing powers, and the announcement of a $97.35 million long-term export order, underscoring the stock’s sharp swings and renewed investor interest.",
            "pubDate": "2025-12-31T07:33:54.623371"
        },
        {
            "title": "Tata Steel shares rise 7% in 3 sessions; up 31% in 2025. What’s driving the latest surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-rise-7-in-3-sessions-up-31-in-2025-whats-driving-the-latest-surge/articleshow/126265899.cms",
            "description": "Tata Steel shares rallied after the government imposed safeguard duties on select steel imports to curb cheap inflows and protect domestic producers. The phased three-year measure lifted sentiment across steel stocks, supported by strong recent gains and robust quarterly earnings growth, reflecting improving profitability and favourable industry tailwinds.",
            "pubDate": "2025-12-31T07:33:54.623473"
        },
        {
            "title": "MCX shares rise 3% to hover near record high as Morgan Stanley upgrades stock to ‘equal weight’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-rise-3-to-hover-near-record-high-as-morgan-stanley-upgrades-stock-to-equal-weight/articleshow/126265679.cms",
            "description": "MCX shares rose on Wednesday, nearing their 52-week high after Morgan Stanley upgraded the stock to ‘Equal Weight’ and raised its target from Rs 6,710 to Rs 11,135. The brokerage highlighted a sharp rise in Average Daily Transaction Revenue, driven largely by gold and silver volatility, which contributed around 55% to ADTR in the past three months.",
            "pubDate": "2025-12-31T07:33:54.623576"
        },
        {
            "title": "Smallcap multibagger defence stock jumps 5% on Rs 420 crore order win from Coal India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-multibagger-defence-stock-jumps-5-on-rs-420-crore-order-win-from-coal-india/articleshow/126267915.cms",
            "description": "Apollo Micro Systems shares climbed on Wednesday after the defence company announced new orders worth approximately Rs 420 crore. A significant contract from a Coal India subsidiary for bulk explosives was part of the announcement. The company also secured an export order. These wins expand its presence in explosives and defence segments. Earlier, it received a Rs 100.",
            "pubDate": "2025-12-31T09:00:49.825787"
        },
        {
            "title": "Why is the stock market rallying today? Sensex surges over 700 pts, Nifty above 26,150; top 5 factors behind 2025’s final rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-the-stock-market-rallying-today-sensex-surges-over-600-pts-nifty-above-26150-on-the-years-final-trading-day/articleshow/126267646.cms",
            "description": "Indian stocks surged on the final trading day of the year, with the Sensex and Nifty rebounding significantly. This rally was primarily driven by a government decision to impose a three-year safeguard duty on select steel imports, boosting metal stocks. Additionally, easing crude oil prices contributed to the positive sentiment by reducing inflationary pressures.",
            "pubDate": "2025-12-31T09:00:49.825894"
        },
        {
            "title": "Budget 2026 wish list: Gurmeet Chadha seeks LTCG relief, special lending rates for gold and silver",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-wish-list-gurmeet-chadha-seeks-ltcg-relief-special-lending-rates-for-gold-and-silver/articleshow/126269239.cms",
            "description": "Gurmeet Chadha outlines key Budget 2026 recommendations, urging LTCG cut to 10%, monetisation of gold and silver, and affordable housing incentives, highlighting the need for financial stability and investor-friendly reforms.",
            "pubDate": "2025-12-31T09:48:21.935905"
        },
        {
            "title": "Nifty seals rare 10-year winning streak by ending 2025 with 10% gain. What does it mean for 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-seals-rare-10-year-winning-streak-by-ending-2025-with-10-gain-what-does-it-mean-for-2026/articleshow/126268918.cms",
            "description": "Nifty has logged an unprecedented 10-year winning streak, ending 2025 with a 10% gain despite global and domestic shocks. Strong macros, policy reforms, resilient earnings, and robust domestic inflows powered the rally. As 2026 begins, analysts expect the momentum to continue, though elevated valuations warrant selective, disciplined investing.",
            "pubDate": "2025-12-31T09:48:21.936023"
        },
        {
            "title": "Midcap movers & shakers of 2025: One stock becomes multibagger amid sharp divergence",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcap-movers-amp-shakers-of-2025-one-stock-becomes-multibagger-amid-sharp-divergence/slideshow/126269130.cms",
            "description": "After delivering blockbuster returns for two consecutive years, the BSE Midcap Index has lost momentum in CY25, emerging as a flat performer and lagging the benchmark Sensex. The slowdown comes after an extraordinary run. The midcap index surged 45% in 2023 and followed it up with another 27% gain in 2024, making it one of the strongest segments of the equity market. This year, however, the broader midcap rally has clearly stalled. Yet, the headline number masks sharp divergence within the index.",
            "pubDate": "2025-12-31T09:48:21.936120"
        },
        {
            "title": "Vodafone Idea shares crash 15% despite Cabinet freeze on Rs 87,695 crore AGR dues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-crash-15-despite-cabinet-freeze-on-rs-87695-crore-agr-dues/articleshow/126268483.cms",
            "description": "Vodafone Idea shares plunged 15% despite the Union Cabinet approving a relief package that freezes AGR dues at Rs 87,695 crore, payable over a decade from FY32. While FY18-19 dues remain unchanged, the government aims to protect its stake and ensure sector competition.",
            "pubDate": "2025-12-31T09:48:21.936217"
        },
        {
            "title": "Zerodha’s late MTF entry still nets 5% market share but Nithin Kamath flags cost blind spot",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodhas-late-mtf-entry-still-nets-5-market-share-but-nithin-kamath-flags-cost-blind-spot/articleshow/126269970.cms",
            "description": "Zerodha founder Nithin Kamath reveals that the broker’s Margin Trading Facility has captured 5% market share despite limited promotion, while highlighting low cost awareness among retail investors and the impact of brokerage pricing on long-term returns.",
            "pubDate": "2025-12-31T10:53:11.825872"
        },
        {
            "title": "Geojit sees Nifty at 29,150 by December 2026, shares portfolio allocation strategy for CY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/geojit-sees-nifty-at-29150-by-december-2026-shares-portfolio-allocation-strategy-for-cy26/articleshow/126269551.cms",
            "description": "Geojit Financial Services upgrades Nifty50 base case to 29,150 for 2026, with a bull case of 31,330. The brokerage outlines key domestic and global drivers, and recommends a portfolio allocation with 60% large caps, 15% mid caps, 10% small caps, 10% debt, and 5% gold & silver.",
            "pubDate": "2025-12-31T10:53:11.826022"
        },
        {
            "title": "​Gainers & Losers: Vodafone Idea among 7 big movers on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-vodafone-idea-among-7-big-movers-on-wednesday/slideshow/126270804.cms",
            "description": "",
            "pubDate": "2025-12-31T11:39:54.168819"
        },
        {
            "title": "NSE, BSE stock market holidays in 2026: 7 long weekends, 15 closures, check details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-bse-stock-market-holidays-in-2026-7-long-weekends-15-closures-check-details-here/articleshow/126271670.cms",
            "description": "India’s stock markets will remain shut for 15 days in 2026, creating seven long weekends, while trading continues on January 1. The NSE and BSE holiday calendar offers investors early clarity to plan trading, liquidity and portfolio strategies.",
            "pubDate": "2025-12-31T11:55:32.763925"
        },
        {
            "title": "Shriram Finance, Vodafone Idea among 6 largecaps that hit 52-week highs; gains of up to 17% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-vodafone-idea-among-6-largecaps-that-hit-52-week-highs-gains-of-up-to-17-in-a-month/slideshow/126272140.cms",
            "description": "Benchmark Sensex surged 545 points to close at 85,220. Amid this broader market rally, six BSE large-cap stocks touched fresh 52-week highs, reaching their strongest levels in the past year. Such breakouts typically signal sustained bullish momentum and may suggest further upside potential in the near term.",
            "pubDate": "2025-12-31T13:09:43.639640"
        },
        {
            "title": "FPI sale vs DII cushion: How will their tug of war play out in early 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpi-sale-vs-dii-cushion-how-will-their-tug-of-war-play-out-in-early-2026/articleshow/126271838.cms",
            "description": "For decades, the Indian stock market was seen as a satellite of global capital, rising and falling at the whim of foreign fund managers. However, the five-year journey from 2020 to 2025 has rewritten this narrative, marking the end of foreign dominance and the birth of a domestic-led era. This period saw the market transform from a vulnerable \"global play\" into a resilient \"domestic growth story\", anchored by a massive influx of retail savings. As we move into 2026, understanding this fundamental ownership flip is essential for any investor navigating the evolving landscape of India’s financial future.",
            "pubDate": "2025-12-31T13:09:43.639750"
        },
        {
            "title": "Multibagger or IBC - Part 39: This auto ancillary knows the highway. Can railway tracks & defence runways take off?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-part-39-this-auto-ancillary-knows-the-highway-can-railway-tracks-defence-runways-take-off/articleshow/126273754.cms",
            "description": "This story traces the evolution of a long-running component supplier that began with basic casting and machining work before steadily widening its capabilities to include design, tooling, engineering services, and global supply relationships. Early technology tie-ups and export breakthroughs helped the company evolve into what it is today. And now it is adapting to the transition to hybrids and EVs, apart from entering adjacent markets like railways and defence. It is a company that is in the middle of a structural shift rather than at the end of one.",
            "pubDate": "2025-12-31T14:56:53.551153"
        },
        {
            "title": "Vodafone Idea secures Rs 5,836 crore promoter payout; to receive Rs 2,307 crore in 12 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-secures-rs-5836-crore-promoter-payout-to-receive-rs-2307-crore-in-12-months/articleshow/126273769.cms",
            "description": "Vodafone Idea will receive Rs 5,836 crore from Vodafone Group under the amended Implementation Agreement, with Rs 2,307 crore to be released over 12 months. The agreement settles long-pending contingent liabilities linked to the Vodafone-Idea merger.",
            "pubDate": "2025-12-31T14:56:53.551258"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/126274812.cms",
            "description": "The market ended 2025 on a strong note, with Sensex and Nifty rebounding on Wednesday after several losing sessions on broad-based buying and metal sector gains following new steel safeguard duties. Analysts see a constructive start to 2026, supported by improving demand, a firmer earnings outlook and stabilising sentiment.",
            "pubDate": "2025-12-31T15:48:14.283086"
        },
        {
            "title": "Market Trading Guide: PSU stocks in contention for Thursday trade. Here’s what is working for BPCL & Bank of Maharashtra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-psu-stocks-in-contention-for-thursday-trade-heres-what-is-working-for-bank-of-maharashtra-and-bpcl/slideshow/126274748.cms",
            "description": "Nifty ended Wednesday with strong gains, breaking its four-session losing streak, lifted by buying action across sectors, barring IT. Metals, auto and financials led the pack. The index has reclaimed the 21EMA after reversing from a brief dull phase.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities, said that Nifty has seen a doji formation followed by a sharp rise, reflected through a visible green candle. This signals the possibility of more gains ahead, he said. \"Although the trend is not decisively bullish yet—unlike the Bank Nifty, which has given a clear breakout—the current recovery may continue in the near term. On the upside, the index could move towards 26,315, while 26,100 may act as the initial support,\" De said.Here are 2 stock recommendations for Thursday:",
            "pubDate": "2025-12-31T15:48:14.283196"
        },
        {
            "title": "Two Trades for Today: An insurance major for a 3.75% rise; a large-cap oil refinery stock for an almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-insurance-major-for-a-3-75-rise-a-large-cap-oil-refinery-stock-for-an-almost-6-gain/articleshow/126275451.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-31T16:44:43.419148"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 26%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-26-according-to-analysts/articleshow/126275839.cms",
            "description": "While every earnings season is critical to the street, there are some that should be watched carefully because they have the ability to influence the course of the market for a very long time. The coming Q3 earnings season falls in this category, especially for mid-cap stocks. Why? Because, while valuations are not cheap, there is enough money sitting on the sidelines that could flow into mid-cap stocks which deliver on the earnings front.",
            "pubDate": "2025-12-31T17:17:48.705126"
        },
        {
            "title": "Are these fit for tactical investing? 5 agrochemical stocks with an upside potential of up to 36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-these-fit-for-tactical-investing-5-agrochemical-stocks-with-an-upside-potential-of-up-to-36/articleshow/126276797.cms",
            "description": "While it may not have made it to the headlines, the fact is that the longer-than-normal monsoon season has impacted many sectors. Right from cements to air-conditioners, and paints to agrochemicals. But given the macro picture of the sector and the operating dynamics there is one which is a better fit for tactical investing. Now, why turn tactical at all? It may soon become a necessity rather than an option in some cases.",
            "pubDate": "2025-12-31T18:13:48.712681"
        },
        {
            "title": "​Stock Radar: Bharti Hexacom breaks out from inverse head & shoulder pattern; time to buy the stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-bharti-hexacom-breaks-out-from-inverse-head-shoulder-pattern-time-to-buy-the-stock/articleshow/126268070.cms",
            "description": "Bharti Hexacom has broken out of an inverse head & shoulders pattern, signalling renewed bullish momentum after a corrective phase. With indicators like MACD, RSI and Supertrend turning positive, experts suggest buying in the Rs 1,820–1,840 range for targets of Rs 1,985–1,995 over the next 1–2 months.",
            "pubDate": "2025-12-31T23:35:51.383437"
        }
    ]
}