{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-30T07:18:11.529074",
    "items": [
        {
            "title": "Blackstone, Carlyle and other PEs submit bids to unlock Access' majority stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstone-carlyle-and-other-pes-submit-bids-to-unlock-access-majority-stake/articleshow/116780287.cms",
            "description": "Several global private equity funds, including Blackstone and Carlyle, have expressed interest in acquiring a majority stake in Access Healthcare. The company, specializing in revenue cycle management services, is expected to be valued at $1.4-1.5 billion. Access Healthcare, founded by Anurag Jain, employs 27,000 people globally.",
            "pubDate": "2024-12-30T07:17:56.481058"
        },
        {
            "title": "TVS Motor, Deepak Nitrite among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-deepak-nitrite-among-5-stocks-with-short-buildup/slideshow/116790526.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of the underlying stock in the Futures and Options segment. This indicates that more traders expect the prices to decline and are creating short positions. In Monday's trading session, five stocks saw significant short positions being built. Here's the list:",
            "pubDate": "2024-12-30T07:17:56.481172"
        },
        {
            "title": "Kothari Products announces 1:1 bonus share issue, stock up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kothari-products-announces-11-bonus-share-issue-stock-up-7/articleshow/116788397.cms",
            "description": "Kothari Products announced a 1:1 bonus share issue, causing a 7.4% stock rise to Rs 209.70. The issuance will be financed from free reserves, increasing authorized capital to Rs 61.50 crore. Shares surged 58.55% YoY.",
            "pubDate": "2024-12-30T07:17:56.481378"
        },
        {
            "title": "These 5 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/116788281.cms",
            "description": "As of December 27, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade, according to the stockedge.com data. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2024-12-30T07:17:56.481475"
        },
        {
            "title": "Breakout Stocks: How to trade Jubilant FoodWorks and Finolex Industries on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-jubilant-foodworks-and-finolex-industries-on-monday/articleshow/116788031.cms",
            "description": "Jubilant FoodWorks has formed a strong resistance zone at 700, with sustained buying pushing the stock upward. A breakout from a Cup and Handle pattern signals renewed bullish momentum. The stock trading above key moving averages confirms the uptrend, while a positive DMI+ crossover and ADX above 30 indicate strengthening bullish momentum and strong underlying strength.",
            "pubDate": "2024-12-30T07:17:56.481570"
        },
        {
            "title": "Cigniti Tech shares slide 7% as Coforge board approves amalgamation merger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cigniti-tech-shares-slide-7-as-coforge-board-approves-amalgamation-merger/articleshow/116787815.cms",
            "description": "Coforge notified shareholders via a stock exchange announcement that its board had approved the merger during a meeting on Friday. As part of the plan, Coforge will integrate the smaller Cigniti Technologies, pending approval from the National Company Law Tribunal.",
            "pubDate": "2024-12-30T07:17:56.481672"
        },
        {
            "title": "These 4 stocks showing RSI Trending Up on December 27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-stocks-showing-rsi-trending-up-on-december-27/slideshow/116787719.cms",
            "description": "On December 27, 4 stocks from the Nifty50 pack appeared in the RSI Trending Up scan, according to the stockedge.com data. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2024-12-30T07:17:56.481784"
        },
        {
            "title": "Bullish Momentum: 3 stocks with White Marubozu Pattern on Dec 27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-3-stocks-with-white-marubozu-pattern-on-dec-27/slideshow/116787646.cms",
            "description": "On December 27, 3 stocks from the Nifty500 pack came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2024-12-30T07:17:56.481882"
        },
        {
            "title": "Chris Wood's love for HDFC Bank rekindles at the cost of 4 other stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chris-woods-love-for-hdfc-bank-rekindles-at-the-cost-of-4-other-stocks/articleshow/116787500.cms",
            "description": "Jefferies' Chris Wood has re-added HDFC Bank and introduced Siemens India to their Asia ex-Japan portfolio. Investments in Macrotech Developers, L&T, ICICI Bank, Axis Bank, Samsung Electronics, and SK Hynix were adjusted. HDFC Bank shares are improving, with strong buy ratings and significant FII interest.",
            "pubDate": "2024-12-30T07:17:56.481983"
        },
        {
            "title": "Indo Farm Equipment IPO opens tomorrow. Price band, GMP among 5 things to know before subscribing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indo-farm-equipment-ipo-opens-tomorrow-price-band-gmp-among-5-things-to-know-before-subscribing/slideshow/116787559.cms",
            "description": "The initial public offering (IPO) of Indo Farm Equipment will open for subscription on Tuesday. The issue closes on January 2. Through the public offer, the company plans to raise nearly Rs 260 crore. Here are 5 things to know about the Indo Farm Equipment IPO before subscribing to the issue.",
            "pubDate": "2024-12-30T07:17:56.482080"
        },
        {
            "title": "These 4 stocks closed above VWAP on December 27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-stocks-closed-above-vwap-on-december-27/slideshow/116787250.cms",
            "description": "On December 27, the closing prices of four stocks with a market cap over Rs 10,000 crore rallied over 1% relative to the VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2024-12-30T07:17:56.482172"
        },
        {
            "title": "New year fundamental picks 2025: 9 stock recommendations for your portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-year-fundamental-picks-2025-9-stock-recommendations-for-your-portfolio/slideshow/116786541.cms",
            "description": "India's benchmark indices, BSE Sensex and Nifty 50, recorded gains of 9% and 9.5% respectively in 2024, reflecting resilience amid mixed global market trends. For 2025, domestic brokerage Axis Securities has identified nine fundamentally strong stocks with promising growth potential. These stocks include Shriram Finance, Ambuja Cements, Prestige Estates Projects, and Bharti Airtel. Here is a list:",
            "pubDate": "2024-12-30T07:17:56.482265"
        },
        {
            "title": "At multi-year highs: These 4 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-4-stocks-witness-5-year-swing-high-breakout/slideshow/116786341.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 1000 crore, we have collated a list of four stocks that witnessed a 5-year swing high at the close on December 27, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2024-12-30T07:17:56.482359"
        },
        {
            "title": "JSW Energy shares zoom nearly 8% on signing Rs 12,468 cr definitive agreement with O2 Power",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-energy-shares-zoom-nearly-8-on-signing-rs-12468-cr-definitive-agreement-with-o2-power/articleshow/116785895.cms",
            "description": "JSW Energy Share Price: Shares of JSW Energy rose 7.7% as its subsidiary JSW Neo Energy signed a definitive agreement to acquire O2 Power's 4.7 GW renewable energy portfolio for Rs 12,468 crore. The acquisition is aimed at achieving JSW Energy's 20 GW renewable-led capacity growth target by FY 2030.",
            "pubDate": "2024-12-30T07:17:56.482454"
        },
        {
            "title": "Adani Enterprises shares surge 4% after Ventura gives Rs 3,801 target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-shares-rally-4-as-ventura-gives-rs-3801-target-price/articleshow/116785905.cms",
            "description": "Adani Enterprises shares rose by 4% after Ventura Securities set a target price of Rs 3,801 for the next two years. The company is involved in various sectors like airports, solar modules, and data centers. Ventura estimates significant growth potential in these areas. They expect increased revenue and improved financial performance for Adani Enterprises.",
            "pubDate": "2024-12-30T07:17:56.482552"
        }
    ]
}