{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-14T13:59:22.990722",
    "items": [
        {
            "title": "Muthoot Finance gets target price boost from Jefferies and Nuvama. Is it time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muthoot-finance-gets-target-price-boost-from-jefferies-and-nuvama-is-it-time-to-buy/articleshow/123296131.cms",
            "description": "Muthoot Finance shares: Jefferies and Nuvama have increased their target prices for Muthoot Finance after its strong Q1FY26 results, maintaining a bullish outlook on the NBFC. They highlighted robust growth in gold loan assets, margin expansion, and better asset quality.",
            "pubDate": "2025-08-14T05:55:45.370694"
        },
        {
            "title": "RIL on slippery turf as shares slide 7% since Q1. Can AGM be the next trigger point?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-in-bear-grip-as-shares-slide-7-since-q1-can-agm-be-the-next-trigger-point/articleshow/123295781.cms",
            "description": "Despite strong Q1 earnings and positive brokerage ratings, Reliance Industries' shares have declined, prompting market experts to suggest a corrective phase. Investors are eyeing the upcoming AGM for updates on business growth targets, the new energy sector, and potential Jio and retail IPO timelines. Focus will also be on retail growth, Jio Hotstar monetization, FMCG expansion, and petchem capacity progress.",
            "pubDate": "2025-08-14T05:55:45.370826"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Bharat Dynamics, Hindalco among 5 stocks that could give 15-42% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-bharat-dynamics-hindalco-among-5-stocks-that-could-give-15-42-return/slideshow/123294792.cms",
            "description": "Brokerages remain optimistic on select stocks across defence, metals, railways, and retail, highlighting strong growth potential and sector-specific tailwinds.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-14T05:55:45.370935"
        },
        {
            "title": "Connplex Cinemas shares list at 10% premium over IPO price on NSE SME platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/connplex-cinemas-shares-list-at-10-premium-over-ipo-price-on-nse-sme-platform/articleshow/123295423.cms",
            "description": "Connplex Cinemas debuted on the NSE SME platform at Rs 195, a 10.2% premium over its issue price of Rs 177, after a highly successful IPO that was oversubscribed 35.67 times. The company, which operates premium 'Smart Cinemas' across India, plans to use the IPO proceeds for expansion and working capital, aiming to deliver strong performance following investor enthusiasm.",
            "pubDate": "2025-08-14T05:55:45.371040"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama maintains buy rating on Apollo Hospitals; retains Hold call on Natco Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-maintains-buy-rating-on-apollo-hospitals-retains-hold-call-on-natco-pharma/articleshow/123295299.cms",
            "description": "Brokerages remain positive on select healthcare, pharma, and engineering services stocks, citing strong growth outlooks and solid execution.",
            "pubDate": "2025-08-14T05:55:45.371142"
        },
        {
            "title": "Apollo Hospitals shares in focus as brokerages hike target prices post strong Q1FY26 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-hospitals-shares-in-focus-as-brokerages-hike-target-prices-post-strong-q1fy26-results/articleshow/123295215.cms",
            "description": "Apollo Hospitals shares: The company delivered robust Q1FY26 results, leading several brokerages to hike their target prices. Consolidated net profit rose 42% YoY to ₹433 crore from ₹305 crore, and was up 11% sequentially from ₹390 crore in Q4FY25.",
            "pubDate": "2025-08-14T05:55:45.371263"
        },
        {
            "title": "All Time Plastics shares list at 14% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/all-time-plastics-shares-list-at-14-premium-over-ipo-price/articleshow/123295127.cms",
            "description": "All Time Plastics made a strong debut, opening at a premium on both BSE and NSE after a highly subscribed IPO. The IPO, priced at Rs 275, witnessed significant demand across investor segments.",
            "pubDate": "2025-08-14T05:55:45.371362"
        },
        {
            "title": "JSW Cement shares list at 4% premium over IPO price on BSE, NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-cement-shares-list-at-4-premium-over-ipo-price-on-bse-nse/articleshow/123294989.cms",
            "description": "JSW Cement's shares debuted with gains on the NSE and BSE, exceeding the IPO price. The Rs 3,600 crore IPO witnessed strong subscription, driven by institutional demand. While the grey market premium was modest, investor focus is on JSW Cement's long-term execution. Proceeds from the IPO will support expansion plans and debt repayment.",
            "pubDate": "2025-08-14T05:55:45.371458"
        },
        {
            "title": "Paytm shares up 17% so far in 2025. Should you ride the rally or wait for a dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-up-17-so-far-in-2025-should-you-ride-the-rally-or-wait-for-a-dip/articleshow/123294839.cms",
            "description": "Paytm's stock has experienced a significant surge in 2025, fueled by a recent RBI approval and a profitable first quarter. Analysts suggest potential for further gains, with targets ranging from Rs 1,220 to Rs 1,400. However, some caution that the rally may be overextended, advising investors to consider potential pullbacks as buying opportunities, while being aware of resistance levels.",
            "pubDate": "2025-08-14T05:55:45.371550"
        },
        {
            "title": "Vishal Mega Mart shares surge 8% after Q1 profit jumps 37% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vishal-mega-mart-shares-surge-8-as-q1-profit-jumps-37-yoy/articleshow/123294790.cms",
            "description": "Vishal Mega Mart's shares experienced a surge following the announcement of robust first-quarter FY26 results. The company's Profit After Tax (PAT) witnessed a substantial 37.2% increase, reaching Rs 206.10 crore, while revenue from operations grew by 21% to Rs 3,140.30 crore. This impressive performance reflects the strength of their strategy in providing affordable products to consumers across India.",
            "pubDate": "2025-08-14T05:55:45.371645"
        },
        {
            "title": "Muthoot Finance shares hit 10% upper circuit on posting 65% YoY growth in Q1 profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muthoot-finance-shares-hit-10-upper-circuit-on-posting-65-yoy-growth-in-q1-profit/articleshow/123294705.cms",
            "description": "Muthoot Finance shares: Muthoot Finance's shares surge following strong Q1 FY26 results. The company reports a significant 65% year-on-year increase in net profit. Loan assets under management reach a record high. The company crosses a market capitalization of Rs 1 trillion. George Jacob Muthoot expresses confidence in sustaining growth. The company focuses on digital transformation and customer experience.",
            "pubDate": "2025-08-14T05:55:45.371742"
        },
        {
            "title": "Infosys shares jump 2% after Rs 1,300 crore deal to buy Telstra’s Versent stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-jump-2-after-rs-1300-crore-deal-to-buy-telstras-versent-stake/articleshow/123294706.cms",
            "description": "Infosys shares: Infosys will acquire a 75% stake in Versent Group, a wholly owned subsidiary of Australia’s Telstra Group, for AUD 233.25 million (over Rs 1,300 crore). The deal, excluding management incentives and retention bonuses, aims to strengthen Infosys’s presence in Australia’s cloud and AI services market and is expected to close in H2 FY26, pending regulatory approvals.",
            "pubDate": "2025-08-14T05:55:45.371838"
        },
        {
            "title": "Mutual fund boom: Your SIPs are powering the rally in these 4 multibagger stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-fund-boom-your-sips-are-powering-the-rally-in-these-4-multibagger-stocks/articleshow/123294665.cms",
            "description": "Indian mutual fund industry's AUM has doubled in 3 years, fueling multibagger returns for AMC stocks like Shriram AMC, HDFC AMC, and Nippon India. SIP inflows remain strong, reaching record highs, driven by increasing retail participation and financialization of savings. Experts recommend HDFC AMC, Nippon India AMC, and KFinTech, citing growth potential and steady inflows.",
            "pubDate": "2025-08-14T05:55:45.371937"
        },
        {
            "title": "United Spirits shares in focus after Q1 profit drops 14% despite revenue growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/united-spirits-shares-in-focus-after-q1-profit-drops-14-despite-revenue-growth/articleshow/123294617.cms",
            "description": "United Spirits shares: United Spirits Ltd, controlled by Diageo, reported a 14% YoY drop in Q1FY26 consolidated net profit to Rs 417 crore, despite a slight revenue uptick to Rs 6,295 crore on steady growth in its core beverage alcohol and sports segments. Total expenses rose 2.79% to Rs 5,776 crore.",
            "pubDate": "2025-08-14T05:55:45.372035"
        },
        {
            "title": "Sensex rises over 150 pts, Nifty above 24,650; IT, pharma stocks rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-50-pts-nifty-above-24600-it-pharma-stocks-rise/articleshow/123294457.cms",
            "description": "The Indian market mirrored gains seen across Asian markets, though investor caution ahead of Russia-U.S. talks on the Ukraine war kept sentiment in check in a holiday-shortened week.",
            "pubDate": "2025-08-14T05:55:45.372129"
        },
        {
            "title": "Last chance to buy! Midcap stock set for 8:1 bonus and 1:2 split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-chance-to-buy-midcap-stock-set-for-81-bonus-and-12-split/articleshow/123294412.cms",
            "description": "Investors interested in Algoquant Fintech's upcoming corporate actions must purchase shares today to qualify for the 8:1 bonus issue and stock split. The record date is set for August 18, 2025. This dual action, featuring a high bonus ratio and face value split, aims to enhance stock accessibility and liquidity, potentially attracting a wider investor base.",
            "pubDate": "2025-08-14T05:55:45.372272"
        },
        {
            "title": "F&O Radar | Deploy Long Iron Condor in Nifty to play rising IVs, expected short covering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-long-iron-condor-in-nifty-to-play-rising-ivs-expected-short-covering/articleshow/123297415.cms",
            "description": "The Nifty index shows positive movement this week. Experts identify 24,600 as immediate support. Resistance lies between 24,700 and 24,800. A Long Iron Condor strategy is suggested for this weekly expiry. This strategy anticipates minimal price movement. Maximum profit occurs if Nifty closes at 24,450 or 24,750. The put-call ratio signals a potential market bounce.",
            "pubDate": "2025-08-14T06:50:18.686856"
        },
        {
            "title": "Vodafone Idea stock hits fresh 52-week low ahead of Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-stock-hits-fresh-52-week-low-ahead-of-q1-results/articleshow/123297325.cms",
            "description": "Vodafone Idea shares dropped 3.5% to Rs 6.12 ahead of Q1 FY26 earnings, extending a nearly 60% decline over the past year due to financial concerns and mounting losses. Technical indicators, including a broken trendline, RSI at 32.8, and trading below key SMAs, point to continued weakness and bearish momentum.",
            "pubDate": "2025-08-14T06:50:18.686983"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/123296738.cms",
            "description": "Uncertainty. This is the one thing stock markets hate. Take US President Trump’s tariff tantrums: There is uncertainty about whether the additional 25% tariff threatened on India over Russian oil is actually implemented. Or whether the Trump-Putin meeting in Alaska on Independence Day will ease matters. Now, sentiment impacts stock prices, at least in the short term. But in the long term it is the earnings which matters. So, while reducing the bearish bias, focus on what managements have said about their businesses after the Q1 results, especially about growth and earnings.",
            "pubDate": "2025-08-14T06:50:18.687220"
        },
        {
            "title": "NMDC shares slide 5% as Q1 profit dips, but brokerages still bullish. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nmdc-shares-slide-5-as-q1-profit-dips-but-brokerages-still-bullish-heres-why/articleshow/123297022.cms",
            "description": "NMDC posted a PAT of Rs 1,969 crore for Q1 FY26, slightly lower than Rs 1,984 crore a year ago, as higher expenses offset strong production and sales. Revenue from operations jumped 23% YoY to Rs 6,634 crore, driven by a 31% rise in iron ore output to 119.94 lakh tonnes and a 14% increase in sales to 115.17 lakh tonnes.",
            "pubDate": "2025-08-14T06:50:18.687328"
        },
        {
            "title": "Nitya Shah on financial azaadi: How to build self-reliant portfolio in today's markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nitya-shah-on-financial-azaadi-how-to-build-self-reliant-portfolio-in-todays-markets/articleshow/123296875.cms",
            "description": "Nitya Shah shares insights on financial independence through long-term investing. He highlights sectors like electronics, defence, and pharma as key to India's self-reliance. Shah advises against leveraged trading and emphasizes SIPs for retail investors. He suggests investing in index funds or flexi-cap funds to celebrate Independence Day. Patience, trust, and self-reliance are crucial investment principles.",
            "pubDate": "2025-08-14T06:50:18.687428"
        },
        {
            "title": "For investors with a long-term perspective: 5 large-caps from different sectors with an upside potential of up to 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-a-long-term-perspective-5-large-caps-from-different-sectors-with-an-upside-potential-of-up-to-34/articleshow/123299796.cms",
            "description": "When there is a cyclical or a global slowdown and there is uncertainty, every sector gets hurt. So, any company that claims it will not be impacted by what is happening these days is probably lying. Of course, some sectors are likely to suffer more because of the uncertainty compared to others. So, at this point of time, it would perhaps be better to focus on sectors which are largely domestic plays and companies where managements have a track record of dealing with economic slowdowns. There is a good reason to focus on them.",
            "pubDate": "2025-08-14T09:10:52.349297"
        },
        {
            "title": "Unique Picks: 10 stocks held by only one MF scheme in July; 5 surge 50-100% in just 4 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unique-picks-10-stocks-held-by-only-one-mf-scheme-in-july-5-surge-50-100-in-just-4-months/slideshow/123299897.cms",
            "description": "ETMarkets conducted an analysis of mutual fund portfolios to identify stocks uniquely held by individual mutual fund schemes. The initial screening for July 2025 revealed 199 such stocks. This list was then narrowed down to include only those with an equity mutual fund holding valued at over Rs 15 crore as of July 2025, leaving 17 stocks. From this refined group, we further analyzed share price performance since the start of the current fiscal year. As a result, we identified 10 standout stocks that have delivered gains between 15% and 105% in just over four months of FY26. (Data Source: ACE MF, ACE Equity).",
            "pubDate": "2025-08-14T09:10:52.349423"
        },
        {
            "title": "Ranbir Kapoor-backed stock zooms 10% after swinging back to profit in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ranbir-kapoor-ramayana-linked-stock-zooms-10-after-swinging-back-to-profit-in-q1/articleshow/123299341.cms",
            "description": "Prime Focus shares hit their 10% upper circuit on Thursday after the company returned to profit, reporting ₹110.47 crore net profit in Q1FY26 versus a Rs 158.07 crore loss a year ago. Revenue rose 22.8% YoY to ₹976.82 crore, and it also swung to profit from a ₹251.62 crore loss in the previous quarter.",
            "pubDate": "2025-08-14T09:10:52.349529"
        },
        {
            "title": "Japan's Nikkei pulls back from record high on rate-hike fears, stronger yen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-pulls-back-from-record-high-on-rate-hike-fears-stronger-yen/articleshow/123299095.cms",
            "description": "Japan's Nikkei share average fell on Thursday, pulling back from a record high scaled in the previous session on concerns over a potential shift in Bank of Japan policy and a stronger yen.",
            "pubDate": "2025-08-14T09:10:52.349632"
        },
        {
            "title": "European shares hit two-week high as investors gauge earnings, economic data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-hit-two-week-high-as-investors-gauge-earnings-economic-data/articleshow/123299033.cms",
            "description": "European shares edged higher to touch a two-week high on Thursday, as investors assessed corporate earnings and economic data.",
            "pubDate": "2025-08-14T09:10:52.349727"
        },
        {
            "title": "JSW Cement shares fall over 5% post market debut. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-cement-shares-fall-over-5-post-market-debut-what-should-investors-do/articleshow/123297991.cms",
            "description": "JSW Cement debuted on the bourses at a 4% premium but quickly slid over 5% from its opening price, despite strong IPO demand and higher-than-expected grey market premiums. Analysts cite rich valuations and recent losses as near-term headwinds, though long-term prospects remain supported by capacity expansion and infrastructure growth.",
            "pubDate": "2025-08-14T09:10:52.349825"
        },
        {
            "title": "Market Wrap: Sensex, Nifty snap 6-week losing streak as investors eye Russia-U.S. talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-snap-6-week-losing-streak-as-investors-eye-russia-u-s-talks/articleshow/123301929.cms",
            "description": "Indian benchmark indices closed higher on Thursday, breaking a six-week losing run driven by trade tensions and muted quarterly earnings, with gains in Infosys after it agreed to buy a stake in Australia’s Versent Group.",
            "pubDate": "2025-08-14T10:54:27.693940"
        },
        {
            "title": "Stock market holiday: Are NSE, BSE closed on August 15 for Independence Day?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-are-nse-bse-closed-on-august-15-for-independence-day/articleshow/123301136.cms",
            "description": "Indian equity and commodity markets, including BSE, NSE, MCX, and NCDEX, will remain closed on August 15, 2025, for Independence Day, with trading to resume on August 18 across all segments.",
            "pubDate": "2025-08-14T10:54:27.694072"
        },
        {
            "title": "Sensex and Nifty ripe for a short-term rebound, says Jefferies, picks 8 stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-and-nifty-ripe-for-a-short-term-rebound-says-jefferies-picks-8-stocks/articleshow/123300709.cms",
            "description": "Indian stocks may witness a short-lived rebound driven by robust domestic buying, strong September earnings, and easing trade tensions, though sustainability concerns remain.",
            "pubDate": "2025-08-14T10:54:27.694290"
        },
        {
            "title": "S&P 500, Nasdaq retreat from record rally after hot producer inflation data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-retreat-from-record-rally-after-hot-producer-inflation-data/articleshow/123306423.cms",
            "description": "The S&P 500 and Nasdaq faced a setback, moving away from record highs. This happened after a report showed that producer prices were higher than expected. This news has made investors less hopeful about the Federal Reserve possibly cutting interest rates later this year. The Dow Jones Industrial Average also experienced a slight decrease at the start of trading.",
            "pubDate": "2025-08-14T13:59:20.792160"
        },
        {
            "title": "Sebi launches investor awareness campaign on AIR to curb fraudulent activities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-launches-investor-awareness-campaign-on-air-to-curb-fraudulent-activities/articleshow/123305372.cms",
            "description": "Markets regulator Sebi on Thursday announced the launch of an investors' awareness campaign on All India Radio (AIR) specifically on frauds related to the securities market taking place through social media platforms.",
            "pubDate": "2025-08-14T13:59:20.792281"
        },
        {
            "title": "Top 10 large-caps with rising retail investor holding in June quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-10-large-caps-with-rising-retail-investor-holding-in-june-quarter/slideshow/123304501.cms",
            "description": "",
            "pubDate": "2025-08-14T13:59:20.792389"
        },
        {
            "title": "Stock Radar: Fortis Healthcare hits fresh record highs in August; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-fortis-healthcare-hits-fresh-record-highs-in-august-time-to-buy-or-book-profits/articleshow/123281934.cms",
            "description": "Fortis Healthcare stock is showing a strong upward trend since January 2025. It hit a record high in August. Experts suggest the rally will likely continue. Short-term traders might consider buying. The target price is Rs 1,045 in the coming weeks. The stock has surged significantly in the past week, month, and three months.",
            "pubDate": "2025-08-14T13:59:20.792499"
        }
    ]
}