{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-09T02:49:29.302931",
    "items": [
        {
            "title": "Bajaj Finserv completes acquisition of Allianz stake in insurance JVs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-completes-acquisition-of-allianz-stake-in-insurance-jvs/articleshow/126425104.cms",
            "description": "Bajaj Finserv and its promoter group have acquired a combined 97% stake in Bajaj Allianz General Insurance and Bajaj Allianz Life Insurance from Allianz SE, concluding a 20-year partnership.  The transactions, finalized through share purchase agreements, significantly increased Bajaj Finserv's direct holdings to 75.01% in both entities.",
            "pubDate": "2026-01-09T00:46:37.071409"
        },
        {
            "title": "FPI Registration: Sebi allows digital signatures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpi-registration-sebi-allows-digital-signatures/articleshow/126425067.cms",
            "description": "The Securities and Exchange Board of India (Sebi) has simplified the foreign portfolio investor (FPI) registration process by introducing digital signatures. This new functionality, integrated into the common application form (CAF) portal, allows applicants to apply for DSC directly while submitting their registration, creating a unified and streamlined onboarding experience.",
            "pubDate": "2026-01-09T00:46:37.071537"
        },
        {
            "title": "Electronics stocks need a spark of profit for D-St vibe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/electronics-stocks-need-a-spark-of-profit-for-d-st-vibe/articleshow/126425019.cms",
            "description": "JP Morgan anticipates 2026 will be a crucial year for India's electronics manufacturing services (EMS) sector, with stocks facing a significant test after underperforming in 2025. A sustained recovery for these shares will depend on companies demonstrating improved profitability, with key triggers including the extension of the mobile PLI scheme and the rollout of ISM 2.0.",
            "pubDate": "2026-01-09T00:46:37.071639"
        },
        {
            "title": "Exporters shares slump on US warning of higher tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/exporters-shares-slump-on-us-warning-of-higher-tariffs/articleshow/126424941.cms",
            "description": "Indian exporter shares fell sharply. Donald Trump's support for a bill proposing 500% tariffs on Indian imports caused panic. This could significantly increase existing tariffs. Textile, apparel, seafood, and drug makers saw their shares drop. Experts advise caution and focusing on domestic companies. Clarity on the tariffs is awaited.",
            "pubDate": "2026-01-09T00:46:37.071738"
        },
        {
            "title": "Credit costs rise for Shapoorji Pallonji Group firm as refinancing timeline slips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-costs-rise-for-shapoorji-pallonji-group-firm-as-refinancing-timeline-slips/articleshow/126425083.cms",
            "description": "The step-up was triggered after Goswami Infratech, a borrower linked to the structure, did not complete a refinancing by December end, said the people cited above. Although not a covenant breach, the delay requires existing borrowings to be repriced if fresh debt was raised at a higher cost.",
            "pubDate": "2026-01-09T00:46:37.071953"
        },
        {
            "title": "Premium gain, margin strain likely for insurers in December quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premium-gain-margin-strain-likely-for-insurers-in-december-quarter/articleshow/126425080.cms",
            "description": "Most large life insurers, including LIC, HDFC Life, Axis Max and SBI Life, are set to post double-digit APE growth in Oct–Dec 2025, aided by GST tailwinds and a favourable base after new surrender value norms.",
            "pubDate": "2026-01-09T00:46:37.072054"
        },
        {
            "title": "IndusInd Bank plans bigger board for better governance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-plans-bigger-board-for-better-governance/articleshow/126425087.cms",
            "description": "The bank is considering increasing its board strength to around a dozen members from the current nine with the aim of strengthening oversight and aligning with evolving regulatory expectations. Currently, managing director and CEO Rajiv Anand is the only executive on the board. Others are non-executive and independent directors.",
            "pubDate": "2026-01-09T00:46:37.072148"
        },
        {
            "title": "Banks narrow NBFCs’ lead as India’s gold loan market turns nearly 50-50",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-narrow-nbfcs-lead-as-indias-gold-loan-market-turns-nearly-50-50/articleshow/126425072.cms",
            "description": "NBFCs' share of aggregate gold loans fell by nearly 20 percentage points over the past five years to 50.3% as of March 2025, from 69.4% in 2020. In the same period, banks increased their share to 49.7% from 30.6%, data showed.",
            "pubDate": "2026-01-09T00:46:37.072248"
        },
        {
            "title": "Stocks to buy in 2026: Titan, Waaree Energies among 5 stocks that could give double digit returns in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-titan-waaree-energies-among-5-stocks-that-could-give-double-digit-returns-in-long-term/slideshow/126425683.cms",
            "description": "Brokerage houses continue to stay bullish on select stocks across consumption, renewable energy, and financial services, highlighting strong growth visibility and attractive upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-09T02:49:20.439551"
        },
        {
            "title": "Negative Breakout: These 11 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-11-stocks-cross-below-their-200-dmas/slideshow/126425646.cms",
            "description": "In the Nifty200 pack, the closing prices of 16 stocks fell below their 200-day moving averages on January 8, according to StockEdge.com's technical scan data. Of these, we highlighted 11 stocks that slipped more than 2.5%. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2026-01-09T02:49:20.439674"
        },
        {
            "title": "GIFT Nifty up 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126425267.cms",
            "description": "Indian stock markets saw a sharp decline on Thursday. The Nifty dropped significantly as investors worried about potential US tariffs. Foreign institutional investors continued to sell shares. Global markets also showed weakness. Analysts expect the market to remain under pressure in the near term. The India VIX, a measure of market fear, surged. The rupee weakened against the US dollar.",
            "pubDate": "2026-01-09T02:49:20.439779"
        },
        {
            "title": "Stocks in news: RIL, BHEL, NTPC, Bharat Forge, Ashok Leyland",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-bhel-ntpc-bharat-forge-ashok-leyland/articleshow/126425250.cms",
            "description": "Markets closed lower on Thursday due to weak global cues, with the Nifty breaching a key support level. Several companies are in focus today: Bharat Forge partnered with Agile Robots for AI automation, BHEL secured a coal gasification order, RIL may consider buying Venezuelan oil, NTPC plans nuclear power projects, and Ashok Leyland inaugurates its new EV plant.",
            "pubDate": "2026-01-09T02:49:20.439879"
        },
        {
            "title": "Asian stocks edge up before US jobs data, tariff ruling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-up-before-us-jobs-data-tariff-ruling/articleshow/126425212.cms",
            "description": "Asian equities saw a modest rise after a two-day decline, as investors awaited US payrolls data and a potential Supreme Court ruling on President Trump's tariffs.  Money has shifted from tech giants to smaller companies, with the Russell 2000 outperforming the Nasdaq 100.  US jobs data will offer clues on the Federal Reserve's interest rate path.",
            "pubDate": "2026-01-09T02:49:20.439983"
        },
        {
            "title": "Will proposed US tariffs trigger further Indian market decline? Experts weigh in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-proposed-us-tariffs-trigger-further-indian-market-decline-experts-weigh-in/articleshow/126425157.cms",
            "description": "Indian stock markets experienced a significant drop on Thursday, with major indices falling around 1 percent. This decline, the steepest since August, was triggered by news of proposed steep tariffs on Russian oil imports. Investors are now closely watching the US Supreme Court's decision on the legality of these tariffs.",
            "pubDate": "2026-01-09T02:49:20.440082"
        },
        {
            "title": "RBI plans cooling-off for UCB directors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-plans-cooling-off-for-ucb-directors/articleshow/126425124.cms",
            "description": "The Reserve Bank of India is proposing new guidelines for co-operative banking, mandating a three-year cooling-off period for urban co-operative bank directors after a decade of continuous service. During this time, directors can only be members or customers, though they may serve on other bank boards.",
            "pubDate": "2026-01-09T02:49:20.440178"
        },
        {
            "title": "CVC Capital Partners leads race to buy ValueLabs at $1–1.2 billion valuation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cvc-capital-partners-leads-race-to-buy-valuelabs-at-11-2-billion-valuation/articleshow/126425342.cms",
            "description": "CVC has an exclusivity agreement with ValueLabs, founded in 1997 by Arjun Rao Donakanti (87% owner). Promoters may retain 15–20% and management will continue running the firm.",
            "pubDate": "2026-01-09T02:49:20.440386"
        }
    ]
}