{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-13T15:48:51.968007",
    "items": [
        {
            "title": "Q3 results today: Hindalco among 460 companies to announce earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-hindalco-among-460-companies-to-announce-earnings-on-thursday/articleshow/118197248.cms",
            "description": "About 460 companies are set to announce their Q3 earnings, including Hindalco and SJVN. Hindalco is expected to show robust growth, with a 62% YoY profit increase and an 11% revenue rise due to higher aluminium and alumina prices. Novelis may struggle with lower EBITDA due to tight scrap availability and flooding impacts at its Swiss plant.",
            "pubDate": "2025-02-13T06:46:46.720407"
        },
        {
            "title": "Q3 Hits & Misses: How various sectors performed in the latest quarter?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-hits-misses-how-various-sectors-performed-in-latest-quarterly-results/articleshow/118196223.cms",
            "description": "The October-December quarter results showcased a mixed performance across sectors. Consumer-centric markets witnessed rural demand recovery, while urban demand remained muted. Banks faced NIM pressure but reported strong profit growth. IT, pharma, and telecom sectors displayed growth, although with certain challenges impacting margins and volume growth.",
            "pubDate": "2025-02-13T06:46:46.720531"
        },
        {
            "title": "HCC Q3 Results: Company posts consolidated loss of Rs 39 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcc-q3-results-company-posts-consolidated-loss-of-rs-39-crore/articleshow/118216511.cms",
            "description": "Hindustan Construction Company (HCC) on Thursday reported a consolidated loss of Rs 38.92 crore in the December quarter of 2024, largely on account of change in tax regime.",
            "pubDate": "2025-02-13T13:13:55.922773"
        },
        {
            "title": "SJVN Q3 results: Cons PAT up 7% at Rs 149 crore, revenue jumps 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sjvn-q3-results-cons-pat-up-7-at-rs-149-crore-revenue-jumps-23/articleshow/118219752.cms",
            "description": "SJVN Q3 Results: SJVN reported a 7% YoY rise in Q3FY25 net profit to ₹149 crore, with revenue growing 23% to ₹671 crore. However, sequentially, PAT declined 66%, and the company announced an interim dividend of ₹1.15 per share.",
            "pubDate": "2025-02-13T15:48:50.068376"
        },
        {
            "title": "Hindalco Industries Q3 Results: Cons PAT jumps 60% YoY to Rs 3,735 crore, revenue up 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindalco-industries-q3-results-cons-pat-jumps-60-yoy-to-rs-3735-crore-revenue-up-11/articleshow/118217622.cms",
            "description": "Hindalco Industries Q3 Results: Revenue from operations in Q3FY25 reached Rs 58,390 crore, marking an 11% increase from Rs 52,808 crore in the same quarter last year. The Aditya Birla Group's flagship company posted a 4.4% sequential decline in profit after tax, down from Rs 3,909 crore in Q2FY25. However, revenue saw a slight 0.32% quarter-on-quarter increase, reaching Rs 58,203 crore in the July-September period.",
            "pubDate": "2025-02-13T15:48:50.068488"
        },
        {
            "title": "Kalpataru Projects International Q3 Results: Net profit down 3% to Rs 139 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kalpataru-projects-international-q3-results-net-profit-down-3-to-rs-139-cr/articleshow/118217420.cms",
            "description": "Kalpataru Projects International on Thursday reported a marginal dip of 3 per cent in consolidated net profit to Rs 139.59 crore in the December 2024 quarter.",
            "pubDate": "2025-02-13T15:48:50.068587"
        }
    ]
}