{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-19T03:00:25.079579",
    "items": [
        {
            "title": "What Tiger Global ruling means for foreign investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-tiger-global-ruling-means-for-foreign-investors/articleshow/126665134.cms",
            "description": "A Supreme Court ruling impacts foreign investors in India. Investors can no longer use only a Tax Residency Certificate for tax benefits. Tax authorities will now examine the business substance of overseas investment structures. This affects private equity and other foreign portfolio investors, particularly those using Mauritius and Singapore.",
            "pubDate": "2026-01-19T00:53:33.892248"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126650964.cms",
            "description": "Indian equity markets closed marginally higher on Friday, buoyed by positive sentiment in the IT and banking sectors. Analysts anticipate a sideways trading range in the near term, with stock-specific movements driven by earnings and trade developments. Geopolitical escalations remain a key risk factor.",
            "pubDate": "2026-01-19T00:53:33.892346"
        },
        {
            "title": "Stocks in news: RIL, ICICI Bank, HDFC Bank, Bharat Coking Coal, Tata Technologies, Wipro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-icici-bank-hdfc-bank-bharat-coking-coal-tata-technologies-wipro/articleshow/126650792.cms",
            "description": "Indian markets ended marginally higher, extending their consolidation phase. Investors await key Q3 earnings from Reliance Industries, HDFC Bank, and ICICI Bank for directional cues. Analysts advise a selective, stock-specific approach, focusing on IT, financials, and metals amid volatility.",
            "pubDate": "2026-01-19T00:53:33.892520"
        },
        {
            "title": "China's tech stock boom pushes past economic malaise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-tech-stock-boom-pushes-past-economic-malaise/articleshow/126665015.cms",
            "description": "China's tech sector is experiencing a significant rally in early 2026, driven by advancements in AI, commercial rockets, robotics, and flying cars. This surge in homegrown technologies is outperforming global benchmarks, fueled by investor optimism about China's ambition to lead in AI and high-level chips, even amidst economic fragilities.",
            "pubDate": "2026-01-19T00:53:33.892602"
        },
        {
            "title": "Nifty needs 25,900 break for fresh upside amid volatility: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-needs-25900-break-for-fresh-upside-amid-volatility-analysts/articleshow/126664873.cms",
            "description": "Indian markets are experiencing indecision and rising volatility. Analysts highlight key levels for Nifty. A close above 25,900 could boost the index towards 26,300. Conversely, a break below 25,500 may signal further declines. Traders are advised to await clear direction. Top stock picks include Canara Bank, Tech Mahindra, Rail Vikas Nigam, Bank of India, and Ultratech Cement.",
            "pubDate": "2026-01-19T00:53:33.892688"
        },
        {
            "title": "Sun Pharma looks to rise in US with $10 billion Organon buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-looks-to-rise-inus-with-10-billion-organon-buy/articleshow/126665159.cms",
            "description": "India's largest drugmaker, Sun Pharma, is considering a major acquisition. The company is evaluating the purchase of US-based Organon, a specialist in women's health. This potential deal is valued at around $10 billion. A successful acquisition would be a significant move for Sun Pharma, strengthening its presence in the US market.",
            "pubDate": "2026-01-19T00:53:33.892847"
        },
        {
            "title": "Priority sector lending: RBI asks HDFC, ICICI banks to make extra provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/priority-sector-lending-rbi-asks-hdfc-icici-banks-to-make-extra-provisions/articleshow/126665058.cms",
            "description": "ICICI Bank and HDFC Bank have been instructed by a regulator to make significant one-time provisions. ICICI Bank must set aside an additional Rs 1,283 crore, while HDFC Bank is required to allocate Rs 500 crore. The regulator has also urged both banks to identify and address shortcomings in their loan portfolios. These adjustments are necessary to ensure compliance with Priority Sector Lending (PSL) norms.",
            "pubDate": "2026-01-19T00:53:33.892928"
        },
        {
            "title": "India needs to narrow the insurance protection gap: Swiss Re",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-needs-to-narrow-the-insurance-protection-gap-swiss-re/articleshow/126664972.cms",
            "description": "India's total property exposure is now estimated at $26-29 trillion, according to a global reinsurer. A significant portion of this exposure is located in areas prone to natural disasters. These regions are characterized by a high concentration of economic assets that coincide with risks such as floods, cyclones, and earthquakes.",
            "pubDate": "2026-01-19T00:53:33.893006"
        },
        {
            "title": "Cutting risk cuts microfin's portfolio, recovery way off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cutting-risk-cuts-microfins-portfolio-recovery-way-off/articleshow/126664958.cms",
            "description": "Microfinance loan portfolios have been declining since April 2024, according to industry leaders. This trend began after reaching a high of Rs 3.43 lakh crore. The decrease is attributed to loan repayments exceeding new loan disbursements across the sector.",
            "pubDate": "2026-01-19T00:53:33.893089"
        },
        {
            "title": "Negative Breakout: These 11 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-11-stocks-cross-below-their-200-dmas/slideshow/126665789.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, 11 stocks' closing prices crossed below their 200 DMA (Daily Moving Averages) on January 16, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2026-01-19T03:00:22.971715"
        },
        {
            "title": "Defrail Technologies shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defrail-technologies-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/126665736.cms",
            "description": "Defrail Technologies' shares are trading at a 23% grey market premium ahead of their BSE SME listing on January 19. The Rs 14 crore IPO, priced at Rs 74, was oversubscribed 105 times, indicating strong investor interest. The company, a manufacturer of rubber parts for automotive, railways, and defence, is expected to list around Rs 90-92.",
            "pubDate": "2026-01-19T03:00:22.971830"
        },
        {
            "title": "Asian stocks dip, gold hits record as tariff woes return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-dip-gold-hits-record-as-tariff-woes-return/articleshow/126665337.cms",
            "description": "Markets reacted negatively as US President Donald Trump proposed new tariffs on eight European nations. This move revived tariff concerns, causing risk assets to slip and safe-haven demand to strengthen. Gold and silver prices surged to record highs. Equity futures slumped, and the dollar weakened.",
            "pubDate": "2026-01-19T03:00:22.971917"
        }
    ]
}