{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-02T08:54:40.411115",
    "items": [
        {
            "title": "GM Breweries tops October charts with 75% gain as indices snap winning streak. Check other monthly winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gm-breweries-tops-october-charts-with-75-gain-as-indices-snap-winning-streak-check-other-monthly-winners/articleshow/125028673.cms",
            "description": "Indian equities concluded October with a muted performance, ending a four-week winning streak as benchmark indices saw marginal declines due to profit-booking and mixed global cues. Despite volatility, GM Breweries emerged as a top performer, surging 74.77% in the smallcap segment, while other stocks across BSE 500, midcap, and smallcap categories also posted significant monthly gains.",
            "pubDate": "2025-11-02T04:13:17.800325"
        },
        {
            "title": "FII activity, Q2 earnings among 7 factors to affect D-St this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-activity-q2-earnings-among-7-factors-to-affect-d-st-this-week/articleshow/125028606.cms",
            "description": "Indian markets closed marginally lower, ending a four-week winning streak amid profit-booking and mixed global cues. Key factors influencing the upcoming week include Q2 earnings from major companies, macroeconomic data releases, and global developments. FIIs were net sellers, while DIIs were net buyers on Friday.",
            "pubDate": "2025-11-02T04:13:17.800456"
        },
        {
            "title": "Berkshire Hathaway's profits rise 17% as Warren Buffett prepares to step down as CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-hathaways-profits-rise-17-as-warren-buffett-prepares-to-step-down-as-ceo/articleshow/125028559.cms",
            "description": "The profits of Warren Buffett 's company improved 17% thanks to a relatively mild hurricane season and more paper investment gains this year as Berkshire Hathaway prepares for the legendary 95-year-old investor to relinquish the CEO title in January.",
            "pubDate": "2025-11-02T04:13:17.800659"
        },
        {
            "title": "Vedanta well-positioned to gain from commodity cycle, deleveraging efforts: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-well-positioned-to-gain-from-commodity-cycle-deleveraging-efforts-analysts/articleshow/125031055.cms",
            "description": "Vedanta's second-quarter results met street expectations on robust operational performance, with analysts viewing the miner as well-positioned to benefit from the commodity rebound while advancing its deleveraging strategy.",
            "pubDate": "2025-11-02T08:54:30.522145"
        },
        {
            "title": "For investors with ability to buy businesses, not just stocks: 10 stocks from different sectors which increase probability of wealth creation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-with-ability-to-buy-businesses-not-just-stocks-10-stocks-from-different-sectors-which-increase-probability-of-wealth-creation/articleshow/125030324.cms",
            "description": "How many air conditioners/mobile phones were sold in India 15 years back? How many are sold today? Do tariffs make any difference to a hydel or thermal or a green energy unit? Do tariffs impact an FMCG company with the best brands in the cooking oil and hair care categories? The answer to all these questions will lead to an assessment of a business and its ability to grow, and not to stock prices in the short term. Start investing by asking questions. Because, in the short term, many things impact stock prices, but in the end it is the core business that matters to the street.",
            "pubDate": "2025-11-02T08:54:30.522253"
        },
        {
            "title": "10 midcap stocks with upside potential of up to 42% returns! Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-midcap-stocks-with-upside-potential-of-up-to-42-returns-do-you-own-any/slideshow/125030120.cms",
            "description": "Analyst forecasts are more than just numbers; they provide a forward-looking perspective on market potential. For investors seeking the next breakout opportunities, a fresh review of BSE Mid-Cap stocks uncovers several promising contenders.Based on market analysts' consensus estimates, Trendlyne data indicates that a number of mid-cap stocks are expected to deliver strong returns over the next 12 months. This projected upside reflects the average anticipated gain during this period, offering a data-driven roadmap for investors exploring high-potential mid-cap opportunities. We highlight 10 standout mid-cap stocks with an estimated upside potential ranging between 25% and 42% in the coming year.",
            "pubDate": "2025-11-02T08:54:30.522372"
        },
        {
            "title": "Berkshire Hathaway sold another $6 billion in stocks. What does it signal about current markets?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-hathaway-sold-another-6-billion-in-stocks-what-does-it-signal-about-current-markets/articleshow/125029721.cms",
            "description": "Warren Buffett's Berkshire Hathaway continues to signal market caution, selling more stocks than it bought for the 12th consecutive quarter, swelling its cash pile to a record $381.7 billion. Despite strong operating profits, the company's sustained defensive stance and lack of share buybacks suggest limited near-term upside, even as Warren Buffett prepares to step down as CEO.",
            "pubDate": "2025-11-02T08:54:30.522465"
        },
        {
            "title": "Nifty takes a breather, but analysts see uptrend still intact. 3 stocks to buy for the week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-takes-a-breather-but-analysts-see-uptrend-still-intact-3-stocks-to-buy-for-the-week/articleshow/125029539.cms",
            "description": "Indian stock markets paused after a four-week rally. Profit booking emerged at higher levels, causing a mild dip. Analysts anticipate consolidation before a potential move towards 26,000. Global and domestic factors influenced the market tone. Strong domestic investor inflows provided support. Sectoral rotation is expected in the coming sessions.",
            "pubDate": "2025-11-02T08:54:30.522559"
        },
        {
            "title": "Winning bets: 10 smallcaps surged up to 55% in a week. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/winning-bets-10-smallcaps-surged-up-to-55-in-a-week-do-you-own-any/slideshow/125029312.cms",
            "description": "Smallcap stocks had a mixed run last week, with several counters rallying sharply on sector rotation and retail participation. Here are the 10 biggest smallcap gainers of the week ending October 31, 2025, with some soaring over 50%.",
            "pubDate": "2025-11-02T08:54:30.522655"
        },
        {
            "title": "Market Trading Guide: Buy Raghav Productivity and this smallcap stock on Monday for up to 11% potential gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-raghav-productivity-and-this-smallcap-stock-on-monday-for-up-to-11-potential-gains/articleshow/125029182.cms",
            "description": "Nifty declined for the second straight session amid profit booking and weakness in banking heavyweights HDFC Bank and ICICI Bank. Analysts expect short-term weakness with support at 25,525. Experts recommend Raghav Productivity Enhancers and Choice International for Monday, offering potential gains of up to 11%.",
            "pubDate": "2025-11-02T08:54:30.522749"
        },
        {
            "title": "Bharti Airtel Q2 Preview: PAT may jump 64% on steady India, Africa performance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-q2-preview-pat-may-jump-64-on-steady-india-africa-performance/articleshow/125029116.cms",
            "description": "Bharti Airtel is poised for a strong Q2 FY26, with revenue projected to rise 21% year-on-year and net profit surging 64%. Growth is fueled by its India mobile business, Africa operations, and expanding home broadband and enterprise segments, driven by higher ARPU and data usage.",
            "pubDate": "2025-11-02T08:54:30.522844"
        },
        {
            "title": "​13 penny stocks crash up to 55% in a month! Are they in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/13-penny-stocks-crash-up-to-55-in-a-month-are-they-in-your-portfolio/slideshow/125028828.cms",
            "description": "Over the past month, 13 penny stocks have suffered significant losses, dropping between 20% and 55% in their share prices. These laggards were identified through a focused screening process that considered companies with a market capitalisation under Rs 1,000 crore, a share price below Rs 20, and a minimum recent trading volume of 5 lakh shares. The approach aims to spotlight low-priced, actively traded penny stocks that have seen substantial declines. (Data Source: ACE Equity)Although penny stocks often attract investors with their low entry prices and potential for rapid gains, they come with substantial risks. Due to low liquidity, high volatility, and limited transparency, they are prone to manipulation and sudden drops. Without a clear strategy and strong risk controls, investors may face more losses than gains.",
            "pubDate": "2025-11-02T08:54:30.522936"
        }
    ]
}