{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-18T03:44:01.624107",
    "items": [
        {
            "title": "Marico, IEX among 8 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/marico-iex-among-8-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123962539.cms",
            "description": "There was a notable surge in futures open interest for eight stocks in the NSE F&O pack as of September 17, contributing to a total increase in open interest of over 5.5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-18T03:43:40.619890"
        },
        {
            "title": "Yes Bank shares in focus as SBI sells 13.18% stake to Japan’s SMBC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-as-sbi-sells-13-18-stake-to-japans-smbc/articleshow/123962327.cms",
            "description": "Yes Bank share price: State Bank of India has sold a 13.18% stake in Yes Bank to Japan’s SMBC, marking the largest cross-border banking divestment in India. SMBC aims to raise its holding to just under 25% and will nominate two directors to Yes Bank’s board.",
            "pubDate": "2025-09-18T03:43:40.620015"
        },
        {
            "title": "​Sun Pharma,  Ambuja Cements among 8 stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-ambuja-cements-among-8-stocks-showing-rsi-trending-up/slideshow/123962255.cms",
            "description": "Eight stocks from the NSE large cap segment were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-18T03:43:40.620120"
        },
        {
            "title": "Ambuja Cements shares in focus as Delhi HC sends 'Kawach' trademark dispute to mediation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambuja-cements-shares-in-focus-as-delhi-hc-sends-kawach-trademark-dispute-to-mediation/articleshow/123961989.cms",
            "description": "Ambuja Cements share price: The Delhi High Court has directed Ambuja Cements and JSW Cement to explore mediation in a trademark dispute over the use of “Kawach,” with Ambuja alleging infringement of its registered brand “Ambuja Kawach.” The next hearing is scheduled for October 15.",
            "pubDate": "2025-09-18T03:43:40.620225"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Prestige Estate, HPCL among 5 stocks that could give 13-50% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-prestige-estate-hpcl-among-5-stocks-that-could-give-13-50-return/slideshow/123961954.cms",
            "description": "Brokerages have turned upbeat on a mix of real estate, cement, oil & gas, and FMCG names, citing strong earnings visibility and sectoral tailwinds.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-18T03:43:40.620343"
        },
        {
            "title": "NSDL, PG Electroplast to trade ex-dividend on Friday. Last chance to buy today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsdl-pg-electroplast-to-trade-ex-dividend-on-friday-last-chance-to-buy-today/articleshow/123961700.cms",
            "description": "National Securities Depository Limited and PG Electroplast will trade ex-dividend soon. The record date is set for Friday, September 19, 2025. NSDL will give a dividend of Rupees 2 per share. PG Electroplast has announced a dividend of Rupees 0.25. Investors should note the dates to be eligible for the dividend. This is NSDL's first dividend payout after its listing.",
            "pubDate": "2025-09-18T03:43:40.620446"
        },
        {
            "title": "Zydus Wellness 1:5 stock split: Shares start trading ex-split on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-wellness-15-stock-split-shares-start-trading-ex-split-on-thursday/articleshow/123961655.cms",
            "description": "Zydus Wellness shares will trade ex-split on exchanges. The face value reduces from Rs 10 to Rs 2. The record date is September 18, 2025. This split increases the number of shares. It also improves liquidity for retail investors. Post-split, shareholders get five shares for each share held. The adjusted stock price will reflect this change.",
            "pubDate": "2025-09-18T03:43:40.620545"
        },
        {
            "title": "Kesar Enterprises to trade ex-split basis for 10:1 sub-division from today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kesar-enterprises-to-trade-ex-split-basis-for-101-sub-division-from-today/articleshow/123961560.cms",
            "description": "Kesar Enterprises shares will trade ex-split on September 18. The stock split ratio is 10:1. The face value reduces from Rs 10 to Rs 1. The record date is September 18, 2025. Shareholders on this date will get split shares. This corporate action increases share liquidity. Each shareholder gets ten shares for every one held.",
            "pubDate": "2025-09-18T03:43:40.620638"
        },
        {
            "title": "Mazagon Dock, NALCO, Bharat Dynamics and MOIL to trade ex-dividend on Friday. Last chance to buy today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mazagon-dock-nalco-bharat-dynamics-and-moil-to-trade-ex-dividend-on-friday-last-chance-to-buy-today/articleshow/123961457.cms",
            "description": "Mazagon Dock Shipbuilders, NALCO, Bharat Dynamics, and MOIL will trade ex-dividend on Thursday, with Friday, September 19, 2025, as the record date. Investors must buy shares today to be eligible for dividends. Mazagon Dock offers Rs 2.71 per share, NALCO Rs 2.50, Bharat Dynamics Rs 0.65, and MOIL Rs 1.61.",
            "pubDate": "2025-09-18T03:43:40.620731"
        },
        {
            "title": "Maruti Suzuki among 5 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-among-5-stocks-witness-5-year-swing-high-breakout/slideshow/123961360.cms",
            "description": "In the Nifty500 segment, five stocks witnessed a 5-year swing high at the close on September 17, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-18T03:43:40.620824"
        },
        {
            "title": "Tourism Finance shares to turn ex-split on Friday; last chance for investors to buy today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tourism-finance-shares-to-turn-ex-split-on-friday-last-chance-for-investors-to-buy-today/articleshow/123961247.cms",
            "description": "Tourism Finance Corp (TFCI) will trade ex-split on Friday, with today being the last chance for investors to buy the stock before the split. The company is splitting its shares in a 1:5 ratio to boost liquidity and make the stock more accessible to retail investors.",
            "pubDate": "2025-09-18T03:43:40.620914"
        },
        {
            "title": "Airfloa Rail Technology shares to debut today: Pre-listing buzz peaks with 121% GMP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/airfloa-rail-technology-shares-to-debut-today-pre-listing-buzz-peaks-with-121-gmp/articleshow/123961115.cms",
            "description": "Airfloa Rail Technology's IPO is set to debut on Thursday, generating significant investor excitement. The IPO witnessed a subscription of over 301 times, driven by strong fundamentals, marquee projects, and favorable market conditions. The company's robust financial performance and involvement in railway modernization projects like Vande Bharat Express have further fueled investor interest.",
            "pubDate": "2025-09-18T03:43:40.621002"
        },
        {
            "title": "Ashish Kacholia-backed smallcap stock goes ex-dividend on Friday. Last chance to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-smallcap-stock-goes-ex-dividend-on-friday-last-chance-to-buy/articleshow/123961041.cms",
            "description": "Investors seeking Balu Forge Industries' final dividend of Rs 0.15 per share, backed by Ashish Kacholia, must purchase shares by today, September 18. The record date is set for September 19, 2025, determining shareholder eligibility. Kacholia holds a 1.64% stake in the smallcap forging company, adding visibility to the stock.",
            "pubDate": "2025-09-18T03:43:40.621091"
        },
        {
            "title": "Positive Breakout: These 10 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-close-cross-above-their-200-dmas/slideshow/123960999.cms",
            "description": "In the Nifty500 pack, 10 stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on September 17, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-18T03:43:40.621178"
        },
        {
            "title": "Asian stocks, dollar tentative as traders assess Fed outlook following rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-dollar-tentative-as-traders-assess-fed-outlook-following-rate-cut/articleshow/123960905.cms",
            "description": "Global stock markets showed stability after the Federal Reserve reduced interest rates. Investors remained cautious as the central bank signaled a measured approach to further easing. US equity futures saw gains, while Asian markets like Korea and Taiwan also rose. The Bank of England is expected to maintain rates. The Bank of Canada already cut its key policy rate.",
            "pubDate": "2025-09-18T03:43:40.621269"
        },
        {
            "title": "Japan's Nikkei rises to intraday record on tech boost, Fed rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-to-intraday-record-on-tech-boost-fed-rate-decision/articleshow/123960828.cms",
            "description": "Japan's Nikkei soared to a new intraday record, driven by tech stocks, though a stronger yen curbed gains for exporters. The Nikkei 225 climbed 0.3% to 44,938.40, briefly hitting 45,055.99, surpassing the week's earlier record. Resonac Holdings and Screen Holdings led the surge, while Tokyo Electric Power and Tokyo Gas faced declines.",
            "pubDate": "2025-09-18T03:43:40.621374"
        }
    ]
}