{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-20T03:08:03.037395",
    "items": [
        {
            "title": "Wall Street closes higher with indexes notching weekly gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-higher-with-indexes-notching-weekly-gains/articleshow/124009253.cms",
            "description": "Wall Street's main indexes closed higher on Friday, securing a weekly gain fueled by FedEx's strong earnings and positive sentiment in the technology sector. Optimism surrounding AI-linked stocks and the Fed's anticipated rate cuts further boosted the market. However, concerns arose from a blocked funding bill and Lennar's disappointing forecast, adding a layer of caution to the overall positive trend.",
            "pubDate": "2025-09-20T03:08:00.242111"
        },
        {
            "title": "AIFs may soon need to report value of units to depositories",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aifs-may-soon-need-to-report-value-of-units-to-depositories/articleshow/124009127.cms",
            "description": "SEBI has proposed that Alternative Investment Funds (AIFs) should report the value of their units to depositories. This move aims to leverage the depository infrastructure, requiring AIFs to maintain updated Net Asset Value (NAV) of units issued to investors. The NAV of all units must be uploaded within 15 days of investment portfolio valuation.",
            "pubDate": "2025-09-20T03:08:00.242261"
        },
        {
            "title": "Markets slip 0.5% as US revokes Chabahar sanctions relief; weekly gains intact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-slip-0-5-as-us-revokes-chabahar-sanctions-relief-weekly-gains-intact/articleshow/124009084.cms",
            "description": "Indian equity indices experienced a decline of nearly 0.5% on Friday, ending a three-day winning streak due to US sanctions relief revocation concerning the Chabahar port. Despite Friday's dip, the indices concluded the week 0.8% higher, marking the third consecutive week of gains. Investors engaged in profit booking amidst tariff negotiation uncertainties, influencing market caution.",
            "pubDate": "2025-09-20T03:08:00.242471"
        },
        {
            "title": "Sebi verdict in Hindenburg probe lifts Adani stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-verdict-in-hindenburg-probe-lifts-adani-stocks/articleshow/124008957.cms",
            "description": "Adani Group shares surged following Sebi's clearance of the conglomerate and its founder from Hindenburg Research's accusations of stock manipulation and accounting fraud. The regulator found no evidence of fraudulent transactions, boosting investor confidence and adding ₹66,000 crore to the group's market capitalization.",
            "pubDate": "2025-09-20T03:08:00.242579"
        },
        {
            "title": "Standard treatment workflows to help expand health cover",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/standard-treatment-workflows-to-help-expand-health-cover/articleshow/124008986.cms",
            "description": "To standardize healthcare delivery and control rising medical inflation, ICMR, NHA, and WHO have developed 157 Standard Treatment Workflows across 28 specialties. This move aims to bring transparency in hospital billing, prevent overcharging, and ensure consistent, evidence-based treatment for all patients, potentially leading to more affordable health insurance premiums.",
            "pubDate": "2025-09-20T03:08:00.242679"
        }
    ]
}