{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-14T19:52:39.183068",
    "items": [
        {
            "title": "Asian stocks fall as Fed rate cut doubts emerge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fall-as-fed-rate-cut-doubts-emerge/articleshow/125313478.cms",
            "description": "Asian markets opened lower on Friday. Investors are worried about the US Federal Reserve's interest rate decisions. High valuations in technology shares also caused concern. Wall Street saw significant drops on Thursday. The pound weakened after reports of a U-turn on tax increases. Investors are now closely watching upcoming economic data.",
            "pubDate": "2025-11-14T01:24:31.095811"
        },
        {
            "title": "Broking firms see profit slide as Sebi curbs hit trading volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/broking-firms-see-profit-slide-as-sebi-curbs-hit-trading-volumes/articleshow/125313287.cms",
            "description": "Broking firms experienced a profit and revenue decline in the September quarter due to reduced market volumes and Sebi's new regulations. Stricter margin norms and the 'true-to-label' circular impacted earnings, while intense competition and technology spending increased costs. Analysts suggest the sector remains under pressure, with future performance dependent on non-broking revenue streams and regulatory stability.",
            "pubDate": "2025-11-14T01:24:31.095962"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125304858.cms",
            "description": "Nifty closed flat on Thursday, with profit booking in the final hour capping gains after three consecutive sessions. Analysts remain optimistic about equities due to easing inflation, exporter policy support, and positive corporate earnings. Today's session may experience heightened volatility due to the Bihar election outcome.",
            "pubDate": "2025-11-14T01:24:31.096073"
        },
        {
            "title": "Stocks in news: Hero MotoCorp, LG India, Nippon Life India AMC, J&K Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hero-motocorp-tata-motors-pv-lg-india-nippon-life-india-amc-jk-bank/articleshow/125304793.cms",
            "description": "Indian markets saw volatile trading and ended flat on weekly expiry day. Analysts suggest consolidation may follow the recent rally. Key sectors like banking and IT remain strong. Investors are advised to focus on specific stocks in banking, auto, and metals. Several companies like Hero MotoCorp, Tata Motors, and Eicher Motors reported their second-quarter results.",
            "pubDate": "2025-11-14T01:24:31.096171"
        },
        {
            "title": "Asian Paints jumps 8% in two days on strong Q2 and rival CEO exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-jumps-8-in-two-days-on-strong-q2-and-rival-ceo-exit/articleshow/125313041.cms",
            "description": "Asian Paints stock surged over 8% in two trading sessions, driven by a strong second-quarter performance and the exit of a rival CEO. The company's net profit jumped 43%, exceeding expectations and prompting price target upgrades from analysts. Despite renewed investor interest, some analysts remain cautious about a sustained rally, citing capped upsides after the recent run-up.",
            "pubDate": "2025-11-14T01:24:31.096270"
        },
        {
            "title": "DWS to buy 40% in Nippon Life India AIF business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dws-to-buy-40-in-nippon-life-india-aif-business/articleshow/125312956.cms",
            "description": "German firm DWS Group is acquiring a 40% stake in Nippon Life India Asset Management's alternatives business. This partnership aims to expand operations in alternatives, active, and passive assets. The companies will also jointly launch passive products. A global distribution arrangement is planned for India-focused mutual funds. The alternatives sector in India is poised for significant growth.",
            "pubDate": "2025-11-14T01:24:31.096369"
        },
        {
            "title": "M&M to enter life insurance market via 50:50 JV with Manulife",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-to-enter-life-insurance-market-via-5050-jv-with-manulife/articleshow/125312786.cms",
            "description": "Mahindra & Mahindra is entering the life insurance sector through a 50:50 joint venture with Canada's Manulife, committing up to ₹3,600 crore each. Operations are expected to launch within 15-18 months of regulatory approval, with a focus on underpenetrated rural and semi-urban markets. The venture aims for break-even around the tenth year.",
            "pubDate": "2025-11-14T01:24:31.096464"
        },
        {
            "title": "Stock Radar: InterGlobe Aviation breaks out from a falling trendline resistance; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-interglobe-aviation-breaks-out-from-a-falling-trendline-resistance-what-should-investors-do/articleshow/125296461.cms",
            "description": "InterGlobe Aviation Ltd has broken out of a falling trendline resistance on daily charts, signaling potential upside. Experts suggest short-term traders can buy the stock for a target above Rs 6,000 in the next 2-3 weeks, citing strong price action and sector fundamentals.",
            "pubDate": "2025-11-14T01:24:31.096556"
        },
        {
            "title": "Aviom India Housing Finance promoter offers to settle dues as six entities put in bids",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aviom-india-housing-finance-promoter-offers-to-settle-dues-as-six-entities-put-in-bids/articleshow/125313133.cms",
            "description": "According to the proposal, there would be an upfront payment of Rs 350 crore while the accrued interest would be paid in 24 months after the initial 26 months of principal payment. Ilmi's plan also includes full repayment to operational creditors and employees amounting to Rs 2.9 crore. She has also suggested that lenders appoint a professional CEO to run the company during the proposed repayment period. The proposal recommends the appointment of five directors, including two lender nominees, and includes an indemnity agreement between the company and these directors.",
            "pubDate": "2025-11-14T01:24:31.096645"
        },
        {
            "title": "RBI has room to cut rates, can't predict timing: Economists",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-has-room-to-cut-rates-cant-predict-timing-economists/articleshow/125313320.cms",
            "description": "\"While the inflation trajectory is likely to remain benign, the RBI will need to filter the festive and GST-related demand from the cyclical recovery,\" said Upasna Bharadwaj, chief economist, Kotak Mahindra Bank. \"We remain skeptical on the sustainability of the recent pickup in economic activity and, hence, see some room for further monetary easing.\"",
            "pubDate": "2025-11-14T01:24:31.096739"
        },
        {
            "title": "Policy support key for Tata Steel UK: CFO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/policy-support-key-for-tata-steel-uk-cfo/articleshow/125313246.cms",
            "description": "While losses narrowed year-on-year in the UK operations in the September quarter, the performance trailed the management's guidance. Back in 2024, Tata had said these operations would turn profitable at an operating level in FY25. Tata Steel is working on slashing costs. It is also engaging with the British government on policy-related issues as imports in certain product segments are higher than even the total consumption in the country.",
            "pubDate": "2025-11-14T01:24:31.096833"
        },
        {
            "title": "ICICI Bank, Hindalco and 3 other stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-hindalco-and-3-other-stocks-showing-bullish-rsi-upswing/slideshow/125315989.cms",
            "description": "Five stocks in the NSE large-cap segment were highlighted in the RSI Trending Up scan on November 13, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-14T03:59:23.735125"
        },
        {
            "title": "PG Electroplast shares in focus as Q2 PAT nosedives 88% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pg-electroplast-shares-in-focus-as-q2-pat-nosedives-88-yoy/articleshow/125315832.cms",
            "description": "PG Electroplast share price:  PG Electroplast reported an 88% YoY decline in Q2 PAT to Rs 2.38 crore, while revenue fell 2.4% to Rs 655.37 crore. EBITDA dropped 26.2% to Rs 44.68 crore. Room AC sales were impacted by early monsoons and GST changes, while washing machines saw 46.9% growth.",
            "pubDate": "2025-11-14T03:59:23.735275"
        },
        {
            "title": "Sagility India shares in focus as promoters likely to sell up to 16% stake via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sagility-india-shares-in-focus-as-promoters-likely-to-sell-up-to-16-stake-via-block-deal/articleshow/125315782.cms",
            "description": "Sagility India is likely to see heightened activity on November 14 as promoters plan to sell up to 16.4% stake through block deals. The base offer includes a 10% stake sale, with a 6.4% green shoe option. According to media report, the floor price is set at Rs 46.4 per share, about 8% below the current market price.",
            "pubDate": "2025-11-14T03:59:23.735395"
        },
        {
            "title": "Adani Power shares in focus on LoA from Assam Power Distribution for long-term supply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-in-focus-on-loa-from-assam-power-distribution-for-long-term-supply/articleshow/125315729.cms",
            "description": "Adani Power has won a major order from Assam Power Distribution Company Ltd to develop a 3,200 MW ultra-supercritical thermal power plant. APDCL will procure the full capacity, with phased commissioning starting December 2030. Morgan Stanley raised its target to Rs 185, citing robust growth, strong PPAs, regulatory clarity, and an expanded portfolio that positions APL for rising market share and earnings.",
            "pubDate": "2025-11-14T03:59:23.735496"
        },
        {
            "title": "Hero MotoCorp shares in focus as Q2 PAT rises 16% YoY to Rs 1,393 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-as-q2-pat-rises-16-yoy-to-rs-1393-crore/articleshow/125315670.cms",
            "description": "Hero MotoCorp share price: Hero MotoCorp reported a 16% YoY rise in Q2 net profit to Rs 1,393 crore, with revenue at Rs 12,126 crore. Vehicle volumes grew 11%, EBITDA rose 20%, and EV arm Vida achieved 11.7% market share, supported by strong festive season demand and international dispatch growth.",
            "pubDate": "2025-11-14T03:59:23.735593"
        },
        {
            "title": "Tata Motors (CV) shares in focus after reporting Rs 867 crore net loss in first quarterly results post listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-cv-shares-in-focus-after-reporting-rs-867-crore-net-loss-in-first-quarterly-results-post-listing/articleshow/125315439.cms",
            "description": "Tata Motors' commercial vehicle arm reported a Rs 867 crore net loss in Q2, a shift from last year's profit, despite a 6% revenue rise to Rs 18,585 crore. The loss stemmed from investment mark-to-market impacts. However, vehicle sales climbed 12%, with strong export growth, and operational efficiency improved.",
            "pubDate": "2025-11-14T03:59:23.735691"
        },
        {
            "title": "Eicher Motors shares in focus after Q2 PAT jumps 24% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eicher-motors-shares-in-focus-after-q2-pat-jumps-24-yoy/articleshow/125315383.cms",
            "description": "Eicher Motors' shares are poised for attention following a robust Q2 FY26 performance. The company reported a significant 24% year-on-year rise in consolidated net profit to Rs 1,369 crore, driven by a strong 45% revenue growth to Rs 6,172 crore. The commercial vehicle segment, particularly VECV, showed solid overall performance, with notable growth in heavy-duty trucks and exports.",
            "pubDate": "2025-11-14T03:59:23.735784"
        },
        {
            "title": "Last day to buy shares of these 5 companies to be eligible for interim dividends. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-these-5-companies-to-be-eligible-for-interim-dividends-do-you-own/articleshow/125315328.cms",
            "description": "Investors have a crucial deadline approaching to secure interim dividends from top companies. To be eligible for payouts from Balrampur Chini Mills, EPL Ltd, and others, shares must be bought by the close of trading today. The ex-dividend date is November 17, 2025. This means November 14 is the last chance to own these stocks and receive the declared dividends.",
            "pubDate": "2025-11-14T03:59:23.735875"
        },
        {
            "title": "Shining Tools IPO listing today. Here's what GMP indicates ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shining-tools-ipo-listing-today-heres-what-gmp-indicates-ahead-of-debut/articleshow/125315262.cms",
            "description": "Shining Tools' IPO closed with a modest 1.15 times subscription, indicating lukewarm investor interest. The company, a manufacturer of solid carbide cutting tools, is set to debut on the BSE SME platform with a flat grey market premium, suggesting a listing near its issue price of Rs 114. Proceeds will fund expansion and working capital.",
            "pubDate": "2025-11-14T03:59:23.735966"
        },
        {
            "title": "Curis Lifesciences IPO to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/curis-lifesciences-ipo-to-list-today-check-gmp-ahead-of-debut/articleshow/125315119.cms",
            "description": "Curis Lifesciences is set to list on the NSE SME platform on November 14, following an IPO that saw overwhelming investor response, subscribing 74.39 times. The company, which manufactures pharmaceutical formulations, reported strong financial growth in FY25. IPO proceeds will fund facility upgrades, working capital, and market expansion.",
            "pubDate": "2025-11-14T03:59:23.736056"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Ashok Leyland, Triveni Turbine among 5 stocks that could give 10-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-ashok-leyland-triveni-turbine-among-5-stocks-that-could-give-10-30-return/slideshow/125314963.cms",
            "description": "Brokerages have turned selectively positive across several mid- and large-cap names, highlighting improving fundamentals and valuation comfort.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-14T03:59:23.736144"
        },
        {
            "title": "Negative Breakout: These 10 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-cross-below-their-200-dmas/slideshow/125314827.cms",
            "description": "In the Nifty500 pack, 10 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on November 13, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-11-14T03:59:23.736239"
        },
        {
            "title": "Wall Street sinks as investors fret about rate cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-sinks-as-investors-fret-about-rate-cuts/articleshow/125313895.cms",
            "description": "Wall Street experienced significant declines on Thursday, driven by steep losses in AI heavyweights like Nvidia. Investors scaled back expectations of interest rate cuts due to inflation concerns and differing views among central bankers on the U.S. economy's health. This sentiment led to a market rotation away from technology stocks.",
            "pubDate": "2025-11-14T03:59:23.736346"
        },
        {
            "title": "Panic or cheer? Three possible Nifty reactions on volatile Bihar election results day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/panic-or-cheer-three-possible-nifty-reactions-on-volatile-bihar-election-results-day/articleshow/125305561.cms",
            "description": "As Bihar election counting commences, Dalal Street braces for volatility, anticipating three scenarios: NDA win, hung assembly, or opposition upset. While a comfortable NDA victory signals policy stability and a mild rally, a closer contest or defeat could trigger short-term swings. However, the broader market trend is expected to remain intact, driven by macro factors.",
            "pubDate": "2025-11-14T03:59:23.736438"
        },
        {
            "title": "Beyond Infosys’ record date for share buyback: Strategy, scenarios & the road ahead for shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/beyond-infosys-record-date-for-share-buyback-strategy-scenarios-the-road-ahead-for-shareholders/articleshow/125317624.cms",
            "description": "Infosys' Rs 18,000 crore share buyback is underway. Shareholders can tender shares at a premium. The focus now shifts to tendering strategy and potential acceptance ratios. Analysts suggest participation for small shareholders. The buyback aims to return capital and improve earnings per share. Investors must consider tax implications and holding costs for their decisions.",
            "pubDate": "2025-11-14T05:23:30.995832"
        },
        {
            "title": "23% return in 1 month! Can old warhorse Asian Paints cross 2022 peak?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/23-return-in-1-month-can-old-warhorse-asian-paints-cross-2022-peak/articleshow/125317564.cms",
            "description": "Asian Paints' stock has surged 23% in a month, signaling a fundamental turnaround. The aggressive entry of competitor Birla Opus has faltered, with dealers returning to established players. Asian Paints' strong September quarter results, coupled with its deep distribution network and brand loyalty, suggest it's well-positioned to defend its market leadership and potentially surpass its 2022 peak.",
            "pubDate": "2025-11-14T05:23:30.995964"
        },
        {
            "title": "Mixed signals, deep divisions cloud Fed’s December meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mixed-signals-deep-divisions-cloud-feds-december-meeting/slideshow/125317391.cms",
            "description": "A growing number of Federal Reserve officials are signalling hesitation on further rate cuts, citing persistent inflation and signs of labour-market stability. Market expectations for a December rate cut have now dropped below 50%, reflecting increasing uncertainty. (Source: Reuters)",
            "pubDate": "2025-11-14T05:23:30.996092"
        },
        {
            "title": "Muthoot Finance shares jump 10% on big beat in Q2 numbers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muthoot-finance-shares-jump-10-on-big-beat-in-q2-numbers/articleshow/125316754.cms",
            "description": "Muthoot Finance’s share price rallied sharply on Friday after Q2 profit surged 87% YoY to Rs 2,345 crore, driven by strong gold loan AUM growth, improved NIM and robust interest income. Brokerages raised estimates, while the company lifted its FY26 AUM growth guidance to 30–35%.",
            "pubDate": "2025-11-14T05:23:30.996201"
        },
        {
            "title": "Pine Labs shares list at 9.5% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pine-labs-shares-list-at-9-5-premium-over-ipo-price/articleshow/125316687.cms",
            "description": "Pine Labs share price: Fintech major Pine Labs debuted on the stock exchange with a 9.5% premium, listing at Rs 242. The Rs 3,900-crore IPO saw strong institutional demand, with QIBs subscribing 3.97 times. The company, a recognized merchant commerce platform, turned profitable in Q1 FY26, with IPO proceeds earmarked for debt repayment, technology investments, and expansion.",
            "pubDate": "2025-11-14T05:23:30.996304"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs reduces target on Page Industries; Nuvama initiates coverage on Allied Blenders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-reduces-target-on-page-industries-nuvama-initiates-coverage-on-allied-blenders/articleshow/125316566.cms",
            "description": "Brokerages remain positive on selected consumer and financial stocks, citing resilient fundamentals, improving demand visibility, and promising long-term growth drivers. Recommendations from Nuvama, Goldman Sachs, and Morgan Stanley highlight strong earnings potential across spirits, innerwear, and gold loans, while acknowledging risks such as tax changes, competition, and commodity volatility.",
            "pubDate": "2025-11-14T05:23:30.996408"
        },
        {
            "title": "Avoiding public glare: As Groww mints Rs 30,000 crore from market, is Zerodha's freedom costly?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/avoiding-public-glare-as-groww-mints-rs-30000-crore-from-market-is-zerodhas-freedom-costly/articleshow/125316624.cms",
            "description": "India's fintech giants Groww and Zerodha are reshaping online investing. Groww recently listed on public markets, raising significant capital and boosting its brand. Zerodha, however, continues its private, self-funded journey. This divergence highlights different paths to success in the booming Indian financial sector.",
            "pubDate": "2025-11-14T05:23:30.996516"
        },
        {
            "title": "MTR-parent Orkla India shares in focus as Q2 net profit slides 7% to Rs 77 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mtr-parent-orkla-india-shares-in-focus-as-q2-net-profit-slides-7-to-rs-77-crore/articleshow/125316407.cms",
            "description": "Orkla India, the parent of MTR, posted a 7% YoY decline in Q2 net profit to Rs 76.7 crore, while revenue rose 5% to Rs 650.3 crore. EBITDA dipped over 3% due to GST 2.0 migration costs and lower PLI benefits, though adjusted margins improved.",
            "pubDate": "2025-11-14T05:23:30.996617"
        },
        {
            "title": "Alkem Laboratories among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alkem-laboratories-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125316367.cms",
            "description": "As of November 13, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This trend reflects more participants initiating fresh positions or expanding existing ones within the futures market.",
            "pubDate": "2025-11-14T05:23:30.996713"
        },
        {
            "title": "Sensex falls over 350 pts, Nifty below 25,800 as Bihar election results spark street caution; IT, metal stock tumble",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-300-pts-nifty-below-25800-as-bihar-election-results-drive-street-caution-it-metal-stock-tumble/articleshow/125316053.cms",
            "description": "Indian equity benchmarks Nifty and Sensex opened sharply lower on Friday, snapping a four-day rally. Investors closely watched Bihar Election results, with Metal and IT stocks leading the decline. Tata Motors CV, Infosys, and Tata Steel were among the major laggards on the Sensex.",
            "pubDate": "2025-11-14T05:23:30.996807"
        },
        {
            "title": "Ashok Leyland, Precision Wires among 7 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-precision-wires-among-7-stocks-witness-5-year-swing-high-breakout/slideshow/125316131.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, seven stocks witnessed a 5-year swing high at the close on November 13, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-11-14T05:23:30.996902"
        },
        {
            "title": "European shares fall as US rate cut expectations wane",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-fall-as-us-rate-cut-expectations-wane/articleshow/125322358.cms",
            "description": "European stock markets experienced a decline on Friday. This was influenced by cautious remarks from US policymakers regarding interest rate cuts. Despite this dip, the main European index was on track for its best weekly gain since late September. Luxury group Richemont and Siemens Energy saw significant gains. UK stocks lagged due to rising gilt yields.",
            "pubDate": "2025-11-14T09:38:09.426931"
        },
        {
            "title": "Jubilant FoodWorks jumps 9% as Domino’s operator serves piping-hot Q2 performance with 190% PAT surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jubilant-foodworks-jumps-9-as-dominos-operator-serves-piping-hot-q2-performance-with-190-pat-surge/articleshow/125322299.cms",
            "description": "Jubilant FoodWorks shares saw a significant jump on Friday. The Domino's pizza owner announced strong September quarter earnings. Profit after tax recorded a 190 percent year-on-year increase. Revenue from operations also showed a healthy uptick. The company added 93 stores to its network in the quarter. India business continues to expand and innovate.",
            "pubDate": "2025-11-14T09:38:09.427060"
        },
        {
            "title": "These 7 smallcap stocks crashed over 50% in FY26. Are you affected?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-smallcap-stocks-crashed-over-50-in-fy26-are-you-affected/slideshow/125320615.cms",
            "description": "In FY26, the benchmark Sensex delivered a respectable 9% gain, but the real fireworks came from the small-cap segment, which surged nearly 14%. This rally turned the spotlight on smaller companies, with as many as 36 small-cap stocks becoming multibaggers. Yet, beneath this broad-based cheer, there’s another side to the story. So far, in the first eight months of FY26, 18 small-cap stocks have plunged between 40% and 77%, and among them, seven have crashed more than 50%. These sharp declines make them worth a closer look—for both bargain hunters and cautious investors alike. (Data Source: ACE Equity)",
            "pubDate": "2025-11-14T09:38:09.427163"
        },
        {
            "title": "Long-term investing using a different lens: From being a commodity to a brand trigger; 6 stocks from 3 different sectors to look at",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/long-term-investing-using-a-different-lens-from-being-a-commodity-to-a-brand-trigger-6-stocks-from-3-different-sectors-to-look-at/articleshow/125321699.cms",
            "description": "In some industries, the nature of business is commoditised. That is, every player does the same thing: Buy the raw material, process it, and sell it. Margins are thin, because there is not much valuation-addition happening. But then, over the years, some players have built brands for their products. And the margins of players who invest in building a brand get better. But this change is a process and not an event – and it takes time. But the change is likely to be durable as it is not easy to build brands in commoditised businesses.",
            "pubDate": "2025-11-14T09:38:09.427331"
        },
        {
            "title": "How to not upset investors after listing: Samir Arora’s 3-point checklist for IPO-bound cos",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-not-upset-investors-after-listing-samir-aroras-3-point-checklist-for-ipo-bound-cos/articleshow/125321001.cms",
            "description": "Market voice Samir Arora advised newly listed companies on maintaining investor trust. He urged them to delay IPOs if Q1 results might disappoint, avoid separating earnings announcements from commentary, and ensure business updates align with reality to prevent misleading shareholders and eroding confidence.",
            "pubDate": "2025-11-14T09:38:09.427446"
        },
        {
            "title": "Japan's Nikkei slides as investors book profit on tech stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slides-as-investors-book-profit-on-tech-stocks/articleshow/125321052.cms",
            "description": "Japan's Nikkei share average fell 1.8% on Friday, with AI-linked tech stocks leading the decline due to concerns over sky-high valuations. Investors are taking profits and rotating into companies with strong earnings, such as TOPPAN Holdings and Tokyo Tatemono. The Nikkei managed a slight weekly gain, but global valuation worries persist ahead of Nvidia's earnings.",
            "pubDate": "2025-11-14T09:38:09.427550"
        },
        {
            "title": "IMF warns of rising strains in the US economy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-warns-of-rising-strains-in-the-us-economy/slideshow/125320142.cms",
            "description": "The IMF said the US economy is beginning to show signs of strain, with fourth-quarter growth likely slipping below its earlier 1.9% forecast. The ongoing government shutdown has disrupted economic data flow, making it harder for the IMF to accurately assess current conditions. (Source: Reuters)",
            "pubDate": "2025-11-14T09:38:09.427647"
        },
        {
            "title": "India now reverse AI trade after being relative-return disaster: Chris Wood of Jefferies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-reverses-ai-trade-after-being-relative-return-disaster-chris-wood-of-jefferies/articleshow/125319465.cms",
            "description": "India has become the “reverse AI trade” in emerging markets, underperforming the MSCI Emerging Markets Index by 27 percentage points year-to-date, according to Jefferies’ Chris Wood. While the rupee has fallen 3.4% to Rs 88.7, India’s lower exposure to the AI-driven rally in Taiwan, Korea, and China positions it as a contrarian play for long-term investors.",
            "pubDate": "2025-11-14T09:38:09.427741"
        },
        {
            "title": "Paras Defence shares soar 10% as Q2 net profit jumps 50% to Rs 14 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paras-defence-shares-soar-10-as-q2-net-profit-jumps-50-to-rs-14-crore/articleshow/125319328.cms",
            "description": "Paras Defence and Space Technologies shares surged following strong September quarter results, with net profit jumping 50% and revenue climbing 22%. The company also secured a significant Rs 35.68 crore order from the Ministry of Defence for Portable Counter-Drone Systems, alongside a Rs 3.95 crore order for Radio Frequency Jammers. This positive news has propelled the stock to new highs.",
            "pubDate": "2025-11-14T09:38:09.427838"
        },
        {
            "title": "Smallcap stock with 136% returns in 2 years announces 1:1 bonus issue. Check record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stock-with-136-returns-in-2-years-announces-11-bonus-issue-check-record-date/articleshow/125319182.cms",
            "description": "Ram Ratna Wires announces 1:1 bonus shares with record date on 26 Dec. Q2FY26 PAT rises 29.9%, revenue up 23.8%, and stock has delivered 136% returns over two years.",
            "pubDate": "2025-11-14T09:38:09.427938"
        },
        {
            "title": "Investors exit Yen bets as currency slides to nine-month low",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-exit-yen-bets-as-currency-slides-to-nine-month-low/slideshow/125319394.cms",
            "description": "Investors had expected the yen to rise as Japan’s long-overdue economic revival aligned with expectations of a U.S. slowdown. Instead, the yen fell to nine-month lows, forcing traders to unwind what had become one of the biggest bullish bets on the currency in decades. (Source: Reuters)",
            "pubDate": "2025-11-14T09:38:09.428033"
        },
        {
            "title": "Ather Energy block deal: Ghisallo, Societe Generale buy into multibagger as NIIF books profits in Rs 545 cr transaction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ather-energy-block-deal-ghisallo-societe-generale-buy-into-multibagger-as-niif-books-profits-in-rs-545-cr-transaction/articleshow/125318970.cms",
            "description": "Ather Energy witnessed significant block deals totaling Rs 545 crore as NIIF-II booked profits by offloading shares. Boston-based Ghisallo and Societe Generale were among the notable buyers, acquiring substantial stakes in the electric two-wheeler manufacturer. Other investors like Invesco Mutual Fund and Motilal Oswal also participated in the transaction.",
            "pubDate": "2025-11-14T09:38:09.428136"
        },
        {
            "title": "Pine Labs shares soar 17% after strong listing, IPO investors sit at 28% gains. Should you enter now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pine-labs-shares-soar-17-after-strong-listing-ipo-investors-sit-at-28-gains-should-you-enter-now/articleshow/125318911.cms",
            "description": "Pine Labs delivered a strong market debut, listing at a 9.5% premium and rallying further to give IPO investors gains of nearly 30% from the IPO price. Brokerages remain positive on the company’s long-term prospects but advise allotted investors to hold.",
            "pubDate": "2025-11-14T09:38:09.428232"
        },
        {
            "title": "Bihar Elections 2025: 9 stocks to watch out for as vote counting underway",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bihar-elections-2025-9-stocks-to-watch-out-for-as-vote-counting-commences/articleshow/125318762.cms",
            "description": "As vote counting begins for the Bihar polls, investors are eyeing companies with significant exposure to the state. Stocks across sectors like retail, infrastructure, media, housing, and public services could see renewed momentum, with markets factoring in policy continuity and development-led spending. Early trends suggest the NDA has crossed the majority mark, boosting investor interest in Bihar-linked firms.",
            "pubDate": "2025-11-14T09:38:09.428329"
        },
        {
            "title": "Children’s Day: How life insurance can ignite your kid’s education dream",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/childrens-day-how-life-insurance-can-ignite-your-kids-education-dream/articleshow/125318562.cms",
            "description": "Children's dreams of becoming astronauts or doctors require financial backing. With education costs in India doubling every six years, parents must plan ahead. Life insurance offers a robust solution, providing not just protection but also a savings tool to fund academic goals, ensuring ambitions can take flight regardless of life's uncertainties.",
            "pubDate": "2025-11-14T09:38:09.428450"
        },
        {
            "title": "Societe Generale on shopping spree in India; splurges Rs 200 cr on Axis Bank, Tata Capital, one smallcap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/societe-generale-on-shopping-spree-in-india-splurges-rs-200-cr-on-axis-bank-tata-capital-one-smallcap/articleshow/125318318.cms",
            "description": "Societe Generale made significant investments on Thursday. The French bank acquired stakes in Sammaan Capital, Tata Capital, and Axis Bank. Its largest purchase was in Sammaan Capital. These block deals involved substantial financial transactions. Investors will be watching these companies closely following this development.",
            "pubDate": "2025-11-14T09:38:09.428572"
        },
        {
            "title": "Bihar election results: How it may impact stock market; 5 stocks to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bihar-election-results-how-it-may-impact-stock-market-5-stocks-to-watch/articleshow/125325588.cms",
            "description": "Early Bihar election trends point to a strong NDA win, easing political uncertainty and reinforcing expectations of continuity in policy and execution. MarketSmith India says markets may see brief volatility before refocusing on earnings, reforms, capex momentum and sector-specific drivers.",
            "pubDate": "2025-11-14T11:17:13.669555"
        },
        {
            "title": "Shaily Engineering block deal: Promoters take profits in mutibagger smallcap. Morgan Stanley, Motilal sniff opportunity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shaily-engineering-block-deal-promoters-take-profits-in-mutibagger-smallcap-morgan-stanley-motilal-sniff-opportunity/articleshow/125329362.cms",
            "description": "Morgan Stanley acquired 40,000 shares in Shaily Engineering Plastics through block deals. Promoters Amit Mahendra Sanghvi and Laxman Sanghvi sold some of their holdings. Motilal Oswal Mutual Fund and S I Investments Broking Pvt Ltd were also buyers. Shaily Engineering Plastics, a multibagger, reported strong Q2 results with a 134% jump in net profit and 34% revenue growth.",
            "pubDate": "2025-11-14T14:15:34.713391"
        },
        {
            "title": "Sun TV Q2 PAT down 13.4 pc to Rs 354.7 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-tv-q2-pat-down-13-4-pc-to-rs-354-7-cr/articleshow/125328062.cms",
            "description": "During the September quarter, Sun TV Networks reported a 13.37% decrease in profits after tax, totaling Rs 354.69 crore. Significant reductions were observed in revenue from operations; however, the company’s total income benefited from diversification through other sources and cricket franchise profits.",
            "pubDate": "2025-11-14T14:15:34.713525"
        },
        {
            "title": "Gainers & Losers: Pine Labs, Infosys among 7 stocks that were in focus on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-pine-labs-infosys-among-7-stocks-that-were-in-focus-on-friday/slideshow/125326517.cms",
            "description": "",
            "pubDate": "2025-11-14T14:15:34.713628"
        },
        {
            "title": "FIIs and DIIs place big bets on State Bank of India — Analysts see about 20% rally ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-and-diis-place-big-bets-on-state-bank-of-india-analysts-see-about-20-rally-ahead/articleshow/125321619.cms",
            "description": "Investors are showing renewed confidence in State Bank of India. Both foreign and domestic institutions are raising their stakes. SBI reported strong earnings momentum. Analysts maintain a positive outlook. The bank's performance in loans, net interest margin, and asset quality is favorable. SBI's share price is near its 52-week high. The stock shows a strong bullish trend.",
            "pubDate": "2025-11-14T14:15:34.713728"
        },
        {
            "title": "Stock Radar: 20% rally in a month! Shriram Finance loses some momentum after hitting record highs; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-20-rally-in-a-month-shriram-finance-loses-some-momentum-after-hitting-record-highs-time-to-buy-or-book-profits/articleshow/125299461.cms",
            "description": "Shriram Finance shares have surged over 20% in a month, hitting a new record high. Experts suggest buying on dips towards 800, targeting over 900 in 1-2 months. The stock's strong upward trend is supported by technical indicators and a breakout from a year-long resistance zone, indicating further potential gains.",
            "pubDate": "2025-11-14T14:15:34.713828"
        },
        {
            "title": "Kotak Mahindra Bank to consider stock split on November 21. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-to-consider-stock-split-on-november-21-check-details/articleshow/125325650.cms",
            "description": "Kotak Bank stock split:  Kotak Mahindra Bank, India's third largest private lender by market value, said its board will consider a proposal to split its shares on November 21.",
            "pubDate": "2025-11-14T14:15:34.713929"
        },
        {
            "title": "Dow Jones crashes 500 points, S&P 500, Nasdaq plunge over 1% as tech selloff extends, rate cut hopes fade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-jones-crashes-500-points-sp-500-nasdaq-plunge-over-1-as-tech-selloff-extends-rate-cut-hopes-fade/articleshow/125330117.cms",
            "description": "Wall Street's main indexes dipped on Friday, driven by a renewed selloff in technology stocks, while hawkish commentary from Federal Reserve officials added to doubts about an interest rate cut in December.",
            "pubDate": "2025-11-14T14:52:32.706535"
        },
        {
            "title": "BlackBuck gets Buy rating as Ambit sees strong growth ahead, values stock at Rs 885",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackbuck-gets-buy-rating-as-ambit-sees-strong-growth-ahead-values-stock-at-rs-885/articleshow/125329911.cms",
            "description": "Ambit Capital initiated coverage on Zinka Logistics, parent of BlackBuck, with a Buy rating and Rs 885 target price. The brokerage highlighted BlackBuck's emergence as India's largest commercial vehicle technology platform, driven by its expanding tolling and telematics offerings and improved profitability. The company has significantly digitized India's trucking ecosystem, serving a substantial portion of the trucker base.",
            "pubDate": "2025-11-14T14:52:32.706680"
        },
        {
            "title": "'Big Short' fame Michael Burry’s depreciation gripe shines spotlight on big tech profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-short-fame-michael-burrys-depreciation-gripe-shines-spotlight-on-big-tech-profits/articleshow/125331286.cms",
            "description": "Michael Burry has raised concerns that Big Tech's soaring profits might be artificially inflated due to extended depreciation schedules for computing equipment. While companies like Meta and Alphabet are lengthening asset useful lives, potentially boosting earnings, investors are increasingly scrutinizing the massive capital expenditures on AI infrastructure and the true pace of asset depreciation.",
            "pubDate": "2025-11-14T17:43:07.891454"
        },
        {
            "title": "For those with a 3- to 5-year investing perspective: 5 Small-caps, 3 with an upside potential of up to 63%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-those-with-a-3-to-5-year-investing-perspective-5-small-caps-3-with-an-upside-potential-of-up-to-63/articleshow/125335142.cms",
            "description": "There are some sectors where the opportunity is so large that there is a high probability that even a small-cap company can grow in size. Just to put this in perspective: There are many IT companies that began as small-caps. But as the IT sector grew manifold in the past 25 years, they became much bigger in size. Similarly, recent policy changes in some sectors have created the scope for great growth for even the small players. We are talking of sectors which grow when the economy reaches a certain level, and average household incomes breach a certain mark. And where policy changes ensure systems fall in place.",
            "pubDate": "2025-11-14T19:52:37.262420"
        },
        {
            "title": "Stock picks of the week: 6 stocks with consistent score improvement and upside potential of more than 30% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-6-stocks-with-consistent-score-improvement-and-upside-potential-of-more-than-30-in-1-year/articleshow/125334768.cms",
            "description": "A last-hour spike in the Nifty is not unusual. But some spikes are different. What we saw on Friday was probably a short-covering-led spike. But look at the market breadth, which was positive even before the spike. Going forward, one eye should always be on market breadth, and that too in the mid-cap segment. Also, the Indian market’s performance must be seen in light of the fact that developed markets are under pressure due to what is happening with the Nasdaq. With the Bihar election results behind us, there is only one event to await: The India-US tariff deal.",
            "pubDate": "2025-11-14T19:52:37.262542"
        }
    ]
}