{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-29T03:27:06.991600",
    "items": [
        {
            "title": "Sun Pharma, L&T among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-lt-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124203823.cms",
            "description": "As of September 26, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-29T03:26:52.519256"
        },
        {
            "title": "PB Fintech, Hero MotoCorp among 5 stocks close crossing below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pb-fintech-hero-motocorp-among-5-stocks-close-crossing-below-vwap/slideshow/124203729.cms",
            "description": "The closing prices of five stocks from Nifty500 dropped over 0.5% relative to the VWAP (Volume Weighted Average Price) on September 26, and a shift below the VWAP suggests a potential bearish trend, according to stockedge.com's technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.\"",
            "pubDate": "2025-09-29T03:26:52.519384"
        },
        {
            "title": "IZMO, Lumax Auto, and 3 other stocks hit 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/izmo-lumax-auto-and-3-other-stocks-hit-5-year-swing-high-breakout/slideshow/124203494.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, five stocks witnessed a 5-year swing high at the close on September 26, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-29T03:26:52.519490"
        },
        {
            "title": "Prime Cable Industries shares to debut today. GMP signals muted listing buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prime-cable-industries-shares-to-debut-today-gmp-signals-muted-listing-buzz/articleshow/124203415.cms",
            "description": "Prime Cable Industries is poised for its stock market debut on Monday, with modest expectations for its listing. Despite the IPO being oversubscribed 8.28 times across all categories, a grey market premium of just 4% suggests a flat-to-marginal opening. The company reported strong FY25 financials, yet analysts indicate its current valuation leaves little room for immediate upside.",
            "pubDate": "2025-09-29T03:26:52.519594"
        },
        {
            "title": "Solvex Edibles IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/solvex-edibles-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/124203410.cms",
            "description": "Solvex Edibles' initial public offering closed. Investor response was tepid. The company's shares are listing today. The grey market premium held flat at zero percent. This suggests limited listing day excitement. The issue received 1.02 times subscription overall. Retail portion subscription was 0.73 times. Solvex Edibles makes rice bran oil and by-products.",
            "pubDate": "2025-09-29T03:26:52.519690"
        },
        {
            "title": "Negative Breakout: These 9 stocks close cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-9-stocks-close-cross-below-their-200-dmas/slideshow/124203251.cms",
            "description": "In the Nifty200 pack, the closing prices of 17 stocks fell below their 200 DMA (Daily Moving Averages) on September 26, according to StockEdge.com's technical scan data. Of these, we have highlighted 9 stocks that slipped more than 2%. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-09-29T03:26:52.519786"
        },
        {
            "title": "Atlanta Electricals shares to debut today. GMP builds up as listing nears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/atlanta-electricals-shares-to-debut-today-gmp-builds-up-as-listing-nears/articleshow/124203107.cms",
            "description": "Atlanta Electricals, a prominent transformer manufacturer, debuts on bourses September 29 following a successful Rs 687 crore IPO. The issue was oversubscribed 72.16 times, with a 15% grey market premium reflecting cautious optimism. Analysts view the company positively, highlighting its robust order book and strong potential to capitalize on India's expanding power sector, suggesting a long-term investment opportunity.",
            "pubDate": "2025-09-29T03:26:52.519880"
        },
        {
            "title": "Ashish Kacholia-backed Ganesh Consumer Products shares to debut today. GMP turns negative ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-ganesh-consumer-products-shares-to-debut-today-gmp-turns-negative-ahead-of-listing/articleshow/124203097.cms",
            "description": "Ganesh Consumer Products is poised for a cautious stock market debut on Monday, with a negative grey market premium suggesting a weak listing despite moderate IPO subscription. The prominent eastern India FMCG firm, known for wheat-based products, reported steady FY25 financials but operates on low margins. Its long-term prospects hinge on brand expansion and sustained profitability in a competitive market.",
            "pubDate": "2025-09-29T03:26:52.519971"
        },
        {
            "title": "Asian shares cautious as US government faces shutdown risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shares-cautious-in-asia-as-us-government-faces-shutdown-risk/articleshow/124202811.cms",
            "description": "Asian markets opened cautiously Monday as investors eyed a potential U.S. government shutdown, which could delay key economic data and marginally impact the Fed's October rate cut decision. Despite this, S&P 500 futures rose, while gold neared a record high and oil prices slipped on increased supply.",
            "pubDate": "2025-09-29T03:26:52.520086"
        },
        {
            "title": "Legacy microloan stress still a worry for small finance banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/legacy-microloan-stress-still-a-worry-for-small-finance-banks/articleshow/124202733.cms",
            "description": "Microfinance business is significantly impacting small finance banks like ESAF, Suryoday, and Utkarsh, with nearly a fifth of their microloan books under severe stress. This deterioration in asset quality, driven by high unsecured microloans, is weighing heavily on their profitability and has led to rating downgrades and losses for some.",
            "pubDate": "2025-09-29T03:26:52.520181"
        },
        {
            "title": "GIFT Nifty up 100 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124196602.cms",
            "description": "Equity markets faced significant selling pressure last week, tumbling over 2.5% and ending a three-week winning streak. The upcoming week is data-heavy, with RBI policy and derivatives expiry expected to fuel volatility. FIIs net sold shares, while the rupee rebounded from its all-time low.",
            "pubDate": "2025-09-29T03:26:52.520275"
        },
        {
            "title": "Stocks in news: Tata Motors, Waaree Energies, HDFC Bank, Anant Raj, Oil India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tata-motors-waaree-energies-hdfc-bank-anant-raj-oil-india/articleshow/124196542.cms",
            "description": "Markets extended their losing streak for the sixth consecutive session, with the Nifty approaching key support levels, prompting analysts to advise caution. Meanwhile, Waaree Energies confirmed its expansion plans despite a US tariff probe, HDFC Bank's Dubai branch faced client onboarding restrictions, and Tata Motors announced a new MD & CEO.",
            "pubDate": "2025-09-29T03:26:52.520373"
        },
        {
            "title": "Valuations remain elevated, retail investors urged to stay disciplined",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuations-remain-elevated-retail-investors-urged-to-stay-disciplined/articleshow/124202642.cms",
            "description": "Indian equities saw an unusual year. They lagged global peers despite strong economic fundamentals. High valuations and foreign outflows impacted performance. Domestic investors, however, showed strong support. Households now own more of the market. Caution is advised due to current valuations. Retail investors should focus on disciplined asset allocation. Large caps offer better comfort.",
            "pubDate": "2025-09-29T03:26:52.520465"
        },
        {
            "title": "Two-thirds of Nifty 500 stocks trade below last year’s levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-thirds-of-nifty-500-stocks-trade-below-last-years-levels/articleshow/124202581.cms",
            "description": "Indian equities faced a downturn since September 2024. The Nifty 50 is 1,623 points short of its peak. Two-thirds of Nifty 500 stocks are below year-ago levels. A study revealed widespread losses among listed stocks. Bitcoin surged 79 percent. Gold and silver rallied over 51 percent. These alternative assets far outpaced Indian stock market performance.",
            "pubDate": "2025-09-29T03:26:52.520554"
        },
        {
            "title": "Will India-US tariff deal spark the next rally on Dalal Street?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-india-us-tariff-deal-spark-the-next-rally-on-dalal-street/articleshow/124202522.cms",
            "description": "Indian equities face continued underperformance, trailing global peers due to earnings disappointment and significant overseas exits. While corporate earnings revival is anticipated only by FY27, a resolution to the India-US tariff dispute is seen as the immediate trigger to push Sensex and Nifty towards new all-time highs.",
            "pubDate": "2025-09-29T03:26:52.520646"
        }
    ]
}