{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-13T15:40:29.416907",
    "items": [
        {
            "title": "Shriram Properties’ Q1 net profit rises 18% YoY, revenue up 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shriram-properties-q1-net-profit-rises-18-yoy-revenue-up-24/articleshow/123268966.cms",
            "description": "Shriram Properties Limited announced impressive first-quarter results. Net profit rose 18% to ₹20.6 crore. Total revenue reached ₹261.5 crore, a 24% increase. Revenue from operations jumped 57%. This growth was driven by successful project handovers. The company is expanding its project pipeline. They are evaluating multiple projects. CMD Murali M attributed the success to strong execution.",
            "pubDate": "2025-08-13T06:48:20.857435"
        },
        {
            "title": "IndiQube Q1 profit surges 303%, revenue hits Rs 313 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indiqube-q1-profit-surges-303-revenue-hits-rs-313-crore/articleshow/123262039.cms",
            "description": "IndiQube posted record ₹313 crore revenue in Q1 FY26, up 27% YoY, with 98% recurring revenue. EBITDA nearly doubled, net profit surged 303% IGAAP-equivalent, as operational footprint and sustainability initiatives expanded significantly.",
            "pubDate": "2025-08-13T06:48:20.857565"
        },
        {
            "title": "Hindalco Q1 profit rises 30% as Novelis outlook brightens for H2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindalco-q1-profit-rises-30-as-novelis-outlook-brightens-for-h2/articleshow/123262001.cms",
            "description": "Hindalco’s Q1 profit rose 30% to ₹4,004 crore on higher revenue, while Novelis faced a 36% net income drop. Management expects scrap price improvements to boost Novelis in H2.",
            "pubDate": "2025-08-13T06:48:20.857679"
        },
        {
            "title": "Karnataka Bank Q1 profit falls 27% on lower income, higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/karnataka-bank-q1-profit-falls-27-on-lower-income-higher-provisions/articleshow/123261849.cms",
            "description": "Karnataka Bank’s Q1 net profit fell 27% to ₹292.4 crore due to lower net interest income and higher provisions. Operating profit declined, while other income rose 28% but couldn’t offset core income fall.",
            "pubDate": "2025-08-13T06:48:20.857798"
        },
        {
            "title": "Apollo Hospitals Q1 Results: Cons PAT surges 42% YoY to Rs 433 crore, revenue rises 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/apollo-hospitals-q1-results-cons-pat-surges-42-yoy-to-rs-433-crore-revenue-rises-15/articleshow/123260576.cms",
            "description": "Apollo Hospitals reported a 42% YoY rise in consolidated PAT to ₹433 crore in Q1FY26, driven by 15% revenue growth across healthcare, diagnostics, and digital pharmacy segments. Sequential profit rose 11%, with board approving stake acquisition in AGPCL.",
            "pubDate": "2025-08-13T06:48:20.857905"
        },
        {
            "title": "NSDL Q1 Results: Cons PAT jumps 15% YoY to Rs 90 crore despite 7% drop in revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nsdl-q1-results-cons-pat-jumps-15-yoy-to-rs-90-crore-despite-7-drop-in-revenue/articleshow/123258858.cms",
            "description": "National Securities Depository Limited (NSDL) on Tuesday reported a consolidated net profit of Rs 90 crore in Q1 which was up 15% YoY compared to Rs 78 crore reported in the year ago period.",
            "pubDate": "2025-08-13T06:48:20.858023"
        },
        {
            "title": "Novelis Q1 Results: Net income slumps 36% to $96 million, sales sees 13% growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/novelis-q1-results-net-income-slumps-36-to-96-million-sales-sees-13-growth/articleshow/123258722.cms",
            "description": "Novelis Inc, the wholly-owned subsidiary of Hindalco Industries, has reported a 36% year-on-year fall in its net income for the June quarter at $96 million. Excluding special items, the bottomline was 43% lower compared to the previous year at $116 million.",
            "pubDate": "2025-08-13T06:48:20.858127"
        },
        {
            "title": "RVNL Q1 Results: Cons PAT slumps 40% YoY; revenue, income see marginal dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rvnl-q1-results-cons-pat-slumps-40-yoy-revenue-income-see-marginal-dip/articleshow/123258268.cms",
            "description": "RVNL Q1 Results: Revenue from operations stood at ₹3,908.77 crore, marking a 4.05% YoY decline from ₹4,073.80 crore in Q1FY24. Total income dropped 4.61% YoY to ₹4,136.96 crore from ₹4,336.75 crore in the same quarter last year, reflecting weaker topline performance.",
            "pubDate": "2025-08-13T06:48:20.858224"
        },
        {
            "title": "Suzlon Energy Q1 results: Cons PAT jumps 7% YoY to Rs 324 crore; revenue soars 55%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/suzlon-energy-q1-results-cons-pat-net-profit-jumps-7-yoy-revenue-soars-55/articleshow/123257637.cms",
            "description": "Suzlon Energy reported a 7% YoY rise in Q1FY26 net profit to Rs 324 crore, with revenue up 55% and record deliveries. Strong order growth, domestic demand, and export potential bolster its clean energy outlook.",
            "pubDate": "2025-08-13T06:48:20.858320"
        },
        {
            "title": "Nykaa Q1 Results: Cons PAT soars 79% YoY to Rs 24 crore, revenue jumps 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-q1-results-cons-pat-soars-79-yoy-to-rs-24-crore-revenue-jumps-23/articleshow/123257586.cms",
            "description": "Nykaa Q1 Results: FSN E-Commerce, which operates 'Nykaa' brand, reported a consolidated net profit of Rs 24 crore in Q1, which was up 79% compared to Rs 14 crore reported in the year ago period.",
            "pubDate": "2025-08-13T06:48:20.858414"
        },
        {
            "title": "HAL Q1 results: Cons PAT slips 4% YoY to Rs 1,383 crore, revenue surges 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hal-q1-results-cons-pat-slips-4-yoy-to-rs-1383-crore-revenue-surges-11/articleshow/123255253.cms",
            "description": "Hindustan Aeronautics Ltd reported a 3.7% YoY decline in consolidated Q1FY26 net profit to Rs 1,383.77 crore, despite an 10.8% surge in revenue to Rs 4,819.01 crore. Quarterly profits fell sharply 65.2% sequentially.",
            "pubDate": "2025-08-13T06:48:20.858511"
        },
        {
            "title": "Hindalco Q1 Results: Cons PAT jumps 30% YoY to Rs 4,004 crore; revenue rises 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindalco-q1-results-cons-pat-jumps-30-yoy-to-rs-4004-crore-revenue-rises-13/articleshow/123254965.cms",
            "description": "Hindalco Q1 Results: Revenue from operations for the quarter stood at Rs 64,232 crore, up 13% from Rs 57,013 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-08-13T06:48:20.858639"
        },
        {
            "title": "MRF Q1 Results: Con PAT slides 12% YoY to Rs 500.5 cr, revenue jumps nearly 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mrf-q1-results-con-pat-slides-12-yoy-to-rs-500-5-cr-revenue-jumps-nearly-7/articleshow/123253907.cms",
            "description": "MRF’s Q1FY26 net profit fell 13.35% YoY to ₹500.47 crore, while revenue from operations rose 6.65% to ₹7,675.69 crore. Total income grew 7.2% YoY, and profit dipped 2.3% sequentially.",
            "pubDate": "2025-08-13T06:48:20.858746"
        },
        {
            "title": "Fusion Finance to bet on MSMEs, expects better show in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/fusion-finance-to-bet-on-msmes-expects-better-show-in-q3/articleshow/123247295.cms",
            "description": "The lender's assets under management (AUM) contracted 37% year-on-year to ₹7,688 crore at the end of June, from ₹12,193 crore a year ago, after it slowed loan disbursals to the overleveraged and defaulting bottom-of-the-pyramid borrowers.",
            "pubDate": "2025-08-13T06:48:20.858842"
        },
        {
            "title": "IRCTC Q1 Results: PAT rises 8% YoY to Rs 331 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irctc-q1-results-pat-rises-8-yoy-to-rs-331-crore/articleshow/123282619.cms",
            "description": "IRCTC posted an 8% YoY rise in Q1 FY26 net profit to Rs 331 crore, driven by internet ticketing and tourism growth, despite sequential declines and mixed segment performance.",
            "pubDate": "2025-08-13T13:58:20.528171"
        },
        {
            "title": "Jubilant Foodworks Q1 Results: Domino's India operator beats St view with 63% YoY surge in profit at Rs 91 crore on strong delivery demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jubilant-foodworks-q1-results-dominos-india-operator-beats-st-view-with-rs-91-76-crore-profit-on-strong-delivery-demand/articleshow/123281190.cms",
            "description": "Domino's India operator Jubilant Foodworks beat first-quarter profit estimates by a wide margin on Wednesday as lower-priced menu items and free deliveries bolstered demand even as other fast-food franchisees struggled.",
            "pubDate": "2025-08-13T13:58:20.528298"
        },
        {
            "title": "Muthoot Finance Q1 Results: Standalone profit surges 90% to Rs 2,046 crore on strong loan growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/muthoot-finance-q1-results-profit-surges-90-to-rs-2046-crore-on-strong-loan-growth/articleshow/123280683.cms",
            "description": "Muthoot Finance witnessed a significant profit increase in the first quarter. The gold loan financier's profit surged by 90%. This growth was fueled by higher gold prices and increased loan demand. Loan assets under management also rose considerably. The company plans to invest in its subsidiaries, Muthoot Money and Muthoot Homefin.",
            "pubDate": "2025-08-13T13:58:20.528425"
        },
        {
            "title": "BPCL Q1 Results: Cons profit soars 141% YoY to Rs 6,839 crore, but revenue up 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cons-profit-soars-141-yoy-to-rs-6839-cr-but-revenue-up-just-1/articleshow/123279968.cms",
            "description": "BPCL reported a 141% YoY rise in Q1FY26 net profit to Rs 6,839 crore, driven by higher margins and stable revenue. Sequential profit rose 56%, while GRM fell to $4.88/barrel. Downstream petroleum remained the dominant revenue contributor.",
            "pubDate": "2025-08-13T13:58:20.528537"
        },
        {
            "title": "Samvardhana Motherson International Q1 results: Cons PAT falls 40% YoY at Rs 871 crore, revenue rises 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/samvardhana-motherson-international-q1-results-cons-pat-falls-40-yoy-at-rs-871-crore-revenue-rises-3/articleshow/123277497.cms",
            "description": "Samvardhana Motherson’s Q1 FY26 profit fell 39.7% YoY to ₹872 crore despite a 3% revenue rise. Lower margins stemmed from European challenges, start-up costs, and integration expenses, though US tariff impact remains minimal.",
            "pubDate": "2025-08-13T13:58:20.528644"
        },
        {
            "title": "Dish TV India Q1 loss widens YoY to Rs 95 crore, revenue falls 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dish-tv-india-q1-loss-widens-yoy-to-rs-95-crore-revenue-falls-28/articleshow/123276848.cms",
            "description": "Dish TV India’s Q1 net loss widened to Rs 95 crore from Rs 2 crore a year ago, driven by a 28% revenue drop. Asset write-downs, intense competition, and a long-running licence fee dispute weigh on performance, even as OTT platforms Watcho and FLIQS see growth.",
            "pubDate": "2025-08-13T13:58:20.528748"
        },
        {
            "title": "Senco Gold Q1 profit doubles on festive demand, showroom expansion, margin gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/senco-gold-q1-profit-doubles-on-festive-demand-showroom-expansion-margin-gains/articleshow/123283664.cms",
            "description": "Senco Gold’s Q1 FY26 PAT doubled to Rs 104.6 crore, with revenue up 30% YoY to Rs 1,826.2 crore, driven by strong retail expansion, festive demand, and improved margins.",
            "pubDate": "2025-08-13T15:40:26.983842"
        },
        {
            "title": "Muthoot Finance Q1 profit jumps 90% on strong growth, lower provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/muthoot-finance-q1-profit-jumps-90-on-strong-growth-lower-provisions/articleshow/123283581.cms",
            "description": "Muthoot Finance posted a 90% YoY jump in Q1 standalone net profit to Rs 2,046 crore, driven by strong business growth and lower provisions, with AUM up 42% to Rs 1.20 lakh crore.",
            "pubDate": "2025-08-13T15:40:26.983965"
        },
        {
            "title": "CSB Bank Q1 profit up 5% despite NIM fall, provisions surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/csb-bank-q1-profit-up-5-despite-nim-fall-provisions-surge/articleshow/123283536.cms",
            "description": "CSB Bank posted a 5% YoY rise in Q1 net profit to Rs 118.6 crore, with operating profit up 27% on higher other income, despite lower net interest margin.",
            "pubDate": "2025-08-13T15:40:26.984073"
        }
    ]
}