{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-13T01:39:05.075401",
    "items": [
        {
            "title": "Thomas Cook (India) reports net profit of Rs 66.4 cr for Q2FY26, revenues at Rs 2074 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/thomas-cook-india-reports-net-profit-of-rs-66-4-cr-for-q2fy26-revenues-at-rs-2074-cr/articleshow/125287915.cms",
            "description": "Thomas Cook India has reported a net profit of Rs 66.4 crore for the September quarter. Revenue from operations saw a 3.5% rise. The company demonstrated resilience despite global challenges. Forex business and retail sales showed growth. New properties were added by Sterling Holidays. App bookings and Forex by WhatsApp transactions also increased. The company maintains a strong financial position.",
            "pubDate": "2025-11-13T01:39:02.630167"
        },
        {
            "title": "Tata Steel’s Q2 consolidated profit surges fourfold to Rs 3,183 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steels-q2-consolidated-profit-surges-fourfold-to-rs-3183-crore/articleshow/125287891.cms",
            "description": "Tata Steel reported a significant profit jump in the September quarter. India operations drove strong volume growth. The Netherlands unit saw a sharp rise in operating profit. The company also narrowed losses in its UK operations. Sales increased year-on-year. Earnings before interest, tax, depreciation, and amortisation rose substantially.",
            "pubDate": "2025-11-13T01:39:02.630288"
        },
        {
            "title": "Ashok Leyland net profit up 7% at Rs 820 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ashok-leyland-net-profit-up-7-at-rs-820-crore/articleshow/125287879.cms",
            "description": "Ashok Leyland reported a record consolidated net profit of ₹820 crore in the September quarter, a 7% increase year-on-year, driven by broad-based segment recovery and operational efficiencies. Consolidated revenue also rose 13% to ₹12,577 crore, with the company achieving its 12th consecutive quarter of double-digit Ebitda margin.",
            "pubDate": "2025-11-13T01:39:02.630398"
        }
    ]
}