{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-13T04:18:28.518926",
    "items": [
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124516932.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-10-13T04:18:07.807426"
        },
        {
            "title": "Sensex falls over 400 pts, Nifty slips below 25,200 as global trade tensions flare",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-400-pts-nifty-slips-below-25200-as-global-trade-tensions-flare/articleshow/124517045.cms",
            "description": "Indian benchmark indices Sensex and Nifty opened lower Monday, impacted by financial and oil & gas sector declines. Renewed global trade tensions, fueled by U.S. President Trump's actions against Beijing and China's rare earth export restrictions, rattled investor sentiment. Investors also closely monitored the market debut of Tata Capital, the year's largest IPO.",
            "pubDate": "2025-10-13T04:18:07.807551"
        },
        {
            "title": "PG Electroplast and 6 other stocks showing a bullish candlestick pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pg-electroplast-and-6-other-stocks-showing-a-bullish-candlestick-pattern/slideshow/124516391.cms",
            "description": "On October 10, six stocks from the Nifty500 pack appeared on the bullish “White Marubozu” scanner, according to technical data from stockedge.com.A White Marubozu is a bullish candlestick pattern in technical analysis. It forms when the opening price is the lowest for the period and the closing price is the highest. Represented by a long white (or green) candle with no upper shadow and a small or nonexistent lower shadow, it signals strong buying pressure throughout the session.Traders view this pattern as an indication that buyers dominated from open to close, often using it to gauge potential upward momentum in the near term.Stocks forming the White Marubozu pattern:",
            "pubDate": "2025-10-13T04:18:07.807660"
        },
        {
            "title": "Waaree Renewable Technologies shares soar 10% as profit more than doubles in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-technologies-shares-in-focus-as-profit-more-than-doubles-in-q2/articleshow/124516962.cms",
            "description": "Waaree Renewable Technologies shares: It reported a more than twofold jump in consolidated net profit to Rs 116.34 crore in Q2 FY25 from Rs 53.51 crore a year earlier, driven by record revenues and strong project execution. The company attributed the performance to sectoral tailwinds and its expansion into new energy segments such as battery storage systems and data centres.",
            "pubDate": "2025-10-13T04:18:07.807764"
        },
        {
            "title": "Buy, Sell or Hold: Kfin Tech gets double upgrade from Citi; Motilal Oswal recommends buy on D-Mart post Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-kfin-tech-gets-double-upgrade-from-citi-motilal-oswal-recommends-buy-on-d-mart-post-q2-results/articleshow/124516838.cms",
            "description": "Brokerages turned bullish on select stocks — Citi on KFin Technologies, JM Financial on Anant Raj Ltd, and Motilal Oswal on Avenue Supermarts (DMart) — highlighting strong operations, expansion momentum, and an improving earnings outlook as key positives.",
            "pubDate": "2025-10-13T04:18:07.807867"
        },
        {
            "title": "Avenue Supermarts shares fall 2% even as Q2 net profit rises 4% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/avenue-supermarts-shares-in-focus-as-q2-net-profit-rises-4-yoy/articleshow/124516767.cms",
            "description": "Avenue Supermarts shares saw a dip on Monday. The company reported a modest 4% rise in net profit for the September quarter. Revenue from operations showed a healthy 15% year-on-year increase. Despite adding new stores, profit margins experienced a slight decline. The company passed on GST benefits to customers. The stock has performed well year-to-date.",
            "pubDate": "2025-10-13T04:18:07.807976"
        },
        {
            "title": "BLS International Services shares crash 18% after MEA imposes 2-year ban on tenders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bls-international-services-shares-in-focus-as-mea-bans-firm-from-tenders-for-2-years/articleshow/124516755.cms",
            "description": "BLS International Services shares: BLS International Services shares plunged 18% after the Ministry of External Affairs barred it from future tenders for two years due to allegations. The company is reviewing the order and exploring legal options, stating current operations and financials remain unaffected. Indian Missions contributed 12% to Q1 FY26 revenue.",
            "pubDate": "2025-10-13T04:18:07.808075"
        },
        {
            "title": "NTPC Green Energy edge lower despite MoU with Japan’s ENEOS for green hydrogen supply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-green-energy-shares-in-focus-after-mou-with-japans-eneos-for-green-hydrogen-supply/articleshow/124516715.cms",
            "description": "Shares of NTPC Green Energy Ltd (NGEL) could see attention after signing an MoU with Japan’s ENEOS to explore green methanol and hydrogen derivative supplies. The agreement, part of NGEL’s Green Hydrogen Hub at Pudimadaka, aims to boost India’s clean energy exports and decarbonisation efforts. NGEL closed 1.5% higher on Friday, trading below most key moving averages amid a neutral RSI.",
            "pubDate": "2025-10-13T04:18:07.808174"
        },
        {
            "title": "Tata Elxsi, Yes Bank among 6 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-elxsi-yes-bank-among-6-fampo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124516254.cms",
            "description": "As of October 10, there was a notable rise in futures open interest (OI) for nine stocks in the NSE F&O segment, contributing to an overall increase of over 6% compared to the previous session.A sharp uptick in futures open interest indicates a significant expansion in the number of active, unexpired futures contracts for a particular security. This trend reflects growing market participation, with traders either opening new positions or adding to existing ones in the derivatives market.Stocks with the highest increase in open interest:",
            "pubDate": "2025-10-13T04:18:07.808286"
        },
        {
            "title": "Cipla among 6 largecap stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-among-6-largecap-stocks-showing-bullish-rsi-upswing/slideshow/124516117.cms",
            "description": "On October 10, several NSE largecap stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal is generated when the RSI (Relative Strength Index) crosses above 50 from below.“RSI trending up” indicates that the RSI values are rising, reflecting strengthening momentum in a stock’s price. This suggests potential upward movement and can help traders identify possible buying opportunities.",
            "pubDate": "2025-10-13T04:18:07.808391"
        },
        {
            "title": "Positive Breakout: These 8 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-cross-above-their-200-dmas/slideshow/124516027.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on October 10, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-10-13T04:18:07.808490"
        },
        {
            "title": "Stocks to buy in 2025 for long term: HDFC Life, SBI Life among 4 stocks that could give 12-24% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-hdfc-life-sbi-life-among-4-stocks-that-could-give-12-24-return/slideshow/124515928.cms",
            "description": "Brokerages remain optimistic on select financial and IT names, highlighting strong growth prospects and improving fundamentals for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-13T04:18:07.808585"
        },
        {
            "title": "Last day to buy Tata Investment shares ahead of stock split record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-tata-investment-shares-ahead-of-stock-split-record-date/articleshow/124515763.cms",
            "description": "The company has fixed Tuesday as the record date to determine shareholders eligible for the stock split in the ratio of 1:10. Under the split, each existing equity share of face value Rs 10 will be subdivided into 10 equity shares of face value Re 1 each, fully paid up.",
            "pubDate": "2025-10-13T04:18:07.808681"
        },
        {
            "title": "Asian shares off to shaky start, but Wall Street futures bounce",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-off-to-shaky-start-but-wall-street-futures-bounce/articleshow/124514946.cms",
            "description": "Asian markets opened with caution on Monday due to renewed trade tensions between the U.S. and China. However, Wall Street futures indicated a potential rebound. Investors are also awaiting corporate earnings reports and guidance from the U.S. Federal Reserve. Political developments in Japan and Europe are also influencing market sentiment. Gold prices saw an increase, reflecting demand for safe-haven assets.",
            "pubDate": "2025-10-13T04:18:07.808774"
        },
        {
            "title": "GIFT Nifty down 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124503077.cms",
            "description": "Indian stocks climbed on Friday, propelled by financial sector strength and renewed foreign investor interest.  Despite a slight drag from Tata Consultancy Services' results, the market sentiment remained positive, with analysts anticipating further gains.  The rupee also saw a modest recovery against the dollar, signaling increased investor confidence.",
            "pubDate": "2025-10-13T04:18:07.808868"
        },
        {
            "title": "Stocks in news: Tata Motors, Avenue Supermarts, Welspun Enterprises, Infosys",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tata-motors-avenue-supermarts-tata-capital-listing-and-more/articleshow/124503013.cms",
            "description": "Indian stock markets finished higher on Friday. Financial stocks and foreign investor inflows boosted the Sensex and Nifty. Tata Consultancy Services' weaker earnings limited broader gains. Several companies like Avenue Supermarts, Tata Motors, and Infosys will be in focus. Tata Motors' stock will trade as a consolidated entity for the last time on Monday.",
            "pubDate": "2025-10-13T04:18:07.808968"
        }
    ]
}