{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-08T09:58:15.673155",
    "items": [
        {
            "title": "Nifty 50 companies poised for double-digit net profit growth for fourth consecutive quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nifty-50-companies-poised-for-double-digit-net-profit-growth-for-fourth-consecutive-quarter/articleshow/124374153.cms",
            "description": "Nifty 50 companies are poised for double-digit net profit growth for the fourth consecutive quarter, driven by sectors like automobiles and metals. While revenue growth may remain subdued, analysts anticipate improved prospects in the latter half of the fiscal year, supported by GST rationalization and government stimulus.",
            "pubDate": "2025-10-08T02:40:51.526824"
        },
        {
            "title": "TCS Q2 Results Preview: PAT likely to grow up to 10% YoY; 5 key things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q2-results-preview-pat-likely-to-grow-up-to-10-yoy-5-key-things-to-track/articleshow/124379844.cms",
            "description": "Tata Consultancy Services (TCS) kicks off the Q2 earnings season on Thursday, with brokerages projecting net profit growth of 3.7%-9.6% YoY, or Rs 12,346–13,058 crore. Revenue is expected to rise 0.7%-2.2% to Rs 64,200–65,700 crore. HDFC Securities is the most conservative on PAT, while Nuvama is the most optimistic, with topline estimates varying across brokerages.",
            "pubDate": "2025-10-08T09:58:13.989928"
        },
        {
            "title": "India Inc's Q2 test begins tomorrow. Will earnings recovery fail its 6th attempt?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/india-incs-q2-test-begins-tomorrow-will-earnings-recovery-fail-its-6th-attempt/articleshow/124376458.cms",
            "description": "Axis Securities expects an earnings recovery in H2 FY26, led by fiscal and monetary reforms, GST cuts, and improved consumption, though Q2 may remain muted. Downgrades hit IT, BFSI, and Pharma, while Cement shows strength. Nuvama warns of global headwinds from US tariffs affecting BSE500 top lines. Investors should monitor global macros, festive demand, and BFSI asset quality.",
            "pubDate": "2025-10-08T09:58:13.990081"
        }
    ]
}