{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-28T08:54:52.933927",
    "items": [
        {
            "title": "Q3 results today: Maruti, L&T, GRSE and Pine Labs among 126 BSE-listed companies to announce earnings today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-maruti-lt-grse-and-pine-labs-among-126-bse-listed-companies-to-announce-earnings-today/articleshow/127669347.cms",
            "description": "A busy Wednesday for the stock market features earnings from 126 BSE-listed companies, including Nifty giants like Maruti Suzuki and L&T. Both are anticipated to report strong December-quarter results, with Maruti Suzuki expecting a 24-35% net profit rise and L&T projecting a 20-35% increase, driven by robust sales and execution.",
            "pubDate": "2026-01-28T04:28:16.489503"
        },
        {
            "title": "One 97 Communications Q3 Preview: Paytm parent may post up to 22% YoY revenue growth. Check PAT, margin expectations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/one-97-communications-q3-preview-paytm-parent-may-post-up-to-22-yoy-revenue-growth-check-pat-margin-expectations/articleshow/127681571.cms",
            "description": "Paytm is expected to post another profitable Q3, driven by festive-led demand in payments and financial services. Brokerages forecast a return to year-on-year profitability, around 6% sequential growth, and continued margin expansion, with revenue seen rising up to 22% YoY to about Rs 2,187–2,225 crore.",
            "pubDate": "2026-01-28T06:23:47.847845"
        },
        {
            "title": "Swiggy Q3 Preview: Losses to widen as Instamart investments weigh; revenue may jump 47% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swiggy-q3-preview-losses-to-widen-as-instamart-investments-weigh-revenue-may-jump-47-yoy/articleshow/127684848.cms",
            "description": "Swiggy is expected to post strong revenue growth of about 47% YoY in Q3FY26, led by steady food delivery demand and a sharp rise in quick commerce. However, continued investments in Instamart, rising competition, and dark store expansion costs are likely to widen losses, with brokerages estimating a Q3 loss in the range of Rs 804–1,045 crore.",
            "pubDate": "2026-01-28T06:57:14.789315"
        },
        {
            "title": "TVS Motor Q3 Results: Cons PAT zooms 49% YoY to Rs 841 crore; revenue jumps 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tvs-motor-q3-results-cons-pat-zooms-49-yoy-to-rs-841-crore-revenue-jumps-34/articleshow/127688092.cms",
            "description": "TVS Motor Q3 Results: TVS Motor Company achieved its highest-ever quarterly sales, revenue, and profits in the December quarter. Consolidated net profit surged 49% year-on-year to Rs 841 crore. Revenue from operations rose 34% to Rs 14,756 crore. Overall two-wheeler and three-wheeler sales grew 27% to a record 15.44 lakh units. Electric vehicle sales also saw a significant increase.",
            "pubDate": "2026-01-28T08:54:52.226423"
        }
    ]
}