{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-07T07:24:01.135494",
    "items": [
        {
            "title": "Japanese investors ditch foreign stocks on US economic concerns, tariff tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japanese-investors-ditch-foreign-stocks-on-us-economic-concerns-tariff-tensions/articleshow/123155695.cms",
            "description": "Japanese investors significantly reduced their holdings in foreign stocks, withdrawing 752.1 billion yen last week, amidst global market concerns over the U.S. economic outlook and new trade tariffs. This reverses a trend of net purchases, though year-to-date investments still show a substantial 3.37 trillion yen inflow. Simultaneously, they sold foreign long-term bonds.",
            "pubDate": "2025-08-07T04:33:39.745538"
        },
        {
            "title": "Tata stocks lose over Rs 8 lakh crore in 11 months. Is it time to revisit your portfolio allocations?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-stocks-lose-over-rs-8-lakh-crore-in-11-months-is-it-time-to-revisit-your-portfolio-allocations/articleshow/123155678.cms",
            "description": "Tata Group's market capitalization plummeted by over Rs 8.25 lakh crore in 11 months due to global economic uncertainties and sector-specific challenges. Major stocks like TCS, Tata Motors, and Trent experienced significant declines, impacting overall group performance. While some stocks showed resilience, the substantial value erosion prompts investors to reassess their portfolio allocations.",
            "pubDate": "2025-08-07T04:33:39.745667"
        },
        {
            "title": "Sandesh, Godfrey Phillips among 5 stocks with White Marubozu Pattern on August 6",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sandesh-godfrey-phillips-among-5-stocks-with-white-marubozu-pattern-on-august-6/slideshow/123155588.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, five stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data for August 6. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-08-07T04:33:39.745787"
        },
        {
            "title": "Ircon International shares in focus after Q1 PAT declines 27% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ircon-international-shares-in-focus-after-q1-pat-declines-27-yoy/articleshow/123155466.cms",
            "description": "Ircon International reported a 26.7% YoY decline in Q1FY26 PAT to Rs 164.1 crore, with revenue also falling. Despite the earnings dip, the company maintained a robust order book of Rs 20,973 crore. It remains optimistic, citing strong government push for infrastructure through initiatives like Gati Shakti and Bharatmala, positioning itself for future growth.",
            "pubDate": "2025-08-07T04:33:39.745893"
        },
        {
            "title": "Sensex falls over 250 pts, Nifty below 24,550 after Trump's 50% tariff on India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-250-pts-nifty-below-24550-after-trump-doubles-tariff-on-india/articleshow/123155273.cms",
            "description": "The United States imposed an additional 25% tariff on exports, raising investor concerns over potential economic fallout and worsening global trade relations.",
            "pubDate": "2025-08-07T04:33:39.746020"
        },
        {
            "title": "FIIs just pulled out $4 billion from 5 sectors. Should you join the selling spree?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-just-pulled-out-4-billion-from-5-sectors-should-you-join-the-selling-spree/articleshow/123155356.cms",
            "description": "Foreign institutional investors triggered a significant selloff of $4.17 billion in July, heavily impacting Indian equity markets, particularly the IT sector, which saw outflows exceeding $2 billion. Disappointing Q1 results and global economic headwinds fueled the selling pressure across financials, realty, and auto sectors.",
            "pubDate": "2025-08-07T04:33:39.746126"
        },
        {
            "title": "Hero MotoCorp shares rise 2% after Q1 profit beats estimates despite weak sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-after-q1-profit-beats-estimates-despite-weak-sales/articleshow/123155287.cms",
            "description": "Hero MotoCorp shares: The company reported a net profit of ₹1,125.7 crore for the June quarter, slightly above last year’s ₹1,122.6 crore and beating market estimates despite lower sales. Revenue fell 5.6% YoY to ₹9,578.9 crore, and unit sales dropped 10.9% to 13.67 lakh. EBITDA was ₹1,382 crore, with a stable margin of 14.4%.",
            "pubDate": "2025-08-07T04:33:39.746236"
        },
        {
            "title": "RBL Bank shares in focus as RBI approves stake acquisition in USFBL post-amalgamation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-as-rbi-approves-stake-acquisition-in-usfbl-post-amalgamation/articleshow/123155255.cms",
            "description": "RBL Bank shares: The Reserve Bank of India (RBI) approved its acquisition of a stake in Utkarsh Small Finance Bank (USFBL). The approval, dated August 5, 2025, relates to the merger of Utkarsh Coreinvest Ltd (UCL) with USFBL.",
            "pubDate": "2025-08-07T04:33:39.746339"
        },
        {
            "title": "Airbnb forecasts Q3 revenue above estimates; plans $6 billion share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/airbnb-forecasts-q3-revenue-above-estimates-plans-6-billion-share-buyback/articleshow/123155209.cms",
            "description": "Airbnb anticipates third-quarter revenue exceeding Wall Street projections and has authorized a new $6 billion share repurchase program, boosting its stock. The company's growth was fueled by a surge in domestic travel within the U.S., with nights booked accelerating throughout the second quarter. Despite potential moderation due to tougher comparisons, Airbnb remains optimistic, forecasting revenue between $4.02 billion and $4.",
            "pubDate": "2025-08-07T04:33:39.746434"
        },
        {
            "title": "Japan's Topix hits record high on Wall Street rally, solid earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-topix-hits-record-high-on-wall-street-rally-solid-earnings/articleshow/123155177.cms",
            "description": "Japan's Topix index soared to a record high, mirroring Wall Street's overnight gains and fueled by strong corporate earnings, reinforcing wage growth expectations. The Nikkei also climbed, continuing a three-day rally after Monday's sharp decline. Market confidence is buoyed by the belief that the U.S.",
            "pubDate": "2025-08-07T04:33:39.746530"
        },
        {
            "title": "Gokaldas Exports, KPR Mill, other textile stocks in focus after Trump hikes tariff on India to 50%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gokaldas-exports-kpr-mill-other-textile-stocks-in-focus-after-trump-hikes-tariff-on-india-to-50/articleshow/123155131.cms",
            "description": "Indian textile stocks like Gokaldas Exports and KPR Mill may face pressure after US President Trump doubled tariffs on Indian goods to 50%. The hike, citing national security concerns over Russian oil imports, impacts textiles, gems, seafood, and more—excluding pharma and electronics.",
            "pubDate": "2025-08-07T04:33:39.746631"
        },
        {
            "title": "Elgi Equipments, Bayer CropScience among 7 stocks that dropped below VWAP on August 6",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elgi-equipments-bayer-cropscience-among-7-stocks-that-dropped-below-vwap-on-august-6/slideshow/123155073.cms",
            "description": "On August 6, the closing prices of eight stocks from the Nifty 500 dropped by over 1.5% relative to the VWAP (Volume Weighted Average Price), and a shift below the VWAP suggests a potential bearish trend, according to Stockedge.com's technical scan data.When the closing price falls below the VWAP, it indicates that the closing price is lower than the average price at which the stock was traded throughout the day, with the average weighted by trading volume. This can be seen as a potential indication of increased selling pressure.",
            "pubDate": "2025-08-07T04:33:39.746727"
        },
        {
            "title": "Fresh US tariffs shake up Asian chip stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fresh-us-tariffs-shake-up-asian-chip-stocks/articleshow/123154980.cms",
            "description": "Donald Trump's tariff threat impacted Asian chip companies. Tokyo Electron and Renesas faced declines. TSMC and Samsung saw gains due to US investments. Taiwan stated TSMC would be exempt. Apple plans further US investment. The tariff aims to boost US chip production. Experts believe this will reshape the global semiconductor industry.",
            "pubDate": "2025-08-07T04:33:39.746821"
        },
        {
            "title": "Alembic Pharma, BSE, Waaree Energies among 7 stocks closed crossing above VWAP on August 6",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alembic-pharma-bse-waaree-energies-among-7-stocks-closed-crossing-above-vwap-on-august-6/slideshow/123154967.cms",
            "description": "The closing prices of seven stocks in the Nifty500 pack rose over 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data on August 6.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-07T04:33:39.746917"
        },
        {
            "title": "Eternal shares fall 3% as Antfin Singapore sells 23 lakh shares via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-in-focus-as-antfin-singapore-plans-1-9-stake-sale-via-bulk-deal/articleshow/123154904.cms",
            "description": "Antfin Singapore Holding sold 23.10 lakh shares of Eternal (formerly Zomato) via a block deal, causing the stock to fall by 2.6%. The deal, valued at Rs 53.7 billion, involved offloading a 1.9% stake at a floor price of Rs 285 per share, a discount of 4.63%. Morgan Stanley and BofA Securities managed the 100% secondary share sale.",
            "pubDate": "2025-08-07T04:33:39.747057"
        },
        {
            "title": "Kotak Bank shares slip nearly 2% after Rs 2,134 cr block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-as-shareholder-likely-to-sell-rs-2066-crore-stake-via-block-deal/articleshow/123154708.cms",
            "description": "Kotak Mahindra Bank's shares experienced a 1.6% dip following a block deal where 1.1 crore shares changed hands. The transaction, valued at Rs 2,134 crore, occurred amidst reports of a shareholder offloading shares at a discounted floor price.",
            "pubDate": "2025-08-07T04:33:39.747160"
        },
        {
            "title": "F&O Radar | Deploy Short Iron Butterfly in Nifty to trade index range amid volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-short-iron-butterfly-in-nifty-to-trade-index-range-amid-volatility/articleshow/123159590.cms",
            "description": "The Nifty index posted five consecutive weekly losses, a rare trend seen only in 2001 and 2008. Analysts suggest a possible rebound this week, with a key trading range of 24,450–25,000. A short Iron Butterfly strategy is recommended, given low volatility and oversold FII positions, offering favorable risk-reward.",
            "pubDate": "2025-08-07T07:23:43.573671"
        },
        {
            "title": "Jindal Stainless, IIFL Finance among 9 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jindal-stainless-iifl-finance-among-9-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123159073.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade on August 6. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-08-07T07:23:43.573908"
        },
        {
            "title": "Trump’s 50% tariffs on India: Textiles, jewellery, shrimp, other export-exposed stocks slide up to 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-50-tariffs-on-india-textiles-jewellery-shrimp-other-export-exposed-stocks-slide-up-to-6/articleshow/123158624.cms",
            "description": "Indian export-oriented stocks fell sharply after Trump announced a 50% tariff on Indian goods like textiles, jewellery, shrimp, and chemicals. Analysts warn of sector-specific pain and stalling investments as trade tensions rise.",
            "pubDate": "2025-08-07T07:23:43.574015"
        },
        {
            "title": "FIIs' midcaps holdings soar in FY26; smallcaps deliver mixed results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-midcaps-holdings-soar-in-fy26-smallcaps-deliver-mixed-results/articleshow/123158443.cms",
            "description": "Despite a slight dip in overall holdings, foreign investors are increasing their bets on select Indian stocks, particularly in the midcap space. Top midcap picks like 360 One WAM and Paytm have delivered strong returns, while smallcap performance is more varied.",
            "pubDate": "2025-08-07T07:23:43.574123"
        },
        {
            "title": "Tariff tandav on India’s $87 billion export machine. Morgan Stanley, Jefferies, others decode impact on economy, markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-tandav-on-indias-87-billion-export-machine-morgan-stanley-jefferies-others-decode-impact-on-economy-markets/articleshow/123158320.cms",
            "description": "India's economy faces potential disruption as new tariffs threaten $87 billion in exports to the US, potentially shaving off up to 80 basis points from GDP growth. Brokerages warn of significant impacts on export-heavy sectors, leading to possible government intervention and RBI rate cuts.",
            "pubDate": "2025-08-07T07:23:43.574238"
        },
        {
            "title": "Samir Arora on why Indian investors must stick with equities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/samir-arora-on-why-indian-investors-must-stick-with-equities/slideshow/123157843.cms",
            "description": "Samir Arora, in an interview with ET Now, said that Indian investors have limited global investment options, so equities remain their primary choice. The decision is not about being fully invested or sitting on cash — it’s about comparing returns from equities versus other domestic assets, especially debt. Given lower interest rates and subdued nominal growth, equities still offer a superior risk-reward spread.",
            "pubDate": "2025-08-07T07:23:43.574345"
        },
        {
            "title": "Apple’s U.S. Pivot: Investment or optics?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apples-u-s-pivot-investment-or-optics/slideshow/123157560.cms",
            "description": "Apple will invest an additional $100 billion in the U.S., taking its total domestic commitment to $600 billion over the next four years. This comes after a previous pledge of $500 billion and the creation of 20,000 jobs across the country. (Source: Reuters)",
            "pubDate": "2025-08-07T07:23:43.574441"
        },
        {
            "title": "NSDL shares jump over 13% in 2 days after market debut. Time to lock in gains or hold on?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsdl-shares-jump-over-13-in-2-days-after-market-debut-time-to-lock-in-gains-or-hold-on/articleshow/123157409.cms",
            "description": "NSDL shares jumped 6.6% to ₹997.65 on Thursday, extending their post-listing rally to 13.4% from the opening price of ₹880. Listed a day earlier at a 10% premium over the ₹800 IPO price, the stock has shown strong early gains but still trails the grey market premium, prompting investors to reassess holding vs. booking profits.",
            "pubDate": "2025-08-07T07:23:43.574536"
        },
        {
            "title": "SoftBank Bets Big on AI: Eyes on earnings and mega deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/softbank-bets-big-on-ai-eyes-on-earnings-and-mega-deals/slideshow/123157340.cms",
            "description": "SoftBank is set to report its earnings on Thursday, and the spotlight is firmly on its aggressive investments in artificial intelligence. Analysts and investors are closely watching for details on how these massive bets will be financed, when returns are expected to materialise, and whether any asset sales are on the cards to support new initiatives. (Source: Reuters)",
            "pubDate": "2025-08-07T07:23:43.574631"
        },
        {
            "title": "Pidilite Industries shares rise over 2% after 18% YoY jump in Q1 PAT, 1:1 bonus share announcement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pidilite-industries-shares-rise-over-2-after-18-yoy-jump-in-q1-pat-11-bonus-share-announcement/articleshow/123157194.cms",
            "description": "Pidilite Industries reported an 18.7% YoY rise in Q1 PAT to Rs 678 crore and announced a 1:1 bonus share issue. Strong volume growth, improved margins, and a special dividend further boosted investor sentiment.",
            "pubDate": "2025-08-07T07:23:43.574728"
        },
        {
            "title": "Stocks to Buy | Feroze Azeez mecodes market strength amid global uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-feroze-azeez-mecodes-market-strength-amid-global-uncertainty/slideshow/123157100.cms",
            "description": "Feroze Azeez in an interview with ET Now, said that despite global uncertainty and geopolitical pressures, Indian markets remain resilient. He notes that Domestic Institutional Investors (DIIs) continue to buy, which indicates internal strength and shows that domestic fundamentals are outweighing negative global cues.",
            "pubDate": "2025-08-07T07:23:43.574821"
        },
        {
            "title": "Bajaj Auto shares slip 4% after Q1 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-auto-shares-slip-4-after-q1-results-should-you-buy-sell-or-hold/articleshow/123156860.cms",
            "description": "Bajaj Auto shares fell nearly 4% despite a 14% YoY rise in Q1FY26 PAT to ₹2,210 crore. Revenue grew 10% to ₹13,133 crore, driven by strong export and premium segment sales. EBITDA stood at ₹2,500 crore with a 19.7% margin, down QoQ due to lower dollar realisations, partially offset by better product mix.",
            "pubDate": "2025-08-07T07:23:43.574918"
        },
        {
            "title": "Shrimp stocks Avanti Feeds, Waterbase, others slide up to 5% after Trump slaps 50% tariffs on Indian exports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shrimp-stocks-avanti-feeds-waterbase-others-slide-up-to-5-after-trump-slaps-50-tariffs-on-indian-exports/articleshow/123156757.cms",
            "description": "Shares of top Indian shrimp exporters fell up to 5% after U.S. President Trump raised tariffs on Indian goods to 50%, targeting sectors like seafood. Avanti Feeds, Apex Frozen Foods, and Waterbase Ltd were hit hardest as investors reacted to rising trade tensions over India’s oil trade with Russia.",
            "pubDate": "2025-08-07T07:23:43.575012"
        },
        {
            "title": "Jindal Stainless shares plummet 7% after reporting Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jindal-stainless-shares-plummet-7-after-reporting-q1-results/articleshow/123156306.cms",
            "description": "Jindal Stainless shares fell despite a 10.6% YoY rise in Q1FY26 net profit to ₹715 crore. Revenue grew 8.2% to ₹10,207 crore, and EBITDA rose 8.1% YoY. On a QoQ basis, profit rose 21.1%, while revenue remained flat.",
            "pubDate": "2025-08-07T07:23:43.575109"
        },
        {
            "title": "What Trump's 50% tariff means for stock market investors; should Nifty bulls worry?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-trumps-50-tariff-mean-for-stock-market-investors-and-should-nifty-bulls-worry/articleshow/123156042.cms",
            "description": "Trump Tariffs Impact: Indian stock markets face uncertainty due to potential US tariffs. Investors are hesitant, awaiting trade deal clarity. Export-oriented sectors like textiles and auto ancillaries are most vulnerable. Focus shifts to domestic consumption-based businesses. Analysts suggest buying opportunities may arise from market corrections. Long-term investors are advised to remain steady. The rupee's decline offers some respite for exporters.",
            "pubDate": "2025-08-07T07:23:43.575201"
        }
    ]
}