{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-12T06:58:26.937625",
    "items": [
        {
            "title": "Tata Motors Commercial Vehicles shares debut at 28% premium. Should investors stay on board?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-commercial-vehicles-shares-debut-at-28-premium-should-investors-stay-on-board/articleshow/125264817.cms",
            "description": "Tata Motors Commercial Vehicles Share Price: TMLCV shares opened at Rs 335 on the NSE, up 28.5% from the implied value of Rs 260.75, and at Rs 330.25 on the BSE, a 26.6% gain, reflecting solid investor appetite even as analysts expect near-term volatility.",
            "pubDate": "2025-11-12T04:32:49.472070"
        },
        {
            "title": "Groww shares list at 14% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-list-at-14-premium-over-ipo-price/articleshow/125264762.cms",
            "description": "Groww, India's largest investment platform, debuted on Dalal Street with a 14% premium, listing at Rs 114 and Rs 112 on BSE and NSE respectively. The Rs 6,632-crore IPO saw strong subscription, particularly from institutional investors. Analysts view Groww as a proxy for India's expanding financialization trend, recommending it as a medium-to-long-term investment opportunity.",
            "pubDate": "2025-11-12T04:32:49.472216"
        },
        {
            "title": "HFCL, Premier Explosives stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hfcl-premier-explosives-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/125264670.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 1,000 crore, 15 stocks appeared in the bullish scanner for the 'White Marubozu' pattern on November 11, according to StockEdge.com's technical scan data. Of these, we highlighted six stocks that gained over 5%. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.\"",
            "pubDate": "2025-11-12T04:32:49.472350"
        },
        {
            "title": "Infosys, TCS tumble up to 27% as IT meltdown drags Nifty vs global peers. Where's the heartbeat index headed?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-tcs-tumble-up-to-27-as-it-meltdown-drags-nifty-vs-global-peers-wheres-the-heartbeat-index-headed/articleshow/125264915.cms",
            "description": "India's Nifty index shows modest one-year returns, lagging global peers. The IT sector, particularly Infosys and TCS, has dragged performance down. Financials, however, have been strong performers, delivering significant returns. Analysts anticipate a constructive outlook for Nifty over the next year, expecting stability and selective recovery in key sectors.",
            "pubDate": "2025-11-12T04:32:49.472465"
        },
        {
            "title": "Torrent Power shares in focus as Q2 PAT rises 50% YoY to Rs 742 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/torrent-power-shares-in-focus-as-q2-pat-rises-50-yoy-to-rs-742-crore/articleshow/125264852.cms",
            "description": "Torrent Power reported a significant 49.6% surge in profit after tax to Rs 742 crore for Q2 FY26, driven by a 9.8% revenue increase to Rs 7,876 crore. Improved merchant power sales and reduced finance costs bolstered performance. Despite higher depreciation, the company's strong quarterly results are expected to draw investor attention.",
            "pubDate": "2025-11-12T04:32:49.472579"
        },
        {
            "title": "Infosys, TCS, and other IT stocks in focus as Trump signals softer stance on H-1B visas",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-tcs-and-other-it-stocks-in-focus-as-trump-signals-softer-stance-on-h-1b-visas/articleshow/125264796.cms",
            "description": "U.S. President Donald Trump acknowledged the country’s need for skilled foreign workers, even as his administration moved to tighten visa regulations impacting global tech firms. In a Fox News interview, Trump was questioned about the future of H-1B visas and whether his administration planned to deprioritize them, according to Bloomberg.",
            "pubDate": "2025-11-12T04:32:49.472691"
        },
        {
            "title": "Thermax shares in focus Q2 net profit tumbles 40% to Rs 119 crore; revenue down 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thermax-shares-in-focus-q2-net-profit-tumbles-40-to-rs-119-crore-revenue-down-5/articleshow/125264746.cms",
            "description": "Thermax shares: The energy and environment solutions firm delivered a weak Q2 performance, with revenue down 5% year-on-year to Rs 2,474 crore and PAT plunging 40% to Rs 119 crore. PBT fell 35% to Rs 174 crore. Last year’s quarter had been boosted by a one-time Rs 66 crore incentive from the Maharashtra government under the PSI 2007 scheme.",
            "pubDate": "2025-11-12T04:32:49.472811"
        },
        {
            "title": "Tata Motors is the worst-performing PV stock this year. Is it also the most undervalued to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-is-the-worst-performing-pv-stock-this-year-is-it-also-the-most-undervalued-to-buy/articleshow/125264707.cms",
            "description": "Tata Motors has become the worst-performing passenger vehicle stock this year, sliding over 12% due to market share loss in EVs and struggles in its premium SUV portfolio. Despite global headwinds for JLR, analysts suggest the stock is undervalued, trading at a steep discount to peers, making it an attractive option for patient, long-term investors.",
            "pubDate": "2025-11-12T04:32:49.472923"
        },
        {
            "title": "Sensex rises 500 pts, Nifty tops 25,800 as U.S. trade hopes lift mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-350-pts-nifty-tops-25-750-as-u-s-trade-hopes-lift-mood/articleshow/125264535.cms",
            "description": "Indian stocks surged on Wednesday, led by financials and IT, as optimism grew over a potential US trade deal and an end to the US government shutdown. The Sensex and Nifty both opened higher, reflecting boosted investor confidence in the market.",
            "pubDate": "2025-11-12T04:32:49.473030"
        },
        {
            "title": "Bajaj Finserv among 7 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finserv-among-7-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125264587.cms",
            "description": "There was a notable surge in futures open interest for seven stocks in the NSE F&O pack on November 11, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-11-12T04:32:49.473137"
        },
        {
            "title": "Buy, Sell or Hold: BofA maintains underperform on Vodafone; Goldman Sachs recommend sell on ONGC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-bofa-maintains-underperform-on-vodafone-goldman-sachs-recommend-sell-on-ongc/articleshow/125264510.cms",
            "description": "Global brokerages express caution on Indian stocks. Bank of America maintains an Underperform rating on Vodafone Idea citing high debt and slow growth. Goldman Sachs reiterates Sell ratings on ONGC and Bajaj Finserv due to uninspiring earnings and valuations. These firms are closely watching company performance and future growth prospects.",
            "pubDate": "2025-11-12T04:32:49.473244"
        },
        {
            "title": "Biocon shares in focus as company swings to Rs 84 crore profit in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-shares-in-focus-as-company-swings-to-rs-84-crore-profit-in-q2/articleshow/125264465.cms",
            "description": "Biocon reported a strong turnaround in Q2FY26 with a net profit of Rs 84.5 crore against a loss of Rs 16 crore last year, driven by 21% YoY revenue growth to Rs 4,389 crore. Biosimilars led with 61% of revenue. The company also repaid key debts, aiming to boost margins and cut interest costs by FY27.",
            "pubDate": "2025-11-12T04:32:49.473400"
        },
        {
            "title": "The Rs 1.5 lakh crore paradox: Why FIIs are dumping stocks but chasing IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-rs-1-5-lakh-crore-paradox-why-fiis-are-dumping-stocks-but-chasing-ipos/articleshow/125264420.cms",
            "description": "Foreign institutional investors are divesting from Indian secondary markets while actively investing in IPOs, a trend termed 'The great divergence'. This split is driven by different investor types and a pursuit of valuation arbitrage, with long-term investors favoring primary markets for strategic entry points.",
            "pubDate": "2025-11-12T04:32:49.473512"
        },
        {
            "title": "Ather Energy among 7 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ather-energy-among-7-stocks-showing-bullish-rsi-upswing/slideshow/125264344.cms",
            "description": "Nine stocks from the Nifty500 pack that gained over 3% were highlighted in the RSI Trending Up scan on November 11, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-12T04:32:49.473618"
        },
        {
            "title": "RVNL shares drop 3% as PAT declines 20% YoY for Q2FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-as-pat-declines-20-yoy-for-q2fy26/articleshow/125264253.cms",
            "description": "RVNL share price: Rail Vikas Nigam Ltd (RVNL) reported a 19.7% year-on-year decline in Q2FY26 profit after tax to Rs 230 crore, even as revenue rose 5.5% to Rs 5,123 crore. EBITDA fell 20% and margins narrowed, reflecting cost pressures amid moderate top-line growth.",
            "pubDate": "2025-11-12T04:32:49.473726"
        },
        {
            "title": "SoftBank tanks 10% after $5.8-bn Nvidia stock sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/softbank-tanks-10-after-5-8-bn-nvidia-stock-sale/articleshow/125264185.cms",
            "description": "SoftBank has sold its entire stake in chip giant Nvidia for $5.8 billion. This move aims to generate cash for significant artificial intelligence investments. These include the ambitious US megaproject Stargate. SoftBank is a key investor in OpenAI, the creator of ChatGPT. The company reported a substantial profit increase in its latest quarter.",
            "pubDate": "2025-11-12T04:32:49.473832"
        },
        {
            "title": "ONGC shares rise 2% despite 18% drop in Q2 profit. Check target price by Nomura, Goldman Sachs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-shares-rise-2-despite-18-drop-in-q2-profit-check-target-price-by-nomura-goldman-sachs/articleshow/125266312.cms",
            "description": "ONGC shares rose up to 2.5% to Rs 255 on Wednesday despite an 18% YoY drop in Q2 profit to Rs 9,848 crore, weighed down by lower oil prices. Revenue slipped 2.5% to Rs 33,031 crore. The company announced an interim dividend of Rs 6 per share, with a total payout of Rs 7,548 crore.",
            "pubDate": "2025-11-12T05:53:59.260555"
        },
        {
            "title": "Groww shares rally up to 11% after strong D-Street debut. Should investors book profits now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-rally-up-to-11-after-strong-d-street-debut-should-investors-book-profits-now/articleshow/125266133.cms",
            "description": "Groww share price: Shares of Billionbrains Garage Ventures, the parent of investment platform Groww, extended gains post a strong debut, hitting an intraday high of Rs 124, up 24% from the IPO price of Rs 100. The stock listed at Rs 114 on the BSE and Rs 112 on the NSE",
            "pubDate": "2025-11-12T05:53:59.260685"
        },
        {
            "title": "Infosys’ Rs 18,000 cr buyback: 10 things to know ahead of Nov 14 record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-rs-18000-cr-buyback-10-things-to-know-ahead-of-nov-14-record-date/slideshow/125266039.cms",
            "description": "Infosys, India's second-largest IT services company, had announced its biggest-ever share buyback programme on September 12, 2025. The company aims to buy back 10 crore equity shares, marking a significant capital return to shareholders.The buyback is offering a 19% premium over the market price at the time of announcement. This is the fourth buyback by Infosys since 2017 and the largest in its history. Here’s all you need to know:",
            "pubDate": "2025-11-12T05:53:59.260790"
        },
        {
            "title": "Hitting it out of the park: 10 small & micro firms that clocked up to 700% profit growth in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hitting-it-out-of-the-park-10-small-micro-firms-that-clocked-up-to-700-profit-growth-in-q2/slideshow/125265560.cms",
            "description": "The September quarter saw several lesser-known small and micro-cap companies surprise the Street with extraordinary earnings growth. Despite a volatile market and cost pressures, these firms reported massive jumps in profits, with some seeing over 700% YoY growth in net earnings. Note: The market cap for these companies is below Rs 10,000 crore.",
            "pubDate": "2025-11-12T05:53:59.260888"
        },
        {
            "title": "500% rally in 5 months, 10 lower circuits, and a mild rebound: Should you ride the dizzying swings of Stallion India?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/500-rally-in-5-months-10-lower-circuits-and-a-mild-rebound-should-you-ride-the-dizzying-swings-of-stallion-india/articleshow/125265228.cms",
            "description": "Stallion India Fluorochemicals experienced a dramatic 500% rally followed by a sharp 50% correction, marked by ten lower circuits. The stock is now showing tentative signs of recovery after profit booking and stretched valuations impacted its steep decline. The company operates in a niche, growing fluorochemicals market with expansion plans.",
            "pubDate": "2025-11-12T05:53:59.260987"
        },
        {
            "title": "Tata Motors Commercial Vehicles hits top gear on debut post demerger. Here are 7 takeaways from the listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-commercial-vehicles-hits-top-gear-on-debut-post-demerger-here-are-7-takeaways-from-the-listing/articleshow/125267644.cms",
            "description": "Tata Motors Commercial Vehicles (TMLCV) made a robust debut, listing at a 28% premium as investors cheered the demerger and bet on a revival in India’s truck and bus cycle. The stock opened at Rs 335 on the NSE and later rose 3% to Rs 345, reflecting strong confidence in the standalone business and its growth prospects.",
            "pubDate": "2025-11-12T06:58:20.321405"
        },
        {
            "title": "Quantitative tightening brings forward BoE’s valuation losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/quantitative-tightening-brings-forward-boes-valuation-losses/slideshow/125267529.cms",
            "description": "The Bank of England said that the wider benefits from its past bond purchases mostly offset the large losses in its quantitative easing (QE) portfolio. This has become a politically sensitive issue because the government must cover the losses. The BoE has updated its estimate of the net lifetime loss from QE to between £60 and £120 billion, up from £55–115 billion in August. (Source: Reuters)",
            "pubDate": "2025-11-12T06:58:20.321535"
        },
        {
            "title": "US government shutdown shaves up to 1.5% off growth, recovery expected next year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-government-shutdown-shaves-up-to-1-5-off-growth-recovery-expected-next-year/slideshow/125267173.cms",
            "description": "White House economic adviser Kevin Hassett said the U.S. economy is expected to return to a growth rate of 3–4% by the first quarter of 2026. He attributed the recent slowdown to the government shutdown, which reduced growth by about 1 to 1.5 percentage points from last year’s nearly 4% pace. (Source: Reuters)",
            "pubDate": "2025-11-12T06:58:20.321640"
        },
        {
            "title": "Reliance Infra shares gain 5% despite 50% drop in Q2 net profit to Rs 1,911 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infra-shares-gain-5-despite-50-drop-in-q2-net-profit-to-rs-1911-crore/articleshow/125266827.cms",
            "description": "Reliance Infrastructure shares rose sharply despite a 50% year-on-year drop in Q2FY26 net profit to Rs 1,911 crore. Revenue from operations fell 14% to Rs 6,235 crore, with the power business continuing to be the primary contributor to the company’s overall earnings mix.",
            "pubDate": "2025-11-12T06:58:20.321751"
        },
        {
            "title": "Smallcaps on fire! Top 10 stocks that have rallied up to 178% in just 3 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcaps-on-fire-top-10-stocks-that-have-rallied-up-to-178-in-just-3-months/slideshow/125266783.cms",
            "description": "India’s smallcap segment has been on a tear, with select counters clocking triple-digit returns in just three months. From defence to tyres, banks to chemicals, the rally has been broad-based — reflecting strong earnings momentum, improving sentiment, and renewed investor appetite for high-growth stories. Here are the top 10 smallcap gainers over the last quarter, as per data from ACE Equity.",
            "pubDate": "2025-11-12T06:58:20.321853"
        },
        {
            "title": "A Strategic Supper: Trump engages corporate America for economic policy reset",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-strategic-supper-trump-engages-corporate-america-for-economic-policy-reset/slideshow/125266661.cms",
            "description": "US President Donald Trump is expected to host a private dinner at the White House on Wednesday with top business executives, including the CEOs of Nasdaq and JPMorgan Chase. The gathering aims to strengthen ties between the government and corporate leaders as the administration seeks to engage industry in its economic revival plans. (Source: Reuters)",
            "pubDate": "2025-11-12T06:58:20.321959"
        }
    ]
}