{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-29T11:39:37.563386",
    "items": [
        {
            "title": "Coal India Q2 Results: Cons net profit falls 30% YoY to Rs 4,354 crore, revenue slips 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/coal-india-q2-results-cons-pat-falls-30-yoy-to-rs-4354-crore-revenue-slides-3/articleshow/124894419.cms",
            "description": "Coal India Q2 Results:  Coal India reported a significant 30% year-on-year drop in net profit for the second quarter ended September 2025, reaching Rs 4,354.24 crore. Revenue from operations also saw a slight decrease of 3.2%, totaling Rs 30,186.7 crore for the period.",
            "pubDate": "2025-10-29T11:39:35.134884"
        },
        {
            "title": "Varun Beverages Q3 Results: PAT jumps over 18% YoY to Rs 745 crore, revenue up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/varun-beverages-q3-results-pat-jumps-over-18-yoy-to-rs-745-crore-revenue-up-2/articleshow/124893790.cms",
            "description": "Varun Beverages reported an 18.5% YoY rise in Q3 CY2025 PAT to Rs 745.2 crore, supported by lower finance costs and higher other income. Revenue grew 1.9% to Rs 4,896.6 crore, while EBITDA margins softened slightly amid higher expenses, even as gross margins improved.",
            "pubDate": "2025-10-29T11:39:35.135016"
        },
        {
            "title": "ICRA Q2 Results: Profit jumps 29% to Rs 48 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icra-q2-results-profit-jumps-29-to-rs-48-crore/articleshow/124890986.cms",
            "description": "Rating agency ICRA announced strong financial results for the September quarter. Consolidated net profit surged by 29.4 percent to Rs 48 crore. Revenue from operations also saw a healthy increase of 8.3 percent, reaching Rs 136.6 crore. For the half year, profit after tax grew 24.4 percent. This performance was driven by growth in the ratings and research segments.",
            "pubDate": "2025-10-29T11:39:35.135155"
        },
        {
            "title": "ITC Q2 results preview: PAT may grow up to 11% YoY, revenue seen 15% higher; 6 things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-q2-results-preview-pat-may-grow-up-to-11-yoy-revenue-seen-15-higher-6-things-to-track/articleshow/124890626.cms",
            "description": "ITC's Q2 earnings are anticipated to show a modest profit increase of up to 11% year-on-year, with revenue projected to climb around 15%. Analysts expect steady cigarette volumes and an improved product mix to drive growth, though FMCG and agri segments might see slower progress.",
            "pubDate": "2025-10-29T11:39:35.135266"
        }
    ]
}