{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-20T19:22:11.219686",
    "items": [
        {
            "title": "Q2 results this week: ICICI Bank, ITC, Bajaj Housing Finance, Zomato among 182 companies to announce earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-this-week-icici-bank-itc-bajaj-housing-finance-zomato-among-182-companies-to-announce-earnings/articleshow/114391031.cms",
            "description": "This week, 182 companies, including ICICI Bank, HUL and Zomato, will report Q2 earnings. Key dates feature multiple significant announcements, impacting market sentiment and stock performance.",
            "pubDate": "2024-10-20T19:22:03.228420"
        },
        {
            "title": "HDFC profit rises 5.3%, beats street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-profit-rises-5-3-beats-street/articleshow/114389869.cms",
            "description": "HDFC Bank surpasses expectations with a 5.3% rise in net profit to ₹16,821 crore for the September quarter, aided by an increase in net interest income. The bank focuses on reducing borrowings, controlling unsecured loans, and improving credit-deposit ratio, and witnessed a decline in provisions and slippages.",
            "pubDate": "2024-10-20T19:22:03.228542"
        },
        {
            "title": "Tech Mahindra Q2 net profit up 153% YoY to Rs 1,250 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q2-net-profit-up-153-yoy-to-1250-cr/articleshow/114389616.cms",
            "description": "Tech Mahindra's net profit increased 46.8% to ₹1,250 crore in the fiscal second quarter, driven by improved margins and a one-time land sale gain. Revenue rose 2.4% sequentially to ₹13,313 crore. The company's total contract value surged to $603 million, and it hired 6,653 employees, with a focus on operational excellence through Project Fortius.",
            "pubDate": "2024-10-20T19:22:03.228654"
        },
        {
            "title": "Kotak Mahindra Bank Q2 Results: Net profit below estimates as RBI ban, rise in NPA bite",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-mahindra-bank-q2-results-net-profit-below-estimates-as-rbi-ban-rise-in-npa-bite/articleshow/114378157.cms",
            "description": "Kotak Mahindra Bank reported a 5% increase in standalone profit to Rs 3,344 crore for the quarter ended September 2024, driven by an 11% growth in net interest income. However, rising NPAs and a slowdown in consumer loans pressured margins and increased provisions.",
            "pubDate": "2024-10-20T19:22:03.228756"
        },
        {
            "title": "HDFC Bank Q2 Results: PAT rises 5% YoY to Rs 16,821 crore, beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q2-results-pat-rises-5-yoy-to-rs-16821-crore-beats-street-estimates/articleshow/114371837.cms",
            "description": "HDFC Bank Q2 Results: The core net interest margin (NIM) stood at 3.46% on total assets and 3.65% on interest-earning assets. The lender’s total deposits increased 15.1% YoY to Rs 25,00,100 crore in the September quarter, while gross advances grew 7% YoY to Rs 25,19,000 crore. As of September-end, HDFC Bank's gross NPA rose to 1.36% of gross advances, up from 1.33% in Q1 FY25 and 1.34% in Q2 FY24.",
            "pubDate": "2024-10-20T19:22:03.228853"
        },
        {
            "title": "RBL Bank Q2 Results: Standalone profit falls 24% YoY to Rs 223 crore, but NII grows 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rbl-bank-q2-results-standalone-profit-falls-24-yoy-to-rs-223-crore-but-nii-grows-9/articleshow/114371261.cms",
            "description": "RBL Bank Q2 Results: The company's NII for the quarter was Rs 1,615 crore, with net interest margins (NIMs) at 5.04%. Operating profit rose 24% YoY to Rs 910 crore. For the half-year, RBL Bank's net profit increased by 2% YoY to Rs 594 crore, with NIMs at 5.35%.",
            "pubDate": "2024-10-20T19:22:03.228948"
        },
        {
            "title": "Kotak Mahindra Bank Q2 Results: PAT rises 5% YoY to Rs 3,344 cr; NII jumps 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-mahindra-bank-q2-results-pat-rises-5-yoy-to-rs-3344-cr-nii-jumps-11/articleshow/114369811.cms",
            "description": "Kotak Mahindra Bank Q2 Results: The bank's net interest income (NII) for Q2FY25 rose by 11% year-on-year to Rs 7,020 crore, up from Rs 6,297 crore in the same quarter last year. Its net interest margin (NIM) stood at 4.91% for Q2, down from 5.22% in Q2FY24. As of September, the gross non-performing assets (GNPA) increased to 1.49% from 1.72% year-on-year, while net NPA rose to 0.43% from 0.37%. On a consolidated level, Kotak's PAT rose 13% YoY to Rs 5,044 crore. The total assets under management as of September-end were Rs 680,838 crore up 37% YoY over Rs 498,342 crore in Q2 of FY24.",
            "pubDate": "2024-10-20T19:22:03.229047"
        }
    ]
}