{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-14T01:24:43.765690",
    "items": [
        {
            "title": "Asian stocks fall as Fed rate cut doubts emerge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fall-as-fed-rate-cut-doubts-emerge/articleshow/125313478.cms",
            "description": "Asian markets opened lower on Friday. Investors are worried about the US Federal Reserve's interest rate decisions. High valuations in technology shares also caused concern. Wall Street saw significant drops on Thursday. The pound weakened after reports of a U-turn on tax increases. Investors are now closely watching upcoming economic data.",
            "pubDate": "2025-11-14T01:24:31.095811"
        },
        {
            "title": "Broking firms see profit slide as Sebi curbs hit trading volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/broking-firms-see-profit-slide-as-sebi-curbs-hit-trading-volumes/articleshow/125313287.cms",
            "description": "Broking firms experienced a profit and revenue decline in the September quarter due to reduced market volumes and Sebi's new regulations. Stricter margin norms and the 'true-to-label' circular impacted earnings, while intense competition and technology spending increased costs. Analysts suggest the sector remains under pressure, with future performance dependent on non-broking revenue streams and regulatory stability.",
            "pubDate": "2025-11-14T01:24:31.095962"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125304858.cms",
            "description": "Nifty closed flat on Thursday, with profit booking in the final hour capping gains after three consecutive sessions. Analysts remain optimistic about equities due to easing inflation, exporter policy support, and positive corporate earnings. Today's session may experience heightened volatility due to the Bihar election outcome.",
            "pubDate": "2025-11-14T01:24:31.096073"
        },
        {
            "title": "Stocks in news: Hero MotoCorp, LG India, Nippon Life India AMC, J&K Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hero-motocorp-tata-motors-pv-lg-india-nippon-life-india-amc-jk-bank/articleshow/125304793.cms",
            "description": "Indian markets saw volatile trading and ended flat on weekly expiry day. Analysts suggest consolidation may follow the recent rally. Key sectors like banking and IT remain strong. Investors are advised to focus on specific stocks in banking, auto, and metals. Several companies like Hero MotoCorp, Tata Motors, and Eicher Motors reported their second-quarter results.",
            "pubDate": "2025-11-14T01:24:31.096171"
        },
        {
            "title": "Asian Paints jumps 8% in two days on strong Q2 and rival CEO exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-jumps-8-in-two-days-on-strong-q2-and-rival-ceo-exit/articleshow/125313041.cms",
            "description": "Asian Paints stock surged over 8% in two trading sessions, driven by a strong second-quarter performance and the exit of a rival CEO. The company's net profit jumped 43%, exceeding expectations and prompting price target upgrades from analysts. Despite renewed investor interest, some analysts remain cautious about a sustained rally, citing capped upsides after the recent run-up.",
            "pubDate": "2025-11-14T01:24:31.096270"
        },
        {
            "title": "DWS to buy 40% in Nippon Life India AIF business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dws-to-buy-40-in-nippon-life-india-aif-business/articleshow/125312956.cms",
            "description": "German firm DWS Group is acquiring a 40% stake in Nippon Life India Asset Management's alternatives business. This partnership aims to expand operations in alternatives, active, and passive assets. The companies will also jointly launch passive products. A global distribution arrangement is planned for India-focused mutual funds. The alternatives sector in India is poised for significant growth.",
            "pubDate": "2025-11-14T01:24:31.096369"
        },
        {
            "title": "M&M to enter life insurance market via 50:50 JV with Manulife",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-to-enter-life-insurance-market-via-5050-jv-with-manulife/articleshow/125312786.cms",
            "description": "Mahindra & Mahindra is entering the life insurance sector through a 50:50 joint venture with Canada's Manulife, committing up to ₹3,600 crore each. Operations are expected to launch within 15-18 months of regulatory approval, with a focus on underpenetrated rural and semi-urban markets. The venture aims for break-even around the tenth year.",
            "pubDate": "2025-11-14T01:24:31.096464"
        },
        {
            "title": "Stock Radar: InterGlobe Aviation breaks out from a falling trendline resistance; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-interglobe-aviation-breaks-out-from-a-falling-trendline-resistance-what-should-investors-do/articleshow/125296461.cms",
            "description": "InterGlobe Aviation Ltd has broken out of a falling trendline resistance on daily charts, signaling potential upside. Experts suggest short-term traders can buy the stock for a target above Rs 6,000 in the next 2-3 weeks, citing strong price action and sector fundamentals.",
            "pubDate": "2025-11-14T01:24:31.096556"
        },
        {
            "title": "Aviom India Housing Finance promoter offers to settle dues as six entities put in bids",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aviom-india-housing-finance-promoter-offers-to-settle-dues-as-six-entities-put-in-bids/articleshow/125313133.cms",
            "description": "According to the proposal, there would be an upfront payment of Rs 350 crore while the accrued interest would be paid in 24 months after the initial 26 months of principal payment. Ilmi's plan also includes full repayment to operational creditors and employees amounting to Rs 2.9 crore. She has also suggested that lenders appoint a professional CEO to run the company during the proposed repayment period. The proposal recommends the appointment of five directors, including two lender nominees, and includes an indemnity agreement between the company and these directors.",
            "pubDate": "2025-11-14T01:24:31.096645"
        },
        {
            "title": "RBI has room to cut rates, can't predict timing: Economists",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-has-room-to-cut-rates-cant-predict-timing-economists/articleshow/125313320.cms",
            "description": "\"While the inflation trajectory is likely to remain benign, the RBI will need to filter the festive and GST-related demand from the cyclical recovery,\" said Upasna Bharadwaj, chief economist, Kotak Mahindra Bank. \"We remain skeptical on the sustainability of the recent pickup in economic activity and, hence, see some room for further monetary easing.\"",
            "pubDate": "2025-11-14T01:24:31.096739"
        },
        {
            "title": "Policy support key for Tata Steel UK: CFO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/policy-support-key-for-tata-steel-uk-cfo/articleshow/125313246.cms",
            "description": "While losses narrowed year-on-year in the UK operations in the September quarter, the performance trailed the management's guidance. Back in 2024, Tata had said these operations would turn profitable at an operating level in FY25. Tata Steel is working on slashing costs. It is also engaging with the British government on policy-related issues as imports in certain product segments are higher than even the total consumption in the country.",
            "pubDate": "2025-11-14T01:24:31.096833"
        }
    ]
}