{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-31T16:11:34.534450",
    "items": [
        {
            "title": "Jio Financial to raise Rs 15,825 crore via preferential issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-to-raise-rs-15825-crore-via-preferential-issue/articleshow/123008592.cms",
            "description": "Jio Financial Services will raise ₹15,825 crore by issuing convertible warrants. Sikka Ports and Jamnagar Utilities will be issued these warrants. The capital will be used for investments in insurance and lending ventures. Jio has tied up with BlackRock for mutual funds. Jio Financial's board approved the issuance of warrants at Rs 316.50 apiece.",
            "pubDate": "2025-07-31T01:47:38.130983"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123008468.cms",
            "description": "Nifty closed slightly higher, influenced by L&T and Sun Pharma, but faces potential volatility due to Trump's tariff announcement. Analysts advise caution and hedging strategies as earnings season progresses. The rupee weakened amid India-US trade uncertainty, while FIIs remained net sellers.",
            "pubDate": "2025-07-31T01:47:38.131106"
        },
        {
            "title": "Stocks in news: HUL, Swiggy, Tata Steel, Tata Motors, M&M",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hul-swiggy-tata-steel-tata-motors-mm/articleshow/123008398.cms",
            "description": "Indian markets experienced marginal gains on Wednesday, influenced by mixed signals. Several companies are in the spotlight due to Q1 results, including HUL, Swiggy, Sun Pharma, and Maruti Suzuki. Tata Steel and M&M reported significant profit growth, while IndiGo's net profit declined.",
            "pubDate": "2025-07-31T01:47:38.131214"
        },
        {
            "title": "US futures rise on tech earnings, dollar steadies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-futures-rise-on-tech-earnings-dollar-steadies/articleshow/123008291.cms",
            "description": "US equity futures climbed following strong earnings from tech giants like Microsoft and Meta, despite a volatile Wall Street session. The dollar stabilized after the Federal Reserve held interest rates steady. Asian markets showed mixed performance, with South Korean equities fluctuating after a US trade deal. Investors are now focused on the Bank of Japan's rate decision.",
            "pubDate": "2025-07-31T01:47:38.131316"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/123008216.cms",
            "description": "For all those who are surprised by what President Trump has said and done, remember his track record. Just a few days into his second term as US president, he was talking of sacking US Fed chairman Jerome Powell; he backtracked in just two days. So, he can say anything and then pull back. This does not mean that, in the short term, there will be no trouble for some businesses. They will face headwinds; and the probability is that there will be a hit in the coming quarters. But if one looks at India’s macro structure, we are still a domestic-oriented economy.",
            "pubDate": "2025-07-31T01:47:38.131414"
        },
        {
            "title": "Sumant Kathpalia offers Rs 5.2 crore to settle insider trading case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sumant-kathpalia-offers-rs-5-2-crore-to-settle-insider-trading-case/articleshow/123008202.cms",
            "description": "Former IndusInd Bank CEO Sumant Kathpalia has proposed a ₹5.21 crore settlement to SEBI regarding insider trading allegations. SEBI had barred Kathpalia and other executives for trading on unpublished price-sensitive information related to accounting discrepancies. Kathpalia's settlement application includes a pledge of confidentiality, while SEBI impounded ₹19.8 crore from the involved individuals.",
            "pubDate": "2025-07-31T01:47:38.131540"
        },
        {
            "title": "Why are Indian households struggling with medical costs despite health initiatives?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-are-indian-households-struggling-with-medical-costs-despite-health-initiatives/articleshow/123008120.cms",
            "description": "India's out-of-pocket health expenses are among the highest in major economies. Though it decreased from 2014 to 2024, it remains significant. China saw a smaller decrease in the same period. Emerging Asia's health protection gap has widened. Rising medical costs and coverage gaps are key issues. Many Indian families struggle to afford healthcare.",
            "pubDate": "2025-07-31T01:47:38.131636"
        },
        {
            "title": "Anant Ambani's appointment to RIL board gets shareholder nod",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anant-ambanis-appointment-to-ril-board-gets-shareholder-nod/articleshow/123008015.cms",
            "description": "Anant Ambani is now the executive director at Reliance Industries. Reliance Industries shareholders gave their approval. The RIL board appointed Mukesh Ambani's youngest son on April 25. Anant will serve for five years, starting May 1. He has been on the boards of Jio Platforms and Reliance Foundation. He also serves on Reliance New Energy and Reliance New Solar Energy.",
            "pubDate": "2025-07-31T01:47:38.131729"
        },
        {
            "title": "Will Tata Motors' ambitious Iveco acquisition strain its financial stability?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-tata-motors-ambitious-iveco-acquisition-strain-its-financial-stability/articleshow/123007962.cms",
            "description": "Tata Motors' stock experienced a decline following reports of a possible acquisition of Iveco. The deal, valued at ₹3.9 billion, may require external funding for the Indian automaker. Analysts anticipate pressure on Tata Motors' balance sheet due to rising global tariff uncertainties. Iveco's revenue declined in FY24, but expects stable growth in 2025.",
            "pubDate": "2025-07-31T01:47:38.131822"
        },
        {
            "title": "Vedanta Resources seeks investor nod to prepay $550-million debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-resources-seeks-investor-nod-to-prepay-550-million-debt/articleshow/123007844.cms",
            "description": "Vedanta Resources aims to prepay a $550 million private credit facility by raising $700 million from banks like Barclays and Standard Chartered, seeking investor consent for early repayment. This refinancing targets a lower interest rate, around SOFR + 400-500 basis points, significantly reducing borrowing costs.",
            "pubDate": "2025-07-31T01:47:38.131915"
        },
        {
            "title": "Spandana's top ten investors to buy into Rs 400-crore rights issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spandanas-top-ten-investors-to-buy-into-rs-400-crore-rights-issue/articleshow/123007786.cms",
            "description": "Spandana Sphoorty Financial's ₹400-crore rights issue, opening August 1, has secured participation from its top 10 institutional investors, including Kedaara Capital, which holds 48.13%. Despite a net loss in FY25, the company aims to restore stakeholder confidence through this issue. Kedaara Capital may extend its investment beyond its scheduled exit in September 2026.",
            "pubDate": "2025-07-31T01:47:38.132007"
        },
        {
            "title": "Hot Stocks: 3 stocks that may give returns between 22-36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-3-stocks-that-may-give-returns-between-22-36/articleshow/123007717.cms",
            "description": "Analysts predict significant returns for NTPC, Ather Energy, and Varun Beverages. CLSA projects a 35.4% upside for NTPC, citing continued re-rating. NUVAMA initiates coverage on Ather Energy with a buy rating, anticipating strong growth in the EV sector. HSBC reiterates a buy rating for Varun Beverages, forecasting a 22.6% upside due to attractive valuations and growth potential.",
            "pubDate": "2025-07-31T01:47:38.132096"
        },
        {
            "title": "How will Trump's tariff announcement impact Indian stock market?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-trumps-tariff-announcement-impact-indian-stock-market/articleshow/123007612.cms",
            "description": "Indian equities are expected to decline following Trump's tariff announcement, as indicated by a drop in GIFT Nifty futures. Nilesh Shah of Kotak Mahindra AMC anticipates a negative market reaction, despite expectations of a trade deal due to aligned US-India strategic interests. Export-oriented sectors are likely to face the most significant impact.",
            "pubDate": "2025-07-31T01:47:38.132184"
        },
        {
            "title": "Why did Fed keep interest rates unchanged despite Trump's pressure?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-did-fed-keep-interest-rates-unchanged-despite-trumps-pressure/articleshow/123007547.cms",
            "description": "The Federal Reserve maintained its key short-term interest rate, defying President Trump's persistent calls for a reduction. The rate remains at 4.3%, a level established after three cuts last year, with officials citing the need to assess the impact of Trump's tariffs on inflation and the economy.",
            "pubDate": "2025-07-31T01:47:38.132271"
        },
        {
            "title": "Stock Radar: Down over 20% from highs! Varun Beverages stock showing signs of trend reversal – time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-down-over-20-from-highs-varun-beverages-stock-showing-signs-of-trend-reversal-time-to-buy/articleshow/122995601.cms",
            "description": "Varun Beverages stock showed a 'W' pattern breakout, reclaiming moving averages. The stock fell 24% after a high in July 2024. It found support around 400 in March 2025. Experts suggest buying for a target of Rs 870 in 1-2 months. SMC Global Securities recommends accumulating between Rs 500-510, targeting Rs 574-576 with a stop loss below Rs 450.",
            "pubDate": "2025-07-31T01:47:38.132362"
        },
        {
            "title": "Tata Motors' Iveco takeover to fuel global CV ambitions but not without risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-iveco-takeover-to-fuel-global-cv-ambitions-but-not-without-risks/articleshow/123007773.cms",
            "description": "Tata Motors offer is aimed at acquiring 100% of Iveco's common shares with a subsequent delisting of Iveco Group from the Euronext Milan stock exchange. The all-cash offer valued Iveco at about Rs 3.8 billion ($4.4 billion). Both companies believe that having Iveco operate as a wholly-owned unit of the Mumbai-based automaker is crucial for its sustainable success and long-term value creation. Iveco has a diversified business with 74% of revenues from Europe and the rest from South America, Africa, and Oceania.",
            "pubDate": "2025-07-31T01:47:38.132451"
        },
        {
            "title": "NSDL IPO: GMP, brokerage view, GMP & other 8 things to know before subscribing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsdl-ipo-gmp-brokerage-view-gmp-other-8-things-to-know-before-subscribing/articleshow/123013036.cms",
            "description": "Following the release of June quarter results, eight smallcap stocks have surged, with gains ranging from 10% to 50%. This rally is fueled by robust revenue and profit growth, reflecting increased demand and improved operational efficiency. While FIIs have reduced holdings in most of these companies, mutual funds have largely increased or maintained their stakes, indicating a bullish outlook.",
            "pubDate": "2025-07-31T06:35:13.032437"
        },
        {
            "title": "PNB shares fall 4% after Q1 profit drops 48% YoY to Rs 1,675 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-shares-fall-4-after-q1-profit-drops-48-yoy-to-rs-1675-crore/articleshow/123012942.cms",
            "description": "Punjab National Bank's shares dipped 4% following a 48% YoY drop in net profit for Q1 2025, reporting Rs 1,675 crore against last year's Rs 3,251.5 crore, impacted by a significant tax expense. While total income rose 15.7%, NII saw marginal growth. Asset quality improved with reduced GNPA and NNPA.",
            "pubDate": "2025-07-31T06:35:13.032567"
        },
        {
            "title": "No September relief? Fed leaves market guessing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/no-september-relief-fed-leaves-market-guessing/slideshow/123012804.cms",
            "description": "The Federal Reserve decided to keep interest rates unchanged at 4.25%–4.50%, holding its ground despite mounting political pressure. This cautious stance came amid a split decision, with two Trump-appointed governors dissenting, expressing concerns that the Fed’s policy remains too tight. (Source: Reuters)",
            "pubDate": "2025-07-31T06:35:13.032676"
        },
        {
            "title": "Picture abhi baki hai: Why Sensex, Nifty are down but not crashing after Trump’s 25% tariff bombshell",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/picture-abhi-baki-hai-why-sensex-nifty-are-down-but-not-crashing-after-trumps-25-tariff-bombshell/articleshow/123012864.cms",
            "description": "President Trump announced a 25% tariff on Indian goods, impacting sectors like textiles and pharmaceuticals. Sensex and Nifty initially fell but recovered. Experts believe the tariff is temporary, part of ongoing trade negotiations. A US delegation will visit India in August. Investors are advised to buy the dip, focusing on domestic consumption themes.",
            "pubDate": "2025-07-31T06:35:13.032775"
        },
        {
            "title": "Carborundum Universal, Go Digit, Jubilant Pharmova among 6 stocks closed crossing above VWAP on July 30",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/carborundum-universal-go-digit-jubilant-pharmova-among-6-stocks-closed-crossing-above-vwap-on-july-30/slideshow/123012215.cms",
            "description": "The closing prices of six stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on July 30. A shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-07-31T06:35:13.032876"
        },
        {
            "title": "Shrimp stocks Avanti Feeds, Waterbase, others fall up to 7% after Trump threatens 25% tariff and penalty on India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shrimp-stocks-avanti-feeds-waterbase-others-fall-up-to-7-after-trump-threatens-25-tariff-and-penalty-on-india/articleshow/123012104.cms",
            "description": "Avanti Feeds, Apex Frozen Foods, and Waterbase Ltd witnessed steep declines as investors priced in concerns over a potential impact on exports. Avanti Feeds tumbled 6.6% to Rs 645, Apex Frozen Foods slipped 6.5% to Rs 225.05, and Waterbase fell 4.5% to Rs 49.16.",
            "pubDate": "2025-07-31T06:35:13.032995"
        },
        {
            "title": "Punjab National Bank, Mankind Pharma among 9 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/punjab-national-bank-mankind-pharma-among-9-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123012042.cms",
            "description": "There was a notable surge in futures open interest for seven stocks in the NSE F&O pack as of July 30, contributing to a total increase in open interest of over 7% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-07-31T06:35:13.033094"
        },
        {
            "title": "Missed CDSL’s 1,100% rally? NSDL IPO could be your second chance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/missed-cdsls-1100-rally-nsdl-ipo-could-be-your-second-chance/articleshow/123011674.cms",
            "description": "CDSL made its market debut in 2017 at Rs 125 per share. In the years since, the stock soared beyond Rs 1,500, fueled by a surge in retail investor participation after COVID-19 and increased financial market inclusion. Now managing over 15 crore demat accounts, CDSL has become a key player in India’s retail investing boom.",
            "pubDate": "2025-07-31T06:35:13.033196"
        },
        {
            "title": "TCS layoffs explained: AI impact or industry crisis? | 12,000 jobs cut | What it means for IT & you",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-layoffs-explained-ai-impact-or-industry-crisis-12000-jobs-cut-what-it-means-for-it-you/videoshow/123002156.cms",
            "description": "TCS is laying off 12,000 employees — but this isn’t just cost-cutting. It’s a warning sign for India’s entire IT sector. From drying demand to AI disruption, we break down why this layoff is bigger than it seems — and what it means for tech professionals and investors.",
            "pubDate": "2025-07-31T06:35:13.033291"
        },
        {
            "title": "6,415% return! NSE's Rs 59 crore investment turns to Rs 3,840 crore in NSDL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/6415-return-nses-rs-59-crore-investment-turns-to-rs-3840-crore-in-nsdl/articleshow/123010853.cms",
            "description": "NSE is set to gain significantly from its early investment in NSDL, with its stake now valued at Rs 3,840 crore due to NSDL's IPO. While NSE is selling shares to comply with regulatory requirements, it will still realize substantial proceeds.",
            "pubDate": "2025-07-31T06:35:13.033393"
        },
        {
            "title": "Rs 25,000 crore FII exodus ends Nifty's 4-month bull run but August could be much worse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-25000-crore-fii-exodus-ends-niftys-4-month-bull-run-but-august-could-be-much-worse/articleshow/123010777.cms",
            "description": "Indian markets face a potential downturn as the Nifty breaks support levels, ending a four-month rally. Foreign investors have triggered a massive sell-off, compounded by Trump's tariffs and disappointing earnings. Historically, August is a weak month, and analysts warn of further declines. Technical indicators are flashing red, and the rupee's fall adds to the pressure.",
            "pubDate": "2025-07-31T06:35:13.033485"
        },
        {
            "title": "Tata Motors shares drop over 2%: What’s behind the decline and is it time to invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-drop-over-2-whats-behind-the-decline-and-is-it-time-to-invest/articleshow/123010725.cms",
            "description": "Tata Motors shares: Investor sentiment took a hit under the pressure of U.S. President Donald Trump’s proposed 25% reciprocal tariffs, dragging the stock lower.",
            "pubDate": "2025-07-31T06:35:13.033579"
        },
        {
            "title": "Microsoft set to hit $4 trillion market cap after earnings beat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/microsoft-set-to-hit-4-trillion-market-cap-after-earnings-beat/articleshow/123010487.cms",
            "description": "Microsoft may soon achieve a market value of $4 trillion. This follows a strong earnings report that exceeded expectations. The company's stock price surged in response. Nvidia Corporation was the first to reach this milestone. Microsoft's cloud business, particularly Azure, is driving growth. Analysts are largely positive about Microsoft's future prospects. The company expects continued revenue growth.",
            "pubDate": "2025-07-31T06:35:13.033669"
        },
        {
            "title": "Investors lose over Rs 5 lakh crore as Sensex sinks 600 pts; 4 key factors behind today's slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-investors-lose-over-rs-5-lakh-crore-in-15-mins-as-sensex-tumbles-600-pts-on-trumps-tariff-move/articleshow/123010479.cms",
            "description": "Stock Market Crash: Indian benchmark indices experienced a sharp decline on Thursday morning following President Trump's threat to impose a 25% tariff on Indian goods starting August 1, coupled with an unspecified penalty. The BSE Sensex fell by 0.74% and the Nifty50 dropped by 0.73%. This downturn resulted in a significant decrease of Rs 5.",
            "pubDate": "2025-07-31T06:35:13.033764"
        },
        {
            "title": "Trump's 25% Tariff shock shakes D-Street today; pharma among top 5 vulnerable sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-25-tariff-shock-shakes-d-street-today-pharma-among-top-5-vulnerable-sectors/articleshow/123010458.cms",
            "description": "The US administration's imposition of a 25% tariff on Indian imports, starting August 1, is poised to trigger volatility across export-oriented sectors. Uncertainty looms due to an undefined penalty linked to India's Russian arms and energy imports. Sectors like pharmaceuticals, industrials, and textiles may face challenges.",
            "pubDate": "2025-07-31T06:35:13.033857"
        },
        {
            "title": "ITD Cementation shares in focus after highest-ever quarterly profit of Rs 137 crore in Q1, up 37% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itd-cementation-shares-in-focus-after-highest-ever-quarterly-profit-of-rs-137-crore-in-q1-up-37-yoy/articleshow/123010260.cms",
            "description": "ITD Cementation India posted its highest-ever quarterly net profit of Rs 137 crore in Q1FY26, up 37% YoY. Revenue rose 7% to Rs 2,542 crore. The company secured new orders worth Rs 2,900 crore, taking the order book to Rs 18,820 crore.",
            "pubDate": "2025-07-31T06:35:13.033963"
        },
        {
            "title": "Nuvama shares fall 4% on reports of income tax search in connection to Jane Street case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-shares-fall-4-on-reports-of-income-tax-search-in-connection-to-jane-street-case/articleshow/123016877.cms",
            "description": "Nuvama Wealth Management shares fell nearly 4% after Income Tax officials searched its offices in connection with the Jane Street market manipulation case. Although not directly accused, Nuvama’s link as Jane Street’s Indian partner has spooked investors amid regulatory scrutiny.",
            "pubDate": "2025-07-31T09:59:35.844151"
        },
        {
            "title": "8 smallcap stocks rally up to 50% after June quarter results day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-smallcap-stocks-rally-up-to-50-after-june-quarter-results-day/articleshow/123016662.cms",
            "description": "Smallcap stocks see a rise in share prices after strong June quarter results. Eight stocks rally between 10% and 50%. Vimta Labs, Infobeans Technologies, and others lead the surge. FIIs reduce holdings in some, while MFs increase stakes in others. Technical indicators show bullish signals for several stocks. This highlights recovery and expansion in the smallcap space.",
            "pubDate": "2025-07-31T09:59:35.844277"
        },
        {
            "title": "FIIs bet on these 11 microcap stocks; one turns multibagger in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-bet-on-these-11-microcap-stocks-one-turns-multibagger-in-fy26/slideshow/123016721.cms",
            "description": "Foreign Institutional Investors (FIIs) are steadily increasing their investments in India’s smallest companies. Within the Nifty Microcap 250 index, they raised their stakes in 108 stocks in the June quarter compared to the March quarter. It is an important signal, since FIIs usually dive deep before investing.So far in FY26, the Nifty Microcap index has delivered a return of around 16%, outperforming the broader benchmark Nifty index, which has risen by about 6% during the same period. This highlights a growing investor appetite for high-growth opportunities in smaller, lesser-known companies. What makes this trend even more compelling is that out of the 108 microcap stocks where FIIs have increased their holdings, 51 have outperformed the overall microcap index’s return so far this fiscal year. From this list, we have identified 11 remarkable microcap stocks that have delivered impressive price increases ranging from 50% to 100% in FY26 so far. (Data Source: ACE Equity)",
            "pubDate": "2025-07-31T09:59:35.844395"
        },
        {
            "title": "Kaynes Technology shares rally 11% post Q1 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-shares-rally-11-post-q1-results-should-you-buy-sell-or-hold/articleshow/123016430.cms",
            "description": "Kaynes Technology posted a 49.96% year-on-year jump in consolidated net profit at Rs 74.61 crore for the quarter ended June 2025, driven by strong operational performance. Revenue rose 33.63% to Rs 673.46 crore, while profit before tax climbed nearly 50% to Rs 96.08 crore.",
            "pubDate": "2025-07-31T09:59:35.844498"
        },
        {
            "title": "Powell Holds Firm: Treasury yields rise on Fed caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/powell-holds-firm-treasury-yields-rise-on-fed-caution/slideshow/123016210.cms",
            "description": "U.S. Treasury yields rose on Wednesday after Fed Chair Jerome Powell said it's too early to decide whether interest rates will be cut in September. His cautious tone dashed investor hopes for a near-term policy shift. (Source: Reuters)",
            "pubDate": "2025-07-31T09:59:35.844599"
        },
        {
            "title": "Trump's 25% tariff on India may be an opportunity amid adversity; Vijay Kedia explains how",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-25-tariff-on-india-may-be-an-opportunity-amid-adversity-vijay-kedia-explains-how/articleshow/123015396.cms",
            "description": "Amid US tariff tensions, investor Vijay Kedia responded with a motivational song on X, urging resilience and national pride. His lyrics celebrated India’s strength, self-reliance, and determination to overcome challenges. The post struck a chord online, echoing sentiments of “rewriting history” and building a stronger, self-sufficient India.",
            "pubDate": "2025-07-31T09:59:35.844697"
        },
        {
            "title": "European shares edge higher amid earnings flurry, US tariff blitz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edge-higher-amid-earnings-flurry-us-tariff-blitz/articleshow/123015071.cms",
            "description": "European shares edged higher on Thursday, helped by a slate of upbeat corporate updates, with investors keeping an eye on last minute trade deals after U.S. President Donald Trump issued a blitz of tariff announcements.",
            "pubDate": "2025-07-31T09:59:35.844790"
        },
        {
            "title": "Japan's Nikkei gains as BOJ policy decision lacks surprises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-gains-as-boj-policy-decision-lacks-surprises/articleshow/123015023.cms",
            "description": "Japan's Nikkei share average gained on Thursday as the Bank of Japan kept interest rates steady as was widely expected, while revising up inflation forecasts.",
            "pubDate": "2025-07-31T09:59:35.844931"
        },
        {
            "title": "Trump tariff assault hits over 40 Indian stocks. Full list across key sectors for stock market investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-tariff-assault-hits-over-40-indian-stocks-full-list-across-key-sectors-for-stock-market-investors/articleshow/123014936.cms",
            "description": "Indian markets initially stumbled but recovered following Trump's tariff announcement, with export-heavy sectors like textiles, pharma, and auto facing the brunt. While some companies anticipate minimal impact, others, particularly in textiles and solar, brace for significant challenges. Pharma faces complex tariff equations, while IT anticipates indirect effects. Refiners may need to diversify sourcing, and the metal sector awaits clarity.",
            "pubDate": "2025-07-31T09:59:35.845029"
        },
        {
            "title": "25% Tariff Reality Check: India faces tough US trade policy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/25-tariff-reality-check-india-faces-tough-us-trade-policy/slideshow/123014777.cms",
            "description": "Donald Trump has imposed a 25% tariff on Indian goods, along with additional penalties. Swaminathan Aiyar, in an interview with ET Now, said that calling this decision “final” would be a mistake as Trump’s stance tends to fluctuate frequently. According to Aiyar, the notion of any special chemistry between Modi and Trump has proven to be overly optimistic. This move signals a tougher-than-expected trade environment for India.",
            "pubDate": "2025-07-31T09:59:35.845126"
        },
        {
            "title": "Stocks to Buy | Devang Mehta’s 3 rules for smart long-term investing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-devang-mehtas-3-rules-for-smart-long-term-investing/slideshow/123014325.cms",
            "description": "Devang Mehta, in an interview with ET Now, said that the Indian markets experienced a strong and rapid rally from mid-April to June, supported by positive sentiment. However, over the last three to four weeks, markets have entered a consolidation phase, accompanied by a mild correction. According to Devang, there are no significant positive triggers driving broad-based momentum right now. Instead, select pockets are reacting to earnings and management commentary, which he sees as a sign of resilience in an otherwise quiet market.",
            "pubDate": "2025-07-31T09:59:35.845220"
        },
        {
            "title": "CDSL shares slide 13% in one week as NSDL IPO picks pace",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cdsl-shares-slide-13-in-one-week-as-nsdl-ipo-picks-pace/articleshow/123014040.cms",
            "description": "Shares of Central Depository Services India are down. This is because National Securities Depository Limited launched its IPO. NSDL's IPO has strong institutional demand. Investors are now looking at CDSL's valuation. NSDL is larger and its IPO opened this week. NSDL has a dominant position in institutional custody. CDSL grew during the retail investing surge.",
            "pubDate": "2025-07-31T09:59:35.845320"
        },
        {
            "title": "Friends or Foes? Trump’s Tariffs Test US–India Ties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/friends-or-foes-trumps-tariffs-test-usindia-ties/slideshow/123013924.cms",
            "description": "President Donald Trump has announced a 25% tariff on imports from India, along with an additional penalty due to India’s continued purchases of Russian oil. These measures are part of a broader set of tariffs that will take effect on Friday, marking a significant shift in U.S. trade policy. (Source: AP)",
            "pubDate": "2025-07-31T09:59:35.845421"
        },
        {
            "title": "Dr Reddy’s, Sun Pharma and other pharma stocks fall up to 3% as Trump threatens 25% tariff on India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-sun-pharma-and-other-pharma-stocks-fall-up-to-3-as-trump-threatens-25-tariff-on-india/articleshow/123013385.cms",
            "description": "Indian pharma stocks fell up to 3% after U.S. President Trump announced a 25% tariff on Indian imports over its trade with Russia. Concerns rose about potential inclusion of generic drugs in the tariff list. Analysts expect strategic shifts by exporters and a cautious, range-bound market reaction.",
            "pubDate": "2025-07-31T09:59:35.845516"
        },
        {
            "title": "Nifty Bank rebounds from day’s low as Dalal Street shrugs off Trump’s 25% tariff salvo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-bank-rebounds-from-days-low-as-dalal-street-shrugs-off-trumps-25-tariff-salvo/articleshow/123020046.cms",
            "description": "Indian banking stocks rebounded sharply on Thursday, led by ICICI and Kotak Bank, as markets discounted US tariff concerns. Nifty Bank index swung from a 600-point drop to end in positive territory amid hopes of trade negotiations with the US.",
            "pubDate": "2025-07-31T11:47:37.034301"
        },
        {
            "title": "Stock Radar: Dr. Reddy’s undervalued vs peers; time for value investors to take notice?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-dr-reddys-undervalued-vs-peers-time-for-value-investors-to-take-notice/articleshow/123012890.cms",
            "description": "Dr. Reddy's Laboratories presents a compelling investment opportunity, exhibiting a bullish inverse head and shoulders pattern. Experts suggest a potential target of Rs 1,406 within 4-6 months for medium-term traders. Undervalued compared to peers, the stock demonstrates strong support around Rs 1,200, aligning with key moving averages and indicating positive momentum.",
            "pubDate": "2025-07-31T11:47:37.034427"
        },
        {
            "title": "Dabur Q1 Results: Cons PAT grows 3% YoY to Rs 514 crore, revenue up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dabur-q1-results-cons-pat-grows-3-yoy-to-rs-514-crore-revenue-up-2/articleshow/123019044.cms",
            "description": "FMCG major Dabur India on Thursday reported a 3% year-on-year (YoY) increase in its Q1 consolidated net profit to Rs 514 crore compared to Rs 500 crore in the year-ago period. The profit after tax (PAT) is attributable to the owners of the holding company.",
            "pubDate": "2025-07-31T11:47:37.034631"
        },
        {
            "title": "US stock futures hit record peaks as Meta, Microsoft results get AI boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-futures-hit-record-peaks-as-meta-microsoft-results-get-ai-boost/articleshow/123018772.cms",
            "description": "Futures tied to the S&P 500 and Nasdaq surged to record highs on Thursday after strong earnings from tech giants Meta and Microsoft reinforced investor confidence that artificial intelligence investments are paying off.",
            "pubDate": "2025-07-31T11:47:37.034733"
        },
        {
            "title": "Long-term investing: Volatility, even threats, have limited shelf life; 5 large-caps from different sectors with upside potential of up to 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/long-term-investing-volatility-even-threats-have-limited-shelf-life-5-large-caps-from-different-sectors-with-upside-potential-of-up-to-38/articleshow/123017222.cms",
            "description": "What will dominate headlines for some time? Tariff impacting X industry, goods stuck at ports, exporters under pressure, India-US talking to resolve the deadlock. Yes, the action by President Trump will create issues, but it is not the end of the world. There are a couple of reasons for our assumption that things will not be as bad as they might appear to be when you read the headlines that are bound to come in the coming weeks. You may not be aware, but the history of threats, trade, and diplomacy reveals that, finally, the last one has won.",
            "pubDate": "2025-07-31T11:47:37.034830"
        },
        {
            "title": "Market Wrap: Sensex ends 296 points lower, Nifty below 24,800 after brushing off Trump tariff salvo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-ends-296-points-lower-nifty-below-24800-after-brushing-off-trump-tariff-salvo/articleshow/123018235.cms",
            "description": "Stock Market Highlights: Indian equities ended lower on Thursday but trimmed steeper early losses, as investors interpreted the U.S.’s proposed 25% tariff and unspecified penalties, set to take effect August 1, as a negotiating ploy rather than a definitive policy shift.",
            "pubDate": "2025-07-31T11:47:37.034925"
        },
        {
            "title": "Trump’s 25% Tariffs: How Indian Consumers & Markets Are Getting Hit | Two Sharp with ET",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-25-tariffs-how-indian-consumers-markets-are-getting-hit-two-sharp-with-et/videoshow/123022754.cms",
            "description": "Trump’s 25% tariff on Indian exports kicks in on August 1. From iPhones to jewellery and fuel to pharma, who gets hit? What happens to the markets, rupee, and your monthly budget? Nisha Poddar breaks it down in this episode of Two Sharp with ET.",
            "pubDate": "2025-07-31T14:09:53.417099"
        },
        {
            "title": "Dues from Vi results in Rs 1,570 crore free cash flow for Indus Towers in June quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dues-from-vi-results-in-rs-1570-crore-free-cash-flow-for-indus-towers-in-june-quarter/articleshow/123022597.cms",
            "description": "Indus Towers has recovered most of its backlog from Vodafone Idea, aiding a ₹1,570 crore free cash flow in Q1 FY26. Despite improved receivables, the company is conserving cash due to industry uncertainties, high capex, and strategic growth considerations.",
            "pubDate": "2025-07-31T14:09:53.417231"
        },
        {
            "title": "Breakout Stocks: How to trade Schneider Electric, GE Vernova & Navin Fluorine that hit 52-week high?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-schneider-electric-ge-vernova-amp-navin-fluorine-that-hit-52-week-high/slideshow/123020771.cms",
            "description": "Indian market recouped most of the losses on Thursday to close with some losses. The BSE Sensex fell nearly 300 points while the Nifty50 closed below 24800 levels.",
            "pubDate": "2025-07-31T14:09:53.417347"
        },
        {
            "title": "S&P 500, Nasdaq hit record highs at open as Meta, Microsoft results fan AI frenzy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-hit-record-highs-at-open-as-meta-microsoft-results-fan-ai-frenzy/articleshow/123022552.cms",
            "description": "Fueled by impressive earnings reports from Meta and Microsoft, the S&P 500 and Nasdaq initiated trading at unprecedented peaks on Thursday, indicating that significant investments in artificial intelligence by major technology firms are yielding substantial returns. The Dow Jones Industrial Average also experienced an increase, reflecting the positive market sentiment driven by these tech giants.",
            "pubDate": "2025-07-31T14:09:53.417453"
        },
        {
            "title": "Maruti Suzuki beats estimates in Q1 as exports offset weak domestic demand; Hyundai profit dips 8% despite sales rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-beats-estimates-in-q1-as-exports-offset-weak-domestic-demand-hyundai-profit-dips-8-despite-sales-rise/articleshow/123022435.cms",
            "description": "Maruti Suzuki reported a 1.7% YoY rise in Q1FY26 profit to Rs 3,711.7 crore, driven by strong exports amid weak domestic demand. Hyundai India saw an 8% profit drop, offset by 37.4% export growth. Both automakers faced rising costs and a sluggish local market but benefited from robust overseas sales.",
            "pubDate": "2025-07-31T14:09:53.417604"
        },
        {
            "title": "Swiggy's letter to shareholders: Rapido conflict, QC updates, margins among 5 key takeaways",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggys-letter-to-shareholders-rapido-conflict-qc-updates-margins-among-5-key-takeaways/articleshow/123021779.cms",
            "description": "Swiggy reported a Q1FY26 loss of Rs 1,197 crore despite a 54% YoY revenue rise. The company is reassessing its 12% stake in Rapido over a conflict of interest. Key focus areas include food delivery margins, Instamart expansion, and affordability initiatives like the 99-Store to drive user growth.",
            "pubDate": "2025-07-31T14:09:53.417715"
        },
        {
            "title": "Gainers & Losers: Sagility India, Kaynes Tech among 7 stocks in limelight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-sagility-india-kaynes-tech-among-7-stocks-in-limelight/slideshow/123020507.cms",
            "description": "",
            "pubDate": "2025-07-31T14:09:53.417811"
        },
        {
            "title": "Emami shares rally 8% after Q1 profit climbs 9% despite summer slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emami-shares-rally-8-after-q1-profit-climbs-9-despite-summer-slump/articleshow/123020142.cms",
            "description": "Emami Ltd shares surged over 8% after reporting a 9.3% YoY rise in Q1 net profit to ₹164.26 crore, overcoming weak summer sales and urban demand. The company posted strong margins and steady growth in core categories and overseas markets.",
            "pubDate": "2025-07-31T14:09:53.417915"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/123024569.cms",
            "description": "Indian markets closed mildly lower on Thursday after early steep losses triggered by U.S. tariff threats. Investors viewed the proposed 25% duty as a negotiation tactic. FMCG stocks outperformed, while oil & gas shares dragged indices down amid caution.",
            "pubDate": "2025-07-31T15:53:02.238245"
        },
        {
            "title": "RIL announces AGM date, sets August 14 as record date for dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-announces-agm-date-sets-august-14-as-dividend-record-date-for-dividend/articleshow/123024331.cms",
            "description": "Reliance Industries will conduct its 48th AGM on August 29, setting August 14 as the record date for FY25's final dividend of Rs 5.50 per share. Q1FY26 saw a 78% YoY surge in consolidated net profit to Rs 26,994 crore, boosted by a one-time gain from Asian Paints stake sale. Revenue from operations increased by 5.3% to Rs 2,48,660 crore.",
            "pubDate": "2025-07-31T15:53:02.238364"
        },
        {
            "title": "Market Trading Guide: City Union Bank, Alkyl Amines are stocks to buy on Friday. Up to 9% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-city-union-bank-alkyl-amines-are-stocks-to-buy-on-friday-up-to-9-upside-seen/slideshow/123024063.cms",
            "description": "India’s headline indices recovered from the day’s low but ended with declines on tariff concerns. The declines were on selling pressure in energy, IT and bank stocks. The index recovered smartly after a gap-down opening, rising above 24,900, however, the Nifty failed to sustain at higher levels.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said that the index continues to trade below the 50 EMA, confirming a bearish trend. “The RSI is in a bearish crossover. Despite several negative setups, a hidden positive divergence has been observed over the past 2–3 days, indicating a potential bullish reversal. This setup may play out well if the Nifty decisively moves above 25,000. On the lower side, support is placed at 24,600. A range-bound movement is expected until the Nifty breaks out of the 24,600–25,000 range,\" De said.Here are 2 stock recommendations for Friday:",
            "pubDate": "2025-07-31T15:53:02.238474"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/123024112.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-07-31T15:53:02.238571"
        },
        {
            "title": "Two Trades for Today: An auto major for a 6.3% gain, a mid-cap healthcare IT solutions stock for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-auto-major-for-a-6-3-gain-a-mid-cap-healthcare-it-solutions-stock-for-almost-7-rise/articleshow/123024722.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-07-31T16:11:33.959954"
        }
    ]
}