{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-05T13:53:51.304063",
    "items": [
        {
            "title": "Q2 results today: Titan, Dr Reddy's among 63 companies to announce earnings on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-titan-dr-reddys-among-63-companies-to-announce-earnings-on-tuesday/articleshow/114962130.cms",
            "description": "The second quarter earnings season is in full swing, with 63 companies, including prominent names like Dr Reddy's, Titan, and Mankind Pharma, set to release their July-September 2024 quarter results today.",
            "pubDate": "2024-11-05T04:00:18.854197"
        },
        {
            "title": "NSE Q2 net rises 57% to Rs 3,137 crore, income up 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nse-q2-net-rises-57-to-rs-3137-crore-income-up-24/articleshow/114961175.cms",
            "description": "NSE's earnings per share rose to ₹12.68 as against ₹8.08 in September 2023, after a 4:1 bonus equity share issuance. For the half-year ended September 30, 2024, NSE's consolidated total income was ₹9,974 crore, with a net profit of ₹5,704 crore.",
            "pubDate": "2024-11-05T04:00:18.854325"
        },
        {
            "title": "Raymond Q2 Results: Profit slumps 63% to Rs 59 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/raymond-q2-results-profit-slumps-63-to-rs-59-crore/articleshow/114952565.cms",
            "description": "Total income rose to Rs 1,100.70 crore during July-September period of this fiscal from Rs 512.35 crore in the corresponding period of the previous year, according to a regulatory filing.",
            "pubDate": "2024-11-05T04:00:18.854427"
        },
        {
            "title": "Bata India Q2 Results: Profit shoots up 53% to Rs 52 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bata-india-q2-results-profit-shoots-up-53-to-rs-52-crore/articleshow/114952383.cms",
            "description": "\"The results for the quarter reflect continued momentum in the transformation journey, driven by strategic investments in product innovation, elevated customer experience, technology integration and brand premiumisation, positioning Bata strongly for future growth,\" it said.",
            "pubDate": "2024-11-05T04:00:18.854524"
        },
        {
            "title": "Mazagon Dock Q2 Results: PAT soars 76% YoY to Rs 585 crore, revenue jumps 51%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mazagon-dock-q2-results-pat-soars-76-yoy-to-rs-585-crore-revenue-jumps-51/articleshow/114972984.cms",
            "description": "Mazagon Dock Q2 Results FY 25: Mazagon Dock Shipbuilders recorded significant financial growth in the second quarter of 2024. The company's profit after tax soared by 75.7% compared to the same period last year. Revenue from operations also witnessed a substantial increase of 50.8%. This impressive performance was driven by a surge in EBITDA, reflecting the company's strong operational efficiency.",
            "pubDate": "2024-11-05T10:34:09.994673"
        },
        {
            "title": "Tata Steel Q2 results preview: Falling realisations, rising costs may lead to Rs 153 crore loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steel-q2-results-preview-falling-realisations-rising-costs-may-lead-to-rs-153-crore-loss/articleshow/114965743.cms",
            "description": "Tata Steel may report a loss for the second quarter of FY25. Analysts predict declining realizations and rising costs will impact both domestic and European operations. While sales volume has increased, lower steel prices are expected to affect revenue. EBITDA may decline due to weaker realizations.",
            "pubDate": "2024-11-05T10:34:09.994787"
        },
        {
            "title": "Titan Q2 Results: Net profit falls 23% YoY to Rs 704 crore on customs duty cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titan-q2-results-net-profit-falls-23-yoy-to-rs-704-crore/articleshow/114979107.cms",
            "description": "Titan Q2 Results: The profit fell short of Street estimates of Rs 900 crore, based on an ET Now poll, while revenue exceeded projections of Rs 12,350 crore. Titan’s core jewellery segment saw a 26% increase in total income to Rs 10,763 crore for the quarter, with an EBIT of Rs 932 crore at an 8.7% margin. Adjusted for customs duty, Q2FY25 EBIT reached Rs 1,222 crore, achieving an 11.4% margin.",
            "pubDate": "2024-11-05T11:58:55.197184"
        },
        {
            "title": "Dr Reddy's Labs Q2 Results: Profit falls 15% YoY to Rs 1,255 crore, revenue up 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-labs-q2-results-profit-falls-15-yoy-to-rs-1255-crore-revenue-up-17/articleshow/114979064.cms",
            "description": "Dr Reddy's Labs Q2 Results: Healthcare major Dr Reddy's on Tuesday reported 15% drop in its consolidated net profit at Rs 1255 crore in the second quarter. It was Rs 1480 crore in the year-ago quarter.",
            "pubDate": "2024-11-05T11:58:55.197305"
        },
        {
            "title": "GAIL Q2 Results: Profit up 10% to Rs 2,690 crore, revenue flat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gail-q2-results-profit-up-10-to-rs-2690-crore-revenue-flat/articleshow/114984182.cms",
            "description": "State-owned GAIL (India) Ltd on Tuesday reported 10 per cent rise in September quarter net profit after an increase in earnings from gas transmission business and turnaround in petrochemical business neutralised fall in marketing margin.",
            "pubDate": "2024-11-05T13:53:49.079326"
        },
        {
            "title": "Berger Paints Q2 Results: Profit declines 7.6%  to Rs 270 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/berger-paints-q2-results-profit-declines-7-6-to-rs-270-crore/articleshow/114983741.cms",
            "description": "Coatings major Berger Paints India on Tuesday reported a 7.6 per cent decline in consolidated net profit to Rs 270 crore for the second quarter of the 2024-25 fiscal. The company posted a net profit of Rs 292 crore in the same quarter of the last financial year.",
            "pubDate": "2024-11-05T13:53:49.079452"
        },
        {
            "title": "Ferrari Q2 Results: Core profit rises 7%, helped by product mix, personal touches",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ferrari-q2-results-core-profit-rises-7-helped-by-product-mix-personal-touches/articleshow/114982843.cms",
            "description": "Ferrari said on Tuesday its core earnings rose 7% in the third quarter, despite a slight decrease in car shipments, as the luxury sports car maker continued to benefit from a richer product offer and increased demand for personalisation.",
            "pubDate": "2024-11-05T13:53:49.079553"
        },
        {
            "title": "Aptus Value Housing Finance Q2 Results: Profit rises 22% to Rs 182 crore; dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/aptus-value-housing-finance-q2-results-profit-rises-22-to-rs-182-crore-dividend-declared/articleshow/114981959.cms",
            "description": "Aptus Value Housing Finance India Ltd on Tuesday reported a 22% year-on-year rise in net profit at Rs 182 crore in the second quarter of the fiscal as against Rs 148 crore in the year ago period, even as the lender saw a marginal deterioration of asset quality.",
            "pubDate": "2024-11-05T13:53:49.079649"
        }
    ]
}