{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-31T01:47:56.096000",
    "items": [
        {
            "title": "Jio Financial to raise Rs 15,825 crore via preferential issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-to-raise-rs-15825-crore-via-preferential-issue/articleshow/123008592.cms",
            "description": "Jio Financial Services will raise ₹15,825 crore by issuing convertible warrants. Sikka Ports and Jamnagar Utilities will be issued these warrants. The capital will be used for investments in insurance and lending ventures. Jio has tied up with BlackRock for mutual funds. Jio Financial's board approved the issuance of warrants at Rs 316.50 apiece.",
            "pubDate": "2025-07-31T01:47:38.130983"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123008468.cms",
            "description": "Nifty closed slightly higher, influenced by L&T and Sun Pharma, but faces potential volatility due to Trump's tariff announcement. Analysts advise caution and hedging strategies as earnings season progresses. The rupee weakened amid India-US trade uncertainty, while FIIs remained net sellers.",
            "pubDate": "2025-07-31T01:47:38.131106"
        },
        {
            "title": "Stocks in news: HUL, Swiggy, Tata Steel, Tata Motors, M&M",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hul-swiggy-tata-steel-tata-motors-mm/articleshow/123008398.cms",
            "description": "Indian markets experienced marginal gains on Wednesday, influenced by mixed signals. Several companies are in the spotlight due to Q1 results, including HUL, Swiggy, Sun Pharma, and Maruti Suzuki. Tata Steel and M&M reported significant profit growth, while IndiGo's net profit declined.",
            "pubDate": "2025-07-31T01:47:38.131214"
        },
        {
            "title": "US futures rise on tech earnings, dollar steadies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-futures-rise-on-tech-earnings-dollar-steadies/articleshow/123008291.cms",
            "description": "US equity futures climbed following strong earnings from tech giants like Microsoft and Meta, despite a volatile Wall Street session. The dollar stabilized after the Federal Reserve held interest rates steady. Asian markets showed mixed performance, with South Korean equities fluctuating after a US trade deal. Investors are now focused on the Bank of Japan's rate decision.",
            "pubDate": "2025-07-31T01:47:38.131316"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/123008216.cms",
            "description": "For all those who are surprised by what President Trump has said and done, remember his track record. Just a few days into his second term as US president, he was talking of sacking US Fed chairman Jerome Powell; he backtracked in just two days. So, he can say anything and then pull back. This does not mean that, in the short term, there will be no trouble for some businesses. They will face headwinds; and the probability is that there will be a hit in the coming quarters. But if one looks at India’s macro structure, we are still a domestic-oriented economy.",
            "pubDate": "2025-07-31T01:47:38.131414"
        },
        {
            "title": "Sumant Kathpalia offers Rs 5.2 crore to settle insider trading case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sumant-kathpalia-offers-rs-5-2-crore-to-settle-insider-trading-case/articleshow/123008202.cms",
            "description": "Former IndusInd Bank CEO Sumant Kathpalia has proposed a ₹5.21 crore settlement to SEBI regarding insider trading allegations. SEBI had barred Kathpalia and other executives for trading on unpublished price-sensitive information related to accounting discrepancies. Kathpalia's settlement application includes a pledge of confidentiality, while SEBI impounded ₹19.8 crore from the involved individuals.",
            "pubDate": "2025-07-31T01:47:38.131540"
        },
        {
            "title": "Why are Indian households struggling with medical costs despite health initiatives?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-are-indian-households-struggling-with-medical-costs-despite-health-initiatives/articleshow/123008120.cms",
            "description": "India's out-of-pocket health expenses are among the highest in major economies. Though it decreased from 2014 to 2024, it remains significant. China saw a smaller decrease in the same period. Emerging Asia's health protection gap has widened. Rising medical costs and coverage gaps are key issues. Many Indian families struggle to afford healthcare.",
            "pubDate": "2025-07-31T01:47:38.131636"
        },
        {
            "title": "Anant Ambani's appointment to RIL board gets shareholder nod",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anant-ambanis-appointment-to-ril-board-gets-shareholder-nod/articleshow/123008015.cms",
            "description": "Anant Ambani is now the executive director at Reliance Industries. Reliance Industries shareholders gave their approval. The RIL board appointed Mukesh Ambani's youngest son on April 25. Anant will serve for five years, starting May 1. He has been on the boards of Jio Platforms and Reliance Foundation. He also serves on Reliance New Energy and Reliance New Solar Energy.",
            "pubDate": "2025-07-31T01:47:38.131729"
        },
        {
            "title": "Will Tata Motors' ambitious Iveco acquisition strain its financial stability?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-tata-motors-ambitious-iveco-acquisition-strain-its-financial-stability/articleshow/123007962.cms",
            "description": "Tata Motors' stock experienced a decline following reports of a possible acquisition of Iveco. The deal, valued at ₹3.9 billion, may require external funding for the Indian automaker. Analysts anticipate pressure on Tata Motors' balance sheet due to rising global tariff uncertainties. Iveco's revenue declined in FY24, but expects stable growth in 2025.",
            "pubDate": "2025-07-31T01:47:38.131822"
        },
        {
            "title": "Vedanta Resources seeks investor nod to prepay $550-million debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-resources-seeks-investor-nod-to-prepay-550-million-debt/articleshow/123007844.cms",
            "description": "Vedanta Resources aims to prepay a $550 million private credit facility by raising $700 million from banks like Barclays and Standard Chartered, seeking investor consent for early repayment. This refinancing targets a lower interest rate, around SOFR + 400-500 basis points, significantly reducing borrowing costs.",
            "pubDate": "2025-07-31T01:47:38.131915"
        },
        {
            "title": "Spandana's top ten investors to buy into Rs 400-crore rights issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spandanas-top-ten-investors-to-buy-into-rs-400-crore-rights-issue/articleshow/123007786.cms",
            "description": "Spandana Sphoorty Financial's ₹400-crore rights issue, opening August 1, has secured participation from its top 10 institutional investors, including Kedaara Capital, which holds 48.13%. Despite a net loss in FY25, the company aims to restore stakeholder confidence through this issue. Kedaara Capital may extend its investment beyond its scheduled exit in September 2026.",
            "pubDate": "2025-07-31T01:47:38.132007"
        },
        {
            "title": "Hot Stocks: 3 stocks that may give returns between 22-36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-3-stocks-that-may-give-returns-between-22-36/articleshow/123007717.cms",
            "description": "Analysts predict significant returns for NTPC, Ather Energy, and Varun Beverages. CLSA projects a 35.4% upside for NTPC, citing continued re-rating. NUVAMA initiates coverage on Ather Energy with a buy rating, anticipating strong growth in the EV sector. HSBC reiterates a buy rating for Varun Beverages, forecasting a 22.6% upside due to attractive valuations and growth potential.",
            "pubDate": "2025-07-31T01:47:38.132096"
        },
        {
            "title": "How will Trump's tariff announcement impact Indian stock market?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-trumps-tariff-announcement-impact-indian-stock-market/articleshow/123007612.cms",
            "description": "Indian equities are expected to decline following Trump's tariff announcement, as indicated by a drop in GIFT Nifty futures. Nilesh Shah of Kotak Mahindra AMC anticipates a negative market reaction, despite expectations of a trade deal due to aligned US-India strategic interests. Export-oriented sectors are likely to face the most significant impact.",
            "pubDate": "2025-07-31T01:47:38.132184"
        },
        {
            "title": "Why did Fed keep interest rates unchanged despite Trump's pressure?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-did-fed-keep-interest-rates-unchanged-despite-trumps-pressure/articleshow/123007547.cms",
            "description": "The Federal Reserve maintained its key short-term interest rate, defying President Trump's persistent calls for a reduction. The rate remains at 4.3%, a level established after three cuts last year, with officials citing the need to assess the impact of Trump's tariffs on inflation and the economy.",
            "pubDate": "2025-07-31T01:47:38.132271"
        },
        {
            "title": "Stock Radar: Down over 20% from highs! Varun Beverages stock showing signs of trend reversal – time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-down-over-20-from-highs-varun-beverages-stock-showing-signs-of-trend-reversal-time-to-buy/articleshow/122995601.cms",
            "description": "Varun Beverages stock showed a 'W' pattern breakout, reclaiming moving averages. The stock fell 24% after a high in July 2024. It found support around 400 in March 2025. Experts suggest buying for a target of Rs 870 in 1-2 months. SMC Global Securities recommends accumulating between Rs 500-510, targeting Rs 574-576 with a stop loss below Rs 450.",
            "pubDate": "2025-07-31T01:47:38.132362"
        },
        {
            "title": "Tata Motors' Iveco takeover to fuel global CV ambitions but not without risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-iveco-takeover-to-fuel-global-cv-ambitions-but-not-without-risks/articleshow/123007773.cms",
            "description": "Tata Motors offer is aimed at acquiring 100% of Iveco's common shares with a subsequent delisting of Iveco Group from the Euronext Milan stock exchange. The all-cash offer valued Iveco at about Rs 3.8 billion ($4.4 billion). Both companies believe that having Iveco operate as a wholly-owned unit of the Mumbai-based automaker is crucial for its sustainable success and long-term value creation. Iveco has a diversified business with 74% of revenues from Europe and the rest from South America, Africa, and Oceania.",
            "pubDate": "2025-07-31T01:47:38.132451"
        }
    ]
}