{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-24T00:40:50.379915",
    "items": [
        {
            "title": "Sebi bans First Overseas Capital for two years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bans-first-overseas-capital-for-two-years/articleshow/124774160.cms",
            "description": "Sebi has banned First Overseas Capital from the securities market and new IPO mandates for two years, imposing a ₹20 lakh fine. The regulator found the merchant banker violated norms by not maintaining adequate net worth, exceeding underwriting limits, and engaging in non-securities business. These actions followed an inspection revealing multiple regulatory breaches.",
            "pubDate": "2025-10-24T00:40:43.910267"
        },
        {
            "title": "Stocks in news: ITC Hotels, Dr Reddy's, SBI Life, Hero MotoCorp, Vedanta",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-itc-hotels-dr-reddys-sbi-life-hero-motocorp-vedanta/articleshow/124768458.cms",
            "description": "Markets traded volatile on Thursday, ending nearly unchanged after early gains were erased by profit-taking in heavyweight stocks. Analysts suggest a short-term consolidation phase is likely, with Nifty holding above 25,600 considered healthy. Several companies, including Vedanta, Hero MotoCorp, and Colgate-Palmolive, are in focus due to investment plans, international expansion, and Q2 results.",
            "pubDate": "2025-10-24T00:40:43.910395"
        },
        {
            "title": "Trade pact possibilities boost Indian export stocks amid market rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trade-pact-possibilities-boost-indian-export-stocks-amid-market-rally/articleshow/124774129.cms",
            "description": "Indian exporters, particularly in IT and textiles, saw a significant surge on Thursday following reports of an impending India-US trade pact. This potential deal could drastically lower US tariffs on Indian goods, boosting export prospects.",
            "pubDate": "2025-10-24T00:40:43.910613"
        },
        {
            "title": "Indices rise for sixth consecutive day amid US trade deal optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indices-rise-for-sixth-consecutive-day-amid-us-trade-deal-optimism/articleshow/124774053.cms",
            "description": "Indian stock markets closed higher for the sixth consecutive day. Gains were fueled by positive reports on trade negotiations between India and the US. Information Technology stocks saw a significant rise. While Reliance Industries shares declined, the overall market sentiment remained optimistic. Investors are awaiting concrete outcomes from the trade deal discussions.",
            "pubDate": "2025-10-24T00:40:43.910735"
        },
        {
            "title": "Stock Radar: SBI hits fresh record highs in October 2025; will the rally continue in November?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-sbi-hits-fresh-record-highs-in-october-2025-will-the-rally-continue-in-november/articleshow/124759086.cms",
            "description": "State Bank of India has broken out of a consolidation range, hitting fresh highs and suggesting further rally potential. Experts recommend buying on dips towards Rs 900 for targets above Rs 1,000 in the next 1-2 months, citing bullish technical indicators and outperformance in the PSU banking sector.",
            "pubDate": "2025-10-24T00:40:43.910837"
        },
        {
            "title": "RBI proposes to mandate UTI for all OTC derivative transactions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-proposes-to-mandate-uti-for-all-otc-derivative-transactions/articleshow/124774143.cms",
            "description": "The Reserve Bank of India is shaking up the financial landscape with a groundbreaking rule coming into effect next fiscal year. Beginning then, all over-the-counter derivative trades related to rupee interest rates and foreign exchange currencies will need a Unique Transaction Identifier. This identifier is designed to offer regulators better insights into transaction trends and market health.",
            "pubDate": "2025-10-24T00:40:43.911801"
        }
    ]
}