{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-15T18:53:39.456133",
    "items": [
        {
            "title": "Invest for the long term: 5 stocks with strong and proven track record of management on delivery, and upside potential of more than 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/invest-for-the-long-term-5-stocks-with-strong-and-proven-track-record-of-management-on-delivery-and-upside-potential-of-more-than-28/articleshow/118277854.cms",
            "description": "Even at the start of 2025, did anyone predict the massive selling we have seen so far? We can’t recall any such prediction. But today, there are dozens of reasons being proffered on why it was inevitable. Should the current steep fall deter you from buying stocks at this point? The answer is no. And also yes. No, if you are buying the right businesses run by the right management. Yes, if you are again falling into the trap of narratives. Now, what is right management ? Look for stocks with the comfort of “management with ability” and track record of dealing with economic slowdowns.",
            "pubDate": "2025-02-15T18:53:18.348313"
        },
        {
            "title": "Concord Biotech, Natco Pharma among 10 smallcap stocks that crashed up to 41% this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concord-biotech-natco-pharma-among-10-smallcap-stocks-that-crashed-up-to-41-this-week/slideshow/118276019.cms",
            "description": "In the five trading sessions leading up to February 14, the BSE Sensex index posted a weekly decline of 2.47%, with losses recorded across all five sessions. Amid this broader market downturn, several smallcap stocks experienced sustained declines. Here’s a look at the top 10 worst-performing stocks from the BSE Smallcap index during the week.",
            "pubDate": "2025-02-15T18:53:18.348431"
        },
        {
            "title": "FPIs net sell domestic equities worth Rs 21,272 crore so far in February",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-net-sell-domestic-equities-worth-rs-21272-crore-so-far-in-february/articleshow/118275576.cms",
            "description": "Foreign Portfolio Investors (FPIs) have been net sellers of Indian equities, offloading Rs 21,272 crore in February and Rs 99,299 crore in 2025. Despite positive developments in the Indian market, factors such as high US bond yields and slow corporate sales growth in India have driven this trend.",
            "pubDate": "2025-02-15T18:53:18.348561"
        },
        {
            "title": "New Income Tax Bill Tabled in Parliament: Top 10 Takeaways",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-income-tax-bill-tabled-in-parliament-top-10-takeaways/videoshow/118273039.cms",
            "description": "New Income Tax Bill Tabled in Parliament. Here are the 10 key takeaways.",
            "pubDate": "2025-02-15T18:53:18.348662"
        },
        {
            "title": "Dalal Street Week Ahead: Use any technical rebound as an opportunity to protect profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-week-ahead-use-any-technical-rebound-as-an-opportunity-to-protect-profits/articleshow/118272419.cms",
            "description": "Indian equity markets experienced sustained weakness over the past week, with Nifty50 struggling at key levels and declining by 2.68%. Market volatility surged, and critical support levels are crucial for determining short-term trajectory. Approaching sessions require cautious engagement and emphasis on risk management.",
            "pubDate": "2025-02-15T18:53:18.348762"
        },
        {
            "title": "Worst sectoral loser realty sees stocks plunge up to 14% this week. Oberoi Realty hit most",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/worst-sectoral-loser-realty-sees-stocks-plunge-up-to-14-this-week-oberoi-realty-hit-most/articleshow/118270944.cms",
            "description": "Indian real estate stocks experienced notable selling pressure this week, with the BSE Realty benchmark index dropping by 9.4%, significantly underperforming the broader market. Despite a recent RBI rate cut aimed at boosting economic growth, global trade tensions, foreign investor outflows, and weak corporate earnings weighed on market sentiment.",
            "pubDate": "2025-02-15T18:53:18.348858"
        },
        {
            "title": "5 strategies that can help investors in this falling market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-strategies-that-can-help-investors-in-this-falling-market/articleshow/118269775.cms",
            "description": "The Indian equity market has seen a significant downturn since its peak in September 2024 due to FII outflows, rising US yields, and a strengthening dollar. Coupled with India’s slowing economic growth, investor sentiment has weakened, prompting strategies for diversification and cautious investment re-entry.",
            "pubDate": "2025-02-15T18:53:18.348955"
        },
        {
            "title": "Smallcap rout: Over 900 stocks fall up to 41% this week. Natco, Senco among top laggards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-rout-over-900-stocks-fall-up-to-41-this-week-natco-senco-among-top-laggards/articleshow/118269236.cms",
            "description": "Out of the 938 stocks in the BSE Smallcap index analysed by ETMarkets, 909 stocks ended the week in the red with the highest fall of 41% witnessed  in NGL Fine-Chem.",
            "pubDate": "2025-02-15T18:53:18.349050"
        },
        {
            "title": "Which stocks are losing favor? 10 AMCs trim holdings in over 20 cos in January 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/which-stocks-are-losing-favor-10-amcs-trim-holdings-in-over-20-cos-in-january-2025/slideshow/118266691.cms",
            "description": "SBI Mutual Fund, ICICI Prudential, and eight other prominent asset management companies (AMCs) reduced their holdings in over 20 companies during January 2025.ET Bureau provided a snapshot of the key stocks where leading AMCs trimmed their positions, highlighting notable stake reductions that influenced market dynamics and sectoral trends.",
            "pubDate": "2025-02-15T18:53:18.349145"
        },
        {
            "title": "Concurrent Losers: These 13 stocks that slipped for 5 trading days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-losers-these-13-stocks-that-slipped-for-5-trading-days-in-a-row/slideshow/118266319.cms",
            "description": "In the five trading sessions leading up to February 14, the Sensex benchmark index saw a 2.5% drop, closing at 77,939. This downward trend was evident across all five sessions. During this period, ETMarkets identified 13 stocks within the BSE100 index that consistently experienced price declines throughout the entire span of the last five trading days. (Data Source: ACE Equity)",
            "pubDate": "2025-02-15T18:53:18.349239"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/118265735.cms",
            "description": "Traders focus on the uncertain outcomes of Middle East tensions and the Ukraine-Russia conflict, along with the impact of Trump's policies on gold prices. Walmart's upcoming earnings report and rate decisions from Asia-Pacific central banks also shape market sentiment, amid rising U.S. inflation concerns.",
            "pubDate": "2025-02-15T18:53:18.349329"
        },
        {
            "title": "Wall Street Week Ahead: Walmart to shed light on consumer health as inflation bites, tariffs swirl",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-walmart-to-shed-light-on-consumer-health-as-inflation-bites-tariffs-swirl/articleshow/118265638.cms",
            "description": "Investors eagerly await Walmart's quarterly report for insights into U.S. consumer health amidst rising inflation and potential tariff impacts. The S&P 500 showed resilience despite inflation concerns. Walmart’s comments will be closely watched, as they could indicate how higher costs are affecting discretionary spending. Results from other consumer companies will also provide crucial economic insights in the coming weeks.",
            "pubDate": "2025-02-15T18:53:18.349422"
        },
        {
            "title": "Fearless Wall Street traders refuse to panic as Tariff war rages",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fearless-wall-street-traders-refuse-to-panic-as-tariff-war-rages/articleshow/118265556.cms",
            "description": "Wall Street faced drama with headlines on tariffs, inflation, and the Federal Reserve, yet markets remained resilient. Despite initial swings, stocks closed near all-time highs, and Treasury yields rallied. Investors are adapting to avoid past mistakes, focusing on Trump's tariff decisions and economic data. This dynamic reflects strong buying power and cautious optimism in the market.",
            "pubDate": "2025-02-15T18:53:18.349515"
        },
        {
            "title": "Wall Street ends mixed; Nvidia lifts Nasdaq",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-mixed-nvidia-lifts-nasdaq/articleshow/118264950.cms",
            "description": "Yields across government bonds slipped for a second straight day after data showed U.S. retail sales fell more than expected in January, dropping 0.9% last month after an upwardly revised 0.7% increase in December.",
            "pubDate": "2025-02-15T18:53:18.349627"
        },
        {
            "title": "RBI fines Shriram Fin, Nainital Bank and Ujjivan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-imposes-penalties-on-shriram-finance-nainital-bank-ujjivan-small-finance-bank-for-regulatory-lapses/articleshow/118264654.cms",
            "description": "The Reserve Bank of India fined Shriram Finance, Nainital Bank, and Ujjivan Small Finance Bank for not adhering to regulatory guidelines. Nainital Bank was fined Rs 61.40 lakh for issues with interest rates and customer service, Ujjivan received a Rs 6.70 lakh fine for not issuing loan agreements, and Shriram Finance was penalized Rs 5.",
            "pubDate": "2025-02-15T18:53:18.349720"
        },
        {
            "title": "Sebi to tighten standards for listed companies: Buch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-tighten-standards-for-listed-companies-buch/articleshow/118264561.cms",
            "description": "The Sebi chief said she would be happy to throw the entire Listing Obligations and Disclosure Requirements (LODR) Regulations into the bin, barring RPT.",
            "pubDate": "2025-02-15T18:53:18.349812"
        }
    ]
}