{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-30T13:23:13.816195",
    "items": [
        {
            "title": "Microsoft beats expectations with 18% revenue jump, but shares slide",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/microsoft-beats-expectations-with-18-revenue-jump-but-shares-slide/articleshow/124929080.cms",
            "description": "Microsoft announced impressive quarterly earnings, with revenue surging due to high demand for artificial intelligence services.  This boosted its cloud computing business significantly.  However, the company's stock saw a decline as investors worried about how quickly AI will generate profits.  An Azure cloud service outage also impacted operations.  Microsoft continues to invest heavily in AI, including its partnership with OpenAI.",
            "pubDate": "2025-10-30T02:53:58.998481"
        },
        {
            "title": "Alphabet beats quarterly revenue estimates on strong ad, cloud demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/alphabet-beats-quarterly-revenue-estimates-on-strong-ad-cloud-demand/articleshow/124928864.cms",
            "description": "Google-parent Alphabet surpassed revenue expectations for the third quarter. Its advertising and cloud computing divisions showed strong performance. Google Cloud's growth was fueled by enterprise demand for AI infrastructure. The company's advertising business also saw steady gains. This comes as competition in the AI and cloud market intensifies.",
            "pubDate": "2025-10-30T02:53:58.998605"
        },
        {
            "title": "Meta's profit hit by $16 billion one-time tax charge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/metas-profit-hit-by-16-billion-one-time-tax-charge/articleshow/124928777.cms",
            "description": "Meta faced a substantial charge impacting its stock. The company is heavily investing in AI infrastructure, planning massive data centers. This aggressive spending, shared by major tech firms, raises concerns about an AI bubble. Meta is also streamlining its AI unit with job cuts. These moves signal a focus on long-term AI development despite current cost pressures.",
            "pubDate": "2025-10-30T02:53:58.998712"
        },
        {
            "title": "Hyundai India to announce Q2 results today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hyundai-india-to-announce-q2-results-today-heres-what-to-expect/articleshow/124940219.cms",
            "description": "Hyundai Motor India is expected to report a modest Q2 FY26 performance, with profit rising around 10% YoY and revenue remaining largely flat. Brokerages project margin expansion driven by higher SUV sales, cost control, and export growth, even as domestic demand stays soft. The Creta and Venue are expected to anchor profitability amid rising competition.",
            "pubDate": "2025-10-30T07:33:33.979335"
        },
        {
            "title": "Q2 Scorecard: Finance Capital, Finance Satin, Finance Dhanlaxmi post September quarter results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-scorecard-finance-capital-finance-satin-finance-dhanlaxmi-post-september-quarter-results/articleshow/124934909.cms",
            "description": "Capital Small Finance Bank saw a 5% net profit rise to Rs 35 crore, despite higher provisions and a slight asset quality dip. Satin CreditCare, an NBFC-MFI, reported a robust 19% net profit increase to Rs 45 crore, with improved margins. Dhanlaxmi Bank turned profitable with Rs 12.18 crore net profit, driven by a significant net interest income jump.",
            "pubDate": "2025-10-30T07:33:33.979467"
        },
        {
            "title": "Maruti Suzuki Q2 results preview: Profit seen rising 18% YoY on higher exports, stable margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q2-results-preview-profit-seen-rising-18-yoy-on-higher-exports-stable-margins/articleshow/124934644.cms",
            "description": "Maruti Suzuki is poised for a steady second-quarter performance, with revenue projected to rise around 8% and profit up 18% year-on-year. While strong exports and better pricing are expected to boost topline, higher input costs and new plant expenses may temper margin gains.",
            "pubDate": "2025-10-30T07:33:33.979577"
        },
        {
            "title": "Hyundai Motor India Q2 Results: Cons profit jumps 14% YoY to Rs 1,572 crore; revenue up 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hyundai-motor-q2-results-cons-profit-jumps-14-yoy-revenue-up-1/articleshow/124944449.cms",
            "description": "Hyundai Motor Q2 Results: Hyundai Motor India reported a 14.3% year-on-year rise in consolidated net profit to Rs 1,572 crore for the September 2025 quarter. Revenue from operations saw a 1.2% increase to Rs 17,461 crore, driven by festive demand and strong SUV sales. The company's EBITDA margin improved to 13.9% due to a favorable product mix and cost optimization.",
            "pubDate": "2025-10-30T10:35:06.132182"
        },
        {
            "title": "Canara Bank Q2 results: Standalone net profit grows 19% YoY, NII slides 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/canara-bank-q2-results-standalone-net-profit-grows-19-yoy-nii-slides-2/articleshow/124943188.cms",
            "description": "Canara Bank reported an 18.7% year-on-year rise in standalone net profit to Rs 4,773.96 crore for Q2FY26, supported by strong growth in operating profit and improved asset quality. Global business expanded 13.55% YoY, while gross NPAs fell to 2.35% and ROA improved to 1.12%, reflecting robust operational efficiency.",
            "pubDate": "2025-10-30T10:35:06.132306"
        },
        {
            "title": "Adani Power Q2 Results: Cons net profit falls 11% YoY to Rs 2,953 crore, revenue rises marginally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-power-q2-results-cons-net-profit-falls-11-yoy-to-rs-2953-crore-revenue-inches-up-0-9/articleshow/124942276.cms",
            "description": "Adani Power Q2 Results: Adani Power's Q2 net profit dipped 11% YoY to Rs 2,953 crore, despite a slight revenue increase. The company cited lower pre-tax profit and higher taxes for the decline. However, robust operating performance was driven by higher volumes, though tempered by lower tariffs. Adani Power is expanding capacity, aiming for 42 GW by 2031-32.",
            "pubDate": "2025-10-30T10:35:06.132420"
        },
        {
            "title": "Cipla Q2 Results: Net profit grows 4% YoY to Rs 1,351 crore; revenue rises 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cipla-q2-results-pat-grows-4-yoy-to-rs-1351-crore-revenue-rises-8/articleshow/124940539.cms",
            "description": "Cipla Q2 Results: Cipla reported a 4% YoY growth in net profit to Rs 1,351 crore and an 8% rise in revenue to Rs 7,589 crore. The company saw strong performance in its India and North America businesses, with key products like Foracort and Albuterol leading.",
            "pubDate": "2025-10-30T10:35:06.132521"
        },
        {
            "title": "Mastercard beats profit estimates as transaction volumes hold strong",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mastercard-beats-profit-estimates-as-transaction-volumes-hold-strong/articleshow/124953566.cms",
            "description": "Mastercard beat Wall Street expectations for third-quarter profit on Thursday, as sustained consumer spending boosted its payment volumes.",
            "pubDate": "2025-10-30T13:23:10.231925"
        },
        {
            "title": "Welspun Corp Q2 Results: Net profit grows to Rs 443 crore; order book touches Rs 23,500 crore level",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/welspun-corp-q2-results-net-profit-grows-to-rs-443-crore-order-book-touches-rs-23500-crore-level/articleshow/124952357.cms",
            "description": "Welspun Corp on Thursday posted a 57 per cent rise in consolidated net profit to Rs 443.51 crore in the September quarter, driven by a rise in revenues from the core steel products business.",
            "pubDate": "2025-10-30T13:23:10.232059"
        },
        {
            "title": "Union Bank Q2 Results: Profit falls 10% over dip in core income, recoveries from written-off loans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/union-bank-posts-10-pc-fall-in-q2-profit-over-dip-in-core-income-recoveries-from-written-off-loans/articleshow/124950527.cms",
            "description": "State-run Union Bank of India on Thursday reported a 10 per cent decline in September quarter profit at Rs 4,249 crore, driven by a decline in core income and also recoveries from written-off accounts.",
            "pubDate": "2025-10-30T13:23:10.232175"
        },
        {
            "title": "ITC Q2 Results: Net profit rises 4% YoY to Rs 5,187 crore, revenue declines 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-q2-results-net-profit-rises-3-yoy-to-rs-5126-crore-revenue-declines-1/articleshow/124949295.cms",
            "description": "ITC Q2 Results: Diversified conglomerate ITC Ltd reported 3% year-on-year (YoY) growth in its net profit at Rs 5126 crore in the second quarter. Revenues declined 1% YoY to Rs 21,256 crore.",
            "pubDate": "2025-10-30T13:23:10.232280"
        },
        {
            "title": "Swiggy Q2 Results: Cons loss widens to Rs 1,092 crore YoY, but revenue jumps 54%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swiggy-q2-results-cons-loss-widens-yoy-to-rs-1092-crore-but-revenue-jumps-54/articleshow/124948135.cms",
            "description": "Swiggy Q2 Results: Food delivery giant Swiggy reported a consolidated net loss of Rs 1,092 crore for the September quarter, an increase from the previous year's Rs 626 crore loss. Despite the wider loss, the company saw a significant 54% year-on-year revenue growth, reaching Rs 5,561 crore in the same period.",
            "pubDate": "2025-10-30T13:23:10.232385"
        }
    ]
}