{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-21T01:20:19.505831",
    "items": [
        {
            "title": "Asian stocks follow Wall Street losses, bonds rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-follow-wall-street-losses-bonds-rise/articleshow/125474907.cms",
            "description": "Asian stocks fell mirroring Wall Street's sharp reversal, as a brief Nvidia-led rally faded amid concerns over stretched valuations and AI investment profitability. Lingering uncertainty about the Federal Reserve's interest rate path also contributed to investor caution, prompting a pullback from riskier assets.",
            "pubDate": "2025-11-21T01:20:05.073385"
        },
        {
            "title": "Stocks in news: TCS, Groww, RIL, PVR Inox, JSW Energy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-groww-ril-pvr-inox-jsw-energy/articleshow/125468190.cms",
            "description": "Markets resumed their upward trend, gaining nearly half a percent as rotational buying supported major heavyweights. Analysts anticipate the Nifty to soon attempt a fresh record high and move towards 26,500. Several companies like TCS, Groww, RIL, PVR Inox, and JSW Energy are in focus due to significant news developments.",
            "pubDate": "2025-11-21T01:20:05.073511"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125468271.cms",
            "description": "Indian equities are nearing a record high, with Nifty just 85 points below its September 2024 peak. Analysts anticipate continued upward momentum driven by domestic factors, global data, FII inflows, and a potential India-US trade agreement. The market shows strengthening momentum, with a bullish MACD crossover suggesting a move towards 26,400-26,500.",
            "pubDate": "2025-11-21T01:20:05.073620"
        },
        {
            "title": "TCS joins AI, data centre rush with $2 billion TPG alliance, draws gigawatt-scale plans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-joins-ai-data-centre-rush-with-2-billion-tpg-alliance-draws-gigawatt-scale-plans/articleshow/125474838.cms",
            "description": "HyperVault a 51:49 JV, will raise $4-4.5 b debt as well. Company plans to offer services to hyperscalers, Indian enterprises and government entities, along with Tata companies. 1st time Tata Group flagship is tying up with a PE fund as well as raise debt",
            "pubDate": "2025-11-21T01:20:05.073718"
        },
        {
            "title": "NHAI appoints manager for Raajmarg InvIT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nhai-appoints-manager-for-raajmarg-invit/articleshow/125474720.cms",
            "description": "The National Highways Authority of India has appointed Raajmarg Infra Investment Managers as the investment manager for the upcoming Raajmarg Infra Investment Trust.  Retail and public investors can expect the first unit issuance in February 2026.  Over the next three to five years, approximately 1,500 kilometers of operational national highways will be introduced into the trust, creating significant investment opportunities.",
            "pubDate": "2025-11-21T01:20:05.073814"
        },
        {
            "title": "High-risk investors can bet on Nifty IT index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-risk-investors-can-bet-on-nifty-it-index/articleshow/125474684.cms",
            "description": "Investors seeking high-risk opportunities can consider the Nifty IT index fund. The sector has faced headwinds, leading to underperformance and attractive valuations. Fund managers see this as a good entry point. Indian IT companies are navigating AI's impact, presenting both challenges and opportunities. Global corporations will continue to depend on IT service partners for AI initiatives.",
            "pubDate": "2025-11-21T01:20:05.073911"
        },
        {
            "title": "Nvidia's upbeat forecast soothes fears of AI stock market bubble",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nvidias-upbeat-forecast-soothes-fears-of-ai-stock-market-bubble/articleshow/125474613.cms",
            "description": "Nvidia projected strong revenue exceeding analyst expectations, countering AI bubble concerns. The company anticipates a significant revenue surge in upcoming quarters, signaling sustained demand for its AI chips. This positive outlook boosted Nvidia's stock and related tech companies, indicating robust momentum in the AI industry.",
            "pubDate": "2025-11-21T01:20:05.074025"
        },
        {
            "title": "IndusInd Bank mulls QIP route to raise ‘confidence capital’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-mulls-qip-route-to-raise-confidence-capital/articleshow/125474861.cms",
            "description": "IndusInd Bank has begun early discussions to gauge investor interest for a potential qualified institutional placement, according to people aware of the matter. Senior management has been meeting investors after recent discrepancies in forex derivatives triggered senior-level exits.",
            "pubDate": "2025-11-21T01:20:05.074128"
        },
        {
            "title": "Nifty eyes record levels amid progress on US trade deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-eyes-record-levels-amid-progress-on-us-trade-deal/articleshow/125474598.cms",
            "description": "Indian stock markets surged on Thursday, approaching record highs. Investor confidence grew as the government signaled progress on a trade pact with the US. The Nifty index briefly surpassed its all-time closing high. Key companies like Eicher Motors and Reliance Industries saw significant gains. Foreign and domestic investors showed strong buying interest. Asian markets also experienced mixed movements.",
            "pubDate": "2025-11-21T01:20:05.074223"
        },
        {
            "title": "Stock Radar: This Sensex stock hits fresh record highs in November; will the rally continue or time to book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-this-sensex-stock-hits-fresh-record-highs-in-november-will-the-rally-continue-or-time-to-book-profits/articleshow/125459284.cms",
            "description": "Titan Company stock is showing strong upward momentum. The shares have broken out on weekly charts and reached a new record high. Experts recommend buying Titan Company shares for a target of Rs 4,300 in the coming months. Traders can consider a stop loss below Rs 3,780. The stock is trading above key moving averages, indicating a bullish trend.",
            "pubDate": "2025-11-21T01:20:05.074325"
        },
        {
            "title": "RBI intends to not let banking system go dry: Bankers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-intends-to-not-let-banking-system-go-dry-bankers/articleshow/125474780.cms",
            "description": "The Reserve Bank of India will ensure banking system liquidity stays above 1% of NDTL. The central bank reassured bankers about its strategy. Recent interventions in the currency spot market and festive season demand caused liquidity to briefly turn negative. The RBI plans to use measures like variable rate reverse repo auctions to maintain liquidity.",
            "pubDate": "2025-11-21T01:20:05.074510"
        },
        {
            "title": "CBDT updates Capital Gains scheme, expands SEZ benefits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capital-gains-accounts-scheme-tweak-for-taxpayer-comfort/articleshow/125474698.cms",
            "description": "The CBDT has updated the Capital Gains Accounts Scheme to make it more convenient and digitally accessible. The amendment, effective November 19, extends the scheme to capital gains from shifting industrial units to SEZs under Section 54GA, encouraging such relocations by enabling tax exemptions.",
            "pubDate": "2025-11-21T01:20:05.074602"
        }
    ]
}