{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-01T11:46:08.425483",
    "items": [
        {
            "title": "Morgan Stanley initiates coverage on CG Power, sets Rs 799 target; stock jumps 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cg-power-share-price-rises-4-as-morgan-stanley-initiates-coverage-with-rs-799-target/articleshow/123627008.cms",
            "description": "CG Power shares: Morgan Stanley initiated coverage on multibagger CG Power with an ‘Overweight’ rating and a ₹799 target, calling it a proxy for India’s manufacturing growth. Shares rose 4% after the call, with the brokerage citing strong positioning in motors, power systems.",
            "pubDate": "2025-09-01T05:53:18.079735"
        },
        {
            "title": "NSE, BSE impose fine on MTNL over non-compliance with Sebi rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-bse-impose-fine-on-mtnl-over-non-compliance-with-sebi-rules/articleshow/123626898.cms",
            "description": "Mahanagar Telephone Nigam Ltd (MTNL) faces penalties from the NSE and BSE, totaling ₹13.46 lakh, for failing to meet SEBI's board composition norms. The non-compliance includes the absence of a woman director and issues with audit, nomination, remuneration, stakeholder relationship, and risk management committees.",
            "pubDate": "2025-09-01T05:53:18.079869"
        },
        {
            "title": "Trump’s tariffs head to Supreme Court showdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-tariffs-head-to-supreme-court-showdown/slideshow/123626768.cms",
            "description": "A US appeals court has struck down large portions of former President Trump’s sweeping tariffs, saying he did not have the authority to impose them. However, the court allowed the levies to remain in place for now, giving Trump a chance to take the fight to the Supreme Court. (Source: AFP)",
            "pubDate": "2025-09-01T05:53:18.079977"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley initiates coverage on CG Power; Nuvama retains a buy on RIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-initiates-coverage-on-cg-power-nuvama-retains-a-buy-on-ril/articleshow/123626861.cms",
            "description": "Brokerages are optimistic about specific large and mid-cap companies. Morgan Stanley initiates coverage on CG Power with an Overweight rating. Nuvama maintains a Buy call on Reliance Industries. InCred starts coverage on Apollo Hospitals with a Buy stance. Analysts cite robust earnings visibility and expansion plans. These companies have new growth engines in manufacturing, energy, healthcare, and digital sectors.",
            "pubDate": "2025-09-01T05:53:18.080078"
        },
        {
            "title": "Trump vs. Fed: Power struggle sets stage for policy turmoil",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-vs-fed-power-struggle-sets-stage-for-policy-turmoil/slideshow/123626555.cms",
            "description": "President Donald Trump’s attempt to fire Federal Reserve Governor Lisa Cook has raised alarm among economists and legal experts. This marks the first time in the Fed’s 112-year history that a president has tried to remove a sitting governor. (Source: AP)",
            "pubDate": "2025-09-01T05:53:18.080196"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/123626206.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-09-01T05:53:18.080293"
        },
        {
            "title": "Alibaba shares soar over 15% even as Asia markets dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alibaba-shares-soar-over-15-even-as-asia-markets-dip/articleshow/123626243.cms",
            "description": "Alibaba shares surged, lifting the Hang Seng index. Other Asian markets declined following Wall Street's retreat. Japan's Nikkei fell sharply, pressured by tech stocks. Jakarta faced unrest due to economic hardship. South Korean semiconductor exports hit a record. US stocks dipped ahead of the Labor Day weekend. Inflation data impacted expectations for Federal Reserve rate cuts.",
            "pubDate": "2025-09-01T05:53:18.080394"
        },
        {
            "title": "Japan tech shares drag Nikkei to 3-week low as Advantest dives 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-tech-shares-drag-nikkei-to-3-week-low-as-advantest-dives-9/articleshow/123626199.cms",
            "description": "Japan's Nikkei share average experienced a significant slump, hitting a three-week low due to a sell-off in chip-sector stocks, mirroring Friday's technology-led downturn on Wall Street. Advantest and SoftBank Group were major contributors to the decline. The downturn is attributed to portfolio rebalancing and disappointing expectations from Nvidia, which also faces competition from Alibaba's new chip.",
            "pubDate": "2025-09-01T05:53:18.080489"
        },
        {
            "title": "Bajaj Auto shares rise 1% after 5% YoY jump in August sales; YTD sales up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-auto-shares-rise-1-after-5-yoy-jump-in-august-sales-ytd-sales-up-2/articleshow/123626151.cms",
            "description": "Bajaj Auto share price: Bajaj Auto reported sales of 4,17,616 units in August 2025, up from 3,97,804 units a year earlier. For April–August, sales rose to 18,94,853 units versus 18,54,029 last year. Two-wheeler sales in August came in at 3,41,887 units, a 2% increase.",
            "pubDate": "2025-09-01T05:53:18.080582"
        },
        {
            "title": "OLA Electric, Reliance Industries among 7 that dropped below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-reliance-industries-among-7-that-dropped-below-vwap/slideshow/123626112.cms",
            "description": "On August 29, the closing prices of seven stocks from Nifty200 dropped over 0.5% relative to the VWAP (Volume Weighted Average Price), and a shift below the VWAP suggests a potential bearish trend, according to stockedge.com's technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.",
            "pubDate": "2025-09-01T05:53:18.080682"
        },
        {
            "title": "China’s factory activity hits 5-month high in August",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-factory-activity-hits-5-month-high-in-august/slideshow/123626000.cms",
            "description": "China’s factory activity expanded at the fastest pace in five months in August, with the RatingDog Manufacturing PMI (compiled by S&P Global) rising to 50.5 from 49.5 in July. The reading not only crossed the 50-mark, which separates growth from contraction, but also beat analysts’ expectations of 49.7 in a Reuters poll. (Source: Reuters)",
            "pubDate": "2025-09-01T05:53:18.080776"
        },
        {
            "title": "NHPC shares jump 2% after board clears Rs 10,000 crore borrowing plan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nhpc-shares-jump-2-after-board-clears-rs-10000-crore-borrowing-plan/articleshow/123625801.cms",
            "description": "NHPC shares: The company said its board has cleared a fundraising plan for FY26, to be executed in multiple tranches via bonds, term loans, or external commercial borrowings. NHPC noted that the funds will support both ongoing and upcoming projects.",
            "pubDate": "2025-09-01T05:53:18.080871"
        },
        {
            "title": "Warren Buffett turns 95. Here are 10 investing lessons from his legendary career",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-turns-95-here-are-10-investing-lessons-from-his-legendary-career/articleshow/123625772.cms",
            "description": "Warren Buffett celebrated his 95th birthday as he prepares to step down as Berkshire Hathaway’s CEO after 60 years. His legendary investing principles—focused on value, patience, and strong management—have shaped generations. While stepping back from daily leadership, Buffett plans to remain active, ensuring his legacy and lessons continue to influence the market for years.",
            "pubDate": "2025-09-01T05:53:18.080963"
        },
        {
            "title": "Auto ancillary sector delivered 6 multibaggers in 6 months. Can you still catch them?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-ancillary-sector-delivered-6-multibaggers-in-6-months-can-you-still-catch-them/articleshow/123625737.cms",
            "description": "Axis Securities sees the auto ancillary sector at a pivotal moment, with strong long-term growth driven by exports, premium vehicles, and rural demand recovery. However, short-term challenges like high valuations and global uncertainties may cool the rally. Experts advise caution, highlighting export risks, but remain optimistic about localisation and the EV shift fueling future growth.",
            "pubDate": "2025-09-01T05:53:18.081056"
        },
        {
            "title": "Sensex jumps over 300 pts, Nifty tops 24,500 as IT stocks, banks advance on upbeat GDP, U.S. court's ruling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-300-pts-nifty-tops-24500-as-it-stocks-banks-advance-on-upbeat-gdp-u-s-courts-ruling/articleshow/123625664.cms",
            "description": "Indian markets traded higher on Monday, fueled by strong GDP data and a U.S. court ruling on Trump's tariffs. Sensex and Nifty saw gains, particularly in the IT and financial sectors. While India's GDP growth exceeded expectations, concerns remain about the potential impact of U.S. trade policies on future business activity.",
            "pubDate": "2025-09-01T05:53:18.081163"
        },
        {
            "title": "Nifty expiry shifts to Tuesday from tomorrow: Why Mondays won't be the same for Nifty option traders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-expiry-shifts-to-tuesday-from-tomorrow-why-mondays-wont-be-the-same-for-nifty-option-traders/articleshow/123625703.cms",
            "description": "The Nifty derivatives market is set for a major shake-up as weekly expiries move from Thursday to Tuesday starting tomorrow. This shift will reshape trading strategies, with Mondays becoming a high-stakes day due to accelerated time decay in option premiums. Traders must adapt quickly to the new cycle, which introduces a fresh risk-reward equation and heightened Monday activity.",
            "pubDate": "2025-09-01T05:53:18.081257"
        },
        {
            "title": "Premium cement brands to be key beneficiaries of GST cut; price hikes likely in H2: Nomura analyst",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premium-cement-brands-to-be-key-beneficiaries-of-gst-cut-price-hikes-likely-in-h2-nomura-analyst/articleshow/123633776.cms",
            "description": "Cement GST likely cut from 28% to 18%, boosting sector profitability. Price hikes of 4–6% expected in FY26 amid steady demand. Leading brands benefit from premiumisation, while consolidation continues gradually. Housing and infrastructure projects drive volumes, supporting medium- to long-term growth for India’s top cement makers.",
            "pubDate": "2025-09-01T11:45:47.277747"
        },
        {
            "title": "Largecaps bear the brunt as FIIs reduce stakes across markets in June quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/largecaps-bear-the-brunt-as-fiis-reduce-stakes-across-markets-in-june-quarter/articleshow/123633083.cms",
            "description": "Foreign Institutional Investors trimmed stakes across largecap, midcap and smallcap stocks in the June quarter, with the steepest proportional cuts in largecaps. Key stocks like Shriram Finance, ABB, and Dreamfolks saw sharp declines, highlighting rising foreign caution and shifting sentiment in India’s equity markets.",
            "pubDate": "2025-09-01T11:45:47.277877"
        },
        {
            "title": "Market Wrap: Sensex rises 555 points, Nifty tops 24,620, snapping 3-day losing streak after upbeat GDP data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-rises-555-points-nifty-tops-24620-snapping-3-day-losing-streak-after-upbeat-gdp-data/articleshow/123633308.cms",
            "description": "Indian markets rebounded strongly, fueled by robust GDP data and optimism surrounding potential GST rate cuts. Auto and IT sectors led the gains, while global cues were mixed amid a U.S. holiday. The rupee stabilized after hitting a record low, and oil prices edged higher despite demand concerns related to U.S. tariffs.",
            "pubDate": "2025-09-01T11:45:47.277988"
        },
        {
            "title": "Market Watch: Nifty eyes 24,600 breakout as IT sector shows early signs of revival",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-watch-nifty-eyes-24600-breakout-as-it-sector-shows-early-signs-of-revival/articleshow/123632600.cms",
            "description": "Nifty opened the week cautiously, with 24,600 seen as a key breakout level. Rajesh Bhosale highlighted IT sector resilience and recommended Mphasis and Exide Industries as top picks. Analysts believe sectoral rotation and strong support levels could set the stage for September’s market trend.",
            "pubDate": "2025-09-01T11:45:47.278112"
        },
        {
            "title": "Reliance’s big AI bet a positive move, will help Indian IT companies: Sandip Agarwal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliances-big-ai-bet-a-positive-move-will-help-indian-it-companies-sandip-agarwal/articleshow/123632357.cms",
            "description": "Reliance Industries’ push into artificial intelligence (AI) through its new arm, Reliance Intelligence, could be a game changer for India, according to Sandip Agarwal, Fund Manager at Sowilo Investment Managers.",
            "pubDate": "2025-09-01T11:45:47.278219"
        },
        {
            "title": "You're underestimating India's growth cycle, stock market peak in front of us: Morgan Stanley",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/youre-underestimating-indias-growth-cycle-stock-market-peak-in-front-of-us-morgan-stanley/articleshow/123632067.cms",
            "description": "Morgan Stanley remains bullish on India, targeting Sensex 1,00,000 by June 2026, citing strong structural growth, low volatility, and falling rates. Base-case target 89,000 implies 12% upside. Portfolio favors financials, consumer discretionary, industrials; multiple catalysts support a stock-pickers’ market amid global pessimism.",
            "pubDate": "2025-09-01T11:45:47.278320"
        },
        {
            "title": "Engineering sector: Short-term headwinds, yes, but long-term story is intact: 5 engineering stocks with upside potential of up to 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/engineering-sector-short-term-headwinds-yes-but-long-term-story-is-intact-5-engineering-stocks-with-upside-potential-of-up-to-34/articleshow/123630767.cms",
            "description": "Here’s a truism: Structural improvements in a sector are far more important for long-term investing than current market sentiment or short-term headwinds even if they are business headwinds. Now, there are several sectors that have seen structural improvements in the last few years, but are now facing short-term headwinds. This is not unusual as that’s how sectoral cycles play out. As investors, it is important to understand the reasons for the current headwinds, keeping in mind that these sectors have changed structurally, and for the good. It is structural changes which lead to sustained changes in the valuation given to a particular sector.",
            "pubDate": "2025-09-01T11:45:47.278417"
        },
        {
            "title": "Autos lead the charge as exports outpace domestic demand: Ajay Srivastava",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/autos-lead-the-charge-as-exports-outpace-domestic-demand-ajay-srivastava/articleshow/123631843.cms",
            "description": "Despite foreign investor outflows and tariff uncertainties weighing on broader markets, autos have emerged as a bright spot in India’s consumption basket. According to market expert Ajay Srivastava, the sector’s strength lies not just in domestic demand but in the robust export story that is unfolding.",
            "pubDate": "2025-09-01T11:45:47.278511"
        },
        {
            "title": "Japan tech shares drag Nikkei to 3-week low as Advantest tumbles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-tech-shares-drag-nikkei-to-3-week-low-as-advantest-tumbles/articleshow/123630434.cms",
            "description": "The bulk of the Nikkei's 530-index point slide was accounted for by drops in two heavyweight stocks: chip-testing equipment maker and Nvidia supplier Advantest plunged 7.9%, or 244 points, while artificial intelligence-focused start-up investor SoftBank Group dropped 4.8%, or 155 points.",
            "pubDate": "2025-09-01T11:45:47.278628"
        },
        {
            "title": "European stocks rise as Novo Nordisk lifts healthcare on Wegovy data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-rise-as-novo-nordisk-lifts-healthcare-on-wegovy-data/articleshow/123630365.cms",
            "description": "Shares of Novo Nordisk, the fourth-largest healthcare company on the STOXX index, climbed 3.1% after the company said Wegovy cut the risk of heart attack, stroke or death by 57% versus Eli Lilly's rival medicines Mounjaro and Zepbound in a real-world comparison.",
            "pubDate": "2025-09-01T11:45:47.278738"
        },
        {
            "title": "Reliance share price target at Rs 1,733? What CLSA, Morgan Stanley, other top brokerages said after AGM",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-share-price-target-at-rs-1733-what-clsa-morgan-stanley-other-top-brokerages-said-after-agm/articleshow/123629881.cms",
            "description": "Despite a recent dip in Reliance Industries' stock after its AGM, brokerages remain optimistic, setting target prices as high as Rs 1,733. The Jio IPO is anticipated to be a major listing, potentially re-rating telecom stocks, though a holding company discount could temper benefits for RIL shareholders.",
            "pubDate": "2025-09-01T11:45:47.278841"
        },
        {
            "title": "F&O Radar | Deploy Bear Put Spread in Nifty to capitalize on downside momentum while limiting risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bear-put-spread-in-nifty-to-capitalize-on-downside-momentum-while-limiting-risk/articleshow/123629784.cms",
            "description": "The Nifty index concluded the week at 24,426, signaling a bearish trend as it fell below key moving averages and Fibonacci retracement levels. Technical analysis indicates persistent selling pressure, with the daily and weekly RSI confirming the downward momentum. Experts suggest a Bear Put Spread strategy to leverage the anticipated decline while managing risk, given the prevailing short-term bearish sentiment.",
            "pubDate": "2025-09-01T11:45:47.278931"
        },
        {
            "title": "GST meet looms amid market caution, Ajay Srivastava urges tempered expectations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-meet-looms-amid-market-caution-ajay-srivastava-urges-tempered-expectations/articleshow/123629225.cms",
            "description": "Amidst global dialogues at the SCO summit, Indian investors and policymakers are keenly awaiting the GST Council meeting. Market expert Ajay Srivastava views the meeting with caution, citing potential revenue management challenges for states if rate cuts are implemented.",
            "pubDate": "2025-09-01T11:45:47.279021"
        },
        {
            "title": "Mukul Agrawal’s Monolithisch India rockets 200% in 44 days, 2 more June quarter picks climb up to 67%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawals-monolithisch-india-rockets-200-in-44-days-2-more-june-quarter-picks-climb-up-to-67/articleshow/123629123.cms",
            "description": "Ace investor Mukul Agrawal’s recent picks, Monolithisch India, Yatharth Hospital, and Tatva Chintan, have delivered impressive returns in FY26, gaining nearly 200%, 67%, and 53%, respectively. Added in the June quarter, these stocks now rank among the top 10 performers in his 64-stock portfolio. Monolithisch, listed in June, is his second-best performer after ASM Technologies.",
            "pubDate": "2025-09-01T11:45:47.279114"
        },
        {
            "title": "NSE’s expiry day shift marks historic change: First Tuesday expiry tomorrow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nses-expiry-day-shift-marks-historic-change-first-tuesday-expiry-tomorrow/articleshow/123629045.cms",
            "description": "The National Stock Exchange of India (NSE) is set to shift all futures and options (F&O) contracts expiry day from Thursday to Tuesday, effective September 1, 2025. This transition marks a significant change after 25 years of Thursday expiries, potentially reshaping trading dynamics and redistributing activity between NSE and BSE.",
            "pubDate": "2025-09-01T11:45:47.279203"
        },
        {
            "title": "Ola Electric shares rally 30% in 5 days. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-rally-30-in-5-days-should-you-buy-sell-or-hold/articleshow/123629004.cms",
            "description": "The rally in Ola Electric shares comes after PLI certification for its Gen 3 scooters. Analysts highlight potential upside, but caution that stretched valuations and weak fundamentals persist, even as margins improve and technical charts signal a bullish breakout.",
            "pubDate": "2025-09-01T11:45:47.279294"
        }
    ]
}