{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-31T03:41:51.114484",
    "items": [
        {
            "title": "IIFL Capital Services and 3 other stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iifl-capital-services-and-3-other-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126263173.cms",
            "description": "On December 30, in the NSE list of stocks with a market cap over Rs 10,000 crore, four stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-12-31T03:41:30.353221"
        },
        {
            "title": "RITES shares in focus on winning $3.6 million international locomotive supply order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rites-shares-in-focus-on-winning-3-6-million-international-locomotive-supply-order/articleshow/126263063.cms",
            "description": "RITES Ltd shares will be in focus after the company secured an international order worth USD 3.6 million from Zimbabwe for supplying in-service Cape gauge diesel-electric locomotives. The three-month contract underscores RITES’ overseas execution capabilities, even as the stock has faced sustained pressure across longer timeframes.",
            "pubDate": "2025-12-31T03:41:30.353352"
        },
        {
            "title": "Cupid, Ashok Leyland among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-ashok-leyland-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/126263050.cms",
            "description": "In the NSE list of stocks with a market capitalisation above Rs 1,000 crore, six counters witnessed a 5-year swing high at the close on December 30, signalling bullishness, according to technical scan data from StockEdge.A 5-year swing high marks the highest price a stock has reached over five years and acts as a key resistance level. While such moves are considered bullish, they differ from a 5-year breakout, which requires a decisive move beyond long-standing resistance.",
            "pubDate": "2025-12-31T03:41:30.353462"
        },
        {
            "title": "Tata Steel, JSW Steel, and other steel stocks in focus as India imposes a three-year import levy of up to 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-jsw-steel-and-other-steel-stocks-in-focus-as-india-imposes-a-three-year-import-levy-of-up-to-12/articleshow/126262950.cms",
            "description": "Shares of steelmakers such as Tata Steel and JSW Steel may remain in focus after India imposed a three-year safeguard duty of up to 12% on select steel imports. The phased tariff aims to curb cheap inflows, protect domestic producers, and align with global trade measures amid rising import pressures.",
            "pubDate": "2025-12-31T03:41:30.353568"
        },
        {
            "title": "Jindal Steel among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jindal-steel-among-4-stocks-showing-bullish-rsi-upswing/slideshow/126262860.cms",
            "description": "On December 30, four stocks from the Nifty500 universe that gained over 3% were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" indicates that the Relative Strength Index (RSI) values are increasing, suggesting a strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify opportunities for buying.",
            "pubDate": "2025-12-31T03:41:30.353667"
        },
        {
            "title": "Power Grid shares in focus after winning 2,000 MWh battery energy storage project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-grid-shares-in-focus-after-winning-2000-mwh-battery-energy-storage-project/articleshow/126262783.cms",
            "description": "Power Grid Corporation of India has won a 2,000 MWh battery energy storage project in Andhra Pradesh under tariff-based competitive bidding. The BOO project, backed by viability gap funding, strengthens grid flexibility. Shares ended flat despite recent underperformance across timeframes. The company received the award letter on December twenty-nine officially.",
            "pubDate": "2025-12-31T03:41:30.353775"
        },
        {
            "title": "Premier Energies shares in focus on multiple order wins worth Rs 2,307 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-shares-in-focus-on-multiple-order-wins-worth-rs-2307-crore/articleshow/126262770.cms",
            "description": "Premier Energies secured new orders worth Rs 2,307.30 crore for execution in FY27-FY28, bolstering its medium-term revenue visibility. These orders from leading domestic IPPs and customers reflect confidence in the company's product quality and execution capabilities. The new contracts align with Premier Energies' ongoing capacity expansion plans, reinforcing its position in India's solar manufacturing ecosystem.",
            "pubDate": "2025-12-31T03:41:30.353876"
        },
        {
            "title": "Bharat Forge shares in focus after Rs 1,662 crore contract win from Defence Ministry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-forge-shares-in-focus-after-rs-1662-crore-contract-win-from-defence-ministry/articleshow/126262719.cms",
            "description": "Bharat Forge Limited has secured its largest small arms contract. The Ministry of Defence awarded the company a deal worth Rs 1,661.9 crore. This contract is for supplying 255,128 Close Quarter Battle Carbines to the Indian Army. The carbines are indigenously designed and developed. Execution of this significant contract is expected to begin within five years.",
            "pubDate": "2025-12-31T03:41:30.353976"
        },
        {
            "title": "IndiGo shares in focus on receiving Rs 458 crore GST demand order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-on-receiving-rs-458-crore-gst-demand-order/articleshow/126262697.cms",
            "description": "IndiGo Airlines is under scrutiny following substantial tax demand orders from the Goods and Services Tax department. The airline has received a penalty of Rs 458.26 crore for financial years 2018-19 to 2022-23. IndiGo believes these orders are incorrect and plans to contest them legally. A separate order for Rs 14.59 lakh was also received for financial year 2021-22.",
            "pubDate": "2025-12-31T03:41:30.354093"
        },
        {
            "title": "Apollo Techno Industries shares to debut today. GMP steady ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-techno-industries-shares-to-debut-today-gmp-steady-ahead-of-listing/articleshow/126262394.cms",
            "description": "Apollo Techno Industries is set to list on the BSE SME platform with a modest grey market premium, following a highly subscribed Rs 48 crore IPO. The company, a player in trenchless technology for infrastructure, saw strong demand from all investor categories.",
            "pubDate": "2025-12-31T03:41:30.354191"
        },
        {
            "title": "Bai Kakaji Polymers shares to list today. Here's what GMP suggests",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bai-kakaji-polymers-shares-to-list-today-heres-what-gmp-suggests/articleshow/126262384.cms",
            "description": "Bai Kakaji Polymers is set to debut on the BSE SME platform on December 31. The company's Rs 105 crore IPO saw steady demand, with a 2% grey market premium indicating cautious investor sentiment. The funds raised will primarily be used to repay borrowings and for capacity expansion.",
            "pubDate": "2025-12-31T03:41:30.354282"
        },
        {
            "title": "Admach Systems IPO eyes steady listing as GMP indicates 5% premium over issue price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/admach-systems-ipo-eyes-steady-listing-as-gmp-indicates-5-premium-over-issue-price/articleshow/126262369.cms",
            "description": "Admach Systems is set to list on the BSE SME platform on December 31, with a modest 5% grey market premium indicating cautious investor sentiment. The Rs 42.6 crore IPO, priced at Rs 239 per share, saw strong demand from non-institutional investors.",
            "pubDate": "2025-12-31T03:41:30.354374"
        },
        {
            "title": "Nanta Tech IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nanta-tech-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/126262346.cms",
            "description": "Nanta Tech's initial public offering is set to list on the BSE SME platform. The grey market indicates a premium of around 11% over the issue price. The company received a healthy response from investors. Nanta Tech operates in audio-visual integration, technology distribution, service robotics, and software development. Proceeds will fund an experience centre and working capital.",
            "pubDate": "2025-12-31T03:41:30.354466"
        },
        {
            "title": "Dhara Rail Projects IPO set for listing as GMP signals 10% premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dhara-rail-projects-ipo-set-for-listing-as-gmp-signals-10-premium/articleshow/126262335.cms",
            "description": "Dhara Rail Projects lists on the NSE SME platform today. The IPO saw strong investor demand, with grey market trends suggesting a premium. The company focuses on railway rolling stock maintenance and repair. Proceeds will fund working capital and debt reduction. Dhara Rail Projects has a significant order book, indicating future revenue.",
            "pubDate": "2025-12-31T03:41:30.354559"
        },
        {
            "title": "Positive Breakout: These 10 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-cross-above-their-200-dmas/slideshow/126262315.cms",
            "description": "As of December 30, 2025, 15 NSE-listed stocks with a market capitalisation of over Rs 1,000 crore closed above their 200-day moving average (DMA). Of these, we have highlighted the top 10 that posted gains of more than 2%, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-12-31T03:41:30.354653"
        },
        {
            "title": "Stock Market Holiday for New Year 2026: Are NSE, BSE closed on January 1? Check Here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-for-new-year-2026-are-nse-bse-closed-on-january-1-check-here/articleshow/126256410.cms",
            "description": "NSE Holidays for New Year 2026: NSE and BSE will remain open for trading on January 1, even as most major global markets stay shut. Commodity exchanges MCX and NCDEX will be open during the day session but will remain closed in the evening session.",
            "pubDate": "2025-12-31T03:41:30.354742"
        }
    ]
}