{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-25T06:46:21.076618",
    "items": [
        {
            "title": "Q2 results today: Coal India, IndiGo among 149 companies to announce earnings on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q2-results-today-coal-india-indigo-among-149-companies-to-announce-earnings-on-friday/articleshow/114565615.cms",
            "description": "Today, 149 companies will announce their July-September 2024 earnings. Important results include Coal India, JSW Steel, Bharat Electronics, IndiGo, and Bank of Baroda. IndiGo may report losses, while JSW Steel's profits are expected to fall significantly. Investors and analysts are keenly awaiting these updates to assess market performance.",
            "pubDate": "2024-10-25T06:46:18.698436"
        },
        {
            "title": "IndusInd provides more for loan losses, Q2 net profit falls 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-provides-more-for-loan-losses-q2-net-profit-falls-39/articleshow/114564015.cms",
            "description": "The lender posted a 5% growth in its net interest income to ₹5,347 crore. Meanwhile, the net interest margin for the quarter under review stood at 4.08%, down by 21 bps from 4.29% reported in the quarter last year.",
            "pubDate": "2024-10-25T06:46:18.698560"
        },
        {
            "title": "Costs a drag on ITC's Q2, D-Street show may stay muted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/costs-a-drag-on-itcs-q2-d-street-show-may-stay-muted/articleshow/114563909.cms",
            "description": "Raw material cost inflation was the single biggest factor that hurt the margins. The raw material cost surged 29% year-on-year led by the rise in prices of leaf tobacco and wood. The raw material cost as a proportion of sales rose from 40.2% in the same quarter last year to 44.6% this year.",
            "pubDate": "2024-10-25T06:46:18.698667"
        }
    ]
}