{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-27T09:36:22.106498",
    "items": [
        {
            "title": "Textile, shrimp stocks rally up to 12% as India concludes talks on ‘mother of all trade deals’ with EU",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/textile-shrimp-stocks-rally-up-to-12-as-india-concludes-talks-on-mother-of-all-trade-deals-with-eu/articleshow/127595027.cms",
            "description": "Export-oriented textile and shrimp companies experienced a surge in buying interest, with shares rising up to 12%, following the conclusion of India and the European Union's long-pending free trade agreement negotiations. This pact, described as the 'mother of all trade deals,' is set for formal announcement soon. Additionally, renewed optimism for an India-U.S. trade deal, following positive remarks from U.S.",
            "pubDate": "2026-01-27T04:37:36.191790"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs hikes target price on UltraTech Cements; Elara Capital upgrades Kotak Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-hikes-target-price-on-ultratech-cements-elara-capital-upgrades-kotak-bank/articleshow/127595012.cms",
            "description": "Brokerage firms remain positive on select frontline stocks, with Goldman Sachs raising its target price on UltraTech Cements and Elara Capital maintaining a Buy on BPCL while upgrading Kotak Mahindra Bank, citing resilient earnings and improving fundamentals.",
            "pubDate": "2026-01-27T04:37:36.191940"
        },
        {
            "title": "Adani Energy Solutions among  5 stocks that dropped below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-energy-solutions-among-5-stocks-that-dropped-below-vwap/slideshow/127594076.cms",
            "description": "On January 23, the closing prices of five stocks from Nifty500 dropped over 3% relative to the VWAP (Volume Weighted Average Price), and a shift below the VWAP suggests a potential bearish trend, according to stockedge.com's technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.",
            "pubDate": "2026-01-27T04:37:36.192051"
        },
        {
            "title": "Selling stocks to buy gold and silver ETFs? Why turning a hedge into a bet can backfire",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/selling-stocks-to-buy-gold-and-silver-etfs-why-turning-a-hedge-into-a-bet-can-backfire/articleshow/127594860.cms",
            "description": "Retail investors bruised by small-cap losses are increasingly considering selling equities to chase soaring gold and silver ETFs. With precious metals sharply outperforming stocks, the temptation is strong. However, wealth managers warn that reallocating based on recent returns reflects recency bias and risks undermining disciplined asset allocation by turning portfolio hedges into concentrated bets near a potential cycle peak.",
            "pubDate": "2026-01-27T04:37:36.192152"
        },
        {
            "title": "Silver soars 6%, gold up over 1% to scale new peak and this may just be the start. Check where the bullion is now headed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-soars-6-gold-up-over-1-to-scale-new-peak-and-this-may-just-be-the-start-check-where-the-bullion-is-now-headed/articleshow/127594677.cms",
            "description": "Gold and silver prices hit fresh lifetime highs on the MCX amid strong safe haven demand, geopolitical tensions and a weaker dollar. Analysts see continued volatility, with bullion expected to remain firm and buying on dips advised.",
            "pubDate": "2026-01-27T04:37:36.192247"
        },
        {
            "title": "Axis Bank shares surge over 4% as Q3 PAT rises 3% YoY. Should you buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-shares-surge-4-as-q3-pat-rises-3-yoy-should-you-buy-now/articleshow/127594531.cms",
            "description": "Axis Bank shares saw a significant jump on Tuesday. The bank reported a 3% year-on-year rise in its standalone net profit for the December quarter. Net interest income also showed growth. Brokerages like Citi and Bernstein have reacted positively to the results, maintaining their ratings and target prices. The bank's asset quality remains stable, with strong provision coverage ratios.",
            "pubDate": "2026-01-27T04:37:36.192343"
        },
        {
            "title": "Waaree Renewable Technologies shares in focus after approval to acquire 55% stake in ASPL for Rs 1,225 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-technologies-shares-in-focus-after-approval-to-acquire-55-stake-in-aspl-for-rs-1225-crore/articleshow/127594400.cms",
            "description": "Waaree Renewable Technologies shares are in focus after its board approved acquiring a 55% stake in Associated Power Structures Limited for Rs 1,225 crore, a move expected to strengthen its power infrastructure presence and act as a near term stock trigger.",
            "pubDate": "2026-01-27T04:37:36.192445"
        },
        {
            "title": "UltraTech Cement Q3 PAT jumps 32% YoY. Should investors buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ultratech-cement-q3-pat-jumps-32-yoy-should-investors-buy-sell-or-hold/articleshow/127593924.cms",
            "description": "UltraTech Cement reported a strong Q3FY26 with a 32% YoY profit jump to Rs 1,792 crore and a 22.5% rise in net sales. Brokerage firms like Goldman Sachs, Morgan Stanley, and Elara Capital have reiterated positive ratings, raising target prices due to robust volume growth, pricing power, and cost efficiencies.",
            "pubDate": "2026-01-27T04:37:36.192544"
        },
        {
            "title": "Hyundai Motor India shares in focus as Trump threatens tariff hike on South Korea auto industry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-shares-in-focus-as-trump-threatens-tariff-hike-on-south-korea-auto-industry/articleshow/127594209.cms",
            "description": "Hyundai Motor India shares are under scrutiny following US President Trump's threat to hike tariffs on South Korean autos to 25%. This move stems from alleged delays in South Korea's legislative approval of a trade deal. Despite a sequential sales dip in December 2025, Hyundai's exports saw significant year-on-year growth.",
            "pubDate": "2026-01-27T04:37:36.192642"
        },
        {
            "title": "Sensex falls over 400 pts, Nifty below 25,000 as trade tariff worries linger; all eyes on US Fed meet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-400-pts-nifty-below-25000-as-trade-tariff-worries-linger-all-eyes-on-us-fed-meet/articleshow/127593819.cms",
            "description": "Indian stock markets opened lower on Tuesday. Global cues, including US tariffs and upcoming Federal Reserve decisions, influenced trading. Sensex and Nifty saw declines. Kotak Mahindra Bank and Axis Bank reported their Q3FY26 earnings. Foreign institutional investors continued selling, impacting the rupee. Global markets showed mixed trends. Oil prices remained flat.",
            "pubDate": "2026-01-27T04:37:36.192737"
        },
        {
            "title": "Kaynes Technology among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/127593500.cms",
            "description": "As of January 23, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2026-01-27T04:37:36.192832"
        },
        {
            "title": "MCX shares rally over 4% as Q3 PAT skyrockets 151% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-in-focus-as-q3-pat-skyrockets-151-yoy/articleshow/127592702.cms",
            "description": "MCX reported a sharp jump in Q3FY26 earnings, driven by strong growth in trading volumes and operating leverage. Revenue and profit rose sharply year on year and sequentially, supported by higher derivatives activity, improved margins and new product launches in the bullion segment.",
            "pubDate": "2026-01-27T04:37:36.192941"
        },
        {
            "title": "Wipro shares in focus as stock turns ex-date for Rs 6 interim dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-in-focus-as-stock-turns-ex-date-for-rs-6-interim-dividend/articleshow/127591724.cms",
            "description": "Wipro shares are set to trade ex-dividend on January 27 following the announcement of an interim dividend of Rs 6 per share. The payout reflects the company’s continued dividend track record, with payments scheduled by mid-February, while the stock remains in focus amid recent price weakness.",
            "pubDate": "2026-01-27T04:37:36.193035"
        },
        {
            "title": "Kotak Mahindra Bank shares decline 4% after Q3 results. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-in-focus-after-q3-pat-rises-4-yoy-what-should-investors-do/articleshow/127591350.cms",
            "description": "Kotak Mahindra Bank shares fell on Tuesday, January 27, even as the lender reported a 4% year-on-year rise in net profit for the third quarter of FY26. Net profit reached Rs 3,446 crore. Net interest income also saw a 5% increase. Consolidated profit after tax grew 5% year-on-year. Asset quality improved with a lower gross non-performing asset ratio.",
            "pubDate": "2026-01-27T04:37:36.193133"
        },
        {
            "title": "Ashok Leyland and 3 other stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-and-3-other-stocks-witness-5-year-swing-high-breakout/slideshow/127591183.cms",
            "description": "In the NSE universe of stocks with a market capitalisation above Rs 1,000 crore, four counters recorded a 5-year swing high at the close on January 23, signalling bullishness, according to technical scan data from StockEdge.A 5-year swing high is the highest price a stock has reached over 5 years. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2026-01-27T04:37:36.193225"
        },
        {
            "title": "Home First Finance Company among six stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/home-first-finance-company-among-six-stocks-showing-bullish-rsi-upswing/slideshow/127591008.cms",
            "description": "On January 23, six stocks from the Nifty500 pack appeared in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from below is considered a bullish signal, suggesting improving momentum and strengthening sentiment, which traders monitor to spot potential buying opportunities.",
            "pubDate": "2026-01-27T04:37:36.193315"
        },
        {
            "title": "Adani Green Energy shares zoom 6% as investors buy the dip. Here’s what happened",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-energy-shares-zoom-6-as-investors-buy-the-dip-heres-what-happened/articleshow/127596798.cms",
            "description": "Adani Green Energy shares rebounded 6% as investors bought the dip after a sharp sell-off triggered by regulatory concerns and weak Q3 results. Sentiment improved following company clarification and updates on capacity additions.",
            "pubDate": "2026-01-27T05:04:21.934224"
        },
        {
            "title": "Hindustan Zinc shares jump 4% as silver prices soar 45% in 2026. Check target, upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-jump-4-as-silver-prices-soar-45-in-2026-check-target-upside/articleshow/127595837.cms",
            "description": "Hindustan Zinc shares surged to a fresh 52-week high of Rs 731, driven by a sharp rally in silver prices which crossed $100 per troy ounce. The company, a leading global silver producer, saw its stock climb as analysts like HSBC upgraded it to 'Buy' with an increased target price, citing strong fundamentals and a positive outlook for metal prices.",
            "pubDate": "2026-01-27T05:04:21.934346"
        },
        {
            "title": "Budget 2026: Anticipating a shift from attracting foreign investors to retaining them",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-anticipating-a-shift-from-attracting-foreign-investors-to-retaining-them/articleshow/127598998.cms",
            "description": "India's foreign investment landscape has seen net outflows recently, despite strong market returns. To counter this, Budget 2026 is urged to offer competitive tax rates on long-term investments for both FPIs and FDIs. Lowering taxes on capital gains and dividends, along with making debt markets more attractive, could stabilize inflows and boost reserves.",
            "pubDate": "2026-01-27T05:38:20.512142"
        },
        {
            "title": "Jefferies cuts Paytm price target to Rs 1,450 on incentive structure changes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-cuts-paytm-price-target-to-rs-1450-on-incentive-structure-changes/articleshow/127597819.cms",
            "description": "Jefferies has cut its price target on Paytm to Rs 1,450 after removing PIDF incentives from estimates, trimming EBITDA forecasts for FY27 and FY28. Despite the downgrade, the brokerage maintained its Buy rating, citing strong core business traction.",
            "pubDate": "2026-01-27T05:38:20.512277"
        },
        {
            "title": "Mahindra, Tata, Hyundai, other auto stocks fall up to 5%. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahindra-tata-hyundai-other-auto-stocks-fall-up-to-5-heres-why/articleshow/127597922.cms",
            "description": "Auto stocks fell sharply as investors reacted to reports that the India EU free trade agreement could significantly lower import tariffs on European cars. Concerns over increased competition weighed on shares of Mahindra, Tata Motors, Hyundai and Maruti Suzuki.",
            "pubDate": "2026-01-27T05:38:20.512507"
        },
        {
            "title": "Adani Enterprises, Adani Ports, Adani Green shares rebound up to 6%. What’s triggering the uptick?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-adani-ports-adani-green-shares-rebound-up-to-6-whats-triggering-the-uptick/articleshow/127599116.cms",
            "description": "Adani group shares rebounded up to 5% after a significant sell-off, following news of Adani executives' willingness to negotiate with the US SEC regarding summons. Lawyers are discussing an agreement to resolve service of process, with the SEC seeking court permission for direct email delivery after India rejected official requests.",
            "pubDate": "2026-01-27T05:54:44.609087"
        },
        {
            "title": "IndusInd Bank share price target: Should you buy, hold or sell after earnings miss? Here’s what brokerages recommend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-share-price-target-should-you-buy-hold-or-sell-after-earnings-miss-heres-what-brokerages-recommend/articleshow/127599150.cms",
            "description": "IndusInd Bank reported a sharp year on year profit decline in Q3FY26, broadly in line with estimates. Brokerages offered mixed views, with ratings ranging from Outperform to Reduce, citing elevated stress, muted growth and a gradual recovery outlook.",
            "pubDate": "2026-01-27T05:54:44.609221"
        },
        {
            "title": "BPCL shares rise 3% as Q3 net profit jumps 89%. Buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bpcl-shares-rise-3-as-q3-net-profit-jumps-89-buy-sell-or-hold/articleshow/127600856.cms",
            "description": "Bharat Petroleum Corporation Limited shares surged following a significant 98% rise in December quarter net profit. The company announced a Rs 10 per share interim dividend for FY26. Improved refining margins and a stronger balance sheet contributed to the positive outlook. Analysts maintain a buy rating with a potential upside.",
            "pubDate": "2026-01-27T06:22:32.607335"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to benefit from potential upside moves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-benefit-from-potential-upside-moves/articleshow/127602383.cms",
            "description": "With Nifty holding key support near 24,800 and volatility rising ahead of the Union Budget, analysts suggest deploying a Bull Call Spread strategy on expiry day to benefit from a potential upside breakout beyond the 25,000 to 25,200 range.",
            "pubDate": "2026-01-27T06:56:52.960591"
        },
        {
            "title": "India-EU sign ‘mother of all deals’: Stocks to buy, winners and losers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-eu-sign-mother-of-all-deals-stocks-to-buy-winners-and-losers/articleshow/127605576.cms",
            "description": "India’s landmark FTA with the European Union, dubbed the “mother of all deals,” is reshaping investor focus as tariff cuts and regulatory easing promise a structural export boost. Textiles, pharmaceuticals and specialty chemicals are the biggest near-term winners, while shrimp exporters, auto ancillaries and jewellery retailers offer secondary plays. Automakers and Sula Vineyards face near-term pressure.",
            "pubDate": "2026-01-27T07:57:07.363096"
        },
        {
            "title": "Stock Picks This Week: Buy APL Apollo; Sell IEX, Hero MotoCorp, says Axis Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-this-week-buy-apl-apollo-sell-iex-hero-motocorp-says-axis-securities/slideshow/127604684.cms",
            "description": "After a washout last week, where the Nifty ended 2.5% lower, the current week may see the 50-stock index trade in a broad range of 25,600–24,600 with a negative bias, according to an Axis Securities note. The weekly RSI is trending lower and remains below its reference line, indicating continued bearish momentum. Rajesh Palviya, SVP Research Head – Technical & Derivatives, has three stock recommendations, two of which are ‘Sell’. Check details:",
            "pubDate": "2026-01-27T07:57:07.363207"
        },
        {
            "title": "OneSource Specialty Pharma shares nosedive 18% on weak Q3. Here’s what happened",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/onesource-specialty-pharma-shares-nosedive-18-on-weak-q3-heres-what-happened/articleshow/127604206.cms",
            "description": "OneSource Specialty Pharma shares plunged 18% after reporting a net loss of Rs 47 crore for the December quarter, a significant reversal from the previous year's profit. Revenue dropped 26% year-on-year, impacted by delayed semaglutide approvals in Canada. Despite the weak quarter, the company reaffirmed its FY28 revenue guidance.",
            "pubDate": "2026-01-27T07:57:07.363306"
        },
        {
            "title": "Opportunities emerge across market segments, investors should think long-term, says Gurmeet Chadha",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/opportunities-emerge-across-market-segments-investors-should-think-long-term-says-gurmeet-chadha/articleshow/127607276.cms",
            "description": "Amid market volatility and corrections, investors are debating whether to favour largecaps or riskier mid- and small-caps. Gurmeet Chadha advises taking a medium- to long-term view and focusing on accumulating fundamentally strong companies, irrespective of their market size.",
            "pubDate": "2026-01-27T08:30:02.718165"
        },
        {
            "title": "Sula Vineyards, Radico Khaitan, United Spirits fall up to 4% as European wines bag cuts from India-EU trade deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sula-vineyards-radico-khaitan-united-spirits-fall-up-to-4-as-european-wines-bag-cuts-from-india-eu-trade-deal/articleshow/127610365.cms",
            "description": "Indian liquor stocks like Sula Vineyards, Radico Khaitan, United Spirits, Globus Spirits saw significant selling pressure as a new  India-EU trade pact allows European wines to enter India at lower duties. While Indian wines will also gain market access in the EU, the immediate impact is increased competition for domestic producers.",
            "pubDate": "2026-01-27T08:59:12.959722"
        },
        {
            "title": "Japan's Nikkei rises as yen weakens, chip-related shares advance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-as-yen-weakens-chip-related-shares-advance/articleshow/127612270.cms",
            "description": "Japan's Nikkei share ​average ended higher on Tuesday, as technology stocks extended ⁠their advance after the yen lost some gains.",
            "pubDate": "2026-01-27T09:36:21.101468"
        }
    ]
}