{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-12T09:29:08.907274",
    "items": [
        {
            "title": "Q3 results today: HAL, Ashok Leyland among 501 companies to announce earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-hal-ashok-leyland-among-501-companies-to-announce-earnings-on-wednesday/articleshow/118160132.cms",
            "description": "The third quarter earnings season sees key companies like Ashok Leyland, Siemens, and others announcing results. Ashok Leyland is predicted to witness a minor revenue decline while showing a profit increase. Siemens is expected to report significant growth in both revenue and profit, boosted by its Gas & Power and Mobility segments.",
            "pubDate": "2025-02-12T07:57:29.361701"
        },
        {
            "title": "Vodafone Idea Q3 net loss narrows to Rs 6,609 crore on tariff hikes, ARPU",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vodafone-idea-q3-net-loss-narrows-to-rs-6609-crore-on-tariff-hikes-arpu/articleshow/118153157.cms",
            "description": "Vodafone Idea's net loss narrowed to Rs 6,609 crore in Q3, driven by tariff hikes that boosted ARPU. However, the telco continues to face challenges with subscriber losses, now below 200 million. Investments and phased 5G rollout plans are set to accelerate in the coming quarters.",
            "pubDate": "2025-02-12T07:57:29.361847"
        },
        {
            "title": "SAIL Q3 Results: Cons PAT falls 66% to Rs 142 crore, revenue up 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sail-q3-results-cons-pat-falls-66-to-rs-142-crore-revenue-up-5/articleshow/118152776.cms",
            "description": "Steel Authority of India (SAIL) reported a 66% drop in standalone net profit at Rs 142 crore for Q3FY25, compared to Rs 422 crore a year ago. Revenue rose 5% to Rs 24,490 crore. Expenses increased, and profit after tax fell 84% sequentially. SAIL Chairman emphasized a focus on boosting production and addressing import issues amid challenging market conditions.",
            "pubDate": "2025-02-12T07:57:29.361964"
        },
        {
            "title": "Berger Q3 Results: Profit declines 1.4% to Rs 295 crore, revenue up 3.2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/berger-q3-results-profit-declines-1-4-to-rs-295-crore-revenue-up-3-2/articleshow/118151687.cms",
            "description": "Paint maker Berger Paints reported a 1.4% year-on-year decline in net profit for the quarter ended December at Rs 295.97 crores amid tough demand conditions. The company attributed it to the impact of price reductions in prior quarters, currency depreciation and inventory impact of monomer price increase.",
            "pubDate": "2025-02-12T07:57:29.362072"
        },
        {
            "title": "NDR InvIT Trust records 5.65% jump in Q3 revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ndr-invit-trust-records-5-65-jump-in-q3-revenue/articleshow/118150288.cms",
            "description": "NDR InvIT Trust, the first perpetual warehousing and industrial parks InvIT, recorded healthy revenue growth of 5.65%, amounting to Rs 79.3 crore with EBITDA growth of 8.86% in Q3 FY25 as against Q2 FY25.",
            "pubDate": "2025-02-12T07:57:29.362172"
        },
        {
            "title": "Vodafone Idea Q3 Results: Cons loss narrows to Rs 6,609 crore, revenue up 4%; ARPU at Rs 173",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vodafone-idea-q3-results-cons-loss-narrows-to-rs-6609-crore-revenue-up-by-over-4-arpu-at-rs-173/articleshow/118149118.cms",
            "description": "Vodafone Idea Q3 Results: Telecom major Vodafone Idea on Tuesday narrowed its December quarter consolidated net losses to Rs 6,609 crore versus Rs 6,986 crore reported in the year ago period.",
            "pubDate": "2025-02-12T07:57:29.362271"
        },
        {
            "title": "Berger Paints India Q3 Results: Net profit slips 1.4% to Rs 295.97 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/berger-paints-india-q3-results-net-profit-slips-1-4-to-rs-295-97-crore/articleshow/118148755.cms",
            "description": "Berger Paints India Ltd on Tuesday reported a 1.4 per cent decline in consolidated net profit to Rs 295.97 crore in the December 2024 quarter, impacted by price cuts, muted urban demand and slowdown in a few key markets. The company had posted a consolidated net profit of Rs 300.16 crore in the third quarter last fiscal, Berger Paints India Ltd said in a regulatory filing.",
            "pubDate": "2025-02-12T07:57:29.362371"
        },
        {
            "title": "IRCTC Q3 Results FY25: Cons PAT jumps 14% to Rs 341 crore. Rs 3 per share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/irctc-q3-results-cons-pat-jumps-14-to-rs-341-crore-rs-3-per-share-dividend-announced/articleshow/118145015.cms",
            "description": "IRCTC Q3 Results FY25: Indian Railway Catering and Tourism Corporation (IRCTC) on Tuesday reported a 14% growth in its December quarter standalone net profit at Rs 341 crore versus Rs 300 crore reported in the year ago period.",
            "pubDate": "2025-02-12T07:57:29.362467"
        },
        {
            "title": "Q3 results today: Vodafone Idea, IRCTC among 338 companies to announce earnings on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-vodafone-idea-irctc-among-338-companies-to-announce-earnings-on-tuesday/articleshow/118131317.cms",
            "description": "On Tuesday, 338 companies, including Vodafone Idea, SAIL, IRCTC, Tata Investment, and Zee Media, will announce their third-quarter results. Vodafone Idea is expected to narrow its losses due to tariff hikes and ARPU increase. Analysts are focused on revenue growth, network capacity expansion, and 5G rollout progress. Key companies like Lupin, NBCC, and Bajaj Healthcare will also report.",
            "pubDate": "2025-02-12T07:57:29.362563"
        },
        {
            "title": "SAIL Q3 profit slumps 62% YoY to Rs 126 crore on lower steel prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sail-q3-profit-slumps-62-yoy-to-rs-126-crore-on-lower-steel-prices/articleshow/118172279.cms",
            "description": "SAIL Q3 Results: SAIL's Q3 profit dropped 62% YoY to ₹126 crore due to lower steel prices, despite higher sales boosting revenue. EBITDA improved amid cheap imports and market challenges. The company expects infrastructure growth to support domestic steel demand.",
            "pubDate": "2025-02-12T09:29:05.827347"
        },
        {
            "title": "HAL Q3 Results: Profit jumps 14% YoY to Rs 1,440 cr, revenue up 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hal-q3-results-profit-jumps-14-yoy-to-rs-1440-cr-revenue-up-15/articleshow/118172069.cms",
            "description": "Profit growth was fueled by strong demand for its aircraft from the country's defence ministry. The board has announced a first interim dividend of Rs 25 per fully paid-up Rs 5 share, with February 18 as the record date. Eligible shareholders will receive the dividend on March 14.",
            "pubDate": "2025-02-12T09:29:05.827467"
        },
        {
            "title": "Ashok Leyland Q3 Results: Cons PAT surges 36% YoY to Rs 762 crore, revenue rises 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ashok-leyland-q3-results-cons-pat-zooms-36-yoy-to-rs-762-crore-revenue-rises-8/articleshow/118170209.cms",
            "description": "​​The Q3FY25 revenue from operations stood at Rs 11,995 crore, an increase of over 8% from Rs 11,066 crore reported in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-02-12T09:29:05.827572"
        },
        {
            "title": "PFC Q3 Results: Cons PAT jumps 23% YoY to Rs 5,829 crore; Rs 3.5/share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pfc-q3-results-cons-pat-jumps-23-yoy-to-rs-5829-crore-dividend-of-rs-3-5-per-share-announced/articleshow/118169004.cms",
            "description": "PFC Q3 Results: Total revenue from operations in Q3FY25 reached Rs 26,798 crore, marking a 14% rise from Rs 23,571 crore in the same quarter last year. The state-run company also declared a third interim dividend of Rs 3.50 per share for FY 2024-25.",
            "pubDate": "2025-02-12T09:29:05.827667"
        }
    ]
}