{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-20T14:52:48.171586",
    "items": [
        {
            "title": "Q3 results today: ITC Hotels among 43 companies to report earnings on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-itc-hotels-among-43-companies-to-report-earnings-on-tuesday/articleshow/126746305.cms",
            "description": "As many as 43 companies, including Persistent Systems and ITC Hotels, are set to announce their December quarter earnings on Tuesday. Analysts anticipate growth for Persistent Systems driven by BFSI and healthcare, while AU Small Finance Bank is expected to see improved net interest margins and robust business growth.",
            "pubDate": "2026-01-20T04:28:18.224818"
        },
        {
            "title": "ITC Hotels Q3 Results: PAT jumps 77% YoY to Rs 235 crore, revenue rises 47%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-hotels-q3-results-pat-jumps-77-yoy-to-rs-235-crore-revenue-rises-47/articleshow/126782468.cms",
            "description": "ITC Hotels posted strong Q3FY26 results, with net profit surging 77% year-on-year to Rs 235 crore and revenue rising 47%, driven by robust hotel demand, sequential growth, and the first real estate revenue contribution, despite higher costs and stock reaction.",
            "pubDate": "2026-01-20T10:31:06.262044"
        },
        {
            "title": "Shoppers Stop Q3 Results: Profit falls 69% to Rs 16 crore, revenue rises marginally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/shoppers-stop-q3-results-profit-falls-69-to-rs-16-crore-revenue-rises-marginally/articleshow/126818140.cms",
            "description": "Retail chain Shoppers Stop on Tuesday reported a decline of 69.13 per cent in its consolidated net profit at Rs 16.12 crore in the December quarter of FY26, citing factors such as a shift in the festival period and uneven consumption trends.",
            "pubDate": "2026-01-20T14:52:45.098590"
        },
        {
            "title": "IndiaMart Q3 Results: Cons PAT jumps 56% YoY to Rs 188 crore, revenue up 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indiamart-q3-results-cons-pat-jumps-56-yoy-to-rs-188-crore-revenue-up-13/articleshow/126816851.cms",
            "description": "IndiaMART InterMesh posted strong December quarter results with profit up 56% year on year to Rs 188 crore, revenue rising 13%, robust collections growth, healthy deferred revenue, stable margins, and improving cash flows despite modest sequential topline growth trends overall.",
            "pubDate": "2026-01-20T14:52:45.098754"
        },
        {
            "title": "Persistent Systems Q3 Results: PAT grows 18% YoY to Rs 439 crore; company declares Rs 22 dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/persistent-systems-q3-results-pat-grows-18-yoy-to-rs-439-crore-company-declares-rs-22-dividend/articleshow/126808435.cms",
            "description": "Persistent Systems posted steady Q3FY26 growth, with revenue up 17% YoY and PAT rising 18%. Sequential profitability moderated due to labour code impact, while demand for data, cloud, and digital engineering services remained robust.",
            "pubDate": "2026-01-20T14:52:45.098863"
        },
        {
            "title": "AU SFB Q3 Results: PAT jumps 26% YoY to Rs 668 crore, NII rises 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/au-sfb-q3-results-pat-jumps-26-yoy-to-rs-668-crore-nii-rises-16/articleshow/126807722.cms",
            "description": "AU Small Finance Bank reported strong Q3FY26 performance, with profit rising 26% and NII up 16%, supported by higher margins, loan and deposit growth, stable asset quality and improving unsecured portfolio trends, despite higher operating expenses and exceptional provisioning.",
            "pubDate": "2026-01-20T14:52:45.098972"
        },
        {
            "title": "ITC Hotels reports Q3 revenue of Rs 1,231 crore, PAT at Rs 237 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-hotels-reports-q3-revenue-of-rs-1231-crore-pat-at-rs-237-crore/articleshow/126797178.cms",
            "description": "ITC Hotels reported strong December-quarter performance with revenue rising 21% and profit increasing, driven by higher occupancy, improved room rates, robust weddings and MICE demand, strong F&B growth, and continued expansion, adding new hotels and expanding its nationwide portfolio.",
            "pubDate": "2026-01-20T14:52:45.099075"
        }
    ]
}