{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-23T00:42:59.111347",
    "items": [
        {
            "title": "Stock Radar: 30% rally in a month! Inox Green stock hits fresh record high; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-30-rally-in-a-month-inox-green-stock-hits-fresh-record-high-check-target-stop-loss/articleshow/124703086.cms",
            "description": "Inox Green Ltd stock has broken out from a year-long consolidation, reaching new record highs. Experts suggest buying opportunities for short-term traders with targets of Rs 290-300. The stock has shown significant rallies in recent weeks and months. Analysts see a strong uptrend and recommend buying on dips. A protective stop-loss is advised at Rs 242.",
            "pubDate": "2025-10-23T00:42:57.494936"
        },
        {
            "title": "Infosys promoters opt out of Rs 18,000 crore share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-promoters-opt-out-of-rs-18000-crore-share-buyback/articleshow/124750360.cms",
            "description": "Infosys promoters, including co-founders like Narayan Murthy and Nandan Nilekani, will not participate in the company's Rs 18,000 crore share buyback. This decision will lead to a slight increase in their shareholding percentage and could impact their voting rights. The buyback aims to return surplus funds to shareholders and enhance long-term value by reducing the equity base.",
            "pubDate": "2025-10-23T00:42:57.495063"
        },
        {
            "title": "Small finance banks seek doubling of cap on loan size to ₹50 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/small-finance-banks-seek-doubling-of-cap-on-loan-size-to-50-lakh/articleshow/124750325.cms",
            "description": "Small finance banks have approached the Reserve Bank of India with key requests. They want the regulator to ease a rule requiring half their loans to be under ₹25 lakh. They also seek permission to participate in co-lending arrangements. These changes aim to help SFBs expand their reach and serve more businesses, particularly MSMEs.",
            "pubDate": "2025-10-23T00:42:57.495273"
        }
    ]
}