{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-21T16:01:59.839126",
    "items": [
        {
            "title": "Q3 results today: Eternal among 59 companies to report earnings on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-eternal-among-59-companies-to-report-earnings-on-wednesday/articleshow/126910900.cms",
            "description": "Indian markets brace for a busy earnings day with 59 companies reporting Q3 results. Investors are keenly watching Eternal's expected strong revenue growth, driven by quick commerce expansion. Meanwhile, Dr. Reddy's Laboratories anticipates a muted quarter, primarily due to pressures in its US business offsetting gains elsewhere.",
            "pubDate": "2026-01-21T04:05:20.138325"
        },
        {
            "title": "J&K Bank stays on track; Q3 net profit rises 10.4% YoY despite Pahalgam attack and floods: MD & CEO Amitava Chatterjee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jk-bank-remains-firmly-on-track-despite-pahalgam-attack-and-floods-records-10-4-net-profit-yoy-in-q3-md-ceo-amitava-chatterjee-srinagar/articleshow/126927411.cms",
            "description": "Jammu and Kashmir Bank is on track for a fourth consecutive year of record profits, despite facing challenges like the Pahalgam attack and floods. The bank reported a 10.4% year-on-year rise in net profit to Rs 586.73 crore for the third quarter, driven by robust growth in advances and deposits, and improved asset quality.",
            "pubDate": "2026-01-21T04:52:37.913818"
        },
        {
            "title": "KPI Green Energy Q3 Results: Net profit grows 48% YoY to Rs 126 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kpi-green-energy-q3-results-net-profit-grows-48-yoy-to-rs-126-cr/articleshow/126941459.cms",
            "description": "KPI Green Energy reported a significant 48% surge in its consolidated net profit, reaching Rs 125.80 crore for the December quarter of 2025, driven by robust revenue growth. Total income climbed to Rs 676.05 crore. The company also announced a third interim dividend of 0.20 paisa per equity share for FY 2025-26.",
            "pubDate": "2026-01-21T06:42:38.138472"
        },
        {
            "title": "Tata Communications Q3 Results: Cons PAT jumps 55% YoY to Rs 365 crore, revenue up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-communications-q3-results-cons-pat-jumps-55-yoy-to-rs-365-crore-revenue-up-7/articleshow/126963798.cms",
            "description": "Tata Communications posted strong Q3FY26 results with profit up 55% year on year and revenues rising 7%. Sequential profits doubled, data revenues grew 9.3%, margins improved, and management highlighted data-led growth momentum and a robust order book for future expansion.",
            "pubDate": "2026-01-21T09:49:09.500391"
        },
        {
            "title": "Eternal Q3 Results: PAT zooms 73% YoY to Rs 102 crore; Deepinder Goyal steps down as CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-q3-results-pat-zooms-73-yoy-to-rs-102-crore-deepinder-goyal-steps-down-as-ceo/articleshow/126970813.cms",
            "description": "Eternal Q3 Results: Albinder Singh Dhindsa, currently CEO of Blinkit, will take over as the company’s new Chief Executive Officer.",
            "pubDate": "2026-01-21T10:39:19.677384"
        },
        {
            "title": "Eternal Q3 Results: 10 key takeaways from earnings, competition to business outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eternal-q3-results-10-key-takeaways-from-earnings-competition-to-business-outlook/articleshow/126980884.cms",
            "description": "Eternal posted robust Q3 results, led by Zomato’s accelerating food delivery growth and Blinkit and Hyperpure turning EBITDA positive, even as profitability and revenue surged. The quarter also marked a leadership change, with Deepinder Goyal stepping aside for Albinder Dhindsa.",
            "pubDate": "2026-01-21T11:55:51.965277"
        },
        {
            "title": "Dr Reddy's Q3 Results: Profit falls 14% YoY to Rs 1,210 crore, revenue up 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dr-reddys-q3-results-profit-falls-14-yoy-to-rs-1210-crore-revenue-up-4/articleshow/126979480.cms",
            "description": "The company saw a YoY drop in profit even as revenues grew marginally in the quarter under review.",
            "pubDate": "2026-01-21T11:55:51.965423"
        },
        {
            "title": "Dhanlaxmi Bank Q3 profit rises 20% YoY to Rs 24 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/dhanlaxmi-bank-q3-profit-rises-20-yoy-to-rs-24-crore/articleshow/126985383.cms",
            "description": "Dhanlaxmi Bank posted a 20% YoY rise in Q3 net profit to Rs 24 crore despite higher provisions. Total income grew 21%, while pre-provision operating profit jumped 52% to Rs 41 crore. Asset quality improved with gross NPAs falling to 2.36%. Shares closed 1.7% lower at Rs 24.50.",
            "pubDate": "2026-01-21T12:37:12.105803"
        },
        {
            "title": "IndiGo Q3 Preview: Revenue growth steady, profits seen under pressure as yields soften",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-q3-preview-revenue-growth-steady-profits-seen-under-pressure-as-yields-soften/articleshow/126984987.cms",
            "description": "IndiGo is expected to report a mixed set of numbers for the December quarter, with brokerages pencilling in steady revenue growth but a year-on-year decline in profitability as yields soften and cost pressures remain elevated.",
            "pubDate": "2026-01-21T12:37:12.105963"
        },
        {
            "title": "MakeMyTrip Q3 adjusted net profit up 14% at $51.4 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/makemytrip-q3-adjusted-net-profit-up-14-at-51-4-million/articleshow/126995935.cms",
            "description": "Nasdaq-listed online travel service provider, MakeMyTrip Ltd on Wednesday reported a 14.47 per cent rise in adjusted net profit to USD 51.4 million in the third quarter ended December 2025.",
            "pubDate": "2026-01-21T14:40:42.275689"
        },
        {
            "title": "Jindal Stainless Q3 Results: Profit grows 26% to Rs 828 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jindal-stainless-q3-results-profit-grows-26-to-rs-828-crore/articleshow/126995240.cms",
            "description": "Jindal Stainless on Wednesday posted 26 per cent year-on-year growth in consolidated net profit to Rs 828 crore in December quarter FY26, driven by increased sales.",
            "pubDate": "2026-01-21T14:40:42.275804"
        },
        {
            "title": "HPCL Q3 Results: Cons PAT soars 58% YoY to Rs 4,011 crore, revenue up 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hpcl-q3-results-cons-pat-soars-58-yoy-to-rs-4011-crore-revenue-up-5/articleshow/126990247.cms",
            "description": "HPCL reported a sharp rise in Q3 profit on stronger refining margins, higher crude throughput and steady fuel sales growth. Revenue also increased sequentially, supported by record refinery utilisation and network expansion across retail outlets and LPG distribution.",
            "pubDate": "2026-01-21T14:40:42.275902"
        },
        {
            "title": "MMT Q3 net profit at $7.3 million, operating revenue at $295.7 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mmt-q3-net-profit-at-7-3-million-operating-revenue-at-295-7-million/articleshow/127011818.cms",
            "description": "MakeMyTrip’s Q3 net profit fell 73% to $7.3 million as finance costs surged after its capital raise, even as revenues, operating profit and hotel bookings grew, aided by portfolio diversification and AI-led efficiency initiatives despite slower domestic air travel growth.",
            "pubDate": "2026-01-21T16:01:59.302178"
        }
    ]
}