{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-15T09:55:00.749492",
    "items": [
        {
            "title": "Q1 results trigger selloff in NSDL shares. Rs 1,150 could be last line of defence",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q1-results-trigger-selloff-in-nsdl-shares-rs-1150-could-be-last-line-of-defence/articleshow/123318476.cms",
            "description": "NSDL shares have declined following its Q1 results, despite a rise in net profit and strong margins. Revenue drop and valuation concerns triggered profit-taking, with analysts noting crucial support levels. Technical indicators suggest potential for further consolidation, advising caution despite long-term growth prospects.",
            "pubDate": "2025-08-15T07:24:49.489633"
        },
        {
            "title": "5 stocks Warren Buffett has invested in so far this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-stocks-warren-buffett-has-invested-in-so-far-this-year/slideshow/123318221.cms",
            "description": "Warren Buffett, chairman and CEO of Berkshire Hathaway, remains one of the most influential investors of the past half-century, famous for spotting quality companies at the right price. While he has been a net seller of stocks in recent years, 2025 has seen him deploy billions into select opportunities he deems worthy of a long-term hold. Here are the five stocks Buffett has added to his portfolio so far this year.",
            "pubDate": "2025-08-15T07:24:49.489750"
        },
        {
            "title": "Independence Day Special: 10 Smallcap stocks that doubled investors’ wealth in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/independence-day-special-10-smallcap-stocks-that-doubled-investors-wealth-in-a-year/slideshow/123318054.cms",
            "description": "As India marks its 79th Independence Day on August 15, 2025, smallcap stocks tell a striking story. Over the past year, 21 smallcaps more than doubled investor wealth, delivering returns above 100% despite market volatility.All 21 stocks have FII backing, highlighting growing overseas interest, while strong retail participation signals domestic confidence. Notable performers include CarTrade Tech, Force Motors, Paradeep Phosphates, and Godfrey Phillips India.This report spotlights the top 10 smallcaps, each rising 130%–330% in a year, far outpacing the BSE Sensex’s 2% gain, while the BSE Smallcap Index slipped 2.2%. (Data: ACE Equity)",
            "pubDate": "2025-08-15T07:24:49.489855"
        },
        {
            "title": "M&M outpaces industry with 10.5% Q1 growth, gains market share across segments, says Siddhartha Khemka",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-outpaces-industry-with-10-5-q1-growth-gains-market-share-across-segments-says-siddhartha-khemka/articleshow/123317423.cms",
            "description": "M&M outpaced India’s tractor industry with 10.5% Q1FY26 volume growth, expanding market share to 45.2% across all HP segments. Strong demand in 41–50HP tractors, regional gains in East and West India, and a robust product pipeline position the company for sustained growth through FY27.",
            "pubDate": "2025-08-15T07:24:49.489950"
        },
        {
            "title": "Freedom from Volatility: Why patience could be investors greatest edge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/freedom-from-volatility-why-patience-could-be-investors-greatest-edge/articleshow/123317081.cms",
            "description": "Market volatility can be unsettling, but patience is an investor’s greatest ally. By staying invested, embracing long-term horizons, diversifying, and reinvesting returns, investors can harness compounding, ride out downturns, and build wealth over time—proving that time in the market beats timing it.",
            "pubDate": "2025-08-15T07:24:49.490041"
        },
        {
            "title": "Australian shares cross 8,900 level for first time, banks do the heavy lifting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-cross-8900-level-for-first-time-banks-do-the-heavy-lifting/articleshow/123316976.cms",
            "description": "Australian shares crossed the key 8,900 level for the first time on Friday, buoyed by gains in major banks as investors piled into financials despite stretched valuations on hopes that rate cuts would spur credit and economic growth.",
            "pubDate": "2025-08-15T07:24:49.490129"
        },
        {
            "title": "HDFC Bank among Axis Securities’ top 15 large, mid, smallcap ideas with up to 28% upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-among-axis-securities-top-15-large-mid-smallcap-ideas-with-up-to-28-upside-potential/slideshow/123316737.cms",
            "description": "This week, the market ended on a positive note after a six-week losing streak, supported by robust DII inflows that offset persistent FII selling. Benign domestic inflation, at an eight-year low, fueled optimism for a revival in discretionary spending. On the earnings front, Nifty50 Q1FY26 results were in line with market expectations, although the recovery in urban demand remains subdued.Global cues also contributed to the positive sentiment, with softer US inflation data and a drop in the US 10-year bond yield reinforcing expectations of a Fed rate cut in the September policy meeting. In the near term, stock-specific action is likely to continue, with a focus on domestic consumption-led sectors to counter volatility. Geopolitical events, particularly the upcoming Trump–Putin meeting, may also act as catalysts for market sentiment. In this context, Axis Securities has highlighted the following stock picks for a horizon of over one year",
            "pubDate": "2025-08-15T07:24:49.490217"
        },
        {
            "title": "The Tricolor Portfolio: Equity for growth, debt for stability, hybrid for balance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-tricolor-portfolio-equity-for-growth-debt-for-stability-hybrid-for-balance/articleshow/123316587.cms",
            "description": "The “Tricolor Portfolio” approach aligns equity for growth, debt for stability, and hybrid funds for balance, creating a resilient, diversified investment strategy. This blend helps investors pursue long-term wealth creation while cushioning risks, adapting to market shifts, and achieving financial freedom.",
            "pubDate": "2025-08-15T07:24:49.490304"
        },
        {
            "title": "Asian stocks trade mixed ahead of US-Russia summit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-trade-mixed-ahead-of-us-russia-summit/articleshow/123316280.cms",
            "description": "Asian stocks were mixed Friday after better-than-expected Japanese growth and weak Chinese data, while oil slipped back ahead of a US-Russia summit on Ukraine.",
            "pubDate": "2025-08-15T07:24:49.490394"
        },
        {
            "title": "Wall Street stocks ease, US yields rise after hot inflation data shakes confidence in Fed rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-stocks-ease-us-yields-rise-after-hot-inflation-data-shakes-confidence-in-fed-rate-cut/articleshow/123315459.cms",
            "description": "Global stocks experienced a slight downturn as U.S. Treasury yields increased following unexpectedly strong inflation data, which tempered expectations for aggressive Federal Reserve rate cuts. While the S&P 500 achieved a new closing high, the Dow and Nasdaq remained relatively unchanged. Investors are closely monitoring inflation signals amidst concerns about a slowing economy and potential stagflation.",
            "pubDate": "2025-08-15T07:24:49.490532"
        },
        {
            "title": "Japan's Nikkei rises as yen weakens, economy shows resilience",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-as-yen-weakens-economy-shows-resilience/articleshow/123315422.cms",
            "description": "Japan's Nikkei achieved a record high this week, closing with a 0.46% gain on Friday, fueled by a weaker yen and surprisingly resilient economic data showing 1% growth in the April-June quarter. Financial shares surged following rising U.S. Treasury yields and comments suggesting potential interest rate hikes by the Bank of Japan, with banks leading the gains.",
            "pubDate": "2025-08-15T07:24:49.490626"
        },
        {
            "title": "Asian markets stumble as hot PPI print reins in Fed rate cut hype",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-markets-stumble-as-hot-ppi-print-reins-in-fed-rate-cut-hype/articleshow/123315384.cms",
            "description": "Asian stocks experienced a mixed recovery as higher-than-expected U.S. producer price inflation tempered expectations for aggressive Federal Reserve rate cuts. U.S. bond yields and equity futures stabilized amidst these concerns. The Nikkei 225 rebounded following positive Japanese GDP data, while investors awaited a U.S.-Russia meeting in Alaska, influencing commodity markets.",
            "pubDate": "2025-08-15T07:24:49.490714"
        },
        {
            "title": "Independence Day 2025 Stock Market Holiday: Are NSE, BSE open or closed today on 15th August? Check now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-2025-are-nse-bse-open-or-closed-today-for-independence-day-2025-check-now/articleshow/123306996.cms",
            "description": "India Independence Day 2025: Indian stock and commodity exchanges including Bombay Stock Exchange, National Stock Exchange will remain closed on August 15, 2025, for Independence Day. Trading will halt across equity, derivatives, and commodity segments. Multi Commodity Exchange and National Commodity & Derivatives Exchange will also suspend trading. Markets will resume on August 18, 2025.",
            "pubDate": "2025-08-15T07:24:49.490799"
        },
        {
            "title": "Corporate earnings slow to multi-quarter lows in Q1 as banking, consumer durables weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corporate-earnings-slow-to-multi-quarter-lows-in-q1-as-banking-consumer-durables-weigh/articleshow/123314592.cms",
            "description": "Indian companies experienced a slowdown in revenue and profit growth during the June quarter, hitting multi-quarter lows due to weak performance in banking, consumer durables, and capital goods sectors. While some sectors like cement and hospitality showed double-digit profit growth, overall operating margins contracted.",
            "pubDate": "2025-08-15T07:24:49.490896"
        },
        {
            "title": "India's sovereign rating upgrade may make borrowing overseas cheaper",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-sovereign-rating-upgrade-may-make-borrowing-overseas-cheaper/articleshow/123315006.cms",
            "description": "S&P's upgrade of India's sovereign credit rating to 'BBB' is projected to lower overseas borrowing costs for Indian companies and non-bank lenders. Top-rated firms could see savings of 10-20 basis points on external commercial borrowings, currently around 7.75%. This shift expands the global investor base for NBFCs, potentially leading to spread benefits of 15-40 basis points.",
            "pubDate": "2025-08-15T07:24:49.490985"
        },
        {
            "title": "Hindustan Zinc gears up for mega expansion; Eyes ₹65k cr revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-gears-up-for-mega-expansion-eyes-65k-cr-revenue/articleshow/123314793.cms",
            "description": "Hindustan Zinc Ltd. (HZL) aims for ₹62,000-65,000 crore in annual revenue by doubling its production capacity to 2 million tonnes. The Vedanta subsidiary anticipates an EBITDA of ₹34,000-36,000 crore and a production cost of $1,000 per tonne at this expanded capacity. Silver production is also expected to rise to 1,500 tonnes.",
            "pubDate": "2025-08-15T07:24:49.491071"
        },
        {
            "title": "Radhika Gupta hails move back to India as ‘best decision’ on Independence Day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/radhika-gupta-hails-move-back-to-india-as-best-decision-on-independence-day/articleshow/123320108.cms",
            "description": "Radhika Gupta, MD and CEO of Edelweiss Mutual Fund, celebrated India's Independence Day. She recalled her return to India in 2009. Despite warnings of lost opportunities in the US, she chose India. Gupta believed in India's potential for growth and impact. She expressed gratitude for the opportunities she received.",
            "pubDate": "2025-08-15T08:56:18.353753"
        },
        {
            "title": "European shares hit near five-month high on upbeat earnings season",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-hit-near-five-month-high-on-upbeat-earnings-season/articleshow/123319733.cms",
            "description": "European shares hit a near five-month high on Friday, as investors looked past a U.S. inflation spike and drew support from a largely positive earnings season.",
            "pubDate": "2025-08-15T08:56:18.353887"
        },
        {
            "title": "Logistics sector: Be tactical in the face of head & tailwinds; 6 logistics stocks with an upside potential of over 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/logistics-sector-be-tactical-in-the-face-of-head-tailwinds-6-logistics-stocks-with-an-upside-potential-of-over-30/articleshow/123319342.cms",
            "description": "Logistics is a large umbrella term. Under it you find everything from warehousing companies to goods transporters. In the listed space, however, it is transportation companies that dominate. This sector has seen many headwinds, both in terms of operations and structural challenges. Any sector which goes through such a phase tends to bring out clear winners. Yes, in the last couple of years, there have been clear winners in the space. But the sector is currently at a stage where more headwinds are likely, thanks to the short-term disruption due to the US tariffs. There are, however, two tailwinds as well. One needs to watch carefully who wins.",
            "pubDate": "2025-08-15T08:56:18.354095"
        },
        {
            "title": "Australian shares end stellar week at record high on earnings, rate-cut boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-end-stellar-week-at-record-high-on-earnings-rate-cut-boost/articleshow/123319145.cms",
            "description": "Australian shares closed at an all-time high on Friday, capping a week that delivered multiple record peaks after a central bank rate cut and a wave of strong corporate earnings boosted investor sentiment.",
            "pubDate": "2025-08-15T08:56:18.354193"
        },
        {
            "title": "RSB Retail India files DRHP with SEBI for IPO, plans to raise Rs 500 crore via fresh issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rsb-retail-india-files-drhp-with-sebi-for-ipo-plans-to-raise-rs-500-crore-via-fresh-issue/articleshow/123320707.cms",
            "description": "Hyderabad's RSB Retail India Ltd has filed for an IPO with SEBI, featuring a fresh issue of Rs 500 crore and an offer for sale of up to 2.98 crore shares. The retailer intends to use the funds to repay loans and establish new stores under its R. S. Brothers and South India Shopping Mall formats.",
            "pubDate": "2025-08-15T09:54:58.388466"
        },
        {
            "title": "Warren Buffett’s Berkshire takes $1.6 billion UnitedHealth stake, trims Apple, exits T-Mobile in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffetts-berkshire-takes-1-6-billion-unitedhealth-stake-trims-apple-exits-t-mobile-in-q2/articleshow/123320584.cms",
            "description": "Berkshire Hathaway made a surprising $1.6 billion investment in UnitedHealth Group during the second quarter, even as the insurer faced challenges. Simultaneously, the conglomerate reduced its holdings in Apple and Bank of America, while completely divesting from T-Mobile US. The company also initiated new positions in Nucor and Lennar, reflecting strategic portfolio adjustments.",
            "pubDate": "2025-08-15T09:54:58.388598"
        },
        {
            "title": "US tariff hit may cost India $35 billion. Here’s a 10-point plan to turn the tables",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-tariff-hit-may-cost-india-35-billion-heres-a-10-point-plan-to-turn-the-tables/articleshow/123320004.cms",
            "description": "US tariffs could slash India’s exports by $35 billion, hitting sectors like textiles, gems, and agriculture. A 10-point plan—spanning export diversification, infrastructure overhaul, tourism, tax reforms, and GCC expansion—offers a roadmap to boost foreign inflows, strengthen domestic growth, and turn adversity into opportunity.",
            "pubDate": "2025-08-15T09:54:58.388912"
        }
    ]
}