{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-14T03:59:39.957245",
    "items": [
        {
            "title": "Asian stocks fall as Fed rate cut doubts emerge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fall-as-fed-rate-cut-doubts-emerge/articleshow/125313478.cms",
            "description": "Asian markets opened lower on Friday. Investors are worried about the US Federal Reserve's interest rate decisions. High valuations in technology shares also caused concern. Wall Street saw significant drops on Thursday. The pound weakened after reports of a U-turn on tax increases. Investors are now closely watching upcoming economic data.",
            "pubDate": "2025-11-14T01:24:31.095811"
        },
        {
            "title": "Broking firms see profit slide as Sebi curbs hit trading volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/broking-firms-see-profit-slide-as-sebi-curbs-hit-trading-volumes/articleshow/125313287.cms",
            "description": "Broking firms experienced a profit and revenue decline in the September quarter due to reduced market volumes and Sebi's new regulations. Stricter margin norms and the 'true-to-label' circular impacted earnings, while intense competition and technology spending increased costs. Analysts suggest the sector remains under pressure, with future performance dependent on non-broking revenue streams and regulatory stability.",
            "pubDate": "2025-11-14T01:24:31.095962"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125304858.cms",
            "description": "Nifty closed flat on Thursday, with profit booking in the final hour capping gains after three consecutive sessions. Analysts remain optimistic about equities due to easing inflation, exporter policy support, and positive corporate earnings. Today's session may experience heightened volatility due to the Bihar election outcome.",
            "pubDate": "2025-11-14T01:24:31.096073"
        },
        {
            "title": "Stocks in news: Hero MotoCorp, LG India, Nippon Life India AMC, J&K Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hero-motocorp-tata-motors-pv-lg-india-nippon-life-india-amc-jk-bank/articleshow/125304793.cms",
            "description": "Indian markets saw volatile trading and ended flat on weekly expiry day. Analysts suggest consolidation may follow the recent rally. Key sectors like banking and IT remain strong. Investors are advised to focus on specific stocks in banking, auto, and metals. Several companies like Hero MotoCorp, Tata Motors, and Eicher Motors reported their second-quarter results.",
            "pubDate": "2025-11-14T01:24:31.096171"
        },
        {
            "title": "Asian Paints jumps 8% in two days on strong Q2 and rival CEO exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-jumps-8-in-two-days-on-strong-q2-and-rival-ceo-exit/articleshow/125313041.cms",
            "description": "Asian Paints stock surged over 8% in two trading sessions, driven by a strong second-quarter performance and the exit of a rival CEO. The company's net profit jumped 43%, exceeding expectations and prompting price target upgrades from analysts. Despite renewed investor interest, some analysts remain cautious about a sustained rally, citing capped upsides after the recent run-up.",
            "pubDate": "2025-11-14T01:24:31.096270"
        },
        {
            "title": "DWS to buy 40% in Nippon Life India AIF business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dws-to-buy-40-in-nippon-life-india-aif-business/articleshow/125312956.cms",
            "description": "German firm DWS Group is acquiring a 40% stake in Nippon Life India Asset Management's alternatives business. This partnership aims to expand operations in alternatives, active, and passive assets. The companies will also jointly launch passive products. A global distribution arrangement is planned for India-focused mutual funds. The alternatives sector in India is poised for significant growth.",
            "pubDate": "2025-11-14T01:24:31.096369"
        },
        {
            "title": "M&M to enter life insurance market via 50:50 JV with Manulife",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-to-enter-life-insurance-market-via-5050-jv-with-manulife/articleshow/125312786.cms",
            "description": "Mahindra & Mahindra is entering the life insurance sector through a 50:50 joint venture with Canada's Manulife, committing up to ₹3,600 crore each. Operations are expected to launch within 15-18 months of regulatory approval, with a focus on underpenetrated rural and semi-urban markets. The venture aims for break-even around the tenth year.",
            "pubDate": "2025-11-14T01:24:31.096464"
        },
        {
            "title": "Stock Radar: InterGlobe Aviation breaks out from a falling trendline resistance; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-interglobe-aviation-breaks-out-from-a-falling-trendline-resistance-what-should-investors-do/articleshow/125296461.cms",
            "description": "InterGlobe Aviation Ltd has broken out of a falling trendline resistance on daily charts, signaling potential upside. Experts suggest short-term traders can buy the stock for a target above Rs 6,000 in the next 2-3 weeks, citing strong price action and sector fundamentals.",
            "pubDate": "2025-11-14T01:24:31.096556"
        },
        {
            "title": "Aviom India Housing Finance promoter offers to settle dues as six entities put in bids",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aviom-india-housing-finance-promoter-offers-to-settle-dues-as-six-entities-put-in-bids/articleshow/125313133.cms",
            "description": "According to the proposal, there would be an upfront payment of Rs 350 crore while the accrued interest would be paid in 24 months after the initial 26 months of principal payment. Ilmi's plan also includes full repayment to operational creditors and employees amounting to Rs 2.9 crore. She has also suggested that lenders appoint a professional CEO to run the company during the proposed repayment period. The proposal recommends the appointment of five directors, including two lender nominees, and includes an indemnity agreement between the company and these directors.",
            "pubDate": "2025-11-14T01:24:31.096645"
        },
        {
            "title": "RBI has room to cut rates, can't predict timing: Economists",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-has-room-to-cut-rates-cant-predict-timing-economists/articleshow/125313320.cms",
            "description": "\"While the inflation trajectory is likely to remain benign, the RBI will need to filter the festive and GST-related demand from the cyclical recovery,\" said Upasna Bharadwaj, chief economist, Kotak Mahindra Bank. \"We remain skeptical on the sustainability of the recent pickup in economic activity and, hence, see some room for further monetary easing.\"",
            "pubDate": "2025-11-14T01:24:31.096739"
        },
        {
            "title": "Policy support key for Tata Steel UK: CFO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/policy-support-key-for-tata-steel-uk-cfo/articleshow/125313246.cms",
            "description": "While losses narrowed year-on-year in the UK operations in the September quarter, the performance trailed the management's guidance. Back in 2024, Tata had said these operations would turn profitable at an operating level in FY25. Tata Steel is working on slashing costs. It is also engaging with the British government on policy-related issues as imports in certain product segments are higher than even the total consumption in the country.",
            "pubDate": "2025-11-14T01:24:31.096833"
        },
        {
            "title": "ICICI Bank, Hindalco and 3 other stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-hindalco-and-3-other-stocks-showing-bullish-rsi-upswing/slideshow/125315989.cms",
            "description": "Five stocks in the NSE large-cap segment were highlighted in the RSI Trending Up scan on November 13, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-14T03:59:23.735125"
        },
        {
            "title": "PG Electroplast shares in focus as Q2 PAT nosedives 88% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pg-electroplast-shares-in-focus-as-q2-pat-nosedives-88-yoy/articleshow/125315832.cms",
            "description": "PG Electroplast share price:  PG Electroplast reported an 88% YoY decline in Q2 PAT to Rs 2.38 crore, while revenue fell 2.4% to Rs 655.37 crore. EBITDA dropped 26.2% to Rs 44.68 crore. Room AC sales were impacted by early monsoons and GST changes, while washing machines saw 46.9% growth.",
            "pubDate": "2025-11-14T03:59:23.735275"
        },
        {
            "title": "Sagility India shares in focus as promoters likely to sell up to 16% stake via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sagility-india-shares-in-focus-as-promoters-likely-to-sell-up-to-16-stake-via-block-deal/articleshow/125315782.cms",
            "description": "Sagility India is likely to see heightened activity on November 14 as promoters plan to sell up to 16.4% stake through block deals. The base offer includes a 10% stake sale, with a 6.4% green shoe option. According to media report, the floor price is set at Rs 46.4 per share, about 8% below the current market price.",
            "pubDate": "2025-11-14T03:59:23.735395"
        },
        {
            "title": "Adani Power shares in focus on LoA from Assam Power Distribution for long-term supply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-power-shares-in-focus-on-loa-from-assam-power-distribution-for-long-term-supply/articleshow/125315729.cms",
            "description": "Adani Power has won a major order from Assam Power Distribution Company Ltd to develop a 3,200 MW ultra-supercritical thermal power plant. APDCL will procure the full capacity, with phased commissioning starting December 2030. Morgan Stanley raised its target to Rs 185, citing robust growth, strong PPAs, regulatory clarity, and an expanded portfolio that positions APL for rising market share and earnings.",
            "pubDate": "2025-11-14T03:59:23.735496"
        },
        {
            "title": "Hero MotoCorp shares in focus as Q2 PAT rises 16% YoY to Rs 1,393 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-as-q2-pat-rises-16-yoy-to-rs-1393-crore/articleshow/125315670.cms",
            "description": "Hero MotoCorp share price: Hero MotoCorp reported a 16% YoY rise in Q2 net profit to Rs 1,393 crore, with revenue at Rs 12,126 crore. Vehicle volumes grew 11%, EBITDA rose 20%, and EV arm Vida achieved 11.7% market share, supported by strong festive season demand and international dispatch growth.",
            "pubDate": "2025-11-14T03:59:23.735593"
        },
        {
            "title": "Tata Motors (CV) shares in focus after reporting Rs 867 crore net loss in first quarterly results post listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-cv-shares-in-focus-after-reporting-rs-867-crore-net-loss-in-first-quarterly-results-post-listing/articleshow/125315439.cms",
            "description": "Tata Motors' commercial vehicle arm reported a Rs 867 crore net loss in Q2, a shift from last year's profit, despite a 6% revenue rise to Rs 18,585 crore. The loss stemmed from investment mark-to-market impacts. However, vehicle sales climbed 12%, with strong export growth, and operational efficiency improved.",
            "pubDate": "2025-11-14T03:59:23.735691"
        },
        {
            "title": "Eicher Motors shares in focus after Q2 PAT jumps 24% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eicher-motors-shares-in-focus-after-q2-pat-jumps-24-yoy/articleshow/125315383.cms",
            "description": "Eicher Motors' shares are poised for attention following a robust Q2 FY26 performance. The company reported a significant 24% year-on-year rise in consolidated net profit to Rs 1,369 crore, driven by a strong 45% revenue growth to Rs 6,172 crore. The commercial vehicle segment, particularly VECV, showed solid overall performance, with notable growth in heavy-duty trucks and exports.",
            "pubDate": "2025-11-14T03:59:23.735784"
        },
        {
            "title": "Last day to buy shares of these 5 companies to be eligible for interim dividends. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-these-5-companies-to-be-eligible-for-interim-dividends-do-you-own/articleshow/125315328.cms",
            "description": "Investors have a crucial deadline approaching to secure interim dividends from top companies. To be eligible for payouts from Balrampur Chini Mills, EPL Ltd, and others, shares must be bought by the close of trading today. The ex-dividend date is November 17, 2025. This means November 14 is the last chance to own these stocks and receive the declared dividends.",
            "pubDate": "2025-11-14T03:59:23.735875"
        },
        {
            "title": "Shining Tools IPO listing today. Here's what GMP indicates ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shining-tools-ipo-listing-today-heres-what-gmp-indicates-ahead-of-debut/articleshow/125315262.cms",
            "description": "Shining Tools' IPO closed with a modest 1.15 times subscription, indicating lukewarm investor interest. The company, a manufacturer of solid carbide cutting tools, is set to debut on the BSE SME platform with a flat grey market premium, suggesting a listing near its issue price of Rs 114. Proceeds will fund expansion and working capital.",
            "pubDate": "2025-11-14T03:59:23.735966"
        },
        {
            "title": "Curis Lifesciences IPO to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/curis-lifesciences-ipo-to-list-today-check-gmp-ahead-of-debut/articleshow/125315119.cms",
            "description": "Curis Lifesciences is set to list on the NSE SME platform on November 14, following an IPO that saw overwhelming investor response, subscribing 74.39 times. The company, which manufactures pharmaceutical formulations, reported strong financial growth in FY25. IPO proceeds will fund facility upgrades, working capital, and market expansion.",
            "pubDate": "2025-11-14T03:59:23.736056"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Ashok Leyland, Triveni Turbine among 5 stocks that could give 10-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-ashok-leyland-triveni-turbine-among-5-stocks-that-could-give-10-30-return/slideshow/125314963.cms",
            "description": "Brokerages have turned selectively positive across several mid- and large-cap names, highlighting improving fundamentals and valuation comfort.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-14T03:59:23.736144"
        },
        {
            "title": "Negative Breakout: These 10 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-10-stocks-cross-below-their-200-dmas/slideshow/125314827.cms",
            "description": "In the Nifty500 pack, 10 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on November 13, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-11-14T03:59:23.736239"
        },
        {
            "title": "Wall Street sinks as investors fret about rate cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-sinks-as-investors-fret-about-rate-cuts/articleshow/125313895.cms",
            "description": "Wall Street experienced significant declines on Thursday, driven by steep losses in AI heavyweights like Nvidia. Investors scaled back expectations of interest rate cuts due to inflation concerns and differing views among central bankers on the U.S. economy's health. This sentiment led to a market rotation away from technology stocks.",
            "pubDate": "2025-11-14T03:59:23.736346"
        },
        {
            "title": "Panic or cheer? Three possible Nifty reactions on volatile Bihar election results day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/panic-or-cheer-three-possible-nifty-reactions-on-volatile-bihar-election-results-day/articleshow/125305561.cms",
            "description": "As Bihar election counting commences, Dalal Street braces for volatility, anticipating three scenarios: NDA win, hung assembly, or opposition upset. While a comfortable NDA victory signals policy stability and a mild rally, a closer contest or defeat could trigger short-term swings. However, the broader market trend is expected to remain intact, driven by macro factors.",
            "pubDate": "2025-11-14T03:59:23.736438"
        }
    ]
}