{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-05T17:09:10.448627",
    "items": [
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/120905932.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-05-05T17:08:52.498638"
        },
        {
            "title": "Technical Trades for Today: A consumption major for over 4% upmove, a mid-cap IT solutions stock for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-trades-for-today-a-consumption-major-for-over-4-upmove-a-mid-cap-it-solutions-stock-for-almost-7-rise/articleshow/120905810.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-05-05T17:08:52.498763"
        },
        {
            "title": "Market Trading Guide: MGL, NTPC are among 5 stock recommendations for Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-mgl-ntpc-are-among-5-stock-recommendations-for-tuesday/slideshow/120904912.cms",
            "description": "Indian headline indices ended with gains on Monday, led by auto, FMCG and metal stocks. While the BSE Sensex gained by 294.85 points or 0.37% to close at 80,796.84, the broader Nifty was up by 114.45 points or 0.47% to end the day at 24,461.15.Commenting on the day's action, Vatsal Bhuva, Technical Analyst at LKP Securities said that Nifty is holding above its rising 10-day EMA, reflecting a positive near-term trend. \"The Nifty index continues to trade within a narrow range of 24,200 to 25,500, with firm support at the 24,200–24,250 zone and resistance around 24,500–24,550. While a decisive breakout above 24,550 could spark bullish momentum towards 25,000, Monday’s small-bodied candlestick suggests that short-term consolidation may persist. With the RSI in a bullish crossover, underlying strength remains intact. The outlook stays bullish as long as Nifty sustains above 24,200, though a strong close above 24,550 is essential for confirmation,\" he said.Here are 5 stock recommendations for Tuesday:",
            "pubDate": "2025-05-05T17:08:52.498871"
        },
        {
            "title": "Footwear maker Skechers shares jump 25% on 3G Capital's $9 billion buyout deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/footwear-maker-skechers-shares-jump-25-on-3g-capitals-9-42-billion-buyout-deal-plans/articleshow/120905584.cms",
            "description": "Skechers is set to be acquired by 3G Capital for $9.42 billion, marking the footwear industry's largest buyout amidst tariff challenges. 3G Capital offered $63 per share, a 28% premium, after Skechers faced setbacks due to U.S. tariffs on Chinese goods.",
            "pubDate": "2025-05-05T17:08:52.498989"
        },
        {
            "title": "S&P 500, Nasdaq slip after Trump's fresh tariffs at start of Fed-decision week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-slip-after-trumps-fresh-tariffs-at-start-of-fed-decision-week/articleshow/120905512.cms",
            "description": "U.S. stocks experienced a mixed trading day as President Trump's new tariffs reignited trade war anxieties, overshadowing anticipation for the Federal Reserve's upcoming policy decision. Energy stocks declined, while financial stocks saw gains, impacting major indexes. Investors are closely watching for signals on monetary easing amid tariff uncertainties, with company earnings under scrutiny for their response to these trade pressures.",
            "pubDate": "2025-05-05T17:08:52.499097"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/120905016.cms",
            "description": "The Indian stock market ended higher on Monday, supported by advances in heavyweights HDFC Bank and Reliance Industries Ltd (RIL), as easing global trade tensions, steady foreign inflows, and a decline in crude oil prices fuelled investor sentiment.",
            "pubDate": "2025-05-05T17:08:52.499198"
        },
        {
            "title": "Blockbuster blow: Netflix, Disney, Warner Bros shares fall up to 5% amid Trump's tariff bomb scare",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blockbuster-blow-netflix-disney-warner-bros-shares-fall-up-to-5-amid-trumps-tariff-bomb-scare/articleshow/120904250.cms",
            "description": "Netflix, Disney, and Warner Bros. shares dropped after Donald Trump threatened 100% tariffs on foreign films. The move could impact global film markets, including Indian cinema, especially box office performance in the U.S.",
            "pubDate": "2025-05-05T17:08:52.499292"
        },
        {
            "title": "Two Sharp with ET: Is Shell plotting a BP takeover? Will Fed blink this week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-is-shell-plotting-a-bp-takeover-will-fed-blink-this-week/videoshow/120903140.cms",
            "description": "In this episode of Two Sharp, Nisha Poddar breaks down two global shifts: Shell quietly explores a potential BP takeover as oil prices slide and activist pressure mounts. Meanwhile, the US Fed is expected to hold rates steady this week — but Trump’s new tariffs could complicate that call. What’s next for Big Oil and interest rates? Tune in.",
            "pubDate": "2025-05-05T17:08:52.499386"
        },
        {
            "title": "Housing finance firms to raise up to Rs 12,000 crore via RMBS in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/housing-finance-firms-to-raise-up-to-rs-12000-crore-via-rmbs-in-fy26/articleshow/120902982.cms",
            "description": "Housing finance companies plan to raise ₹10,000–12,000 crore in FY26 via listed RMBS deals structured by RDCL. LIC Housing led with India’s first such ₹1,000 crore issuance, ensuring price discovery and lower borrowing costs.",
            "pubDate": "2025-05-05T17:08:52.499484"
        },
        {
            "title": "US stocks open lower after Trump's fresh tariffs; Fed meet on tap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-after-trumps-fresh-tariffs-fed-meet-on-tap/articleshow/120902943.cms",
            "description": "Wall Street's main indexes opened lower on Monday after President Donald Trump rekindled worries about the ramifications of a global trade war by introducing new tariffs, while focus remained on the Fed's monetary policy decision later this week.",
            "pubDate": "2025-05-05T17:08:52.499583"
        },
        {
            "title": "Unity Small Finance Bank Q4 Results: Profit surges 83% to Rs 264 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unity-small-finance-bank-q4-results-profit-surges-83-to-rs-264-crore/articleshow/120902334.cms",
            "description": "Unity Small Finance Bank: Unity Small Finance Bank reported an 83% YoY jump in Q4 profit to ₹264 crore, driven by strong growth in income, AUM, and deposits, despite microfinance headwinds. The bank aims to boost secured lending and expand its branch network.",
            "pubDate": "2025-05-05T17:08:52.499675"
        },
        {
            "title": "A bigger and cleaner play on economic recovery: 10 logistics stocks with an upside potential of more than 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-bigger-and-cleaner-play-on-economic-recovery-10-logistics-stocks-with-an-upside-potential-of-more-than-43/articleshow/120901062.cms",
            "description": "At this point of time, everyone is talking about the slowing economy. A smart investor on the street, however, will be thinking of what to do when recovery begins. Why? Because, by the time everyone starts talking about a recovery, stock prices would have already moved ahead. Logistics is a sector which is a direct play on the economic growth of a country. The reason: If the economy is doing well, more goods will be produced and they will have to be transported. And that is why, in large and developed economies, logistics companies form part of a very important Transportation Index.",
            "pubDate": "2025-05-05T17:08:52.499766"
        },
        {
            "title": "Bold leap: Gold rises by Rs 2,000/10 gram as Fed buzz on rate cut grows. Is it time to sell on shine?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bold-leap-gold-rises-by-rs-2000/10-gram-as-fed-buzz-on-rate-cut-grows-is-it-time-to-sell-on-shine/articleshow/120900322.cms",
            "description": "Gold prices surged over ₹2,000 per 10 grams on the MCX ahead of the US Fed meeting, driven by rate cut expectations and a weaker dollar index. Bond yields below Fed rates further supported the rally. Analysts expect short-term volatility within ₹93,000–₹96,000, with some calling it a profit-booking opportunity.",
            "pubDate": "2025-05-05T17:08:52.499855"
        },
        {
            "title": "Breakout Stocks: How to trade ICICI Bank, Navin Fluorine & Godfrey Phillips that hit fresh 52-week high?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-icici-bank-navin-fluorine-amp-godfrey-phillips-that-hit-fresh-52-week-high/slideshow/120900156.cms",
            "description": "Indian market closed in the green for the second consecutive day in a row on Monday tracking positive global cues.",
            "pubDate": "2025-05-05T17:08:52.499961"
        },
        {
            "title": "Meet Greg Abel: Warren Buffett’s Chosen Successor at Berkshire Hathaway",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meet-greg-abel-warren-buffetts-chosen-successor-at-berkshire-hathaway/videoshow/120899423.cms",
            "description": "After over 60 years at the helm, the Oracle of Omaha is preparing to pass the torch. Warren Buffett has announced he will step down as CEO of Berkshire Hathaway at the end of 2025. This marks the end of a remarkable era and the beginning of a carefully planned leadership transition.",
            "pubDate": "2025-05-05T17:08:52.500058"
        },
        {
            "title": "Stock Radar: Maruti Suzuki stock likely to hit fresh highs; stock is down by about 10% from August 2024 highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-maruti-suzuki-stock-likely-to-hit-fresh-highs-stock-is-down-by-about-10-from-august-2024-highs/articleshow/120824190.cms",
            "description": "Maruti Suzuki India's stock is showing positive momentum. It bounced back in April 2025 after finding support. Experts suggest buying the stock with targets of Rs 13,500-13,800. The stock is trading above key moving averages. Technical indicators suggest a bullish outlook. Analysts recommend considering a long position with a stop-loss at Rs 11,400.",
            "pubDate": "2025-05-05T17:08:52.500152"
        }
    ]
}