{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-03T13:57:11.617491",
    "items": [
        {
            "title": "Tata Consumer Products Q2 Results: Cons PAT rises 11% YoY to Rs 404 crore; revenue jumps 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-products-q2-results-cons-pat-rises-11-yoy-to-rs-404-crore-revenue-jumps-18/articleshow/125050095.cms",
            "description": "Tata Consumer Products Q2 Results:  Revenue from operations rose to Rs 4,966 crore from Rs 4,214 crore in the year-ago period.",
            "pubDate": "2025-11-03T07:51:45.828980"
        },
        {
            "title": "M&M Q2 Preview: Double-digit revenue growth up to 25% YoY seen on healthy volumes; weak ASP may hit profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mm-q2-preview-double-digit-revenue-growth-up-to-25-yoy-seen-on-healthy-volumes-weak-asp-may-hit-profits/articleshow/125047412.cms",
            "description": "Mahindra & Mahindra is expected to post steady Q2 results with double-digit revenue growth led by strong auto and tractor volumes. However, weaker average selling prices and an unfavourable product mix may weigh on margins and profitability, according to brokerage estimates.",
            "pubDate": "2025-11-03T07:51:45.829123"
        },
        {
            "title": "AWL Agri Business Q2 result: Net profit declines 21% YoY, revenue up 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/awl-agri-business-q2-result-net-profit-declines-21-yoy-revenue-up-22/articleshow/125050374.cms",
            "description": "AWL Agri Business, formerly Adani Wilmar, announced its second quarter results. Net profit saw a year-on-year decline of 21.3 percent. However, revenue from operations increased by 21.8 percent. The company also revealed senior management transitions. These changes include new appointments to key leadership roles. The stock experienced a dip following the announcement.",
            "pubDate": "2025-11-03T07:59:09.561634"
        },
        {
            "title": "Ambuja Cements Q2 Results: Cons profit skyrockets 268% YoY to Rs 1,766 crore, revenue rises 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ambuja-cements-q2-results-cons-profit-rockets-268-yoy-to-rs-1766-crore-revenue-rises-25/articleshow/125050667.cms",
            "description": "Ambuja Cements Q2 Results:  Adani Group-owned Ambuja Cements on Monday reported a 268% growth in its consolidated Q2 net profit at Rs 1,766 crore versus Rs 479 crore in the year-ago period. The profit after tax (PAT) is attributable to the owners of the company.",
            "pubDate": "2025-11-03T09:29:06.280575"
        },
        {
            "title": "Bharti Airtel Q2 Results: Cons profit soars 89% YoY to Rs 6,792 crore, revenue surges 26%; ARPU at Rs 256",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bharti-airtel-q2-results-cons-pat-soars-89-yoy-to-rs-6792-crore-revenue-surges-26-arpu-at-rs-256/articleshow/125056187.cms",
            "description": "Bharti Airtel Q2 Results: Telcom major Bharti Airtel on Monday reported a 89% YoY growth in its consolidated Q2 net profit at Rs 6,792 crore versus Rs 3,593 crore in the year ago period. The profit after tax (PAT) is attributable to the owners of the parent.",
            "pubDate": "2025-11-03T11:16:58.989246"
        },
        {
            "title": "Gland Pharma Q2 Results: Profit rises 12% to Rs 184 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gland-pharma-q2-results-profit-rises-12-to-rs-184-crore/articleshow/125060972.cms",
            "description": "Gland Pharma on Monday reported 12 per cent year-on-year increase in profit after tax (PAT) at Rs 184 crore for the September quarter, aided by strong performance by CDMO arm Cenexi.",
            "pubDate": "2025-11-03T13:57:04.663442"
        },
        {
            "title": "Titan Q2 Results: Profit soars 59% YoY to Rs 1,120 crore, sales up 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titan-q2-results-profit-soars-59-yoy-to-rs-1120-crore-on-festive-festive-demand/articleshow/125059894.cms",
            "description": "Titan Q2 Results: Titan Company reported a robust 59% YoY net profit growth to Rs 1120 crore in Q2, driven by a strong festive season tailwind, especially in its jewellery division. Sales surged 22% YoY to Rs 16,461 crore, with the jewellery segment alone growing 21% to Rs 14,092 crore, bolstered by increased demand and an improved product mix.",
            "pubDate": "2025-11-03T13:57:04.663554"
        },
        {
            "title": "Wockhardt Q2 Results: Co swings to profit at Rs 82 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wockhardt-q2-results-co-swings-to-profit-at-rs-82-crore/articleshow/125059648.cms",
            "description": "Drug firm Wockhardt on Monday reported a consolidated profit after tax of Rs 82 crore for the second quarter ended September 30, 2025.",
            "pubDate": "2025-11-03T13:57:04.663653"
        },
        {
            "title": "Bharti Airtel Q2 profit surges 89% to Rs 6,792 crore on ARPU boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bharti-airtel-q2-profit-surges-89-to-rs-6792-crore-on-arpu-boost/articleshow/125059385.cms",
            "description": "Bharti Airtel’s Q2 net profit soared 83% YoY to ₹6,791.6 crore, driven by higher ARPU, premiumisation, and robust growth in India and Africa operations, surpassing analyst expectations. Consolidated revenue rose 25.7% YoY to ₹52,145 crore.",
            "pubDate": "2025-11-03T13:57:04.663750"
        },
        {
            "title": "SBI Q2 Preview: PAT may slip up to 17% YoY, NII to likely drop by up to 2.7%. 8 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-q2-preview-pat-may-slip-up-to-17-yoy-nii-to-likely-drop-by-up-to-2-7-8-things-to-watch-out-for/articleshow/125058510.cms",
            "description": "State Bank of India is expected to post muted Q2FY26 results, with profit estimated between ₹17,700–₹18,800 crore, down up to 17% YoY. Strong loan growth may be offset by margin compression, weak treasury income, and lower operating profit.",
            "pubDate": "2025-11-03T13:57:04.663851"
        },
        {
            "title": "Square Yards Q2 profit surges on 43% revenue growth, fintech leads momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/square-yards-q2-profit-surges-on-43-revenue-growth-fintech-leads-momentum/articleshow/125057907.cms",
            "description": "Square Yards reported a 43% YoY revenue jump to ₹455.5 crore in Q2FY26, driven by fintech-led India operations and a 75% surge in transaction value. The firm turned profitable with ₹23 crore EBITDA for H1 and improved margins from scale and tech efficiencies.",
            "pubDate": "2025-11-03T13:57:04.663942"
        }
    ]
}