{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-09T02:12:15.103751",
    "items": [
        {
            "title": "F&O Ban List: SAIL, GNFC among 10 stocks under trade ban on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-ban-list-sail-gnfc-among-10-stocks-under-trade-ban-on-wednesday/articleshow/114062353.cms",
            "description": "Ten stocks, including Bandhan Bank, Birlasoft, and PNB, are banned from F&O trading due to high open interest exceeding 95% of the market-wide position limits. The ban is reversed if open interest drops below 80%. Indian indices rebounded driven by HDFC Bank and Reliance Industries ahead of RBI policy decisions.",
            "pubDate": "2024-10-09T02:10:59.534848"
        },
        {
            "title": "Big movers on D-Street: What should investors do with Trent, Sobha and SpiceJet?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-street-what-should-investors-do-with-trent-sobha-and-spicejet/articleshow/114062299.cms",
            "description": "Sensex and Nifty recovered after a six-day slump with major gains in Trent, Sobha, and SpiceJet. Trent's stock shows potential for further upside, Sobha is seen as a good long-term buy, while SpiceJet is recommended to be avoided due to low trading volumes.",
            "pubDate": "2024-10-09T02:10:59.534966"
        },
        {
            "title": "Being bullish is not a weakness, just learn to tackle volatility: 7 mid-cap stocks from different sectors with an upside potential of up to 37%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/being-bullish-is-not-a-weakness-just-learn-to-tackle-volatility-7-mid-cap-stocks-from-different-sectors-with-an-upside-potential-of-up-to-37/articleshow/114062113.cms",
            "description": "After last week’s sharp correction, the street is bound to grapple with its own fears and anxieties. Will the correction spill over to the mid-caps? Will it continue, both in terms of price cuts and time? There is a likelihood that as the Q2 season kicks off,  the mid-cap segment will witness some profit-booking/rational shifting/consolidation. Many sub-segments may be formed in this space – and given the mix of head and tailwinds, this segmentation is likely to remain till there is clarity on how China emerges. So, if you are putting in fresh money, be selective and focus on managing risks. Hedge for the short term, and think from a long-term perspective.",
            "pubDate": "2024-10-09T02:10:59.535072"
        },
        {
            "title": "Wall Street ends higher on tech buying as investors wait on inflation data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-on-tech-buying-as-investors-wait-on-inflation-data/articleshow/114062220.cms",
            "description": "Wall Street's benchmarks saw a rebound driven by tech stocks as investors eyed upcoming inflation data and third-quarter earnings. Lower Treasury yields favored high-growth tech companies. Major indexes like the S&P 500, Nasdaq, and Dow Jones showed gains. Key indicators include the recent jobs report and anticipated CPI data for interest rate predictions.",
            "pubDate": "2024-10-09T02:10:59.535187"
        },
        {
            "title": "GIFT Nifty up 45 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/114061979.cms",
            "description": "A decisive move above 25,000 levels could possibly open the next upside resistance of 25,400-25,500 in the near term. Immediate support is at 24,700, said Nagaraj Shetti of HDFC Securities.",
            "pubDate": "2024-10-09T02:10:59.535288"
        },
        {
            "title": "Asian stocks advance after tech lifts Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-advance-after-tech-lifts-wall-street/articleshow/114061942.cms",
            "description": "Shares in Australia and Japan rose as did Hong Kong equity futures following sharp declines on Tuesday. US equity futures dropped after the S&P 500 rose 1% and the tech-heavy Nasdaq 100 advanced 1.6% Tuesday. Chipmakers were among the market leaders with Nvidia Corp. extending a five-day rally to 14%.",
            "pubDate": "2024-10-09T02:10:59.535387"
        },
        {
            "title": "Stocks in news: Adani Green, Infosys, Torrent Power, Dr Reddy's, JSW Infra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-adani-green-infosys-torrent-power-dr-reddys-jsw-infra/articleshow/114061889.cms",
            "description": "The IT services company expanded its four year collaboration with Old National Bank to accelerate the Bank’s operational and technological transformation.",
            "pubDate": "2024-10-09T02:10:59.535485"
        },
        {
            "title": "Parliamentary Finance Panel calls Sebi, other regulators",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/parliamentary-finance-panel-calls-sebi-other-regulators/articleshow/114061503.cms",
            "description": "This was decided at the first meeting of the parliamentary finance panel on Tuesday, which was attended by around two-dozen MPs and chaired by BJP MP Bhartruhari Mahtab. Former FM and senior Congress leader P Chidambaram is a part of the 31-member panel.",
            "pubDate": "2024-10-09T02:10:59.535581"
        },
        {
            "title": "Good Q2 tidings for life insurers, claims to hit others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/good-q2-tidings-for-life-insurers-claims-to-hit-others/articleshow/114061479.cms",
            "description": "General insurance companies are likely to see a slowdown in premium income due to muted growth in the motor segment. Also, the claims from natural catastrophes are going to affect the overall profitability of insurance companies. At the same time, standalone health insurance companies are likely to see higher claims due to seasonal diseases and medical inflation.",
            "pubDate": "2024-10-09T02:10:59.535672"
        },
        {
            "title": "Biocon Biologics raises $300 million for debt refinancing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-biologics-raises-300-million-for-debt-refinancing/articleshow/114061404.cms",
            "description": "The loan was priced at 175 basis points above the three-month secured overnight funding rate (SOFR), which was trading at 4.59%. That pegs the floating-rate loan at 6.34%, people familiar with the matter said.",
            "pubDate": "2024-10-09T02:10:59.535762"
        },
        {
            "title": "Nifty's over 4% falls in a week mostly recovered within 3 months: Study",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niftys-over-4-falls-in-a-week-mostly-recovered-within-3-months-study/articleshow/114061385.cms",
            "description": "Mid-cap and small-cap stocks also fell in such periods, tracking the benchmark indices. In the subsequent three months, the mid-cap index rose seven times and fell thrice, while the small-cap index gained six times and declined four times.",
            "pubDate": "2024-10-09T02:10:59.535849"
        },
        {
            "title": "D-Street ends 6-Day losing streak as China stocks retreat from highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-ends-6-day-losing-streak-as-china-stocks-retreat-from-highs/articleshow/114061377.cms",
            "description": "Elsewhere in Asia, China advanced 4.6%, while Hong Kong, considered a proxy for China in the past week because of the holiday in mainland markets, plunged 9.4%, the biggest single-day fall since 2008. South Korea declined 0.6% and Taiwan dropped 0.4%.",
            "pubDate": "2024-10-09T02:10:59.535937"
        },
        {
            "title": "Tata powers up wind energy market with mega order; seeks bids for supply of turbines with capacity of 3 GW",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-powers-up-wind-energy-market-with-mega-order-seeks-bids-for-supply-of-turbines-with-capacity-of-3-gw/articleshow/114061803.cms",
            "description": "Tata Power is pursuing bids for wind turbines to equip its wind-solar hybrid renewable energy projects, expecting to install over 3GW with a potential expansion to 5GW over five years. Major manufacturers like Siemens Gamesa and Suzlon are involved, with investments estimated at $9 billion.",
            "pubDate": "2024-10-09T02:10:59.536033"
        },
        {
            "title": "Sebi calls for stricter review of AIF investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-calls-for-stricter-review-of-aif-investors/articleshow/114061365.cms",
            "description": "At present, AIFs have been designated as qualified institutional buyers(QIB) and can avail certain benefits under Sebi rules. On Tuesday, Sebi said AIFs should not facilitate investors who are ineligible for QIB status on their own from availing the benefits.",
            "pubDate": "2024-10-09T02:10:59.536135"
        },
        {
            "title": "Stock Radar: Max Healthcare stock is down 17% from September 2024 highs; should you buy the dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-max-healthcare-stock-is-down-17-from-september-2024-highs-should-you-buy-the-dip/articleshow/114041924.cms",
            "description": "Max Healthcare Institute Ltd's stock has dropped over 17% from its September 2024 peak to Rs 919 but is showing potential for a technical rebound. Support is indicated around the 50-DMA and 100-DMA, with experts suggesting short-term buying for a possible target range of Rs 980-Rs 1045.",
            "pubDate": "2024-10-09T02:10:59.536227"
        },
        {
            "title": "These 8 bank stocks can give 27 to 38% returns in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-8-bank-stocks-can-give-27-to-38-returns-in-1-year-according-to-analysts/articleshow/114053826.cms",
            "description": "In the last few sessions, every bank stock has seen a correction. But a deeper look reveals a streak of outperformance amidst the mayhem. The wave of unprecedented FPI selling was bound to hit all indices. Had it happened a couple of years ago, it would have caused much more damage, especially to banking stocks where FPIs own significant chunks. The current wave of selling resulted in just a 5% cut in the index, with a few large-caps taking a beating. But when the recovery took place on Tuesday, the market breadth was able to recover sharply. This indicates the strength of the market. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks along with detailed company analysis focusing on five key components – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2024-10-09T02:10:59.536328"
        }
    ]
}