{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-18T23:45:46.228445",
    "items": [
        {
            "title": "12 penny stocks rally up to 589% in FY26 so far; 6 turn multibaggers. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-penny-stocks-rally-up-to-589-in-fy26-so-far-6-turn-multibaggers-do-you-own-any/slideshow/126637121.cms",
            "description": "So far in FY26, 12 penny stocks have posted sharp gains, with returns ranging from 40% to as high as 589%. Notably, six of them have emerged as multibaggers. These standout performers were selected based on specific criteria: a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares. This analysis focuses on identifying low-priced, actively traded micro-cap stocks that demonstrate strong upward momentum. (Data Source: ACE Equity).Penny stocks often attract attention due to their low entry price and the potential for explosive growth. But while the rewards can be impressive, the risks are equally high. These stocks typically carry low liquidity, high volatility, and limited financial transparency. Investors should proceed with caution as success in penny stocks requires not just luck, but a clear strategy and strong risk management.",
            "pubDate": "2026-01-18T04:31:47.587207"
        },
        {
            "title": "Top picks: 3 stocks to buy this week that can give returns of up to 19% in short term. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-picks-3-stocks-to-buy-this-week-that-can-give-returns-of-up-to-19-in-short-term-do-you-own-any/slideshow/126636918.cms",
            "description": "As the festival of lights nears, leading brokerages have unveiled their Diwali 2025 smallcap picks, featuring 15 stocks that could shine in the year ahead. With improving domestic demand, policy push for manufacturing, and easing rate outlook, analysts expect select smallcaps to deliver strong returns -- some offering as much as 120% potential upside from current levels.",
            "pubDate": "2026-01-18T04:31:47.587371"
        },
        {
            "title": "Q3 earnings, US-Iran conflict & FII action among 9 factors to move D-St this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q3-earnings-us-iran-conflict-fii-action-among-9-factors-to-move-d-st-this-week/articleshow/126636772.cms",
            "description": "Markets are poised for a volatile week influenced by Q3 earnings, with over 230 companies set to announce results. Geopolitical tensions between the US and Iran are expected to weigh on global sentiment, while FII outflows continue. Technical indicators suggest a consolidative bias with immediate support at 25,550–25,600.",
            "pubDate": "2026-01-18T04:31:47.587478"
        },
        {
            "title": "FII shorts highest since March 2025. How to trade Nifty now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-shorts-highest-since-march-2025-how-to-trade-nifty-now/articleshow/126637853.cms",
            "description": "Rising FII short positions in index futures and a near-record low long–short ratio point to heightened volatility in the January series. However, a sharp build-up in index futures longs hints at possible short covering. Market focus remains on key Nifty levels, PSU banks, metals and select trading ideas.",
            "pubDate": "2026-01-18T05:53:47.392846"
        },
        {
            "title": "HDFC Securities’ top 7 technical picks for 2026. How many in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-securities-top-7-technical-picks-for-2026-how-many-in-your-portfolio/slideshow/126637713.cms",
            "description": "As market volatility persists in 2026, HDFC Securities has shortlisted 7 technically strong stocks for accumulation over the year, cutting across small, mid and largecap segments and multiple sectors. Here's the full list.",
            "pubDate": "2026-01-18T05:53:47.393066"
        },
        {
            "title": "Bharat Coking Coal IPO GMP shows 54% listing pop. What to expect ahead of listing tomorrow?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-coking-coal-ipo-gmp-shows-54-listing-pop-what-to-expect-ahead-of-listing-tomorrow/articleshow/126638339.cms",
            "description": "Bharat Coking Coal Ltd’s IPO has garnered strong grey market interest ahead of its Monday listing, indicating a potential 54% listing gain. One of the most oversubscribed PSU offerings in recent years, the company’s strategic position as India’s largest coking coal producer underscores investor confidence despite the brief delay.",
            "pubDate": "2026-01-18T06:16:55.177073"
        },
        {
            "title": "10 Sensex stocks with up to 32% upside potential. Are these in your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-sensex-stocks-with-up-to-32-upside-potential-are-these-in-your-portfolio/slideshow/126639008.cms",
            "description": "Analyst predictions often offer more than just numbers; they reveal where the next wave of market opportunity could emerge. For investors scanning the Sensex for potential outperformers, the latest analyst consensus highlights several heavyweight names that could deliver strong returns in the coming year.According to Trendlyne data, multiple Sensex stocks show promising upside potential over the next 12 months, based on average analyst target prices. This “upside” reflects the expected price gain from current levels, a research-backed indicator for investors looking to position ahead of potential rallies. Among these, 10 Sensex stocks stand out with projected gains of 18% to 32%, signalling solid return prospects in a market that’s becoming increasingly selective.",
            "pubDate": "2026-01-18T07:26:13.077216"
        },
        {
            "title": "FPIs' selling spree continues; Rs 22,530 cr pulled out from equities in Jan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-selling-spree-continues-rs-22530-cr-pulled-out-from-equities-in-jan/articleshow/126638853.cms",
            "description": "Foreign portfolio investors withdrew over Rs 22,530 crore (USD 2.5 billion) from Indian equities so far this month amid rising US bond yields and a stronger dollar, continuing their selling streak from last year.",
            "pubDate": "2026-01-18T07:26:13.077326"
        },
        {
            "title": "What do Trump’s Greenland tariff threats to NATO allies mean for gold, silver and Dalal Street?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-do-trumps-greenland-tariff-threats-to-nato-allies-mean-for-gold-silver-and-dalal-street/articleshow/126640083.cms",
            "description": "Fresh tariff threats by U.S. President Donald Trump linked to Greenland have unsettled global markets, reviving demand for safe-haven assets like gold and silver. While near-term volatility risks loom for equities, analysts see potential longer-term opportunities for India through accelerated trade negotiations and shifting global supply dynamics",
            "pubDate": "2026-01-18T08:55:51.378805"
        },
        {
            "title": "Market participants seek equity tax relief ahead of Budget",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-participants-seek-equity-tax-relief-ahead-of-budget/articleshow/126639991.cms",
            "description": "Market participants have urged the government to ease capital market taxation, including a higher exemption limit on long-term capital gains, ahead of the Union Budget for 2026-27.",
            "pubDate": "2026-01-18T08:55:51.378935"
        },
        {
            "title": "Mcap of 3 of top 10 most valued firms jumps by Rs 75,855 cr; SBI, Infosys biggest winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-3-of-top-10-most-valued-firms-jumps-by-rs-75855-cr-sbi-infosys-biggest-winners/articleshow/126640613.cms",
            "description": "The combined market valuation of three of the top-10 most valued firms jumped Rs 75,855.43 crore in a holiday-shortened last week, with State Bank of India and Infosys emerging as the biggest gainers, in an otherwise sluggish trend in equities.",
            "pubDate": "2026-01-18T09:16:05.613747"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/126642143.cms",
            "description": "Indian equities closed higher as a strong earnings surprise from Infosys boosted risk appetite and lifted IT stocks, helping Sensex and Nifty hit intraday highs. However, profit booking capped gains by the close. Analysts flagged mixed global cues, sector-specific strength and cautious technical signals.",
            "pubDate": "2026-01-18T11:13:08.569304"
        },
        {
            "title": "Two Trades for Today: A wealth management major for a 7.1% rise, a mid-cap private bank stock for a 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-wealth-management-major-for-a-7-1-rise-a-mid-cap-private-bank-stock-for-a-6-gain/articleshow/126649679.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-18T16:17:07.387332"
        },
        {
            "title": "Stock Radar: JSW Energy breaks out from inverse head & shoulder pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-jsw-energy-breaks-out-from-inverse-head-shoulder-pattern-time-to-buy/articleshow/126641380.cms",
            "description": "JSW Energy's stock has broken out of an inverse head and shoulder pattern on daily charts, trading above the neckline despite a recent dip. Experts suggest buying now or on dips for a target of 500-550 in the coming weeks, citing a bullish technical signal and strong support.",
            "pubDate": "2026-01-18T23:45:45.163783"
        }
    ]
}