{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-08T00:59:29.932698",
    "items": [
        {
            "title": "Modulus Appoints Sandeep Agarwal as Chief Executive",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/modulus-appoints-sandeep-agarwal-as-chief-executive/articleshow/126404551.cms",
            "description": "Modulus Alternatives has appointed Sandeep Agarwal as its new chief executive, effective January 1. Agarwal brings nearly 25 years of extensive experience in investment banking and private credit from prominent institutions like UBS AG, Credit Suisse, and JP Morgan. This strategic appointment is backed by the Centrum Group and Alok Agarwal, former CFO of Reliance Industries.",
            "pubDate": "2026-01-08T00:59:27.374446"
        },
        {
            "title": "Equity likely to return about 10-12% in 2026: ABSL MF",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/equity-likely-to-return-about-10-12-in-2026-absl-mf/articleshow/126404511.cms",
            "description": "Aditya Birla Sun Life Mutual Fund anticipates equity returns of 10-12% in 2026. Nifty companies are expected to see earnings growth in the low to mid-teens. Large-cap stocks are predicted to outperform mid and small-cap peers. The fund house is overweight on IT, FMCG, and materials. Harish Krishnan succeeds Mahesh Patil as CIO, equity.",
            "pubDate": "2026-01-08T00:59:27.374607"
        },
        {
            "title": "Strong Q3 sales and rising gold demand lift jewellery stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-q3-sales-and-rising-gold-demand-lift-jewellery-stocks/articleshow/126404487.cms",
            "description": "Gold jewellery stocks surged on Wednesday. Titan Company, Kalyan Jewellers India, and Senco Gold reported strong third-quarter sales. This positive market sentiment is expected to continue. Analysts point to rising gold prices and consistent sales growth as key drivers.  Titan's jewellery business grew 41% year-on-year. Senco's revenue was up 51%. Kalyan Jewellers saw consolidated revenue growth of approximately 42%.",
            "pubDate": "2026-01-08T00:59:27.374908"
        },
        {
            "title": "FPIs dump FMCG, Financial Services in second half of December; IT sees inflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-dump-fmcg-financial-services-in-second-half-of-dec-it-sees-inflows/articleshow/126404440.cms",
            "description": "Foreign investors divested ₹16,848 crore from Indian markets in the latter half of December. FMCG and financial services saw major outflows. However, the information technology sector attracted ₹4,457 crore in inflows, marking the first positive fortnight since June. This shift indicates a change in global investor sentiment towards Indian equities.",
            "pubDate": "2026-01-08T00:59:27.375050"
        },
        {
            "title": "PNB puts on the block ₹760 cr of bad loans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-puts-on-the-block-760-cr-of-bad-loans/articleshow/126404493.cms",
            "description": "Punjab National Bank is selling bad loans exceeding ₹760 crore, including significant exposures to Gammon India and Simbhaoli Sugars. This follows a larger sale attempt last week of ₹2,500 crore in non-performing assets. The bank aims to recover at least 40-50% of the identified ₹4,000-5,000 crore in bad loans.",
            "pubDate": "2026-01-08T00:59:27.375326"
        }
    ]
}