{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-17T07:21:04.780947",
    "items": [
        {
            "title": "RIL Q1 Results Preview: Asian Paints stake sale to trigger up to 88% YoY PAT growth. Check revenue, margin estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q1-results-preview-asian-paints-stake-sale-to-trigger-up-to-88-yoy-pat-growth-check-revenue-margin-estimates/articleshow/122617780.cms",
            "description": "Reliance Industries is projected to reveal a robust Q1 performance, fueled by the Asian Paints stake sale and strong showings in O2C, Digital, and Retail. While revenue trends are mixed, EBITDA is expected to rise across brokerages due to margin improvements in core verticals. E&P segment may experience a decline due to lower production.",
            "pubDate": "2025-07-17T07:20:52.211531"
        },
        {
            "title": "Jio Financial to announce Q1 results today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-to-announce-q1-results-today/articleshow/122606345.cms",
            "description": "Jio Financial Services is set to announce its Q1 earnings today, along with a presentation to analysts. Other key companies like Axis Bank, Wipro, and LTIMindtree will also release their results. Jio Financial's Q4 FY25 saw a marginal profit increase and revenue growth. Its mutual fund arm, Jio BlackRock, recently secured SEBI approval for five new index funds.",
            "pubDate": "2025-07-17T07:20:52.211682"
        },
        {
            "title": "Steel firms to see profit growth amid price hikes, cheaper coking coal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/steel-firms-to-see-profit-growth-amid-price-hikes-cheaper-coking-coal/articleshow/122603200.cms",
            "description": "Steelmakers are poised for a profit increase in the fiscal first quarter, driven by rebounding domestic steel prices and lower coking coal costs, despite an anticipated sales volume decline. Conversely, non-ferrous metal producers face a challenging quarter with projected revenue and EBITDA declines due to weaker commodity prices and softer volumes.",
            "pubDate": "2025-07-17T07:20:52.211796"
        },
        {
            "title": "Le Travenues reports Q1 profit at Rs 19 crore, revenue at Rs 314 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/le-travenues-reports-q1-profit-at-rs-19-crore-revenue-at-rs-314-crore/articleshow/122586104.cms",
            "description": "ixigo reported a strong Q1 FY26, with revenue up 73% to ₹314.5 crore and net profit rising 27% to ₹19 crore. GTV grew 55%, driven by flights and buses. The company's EBITDA increased by 69%. ixigo is focusing on AI-driven efficiencies and customer-centric approaches. Train bookings by Gen Z and solo female travelers saw significant growth.",
            "pubDate": "2025-07-17T07:20:52.211900"
        },
        {
            "title": "Angel One Q1 Results: Profit dips to at Rs 114 crore on derivative trading curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/angel-one-q1-results-profit-dips-to-at-rs-114-crore-on-derivative-trading-curbs/articleshow/122582346.cms",
            "description": "Indian brokerage Angel One on Wednesday posted a 61% fall in first-quarter profit, as tighter rules for equity derivatives trading in India weighed on retail activity, a key driver for the brokerage's earnings.",
            "pubDate": "2025-07-17T07:20:52.212003"
        },
        {
            "title": "ITC Hotels reports revenue of Rs 816 crore for Q1FY26, profit at Rs 134 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-hotels-reports-revenue-of-rs-816-crore-for-q1fy26-profit-at-rs-134-crore/articleshow/122578297.cms",
            "description": "ITC Hotels reported a 54% YoY rise in Q1 profit at Rs 134 crore and 16% revenue growth to Rs 816 crore. The board approved Rs 328 crore capex for a new Vizag hotel as the company targets aggressive expansion across India.",
            "pubDate": "2025-07-17T07:20:52.212106"
        },
        {
            "title": "L&T Tech Q1 Results: Cons PAT up marginally YoY, revenue surges 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-tech-q1-results-cons-pat-up-marginally-yoy-revenue-surges-16/articleshow/122575748.cms",
            "description": "LTTS Q1 results: L&T Technology Services reported a marginal 0.7% increase in its June quarter consolidated net profit at Rs 316 crore versus Rs 314 crore reported by the company in the year ago period.",
            "pubDate": "2025-07-17T07:20:52.212204"
        },
        {
            "title": "Tech Mahindra Q1 Results: Cons PAT surges 34% YoY to Rs 1,141 crore, misses Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q1-results-cons-pat-surges-34-yoy-to-rs-1141-crore-misses-street-estimates/articleshow/122573542.cms",
            "description": "Tech Mahindra Q1 Results: Tech Mahindra on Wednesday reported a 34% growth in its Q1FY26 consolidated net profit at Rs 1,141 crore versus Rs 851 crore in the year ago period. The profit is attributable to the owners of the company and is below Street's estimates Rs 1,211 crore.",
            "pubDate": "2025-07-17T07:20:52.212305"
        },
        {
            "title": "ITC Hotels Q1 Results: Cons PAT jumps 54% YoY to Rs 133 crore; revenue advances 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/itc-hotels-q1-results-cons-pat-jumps-54-yoy-to-rs-133-crore-revenue-advances-15/articleshow/122566716.cms",
            "description": "ITC Hotels Q1 Results: Revenue from operations for the quarter stood at Rs 816 crore, up 15.5% from Rs 706 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2025-07-17T07:20:52.212401"
        },
        {
            "title": "Wipro Q1 Preview: PAT may rise 5-12% YoY; topline likely to remain muted. Key metrics to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q1-preview-pat-may-rise-5-12-yoy-topline-likely-to-remain-muted-key-metrics-to-track/articleshow/122565220.cms",
            "description": "Wipro is expected to post muted Q1FY26 revenue growth due to weak demand in Europe, while PAT may rise 5–12% year-on-year. Margins are likely stable, supported by cost control. Analysts focus on H2 guidance, deal ramp-ups and Europe’s performance as key triggers.",
            "pubDate": "2025-07-17T07:20:52.212499"
        },
        {
            "title": "Axis Bank Q1 Preview: Modest PAT and NII growth expected amid margin pressures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q1-preview-modest-pat-and-nii-growth-expected-amid-margin-pressures/articleshow/122561675.cms",
            "description": "Axis Bank's Q1FY26 earnings, due Thursday, are projected to show modest growth, with PAT and NII up by approximately 2% year-on-year. Loan growth is anticipated in the 7-8% range, but analysts are closely watching asset quality and margin trends.",
            "pubDate": "2025-07-17T07:20:52.212596"
        }
    ]
}