{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-15T23:44:19.459054",
    "items": [
        {
            "title": "Prodocs Solutions shares to debut today. Check GMP and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/prodocs-solutions-shares-to-debut-today-check-gmp-and-other-details/articleshow/125968794.cms",
            "description": "Prodocs Solutions is set for its BSE SME debut with a muted grey market premium, suggesting a flat listing at its IPO price of Rs 138. The Rs 27.60 crore IPO saw moderate subscription, with non-institutional investors showing the strongest demand.",
            "pubDate": "2025-12-15T01:55:28.853231"
        },
        {
            "title": "KV Toys India IPO listing today. Here's what GMP suggests",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kv-toys-india-ipo-listing-today-heres-what-gmp-suggests/articleshow/125968780.cms",
            "description": "KV Toys India is set for its stock market debut. Grey market indicators suggest a strong listing. The company's IPO saw massive investor interest, with subscriptions exceeding expectations. This reflects aggressive participation from investors seeking listing gains. KV Toys India operates in toy manufacturing and sales. The company has shown a financial turnaround. All eyes are on the listing performance.",
            "pubDate": "2025-12-15T01:55:28.853370"
        },
        {
            "title": "Riddhi Display Equipments shares to list today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/riddhi-display-equipments-shares-to-list-today-heres-what-gmp-indicates/articleshow/125968771.cms",
            "description": "Riddhi Display Equipments is set to list on the BSE SME platform with a cautious outlook, as indicated by a zero grey market premium. The Rs 24.68 crore IPO, which saw strong retail investor interest, aims to fund working capital and general corporate needs.",
            "pubDate": "2025-12-15T01:55:28.853481"
        },
        {
            "title": "Asian stocks slip as traders reduce exposure ahead of central bank meetings, key data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-fall-on-tech-concerns-bitcoin-slips/articleshow/125968624.cms",
            "description": "Asian markets opened lower as concerns over technology company earnings and massive AI spending sapped risk sentiment. South Korea, a key AI player, saw a significant slump, mirroring Wall Street's tech-led decline. Investors are debating AI exposure amid skepticism about valuations and the technology's ultimate consumer adoption.",
            "pubDate": "2025-12-15T01:55:28.853596"
        },
        {
            "title": "Honk Kong, India fuel blockbuster year for Asia fundraising",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honk-kong-india-fuel-blockbuster-year-for-asia-fundraising/articleshow/125968587.cms",
            "description": "Hong Kong's stock market has experienced a remarkable turnaround. Share sales have surged, making it Asia's leading fundraising hub. This boom is fueled by Chinese companies seeking global expansion. India, mainland China, and Japan also saw strong dealmaking. Despite global challenges, Hong Kong's market shows robust activity. Investors are now focusing on quality deals.",
            "pubDate": "2025-12-15T01:55:28.853698"
        },
        {
            "title": "Asia's rich drive a $200-billion revival in complex equity notes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asias-rich-drive-a-200-billion-revival-in-complex-equity-notes/articleshow/125968574.cms",
            "description": "Wealthy Asian investors are pouring record funds into complex stock products. Issuance of these products linked to Hong Kong and Singapore equities has surged significantly this year. Accumulators and fixed-coupon notes are particularly popular. This trend coincides with a surge in Asian equities driven by artificial intelligence. These instruments offer controlled stock exposure, though complexity can amplify losses.",
            "pubDate": "2025-12-15T01:55:28.853800"
        },
        {
            "title": "Stocks in news: Wipro, Dr Reddy's, Tata Steel, Tejas Networks, SAIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-wipro-dr-reddys-tata-steel-tejas-networks-sail/articleshow/125963290.cms",
            "description": "Indian markets saw a rebound on Friday, driven by positive global sentiment. Key companies like Wipro, Dr Reddy's, Tata Steel, and SAIL are in focus due to recent developments. Godrej Properties is expanding in Hyderabad. Nestle India appointed a new HR head. Tata Steel plans capacity expansion. SAIL reported sales growth. Tejas Networks secured contracts for rural broadband.",
            "pubDate": "2025-12-15T01:55:28.853897"
        },
        {
            "title": "GIFT Nifty down 90 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125963317.cms",
            "description": "Markets ended the week in negative territory amid mixed domestic and global cues, with selling pressure intensifying before a late rebound. The upcoming week will see the release of key domestic data including WPI inflation and trade balance figures, alongside flash PMI readings. Foreign portfolio investors were net sellers, while domestic institutional investors bought shares.",
            "pubDate": "2025-12-15T01:55:28.854010"
        },
        {
            "title": "A break above 26,300 key for next Nifty rally: Analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-break-above-26300-key-for-next-nifty-rally-analysts/articleshow/125968526.cms",
            "description": "Nifty has stabilized near recent highs, consolidating after a rebound from the 25,700 zone. The index faces resistance at 26,050–26,300, with a decisive move above this level potentially leading to a rally towards 26,350–26,500. Immediate support is seen at 25,900.",
            "pubDate": "2025-12-15T01:55:28.854107"
        },
        {
            "title": "At $18.4 billion, FPI equity sales hit new record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-18-4-billion-fpi-equity-sales-hit-new-record/articleshow/125968517.cms",
            "description": "Foreign investors are selling Indian stocks at a record pace this year. They have offloaded $18.4 billion in equities, surpassing the previous high. While primary market inflows have slowed, secondary market sales have reached an all-time peak. Domestic funds, however, continue to invest consistently in local equities.",
            "pubDate": "2025-12-15T01:55:28.854202"
        },
        {
            "title": "Mutual fund fee revamp, simplified IPO disclosures on Sebi Board agenda",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cost-efficiency-in-mind-mf-fees-under-review/articleshow/125968445.cms",
            "description": "Sebi's board will discuss revamping mutual fund fee structures to enhance transparency and cost-efficiency for investors. Proposals include reducing total expense ratios and brokerage fees, alongside simplifying IPO disclosures and easing pre-IPO lock-in rules. The regulator aims to make investment more accessible and affordable for the public.",
            "pubDate": "2025-12-15T01:55:28.854293"
        },
        {
            "title": "Mizuho looks to wrap up Avendus acquisition this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mizuho-looks-to-wrap-up-avendus-acquisition-this-week/articleshow/125968485.cms",
            "description": "Board of the homegrown investment bank is scheduled to meet on Tuesday to okay transaction valuing I-banker at Rs 5,900 crore. KKR looks to make 3.5x rupee return from 9 year old investment.",
            "pubDate": "2025-12-15T01:55:28.854383"
        },
        {
            "title": "Vi may get 4-5 years of AGR dues moratorium; dues could be halved",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vi-may-get-4-5-years-of-agr-dues-moratorium-dues-could-be-halved/articleshow/125968470.cms",
            "description": "Under the current schedule, Vi needs to pay more than ₹18,000 crore next March as the first instalment after the end of a moratorium on AGR payments the government had given to telcos in 2021. This was not interest-free, resulting in the arrears increasing every year.",
            "pubDate": "2025-12-15T01:55:28.854476"
        },
        {
            "title": "Lending rates moving lower to raise pressure on bank NIMs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lending-rates-moving-lower-to-raise-pressure-on-bank-nims/articleshow/125968403.cms",
            "description": "Bankers said the move will delay margin recovery since they cannot cut deposit rates sharply due to stiff competition from alternative investment avenues such as mutual funds.",
            "pubDate": "2025-12-15T01:55:28.854664"
        },
        {
            "title": "How Motilal Oswal used Warren Buffett’s formula to deliver 55x growth and a 2-stock jackpot",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-motilal-oswal-used-warren-buffetts-formula-to-deliver-55x-growth-and-a-2-stock-jackpot/articleshow/125970221.cms",
            "description": "Motilal Oswal Financial Services has built a Rs 9,000-crore treasury, doubling every two years, inspired by Warren Buffett's Berkshire Hathaway. This strategy, a contrarian shift in FY15, has become a powerful second growth engine, enabling 31% decadal operating profit CAGR without external equity. The firm achieved multibagger returns in AU Small Finance Bank and the unlisted National Stock Exchange (NSE).",
            "pubDate": "2025-12-15T04:14:46.860691"
        },
        {
            "title": "Wipro shares in focus following strategic AI partnerships with Google Cloud, Microsoft",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-in-focus-following-strategic-ai-partnerships-with-google-cloud-microsoft/articleshow/125970224.cms",
            "description": "Wipro shares are expected to see movement following significant AI partnerships. The company is enhancing enterprise AI adoption with Google Cloud's Gemini Enterprise and Microsoft's AI tools. These collaborations aim to transform businesses into early AI adopters, boosting productivity and innovation across various sectors. Wipro is also upskilling its workforce to leverage these advanced technologies.",
            "pubDate": "2025-12-15T04:14:46.860806"
        },
        {
            "title": "Positive Breakout: These 14 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-14-stocks-cross-above-their-200-dmas/slideshow/125968951.cms",
            "description": "In the Nifty500 pack, 14 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 12, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-15T04:14:46.860907"
        },
        {
            "title": "BEL shares in focus on securing Rs 776 crore worth defence orders in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-on-securing-rs-776-crore-worth-defence-orders-in-a-month/articleshow/125970180.cms",
            "description": "Bharat Electronics Limited (BEL) is set to be in focus after announcing new defence orders worth Rs 776 crore. These orders, received since November 14, 2025, include indigenous Counter Unmanned Aerial Systems (SAKSHAM), Software Defined Radios, and Anti-Drone Systems, signaling continued growth in the company's order book.",
            "pubDate": "2025-12-15T04:14:46.861007"
        },
        {
            "title": "From Cyient to TCS, 49 IT stocks see FII selling amid year-long slump. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-cyient-to-tcs-49-it-stocks-see-fii-selling-amid-year-long-slump-do-you-own-any/articleshow/125970165.cms",
            "description": "Foreign investors have been selling Indian IT stocks for the past year. This has caused many IT companies to see their share prices fall. However, some market experts believe valuations are now attractive. They expect sentiment to improve soon. This could be helped by a US Federal Reserve rate cut. The Indian rupee's softness is also a factor.",
            "pubDate": "2025-12-15T04:14:46.861107"
        },
        {
            "title": "Sensex falls over 350 points, Nifty below 25,950 as foreign outflows keep D-St on edge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-350-points-nifty-below-25950-as-foreign-outflows-keep-d-st-on-edge/articleshow/125970155.cms",
            "description": "Indian equities commenced the week on a subdued note, with both the Sensex and Nifty experiencing declines. This downturn followed a two-session rally, primarily driven by ongoing foreign investor selling and persistent uncertainty surrounding a potential U.S. trade deal, which dampened investor risk appetite.",
            "pubDate": "2025-12-15T04:14:46.861201"
        },
        {
            "title": "Adani Green shares jump over 1% after SEBI drops insider trading case related to SB Energy deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-green-shares-jump-over-1-after-sebi-drops-insider-trading-case-related-to-sb-energy-deal/articleshow/125970140.cms",
            "description": "Adani Green Energy shares rose after SEBI dropped insider trading charges against Pranav Adani, Kunal Shah, and Nrupal Shah. The regulator found that trades occurred after acquisition information was publicly available, rendering UPSI allegations unsustainable. No penalties were imposed.",
            "pubDate": "2025-12-15T04:14:46.861299"
        },
        {
            "title": "Vodafone Idea shares jump 3% to new 52-week high amid likely government relief on Rs 83,000 cr AGR dues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-jump-3-to-new-52-week-high-amid-likely-government-relief-on-rs-83000-cr-agr-dues/articleshow/125970060.cms",
            "description": "Vodafone Idea shares: The government is likely to extend a 4–5 year interest-free moratorium on over Rs 83,000 crore of AGR dues, easing financial stress and improving near-term liquidity.",
            "pubDate": "2025-12-15T04:14:46.861395"
        },
        {
            "title": "Brigade Enterprises shares fall 2% after Income Tax search at company premises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brigade-enterprises-shares-in-focus-after-income-tax-search-at-company-premises/articleshow/125969474.cms",
            "description": "Brigade Enterprises shares dropped after the Income Tax Department conducted search operations. The searches concluded recently. The company stated its operations are unaffected. Analysts maintain a strong buy rating with a significant target price. The company recently acquired land in Hyderabad. Brigade Enterprises reported strong September quarter results with increased profit and revenue.",
            "pubDate": "2025-12-15T04:14:46.861489"
        },
        {
            "title": "KEC International shares surge 5% on bagging its biggest T&D order. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kec-international-shares-in-focus-on-bagging-its-biggest-td-order-check-details/articleshow/125969403.cms",
            "description": "Shares of KEC International surged following the announcement of fresh orders amounting to Rs 1,150 crore. The transmission and distribution division clinched its biggest domestic deal to date, significantly enhancing KEC's foothold in the power infrastructure sector. With year-to-date orders exceeding Rs 18,000 crore, this robust performance stands in stark contrast to recent declines in the stock market.",
            "pubDate": "2025-12-15T04:14:46.861581"
        },
        {
            "title": "Stocks to buy for 2026: Lloyds Metals, Tata Steel among 5 stocks that could give double digit returns in next 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-lloyds-metals-tata-steel-among-5-stocks-that-could-give-double-digit-returns-in-next-1-year/slideshow/125968861.cms",
            "description": "Brokerage sentiment remains broadly positive across a diverse set of companies, with analysts highlighting strong upside potential driven by sectoral tailwinds, robust earnings outlook, and improving fundamentals.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-15T04:14:46.861689"
        },
        {
            "title": "Hindustan Zinc among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-among-5-fampo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/125971106.cms",
            "description": "As of December 12, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market",
            "pubDate": "2025-12-15T05:16:10.342553"
        },
        {
            "title": "Vedanta among 4 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-among-4-stocks-witness-5-year-swing-high-breakout/slideshow/125971015.cms",
            "description": "In the Nifty200 segment, four stocks witnessed a 5-year swing high at the close on December 12, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-12-15T05:16:10.342694"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains overweight on KEI Industries; Elara trims target for IndiGo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-overweight-on-kei-industries-elara-trims-target-for-indigo/articleshow/125970765.cms",
            "description": "Brokerage commentary highlights a mixed outlook for large and midcap stocks, with long-term themes driving investment. KEI Industries sees a 17% upside with strong domestic demand, while Siemens maintains a Neutral rating due to gradual margin expansion. InterGlobe Aviation retains a Buy rating despite a target price cut, with assured aircraft deliveries supporting its growth.",
            "pubDate": "2025-12-15T05:16:10.342806"
        },
        {
            "title": "Why ETFs are becoming the go-to tool for long-term wealth building",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-etfs-are-becoming-the-go-to-tool-for-long-term-wealth-building/articleshow/125970735.cms",
            "description": "ETFs are low-cost, exchange-traded investment funds that offer real-time pricing, diversification and transparency, making them a popular choice for Indian, US and global investors seeking efficient, long-term wealth creation.",
            "pubDate": "2025-12-15T05:16:10.342910"
        },
        {
            "title": "Global markets brace for key week as EU, Fed data and Central Banks take centre stage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-markets-brace-for-key-week-as-eu-fed-data-and-central-banks-take-centre-stage/articleshow/125970697.cms",
            "description": "Global markets face a crucial week as political negotiations in Europe, a wave of delayed US economic data and key central-bank meetings converge, shaping expectations for growth, inflation and monetary policy in the year ahead.",
            "pubDate": "2025-12-15T05:16:10.343005"
        },
        {
            "title": "Key US data deluge to steer markets as year-end nears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/key-us-data-deluge-to-steer-markets-as-year-end-nears/articleshow/125970603.cms",
            "description": "Markets await a backlog of US economic data, including jobs and inflation reports, which could shape investor sentiment and Federal Reserve policy expectations as equities navigate year-end volatility after recent tech-led losses.",
            "pubDate": "2025-12-15T05:16:10.343105"
        },
        {
            "title": "Tata Steel shares in focus on major capacity expansion plans to sustain market leadership",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-in-focus-on-major-capacity-expansion-plans-to-sustain-market-leadership/articleshow/125970530.cms",
            "description": "Tata Steel shares: The company announced plans to boost domestic capacity by nearly 50%, including a 4.8-million-tonne addition, aimed at strengthening market leadership and securing long-term raw material supplies.",
            "pubDate": "2025-12-15T05:16:10.343202"
        },
        {
            "title": "Wakefit Innovations shares list flat at IPO price of Rs 195 on exchanges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wakefit-innovations-shares-list-flat-at-ipo-price-of-rs-195-on-nse-bse/articleshow/125970319.cms",
            "description": "Wakefit Innovations listed flat on Monday, debuting at Rs 195 on the NSE and slightly lower on the BSE, in line with muted grey market expectations. The Rs 1,289-crore IPO saw moderate demand, with investors cautious amid aggressive valuations and a limited profitability track record despite strong brand presence.",
            "pubDate": "2025-12-15T05:16:10.343296"
        },
        {
            "title": "Corona Remedies shares make strong start, list at 38% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corona-remedies-shares-make-strong-start-list-at-38-premium-over-ipo-price/articleshow/125970349.cms",
            "description": "Corona Remedies Share Price: Corona Remedies debuted on Dalal Street with a significant 38.42% premium, opening at Rs 1,470 on NSE and Rs 1,452 on BSE. The Rs 655 crore IPO, entirely an offer for sale, was oversubscribed 144.5 times, highlighting strong investor confidence in its business model and niche market leadership.",
            "pubDate": "2025-12-15T05:16:10.343389"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/125970211.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-12-15T05:16:10.343482"
        },
        {
            "title": "Hindustan Zinc shares can rally to Rs 660, says Jefferies after initiating with Buy. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-can-rally-to-rs-660-says-jefferies-after-initiating-with-buy-heres-why/articleshow/125970252.cms",
            "description": "Hindustan Zinc share price surged after Jefferies initiated coverage with a 'Buy' rating, targeting Rs 660. Record silver prices and strong cost efficiency are driving growth, with earnings projected to expand significantly. The company's robust cash generation and healthy returns are expected to continue, making it a key beneficiary of metal price trends.",
            "pubDate": "2025-12-15T05:16:10.343574"
        },
        {
            "title": "Hindustan Copper shares fall 2% following major rally amid record copper prices. Can metal’s surge sustain?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-fall-2-following-major-rally-amid-record-copper-prices-can-metals-surge-sustain/articleshow/125970752.cms",
            "description": "Hindustan Copper shares dipped 2% as investors booked profits after a recent surge driven by record copper prices. Copper prices have seen a significant rally this year, fueled by supply disruptions and strong demand from AI data centers and the energy transition. Analysts anticipate prices to dip in the near term, with potential for further increases beyond 2026.",
            "pubDate": "2025-12-15T05:43:18.988505"
        },
        {
            "title": "Tata Steel among 4 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-among-4-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125971419.cms",
            "description": "On December 12, four Nifty50 stocks appeared in the RSI Trending Up scan on StockEdge. An RSI crossing above 50 from lower levels signals strengthening momentum and is often viewed as an early uptrend indicator, pointing to potential buying opportunities as price strength begins to emerge.",
            "pubDate": "2025-12-15T05:43:18.988628"
        },
        {
            "title": "JSW Energy and 3 other stocks flash bullish signals, indicating a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-energy-and-3-other-stocks-flash-bullish-signals-indicating-a-possible-uptrend/slideshow/125971355.cms",
            "description": "On December 11, four stocks in the Nifty 500 pack appeared on the bullish scanner, labelled as \"White Marubozu\", according to StockEdge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-12-15T05:43:18.988752"
        },
        {
            "title": "Corona Remedies shares climb 3% after blockbuster debut. What’s driving the post-listing surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corona-remedies-shares-climb-3-after-blockbuster-debut-whats-driving-the-post-listing-surge/articleshow/125971722.cms",
            "description": "Corona Remedies shares rose sharply on December 15, extending gains after a blockbuster IPO debut. Strong institutional demand, consistent profitability and a focused chronic therapy portfolio have supported post-listing momentum, even as the stock trades at rich valuations, keeping investors watchful of execution and margin sustainability.",
            "pubDate": "2025-12-15T05:54:49.461231"
        },
        {
            "title": "Kaynes Technology shares zoom 15% in 3 days after sharp selloff, 24% upside may still be on the cards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-shares-zoom-15-in-3-days-after-sharp-selloff-24-upside-may-still-be-on-the-cards/articleshow/125971676.cms",
            "description": "Shares of Kaynes Technology rebounded sharply after a prolonged correction, supported by a positive brokerage view from Elara Capital, which said recent concerns around accounting and cash flows were overstated and did not alter the company’s long-term growth outlook.",
            "pubDate": "2025-12-15T05:54:49.461351"
        },
        {
            "title": "ONGC shares down over 3%; Axis Capital initiates 'sell' rating with 14% downside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-shares-down-over-3-axis-capital-initiates-sell-rating-with-14-downside/articleshow/125971638.cms",
            "description": "ONGC shares fell over 3% after Axis Capital initiated coverage with a sell rating and a Rs 205 target, citing production decline, weak oil price outlook, and high subsidiary debt, implying about 14% downside from current levels.",
            "pubDate": "2025-12-15T05:54:49.461550"
        },
        {
            "title": "M&M, Eicher, and other auto stocks slide up to 2% on Mexico tariff jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-eicher-and-other-auto-stocks-slide-up-to-2-on-mexico-tariff-jitters/articleshow/125971527.cms",
            "description": "Auto stocks declined as investors assessed the impact of Mexico’s proposed tariff hikes on Indian exporters. With autos and auto components forming a large share of India’s exports to Mexico, concerns over higher duties, margin pressure and trade risks weighed on sentiment, dragging the Nifty Auto index lower at the week’s start.",
            "pubDate": "2025-12-15T05:54:49.461655"
        },
        {
            "title": "Global funds view Indian stocks as a top hedge against AI risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-funds-view-indian-stocks-as-a-top-hedge-against-ai-risks/articleshow/125973781.cms",
            "description": "Global fund managers are increasingly looking to India for equity diversification as concerns over an AI bubble grow. India's consumption-driven economy, with its low correlation to AI trade and attractive valuations, offers a hedge against tech-heavy global markets.  The country's domestic growth story, supported by policy reforms and stable corporate earnings, is drawing renewed investor interest.",
            "pubDate": "2025-12-15T07:38:28.805677"
        },
        {
            "title": "Matrimony.com announces Rs 58.5 crore share buyback, stock falls 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/matrimony-com-announces-rs-58-5-crore-share-buyback-stock-falls-5/articleshow/125973426.cms",
            "description": "Matrimony.com announces a share buyback worth up to Rs 58.5 crore, planning to repurchase 8,93,129 shares at Rs 655 each via the tender offer route. The buyback, representing nearly 25% of paid-up capital and reserves, aims to return surplus funds to shareholders, with promoters opting out.",
            "pubDate": "2025-12-15T07:38:28.805799"
        },
        {
            "title": "Wakefit shares slip 9% below listing price on debut day. Is this a dip-buying opportunity?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wakefit-shares-slip-9-below-listing-price-on-debut-day-is-this-a-dip-buying-opportunity/articleshow/125973190.cms",
            "description": "Wakefit Innovations shares slipped sharply on debut day after listing flat, as muted investor demand and concerns over profitability weighed on sentiment. Analysts flagged intense D2C competition, margin pressures and lack of near-term triggers, advising caution and disciplined risk management despite the company’s omnichannel expansion plans.",
            "pubDate": "2025-12-15T07:38:28.806006"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and an upside potential of up to 36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-an-upside-potential-of-up-to-36/articleshow/125972626.cms",
            "description": "The market is volatile, but we are not yet witnessing any sort of meltdown. Given the fact that FPIs have been largely sellers during 2025, it is but natural to expect selling pressure in the month of December (when most FPIs close their books for the year). It is similar to what we see in March in India when we close our financial year. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-12-15T07:38:28.806101"
        },
        {
            "title": "Transformers and Rectifiers shares rally 30% in 2 sessions. What’s behind the sharp surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/transformers-and-rectifiers-shares-rally-30-in-2-sessions-whats-behind-the-sharp-surge/articleshow/125972431.cms",
            "description": "Transformers and Rectifiers shares saw a significant jump of 11% reaching Rs 312. This rebound follows a recent 30% rally from a 52-week low. The company's stock had previously fallen due to weak quarterly results. The company recently won a Rs 53 crore order from Power Grid Corp on December 4",
            "pubDate": "2025-12-15T07:38:28.806199"
        },
        {
            "title": "Global markets brace for key week as EU, Fed data and Central Banks take centre stage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-markets-brace-for-key-week-as-eu-fed-data-and-central-banks-take-centre-stage/articleshow/125971788.cms",
            "description": "Global markets face a crucial week as political negotiations in Europe, a wave of delayed US economic data and key central-bank meetings converge, shaping expectations for growth, inflation and monetary policy in the year ahead.",
            "pubDate": "2025-12-15T07:38:28.806292"
        },
        {
            "title": "Japan's Nikkei sinks as tech shares track US peers lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-sinks-as-tech-shares-track-us-peers-lower/articleshow/125974038.cms",
            "description": "The Nikkei slid 1.3% to end the day at 50,168.11, with artificial intelligence (AI)-focused startup investor SoftBank Group and chip-testing-tool maker Advantest - an Nvidia supplier - the biggest drags on the index by a wide margin.",
            "pubDate": "2025-12-15T07:49:45.373209"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to benefit from moderate upward move",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-benefit-from-moderate-upward-move/articleshow/125974378.cms",
            "description": "Nifty’s technical setup shows a mildly bearish weekly trend but improving daily momentum, prompting experts to recommend a buy-on-dips approach. With support holding near key Fibonacci levels and derivatives data reducing downside risk, traders may consider a Bull Call Spread to benefit from a moderate upside move.",
            "pubDate": "2025-12-15T08:30:41.332394"
        },
        {
            "title": "Weekly foreign selling of India's index-linked debt at 6-month high, but funds stay bullish",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-foreign-selling-of-indias-index-linked-debt-at-6-month-high-but-funds-stay-bullish/articleshow/125975308.cms",
            "description": "Foreign investors offloaded Indian government bonds significantly last week, marking the largest selloff in over six months. This caution stems from fading interest rate cut expectations, persistent bond supply, and a weakening rupee. Despite this, some experts see potential for future inflows, especially with improved trade relations and index inclusion possibilities.",
            "pubDate": "2025-12-15T08:57:07.955525"
        },
        {
            "title": "For those looking for good businesses to invest in for the medium term: 5 Large-cap stocks with upside potential of up to 46%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-those-looking-for-good-businesses-to-invest-in-for-the-medium-term-5-large-cap-stocks-with-upside-potential-of-up-to-46/articleshow/125975614.cms",
            "description": "While it may appear to be easy, few investors have the ability to hold on to a stock ignoring the euphoria or fear on the street. That is probably the reason why only few are able to make big money on the street. So here’s what should be kept in mind: The market has gone through both long and short phases of correction several times. Some stocks survived all that and created wealth. Those are the stocks you want to hold. And, basically, a good stock means a good underlying business.",
            "pubDate": "2025-12-15T09:29:23.840645"
        },
        {
            "title": "Ashish Kacholia to Mukul Agrawal: Star investor tag no guarantee for returns as 7 of 10 stock portfolios see losses in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-to-mukul-agrawal-star-investor-tag-no-guarantee-for-returns-as-7-of-10-stock-portfolios-see-losses-in-2025/articleshow/125975715.cms",
            "description": "The star investor tag offered little protection in 2025, with seven out of ten well-known stock pickers seeing portfolio losses amid a sharp smallcap downturn. Data shows heavy exposure to smaller stocks hurt returns, while investors with a largecap bias fared relatively better, highlighting the limits of reputation-driven investing.",
            "pubDate": "2025-12-15T09:29:23.840756"
        },
        {
            "title": "Unique Picks: 11 stocks held by a single MF scheme in November, plunge up to 65% in CY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unique-picks-11-stocks-held-by-a-single-mf-scheme-in-november-plunge-up-to-65-in-cy25/slideshow/125975653.cms",
            "description": "ETMarkets examined mutual fund portfolios to pinpoint stocks held exclusively by a single mutual fund scheme. In the initial screening for the month of November 2025, 204 such stocks were identified. This list was further refined to include only those with equity mutual fund holdings above Rs 10 crore as of November 2025, bringing the final selection down to 23 stocks.",
            "pubDate": "2025-12-15T09:29:23.840870"
        },
        {
            "title": "Urban Company shares fall 4% as shareholder lock-in ends. Stock now 40% down from peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-fall-4-as-shareholder-lock-in-ends-stock-now-40-down-from-peak/articleshow/125977467.cms",
            "description": "Urban Company shares declined sharply as the three-month anchor lock-in expired, bringing additional shares into the market. Despite strong listing gains and healthy anchor participation, the stock has corrected significantly from its post-listing peak amid heavy trading volumes.",
            "pubDate": "2025-12-15T10:46:19.866009"
        },
        {
            "title": "Indian investors’ global exposure surges 4x to $1.6 billion; Tesla, NVIDIA among top 10 popular picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-investors-global-exposure-surges-4x-to-1-6-billion-tesla-nvidia-among-top-10-popular-picks/articleshow/125977308.cms",
            "description": "India’s global investing footprint is expanding rapidly, with participation spreading beyond metros to over 145 cities. Driven largely by young investors from Tier II and III towns, overseas investments have surged past $1.6 billion, with a clear shift towards long-term, diversified portfolios dominated by global stocks and ETFs.",
            "pubDate": "2025-12-15T10:46:19.866139"
        },
        {
            "title": "Market Wrap: Sensex slips 54 points, Nifty below 26,050 as trade jitters and foreign outflows weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slips-54-points-nifty-below-26050-as-trade-jitters-and-foreign-outflows-weigh/articleshow/125976974.cms",
            "description": "Indian stock markets saw a modest decline on Monday. This ended a two-day rally. Weakness in auto and financial sectors pulled down the markets. Foreign investors continued to pull money out. Uncertainty over a US-India trade deal also impacted sentiment. The Indian Rupee reached a record low against the dollar. The Sensex and Nifty both closed lower.",
            "pubDate": "2025-12-15T10:46:19.866340"
        },
        {
            "title": "10 largecap stocks with strong net profit growth in Q2 FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-largecap-stocks-with-strong-net-profit-growth-in-q2-fy26/slideshow/125977623.cms",
            "description": "A quarterly high net profit growth on a year-on-year (YoY) basis indicates a company showing substantial improvement in profitability compared to the same quarter last year. Among NSE large-cap stocks, the top 10 companies have reported quarterly net profit growth surpassing 80% YoY, according to StockEdge.com’s profitability scan data.",
            "pubDate": "2025-12-15T10:59:00.293226"
        },
        {
            "title": "Federal Bank and 5 other stocks hit 52-week highs; gains of up to 17% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-and-5-other-stocks-hit-52-week-highs-gains-of-up-to-17-in-a-month/slideshow/125979380.cms",
            "description": "Benchmark Sensex slipped 54 points to close at 85,213 on Monday. Despite the mild weakness in the broader market, six stocks from the BSE 200 index touched fresh 52-week highs, marking their strongest levels in the past year. Such breakouts are often viewed as a sign of underlying bullish momentum and may indicate scope for further near-term upside.",
            "pubDate": "2025-12-15T13:13:05.653180"
        },
        {
            "title": "Stock Radar: Channel breakout makes Max Financial Services an attractive buy; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-channel-breakout-makes-max-financial-services-an-attractive-buy-check-target-stop-loss/articleshow/125932831.cms",
            "description": "Max Financial Services stock has broken out of a channel pattern on its weekly chart. Experts suggest short-term traders can buy the stock for a target of Rs 1,820 in the next 3-4 weeks. The stock is trading above key moving averages and shows positive momentum. Traders can consider buying on dips with a stop loss below Rs 1,640.",
            "pubDate": "2025-12-15T13:13:05.653287"
        },
        {
            "title": "Gainers & Losers: PVR Inox, Urban Company among 8 stocks that moved  most on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-pvr-inox-urban-company-among-8-stocks-that-moved-most-on-monday/slideshow/125978499.cms",
            "description": "",
            "pubDate": "2025-12-15T13:13:05.653383"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125983691.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-15T14:44:40.072590"
        },
        {
            "title": "US stocks open higher as investors gear up for data-packed week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-investors-gear-up-for-data-packed-week/articleshow/125983741.cms",
            "description": "Wall Street's main indexes opened higher on Monday, rebounding from a tech-driven rout last week, while investors braced for a barrage of economic data that could set the course for interest rates.",
            "pubDate": "2025-12-15T14:44:40.072719"
        },
        {
            "title": "Market Trading Guide: Buy Indian Metals and a smallcap stock on Tuesday for up to 14% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-indian-metals-and-a-smallcap-stock-on-tuesday-for-up-to-14-gains/slideshow/125983796.cms",
            "description": "India's heartbeat index Nifty ended its two-session gaining streak to close with minor declines on Monday, dragged by auto, financials and pharma stocks though IT and FMCG checked any sharp decline. The index faced resistance near 26,050 before closing slightly lower. Decoding the current trends, Rupak De, Senior Technical Analyst at LKP Securities said that Nifty encountered resistance at the falling trendline on the hourly chart. Moreover, the hourly RSI has witnessed a bearish crossover and is trending lower, indicating bearishness in the market, he said. \"Overall, the index is likely to remain range-bound between 25,900 and 26,100. A decisive move beyond this range could trigger a directional move,\" De added.Here are 2 stock recommendations for Tuesday:",
            "pubDate": "2025-12-15T14:44:40.072873"
        },
        {
            "title": "Two Trades for Today: A pharma major for a 6.75% rise; stock of a large-cap wire manufacturer for an almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-pharma-major-for-a-6-75-rise-stock-of-a-large-cap-wire-manufacturer-for-an-almost-7-gain/articleshow/125983169.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-15T14:44:40.072979"
        },
        {
            "title": "HSBC invests in KSH International's Rs 213 crore anchor round ahead of IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-invests-in-ksh-internationals-rs-213-crore-anchor-round-ahead-of-ipo/articleshow/125985362.cms",
            "description": "KSH International raised Rs 213 crore from anchor investors ahead of its IPO, indicating strong institutional interest. The magnet winding wires maker opens its public issue on December 16, backed by global funds and domestic mutual funds.",
            "pubDate": "2025-12-15T17:01:19.587060"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/125985178.cms",
            "description": "Indian equities ended marginally lower as auto and financial stocks dragged amid foreign outflows, rupee weakness and trade uncertainty. Analysts see markets staying range-bound, with earnings expectations and global macro cues guiding near-term direction.",
            "pubDate": "2025-12-15T17:01:19.587184"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-30/articleshow/125986825.cms",
            "description": "2025 has not been an easy year for the bulls. When we say bulls, we include retail investors. That’s because all retail investors are, by nature, bullish. And rightly so: It pays to be bullish about the India story. Now, after a long phase of correction we have a large number of stocks at levels where the chances are that being bullish on them will deliver returns. But while being bullish, just be selective and cautious as well.",
            "pubDate": "2025-12-15T17:32:17.040564"
        },
        {
            "title": "Stock Radar: United Spirits stock showing signs of bottoming out; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-united-spirits-stock-showing-signs-of-bottoming-out-time-to-buy/articleshow/125976589.cms",
            "description": "United Spirits stock is showing signs of recovery. Experts recommend buying the stock for potential gains. The brewery company has been consolidating and is now trading above key moving averages. This indicates a positive outlook for the stock. Investors can consider buying in the current range for a target of Rs 1,660.",
            "pubDate": "2025-12-15T23:44:18.559336"
        }
    ]
}