{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-05T05:41:32.495238",
    "items": [
        {
            "title": "EV poster boy Ola’s 64% crash is worst among peers - stock now half its IPO price. Is the selloff over yet?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ev-poster-boy-olas-64-crash-is-worst-among-peers-stock-now-half-its-ipo-price-is-the-selloff-over-yet/articleshow/125780131.cms",
            "description": "Ola Electric shares plunged to a new lifetime low, losing over half their IPO value and significantly underperforming the booming auto sector. The company faces declining market share, persistent losses, and controversies. Analysts see continued downside, though some suggest a wait-and-watch approach for investors with high risk appetite, citing potential for a rebound similar to other beaten-down stocks.",
            "pubDate": "2025-12-05T04:28:41.838995"
        },
        {
            "title": "Sensex, Nifty off to flat start as Dalal Street braces for RBI rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-off-to-flat-start-as-dalal-street-braces-for-rbi-rate-decision/articleshow/125780146.cms",
            "description": "Indian stock markets began Friday trading with caution. The Sensex and Nifty showed little movement as investors awaited the Reserve Bank of India's policy announcement. This comes after a brief recovery on Thursday. Strong economic growth and a weakening rupee are influencing expectations. The Sensex saw a small gain, and the Nifty also opened higher.",
            "pubDate": "2025-12-05T04:28:41.839129"
        },
        {
            "title": "Bharti Airtel among 4 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-among-4-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125779519.cms",
            "description": "On December 4, in the Nifty50 pack, four stocks appeared in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal occurs when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) is rising, suggesting strengthening price momentum. This may signal potential upward movement and help traders identify buying opportunities.",
            "pubDate": "2025-12-05T04:28:41.839234"
        },
        {
            "title": "IndiGo shares drop amid flight fiasco. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-amid-large-scale-flight-cancellations-regulatory-exemption-requests-should-you-buy-sell-or-hold/articleshow/125780001.cms",
            "description": "IndiGo is facing significant operational disruptions, leading to over 300 daily flight cancellations due to new pilot duty-hour regulations. The airline has requested a two-month exemption from specific night duty rules from the DGCA, aiming to restore stable operations by February 10, 2026.",
            "pubDate": "2025-12-05T04:28:41.839332"
        },
        {
            "title": "HUL demerger record date today: What it means for shareholders & key details to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-demerger-record-date-today-what-it-means-for-shareholders-key-details-to-know/articleshow/125779947.cms",
            "description": "Hindustan Unilever's ice-cream business, Kwality Wall's, is officially spinning off today, December 5th, with shareholders set to receive new shares. This strategic move aims to unlock value by creating a standalone entity for its rapidly growing ice-cream vertical.  The newly formed company is expected to list on the stock exchange in February 2026.",
            "pubDate": "2025-12-05T04:28:41.839428"
        },
        {
            "title": "ITC Hotels shares in focus as BAT plans up to 15.5% stake sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-shares-in-focus-as-bat-plans-up-to-15-5-stake-sale/articleshow/125779687.cms",
            "description": "ITC Hotels shares will be in focus after British American Tobacco (BAT) announced plans to sell up to a 15.3% stake. BAT, which acquired the stake during ITC’s hotel business demerger, aims to use the proceeds to reduce leverage and meet its 2026 financial targets. ITC Hotels became a separately listed entity in January 2025.",
            "pubDate": "2025-12-05T04:28:41.839526"
        },
        {
            "title": "HUL shares in focus on record date for ice cream business demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-in-focus-on-record-date-for-ice-cream-business-demerger/articleshow/125779576.cms",
            "description": "Hindustan Unilever Ltd (HUL) has set December 5, 2025, as the record date for the demerger of its ice-cream business into Kwality Wall’s (India) Limited (KWIL). This strategic move aims to unlock value by separating the high-growth ice-cream segment. The demerger is scheduled to be effective December 1, 2025, with KWIL expected to list in February 2026.",
            "pubDate": "2025-12-05T04:28:41.839627"
        },
        {
            "title": "RIL shares in focus as S&P Global upgrades rating to 'A-' on cash flow stability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-as-sp-global-upgrades-rating-to-a-on-cash-flow-stability/articleshow/125779465.cms",
            "description": "Reliance Industries' credit rating has been upgraded to 'A-' by S&P Global Ratings, citing improved cash flow stability and a strong earnings outlook driven by its consumer-facing businesses. The agency anticipates prudent financial management and expects earnings growth to outpace high capital expenditure, maintaining a stable outlook.",
            "pubDate": "2025-12-05T04:28:41.839722"
        },
        {
            "title": "Purple Wave Infocom shares to debut today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/purple-wave-infocom-shares-to-debut-today-heres-what-gmp-indicates/articleshow/125778875.cms",
            "description": "Purple Wave Infocom is set to debut on the BSE SME platform today after a successful IPO, raising Rs 31.45 crore. The digital PRO AV solutions provider saw strong investor demand, particularly from institutional buyers. Despite neutral pre-listing grey market sentiment, the company's robust financial growth and oversubscription across all investor categories will be closely watched for its market debut.",
            "pubDate": "2025-12-05T04:28:41.839833"
        },
        {
            "title": "Logiciel Solutions IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/logiciel-solutions-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/125778851.cms",
            "description": "Logiciel Solutions' Rs 40 crore IPO, which opened on November 28 and closed on December 2, is set to debut on the BSE SME platform on December 5. The issue saw selective investor participation, with retail investors driving subscriptions. Grey market activity indicates neutral expectations for the listing day performance.",
            "pubDate": "2025-12-05T04:28:41.839940"
        },
        {
            "title": "Exato Technologies shares to list today. GMP hints at maximum premium on debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/exato-technologies-shares-to-list-today-gmp-hints-at-maximum-premium-on-debut/articleshow/125778814.cms",
            "description": "Exato Technologies is set to list on the BSE SME platform. The company's initial public offering received an overwhelming response from investors. The issue was subscribed over 947 times. High net-worth individuals and retail investors showed strong interest. The grey market premium indicates robust listing expectations. Exato Technologies is a technology transformation company.",
            "pubDate": "2025-12-05T04:28:41.840037"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/125778729.cms",
            "description": "In the Nifty500 pack, nine stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 4, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-05T04:28:41.840132"
        },
        {
            "title": "Sebi bans influencer Avadhut Sathe from stock market and orders return of Rs 601 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bans-influencer-avadhut-sathe-from-stock-market-and-orders-return-of-rs-601-crore/articleshow/125778677.cms",
            "description": "Sebi has cracked down on Avadhut Sathe and his firm, Avadhut Sathe Trading Academy. They are banned from the stock market and must return Rs 601.37 crore. This money was collected from over 3.37 lakh investors. Sathe provided unregistered investment advice and stock tips. Sebi's investigation covered activities from July 2017 to October 2025.",
            "pubDate": "2025-12-05T04:28:41.840223"
        },
        {
            "title": "US stocks end flat, supported by Fed hopes but dragged by Amazon",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-flat-supported-by-fed-hopes-but-dragged-by-amazon/articleshow/125778586.cms",
            "description": "U.S. stocks closed near unchanged as investors assessed mixed labor market data and anticipated a Federal Reserve interest rate cut. Initial jobless claims fell to a three-year low, though the November payrolls report remains pending. Markets are pricing in an 87% chance of a 25 basis point cut this month.",
            "pubDate": "2025-12-05T04:28:41.840311"
        },
        {
            "title": "GIFT Nifty down 10 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125778330.cms",
            "description": "Indian markets saw a slight recovery on Thursday, ending a four-day losing streak. However, gains were limited by foreign investor selling and a weakening rupee. Analysts anticipate continued market consolidation. A potential Reserve Bank of India rate cut could provide a short-term boost. The India VIX, a fear gauge, saw a decline.",
            "pubDate": "2025-12-05T04:28:41.840404"
        },
        {
            "title": "Stocks in news: HUL, IndiGo, ITC Hotels, Zaggle Prepaid, Star Health",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hul-indigo-itc-hotels-zaggle-prepaid-star-health/articleshow/125778309.cms",
            "description": "Markets ended marginally higher on Thursday, taking a breather after recent declines, with the rupee's weakness and caution ahead of the MPC policy outcome persisting. HUL's ice-cream demerger, IndiGo's pilot rest duty waiver, Star Health's claim rejection, ITC Hotels' stake sale by BAT, and Zaggle Prepaid's acquisition of Rivpe Technology were key news drivers.",
            "pubDate": "2025-12-05T04:28:41.840495"
        },
        {
            "title": "US affordability squeeze eases slightly as key delinquency metrics stabilize",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-affordability-squeeze-eases-slightly-as-key-delinquency-metrics-stabilize/articleshow/125781712.cms",
            "description": "Despite fears of an affordability crisis, US consumer delinquency indicators show surprising resilience. While some metrics are elevated, credit card delinquencies are stabilizing, and overall debt servicing remains historically low. Strong wage growth offers a buffer, suggesting household finances might be weathering the storm better than anticipated, though student loan defaults pose a risk.",
            "pubDate": "2025-12-05T05:41:23.696387"
        },
        {
            "title": "CAMS shares plunge 41% in early trade! Here’s why investors shouldn’t worry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cams-shares-plunge-41-in-early-trade-heres-why-investors-shouldnt-worry/articleshow/125780976.cms",
            "description": "CAMS shares dropped 41% in early trade as the stock began trading ex-split following its 1:5 split, reducing the face value from Rs 10 to Rs 2. The steep fall is a routine technical adjustment reflecting the increased share count, with no impact on fundamentals. The split aims to boost liquidity and enhance retail participation.",
            "pubDate": "2025-12-05T05:41:23.696503"
        },
        {
            "title": "Biocon among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/125780708.cms",
            "description": "There was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% on December 4 as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-05T05:41:23.696592"
        },
        {
            "title": "RBI Policy: Rate-sensitive banking, NBFC, auto and realty stocks gain up to 2% after 25 bps repo rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-policy-rate-sensitive-banking-nbfc-auto-and-realty-stocks-gain-up-to-2-after-25-bps-repo-rate-cut/articleshow/125780929.cms",
            "description": "Banking, NBFC, auto, and realty stocks saw gains of up to 2% on Friday following the Reserve Bank of India's 25 basis point repo rate cut. This move, aligning with expectations, was driven by record-low retail inflation and a stable price outlook, aiming to bolster economic growth.",
            "pubDate": "2025-12-05T05:41:23.696679"
        },
        {
            "title": "Are trillion-dollar valuations for Nvidia and AI giants built on fairy tale? Aswath Damodaran decodes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-trillion-dollar-valuations-for-nvidia-and-ai-giants-built-on-fairy-tale-aswath-damodaran-decodes/articleshow/125780915.cms",
            "description": "Valuation guru Aswath Damodaran questions if trillion-dollar market caps, particularly Nvidia's, are driven by genuine performance or investor fantasy. He uses a 'possible, plausible, probable' framework to assess Nvidia's revenue needs and warns of the 'Big Market Delusion' in AI, where aggregate valuations outstrip realistic revenue potential.",
            "pubDate": "2025-12-05T05:41:23.696760"
        },
        {
            "title": "Global hedge funds outpace major indexes with 15% returns in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-hedge-funds-outpace-major-indexes-with-15-returns-in-2025/articleshow/125780846.cms",
            "description": "Global hedge funds are ending 2025 on a strong footing, delivering nearly 15% returns through November, driven by stock pickers, quant strategies, and a standout rally in healthcare. While long-short equity funds outperformed major U.S. indices, TMT-focused funds lagged due to a tech sell-off. Regionally, managers remained bullish on North America, added exposure to Japan, and pared positions in Europe and Hong Kong.",
            "pubDate": "2025-12-05T05:41:23.696847"
        },
        {
            "title": "India Cements among 5 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-cements-among-5-stocks-closed-crossing-above-vwap/slideshow/125780544.cms",
            "description": "The closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on December 4, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-12-05T05:41:23.696929"
        },
        {
            "title": "Nifty to hit 29,000 in 2026, BofA lists 7 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-to-hit-29000-in-2026-bofa-lists-7-reasons-why/slideshow/125780416.cms",
            "description": "Bank of America Securities expects the Nifty 50 to reach 29,000 by December 2026, an 11.4% upside, driven entirely by earnings growth rather than valuation re-rating, as the index already trades near its +1SD valuation band. The brokerage said large-caps will continue to outperform while domestic flows hold steady. BofA also flagged a supportive macro backdrop with scope for modest growth acceleration in FY27. Here are the seven factors likely to push the index higher:",
            "pubDate": "2025-12-05T05:41:23.697011"
        }
    ]
}