{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-03T20:55:51.874907",
    "items": [
        {
            "title": "GIFT Nifty signals a muted start for D-Street. Here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-signals-a-muted-start-for-d-street-heres-the-trading-setup-for-todays-session/articleshow/113007579.cms",
            "description": "Indian equity markets have started September positively, supported by favorable global cues and a general positive sentiment. Analysts advise a pragmatic approach in stock selection and position management. Keeping an eye on global markets is crucial as they significantly influence the initial market tone.",
            "pubDate": "2024-09-03T01:42:55.948235"
        },
        {
            "title": "Stocks in news: ICICI Bank, Vedanta, HAL, Adani Green, Medi Assist Healthcare",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-icici-bank-vedanta-hal-adani-green-medi-assist-healthcare/articleshow/113007549.cms",
            "description": "Stocks in news: Equity markets started positively, with modest gains during a subdued session. Key focus includes ICICI Bank's clarification on Sebi chief's salary, Vedanta's interim dividend, Adani Green's $444 million joint venture, HAL's aero-engine procurement approval, and more developments involving Gensol Engineering, Medi Assist Healthcare, and IEX's arm ICX.",
            "pubDate": "2024-09-03T01:42:55.948361"
        },
        {
            "title": "Asian equities advance as Yen steadies after drop: Markets wrap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-equities-advance-as-yen-steadies-after-drop-markets-wrap/articleshow/113007533.cms",
            "description": "Asian stocks saw gains with Japan leading, while the yen steadied after a recent drop. Traders are watching for signs of China's economic troubles and upcoming US jobs data, which could influence Federal Reserve actions. Oil prices rose due to supply disruptions in Libya.",
            "pubDate": "2024-09-03T01:42:55.948565"
        },
        {
            "title": "Daily Trading Desk: For short term gains, two financial service stocks for  4% & 7% upmove in a positional trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/daily-trading-desk-for-short-term-gains-two-financial-service-stocks-for-4-7-upmove-in-a-positional-trade/articleshow/113001295.cms",
            "description": "Markets had a controlled session with the Nifty 50 closing slightly higher by 42.80 points. Financials stocks are back in momentum race. Financial services stocks like Cholamandalam Investment and Finance Company and Bajaj Holdings and Investment showed promising signs of breakout. Cholamandalam may reach Rs 1560 while Bajaj Holdings could rise by 7%, reflecting bullish trends backed by technical indicators.",
            "pubDate": "2024-09-03T01:42:55.948659"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/112999581.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analysis, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking a quantitative analysis of five key investment tools - earnings, fundamentals, relative valuation, risk and price momentum.",
            "pubDate": "2024-09-03T01:42:55.948752"
        },
        {
            "title": "These largecaps have ‘strong buy’ & ‘buy’ recos and upside potential of more than 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-largecaps-have-strong-buy-buy-recos-and-upside-potential-of-more-than-24/articleshow/112999532.cms",
            "description": "While the market is surely under the control of bulls, there are initial indications that the Street might see some volatility due to profit booking. One has to make a distinction between what is causing the volatility, because the underlying reason plays an important part in deciding the magnitude and time period of correction.  First phase of the volatility is normally led by large cap stocks, so there could be some selling pressure, But the other fact is that recovery in the market is also largely led by the large cap and they stabilized much before other segments of the market.  ET screener powered by Refinitiv’s Stock Report Plus lists down quality stocks with high upside potential over the next 12 months, having an average recommendation rating of “buy” or \"strong buy\". The screener applies different algorithms for all BSE and NSE stocks.",
            "pubDate": "2024-09-03T01:42:55.948845"
        },
        {
            "title": "Government to launch OFS for 6.78% stake in GIC, floor price set at Rs 395",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/government-to-launch-ofs-for-6-78-stake-in-gic-floor-price-set-at-rs-395/articleshow/113037379.cms",
            "description": "The Centre is set to launch an Offer for Sale (OFS) of 59.5 million shares in General Insurance Corp (GIC), reducing its stake from 85.78% to 79%. The floor price is Rs 395 per share, expected to raise around Rs 4,701 crore. This move aligns with SEBI’s public shareholding requirement.",
            "pubDate": "2024-09-03T20:55:30.859472"
        },
        {
            "title": "Market Trading Guide: Bikaji, Raymond among 4 stock recommendations for Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-bikaji-raymond-among-4-stock-recommendations-for-wednesday/slideshow/113035544.cms",
            "description": "Benchmark Nifty remained range bound on Tuesday, closing positively for the 14th consecutive day. Analysts said the index encountered resistance at 25,300, highlighting strong call option writing at that strike.\"Moving forward, only a decisive move above 25,300 might trigger a rally toward 25,500. On the downside, support is positioned at 25,200 and 25,000,\" said Rupak De, Senior Technical Analyst, LKP SecuritiesHere are 4 stock recommendations for Wednesday:",
            "pubDate": "2024-09-03T20:55:30.859609"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-wednesday/articleshow/113035316.cms",
            "description": "Indian ended flat on Tuesday, with the Nifty index extending its gains marginally. Analysts expect 25,200 to be key support, with resistance at 25,350-25,400 and a strong hurdle at 25,500. Mixed global signals and manufacturing slowdown contribute to market caution.",
            "pubDate": "2024-09-03T20:55:30.859719"
        },
        {
            "title": "Banking liquidity at Rs 2.23 lakh crore surplus; WACR drops to 6.47",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banking-liquidity-at-rs-2-23-lakh-crore-surplus-wacr-drops-to-6-47/articleshow/113033521.cms",
            "description": "The banking system liquidity as measured by net absorption of funds by the RBI, stood at a surplus of Rs. 2.23 lakh crore, as of September 2nd, central bank data showed.",
            "pubDate": "2024-09-03T20:55:30.859817"
        },
        {
            "title": "These 5 commodities stocks hit fresh 52-week highs and rallied up to 35% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-commodities-stocks-hit-fresh-52-week-highs-and-rallied-up-to-35-in-a-month/slideshow/113033340.cms",
            "description": "On Tuesday, India's benchmark index Sensex settled nearly unchanged with a slight negative bias at 82,555. Despite this flat trading, five stocks from the BSE commodities index reached their highest prices in the past year. Achieving a 52-week high is significant as it indicates the highest price a stock has attained over the past year, providing valuable insights for traders and investors. This milestone is important for evaluating a stock's current value and predicting future price movements.",
            "pubDate": "2024-09-03T20:55:30.859915"
        },
        {
            "title": "PE firm WestBridge Capital sells 1.5% stake in AU Small Finance Bank for Rs 736 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pe-firm-westbridge-capital-sells-1-5-stake-in-au-small-finance-bank-for-rs-736-crore/articleshow/113032104.cms",
            "description": "Private equity firm WestBridge Capital on Tuesday divested a 1.5 per cent stake in AU Small Finance Bank for Rs 736 crore via open market transactions.",
            "pubDate": "2024-09-03T20:55:30.860016"
        },
        {
            "title": "Dow drops 500 pts, Nasdaq 343 pts following weak manufacturing data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-ahead-of-data-packed-week/articleshow/113030904.cms",
            "description": "U.S. stocks fell on Tuesday following weak economic updates. The S&P 500, Dow Jones, and Nasdaq all saw declines. Treasury yields also dropped after a report showed U.S. manufacturing contracted in August. Investors are now looking to upcoming economic reports and the Federal Reserve's potential interest rate cuts to gauge the economy's health.",
            "pubDate": "2024-09-03T20:55:30.860111"
        },
        {
            "title": "Govt to sell 6.78% stake in GIC Re via OFS, sets floor price at Rs 395/share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/government-to-sell-6-78-stake-in-gic-re-sets-floor-price-at-rs-395/share/articleshow/113030433.cms",
            "description": "The issue, estimated at Rs 4,701 crore, opens for non-retail investors on Wednesday and for retail investors on Thursday. Employees can subscribe to 50,000 shares.",
            "pubDate": "2024-09-03T20:55:30.860208"
        },
        {
            "title": "NPA provisions continue to rise sequentially in Q2 amid seasonal weakness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/npa-provisions-continue-to-rise-sequentially-in-q2-amid-seasonal-weakness/articleshow/113030330.cms",
            "description": "The aggregate loan loss provisioning by publicly listed banks in the June quarter increased to a four-quarter high led by a select banks including public sector banks (PSBs) such as State Bank of India (SBI) and Central Bank of India and private sector banks such as Axis Bank, Kotak Mahindra Bank, and Bandhan Bank.",
            "pubDate": "2024-09-03T20:55:30.860310"
        },
        {
            "title": "Technical Breakout Stocks: How to trade Godrej Industries, Jindal Saw and Bombay Burmah on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-breakout-stocks-how-to-trade-godrej-industries-jindal-saw-and-bombay-burmah-on-wednesday/slideshow/113029910.cms",
            "description": "Indian markets closed mixed on Tuesday tracking muted global cues and due to profit-taking at higher levels. The S&P BSE Sensex closed flat with a negative bias.",
            "pubDate": "2024-09-03T20:55:30.860406"
        },
        {
            "title": "Cong questions ICICI's 'no salary paid' to Buch claim, asks why 'retiral benefit' non-uniform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cong-questions-icicis-no-salary-paid-to-buch-claim-asks-why-retiral-benefit-non-uniform/articleshow/113029269.cms",
            "description": "The Congress on Tuesday questioned the ICICI Bank's assertion that it had not paid any salary or granted ESOPs to SEBI Chairperson Madhabi Buch after her retirement and asked that if the amount paid to her was her \"retiral benefit\", why was it non-uniform both in terms of its frequency and amount.",
            "pubDate": "2024-09-03T20:55:30.860506"
        },
        {
            "title": "Are they making a quiet comeback? 4 stocks from diagnostics sector with upside potential of up to 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-they-making-a-quiet-comeback-4-stocks-from-diagnostics-sector-with-upside-potential-of-up-to-35/articleshow/113026811.cms",
            "description": "From being one of the most sought after sectors during 2020 to 2021 and trading at extremely high valuations, diagnostic stocks have been underperforming the market for a large part of the last three years. Today, hardly anyone on the street talks about diagnostic stocks and sometimes not being in the news is probably the best thing for stock. In this period when there is no chatter on the street, a number of diagnostic stocks have been making a quiet comeback in the last six months. Because this performance is coming after a long phase of the valuation adjustment, it is probably a time to look at them without any strong positive and negative bias as the bellwether stock has shown improvement.",
            "pubDate": "2024-09-03T20:55:30.860601"
        },
        {
            "title": "Tech View: Nifty forms Inside Bar candle on the charts. Here’s how to trade on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-forms-inside-bar-candle-on-the-charts-heres-how-to-trade-on-wednesday/articleshow/113026713.cms",
            "description": "Nifty ended Tuesday's session flat, forming an Inside Bar pattern on the daily chart. Analysts suggest that the near-term uptrend remains intact, with potential upside targets at 25,800 if it breaks above 25,400. Immediate support is seen at 25,100 levels. Traders are advised to watch for a breakout or dip for further direction.",
            "pubDate": "2024-09-03T20:55:30.860739"
        },
        {
            "title": "Trump has radical economic policies, will bring uncertainty if he gets elected: Nouriel Roubini",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-has-radical-economic-policies-will-bring-uncertainty-if-he-gets-elected-nouriel-roubini/videoshow/113026352.cms",
            "description": "Economist Nouriel Roubini predicts a low risk of US recession, but warns of significant geopolitical threats that could destabilize global markets. He sees a potential oil shock if the Israel-Iran conflict escalates and heightened risks if US-China tensions over Taiwan worsen. As the US election approaches, Roubini suggests that a Harris win would ensure stability, while a Trump victory could bring uncertainty. For India, Roubini advises focusing on IT services and high-value manufacturing to drive future growth, rather than low-wage, labor-intensive industries. Watch the full interview here.",
            "pubDate": "2024-09-03T20:55:30.860835"
        },
        {
            "title": "Domestic funds stay put in equities with sustained inflow in August",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/domestic-funds-stay-put-in-equities-with-sustained-inflow-in-august/articleshow/113024736.cms",
            "description": "The 12-month cumulative rolling investment by domestic mutual funds reached a record high of Rs 3.3 lakh crore ($39 billion) in August, according to SEBI data, driven by new opportunities in the primary market including IPOs and qualified institutional placements.",
            "pubDate": "2024-09-03T20:55:30.860924"
        },
        {
            "title": "'IPO trading is in Gujju genes!' says Zerodha's Nithin Kamath on high Gujarati participation in IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-trading-is-in-gujju-genes-zerodhas-nithin-kamath-explains/articleshow/113022748.cms",
            "description": "Zerodha founder Nithin Kamath highlighted a SEBI study showing Gujaratis, despite being 9% of the investor base, represent 40% of IPO participation. Kamath humorously noted that IPO trading seems embedded in Gujarat's culture, as reflected in retail and HNI categories.",
            "pubDate": "2024-09-03T20:55:30.861020"
        }
    ]
}