{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-28T05:39:26.787529",
    "items": [
        {
            "title": "Japan set to boost shipbuilding, energy and defence ties with the US",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-set-to-boost-shipbuilding-energy-and-defence-ties-with-the-us/slideshow/124864920.cms",
            "description": "U.S. President Donald Trump and Japan’s Prime Minister Sanae Takaichi are holding high-stakes talks in Tokyo on security and trade, marking Trump’s first visit to Japan since 2019. The agenda for the meeting covers a wide range of areas including shipbuilding, power infrastructure, automobile trade, soybeans, natural gas, rare earths, and defence spending. (Source: Reuters)",
            "pubDate": "2025-10-28T05:39:06.907196"
        },
        {
            "title": "Valuation stretch to ED scrutiny: 5 risks to be mindful of before investing in Lenskart IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuation-stretch-to-ed-scrutiny-5-risks-to-be-mindful-of-before-investing-in-lenskart-ipo/slideshow/124864680.cms",
            "description": "India’s eyewear giant Lenskart Solutions is one of the most anticipated IPOs of 2025. But even as investor enthusiasm builds, the company’s filings reveal several key risks worth noting. Here are five factors prospective investors should watch before subscribing.",
            "pubDate": "2025-10-28T05:39:06.907325"
        },
        {
            "title": "SRF among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/srf-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124864522.cms",
            "description": "As of October 27, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-28T05:39:06.907440"
        },
        {
            "title": "Lenskart IPO set to soar with GMP up 27% ahead of listing. Check key details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenskart-ipo-set-to-soar-with-gmp-up-27-ahead-of-listing-check-key-details/articleshow/124864276.cms",
            "description": "Lenskart’s ₹7,278 crore IPO opens on October 31, with strong investor demand reflected in a 27% grey market premium and backed by global investors like SoftBank and Temasek. The eyewear major plans to use fresh funds for expansion and technology upgrades. Analysts foresee strong listing gains and sustained growth momentum.",
            "pubDate": "2025-10-28T05:39:06.907543"
        },
        {
            "title": "Investors brace for Trump–Xi trade talks amid familiar optimism and caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-brace-for-trumpxi-trade-talks-amid-familiar-optimism-and-caution/slideshow/124864520.cms",
            "description": "Investors are stepping into this week’s trade talks between the United States and China with a familiar mix of excitement and caution. There’s optimism around the possibility of a truce, but also an awareness that the final deal might not live up to the headlines.",
            "pubDate": "2025-10-28T05:39:06.907645"
        },
        {
            "title": "Azim Premji-backed PI Opportunities Fund to pocket Rs 350 crore, set for a 1,565% windfall in Lenskart IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/azim-premji-backed-pi-opportunities-fund-to-pocket-rs-350-crore-set-for-a-1565-windfall-in-lenskart-ipo/articleshow/124863793.cms",
            "description": "Azim Premji-backed PI Opportunities Fund is set for a massive payday from Lenskart's upcoming IPO. The fund's initial Rs 21 crore investment is projected to yield Rs 350 crore, a staggering 1,565% return. Founder Peyush Bansal and other early investors are also poised for significant gains as the eyewear giant prepares for its Dalal Street debut.",
            "pubDate": "2025-10-28T05:39:06.907762"
        },
        {
            "title": "Liquidity crunch eases hopes for Fed to end quantitative tightening",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/liquidity-crunch-eases-hopes-for-fed-to-end-quantitative-tightening/slideshow/124863906.cms",
            "description": "A massive trade in U.S. rate futures is drawing market attention as investors prepare for the Federal Reserve’s expected move to end its balance sheet reduction programme, known as quantitative tightening. The trade reflects shifting expectations for liquidity conditions and short-term rates. (Source: Reuters)",
            "pubDate": "2025-10-28T05:39:06.907861"
        },
        {
            "title": "Buy, Sell or Hold: Citi reduces target price on Bata India; JM Financial recommends buy on Supreme Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-reduces-target-price-on-bata-india-jm-financial-recommends-buy-on-supreme-industries/articleshow/124863483.cms",
            "description": "Brokerages issued mixed calls as Citi downgraded Bata India on weak Q2 results, stayed bullish on Sona BLW, while JM Financial reaffirmed a ‘Buy’ on Supreme Industries despite trimmed estimates.",
            "pubDate": "2025-10-28T05:39:06.907962"
        },
        {
            "title": "JK Tyre shares surge 7% after Q2 profit jumps 62% YoY on strong volumes, softer input costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jk-tyre-shares-in-focus-after-q2-profit-jumps-62-on-strong-volumes-softer-input-costs/articleshow/124863556.cms",
            "description": "JK Tyre reported a 62.3% jump in Q2 consolidated net profit to ₹226.86 crore, driven by strong domestic demand, higher exports, and improved margins. Revenue rose 10.8% to ₹4,011 crore from ₹3,622 crore a year ago.",
            "pubDate": "2025-10-28T05:39:06.908057"
        },
        {
            "title": "Rekha Jhunjhunwala purchased 2.3 crore shares in this multibagger midcap bank before Blackstone’s entry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-purchased-2-3-crore-shares-in-this-multibagger-midcap-bank-before-blackstones-entry/articleshow/124863512.cms",
            "description": "Ace investor Rekha Jhunjhunwala has significantly increased her stake in Federal Bank, acquiring an additional 2.3 crore shares in Q2 FY26. This move precedes Blackstone's substantial $705 million investment, positioning the US private equity firm as the bank's largest shareholder. Brokerages are bullish on Federal Bank following these developments.",
            "pubDate": "2025-10-28T05:39:06.908156"
        },
        {
            "title": "Sensex jumps 200 pts, Nifty tops 26,000 amid trade optimism, strong earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-trade-on-choppy-note-as-traders-weigh-easing-us-china-tensions/articleshow/124863484.cms",
            "description": "Indian stocks remained largely flat on Tuesday, with the Sensex and Nifty showing minimal movement. This stability was driven by positive sentiment surrounding eased U.S.-China trade tensions and strong domestic corporate earnings, which counteracted some profit-taking after recent market advances. The benchmarks are currently trading approximately 1% below their September 2024 all-time highs.",
            "pubDate": "2025-10-28T05:39:06.908259"
        },
        {
            "title": "Jana Small Finance Bank shares in focus as RBI returns Universal Bank application",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jana-small-finance-bank-shares-in-focus-as-rbi-returns-universal-bank-application/articleshow/124863476.cms",
            "description": "Shares of Jana Small Finance Bank may stay in focus after the RBI returned its application to transition into a universal bank, citing eligibility shortfalls. The lender, which recently approved a Rs 250 crore NCD issue, reported a 40% YoY drop in Q1 profit to Rs 102 crore due to higher expenses, though revenue rose 12%.",
            "pubDate": "2025-10-28T05:39:06.908361"
        },
        {
            "title": "FIIs load up on 292 smallcap stocks, 131 already multibaggers as smart money turns risk-on",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-load-up-on-292-smallcap-stocks-131-already-multibaggers-as-smart-money-turns-risk-on/articleshow/124863418.cms",
            "description": "Foreign investors are actively buying Indian smallcap stocks. This is happening even as these companies have already seen significant price jumps. This trend suggests a strong belief in India's growth potential. Experts believe this segment offers opportunities despite recent market underperformance. Investors are advised to focus on specific companies with strong management.",
            "pubDate": "2025-10-28T05:39:06.908457"
        },
        {
            "title": "Tata Steel shares in focus as Motilal Oswal upgrades to Buy; 19% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-in-focus-as-motilal-oswal-upgrades-to-buy-19-upside-seen/articleshow/124863330.cms",
            "description": "Tata Steel shares: Motilal Oswal upgraded the stock to ‘Buy’ from ‘Neutral’, citing growth prospects ahead, and set a ₹210 target, implying a 19% upside from ₹177.",
            "pubDate": "2025-10-28T05:39:06.908554"
        },
        {
            "title": "Sona BLW shares in focus as Q2 PAT rises 20% YoY. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sona-blw-shares-in-focus-as-q2-pat-rises-20-yoy-should-you-invest/articleshow/124863137.cms",
            "description": "Shares of Sona BLW Precision Forgings (Sona Comstar) are likely to be in focus after the company reported a 20% YoY rise in Q2FY26 profit to Rs 173 crore — its highest-ever quarterly profit. Revenue grew 24% YoY to Rs 1,144 crore, driven by robust demand across electrified and non-electrified powertrain segments, with BEV revenue share at 32%.",
            "pubDate": "2025-10-28T05:39:06.908647"
        },
        {
            "title": "Mazagon Dock shares jump nearly 3% as Q2 PAT jumps 28% YoY, revenue rises 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mazagon-dock-shares-in-focus-as-q2-pat-jumps-28-yoy-revenue-rises-6/articleshow/124863103.cms",
            "description": "Mazagon Dock Shipbuilders shares surged on Tuesday after the company announced a significant 28% year-on-year increase in its profit after tax for the quarter ended September 2025. Revenue also saw a healthy rise. The company's strong financial performance reflects its robust order book, which includes major defense projects. This positive development has boosted investor confidence.",
            "pubDate": "2025-10-28T05:39:06.908762"
        }
    ]
}