{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-26T01:26:00.534808",
    "items": [
        {
            "title": "Asian stocks to slip as inflation clouds Fed cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-to-slip-as-inflation-clouds-fed-cuts/articleshow/123513626.cms",
            "description": "Asian equities are poised to decline, mirroring Wall Street's downturn, as investors await a crucial US inflation report that could influence the Federal Reserve's rate cut decisions. Concerns linger about the pace of potential rate reductions amid mixed signals from the labor market and persistent inflation.",
            "pubDate": "2025-08-26T01:25:48.133208"
        },
        {
            "title": "Stocks in news: Vodafone Idea, Sai Life, BPCL, IndusInd Bank, IREDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vodafone-idea-sai-life-bpcl-indusind-bank-ireda/articleshow/123507341.cms",
            "description": "Markets opened positively, fueled by global cues, with several companies in focus due to significant developments. Protean eGov Technologies secured a substantial order from UIDAI, while TGP Asia plans to sell a stake in Sai Life Sciences.",
            "pubDate": "2025-08-26T01:25:48.133333"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123507389.cms",
            "description": "Indian equity markets began the week with gains, buoyed by positive global cues. Analysts suggest focusing on thematic movers for better performance, advising traders to be cautious in Bank Nifty, awaiting bullish reversal confirmation. Meanwhile, India VIX edged up, and the rupee weakened slightly against the dollar, influenced by a strong US currency and rising crude oil prices.",
            "pubDate": "2025-08-26T01:25:48.133446"
        },
        {
            "title": "TPG beats Advent to emerge frontrunner for Tessolve stake; to invest $140–150 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tpg-in-advanced-talks-to-invest-140150-million-in-hero-electronix-backed-tessolve/articleshow/123513559.cms",
            "description": "TPG Inc. is leading the race to acquire a significant minority stake in Tessolve, a semiconductor design and engineering company primarily owned by Hero Electronix. TPG's growth fund has entered into an exclusivity agreement with Tessolve for final negotiations, surpassing Advent International's bid, valuing Tessolve at $475-500 million.",
            "pubDate": "2025-08-26T01:25:48.133545"
        },
        {
            "title": "Rajiv Anand takes charge as MD & CEO of IndusInd Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rajiv-anand-takes-charge-as-md-ceo-of-indusind-bank/articleshow/123513334.cms",
            "description": "Rajiv Anand has officially taken over as the MD & CEO of IndusInd Bank, commencing his three-year term that extends until August 2028. Following his appointment, the previously established 'Committee of Executives' and the 'Oversight Committee of the Board' have been dissolved, marking a new chapter for the bank's leadership.",
            "pubDate": "2025-08-26T01:25:48.133650"
        },
        {
            "title": "FPIs continue to sell in August, financial & IT stocks take biggest hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-continue-to-sell-in-august-financial-it-stocks-take-biggest-hit/articleshow/123513277.cms",
            "description": "Foreign fund managers increased selling of Indian equities in early August due to tariff concerns, a weak rupee, and poor corporate earnings. Financial services and IT stocks experienced the most significant selling pressure. Investors offloaded shares worth ₹34,022 crore across various sectors, driven by muted earnings expectations and uncertainty surrounding India-US relations, impacting market sentiment.",
            "pubDate": "2025-08-26T01:25:48.133752"
        },
        {
            "title": "SBI chief advocates for regulatory changes to boost corporate M&A",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-chief-advocates-for-regulatory-changes-to-boost-corporate-ma/articleshow/123513222.cms",
            "description": "SBI Chairman CS Setty advocates for regulatory flexibility, urging the RBI to allow local lenders to fund corporate M&As, particularly for listed companies with transparent shareholder approvals. This comes amid discussions on evolving corporate credit trends, with banks shifting towards short-term working capital.",
            "pubDate": "2025-08-26T01:25:48.133850"
        },
        {
            "title": "Top IT services stocks offer 10-15% upside, says Investec",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investec-upgrades-it-services-stocks-with-10-15-return-potential/articleshow/123513149.cms",
            "description": "Investec reports an improved risk-reward scenario for most IT services stocks, projecting potential one-year returns exceeding 10-15%. The brokerage upgraded Infosys to 'Buy' with a target price of ₹1,655, anticipating an 8% gain. Tech Mahindra, Infosys, and TCS are favored among larger stocks, while Mphasis, Zensar, and KPIT are preferred in the mid-sized category.",
            "pubDate": "2025-08-26T01:25:48.133947"
        },
        {
            "title": "Chinese stocks euphoria spreads as turnover tops $430 billion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinese-stocks-euphoria-spreads-as-turnover-tops-430-billion/articleshow/123513097.cms",
            "description": "Chinese stocks surged again, fueled by abundant liquidity and optimism surrounding DeepSeek's updated model. The rally, led by technology shares, broadened to include property stocks after Shanghai eased home-buying rules. While some see room for further gains, concerns about overheating are emerging as key benchmarks rise significantly from their lows, with investors closely monitoring liquidity indicators.",
            "pubDate": "2025-08-26T01:25:48.134040"
        },
        {
            "title": "Stock Radar: July breakout level holding firm for Aadhar Housing Finance; check for target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-july-breakout-level-holding-firm-for-aadhar-housing-finance-check-for-target-stop-loss/articleshow/123500194.cms",
            "description": "Aadhar Housing Finance Ltd, after a period of consolidation, is showing signs of a rebound following a retest of breakout levels from July. Experts suggest short-term traders consider buying the stock, targeting a price of Rs 560 in the near term. The stock's recent performance and technical indicators point towards renewed positive momentum.",
            "pubDate": "2025-08-26T01:25:48.134139"
        },
        {
            "title": "Seize the opportunity, invest boldly: RBI Guv Sanjay Malhotra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/seize-the-opportunity-invest-boldly-rbi-guv-sanjay-malhotra/articleshow/123513372.cms",
            "description": "\"Financial stability and price stability do not inhibit growth. Far from it. They are essential for sustainable growth. I look forward to working together with the regulated entities, to improve the efficiency and effectiveness of our financial intermediation, to ensure that the due benefits reach the people of our nation,\" RBI Guv Sanjay Malhotra said.",
            "pubDate": "2025-08-26T01:25:48.134262"
        },
        {
            "title": "Grihum Housing Finance set to name ex-Citi banker MD, CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grihum-housing-finance-set-to-name-ex-citi-banker-md-ceo/articleshow/123513383.cms",
            "description": "In a notice to stock exchanges on August 21, Grihum Housing Finance had announced that its current MD & CEO Manish Jaiswal will step down with effect from August 31. Jaiswal will continue as an advisor to the board until December 31. The company had said it would identify a suitable candidate for the top post in due course.",
            "pubDate": "2025-08-26T01:25:48.134361"
        }
    ]
}