{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-10T19:43:02.075932",
    "items": [
        {
            "title": "New launches and R&D pipeline bolster Sun Pharma's long-term growth outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/new-launches-and-rd-pipeline-bolster-sun-pharmas-long-term-growth-outlook/articleshow/125211872.cms",
            "description": "Sun Pharma reported robust global specialty growth and resilient domestic sales in Q3, despite US generics headwinds. Recent product launches and pipeline advancements, including Unloxcyt and Leqselvi, are poised to drive long-term growth. Analysts maintain a 'BUY' rating, anticipating an 11-18% upside.",
            "pubDate": "2025-11-10T04:35:48.138868"
        },
        {
            "title": "BSE Q2 Preview: PAT may rise up to 64% YoY on F&O surge, revenue seen growing up to 41%. 5 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bse-q2-preview-pat-may-rise-up-to-64-yoy-on-fo-surge-revenue-seen-growing-up-to-41-5-things-to-watch-out-for/articleshow/125220434.cms",
            "description": "BSE is set to report another strong quarter, with brokerages estimating a 46–64% YoY surge in profit to ₹506–₹529 crore for Q2FY26. Revenue growth of 36–41% is expected, driven by robust derivatives trading and steady cash market volumes.",
            "pubDate": "2025-11-10T11:41:18.407723"
        },
        {
            "title": "Bajaj Finance Q2 Results: Cons PAT jumps 22% YoY to Rs 4,875 crore, NII too rises 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-finance-q2-results-cons-pat-jumps-22-yoy-to-rs-4875-crore-misses-estimates/articleshow/125223888.cms",
            "description": "Bajaj Finance Q2 Results: Bajaj Finance on Monday reported a 22% jump in its consolidated Q2 net profit at Rs 4,875 crore versus Rs 4,000 crore in the year ago period. The profit after tax (PAT) is attributable to the owners of the company and missed Street's estimates of Rs 4,969 crore.",
            "pubDate": "2025-11-10T13:17:14.948149"
        },
        {
            "title": "Jindal Stainless Q2 Results: Net profit grows 32% to Rs 808 crore on higher sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jindal-stainless-q2-net-profit-grows-32-pc-to-rs-808-cr-driven-by-sales/articleshow/125223793.cms",
            "description": "Jindal Stainless on Monday reported an over 32 per cent year-on-year rise in consolidated net profit to Rs 808 crore in the September quarter, as increased sales led to a rise in revenues.",
            "pubDate": "2025-11-10T13:17:14.948276"
        },
        {
            "title": "Rekha Jhunjhunwala-backed Baazar Style Retail turns profitable in Q2 with Rs 51 crore PAT, revenue jumps 71% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rekha-jhunjhunwala-backed-baazar-style-retail-turns-profitable-in-q2-with-rs-51-crore-pat-revenue-jumps-71-yoy/articleshow/125226675.cms",
            "description": "Baazar Style Retail, backed by Rekha Jhunjhunwala, reported a strong turnaround with Q2FY26 net profit of Rs 51 crore versus a Rs 9 crore loss last year, driven by 71% YoY revenue growth to Rs 532 crore. Jhunjhunwala held 3.39% stake in the company as on September 30, 2025 and the value of her holding stands at Rs 83 crore.",
            "pubDate": "2025-11-10T19:42:59.511852"
        },
        {
            "title": "Airtel Payments Bank Q2 Results: Profit rises to Rs 11.8 crore, crosses Rs 800 crore in quarterly revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/airtel-payments-bank-q2-results-profit-rises-to-rs-11-8-crore-crosses-rs-800-crore-in-quarterly-revenue/articleshow/125226572.cms",
            "description": "Airtel Payments Bank has posted a profit of Rs 11.8 crore for the second quarter ended September 30, 2025, marginally higher than a year ago, and said its quarterly revenue breached the Rs 800 crore mark for the first time.",
            "pubDate": "2025-11-10T19:42:59.511976"
        },
        {
            "title": "Vodafone Idea Q2 Results: Cons loss narrows YoY to Rs 5,524 crore on 9% ARPU growth, revenue up 2.4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vodafone-idea-q2-results-cons-loss-narrows-yoy-to-rs-5524-crore-revenue-up-2-4/articleshow/125225630.cms",
            "description": "Vodafone Idea Q2 Results: Vodafone Idea on Monday narrowed its consolidated net loss in the September quarter to Rs 5,524 crore versus Rs 7,176 crore in the year ago period. The loss is attributable to the owners of the company.",
            "pubDate": "2025-11-10T19:42:59.512088"
        }
    ]
}