{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-23T03:43:53.765434",
    "items": [
        {
            "title": "Stock Radar: 30% rally in a month! Inox Green stock hits fresh record high; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-30-rally-in-a-month-inox-green-stock-hits-fresh-record-high-check-target-stop-loss/articleshow/124703086.cms",
            "description": "Inox Green Ltd stock has broken out from a year-long consolidation, reaching new record highs. Experts suggest buying opportunities for short-term traders with targets of Rs 290-300. The stock has shown significant rallies in recent weeks and months. Analysts see a strong uptrend and recommend buying on dips. A protective stop-loss is advised at Rs 242.",
            "pubDate": "2025-10-23T00:42:57.494936"
        },
        {
            "title": "Infosys promoters opt out of Rs 18,000 crore share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-promoters-opt-out-of-rs-18000-crore-share-buyback/articleshow/124750360.cms",
            "description": "Infosys promoters, including co-founders like Narayan Murthy and Nandan Nilekani, will not participate in the company's Rs 18,000 crore share buyback. This decision will lead to a slight increase in their shareholding percentage and could impact their voting rights. The buyback aims to return surplus funds to shareholders and enhance long-term value by reducing the equity base.",
            "pubDate": "2025-10-23T00:42:57.495063"
        },
        {
            "title": "Small finance banks seek doubling of cap on loan size to ₹50 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/small-finance-banks-seek-doubling-of-cap-on-loan-size-to-50-lakh/articleshow/124750325.cms",
            "description": "Small finance banks have approached the Reserve Bank of India with key requests. They want the regulator to ease a rule requiring half their loans to be under ₹25 lakh. They also seek permission to participate in co-lending arrangements. These changes aim to help SFBs expand their reach and serve more businesses, particularly MSMEs.",
            "pubDate": "2025-10-23T00:42:57.495273"
        },
        {
            "title": "ITC Hotels, Swiggy among 7 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-swiggy-among-7-stocks-showing-bullish-rsi-upswing/slideshow/124752144.cms",
            "description": "On October 21, seven stocks in the Nifty500 pack were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. An uptrend signal occurs when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) is rising, suggesting strengthening momentum in the stock’s price. This can signal potential upward movement and help traders identify buying opportunities.",
            "pubDate": "2025-10-23T03:43:40.440784"
        },
        {
            "title": "BEL shares in focus on securing Rs 633 crore order from Cochin Shipyard",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-on-securing-rs-633-crore-order-from-cochin-shipyard/articleshow/124752069.cms",
            "description": "Shares of Bharat Electronics Limited (BEL) are expected to draw attention on October 23 following a Rs 633 crore order from Cochin Shipyard Limited. The order, disclosed in a regulatory filing, involves the supply of sensors, weapon systems, fire control systems, and communication equipment, reinforcing BEL’s role in strategic defense manufacturing.",
            "pubDate": "2025-10-23T03:43:40.440917"
        },
        {
            "title": "Ceat and 4 other stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ceat-and-4-other-stocks-witness-5-year-swing-high-breakouts/slideshow/124752042.cms",
            "description": "In the Nifty500 pack, five stocks recorded a 5-year swing high at the close on October 21, suggesting bullishness, according to StockEdge.com’s technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where prices have historically struggled to move beyond. It may be seen as a bullish signal, indicating potential further upward movement. However, this differs from a 5-year breakout, which occurs when a stock’s price surpasses a key resistance level that has held for five years or more.",
            "pubDate": "2025-10-23T03:43:40.441035"
        },
        {
            "title": "FIIs dump Infosys and TCS, but mutual funds make bold contra bets on IT stocks. Who will win?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-dump-infosys-and-tcs-but-mutual-funds-make-bold-contra-bets-on-it-stocks-who-will-win/articleshow/124751548.cms",
            "description": "As FIIs exit India’s IT sector, mutual funds are stepping in. Foreign investors pared stakes in eight of the top 10 IT stocks, including Infosys, TCS, HCL Tech, and Tech Mahindra, during the September quarter. Domestic fund managers, however, bought nine out of ten, with Persistent Systems, Tech Mahindra, and Coforge seeing the sharpest divergence in holdings.",
            "pubDate": "2025-10-23T03:43:40.441145"
        },
        {
            "title": "Infosys shares in focus after promoters opt out of Rs 18,000 crore share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-after-promoters-opt-out-of-rs-18000-crore-share-buyback/articleshow/124751478.cms",
            "description": "Infosys' Rs 18,000 crore share buyback is drawing attention as promoters, including founders, will not participate. This move, offering a 19% premium, will slightly increase promoter stake to 13.37%. The company continues its capital return policy, marking its fourth buyback since 2017, aiming to distribute surplus funds to shareholders.",
            "pubDate": "2025-10-23T03:43:40.441287"
        },
        {
            "title": "Stocks to buy in 2025 for long term: REC, DCB Bank are among 5 stocks that could give 12-39% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-rec-dcb-bank-are-among-5-stocks-that-could-give-12-39-return/slideshow/124751380.cms",
            "description": "Brokerages remain bullish on select financial names, highlighting their strong growth prospects and improving fundamentals.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-23T03:43:40.441392"
        },
        {
            "title": "Tata Motors shares in focus on delivering over 1 lakh vehicles during festive season",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-on-delivering-over-1-lakh-vehicles-during-festive-season/articleshow/124751241.cms",
            "description": "Tata Motors is set for a busy trading day after announcing a significant festive season sales surge. The company delivered over 1 lakh vehicles between Navratri and Diwali, a 33% year-on-year increase, driven by strong demand for its SUV range and electric vehicles. This performance sets a positive tone for the remainder of the fiscal year.",
            "pubDate": "2025-10-23T03:43:40.441492"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/124751196.cms",
            "description": "In the Nifty500 pack, nine stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 21, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-23T03:43:40.441593"
        },
        {
            "title": "Wall Street ends lower on mixed earnings, revived US-China trade tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-on-mixed-earnings-revived-us-china-trade-tensions/articleshow/124751038.cms",
            "description": "Wall Street dipped as mixed earnings, notably Netflix's miss, and potential U.S. export curbs on China-bound tech goods soured investor mood. Tech and communication stocks led the decline. Despite some disappointing corporate results, overall earnings season remains strong, with many companies exceeding expectations, though those faltering face investor impatience.",
            "pubDate": "2025-10-23T03:43:40.441689"
        },
        {
            "title": "Asian stocks decline following choppy US session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-decline-following-choppy-us-session/articleshow/124750479.cms",
            "description": "Asian markets opened lower after a volatile session on Wall Street. Japan and South Korea saw significant drops. Tech stocks faced pressure from company outlooks and earnings. Trade tensions between the US and China resurfaced. Oil prices jumped on new US sanctions. Retail momentum trades experienced sharp losses. US companies are showing strong earnings this quarter.",
            "pubDate": "2025-10-23T03:43:40.441798"
        },
        {
            "title": "GIFT Nifty up 330 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124744457.cms",
            "description": "Muhurat Trading saw cautious optimism as the Sensex rose to 84,600 and Nifty neared 25,900, with IT, banking, auto, and pharma leading gains. Analysts anticipate Nifty improvement from current levels, supported by a forward P/E slightly above its average. The India VIX fell, indicating reduced market fear.",
            "pubDate": "2025-10-23T03:43:40.441896"
        },
        {
            "title": "Stocks in news: HUL, Jain Resource Recycling, Ola Electric, Tata Motors, Torrent Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hul-jain-resource-recycling-ola-electric-tata-motors-torrent-pharma/articleshow/124744404.cms",
            "description": "Indian markets closed marginally higher after a strong start in the Muhurat trading session. Investors are now focused on upcoming earnings, global interest rates, and crude oil prices. Several companies like HUL, Jain Resource Recycling, Ola Electric, Tata Motors PV, and Torrent Pharma are in the spotlight due to significant news developments.",
            "pubDate": "2025-10-23T03:43:40.441996"
        }
    ]
}