{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-25T07:18:41.410960",
    "items": [
        {
            "title": "Wall Street Week Ahead: Megacap-led earnings deluge, Fed meeting headline busy US markets week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-megacap-led-earnings-deluge-fed-meeting-headline-busy-us-markets-week/articleshow/124798509.cms",
            "description": "A crucial week for the US stock rally unfolds with major tech earnings, a likely Federal Reserve rate cut, and escalating US-China trade tensions. Investors are keenly watching corporate results, particularly from tech giants, and the Fed's forward guidance. A prolonged government shutdown adds to market uncertainty, potentially impacting economic growth and investor sentiment.",
            "pubDate": "2025-10-25T03:42:16.069961"
        },
        {
            "title": "Blackstone makes BFSI push, to buy 10% in Federal Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstone-makes-bfsi-push-to-buy-10-in-federal-bank/articleshow/124798702.cms",
            "description": "In a significant move, global investment giant Blackstone has allocated more than six thousand crore rupees to Federal Bank, officially becoming the largest shareholder in the Kerala-based institution. This landmark deal highlights the increasing appetite of foreign investors for India's burgeoning financial landscape.",
            "pubDate": "2025-10-25T04:10:49.748436"
        },
        {
            "title": "Ides of October: Big overseas money flows into banks, auto and metals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ides-of-october-big-overseas-money-flows-into-banks-auto-and-metals/articleshow/124798632.cms",
            "description": "October brought a refreshing wave of optimism as foreign investors rekindled their interest in India’s financial services, funneling impressive amounts of money back into the market after a dry spell of outflows. This shift is primarily spurred by stronger-than-anticipated results from banks and an encouraging outlook for public sector banking.",
            "pubDate": "2025-10-25T04:10:49.748571"
        },
        {
            "title": "For buyouts, only listed companies with sound finances to get funding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-buyouts-only-listed-cos-with-sound-finances-to-get-funding/articleshow/124799001.cms",
            "description": "Indian banks can now finance company acquisitions. The Reserve Bank of India has released draft rules for this. Target companies must be listed, profitable, and have a good net worth. Banks will face exposure limits. These new guidelines aim to expand capital market lending for Indian corporates. Feedback is invited until November 21.",
            "pubDate": "2025-10-25T04:51:15.061723"
        },
        {
            "title": "European shares close at record high on US inflation data, trade hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-close-at-record-high-on-us-inflation-data-trade-hopes/articleshow/124799319.cms",
            "description": "European stock markets reached a new peak on Friday. This surge was fueled by lower than anticipated U.S. inflation figures. Hopes for reduced trade friction between the U.S. and China also contributed to the positive sentiment. Investors reacted to a series of company earnings reports. The continent-wide STOXX 600 index saw an increase. Major regional indexes also ended higher.",
            "pubDate": "2025-10-25T05:18:49.418355"
        },
        {
            "title": "Global stocks jump after US inflation data; US dollar nearly flat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-jump-after-us-inflation-data-us-dollar-nearly-flat/articleshow/124799288.cms",
            "description": "Friday brought significant gains to the Indian stock market, echoing the record-breaking performance of major U.S. stock indexes. The catalyst? Lower-than-expected inflation data that sparked fresh hopes for interest rate reductions by the Federal Reserve. Companies like Ford released impressive earnings, further igniting the market rally.",
            "pubDate": "2025-10-25T05:18:49.418478"
        },
        {
            "title": "US stocks notch record closing highs on cool inflation, solid earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-notch-record-closing-highs-on-cool-inflation-solid-earnings/articleshow/124799265.cms",
            "description": "Indian markets saw a strong rally. Cooler inflation data and upbeat corporate earnings propelled US stock indexes to record highs. This performance sets a positive tone for upcoming earnings reports and an anticipated interest rate cut by the Federal Reserve. Investors are keenly watching major tech companies like Meta, Microsoft, Alphabet, and Apple for further market direction.",
            "pubDate": "2025-10-25T05:18:49.418686"
        },
        {
            "title": "ET Prime Special Series - Part 3 - How to think & scan like an auditor before investing: Assets a wall of strength or just a paper fort?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-prime-special-series-part-3-how-to-think-scan-like-an-auditor-before-investing-assets-a-wall-of-strength-or-just-a-paper-fort/articleshow/124799720.cms",
            "description": "This series is about gaining a deeper understanding of how companies report numbers and hide the reality of their business. It aims to go beyond the numbers to the decisions, judgements, and assumptions behind them. By following these insights, investors can become better at analysing financial statements (if they even think that is important), spotting risks, and making informed decisions. Why is this important to know? Look at the number of start-ups that, at the time of their IPOs, announce that they have made profits – only to report losses the very next quarter, and justify them. And not only start-ups. There are many in the listed space who do this – again and again.",
            "pubDate": "2025-10-25T05:57:29.134087"
        },
        {
            "title": "Radhakishan Damani bets on market leadership: 5 things going solid for Lenskart IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/radhakishan-damani-bets-on-market-leadership-5-things-going-solid-for-lenskart-ipo/slideshow/124799774.cms",
            "description": "Eyewear retailer Lenskart received backing from billionaire investor Radhakishan Damani, founder of DMart as he invested Rs 90 crore in the company just days before its much-awaited Rs 2,150 crore IPO. The public issue, which could open in the next few days, marks the most sought after consumer-tech listing after Urban Company.Here are five key things working in Lenskart’s favour ahead of its market debut:",
            "pubDate": "2025-10-25T05:57:29.134219"
        },
        {
            "title": "The great Indian spending comeback: Why consumers are opening their wallets again",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-great-indian-spending-comeback-why-consumers-are-opening-their-wallets-again/articleshow/124801255.cms",
            "description": "India’s consumption upcycle gains traction as tax cuts, rural income growth, and GST reductions drive strong festive sales, auto bookings, and retail growth, signaling an early-stage economic revival yet underappreciated by markets.",
            "pubDate": "2025-10-25T07:18:38.866997"
        },
        {
            "title": "Just 19 stocks corner half of Rs 2.7 lakh crore mutual fund inflows in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/just-19-stocks-corner-half-of-rs-2-7-lakh-crore-mutual-fund-inflows-in-2025/articleshow/124801094.cms",
            "description": "In 2025, Indian mutual funds deployed half of their equity inflows into only 19 stocks, including SBI, Reliance, and Swiggy, reflecting high concentration amid negative returns and cautious cash management.",
            "pubDate": "2025-10-25T07:18:38.867123"
        },
        {
            "title": "Ashish Kacholia’s Rs 2,800-crore portfolio gets new gem that’s delivered 200% returns in 8 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholias-rs-2800-crore-portfolio-gets-new-gem-thats-delivered-200-returns-in-8-months/articleshow/124800930.cms",
            "description": "Ace investor Ashish Kacholia’s Rs 50 crore investment in Jain Resource Recycling skyrocketed 214% in just seven months, driven by robust Q2 earnings and strong growth across metals and recycling segments.",
            "pubDate": "2025-10-25T07:18:38.867376"
        },
        {
            "title": "Motilal Oswal sees Maruti Suzuki, Endurance Technologies as top bets in post-GST auto rebound",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-sees-maruti-suzuki-endurance-technologies-as-top-bets-in-post-gst-auto-rebound/articleshow/124800781.cms",
            "description": "GST rate cuts have boosted Indian auto demand, particularly entry-level vehicles and two-wheelers, while festive momentum, exports, and improved OEM fundamentals support cautious investor optimism amid temporary incentives.",
            "pubDate": "2025-10-25T07:18:38.867480"
        }
    ]
}