{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-29T11:24:11.122745",
    "items": [
        {
            "title": "Q3 results today: ITC, Paytm among 140 companies to report earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-itc-paytm-among-140-companies-to-report-earnings-on-thursday/articleshow/127749980.cms",
            "description": "Indian companies are releasing their December quarter results. ITC expects steady but mixed performance. Swiggy anticipates strong revenue growth but wider losses due to investments. Paytm is projected to report another profitable quarter with healthy revenue and margin expansion. Investors are watching these key announcements closely.",
            "pubDate": "2026-01-29T02:23:20.091614"
        },
        {
            "title": "Canara Bank Q3 Results: Profit rises 26% YoY to Rs 5,155 crore; NII up 1%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/canara-bank-q3-results-profit-rises-26-yoy-to-rs-5155-crore-nii-up-6/articleshow/127763919.cms",
            "description": "Canara Bank Q3 Results: Canara Bank posted a strong operational performance in the quarter, with operating profit rising 16% year-on-year to Rs 9,119 crore. Business growth remained healthy, as global business, deposits and advances each grew 13%. Credit expansion was driven by retail, agriculture and MSME segments, with retail loans up 31%.",
            "pubDate": "2026-01-29T08:02:16.877797"
        },
        {
            "title": "Adani Power Q3 Results: Cons profit falls 19% YoY to Rs 2,480 crore, revenue down 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-power-q3-results-cons-profit-falls-19-yoy-to-rs-2480-crore-revenue-down-9/articleshow/127766470.cms",
            "description": "Adani Power has announced its December quarter results. The company's consolidated net profit saw a significant 19% increase. This rise in profit is a positive development for the energy giant. However, revenue from operations experienced a slight decrease. Investors will be watching closely for future performance trends.",
            "pubDate": "2026-01-29T08:54:13.230177"
        },
        {
            "title": "Nestle Q3 Results Preview: Strong volumes to drive up to 11% YoY revenue growth; input costs to cap PAT upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-q3-results-preview-strong-volumes-to-drive-up-to-11-yoy-revenue-growth-input-costs-to-cap-pat-upside/articleshow/127769432.cms",
            "description": "Nestle India is expected to post steady Q3 revenue growth of about 10–11%, driven by healthy domestic volumes. However, higher input costs may weigh on margins, keeping profit growth modest despite continued focus on volume-led expansion and brand investments.",
            "pubDate": "2026-01-29T10:07:10.888658"
        },
        {
            "title": "Gillette India profit jumps on demand for grooming products",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gillette-india-profit-jumps-on-demand-for-grooming-products/articleshow/127768546.cms",
            "description": "Gillette India's third-quarter profit jumped about 37% on ‍Thursday, as demand stayed ​robust for its staple men's grooming products, ⁠including shaving razors and creams.",
            "pubDate": "2026-01-29T10:07:10.888769"
        },
        {
            "title": "Tata Motors (CV) Q3 Results: Cons PAT plunges 48% YoY to Rs 705 crore, but revenue jumps 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-motors-cv-q3-results-cons-pat-plunges-48-yoy-to-rs-705-crore-but-revenue-jumps-16/articleshow/127774099.cms",
            "description": "Tata Motors (CV) Q3 Results: Tata Motors Limited (TMCV) reported a 48% decline in its December quarter consolidated net profit at Rs 705 crore compared to Rs 1,355 crore reported in the year ago period.",
            "pubDate": "2026-01-29T11:24:07.625875"
        },
        {
            "title": "Mahindra Holidays Q3 profit plummets on one-time charge, slow membership growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indias-mahindra-holidays-quarterly-profit-plummets-on-one-time-charge-slow-membership-growth/articleshow/127773351.cms",
            "description": "Mahindra Holidays and Resorts India reported a ‍94% plunge in third-quarter ​profit on Thursday, dragged by a one-time ⁠charge following the roll-out of India's new labour codes and slower membership growth.",
            "pubDate": "2026-01-29T11:24:07.626002"
        },
        {
            "title": "Deepak Fertilisers Q3 profit falls on softer chemical demand, high costs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indias-deepak-fertilisers-posts-quarterly-profit-fall-on-softer-chemical-demand-high-costs/articleshow/127773168.cms",
            "description": "India's Deepak Fertilisers and Petrochemicals reported a ‍43.6% fall in ​third-quarter profit on Thursday, as softer agrochemicals ⁠demand and rising input costs squeezed margins.",
            "pubDate": "2026-01-29T11:24:07.626105"
        },
        {
            "title": "Vedanta Q3 Results: Profit surges 61% YoY to Rs 5,710 crore; revenue advances 37%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vedanta-q3-results-profit-surges-61-yoy-to-rs-5710-crore-revenue-advances-37/articleshow/127772336.cms",
            "description": "Vedanta reported a significant 61% year-on-year profit jump to Rs 5,710 crore in the third quarter, driven by a 37% revenue increase to Rs 23,369 crore. The company achieved its highest-ever quarterly EBITDA of Rs 15,171 crore, with a strong operational performance across most businesses, particularly in aluminium production.",
            "pubDate": "2026-01-29T11:24:07.626203"
        },
        {
            "title": "Swiggy Q3 Results: Cons loss widens YoY to Rs 1,065 crore, but revenue jumps 54%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/swiggy-q3-results-cons-loss-widens-to-rs-1065-crore-but-revenue-jumps-54-yoy/articleshow/127771702.cms",
            "description": "Food delivery giant Swiggy's consolidated net loss widened to Rs 1,065 crore in Q3FY26, an increase from the previous year's Rs 799 crore. Despite the higher loss, the company saw significant revenue growth, with operations generating Rs 6,148 crore, a 54% year-on-year increase.",
            "pubDate": "2026-01-29T11:24:07.626299"
        }
    ]
}