{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-19T09:45:49.293919",
    "items": [
        {
            "title": "Reliance Industries shares in focus after majority stake acquisition in Naturedge Beverages",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-after-majority-stake-acquisition-in-naturedge-beverages/articleshow/123376005.cms",
            "description": "Reliance Industries' FMCG arm, Reliance Consumer Products, has acquired a majority stake in Naturedge Beverages. The move marks RCPL’s entry into the healthy functional beverages market with flagship brand Shunya, expanding its portfolio into herbal, natural, and wellness-driven drinks.",
            "pubDate": "2025-08-19T03:02:53.789150"
        },
        {
            "title": "At multi-year highs: TVS Motor, Maruti Suzuki, M&M among 7 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-tvs-motor-maruti-suzuki-mm-among-7-stocks-witness-5-year-swing-high-breakout/slideshow/123375832.cms",
            "description": "Seven stocks from the Nifty200 pack witnessed a 5-year swing high at the close on August 18, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.\"",
            "pubDate": "2025-08-19T03:02:53.789276"
        },
        {
            "title": "Positive Breakout: These 10 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-close-cross-above-their-200-dma/slideshow/123375746.cms",
            "description": "In the Nifty200 pack, 10 stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on August 18, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered an overall uptrend. Take a look:",
            "pubDate": "2025-08-19T03:02:53.789394"
        },
        {
            "title": "Icodex Publishing Solutions shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icodex-publishing-solutions-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/123375569.cms",
            "description": "Icodex Publishing Solutions is set to debut on the BSE SME platform on August 19, 2025, with shares priced at Rs 102. The IPO, which was subscribed 3.95 times, saw strong interest from institutional and retail investors. Despite robust FY25 financials, analysts are cautious about the sustainability of earnings, leading to expectations of a muted listing.",
            "pubDate": "2025-08-19T03:02:53.789497"
        },
        {
            "title": "6 companies to go ex-dividend tomorrow. Last chance to buy; check list here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/6-companies-to-go-ex-dividend-tomorrow-last-chance-to-buy-check-list-here/articleshow/123375520.cms",
            "description": "Investors eyeing dividends from select companies must act swiftly, as today is the last day to purchase shares of firms like Bhansali Engineering Polymers, Colab Platforms, and others with a record date of August 20, 2025. To be eligible for the declared dividends, ensure your name appears in the company's records by this date, considering the T+1 settlement cycle.",
            "pubDate": "2025-08-19T03:02:53.789598"
        },
        {
            "title": "Multibagger stock with 700% gains in 2 years to go ex-split tomorrow. Last day to buy today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-stock-with-700-gains-in-2-years-to-go-ex-split-tomorrow-last-day-to-buy-today/articleshow/123375456.cms",
            "description": "Chandrima Mercantiles, a multibagger stock, is undergoing a stock split. The face value is changing from Rs 10 to Rs 1. August 20 is the record date. Today is the last day to buy shares to qualify. The split aims to improve liquidity and accessibility. The stock has delivered nearly 700% returns in two years.",
            "pubDate": "2025-08-19T03:02:53.789700"
        },
        {
            "title": "Wall Street ends on muted note ahead of Jackson Hole summit, retailers' earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-on-muted-note-ahead-of-jackson-hole-summit-retailers-earnings/articleshow/123375254.cms",
            "description": "Wall Street's indexes remained mostly flat as investors awaited key retail earnings reports and the Federal Reserve's Jackson Hole symposium for insights into the economy. Concerns about trade uncertainty, inflation, and potential shifts in the Fed's policy framework contributed to market caution. Energy stocks gained following new tax subsidy rules, while investors continue to anticipate a rate cut next month.",
            "pubDate": "2025-08-19T03:02:53.789791"
        },
        {
            "title": "Strong Volumes, Channel Breakout Keep M&M Stock in Bullish Zone, says Rajesh Palviya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-volumes-channel-breakout-keep-mm-stock-in-bullish-zone-says-rajesh-palviya/videoshow/123367456.cms",
            "description": "“The technical outlook for M&M stock appears bullish in the short term, supported by a steady uptrend and recent price consolidation near all-time highs. Traders can buy the stock for a target of Rs 3500 in the near-term,” Rajesh Palviya, SVP - Research, Axis Securities, said.",
            "pubDate": "2025-08-19T03:02:53.789884"
        },
        {
            "title": "Asian shares mixed; oil in spotlight after Trump’s Ukraine meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-mixed-oil-in-spotlight-after-trumps-ukraine-meeting/articleshow/123374748.cms",
            "description": "Oil markets are closely watching President Trump's efforts to mediate between Ukraine and Russia, impacting regional stability and energy flows. The Federal Reserve's upcoming Economic Policy Symposium in Jackson Hole is also a key event, with Jerome Powell expected to unveil the Fed's new policy framework. Market anticipates potential rate cuts in September amid signs of labor-market weakness.",
            "pubDate": "2025-08-19T03:02:53.789972"
        },
        {
            "title": "Can Dabur India sustain its margins despite inflationary pressures?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-dabur-india-sustain-its-margins-despite-inflationary-pressures/articleshow/123374656.cms",
            "description": "Dabur India maintained its operating margin in the June quarter. This was achieved through price increases and cost savings. The company anticipates margin improvements in fiscal year 2026. A proposed GST rate reduction may boost demand. Analysts suggest a potential upside for Dabur's shares. The rural market performed well. Dabur expects double-digit growth in the September quarter.",
            "pubDate": "2025-08-19T03:02:53.790066"
        },
        {
            "title": "Stocks in news: Vedanta, LIC, Reliance, GMR Airports, Vodafone Idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vedanta-lic-reliance-gmr-airports-vodafone-idea/articleshow/123369889.cms",
            "description": "Markets rallied strongly, with Vedanta considering a second interim dividend. LIC launched a policy revival campaign, while GMR Airports announced the redemption of non-convertible bonds. Reliance Consumer entered the beverage sector through a joint venture, and Vodafone Idea seeks funds for its capex plan.",
            "pubDate": "2025-08-19T03:02:53.790157"
        },
        {
            "title": "GIFT Nifty up 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123369951.cms",
            "description": "Indian equities rebounded strongly following the Prime Minister's GST reform announcement. Experts predict corporate earnings recovery in the second half of FY26, driven by policy reforms, potential stimulus, and festive demand, maintaining a positive outlook for the next 6-9 months. Technically, Nifty's ability to surpass 25,000 will dictate further upward movement, with a potential target of 25,300-25,500.",
            "pubDate": "2025-08-19T03:02:53.790249"
        },
        {
            "title": "Indian equities surge as GST simplification prospects drive market gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-equities-surge-as-gst-simplification-prospects-drive-market-gains/articleshow/123374385.cms",
            "description": "Indian equities surged on Monday, driven by optimism surrounding potential GST simplification, leading to short covering in sectors like auto and FMCG. The Nifty and Sensex both experienced gains, fueled by positive domestic investor activity and a slight decrease in market volatility. Consumption-based stocks led the rally, with Maruti Suzuki emerging as a top gainer.",
            "pubDate": "2025-08-19T03:02:53.790337"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-26/articleshow/123374271.cms",
            "description": "There’s an old market saying: Even when the bulls are in control, never write off the bears. Similarly, when the bears seem to be taking control, don't write off the bulls. Monday was an example of this. Now, how long will the upmove sustain? Especially as there is no clarity on the India-US trade deal or on the threatened additional tariff. At this point, the bulls and bears are pretty evenly matched. It is also likely that the street will tilt toward the bulls over a period of time (given there are no major negative surprises). If that happens, the tilt will first be toward stocks where the quality of the balance sheet is strong and there is little need for further debt in the business.",
            "pubDate": "2025-08-19T03:02:53.790454"
        },
        {
            "title": "How will GST reforms impact Indian stock market and key industries?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-gst-reforms-impact-indian-stock-market-and-key-industries/articleshow/123374045.cms",
            "description": "Indian stock market anticipates GST simplification, potentially benefiting autos, cement, consumer goods, retail, hotels, and financials. Auto sector, especially two-wheelers, could see increased demand due to lower tax rates and potential RBI rate cuts. Financials may indirectly gain from credit growth in key sectors.",
            "pubDate": "2025-08-19T03:02:53.790552"
        },
        {
            "title": "Stock Radar: M&M hits fresh record high in August 2025; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-mm-hits-fresh-record-high-in-august-2025-time-to-buy-or-book-profits/articleshow/123361719.cms",
            "description": "Mahindra & Mahindra (M&M) shares have surged to a new record high in August 2025, breaking out from a period of consolidation. Technical indicators suggest a continuation of this upward trend.",
            "pubDate": "2025-08-19T03:02:53.790642"
        },
        {
            "title": "Ashok Leyland, Adani Energy among 6 stocks with White Marubozu Pattern on August 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-adani-energy-among-6-stocks-with-white-marubozu-pattern-on-august-18/slideshow/123377329.cms",
            "description": "On August 18, in the Nifty200 pack, seven stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-08-19T03:59:50.980537"
        },
        {
            "title": "Maruti Suzuki, Blue Star among 7 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maruti-suzuki-blue-star-among-7-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/123377268.cms",
            "description": "As of August 18, there was a notable surge in futures open interest for seven stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.\"",
            "pubDate": "2025-08-19T03:59:50.980656"
        },
        {
            "title": "Tata Motors shares in focus as co re-enters South African PV market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-as-co-re-enters-south-african-pv-market/articleshow/123377177.cms",
            "description": "Tata Motors shares: Tata Motors will re-enter the South African passenger vehicle market after six years, relaunching its car range through an exclusive distribution partnership with Motus Holdings, marking a key step in its global expansion strategy.",
            "pubDate": "2025-08-19T03:59:50.980768"
        },
        {
            "title": "Apollo Tyres, Adani Ports, MRF among 8 stocks closed crossing above VWAP on August 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-tyres-adani-ports-mrf-among-8-stocks-closed-crossing-above-vwap-on-august-18/slideshow/123377143.cms",
            "description": "The closing prices of eight stocks in the Nifty200 pack rallied over 0.5% relative to their VWAP (Volume Weighted Average Price) on August 18, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-19T03:59:50.980868"
        },
        {
            "title": "Vodafone Idea shares in focus as telco explores non-banking funding for capex continuity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-as-telco-explores-non-banking-funding-for-capex-continuity/articleshow/123376800.cms",
            "description": "Vodafone Idea's outgoing CEO, Akshaya Moondra, said the telco is exploring non-banking funding options to maintain its capex plans. Banks are awaiting clarity on the AGR issue before extending fresh loans, keeping funding challenges at the forefront.",
            "pubDate": "2025-08-19T03:59:50.980966"
        },
        {
            "title": "Vedanta shares in focus ahead of board meet to consider second interim dividend on August 21",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-ahead-of-board-meet-to-consider-second-interim-dividend-on-august-21/articleshow/123376752.cms",
            "description": "Vedanta's board will convene on August 21, 2025, to consider a second interim dividend for the financial year 2025-26. The record date for determining shareholder eligibility is set for August 27, 2025. In accordance with SEBI regulations, the trading window for designated persons will be closed from August 19 to August 23.",
            "pubDate": "2025-08-19T03:59:50.981065"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Fiem Industries, Astra Microwave among 5 stocks that could give 10-50% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-fiem-industries-astra-microwave-among-5-stocks-that-could-give-10-50-return/slideshow/123376715.cms",
            "description": "Brokerages have turned selectively positive across the auto ancillaries, defence, retail, real estate, and renewables space, highlighting attractive upside potential in key names.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-19T03:59:50.981161"
        },
        {
            "title": "Bajaj Auto, Bajaj Finance, Nestle India among 9 stocks showing RSI Trending Up on August 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-auto-bajaj-finance-nestle-india-among-9-stocks-showing-rsi-trending-up-on-august-18/slideshow/123376461.cms",
            "description": "Nine stocks from the NSE large cap pack were highlighted in the RSI Trending Up scan on August 18, according to data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-08-19T03:59:50.981274"
        },
        {
            "title": "Intel gets $2 billion lifeline in the form of SoftBank equity investment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/intel-gets-2-billion-lifeline-in-the-form-of-softbank-equity-investment/articleshow/123377759.cms",
            "description": "SoftBank is investing $2 billion in Intel. This will make SoftBank a top shareholder. However, SoftBank will not seek a board seat. Also, they will not commit to buying Intel chips. Intel shares are expected to rise. SoftBank shares are expected to fall. This investment is a vote of confidence for Intel. Intel is currently working on a turnaround effort.",
            "pubDate": "2025-08-19T04:53:07.315688"
        },
        {
            "title": "Bajaj Finance shares up 30% in 2025 so far. Can GST reform tailwinds push the stock past Rs 1,000?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-shares-up-30-in-2025-so-far-can-gst-reform-tailwinds-push-the-stock-past-rs-1000/articleshow/123377522.cms",
            "description": "Bajaj Finance shares are soaring, fueled by potential GST cuts on consumer durables and India's credit rating upgrade. Analysts predict lower EMIs and cheaper offshore funding could propel the stock past ₹1,000. Technical analysis suggests a positive near-term trend, with support around ₹850 and resistance at ₹930.",
            "pubDate": "2025-08-19T04:53:07.315812"
        },
        {
            "title": "Smallcap investors just got some bad news from Q1 earnings. Time to tweak your portfolio?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-investors-just-got-some-bad-news-from-q1-earnings-time-to-tweak-your-portfolio/articleshow/123377454.cms",
            "description": "Smallcap investors face headwinds as Q1 earnings reveal an 11% YoY dip, with nearly half of companies missing estimates. Midcaps, however, shine with a robust 24% growth. Experts suggest a portfolio shift towards large-caps and mid-caps, anticipating a stronger second half driven by GST reforms and improved consumption.",
            "pubDate": "2025-08-19T04:53:07.316151"
        },
        {
            "title": "Glenmark, Alembic and Sun Pharma shares in focus on product recalls after US FDA action",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/glenmark-alembic-and-sun-pharma-shares-in-focus-on-product-recalls-after-us-fda-action/articleshow/123377418.cms",
            "description": "Shares of Glenmark, Alembic, and Sun Pharma will be in focus after the USFDA flagged recalls over manufacturing lapses. Glenmark is recalling Carvedilol and Theophylline tablets due to nitrosamine impurities and failed dissolution tests, while Alembic pulled Doxepin capsules and Sun Pharma recalled Spironolactone tablets. All three were classified as Class II recalls, indicating moderate health risk.",
            "pubDate": "2025-08-19T04:53:07.316253"
        },
        {
            "title": "Hindustan Zinc shares in focus as board clears Rs 3,823 crore 10 MTPA tailings reprocessing plant",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-as-board-clears-rs-3823-crore-10-mtpa-tailings-reprocessing-plant/articleshow/123377394.cms",
            "description": "Hindustan Zinc's board has cleared a Rs 3,823 crore plan to set up India’s first zinc tailings reprocessing plant at Rampura Agucha Mine. The 10 MTPA facility will recover metals like zinc and silver, boosting sustainability and production capacity.",
            "pubDate": "2025-08-19T04:53:07.316349"
        },
        {
            "title": "Tata Steel shares in focus after unit approves Ceramat exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-in-focus-after-unit-approves-ceramat-exit/articleshow/123377360.cms",
            "description": "Tata steel shares: The company's subsidiary, Tata Steel Advanced Materials Ltd (TSAML), approved the sale of its entire stake in Ceramat Private Ltd (CPL) to Lionstead Applied Materials Pvt Ltd, a unit of Lionstead Ventures LLP.",
            "pubDate": "2025-08-19T04:53:07.316444"
        },
        {
            "title": "RIL, Airtel drive Sensex 100 pts higher, Nifty above 24,900",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-airtel-lift-sensex-200-pts-higher-nifty-above-24900/articleshow/123377184.cms",
            "description": "Indian stock markets, Sensex and Nifty, opened higher on Tuesday, building on Monday's gains, fueled by optimism surrounding potential GST reforms and progress in Russia-Ukraine peace talks. Reliance Industries and Bharti Airtel led the advances. Geojit Investments' V.K. Vijayakumar highlighted the positive market sentiment driven by policy pushes on GST and potential resolution of the Russia-Ukraine conflict.",
            "pubDate": "2025-08-19T04:53:07.316539"
        },
        {
            "title": "All Time Plastics shares zoom over 8% after Vibhav Manish Chokhani picks 0.5% stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/all-time-plastics-shares-zoom-over-8-after-vibhav-manish-chokhani-picks-0-5-stake/articleshow/123380114.cms",
            "description": "All Time Plastics shares surged 8.5% after Vibhav Manish Chokhani, son of investor Manish Chokhani, acquired a 0.53% stake for approximately Rs 10.05 crore. This purchase spurred investor interest in the recently listed consumerware manufacturer, a key supplier to global retailers like IKEA and Tesco. The company's IPO, priced at Rs 275, was oversubscribed 8.62 times.",
            "pubDate": "2025-08-19T06:53:38.751785"
        },
        {
            "title": "Jackson Hole in Focus: Powell’s speech seen as key signal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jackson-hole-in-focus-powells-speech-seen-as-key-signal/slideshow/123380027.cms",
            "description": "Hedge funds snapped up U.S. stocks at the fastest pace in seven weeks to August 15, as they positioned for a widely expected Federal Reserve rate cut in September, Goldman Sachs said in a client note.(Source: Reuters)",
            "pubDate": "2025-08-19T06:53:38.751931"
        },
        {
            "title": "Ola Electric shares rally over 8% but GST news could be negative for EVs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-rally-over-8-but-gst-news-could-be-negative-for-evs/articleshow/123379557.cms",
            "description": "Ola Electric's stock price increased, reaching Rs 44.70. This happened even with worries about Goods and Services Tax changes. These changes might favor regular cars over electric vehicles. The government is thinking about lowering GST rates on some things. Experts say this could hurt electric car companies like Ola and Ather.",
            "pubDate": "2025-08-19T06:53:38.752045"
        },
        {
            "title": "Hyundai Motor India shares soar 12% in 2 days to hit new all-time high amid surge in trade volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-shares-soar-12-in-2-days-to-hit-new-all-time-high-amid-surge-in-trade-volumes/articleshow/123379338.cms",
            "description": "Hyundai Motor India shares scaled a new record high of Rs 2,511.20 on the BSE, rallying 12.2% in two sessions amid heavy volumes. The stock now trades nearly 30% above its listing price. However, in Q1FY26, the automaker posted an 8% YoY drop in net profit to Rs 1,369 crore, with revenue slipping 5.5% to Rs 16,180 crore.",
            "pubDate": "2025-08-19T06:53:38.752156"
        },
        {
            "title": "Vardhman Textiles, other textile stocks rally up to 9% after Govt removes cotton import duty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vardhman-textiles-other-textile-stocks-rally-up-to-9-after-govt-removes-cotton-import-duty/articleshow/123379193.cms",
            "description": "The government has temporarily removed the 11% duty on cotton imports till September 30, offering relief to textile manufacturers facing high costs. Industry bodies say the move will boost competitiveness against peers like Bangladesh and Vietnam and support export growth.",
            "pubDate": "2025-08-19T06:53:38.752258"
        },
        {
            "title": "Rekha Jhunjhunwala portfolio: 12 stocks log double-digit gains, 1 microcap shines with 43% return in FY26 so far",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwala-portfolio-12-stocks-log-double-digit-gains-1-microcap-shines-with-43-returns-in-fy26-so-far/articleshow/123378876.cms",
            "description": "Rekha Jhunjhunwala's portfolio has showcased impressive gains in FY26, with several stocks outperforming market trends. Singer India leads with a 43% surge, despite a Q1 loss, while Fortis Healthcare and Baazar Style Retail also delivered strong returns. Financials like CRISIL and Canara Bank contributed significantly, and Titan Company remains a key holding in her portfolio.",
            "pubDate": "2025-08-19T06:53:38.752360"
        },
        {
            "title": "Inox Wind shares rally 5% after Rs 175 crore stake sale in unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-shares-rally-5-after-rs-175-crore-stake-sale-in-unit/articleshow/123378844.cms",
            "description": "Inox Wind shares rose over 5% after it sold a ₹175 crore stake in its EPC arm, Inox Renewable Solutions, valuing the unit at around ₹7,400 crore. The move aims to boost operations and unlock value.",
            "pubDate": "2025-08-19T06:53:38.752457"
        },
        {
            "title": "Stagflation fears grip global investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stagflation-fears-grip-global-investors/slideshow/123378792.cms",
            "description": "The threat of stagflation, slowing growth combined with rising inflation, is weighing on global markets. A BofA Global Research survey in early August found nearly 70% of global investors expect stagflation within the next 12 months. Weak US jobs data, a sharp rise in core inflation, and an unexpected surge in producer prices have reinforced these concerns (Source: Reuters).",
            "pubDate": "2025-08-19T06:53:38.752558"
        },
        {
            "title": "SoftBank bets $2 billion on Intel’s comeback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/softbank-bets-2-billion-on-intels-comeback/slideshow/123378190.cms",
            "description": "SoftBank is set to invest $2 billion in Intel, becoming one of the company’s top-10 shareholders. The investment will be made at $23 per share, giving SoftBank a stake of just under 2% in the U.S. chipmaker. (Source: Reuters)",
            "pubDate": "2025-08-19T06:53:38.752650"
        },
        {
            "title": "Japan's Nikkei slips from record high, investors weigh Wall Street lull",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slips-from-record-high-investors-weigh-wall-street-lull/articleshow/123382354.cms",
            "description": "Japan's Nikkei share average slipped from a record high to end lower on Tuesday, as investors weighed Wall Street's muted overnight finish, raising concerns that markets have advanced too far, too fast.",
            "pubDate": "2025-08-19T08:42:33.196518"
        },
        {
            "title": "European shares rise as investors weigh potential Russia-Ukraine peace deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-as-investors-weigh-potential-russia-ukraine-peace-deal/articleshow/123382297.cms",
            "description": "European shares edged higher on Tuesday as investors weighed the possibility of a peace deal between Russia and Ukraine following encouraging diplomatic signals after a White House meeting with European leaders.",
            "pubDate": "2025-08-19T08:42:33.196630"
        },
        {
            "title": "GST Push Gives Markets Clear Direction, says Mayuresh Joshi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-push-gives-markets-clear-direction-says-mayuresh-joshi/slideshow/123381768.cms",
            "description": "Mayuresh Joshi, in an interview with ET Now, said that markets have finally found direction after a series of important announcements. He points out that Prime Minister Modi’s move on GST rationalisation has emerged as a key trigger, while the recent upgrade in India’s sovereign rating has also added to positive investor sentiment.",
            "pubDate": "2025-08-19T08:42:33.196747"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Ladder in JSW Steel stock to benefit from bullish outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-ladder-in-jsw-steel-stock-to-benefit-from-bullish-outlook/articleshow/123382187.cms",
            "description": "JSW Steel shares are currently trading at Rs 1,079 and have been consolidating in a wide trading range near their higher levels, indicating a strong base formation. On the daily timeframe, the stock has recently formed an Ascending Triangle pattern, a bullish continuation formation, supported by consistent trading volumes.",
            "pubDate": "2025-08-19T08:42:33.196839"
        },
        {
            "title": "BlueStone Jewellery shares jump over 6% on market debut after weak open below IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bluestone-jewellery-shares-jump-over-6-on-market-debut-after-weak-open-below-ipo-price/articleshow/123381009.cms",
            "description": "BlueStone Jewellery shares saw a positive debut, climbing over 6% after a slightly below-IPO-price opening. The IPO, subscribed 2.72 times overall, raised Rs 1,541 crore. While revenue grew 40% to Rs 1,830 crore in FY25, losses also widened. IPO funds will be used for working capital and general corporate purposes.",
            "pubDate": "2025-08-19T08:42:33.196934"
        },
        {
            "title": "Shreeji Shipping Global IPO subscribed 70% on Day 1 so far; GMP at 11%. Should you subscribe?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shreeji-shipping-global-ipo-subscribed-70-on-day-1-so-far-gmp-at-11-should-you-subscribe/articleshow/123380787.cms",
            "description": "Shreeji Shipping Global’s ₹411 crore IPO was 70% subscribed on Day 1, with a grey market premium of ₹27 (about 11% over issue price), signaling moderate listing optimism. The IPO closes on August 21 and lists on BSE on August 26.",
            "pubDate": "2025-08-19T08:42:33.197036"
        },
        {
            "title": "IITian who quit Amazon job to start jewellery business now worth Rs 1,300 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iitian-who-quit-amazon-job-to-start-jewellery-business-now-worth-rs-1300-crore/articleshow/123383514.cms",
            "description": "Gaurav Singh Kushwaha, founder of BlueStone Jewellery, saw his wealth surge past Rs 1,300 crore after the company’s blockbuster market debut. Holding 17.7% stake, his entrepreneurial journey, inspired by Ratan Tata’s advice, highlights the rise of online-first jewellery retailers.",
            "pubDate": "2025-08-19T09:45:46.961787"
        },
        {
            "title": "Time for risk-takers to come out of hibernation? 5 mid-cap stocks from different sectors with an upside potential of up to 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-for-risk-takers-to-come-out-of-hibernation-5-mid-cap-stocks-from-different-sectors-with-an-upside-potential-of-up-to-27/articleshow/123383160.cms",
            "description": "What the earnings season could not do, the hope of a cut in GST rates has been able to. It has revived hopes of an improvement in the top line in some sectors. There is thus a case to be bullish. But, given the fact that valuations are still not cheap, there is also a case to be selective, both in terms of sectors and stocks within those sectors. Also, some changes taking place on the geopolitical front are likely to give a push to companies that were facing trouble due to conflicts. This has not been generally talked about because these companies operate in niche areas.",
            "pubDate": "2025-08-19T09:45:46.961908"
        },
        {
            "title": "Stocks to Buy | Long-Term Wealth: Strategy Over Short-Term Noise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-long-term-wealth-strategy-over-short-term-noise/slideshow/123383334.cms",
            "description": "Manish Gunwani, in an interview to ET Now, said that investors should avoid being too fearful or too greedy. He believes the market is unlikely to make sharp moves in either direction. With strong macro indicators like inflation and the current account, we can expect sideways movement over the next couple of quarters. This phase is ideal for stock picking and accumulating holdings for the next three to five years.",
            "pubDate": "2025-08-19T09:45:46.962014"
        },
        {
            "title": "11 FII-backed smallcaps post robust profit margins for four consecutive quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-fii-backed-smallcaps-post-robust-profit-margins-for-four-consecutive-quarters/slideshow/123382908.cms",
            "description": "A quiet but powerful rally is taking shape in the smallcap space. A select group of 39 smallcap companies has achieved something remarkable – combining strong profit margins with rising foreign investor interest. Each of these companies has delivered a Profit After Tax (PAT) margin of over 20% for four consecutive quarters, up to the June 2025 quarter. However, that’s not all. What makes this screener even more compelling is the behavior of Foreign Institutional Investors (FIIs). These global investors increased their stakes in these companies during the June 2025 quarter compared with March, signaling growing confidence in their fundamentals.Most of these 39 stocks have already posted double-digit returns in FY26, demonstrating that strong fundamentals are translating into solid market performance. Among them, 11 standout stocks have truly stolen the spotlight, delivering stellar gains of 30% to 70% in just a few months. (Data Source: ACE Equity)",
            "pubDate": "2025-08-19T09:45:46.962112"
        }
    ]
}