{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-06T07:11:51.467734",
    "items": [
        {
            "title": "Nykaa Q2 Preview: Strong festive demand and margin gains to lift earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-q2-preview-strong-festive-demand-and-margin-gains-to-lift-earnings/articleshow/125124422.cms",
            "description": "Nykaa is expected to post strong Q2FY26 results with 25–27% YoY revenue growth, led by festive demand, robust beauty segment performance, and improving fashion margins. Analysts see EBITDA margin expansion and a sharp profit surge driven by premiumisation, cost control, and improved operating leverage.",
            "pubDate": "2025-11-06T07:11:49.825286"
        },
        {
            "title": "Bajaj Auto Q2 Preview: PAT may rise 16% YoY as exports and premium mix drive gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q2-preview-pat-may-rise-16-yoy-as-exports-and-premium-mix-drive-gains/articleshow/125124315.cms",
            "description": "Bajaj Auto is poised for a strong Q2FY26, with PAT projected to rise 16% year-on-year. This growth is fueled by a significant export recovery, particularly in Africa and Latin America, alongside a richer product mix and favorable currency movements. Despite subdued domestic demand, premium motorcycles and three-wheelers are expected to bolster margins and drive double-digit revenue growth.",
            "pubDate": "2025-11-06T07:11:49.825409"
        },
        {
            "title": "Ola Electric Q2 Results: Cons loss narrows to Rs 418 crore YoY, revenue plunges 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ola-electric-q2-results-cons-loss-narrows-to-rs-418-crore-yoy-revenue-falls-43/articleshow/125123540.cms",
            "description": "Ola Electric Q2 Results:  Ola Electric Mobility reported a narrowed consolidated loss of Rs 418 crore in Q2 FY26, an improvement from Rs 495 crore in the prior year. However, its consolidated revenue from operations saw a significant 43% year-on-year decline, falling to Rs 690 crore from Rs 1,214 crore in Q2 FY25.",
            "pubDate": "2025-11-06T07:11:49.825515"
        }
    ]
}