{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-18T05:14:37.857870",
    "items": [
        {
            "title": "Stock Radar: TCS down around 10% from highs! records bullish harmonic pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-tcs-down-around-10-from-highs-records-bullish-harmonic-pattern-time-to-buy/articleshow/115378874.cms",
            "description": "TCS experienced a 10% drop but formed a bullish pattern, hinting at a potential trend reversal. Experts suggest buying opportunities, citing the stock's bounce back from the 50-week moving average and a historical trend of 15% declines followed by upward movements.  Technical analysis points towards a bullish outlook with a potential target of Rs 4,550.",
            "pubDate": "2024-11-18T05:14:23.590203"
        },
        {
            "title": "Technical picks: Indian Hotels, Jio Fin among 5 stocks poised for up to 19% short-term gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-indian-hotels-jio-fin-among-5-stocks-poised-for-up-to-19-short-term-gains/slideshow/115402287.cms",
            "description": "The Nifty50 and S&P BSE Sensex fell nearly 2.5% last week on concerns over earnings moderation and foreign outflows. Meanwhile, a number of analysts have identified several stocks with the potential to deliver up to 19% returns in the near term. Here are 5 technical picks:",
            "pubDate": "2024-11-18T05:14:23.590400"
        },
        {
            "title": "Hero MotoCorp shares rally 5% after Q2 PAT, revenue see double-digit growth. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-rally-5-after-q2-pat-revenue-see-double-digit-growth-should-you-invest/articleshow/115402381.cms",
            "description": "Hero MotoCorp share price: Hero Motocorp's shares surged 5% after reporting a 14% rise in Q2 net profit, reaching ₹1204 crore. Revenue grew 11% to ₹10463 crore, driven by record revenue from parts and accessories. Analysts are optimistic, citing rural market recovery, new launches, and strong brand equity as key growth drivers.",
            "pubDate": "2024-11-18T05:14:23.590615"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/115401801.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2024-11-18T05:14:23.590815"
        },
        {
            "title": "Rs 50 lakh crore gone in bull market disaster! Time for FIIs to come back?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-50-lakh-crore-gone-in-bull-market-disaster-time-for-fiis-to-come-back/articleshow/115401815.cms",
            "description": "After a significant sell-off wiping nearly Rs 50 lakh crore from the Indian stock market, foreign institutional investors (FIIs) are showing early signs of a turnaround.  Analysts believe that reduced selling and potential policy clarity from the Trump administration could lead to renewed FII inflows, potentially boosting the market.",
            "pubDate": "2024-11-18T05:14:23.591027"
        },
        {
            "title": "Sensex dips 500 pts, Nifty below 23,400 as slow earnings and FPI outflows weigh on investor mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-dips-200-pts-nifty-below-23500-as-slow-earnings-and-fpi-outflows-weigh-on-investor-mood/articleshow/115401481.cms",
            "description": "Indian benchmark equity indices traded lower on Monday, weighed down by concerns over slowing earnings growth and foreign outflows. Additionally, comments from the Federal Reserve Chair signaling a slower pace of interest rate cuts further dampened market sentiment.",
            "pubDate": "2024-11-18T05:14:23.591260"
        },
        {
            "title": "Hindustan Zinc shares jump 2% after co emerges preferred bidder for Rajasthan project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-jump-2-after-co-emerges-preferred-bidder-for-rajasthan-project/articleshow/115401703.cms",
            "description": "Hindustan Zinc Share Price: Hindustan Zinc's shares rose 2% after securing the Dugocha Gold & Associated Mineralization Block in Rajasthan, India. The company emerged as the preferred bidder with the highest offer of 8.15%. This acquisition strengthens Hindustan Zinc's precious metals portfolio and supports its commitment to national economic growth.",
            "pubDate": "2024-11-18T05:14:23.591457"
        },
        {
            "title": "These 4 stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/115401644.cms",
            "description": "As of November 14, there was a notable surge in futures open interest for four stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2024-11-18T05:14:23.591654"
        },
        {
            "title": "Reliance Industries shares in focus after completion of Rs 70,352 crore JV with Disney",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-after-completion-of-rs-70352-crore-jv-with-disney/articleshow/115401261.cms",
            "description": "Reliance Industries' shares will be in focus following the completion of the Viacom18-JioCinema-Disney merger, valued at Rs 70,352 crore. The joint venture, controlled by RIL, aims to consolidate media assets and create India's largest integrated media platform. With a strong portfolio of content and sports rights, it aims to reshape entertainment options for Indian consumers.",
            "pubDate": "2024-11-18T05:14:23.591872"
        },
        {
            "title": "Hot Stocks: Brokerages see 20-30% upside in Hero MotoCorp, CG Consumer and Grasim",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerages-see-20-30-upside-in-hero-motocorp-cg-consumer-and-grasim/articleshow/115400951.cms",
            "description": "Global brokerage firms have shared optimistic outlooks on key stocks. Nomura remains bullish on Hero MotoCorp, citing rural growth, while Citi maintains a positive view on Grasim Industries despite a weak Q2. CLSA continues to favor Crompton Greaves Consumer Electricals for its sustained growth and margin improvement, with all three stocks showing significant upside potential.",
            "pubDate": "2024-11-18T05:14:23.592086"
        },
        {
            "title": "Reliance Power shares slide 5% after SECI issues showcause notices over fake bank guarantees",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-in-focus-after-seci-issues-showcause-notices-over-fake-bank-guarantees/articleshow/115400363.cms",
            "description": "Solar Energy Corporation of India (SECI) issued a show-cause notice to Reliance Power and its subsidiary, Reliance NU BESS, for allegedly submitting fake bank guarantees. SECI discovered that the bank guarantee submitted by Reliance NU BESS was fake and has barred the companies from participating in its tenders for three years.",
            "pubDate": "2024-11-18T05:14:23.592307"
        },
        {
            "title": "Muthoot Finance shares zoom 7% after Q2 profit jump 21% YoY; Morgan Stanley lifts target price to Rs 1,600",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muthoot-finance-shares-in-focus-after-q2-profit-jump-21-yoy-morgan-stanley-lifts-target-price-to-rs-1600/articleshow/115400104.cms",
            "description": "Muthoot Finance reported a 21% increase in consolidated net profit for Q2, reaching Rs 1,321 crore.  This growth was driven by a 37% rise in total revenue, reaching Rs 4,929 crore. Consequently, Morgan Stanley upgraded the company to 'Equal-weight' from 'Underweight', raising the target price to Rs 1,600 from Rs 1,430.",
            "pubDate": "2024-11-18T05:14:23.592528"
        },
        {
            "title": "Bullish Momentum: 4 stocks with White Marubozu Pattern on Nov 14",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-4-stocks-with-white-marubozu-pattern-on-nov-14/slideshow/115400027.cms",
            "description": "On November 14, four stocks from the Nifty200 pack came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2024-11-18T05:14:23.592757"
        },
        {
            "title": "Goldman Sachs downgrades Hong Kong stocks to underweight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-downgrades-hong-kong-stocks-to-underweight/articleshow/115399567.cms",
            "description": "Goldman Sachs analysts downgraded their recommendation on the Hong Kong stock market, stating that while valuations are currently low, the market is unlikely to see significant growth due to economic pressures and a shift in China's policy focus towards its domestic economy.",
            "pubDate": "2024-11-18T05:14:23.592976"
        },
        {
            "title": "7 stocks showing RSI Trending Up on November 14",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-stocks-showing-rsi-trending-up-on-november-14/slideshow/115399344.cms",
            "description": "On November 14, seven stocks from the large-cap pack appeared in the RSI Trending Up scan, according to the stockedge.com data. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2024-11-18T05:14:23.593230"
        }
    ]
}