{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-13T08:29:12.186696",
    "items": [
        {
            "title": "Wall Street ends lower; fears of AI bubble and inflation send investors away",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-fears-of-ai-bubble-and-inflation-send-investors-away/articleshow/125943209.cms",
            "description": "Technology stocks led a broad market decline on Friday, with the S&P 500 and Nasdaq falling over 1%. Concerns over an AI bubble, fueled by Broadcom and Oracle's warnings, coupled with rising Treasury yields, pressured investors. Anticipation of key labor and inflation data also contributed to market caution.",
            "pubDate": "2025-12-13T03:05:22.148686"
        },
        {
            "title": "Nifty could reach 30,000 levels by 2026; Bajaj Finserv, IOC, LTIMindtree among top picks: ICICI Direct",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-could-reach-30000-levels-by-2026-bajaj-finserv-ioc-ltimindtree-among-top-picks-icici-direct/articleshow/125943117.cms",
            "description": "ICICI Direct forecasts the Nifty reaching 30,000 by 2026.  The brokerage suggests investing in Bajaj Finserv, Indian Oil Corporation, LTIMindtree, Pidilite Industries, SRF, Can Fin Homes, and Jamna Auto Industries.  BFSI and Consumption sectors are expected to lead growth.  The Bank Nifty is also projected for significant gains.  Current market breadth indicates a potential for broad-based opportunities next year.",
            "pubDate": "2025-12-13T03:05:22.148798"
        },
        {
            "title": "Fed cut boosts D-Street even as rupee, trade worries persist",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-cut-boosts-d-street-even-as-rupee-trade-worries-persist/articleshow/125943062.cms",
            "description": "Indian stock markets saw a modest rise on Friday. The Nifty and Sensex closed higher, gaining about half a per cent. This uptick followed a US interest rate cut. However, uncertainty surrounding a US-India trade deal and a weaker rupee limited further gains. Investors are awaiting clarity on trade tariffs.",
            "pubDate": "2025-12-13T03:05:22.148885"
        },
        {
            "title": "Sebi mandates 2 new EDs to strengthen MIIs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-mandates-2-new-eds-to-strengthen-miis/articleshow/125943041.cms",
            "description": "Sebi has enhanced governance at Market Infrastructure Institutions by mandating the appointment of two executive directors. One ED will manage critical operations, while the other will oversee regulatory functions, compliance, risk, and investor grievances. Both will join the governing board, with hiring to be done through open advertisements.",
            "pubDate": "2025-12-13T03:05:22.148976"
        },
        {
            "title": "Tata Steel to boost capacity by 50% to maintain market lead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-to-boost-capacity-by-50-to-maintain-market-lead/articleshow/125942989.cms",
            "description": "Tata Steel plans a nearly 50% capacity expansion in India to defend market share and secure raw materials, with most capex expected from internal accruals. This strategic move aims to align new capacities with anticipated demand growth post-FY29, ensuring profitability and maintaining a healthy balance sheet.",
            "pubDate": "2025-12-13T03:05:22.149058"
        },
        {
            "title": "Credit demand climbs to 11.5% as deposits lag, RBI data shows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-demand-climbs-to-11-5-as-deposits-lag-rbi-data-shows/articleshow/125943201.cms",
            "description": "Credit demand is increasing across India. Banks are lending more to retail and service sectors. Industrial credit is also firming up. Deposit growth is steady but slower than last year. This trend is expected to continue with a repo rate reduction. Higher disposable income and GST rationalisation are also boosting demand. Rural demand remains robust, and urban demand is recovering.",
            "pubDate": "2025-12-13T03:05:22.149767"
        },
        {
            "title": "Wall Street Week Ahead: Investors eager for delayed data to shed light on US economy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-eager-for-delayed-data-to-shed-light-on-us-economy/articleshow/125943906.cms",
            "description": "Upcoming U.S. economic data, including employment and inflation reports, will offer crucial insights after a federal government shutdown. Investors and the Federal Reserve await this clarity to guide market direction and potential interest rate adjustments. Disappointing tech earnings and a divided Fed decision highlight current economic uncertainties.",
            "pubDate": "2025-12-13T04:15:47.629250"
        },
        {
            "title": "Two Fed dissenters cite inflation risk in votes against rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-fed-dissenters-cite-inflation-risk-in-votes-against-rate-cut/articleshow/125943849.cms",
            "description": "Federal Reserve officials are split on cutting interest rates. Some believe inflation remains too high, citing a lack of recent economic data. They argue for waiting until early next year for updated reports. Others are more concerned about job market weakness. The central bank's decision reflects this ongoing debate as they monitor inflation and employment figures.",
            "pubDate": "2025-12-13T04:15:47.629375"
        },
        {
            "title": "Oracle-Broadcom one-two punch hits AI trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-broadcom-one-two-punch-hits-ai-trade/articleshow/125943790.cms",
            "description": "Recent updates from Oracle and Broadcom have sparked worries about high valuations and debt in AI stocks. Investors are becoming more selective. Despite these concerns, the overall market strength provides reasons for optimism. Short sellers are not aggressively betting against major AI companies. The AI trade remains intact for many, though performance may moderate.",
            "pubDate": "2025-12-13T04:15:47.629476"
        },
        {
            "title": "ICICI Pru AMC to Corona Remedies: GMPs suggest up to 63% returns for 15 IPO listings next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-pru-amc-to-corona-remedies-gmps-suggest-up-to-63-returns-for-15-ipo-listings-next-week/slideshow/125944300.cms",
            "description": "A crowded primary market calendar will spill into next week with 15 IPOs scheduled to list between December 15 and December 19 across the NSE SME and BSE SME platforms. Grey market premiums indicate a wide dispersion in listing expectations, ranging from flat debuts to gains of over 60%.",
            "pubDate": "2025-12-13T05:09:26.375997"
        },
        {
            "title": "Fed's Hammack would prefer tighter policy given too high inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-hammack-would-prefer-tighter-policy-given-too-high-inflation/articleshow/125944016.cms",
            "description": "Cleveland Fed President Beth Hammack believes monetary policy should be tighter. She feels current interest rates are around neutral. Hammack would prefer a more restrictive stance to pressure inflation. She indicated this view ahead of a recent rate cut. Hammack will be a voting member of the FOMC next year.",
            "pubDate": "2025-12-13T05:09:26.376118"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/125943963.cms",
            "description": "EU leaders are pushing for a deal to fund Ukraine using frozen Russian assets, a critical move amid the ongoing conflict. Meanwhile, the US releases key economic data, offering insights into the Federal Reserve's next steps. Central banks across Europe, Japan, Britain, Norway, and Sweden are concluding their year with crucial policy meetings, potentially impacting global markets.",
            "pubDate": "2025-12-13T05:09:26.376216"
        },
        {
            "title": "Shipping sector: Will it be the next one to get re-rated? 8 stocks from the shipping ecosystem. Some known, some not so much",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shipping-sector-will-it-be-the-next-one-to-get-re-rated-8-stocks-from-the-shipping-ecosystem-some-known-some-not-so-much/articleshow/125946371.cms",
            "description": "A long coastline, the required human resources available at reasonable prices, a clearly visible path of growing domestic demand. In short, all that is required for India to become a force to reckon with in the global shipping and maritime industry. The one thing missing: The focus of policymakers. Now, in the past six months, there are signs that policymakers have decided that maritime security and shipping have to become focus areas. From required changes in the policy framework to allocating resources, everything is happening. Will it change the fortunes of companies in the shipping industry ecosystem?",
            "pubDate": "2025-12-13T08:29:05.402947"
        },
        {
            "title": "These 8 stocks in Anil Kumar Goel’s portfolio surged up to 60% in FY26 – Are you holding any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-8-stocks-in-anil-kumar-goels-portfolio-surged-up-to-60-in-fy26-are-you-holding-any/slideshow/125946675.cms",
            "description": "Investors often keep a close eye on the portfolios of seasoned market players for cues, and ETMarkets has reviewed the recent filings of veteran investor Anil Kumar Goel and Associates'. As per the September 2025 quarter filings, Goel has reported stakes above 1% in around 34 listed companies, with the portfolio’s total value standing at nearly Rs 2,008 crore as of December 12, 2025—a modest 4% rise from about Rs 1,933 crore in March 2025.",
            "pubDate": "2025-12-13T08:29:05.403067"
        },
        {
            "title": "Jefferies names Axis Bank, M&M, among 10 stocks as its top bets. How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-names-axis-bank-mm-among-10-stocks-as-its-top-bets-how-many-do-you-own/slideshow/125945899.cms",
            "description": "Global brokerage firm Jefferies projects the Nifty to reach 28,300 by December 2026, attributing this forecast to two strong drivers — sustained equity supply and robust domestic flows. These factors are expected to keep Indian equity markets range-bound over the coming year.The target is based on a 20x PE multiple on estimated Dec-27 earnings, which implies a modest 5% de-rating from current levels. In line with this outlook, Jefferies has highlighted its top 10 stock picks, reflecting sectors such as lending, autos, cement, hospitality, telecom, property, staples, IT, industrials, and pharmaceuticals.",
            "pubDate": "2025-12-13T08:29:05.403172"
        },
        {
            "title": "Concurrent Gainers: 8 smallcap stocks that gain for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-8-smallcap-stocks-that-gain-for-5-days-in-a-row/slideshow/125945745.cms",
            "description": "Over the five trading sessions ending December 12, the Sensex closed lower, declining 0.52%, or 445 points, to settle at 85,268. The benchmark finished in the red in three of the five sessions between December 8 and 12. Despite broader market weakness and some volatility, eight small-cap stocks managed to post gains across all five sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-12-13T08:29:05.403273"
        },
        {
            "title": "Up to 5,500% return! BSE, Adani Enterprises among India's top 10 fastest wealth multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/up-to-5500-return-bse-adani-enterprises-among-indias-top-10-fastest-wealth-multibaggers/slideshow/125945613.cms",
            "description": "Motilal Oswal's latest wealth creation study highlights how a narrow set of companies delivered fastest shareholder returns between 2020 and 2025, a period marked by Covid disruption, a sharp earnings rebound, and a structural re-rating of select sectors. The study tracks total shareholder returns, profit growth and market capitalisation expansion to identify the fastest wealth creators over five years.",
            "pubDate": "2025-12-13T08:29:05.403392"
        },
        {
            "title": "Hotels set for a strong 2HFY26: Indian Hotels, Lemon Tree strong buys",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hotels-set-for-a-strong-2hfy26-indian-hotels-lemon-tree-strong-buys/articleshow/125945299.cms",
            "description": "India's hotel sector is experiencing sustained acceleration, driven by a broad recovery across business, leisure, weddings, and MICE segments. Strong room rates and stable occupancies in the first half of FY26 are expected to continue, with new infrastructure and a rich event calendar poised for an even stronger second half.",
            "pubDate": "2025-12-13T08:29:05.403488"
        }
    ]
}