{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-13T10:50:28.829125",
    "items": [
        {
            "title": "IT Q3 earnings season begins on a strong note as TCS, HCL Tech top estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/it-q3-earnings-season-begins-on-a-strong-note-as-tcs-hcl-tech-top-estimates/articleshow/126494707.cms",
            "description": "IT sector's Q3 results show a positive start, with TCS and HCL Technologies exceeding revenue and profit expectations. HCL Tech recorded a nine-quarter high in new order bookings, while TCS maintained strong deal flow. Despite sustained new deals, TCS faces a revenue growth deceleration, raising concerns about deal ramp-up amid client delays.",
            "pubDate": "2026-01-13T01:41:29.791814"
        },
        {
            "title": "Infosys Q3 results preview: PAT, revenue may grow by up to 9% YoY; FY26 guidance, deals pipeline in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/infosys-q3-results-preview-pat-revenue-may-grow-by-up-to-9-yoy-fy26-guidance-deals-pipeline-in-focus/articleshow/126496894.cms",
            "description": "Infosys' Q3 results are anticipated to show modest growth, with brokerages predicting a slight uptick in net profit and revenue. While near-term momentum might be tempered by seasonal factors, the focus will be on management's outlook for FY26, deal execution, and client spending trends amidst global economic uncertainties.",
            "pubDate": "2026-01-13T05:54:56.924435"
        },
        {
            "title": "ICICI Prudential Life Q3 Results: PAT jumps 19% YoY to Rs 397 crore, net premium income drops 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-prudential-life-q3-results-pat-jumps-19-yoy-to-rs-397-crore-net-premium-income-drops-4/articleshow/126501538.cms",
            "description": "ICICI Prudential Life reported a 19% YoY rise in Q3 PAT to Rs 387 crore even as net premium income fell 3.7%. VNB touched Rs 615 crore with strong margins, while AUM grew 6.5%. Retail protection APE surged over 40%, supported by GST reforms and rising policy volumes.",
            "pubDate": "2026-01-13T10:28:15.626416"
        },
        {
            "title": "Bank of Maharashtra Q3 Results: Net profit rises 26.5% YoY to Rs 1,779 crore, NII jumps 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-maharashtra-q3-results-net-profit-rises-26-5-yoy-to-rs-1779-crore-nii-jumps-16/articleshow/126503158.cms",
            "description": "Bank of Maharashtra posted a 26.5% year-on-year rise in Q3FY26 net profit to ₹1,779 crore, supported by strong operating performance and better asset quality. Net interest income grew 16.3% to ₹7,344 crore, while return on assets improved to 1.86%.",
            "pubDate": "2026-01-13T10:50:28.307417"
        }
    ]
}