{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-12T03:47:00.869547",
    "items": [
        {
            "title": "NLC India shares in focus following MoU with KABIL for global critical mineral projects",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nlc-india-shares-in-focus-following-mou-with-kabil-for-global-critical-mineral-projects/articleshow/123842400.cms",
            "description": "Shares of NLC India may remain in focus after the company signed an MoU with Khanij Bidesh India (KABIL) to jointly identify, acquire, and develop critical mineral and rare earth element assets globally. The move aims to secure India’s access to essential minerals vital for EVs, electronics, defence, and renewable energy industries, strengthening mineral security.",
            "pubDate": "2025-09-12T03:46:39.632312"
        },
        {
            "title": "Lodha Developers shares in focus on Rs 30,000-crore MoU with Maharashtra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lodha-developers-shares-in-focus-on-rs-30000-crore-mou-with-maharashtra/articleshow/123842382.cms",
            "description": "Shares of Lodha Developers will be in focus on September 12 after the Maharashtra government signed an MoU with the company to set up a Rs 30,000 crore Green Integrated Data Centre Park in Palava. Planned in the Mumbai Metropolitan Region, the park will have a 2 GW capacity and host both global and domestic operators.",
            "pubDate": "2025-09-12T03:46:39.632451"
        },
        {
            "title": "Oracle Financial Services, BSE, Angel One among 8 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-financial-services-bse-angel-one-among-8-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123842329.cms",
            "description": "There was a notable surge in futures open interest for eight stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as of September 11, as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-12T03:46:39.632556"
        },
        {
            "title": "At multi-year highs: Jayaswal Neco, Zydus Wellness among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-jayaswal-neco-zydus-wellness-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/123842024.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, six stocks witnessed a 5-year swing high at the close on September 11, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-12T03:46:39.632661"
        },
        {
            "title": "Bharat Forge shares in focus following 2 defence and aerospace collaborations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-forge-shares-in-focus-following-2-defence-and-aerospace-collaborations/articleshow/123841918.cms",
            "description": "Bharat Forge has announced international partnerships, boosting its defence and aerospace presence. A collaboration with Windracers (UK) will localize UAV production in India, targeting military and civil sectors. Separately, Kalyani Strategic Systems secured a deal with UAE's GRADEONE to export artillery components, marking a first between Indian and Emirati firms.",
            "pubDate": "2025-09-12T03:46:39.632761"
        },
        {
            "title": "South Korean stocks hit record high on AI, market reform optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-stocks-hit-record-high-on-ai-market-reform-optimism/articleshow/123841803.cms",
            "description": "South Korean shares surged to a record high, marking their best weekly performance in over 18 months, fueled by optimism surrounding artificial intelligence and domestic market reforms. Chipmakers like Samsung Electronics and SK Hynix led the gains, driven by anticipated demand from the global AI boom.",
            "pubDate": "2025-09-12T03:46:39.632857"
        },
        {
            "title": "Japan's Nikkei hits record high, overheating caution limits gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-hits-record-high-overheating-caution-limits-gains/articleshow/123841770.cms",
            "description": "Nikkei in Japan reached a record high today, mirroring Wall Street's performance. However, market caution limited further gains. Investors felt the market might be overheating. Wall Street saw record closes due to expectations of Federal Reserve interest rate cuts. Chip-related stocks and Fast Retailing contributed to Nikkei's rise. SoftBank Group experienced a slight dip after a significant surge this week.",
            "pubDate": "2025-09-12T03:46:39.632952"
        },
        {
            "title": "Asian Paints shares in focus as Court rejects plea to quash antitrust probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-shares-in-focus-as-court-rejects-plea-to-quash-antitrust-probe/articleshow/123841759.cms",
            "description": "Asian Paints share price: The Bombay High Court dismissed Asian Paints plea to quash a CCI probe into alleged market abuse. The investigation, triggered by rival Birla Opus, accuses Asian Paints of unfair dealer practices to stifle competition.",
            "pubDate": "2025-09-12T03:46:39.633048"
        },
        {
            "title": "Infosys shares in focus as co announces its biggest Rs 18,000 crore share buyback at 19% premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-as-co-announces-its-biggest-rs-18000-crore-share-buyback-at-19-premium/articleshow/123841692.cms",
            "description": "Infosys share price: Infosys has announced its biggest-ever share buyback worth Rs 18,000 crore via the tender route at Rs 1,800 per share, a 19% premium over Thursday's closing price. The move aims to repurchase 10 crore shares (2.41% equity) and boost shareholder value amid a weak demand outlook.",
            "pubDate": "2025-09-12T03:46:39.633141"
        },
        {
            "title": "Axis Bank, Bharti Airtel among 5 Nifty stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-bharti-airtel-among-5-nifty-stocks-showing-rsi-trending-up/slideshow/123841619.cms",
            "description": "Five stocks from the Nifty50 pack were highlighted in the RSI Trending Up scan on September 11, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-12T03:46:39.633235"
        },
        {
            "title": "Oracle nears $1 trillion market cap milestone. So, who all own the cloud giant?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-nears-1-trillion-market-cap-milestone-so-who-all-own-the-cloud-giant/articleshow/123841546.cms",
            "description": "Oracle’s $244 billion rally pushed its market cap to $922 billion, briefly making Larry Ellison the world’s richest man. With Ellison holding 41%, attention shifts to other top shareholders like Vanguard, BlackRock, and State Street as the company eyes the trillion-dollar club.",
            "pubDate": "2025-09-12T03:46:39.633323"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Sobha, Coal India among 4 stocks that could give 12-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-sobha-coal-india-among-4-stocks-that-could-give-12-30-return/slideshow/123841410.cms",
            "description": "Brokerages have turned positive on select names across real estate, energy, capital goods, and commodities, projecting healthy returns for investors.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-12T03:46:39.633431"
        },
        {
            "title": "Glenmark, Texmaco Rail shares in focus on the last day to buy for dividend eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/glenmark-texmaco-rail-shares-in-focus-on-the-last-day-to-buy-for-dividend-eligibility/articleshow/123841360.cms",
            "description": "Investors eyeing dividends from Glenmark Pharmaceuticals, Texmaco Rail & Engineering, and other companies must purchase shares today. September 12, 2025, is the record date for eligibility. Numerous firms, including Aarti Pharmalabs and DOMS Industries, have announced final dividends with the same record date, making today a crucial opportunity for dividend-seeking investors.",
            "pubDate": "2025-09-12T03:46:39.633529"
        },
        {
            "title": "Vigor Plast IPO set for listing today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vigor-plast-ipo-set-for-listing-today-heres-what-gmp-indicates/articleshow/123841318.cms",
            "description": "Vigor Plast India, a Gujarat-based pipes manufacturer, is launching its IPO on the NSE SME platform. The Rs 25-crore IPO opened on September 4 and closed on September 9. The IPO comprises fresh share sale and offer for sale. Proceeds will be used to repay borrowings and fund a new warehouse. The IPO was subscribed 3.9 times overall.",
            "pubDate": "2025-09-12T03:46:39.633619"
        },
        {
            "title": "Sharvaya Metals shares to debut today. Check GMP ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sharvaya-metals-shares-to-debut-today-check-gmp-ahead-of-listing/articleshow/123841300.cms",
            "description": "Sharvaya Metals, an aluminium product manufacturer, will list its shares on the Bombay Stock Exchange SME platform on Friday. The initial public offering of Rupees 58.8 crore was subscribed 4.8 times. The company plans to use the funds for working capital and expansion. Retail investors showed strong interest in the IPO. The company manufactures aluminium products for various industries.",
            "pubDate": "2025-09-12T03:46:39.633708"
        },
        {
            "title": "Austere Systems IPO listing today. GMP hints at robust gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/austere-systems-ipo-listing-today-gmp-hints-at-robust-gains/articleshow/123841278.cms",
            "description": "Austere Systems' IPO received massive subscription. The shares are ready to debut on the Bombay Stock Exchange SME platform this Friday. The IPO was booked 1,077 times. It is one of the most sought-after small-cap issues. The IPO will fund capital expenditure and general corporate purposes.",
            "pubDate": "2025-09-12T03:46:39.633797"
        }
    ]
}