{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-11T10:49:09.996552",
    "items": [
        {
            "title": "Avenue Supermart Q2 Results: DMart operator's cons PAT rises 4% YoY to Rs 685 crore, revenue jumps 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/avenue-supermart-q2-results-dmart-operators-cons-pat-rises-4-to-rs-685-crore-revenue-jumps-15/articleshow/124475241.cms",
            "description": "Avenue Supermarts, which operates retail store chain DMart, on Saturday reported a 4% growth in its Q2 net profit at Rs 685 crore versus Rs 660 crore in the year ago period. The profit after tax (PAT) is attributable to the equity holders of the parent.",
            "pubDate": "2025-10-11T10:48:52.307662"
        },
        {
            "title": "Diwali 2025 Picks: Axis picks 9 stocks that could deliver returns up to 23%. Check full list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-2025-picks-axis-picks-9-stocks-that-could-deliver-returns-up-to-23-check-full-list/slideshow/124475208.cms",
            "description": "Axis Direct has unveiled its Diwali Mahurat Picks for Samvat 2082, highlighting a set of long-term investment ideas across diverse sectors. The brokerage suggests a “buy on dips” approach for these stocks, with an investment horizon of over 12 months. Samvat 2081 proved a challenging year for the Indian equity market, which underperformed both global and emerging markets for the first time since the Covid-19 era.",
            "pubDate": "2025-10-11T10:48:52.307791"
        },
        {
            "title": "Dalal Street Week: Nifty eyes breakout above 25,550 as auto, metal, PSU banks lead momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-eyes-breakout-above-25550-as-auto-metal-psu-banks-lead-momentum/articleshow/124473754.cms",
            "description": "Nifty gained 1.57% last week, oscillating within a symmetrical triangle and testing key resistance at 25,550. While Auto, Metal, and PSU Bank sectors show relative strength, Midcap, Commodities, and Financials lag. Traders should adopt stock-specific strategies, protect profits, and monitor global macro cues.",
            "pubDate": "2025-10-11T10:48:52.307904"
        },
        {
            "title": "Smallcap rally: Jindal Photo, SpiceJet among top 10 weekly gainers, rise up to 41%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-rally-jindal-photo-spicejet-among-top-10-weekly-gainers-rise-up-to-41/slideshow/124473651.cms",
            "description": "A few smallcap stocks witnessed strong investor interest during the week, rising by as much as 41% even as the BSE Smallcap index had a lackluster run with flat returns. In this, 38 stocks delivered double-digit returns and a total of 38% (463) stocks closed in the green. Here are the top 10 weekly performers:",
            "pubDate": "2025-10-11T10:48:52.308010"
        },
        {
            "title": "“Hot, Hot, Hot”: Robert Kiyosaki on silver and Ethereum, sees white metal hitting $75",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-hot-hot-robert-kiyosaki-on-silver-and-ethereum-sees-white-metal-hitting-75/articleshow/124473348.cms",
            "description": "Robert Kiyosaki reaffirmed his bullish outlook on silver and Ethereum, predicting silver could reach $75 per ounce. Silver recently crossed $50, hitting an 11-year high, driven by industrial demand, inflation hedge appeal, and weak rupee support.",
            "pubDate": "2025-10-11T10:48:52.308111"
        },
        {
            "title": "Market wrap: 263 of BSE 500 stocks end week in green as FIIs turn net buyers. IT, health scrips shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-263-of-bse-500-stocks-end-week-in-green-as-fiis-turn-net-buyers-it-health-scrips-shine/articleshow/124471631.cms",
            "description": "Indian markets ended the week steady, with BSE 500 up 1.3%. IT, telecom, and healthcare stocks led gains, supported by domestic and foreign investor inflows, while metals, auto, and industrials lagged slightly.",
            "pubDate": "2025-10-11T10:48:52.308214"
        },
        {
            "title": "10 Tata Group stocks crash up to 60% from their high — Is yours on the list?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-tata-group-stocks-crash-up-to-60-from-their-high-is-yours-on-the-list/slideshow/124471089.cms",
            "description": "The year 2025 has been rough for Tata Group investors — nearly half of its listed companies have suffered double-digit losses, wiping out ₹4.56 lakh crore in market value. TCS alone accounted for a staggering ₹3.86 lakh crore, or 85% of the decline.Several group stocks have crashed 30–60% from their 52-week highs, with Tejas Networks leading the fall at nearly 60%. The broad weakness underscores fading investor confidence across India’s most storied conglomerate. (Data Source: ACE Equity)",
            "pubDate": "2025-10-11T10:48:52.308314"
        },
        {
            "title": "Concurrent Gainers: 8 BSE500 stocks gain for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-8-bse500-stocks-gain-for-5-days-in-a-row/slideshow/124470845.cms",
            "description": "Over the five trading sessions ending October 10, the Sensex climbed 1.6%, adding 1,294 points to close at 82,500. The benchmark index finished in the green on four out of the five days. During this rally, eight stocks from the BSE500 index posted consistent gains across all five sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-10-11T10:48:52.308433"
        },
        {
            "title": "REIT revolution: Sebi’s equity reclassification sets stage for big inflows and valuation re-rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reit-revolution-sebis-equity-reclassification-sets-stage-for-big-inflows-and-valuation-re-rating/articleshow/124470512.cms",
            "description": "SEBI’s move to reclassify REITs as equity instruments marks a pivotal shift, paving the way for index inclusion, deeper liquidity, and valuation re-rating. The change aligns India with global standards and could trigger major institutional inflows, mainstreaming REITs within core equity allocations.",
            "pubDate": "2025-10-11T10:48:52.308533"
        },
        {
            "title": "Wall Street selloff raises worries about market downturn",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-selloff-raises-worries-about-market-downturn/articleshow/124469816.cms",
            "description": "U.S. stocks experienced a sharp decline on Friday after President Trump revived tariff threats against China, canceling a meeting with President Xi Jinping. This move triggered worries of a trade war, impacting markets already at record highs. While some see this as a sign of jitters due to high valuations, others believe AI will remain the primary market driver.",
            "pubDate": "2025-10-11T10:48:52.308635"
        },
        {
            "title": "Trump's fresh tariff threats knock Europe stocks to weekly loss in last-minute slide",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-fresh-tariff-threats-knock-europe-stocks-to-weekly-loss-in-last-minute-slide/articleshow/124469753.cms",
            "description": "European markets experienced a sharp decline on Friday, reversing earlier weekly gains due to renewed trade war anxieties sparked by U.S. President Trump's tariff threats. Auto stocks led the downturn, while political uncertainty in France also weighed on investor sentiment.  This late-week sell-off overshadowed earlier optimism driven by monetary policy hopes and AI enthusiasm.",
            "pubDate": "2025-10-11T10:48:52.308730"
        },
        {
            "title": "Sebi revises penalty norms for stock brokers to remove ‘stigma’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-revises-penalty-norms-for-stock-brokers-to-remove-stigma/articleshow/124469553.cms",
            "description": "Stock market regulator Sebi has streamlined penalty rules for brokers, introducing a single penalty per violation across exchanges. The number of penalties has been drastically cut from 235 to 90, with many minor lapses now facing financial disincentives instead of penalties. This move aims to reduce reputational risk and provide significant relief to the broking community.",
            "pubDate": "2025-10-11T10:48:52.308824"
        },
        {
            "title": "Dalal Street stronger this week on sectoral bounces, easing dollar outflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-stronger-this-week-on-sectoral-bounces-easing-dollar-outflows/articleshow/124469511.cms",
            "description": "Indian stock markets closed higher on Friday, marking their best weekly gain since late June. This rise was supported by a recovery in IT and bank stocks, alongside reduced foreign institutional selling. Analysts suggest that upcoming second-quarter earnings will be key to sustaining this upward trend. The Nifty and Sensex both saw significant weekly gains, indicating a positive market sentiment.",
            "pubDate": "2025-10-11T10:48:52.308927"
        },
        {
            "title": "Wall Street Week Ahead: Investors seek economic clues from bank earnings amid data fog",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-seek-economic-clues-from-bank-earnings-amid-data-fog/articleshow/124469479.cms",
            "description": "Markets are watching bank earnings reports closely. These reports will offer clues about the U.S. economy's strength. Trade tensions with China and a government shutdown are creating uncertainty. Investors are keen to see if corporate profits can sustain the market's upward trend. Upcoming earnings from banks like JPMorgan and Goldman Sachs are crucial.",
            "pubDate": "2025-10-11T10:48:52.309018"
        },
        {
            "title": "Wall Street tumbles to its worst day since April after Trump threatens more tariffs on China",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-tumbles-to-its-worst-day-since-april-after-trump-threatens-more-tariffs-on-china/articleshow/124469693.cms",
            "description": "Wall Street experienced a sharp decline on Friday. President Donald Trump's threat to significantly increase tariffs on China triggered a massive sell-off. Major stock indices like the S&P 500, Dow Jones, and Nasdaq saw substantial drops. This escalation in trade tensions impacted global markets, with European and Asian indexes also falling. The oil market also reacted to the news.",
            "pubDate": "2025-10-11T10:48:52.309111"
        }
    ]
}