{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-07T11:44:57.879947",
    "items": [
        {
            "title": "Rupee trajectory and Rs 10,600-cr ICICI Pru AMC IPO among 7 key triggers for D-Street this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rupee-trajectory-and-rs-10600-cr-icici-pru-amc-ipo-among-7-key-triggers-for-d-street-this-week/articleshow/125813161.cms",
            "description": "Nifty ended the week flat with a mildly negative bias, but Friday’s 0.59% surge to 26,186.45 signalled continued strength. Analysts say the index’s bullish structure supports a buy-on-dips approach. With RSI at 63 and MACD positive, momentum remains firm. Key resistance lies at 26,350, and a breakout could take Nifty toward 26,600 as markets eye crucial cues this week",
            "pubDate": "2025-12-07T04:39:28.611906"
        },
        {
            "title": "Mcap of five of top-10 most-valued firms surges Rs 72,285 cr; TCS, Infosys biggest winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-five-of-top-10-most-valued-firms-surges-rs-72285-cr-tcs-infosys-biggest-winners/articleshow/125813435.cms",
            "description": "The combined market valuation of five of the top-10 most valued firms surged by Rs 72,284.74 crore last week, with Tata Consultancy Services (TCS) and Infosys emerging as the biggest winners.",
            "pubDate": "2025-12-07T05:50:12.715576"
        },
        {
            "title": "Wall Street bets Chinese stocks will extend $2.4 trillion rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-bets-chinese-stocks-will-extend-2-4-trillion-rally/articleshow/125813365.cms",
            "description": "China has regained global investor confidence in a stellar year for stocks, with the MSCI China Index rising about 30%, adding $2.4 trillion in value and outperforming the S&P 500. Fund managers including Amundi, BNP Paribas, Fidelity and Man Group expect further gains in 2026, driven by AI innovation and market resilience, as both passive and active inflows fuel the rally.",
            "pubDate": "2025-12-07T05:50:12.715691"
        },
        {
            "title": "Nifty at 26K, but why is your stock portfolio bleeding?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-at-26k-but-why-is-your-stock-portfolio-bleeding/articleshow/125813260.cms",
            "description": "Nifty crossed 26,000 on November 26, 2025, followed by the SENSEX breaching 86,000, signalling market optimism. However, investors’ portfolios tell a different story. While Nifty rose 6–7% over the past year, the BSE SmallCap index fell 5% and the MidCap index gained only 2%. This divergence highlights why index highs aren’t uniformly reflected across all portfolios.",
            "pubDate": "2025-12-07T05:50:12.715884"
        },
        {
            "title": "11 penny stocks crashed up to 93% in FY26 so far; are you holding any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-penny-stocks-crashed-up-to-93-in-fy26-so-far-are-you-holding-any/slideshow/125814786.cms",
            "description": "In FY26 to date, 11 penny stocks have fallen between 50% and 93%. These laggards were identified using specific filters: a market cap below Rs 1,000 crore, a stock price under Rs 20, and a minimum recent trading volume of 5 lakh shares. The screening aimed to highlight low-priced, high-volume micro-cap stocks that have significantly underperformed this fiscal year. (Data Source: ACE Equity)",
            "pubDate": "2025-12-07T09:31:24.522088"
        },
        {
            "title": "Warren Buffett is buying, Michael Burry is shorting: The AI trade splitting Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-is-buying-michael-burry-is-shorting-the-ai-trade-splitting-wall-street/articleshow/125815521.cms",
            "description": "Warren Buffett and Michael Burry are taking opposing stances on the AI boom, highlighting investor uncertainty. Buffett’s Berkshire Hathaway has added a major stake in Alphabet, signaling confidence in the AI-driven growth, while Burry shorts Palantir and Nvidia, criticizing Big Tech accounting practices. Their contrasting positions coincide with transitions in their careers and growing debate over whether AI hype is justified or a bubble.",
            "pubDate": "2025-12-07T09:49:51.544242"
        },
        {
            "title": "These 9 largecap stocks have up to 34% upside potential. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-largecap-stocks-have-up-to-34-upside-potential-do-you-own-any/slideshow/125815951.cms",
            "description": "Analyst forecasts offer more than just numbers — they provide a strategic view of future market potential. For investors seeking the next big opportunity, a closer look at BSE large-cap stocks highlights some promising contenders.Based on consensus estimates from Trendlyne, several large-cap stocks are projected to deliver strong returns over the next 12 months. This anticipated upside represents the average expected gain over the coming year, offering a data-driven benchmark for investors targeting high-potential large-cap opportunities. In this analysis, we spotlight nine standout large-cap stocks expected to generate gains ranging from 20% to 34% in the year ahead. Only companies reporting positive sequential net profit growth in the latest quarter have been included.",
            "pubDate": "2025-12-07T10:51:59.477421"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/125816485.cms",
            "description": "Indian markets ended higher on Friday as the Sensex and Nifty rebounded, driven by gains in financial and auto stocks after the RBI delivered an unexpected 25 bps rate cut. The surprise move, paired with softer inflation forecasts and supportive liquidity, fuelled a risk-on mood. Analysts said rate-sensitive sectors, autos, real estate and NBFCs, led the rally as borrowing costs eased.",
            "pubDate": "2025-12-07T11:44:56.902603"
        }
    ]
}