{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-19T06:38:20.818479",
    "items": [
        {
            "title": "Tech Mahindra declares Rs 15 dividend, fixes November 1 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-declares-rs-15-dividend-fixes-november-1-as-record-date/articleshow/114367026.cms",
            "description": "Tech Mahindra Dividend: Tech Mahindra has announced a Rs 15 per share interim dividend for its shareholders. To be eligible for this payout, investors must hold Tech Mahindra shares as of November 1st, which is the record date. This dividend announcement was made alongside the release of the company's quarterly results for the period ending in September 2024.",
            "pubDate": "2024-10-19T05:56:38.433910"
        },
        {
            "title": "Tech Mahindra Q2 Results: Profit zooms 153% YoY to Rs 1,250 crore, revenue up 3.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q2-results-profit-zooms-153-yoy-to-rs-1250-crore-revenue-up-3-5/articleshow/114366388.cms",
            "description": "Tech Mahindra Q2 Results: Tech Mahindra reported a 153.1% YoY surge in Q2 net profit to Rs 1,250 crore, with revenue increasing 3.5% YoY to Rs 13,313 crore. The Mahindra Group firm declared an interim dividend of Rs 15 per share. PAT margin rose, with new deal wins totalling $603 million.",
            "pubDate": "2024-10-19T05:56:38.434025"
        },
        {
            "title": "L&T Finance Q2 Results: Net profit rises 17%; expects challenging six months ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-finance-q2-net-profit-rises-17-pc-expects-challenging-six-months-ahead/articleshow/114357410.cms",
            "description": "Non-bank lender L&T Finance reported a 17% rise in consolidated profit after tax, reaching Rs 696 crore. The company's assets grew by 18%, with retail disbursements up 12%. Facing sectoral challenges, the firm aims to prioritize credit outcomes, maintaining stable net interest margins and reducing the cost of funds.",
            "pubDate": "2024-10-19T05:56:38.434121"
        },
        {
            "title": "ICICI Lombard Q2 Results: Net profit jumps 20% YoY to Rs 694 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-lombard-q2-results-net-profit-jumps-20-yoy-to-rs-694-crore/articleshow/114354522.cms",
            "description": "The company's gross direct premium income reached Rs 14,409 crore in H1FY25, up from Rs 12,472 crore in the same period last year. Excluding crop and mass health segments, the company's GDPI growth stood at 15%, surpassing the industry growth rate of 10.9% in H1FY25.",
            "pubDate": "2024-10-19T05:56:38.434218"
        },
        {
            "title": "Kotak Mahindra Bank Q2 Results Preview: NII may surge by up to 13% YoY on double-digit loan growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-bank-q2-results-preview-nii-may-surge-by-up-to-13-yoy-on-double-digit-loan-growth/articleshow/114353703.cms",
            "description": "JM Financial is the most optimistic about NII and PAT figures, while ICICI Securities takes a more cautious stance. ICICI Securities anticipates a 4.2% decline in PAT, in contrast to its peers who project growth ranging from 5.5% to 12.4%.",
            "pubDate": "2024-10-19T05:56:38.434317"
        },
        {
            "title": "Jio Financial Q2 Results: Cons PAT rises 3% YoY to Rs 689 crore, revenue jumps 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q2-results-cons-pat-rises-3-yoy-to-rs-689-crore-revenue-jumps-14/articleshow/114352681.cms",
            "description": "Jio Financial Q2 Results: The company reported quarterly revenue of Rs 693.50 crore, a 14% increase from Rs 608.04 crore in the same quarter last year. Sequentially, PAT surged 120% compared to Rs 312.63 crore in Q1FY25, while revenue rose 66% from Rs 417.82 crore in the April-June quarter.",
            "pubDate": "2024-10-19T05:56:38.434408"
        },
        {
            "title": "Geojit Financial Services Q2 Results: PAT jumps 53% to Rs 57 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/geojit-financial-services-q2-results-pat-jumps-53-in-september-quarter/articleshow/114350955.cms",
            "description": "Geojit Financial Services Ltd on Friday reported a 53 per cent year-on-year jump in profit after tax to Rs 57.42 crore in three months ended September 2024. In comparison, the company had posted a profit after tax (PAT) of Rs 37.48 crore in the year-ago period.",
            "pubDate": "2024-10-19T05:56:38.434504"
        },
        {
            "title": "Oberoi Realty Q2 Results: Profit jumps 29% on strong demand for premium housing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oberoi-realty-q2-results-profit-jumps-29-on-strong-demand-for-premium-housing/articleshow/114350908.cms",
            "description": "India's Oberoi Realty reported a jump in second-quarter profit boosted by sustained demand for its premium projects, including luxury homes and office spaces.",
            "pubDate": "2024-10-19T05:56:38.434597"
        },
        {
            "title": "Kotak Bank to announce Q2 results today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-bank-to-announce-q2-results-today-heres-what-to-expect/articleshow/114368377.cms",
            "description": "Kotak Bank's profit after tax (PAT) for the reported quarter is estimated to range between Rs 3,058 crore and Rs 3,588 crore, reflecting a potential year-on-year net profit growth of up to 12.4%.",
            "pubDate": "2024-10-19T06:38:20.025195"
        }
    ]
}