{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-28T10:27:32.858658",
    "items": [
        {
            "title": "Adani wipeout hurts but won't derail foreign investor faith in India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/analysis-adani-wipeout-hurts-but-wont-derail-foreign-investor-faith-in-india/articleshow/115767130.cms",
            "description": "Worries of a wider spillover from bribery charges against the Adani Group will hurt sentiment in India but not the long-term outlook, global investors say, as they wager one of the world's best-performing markets will get back on track next year.",
            "pubDate": "2024-11-28T10:27:21.100072"
        },
        {
            "title": "SBI Life & other insurance stocks tumble up to 8%. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-life-other-insurance-stocks-tumble-up-to-8-heres-why/articleshow/115766023.cms",
            "description": "Shares of Life Insurance companies took a dip, falling as much as 8% on the BSE on Thursday after reports suggested that the insurance regulator IRDAI is considering limiting a parent bank's contribution to an insurer's total bancassurance business.",
            "pubDate": "2024-11-28T10:27:21.100240"
        },
        {
            "title": "European shares rise on tech boost, inflation data in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-on-tech-boost-inflation-data-in-focus/articleshow/115764522.cms",
            "description": "Tech shares led the gains as Europe's main stock index opened higher on Thursday, rebounding from a two-day fall that was steered by economic and political instability in France and the prospects of U.S. tariffs.",
            "pubDate": "2024-11-28T10:27:21.100638"
        },
        {
            "title": "Is the bias changing? Still, stay with only a few: 6 large-cap stocks from different sectors with upside potential of up to 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-bias-changing-still-stay-with-only-a-few-6-large-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-38/articleshow/115763906.cms",
            "description": "There is always the risk of going wrong when declaring the market has bottomed out. The reality is, you tend to figure out that the bottom was formed much after it was actually formed. But, while it may be too early to call an end to the correction, there are signs that this phase is winding down. Just look at the reaction on the street to bad news or negative developments. While it reacts in the short term, the recovery is always swift. This is a clear sign that either the bottom has been formed, or we are not far from it. Also remember: What we are witnessing now could be the impact of the expiry of the derivative contract for November. So, leave aside what is happening to the market today – think ahead.",
            "pubDate": "2024-11-28T10:27:21.100730"
        },
        {
            "title": "Bitcoin price rebounds above $95k. Will the $100,000 milestone be reached soon?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bitcoin-price-rebounds-above-95k-will-the-100000-milestone-be-reached-soon/articleshow/115761423.cms",
            "description": "Bitcoin has rebounded above $95,000 after experiencing significant volatility in the past four trading sessions. Following an intraday low of $90,770 on Wednesday, the cryptocurrency rallied, fueled by positive U.S. regulatory developments and favorable market sentiment.",
            "pubDate": "2024-11-28T10:27:21.101009"
        },
        {
            "title": "BEML shares jump 4% on Rs 3,658 crore order win from Chennai Metro Rail",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/beml-shares-jump-4-on-rs-3658-crore-order-win-from-chennai-metro-rail/articleshow/115758913.cms",
            "description": "BEML share price: BEML shares rose 3.6% after securing a Rs 3,658 crore contract from Chennai Metro Rail. The company also won a Rs 246.78 crore order for dump trucks from Central Coalfields.",
            "pubDate": "2024-11-28T10:27:21.101099"
        },
        {
            "title": "Vodafone, IDFC First among 14 biggest midcap laggards in past 1 year. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idfc-first-among-14-biggest-midcap-laggards-in-past-1-year-should-you-buy-sell-or-hold/articleshow/115758450.cms",
            "description": "Midcap stocks, including Vodafone Idea and Bandhan Bank, have underperformed recently. Experts suggest holding most stocks, with some showing potential for recovery, while Vodafone Idea is advised to be avoided.",
            "pubDate": "2024-11-28T10:27:21.101195"
        },
        {
            "title": "Australia shares hit record high again on boost from banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australia-shares-hit-record-high-again-on-boost-from-banks/articleshow/115758265.cms",
            "description": "Australian shares soared to new heights, driven by a banking sector rally despite valuation concerns and high interest rates.  The S&P/ASX 200 reached a record 8,477.10, closing at 8,444.30, a 0.5% gain.  Strong consumer demand and mortgage appetite fueled the banking surge, while healthcare stocks also contributed to the benchmark's rise.  New Zealand's S&P/NZX 50 index, however, fell 1.2%.",
            "pubDate": "2024-11-28T10:27:21.101282"
        },
        {
            "title": "HDFC Bank’s m-cap surpasses Rs 14 lakh crore for the first time after stock hits record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-banks-m-cap-surpasses-rs-14-lakh-crore-for-the-first-time-after-stock-hits-record-high/articleshow/115758232.cms",
            "description": "HDFC Bank Share Price: HDFC Bank's market capitalization reached Rs 14 lakh crore for the first time on Thursday after its stock hit a fresh record high of Rs 1,836.05 on the BSE. The market cap peaked at Rs 14,00,710 crore before slipping amid profit-taking in the broader markets. At 11:17 am, shares were trading at Rs 1,808.40, down 0.14%.",
            "pubDate": "2024-11-28T10:27:21.101378"
        },
        {
            "title": "NTPC Green shares jump 4% on commencing 1st part of Shajapur Solar Project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-green-shares-jump-4-on-commencing-1st-part-of-shajapur-solar-project/articleshow/115757808.cms",
            "description": "NTPC Green Energy Share Price Today: Shares of the newly listed NTPC Green Energy surged 4% in today's session, reaching Rs 127.55 on the BSE, following the successful commissioning of the first part (55 MW) of the 105 MW Shajapur Solar Project. The stock has risen 18% from its IPO price of Rs 108 in just two days, despite weak market sentiment.",
            "pubDate": "2024-11-28T10:27:21.101468"
        },
        {
            "title": "Honasa Consumer shares hit 10% upper circuit amid high volume",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/honasa-consumer-shares-hit-10-upper-circuit-amid-high-volume/articleshow/115757573.cms",
            "description": "Honasa Consumer Share Price: Honasa Consumer (Mamaearth) shares hit a 10% upper circuit after a significant rally, despite recent losses and a sharp decline in stock price, triggered by a quarterly loss and weak demand.",
            "pubDate": "2024-11-28T10:27:21.101559"
        }
    ]
}