{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-15T15:31:05.639918",
    "items": [
        {
            "title": "Q3 results today: HDFC Life, Jio Financial among 27 companies to report earnings on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-hdfc-life-jio-financial-among-27-companies-to-report-earnings-on-thursday/articleshow/126537262.cms",
            "description": "Thursday brings Q3 earnings for 27 companies. Investors will focus on HDFC Life Insurance, Angel One, and Jio Financial Services. Key metrics to watch include demand conditions, margins, and future outlook. Brokerages anticipate steady growth for HDFC Life, while Angel One may see a mixed quarter due to regulatory shifts.",
            "pubDate": "2026-01-15T03:10:24.280108"
        },
        {
            "title": "Lower rates to weigh on large housing finance companies in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lower-rates-to-weigh-on-large-housing-finance-companies-in-q3/articleshow/126536502.cms",
            "description": "Housing finance companies face a challenging December quarter with slower growth and squeezed margins due to aggressive bank competition. While large firms grapple with lower rates, affordable housing lenders are expected to maintain profitability by keeping their lending rates steady. Analysts anticipate stable asset quality despite some localized stress.",
            "pubDate": "2026-01-15T03:10:24.280230"
        },
        {
            "title": "Anand Rathi Share Q3 net profit up over 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/anand-rathi-share-q3-net-profit-up-over-32/articleshow/126536429.cms",
            "description": "Anand Rathi Share and Stock Brokers reported strong financial results for the December quarter. The company's net profit surged by 32.6% compared to the previous quarter and an impressive 71.8% year-on-year. Operating revenue also saw a healthy increase of 9.2% sequentially and 21.5% from the same period last year. These figures highlight robust growth for the brokerage firm.",
            "pubDate": "2026-01-15T03:10:24.280359"
        },
        {
            "title": "Large deal wins power Infosys Q3 performance; labour code impact weighs on margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/large-deal-wins-power-infosys-q3-performance-labour-code-impact-weighs-on-margins/articleshow/126536320.cms",
            "description": "Infosys secured significant large deals in the December quarter, exceeding revenue expectations.  A one-time impact from labor code changes affected profits. The company also increased its FY26 revenue growth forecast.  This follows positive results from peers like TCS and HCL Tech.  Clients are adopting new AI technology platforms.  Infosys saw its headcount rise and attrition rates fall.",
            "pubDate": "2026-01-15T03:10:24.280461"
        },
        {
            "title": "Wipro Q3 Preview: Revenue may rise 4% YoY; margins under pressure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q3-preview-revenue-may-rise-4-yoy-margins-under-pressure/articleshow/126539218.cms",
            "description": "Wipro is expected to post muted Q3 performance, with revenue rising about 4% YoY and margins remaining under pressure due to furloughs, deal ramp-up costs and acquisition integration. Brokerages see flat profit growth and limited sequential momentum, while Q4 guidance and large deal conversions will be key investor focus areas.",
            "pubDate": "2026-01-15T06:55:46.841105"
        },
        {
            "title": "RIL Q3 Preview: Strong O2C, Jio to aid revenue growth; retail growth seen lagging",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q3-preview-strong-o2c-jio-to-aid-revenue-growth-retail-growth-seen-lagging/articleshow/126541446.cms",
            "description": "Reliance Industries is expected to report steady Q3 growth, driven by strong oil-to-chemicals margins and robust Jio performance, while retail and upstream oil & gas segments remain under pressure. Brokerages project mid-single digit revenue and profit growth, with digital and O2C earnings offsetting softer performance in other segments.",
            "pubDate": "2026-01-15T09:59:07.998387"
        },
        {
            "title": "Jio Financial Q3 Results: PAT drops 9% YoY to Rs 269 crore even as revenue doubles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-financial-q3fy26-results-pat-drops-9-yoy-to-rs-269-crore-even-as-revenue-doubles/articleshow/126544810.cms",
            "description": "Jio Financial Services posted mixed Q3FY26 results, with revenue surging 106% to Rs 901 crore but net profit falling 9% YoY to Rs 269 crore. Sequentially, profitability weakened sharply, even as AUM grew 4.5x YoY to Rs 19,049 crore and interest income and fee income recorded strong double- and triple-digit growth.",
            "pubDate": "2026-01-15T11:39:38.507069"
        },
        {
            "title": "L&T Tech Q3 Results: Profit falls 6% YoY to Rs 303 crore, revenue rises 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-tech-q3-results-profit-falls-6-yoy-to-rs-303-crore-revenue-rises-10/articleshow/126545447.cms",
            "description": "LTTS reported a 6% YoY profit decline in Q3 despite 10% revenue growth, strong deal wins above $200 million for fifth straight quarter, stable margins, and momentum in AI-led engineering, sustainability and recovering mobility businesses supported by large global contracts.",
            "pubDate": "2026-01-15T11:57:47.586400"
        },
        {
            "title": "HDFC Life Q3 Results: Standalone profit flat at Rs 421 crore; net premium income up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-life-q3-results-standalone-profit-flat-at-rs-421-crore-net-premium-income-up-9/articleshow/126545396.cms",
            "description": "HDFC Life Insurance on Thursday reported a muted bottomline growth in December quarter, with standalone profit after tax rising just 1% year-on-year to Rs 421 crore, compared with Rs 415 crore in the same period last year.",
            "pubDate": "2026-01-15T11:57:47.586530"
        },
        {
            "title": "Angel One announces 1:10 stock split, Rs 23 dividend even as Q3 profit falls 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/angel-one-q3-results-pat-falls-4-yoy-to-rs-269-crore-co-announces-110-stock-split-rs-23-dividend/articleshow/126547109.cms",
            "description": "Stock broker Angel One on Thursday reported a 4% year-on-year (YoY) decline in its consolidated net profit at Rs 269 crore in the third quarter. Along with the quarterly results, the company's board has also approved an interim dividend of Rs 23 per share and a stock split in the ratio of 1:10.",
            "pubDate": "2026-01-15T13:56:50.673479"
        },
        {
            "title": "Nuvoco Vistas turns profitable as Ebitda jumps 50% in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nuvoco-vistas-turns-profitable-as-ebitda-jumps-50-in-q3/articleshow/126548770.cms",
            "description": "Nuvoco Vistas Corp reported a consolidated net profit of Rs 49.37 crore in the December quarter, a significant turnaround from a year-earlier loss. This improvement was driven by a 50% surge in Ebitda to Rs 386 crore, alongside a 12% rise in revenue to Rs 2,701 crore.",
            "pubDate": "2026-01-15T15:31:04.445695"
        },
        {
            "title": "South Indian Bank Q3 Results: Profit rises 9% YoY to Rs 374 crore as asset quality improves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/south-indian-bank-q3-results-profit-rises-9-yoy-to-rs-374-crore-as-asset-quality-improves/articleshow/126548710.cms",
            "description": "South Indian Bank posted a 9.4% rise in Q3 profit, driven by higher operating income and non-interest revenue, while asset quality improved sharply, NPAs declined, and loan growth remained healthy led by gold and corporate advances.",
            "pubDate": "2026-01-15T15:31:04.445826"
        }
    ]
}