{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-06T15:54:23.543169",
    "items": [
        {
            "title": "Dow Jones crashes over 400 pts, Nasdaq, S&P down 1.3% as chip stocks lead selloff; tariffs in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-jones-crashes-500-pts-nasdaq-300-pts-as-tariff-uncertainty-prevails-chipmakers-slide/articleshow/118764814.cms",
            "description": "US stocks: Wall Street's main indexes fell, driven by a decline in chip stocks as Marvell's forecast raised concerns about slowing demand for AI infrastructure. Trade war worries further impacted sentiment, while notable tech stocks like Microsoft and Meta also saw declines. Increased volatility persists amid tariff uncertainty.",
            "pubDate": "2025-03-06T15:54:04.189856"
        },
        {
            "title": "Market Trading Guide: Eicher Motors, Hindalco Industries are stock recommendations for Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-eicher-motors-hindalco-industries-are-stock-recommendations-for-friday/slideshow/118764812.cms",
            "description": "Bulls ruled the D-Street for the second day in a row as India’s frontline indices closed with strong gains led by energy, pharma and FMCG sectors. While NIfty closed at 22,544.70, up by 207.40 points or 0.93%, the BSE Sensex ended its three-session declining trend to settle at 74,340.09, gaining by 609.86 points or 0.83%. Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that the Nifty continued to rise today, filling the recent gap on the daily chart. \"The RSI is recovering from a historical low and is currently in a bullish crossover. In the short term, the sentiment appears to favor the bulls. On the higher end, the index may move towards 23,750–23,800. The sentiment is likely to remain strong unless the Nifty falls below 22,300,\" De said.Here are 2 stock recommendations for Friday:",
            "pubDate": "2025-03-06T15:54:04.190004"
        },
        {
            "title": "ECB cuts interest rates and keeps door ajar to more easing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecb-cuts-interest-rates-and-keeps-door-ajar-to-more-easing/articleshow/118764488.cms",
            "description": "The European Central Bank cut interest rates as expected on Thursday and kept the door ajar to more, even as a looming trade war with the U.S. and plans to boost military spending drive Europe's biggest economic policy upheaval in decades.",
            "pubDate": "2025-03-06T15:54:04.190110"
        },
        {
            "title": "Two Sharp with ET: Will India ease auto tariffs for Tesla? Sensex jumps as dollar slides, crude dips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-will-india-ease-auto-tariffs-for-tesla-sensex-jumps-as-dollar-slides-crude-dips/videoshow/118764438.cms",
            "description": "In this episode of Two Sharp with ET, we delve into escalating trade tensions between the US and India. The US is pressuring India to reduce high auto import tariffs, aiming to facilitate Tesla's entry into the Indian market. Despite these pressures, India remains hesitant to slash duties to zero immediately, consulting with local automotive manufacturers who fear adverse impacts on domestic production. On the market front, Sensex and Nifty exhibit volatility, influenced by a significant drop in oil prices, which have hit a three-year low due to concerns over a potential trade war impacting demand.​ Nisha Poddar explains.",
            "pubDate": "2025-03-06T15:54:04.190212"
        },
        {
            "title": "CitiCorp Investment Bank pays Rs 36 lakh to settle FPI rules violation case with Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citicorp-investment-bank-pays-rs-36-lakh-to-settle-fpi-rules-violation-case-with-sebi/articleshow/118763479.cms",
            "description": "CitiCorp Investment Bank (Singapore) Ltd on Thursday settled with Sebi a case relating to issuance of offshore derivative instruments to Symmetry Master Fund Ltd without completing the KYC norms, on payment of Rs 36 lakh.",
            "pubDate": "2025-03-06T15:54:04.190355"
        },
        {
            "title": "These 7 smallcap stocks hit 52-week lows, fell up to 72% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-smallcap-stocks-hit-52-week-lows-fell-up-to-72-in-a-month/slideshow/118763317.cms",
            "description": "",
            "pubDate": "2025-03-06T15:54:04.190455"
        },
        {
            "title": "Top 5 stocks with rising promoter holdings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-5-stocks-with-rising-promoter-holdings/slideshow/118762569.cms",
            "description": "",
            "pubDate": "2025-03-06T15:54:04.190561"
        },
        {
            "title": "Breakout Stocks: How to trade Avanti Feeds & Chambal Fertilizers on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-avanti-feeds-amp-chambal-fertilizers-on-friday/slideshow/118761814.cms",
            "description": "Indian market closed in the green for the second consecutive day in a row on Thursday. The BSE Sensex rose more than 600 points while the Nifty50 closed above 22500.",
            "pubDate": "2025-03-06T15:54:04.190659"
        },
        {
            "title": "Five individuals settle regulatory violation case with Sebi; pay Rs 95.55 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/five-individuals-settle-regulatory-violation-case-with-sebi-pay-rs-95-55-lakh/articleshow/118761084.cms",
            "description": "As many as five current and former officials of Add-Shop E-Retail Ltd (ASERL) and White Organic Agro Ltd (WOAL) on Thursday settled a case with Sebi pertaining violation of regulatory norms and made a payment of Rs 95.55 lakh towards the settlement amount.",
            "pubDate": "2025-03-06T15:54:04.190754"
        },
        {
            "title": "Sensex dips 4% during Kumbh Mela. History indicates 8% rally in next 6 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-dips-4-during-kumbh-mela-history-indicates-8-rally-in-next-6-months/articleshow/118761023.cms",
            "description": "Historically, the Sensex has delivered positive six-month returns after Maha Kumbh, averaging 8% in five out of six instances since 2004. Analysts suggest a potential rebound following this year’s 4% dip, drawing insights from past Kumbh market trends.",
            "pubDate": "2025-03-06T15:54:04.190849"
        },
        {
            "title": "Market Wrap: Banks, energy stocks lift D-Street higher; Sensex adds 609 pts, Nifty tops 22,500",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-banks-energy-stocks-lift-d-street-higher-sensex-adds-609-pts-nifty-tops-22500/articleshow/118758968.cms",
            "description": "Stock Market Highlights: Indian benchmark indices closed in the green on Thursday for the second straight day, driven by domestic investors buying into oversold stocks, with financials advancing after the Reserve Bank of India announced a $21 billion liquidity infusion into the banking system, and energy stocks rallying on lower crude prices.",
            "pubDate": "2025-03-06T15:54:04.190982"
        },
        {
            "title": "Trent, Coforge among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-coforge-among-5-stocks-with-short-buildup/slideshow/118758229.cms",
            "description": "A short buildup occurs when open interest and trading volumes rise, accompanied by a decrease in the stock price in the Futures and Options segment. This suggests that traders are anticipating further price declines and are establishing short positions. In Thursday's trading session, five stocks saw notable short positions. Here's the list:",
            "pubDate": "2025-03-06T15:54:04.191089"
        },
        {
            "title": "Short covering in 33 stocks like Infosys, Trent, UltraTech, may lift markets: Elara Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/short-covering-in-33-stocks-like-infosys-trent-ultratech-may-lift-markets-elara-securities/articleshow/118757839.cms",
            "description": "A surge in short covering across 33 heavily shorted stocks, including TCS, Infosys, and UltraTech Cement, could fuel a rebound. Elara Securities suggests technical indicators and margin funding reductions signal a potential market bottom after months of selling pressure.",
            "pubDate": "2025-03-06T15:54:04.191186"
        },
        {
            "title": "It is not always about buying or selling; sometimes, just ‘hold’ quality stocks: 7 large-caps with upside potential of up to 53%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-is-not-always-about-buying-or-selling-sometimes-just-hold-quality-stocks-7-large-caps-with-upside-potential-of-up-to-53/articleshow/118757782.cms",
            "description": "While markets are largely about buying and selling, there are times when it is more important to just hold on to stocks. Given the current sentiment, the chances are that you may end up selling a winner too early. So, stay with companies with some positive underlying developments. For example, hold, or even buy, this company where restructuring is taking place. With the plan being to split the company into two: One, a front-end consumer-facing firm, and the other a large export-focused textile business. Similarly, there are others where there is one or the other reason to continue holding the stock. And, if you have the ability to invest, even look at buying more.",
            "pubDate": "2025-03-06T15:54:04.191288"
        },
        {
            "title": "Hong Kong, China stocks end higher on tech-fuelled rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hong-kong-china-stocks-end-higher-on-tech-fuelled-rally/articleshow/118756803.cms",
            "description": "Hong Kong shares rallied to a fresh three-year high on Thursday, led by tech stocks, as investors continued to pile into artificial intelligence shares and welcomed new policy support.",
            "pubDate": "2025-03-06T15:54:04.191380"
        },
        {
            "title": "Bullish Momentum: 8 stocks formed White Marubozu Pattern on March 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-8-stocks-formed-white-marubozu-pattern-on-march-5/slideshow/118756870.cms",
            "description": "On March 5, eight stocks in the Nifty50 pack appeared on the bullish \"White Marubozu\" scanner, according to StockEdge.com’s technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it signals strong buying pressure throughout the session. Traders interpret this as a sign that buyers controlled the market from opening to closing, often using it to make informed decisions about future price movements.",
            "pubDate": "2025-03-06T15:54:04.191474"
        }
    ]
}