{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-20T08:48:47.586458",
    "items": [
        {
            "title": "IDFC First Bank shares rally 3% as Q2 profit surges 75%. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idfc-first-bank-shares-rally-3-as-q2-profit-surges-75-should-you-buy-sell-or-hold/articleshow/124700119.cms",
            "description": "IDFC First Bank shares surged following a robust 75.5% year-on-year profit increase for the second quarter of FY26. This growth was fueled by strong business expansion and better operating leverage. Loans and customer deposits saw significant year-on-year increases. Asset quality remained stable. The bank's management expressed confidence in sustaining this positive trend.",
            "pubDate": "2025-10-20T05:33:42.547145"
        },
        {
            "title": "Wipro, Muthoot Finance among 7 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-muthoot-finance-among-7-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/124700013.cms",
            "description": "As of October 17, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-10-20T05:33:42.547279"
        },
        {
            "title": "Robust retail, O2C performance support Reliance’s quarterly growth: Sudip Bandyopadhyay",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/robust-retail-o2c-performance-support-reliances-quarterly-growth-sudip-bandyopadhyay/articleshow/124699667.cms",
            "description": "Reliance Industries showcased a robust quarterly performance, with its telecom segment leading the charge driven by strong ARPU and customer additions. The company's retail and O2C segments also performed well, supported by festive demand and GST relief. Investors are anticipating future value unlocking from the upcoming Jio listing and the diversified portfolio.",
            "pubDate": "2025-10-20T05:33:42.547408"
        },
        {
            "title": "China holds benchmark lending rates steady amid slowing growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-holds-benchmark-lending-rates-steady-amid-slowing-growth/slideshow/124699862.cms",
            "description": "China has left its benchmark lending rates unchanged in October for the fifth consecutive month. The decision reflects caution amid slowing economic momentum and ongoing trade tensions with the U.S. (Source: Reuters)",
            "pubDate": "2025-10-20T05:33:42.547537"
        },
        {
            "title": "Muhurat trading, Q2 earnings, global cues: 8 key triggers for markets this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muhurat-trading-q2-earnings-global-cues-8-key-triggers-for-markets-this-week/articleshow/124699545.cms",
            "description": "Indian stock markets began the week with significant gains. Strong earnings from HDFC Bank and ICICI Bank boosted investor confidence. Global sentiment improved due to easing U.S.-China trade tensions. The upcoming week includes Muhurat trading and more Q2 earnings reports. Investors will also watch global developments and currency movements.",
            "pubDate": "2025-10-20T05:33:42.547652"
        },
        {
            "title": "China’s GDP growth slows to 4.8% in Q3 amid property slump, trade tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-gdp-growth-slows-to-4-8-in-q3-amid-property-slump-trade-tensions/slideshow/124699598.cms",
            "description": "China’s GDP growth slowed to its weakest pace in a year during the third quarter, affected by a prolonged property slump and ongoing trade tensions with the U.S. Policymakers are under pressure to introduce more stimulus to maintain momentum. (Source: Reuters)",
            "pubDate": "2025-10-20T05:33:42.547764"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley remains overweight on HDFC Bank; Emkay Global recommends Buy on RIL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-remains-overweight-on-hdfc-bank-emkay-global-recommends-buy-on-ril/articleshow/124699342.cms",
            "description": "Top brokerages like Morgan Stanley and Emkay Global are optimistic about leading Indian banks and conglomerates. Morgan Stanley reiterates Overweight on HDFC Bank and ICICI Bank, citing strong fundamentals and growth. Emkay Global maintains a Buy on Reliance Industries, highlighting robust performance across its segments.",
            "pubDate": "2025-10-20T05:33:42.547870"
        },
        {
            "title": "Technical picks: Axis Securities favours 3 stocks for up to 18% returns as Nifty eyes record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-axis-securities-favours-3-stocks-for-up-to-18-returns-as-nifty-eyes-record-high/slideshow/124699375.cms",
            "description": "Indian markets ended the week higher with the Nifty closing at 25,710, up 425 points, forming a strong bullish candle on weekly charts. Axis Securities expects the uptrend to continue as both Nifty and Bank Nifty trade near key breakout zones.\"The index has also broken above the medium-term downward sloping trendline, paving the way for a potential move towards the all-time high of 26,277,\" the brokerage said.",
            "pubDate": "2025-10-20T05:33:42.547981"
        },
        {
            "title": "Nifty rallying, but portfolios down? Diwali run masks retail pain as smallcaps extend year-long slide",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-rallying-but-portfolios-down-diwali-run-masks-retail-pain-as-smallcaps-extend-year-long-slide/articleshow/124699303.cms",
            "description": "The Nifty 50 is reaching new heights driven by large companies. However, many smallcap stocks are not participating in this rally. Investors are cautious due to high valuations and tight liquidity in the smallcap segment. Experts suggest patience and selectivity for potential future gains as the market may rotate towards smaller companies.",
            "pubDate": "2025-10-20T05:33:42.548082"
        },
        {
            "title": "PTC Industries shares in focus on Bharat Dynamics JV to develop missiles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ptc-industries-shares-in-focus-on-bharat-dynamics-jv-to-develop-missiles/articleshow/124699176.cms",
            "description": "PTC Industries and Bharat Dynamics have signed an MoU to form a joint venture for manufacturing propulsion systems, guided bombs, and aero-engines for missiles and UAVs. This collaboration aims to boost the 'Make in India' initiative by reducing foreign dependence and strengthening domestic capabilities in strategic engine technologies.",
            "pubDate": "2025-10-20T05:33:42.548192"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/124699100.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-10-20T05:33:42.548292"
        },
        {
            "title": "RBL Bank shares surge 5% to 52-week high on Q2 beat, Emirates NBD’s Rs 26,853 crore stake buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-on-q2-results-emirates-nbds-60-stake/articleshow/124699138.cms",
            "description": "RBL Bank shares surged to a 52-week high following its September quarter earnings and a landmark investment agreement with Emirates NBD. The Dubai-based bank will acquire a 60% stake for Rs 26,853 crore, marking the largest FDI in India's financial services sector. This strategic partnership is set to significantly bolster RBL Bank's capital and expand its growth prospects.",
            "pubDate": "2025-10-20T05:33:42.548395"
        },
        {
            "title": "Yes Bank shares in focus after reporting 18% YoY jump in Q2 net profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-after-reporting-18-yoy-jump-in-q2-net-profit/articleshow/124699106.cms",
            "description": "Yes Bank shares: The private lender reported an 18.3% YoY rise in Q2FY26 profit to ₹654.47 crore, with NII up 4.5% to ₹2,300.88 crore. Advances crossed ₹2.5 lakh crore, growing 6.4% YoY on robust disbursements across segments.",
            "pubDate": "2025-10-20T05:33:42.548509"
        },
        {
            "title": "IndusInd Bank shares slip 3% after posting Rs 437 crore net loss in Q2FY26. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-after-posting-rs-437-crore-q2-loss-what-should-investors-do/articleshow/124699081.cms",
            "description": "IndusInd Bank reported a Q2 FY26 net loss of Rs 437 crore, reversing a Rs 1,331 crore profit a year ago, as NII and fee income fell and asset quality pressures persisted. CASA deposits formed 31% of total deposits. Brokerages remain cautious, with Morgan Stanley at Equal-weight and Elara Capital at Sell, citing muted growth and strategic challenges under new management.",
            "pubDate": "2025-10-20T05:33:42.548621"
        },
        {
            "title": "Sensex surges over 650 pts, Nifty tops 25,900 on solid bank earnings & global trade optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-surges-over-650-pts-nifty-tops-25900-on-solid-bank-earnings-global-trade-optimism/articleshow/124699050.cms",
            "description": "Indian stock markets opened with significant gains on Monday. The Sensex and Nifty surged higher. Strong quarterly results from HDFC Bank and ICICI Bank boosted investor confidence. Global markets also showed improvement. This was driven by positive signs regarding U.S.-China trade relations. Investors are reacting positively to these developments.",
            "pubDate": "2025-10-20T05:33:42.548724"
        },
        {
            "title": "RIL shares surge 3% as Q2 profit rises 10% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-as-net-profit-rises-10-yoy-in-q2/articleshow/124699057.cms",
            "description": "RIL Share Price: Reliance Industries shares saw a significant jump on Monday. The company announced a 10% year-on-year growth in its profit after tax for the second quarter of fiscal year 2026. This strong performance was driven by its Oil-to-Chemicals, Jio, and retail businesses. Revenue also increased by 10% year-on-year. Capital expenditure focused on expansion across key segments.",
            "pubDate": "2025-10-20T05:33:42.548827"
        },
        {
            "title": "BOJ’s Ueda leaves Washington without clear signal on rate hike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bojs-ueda-leaves-washington-without-clear-signal-on-rate-hike/slideshow/124701009.cms",
            "description": "Bank of Japan (BOJ) Governor Kazuo Ueda recently attended the G20 finance leaders’ meeting in Washington. He left with limited conviction that global headwinds will allow an immediate interest rate hike. Discussions highlighted downside risks amid renewed U.S.-China trade tensions. (Source: Reuters)",
            "pubDate": "2025-10-20T07:36:58.323875"
        },
        {
            "title": "Shopping or investing? The Diwali habit that can make you richer every year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shopping-or-investing-the-diwali-habit-that-can-make-you-richer-every-year/articleshow/124700566.cms",
            "description": "This Diwali, balance festive spending with disciplined investing to build long-term wealth. While shopping brings temporary joy, directing a portion of your budget into mutual funds or other investments can create lasting financial security, turning seasonal celebrations into a foundation for future prosperity.",
            "pubDate": "2025-10-20T07:36:58.324001"
        },
        {
            "title": "JSW Energy shares decline 5% as Q2 PAT falls 17% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-energy-shares-decline-5-as-q2-pat-falls-17-yoy-should-you-buy-sell-or-hold/articleshow/124700525.cms",
            "description": "JSW Energy shares fell over 5% to Rs 514.15 on the BSE after reporting a 17% YoY decline in consolidated PAT to Rs 705 crore for Q2 FY26, compared with Rs 853 crore a year ago. Revenue, however, rose 60% YoY to Rs 5,177 crore, supported by renewable capacity additions and contributions from the Mahanadi and O2 Power projects.",
            "pubDate": "2025-10-20T07:36:58.324109"
        },
        {
            "title": "Polycab India shares rise over 3% as Q2 profit jumps 56% YoY. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/polycab-india-shares-rise-over-3-as-q2-profit-jumps-56-yoy-should-you-buy-sell-or-hold/articleshow/124700434.cms",
            "description": "Polycab India shares surged after reporting strong Q2 FY26 results, with consolidated net profit up 56% and revenue rising nearly 18% YoY. Analysts remain positive, citing robust growth in wires and cables and FMEG segments, strong exports, and margin expansion. The stock has gained over 40% in six months.",
            "pubDate": "2025-10-20T07:36:58.324211"
        },
        {
            "title": "Why stocks trump gold for long-term wealth creation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stocks-trump-gold-for-long-term-wealth-creation/articleshow/124700390.cms",
            "description": "As festive gold buying peaks this Diwali, an OmniScience Capital study shows that equities have consistently outperformed gold in long-term wealth creation. The analysis finds that the Sensex delivered 11.5% annual returns versus gold’s 9.5%, while equities also offered superior capital protection and inflation-adjusted growth across market cycles.",
            "pubDate": "2025-10-20T07:36:58.324309"
        },
        {
            "title": "Dixon Technologies shares fall 3% after Q2 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-shares-fall-3-after-q2-results-should-you-buy-sell-or-hold/articleshow/124700306.cms",
            "description": "Dixon Technologies shares fell on Monday despite posting a strong Q2 results, with net profit up 81% YoY to Rs 746 crore. Analysts at Motilal Oswal and JM Financial remain positive on long-term growth, citing strong mobile and EMS performance, but caution near-term margin pressure due to component ramp-up and cost integration.",
            "pubDate": "2025-10-20T07:36:58.324555"
        },
        {
            "title": "PNB shares rise 2% after Q2FY26 profit climbs 14% YoY. Brokerage raises target price to Rs 122",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pnb-shares-rise-2-after-q2fy26-profit-climbs-14-yoy-brokerage-raises-target-price-to-rs-122/articleshow/124700261.cms",
            "description": "Shares of Punjab National Bank gained 1.7% after the lender posted a 14% year-on-year rise in profit after tax for Q2FY26, supported by improved asset quality and steady business growth. Despite a slight dip in net interest income, operating profit and key financial ratios strengthened, with GNPA and NNPA levels improving and the Provision Coverage Ratio rising.",
            "pubDate": "2025-10-20T07:36:58.324657"
        },
        {
            "title": "Diwali Muhurat trading tomorrow. Analyst spots bullish setup in this auto stock for your Diwali strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-muhurat-trading-tomorrow-analyst-spots-bullish-setup-in-this-auto-stock-for-your-diwali-strategy/articleshow/124700246.cms",
            "description": "Ahead of Diwali Muhurat trading, analysts spot a bullish setup in Ashok Leyland as the Auto sector forms a strong base on charts. Derivative Analyst Hardik Matalia highlights improving demand, positive technical indicators, and a favourable risk-reward setup, making the stock a festive favourite.",
            "pubDate": "2025-10-20T07:36:58.324755"
        },
        {
            "title": "Federal Bank, DCB and South Indian Bank shares rise up to 16% on strong Q2 results. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-dcb-and-south-indian-bank-shares-rise-up-to-16-on-strong-q2-results-check-details/articleshow/124700235.cms",
            "description": "Shares of Federal Bank, DCB Bank, and South Indian Bank surged up to 16.5% on Monday after the lenders announced their Q2 FY26 results. Federal Bank’s profit dipped 9.6% YoY but hit record NII and fee income, while DCB Bank posted an 18.3% rise in profit backed by better margins and asset quality. South Indian Bank’s profit grew 8.2% despite a fall in NII, supported by higher other income and improved NPAs.",
            "pubDate": "2025-10-20T07:36:58.324858"
        },
        {
            "title": "Diwali Samvat 2082: Top 11 stocks from 11 leading brokerages offering up to 106% upside. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-samvat-2082-top-11-stocks-from-11-leading-brokerages-offering-up-to-106-upside-do-you-own/slideshow/124700219.cms",
            "description": "As investors step into Samvat 2082, here are the top 11 stocks across sectors, handpicked by 11 leading brokerages. These stocks, featuring high-conviction picks with strong growth potential, solid fundamentals, and favourable sector dynamics, offer promising investment opportunities.",
            "pubDate": "2025-10-20T07:36:58.325051"
        },
        {
            "title": "CEAT shares rally 10%, hit 52-week high as Q2 net profit surges 54% on strong GST-led domestic demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ceat-shares-rally-10-hit-52-week-high-as-q2-net-profit-surges-54-on-strong-gst-led-domestic-demand/articleshow/124702385.cms",
            "description": "CEAT Ltd shares surged to a 52-week high after reporting strong Q2 results, with net profit up 54% and revenue rising 12% YoY. EBITDA margins improved, aided by GST reductions and robust domestic demand. Growth was driven by replacement and OEM segments, with strong performance across PV, two-wheeler, and farm tyres.",
            "pubDate": "2025-10-20T08:48:39.447858"
        },
        {
            "title": "European shares climb nearly 1% on banks, defence rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-climb-nearly-1-on-banks-defence-rally/articleshow/124702258.cms",
            "description": "European shares rose nearly 1% on Monday, underpinned by strong performances among banks and defence stocks, as investors digested a couple of corporate earnings and assessed sector-specific momentum and macro signals.",
            "pubDate": "2025-10-20T08:48:39.448002"
        },
        {
            "title": "Diwali technical stock picks: Brokerages see 9 counters with up to 28% upside this Samvat 2082",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-technical-stock-picks-brokerages-see-9-counters-with-up-to-28-upside-this-samvat-2082/slideshow/124702362.cms",
            "description": "As Indian markets head into Diwali 2025, domestic sentiment has strengthened on easing global headwinds and resilient macro fundamentals. Angel One and Nuvama see indices poised for a breakout backed by broad-based strength across banking, infrastructure, and metal sectors. Their nine festive-season picks reflect this optimism, each positioned for fresh momentum into Samvat 2082.",
            "pubDate": "2025-10-20T08:48:39.448114"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 29% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-29-in-1-year/articleshow/124702033.cms",
            "description": "There are two things clearly worth noticing this Diwali day. First, there are sectors that have been able to get back their momentum. Second, the market is in stock-specific mode. A company delivers growth, the market rewards it; if it does not, then there are enough people waiting to sell. There is a high probability that, as the market adjusts to valuations, we might see it staying in this mode for some time. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-10-20T08:48:39.448223"
        },
        {
            "title": "Japan's Nikkei closes at record high, benchmark JGBs slip ahead of Takaichi PM vote",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-closes-at-record-high-benchmark-jgbs-slip-ahead-of-takaichi-pm-vote/articleshow/124701991.cms",
            "description": "Japan's Nikkei share gauge surged to a record high on Monday as fiscal expansionist Sanae Takaichi was set to become the country's next prime minister with a new political coalition in place.",
            "pubDate": "2025-10-20T08:48:39.448326"
        },
        {
            "title": "Gurmeet Chadha slams NSE, BSE for remaining open on Diwali, questions \"greed\"",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gurmeet-chadha-slams-nse-bse-for-remaining-open-on-diwali-questions-greed/articleshow/124701932.cms",
            "description": "Gurmeet Chadha criticises NSE and BSE for keeping broader market operations open on Diwali, calling it “greed” as many intermediaries had to work. While Diwali is being celebrated across India on Monday, October 20, stock markets will remain closed on October 21 and 22 on account of Laxmi Pujan and Diwali Balipratipada.",
            "pubDate": "2025-10-20T08:48:39.448430"
        },
        {
            "title": "Muhurat Trading 2025: Check timings, settlement rules, market schedule for NSE, BSE, MCX",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muhurat-trading-2025-check-timings-settlement-rules-market-schedule-for-nse-bse-mcx/articleshow/124701747.cms",
            "description": "Muhurat Trading 2025 will be held on October 21, marking the start of Samvat 2082. NSE, BSE, MCX, and NCDEX will observe special one-hour trading sessions with normal settlement rules. The tradition symbolizes wealth, prosperity, and the auspicious beginning of the new financial year.",
            "pubDate": "2025-10-20T08:48:39.448530"
        },
        {
            "title": "FIIs, MFs cut stake in 7 smallcap stocks in Q2FY26; crash up to 60% – are you holding any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-mfs-cut-stake-in-7-smallcap-stocks-in-q2fy26-crash-up-to-60-are-you-holding-any/slideshow/124701746.cms",
            "description": "Tracking where major institutional investors, such as Foreign Institutional Investors (FIIs) and Mutual Funds (MFs), are placing their bets is essential. Equally important is keeping an eye on where they’re pulling back. According to the latest shareholding data for the September quarter, there are so far around 413 small-cap stocks that have holdings from both FIIs and MFs. Interestingly, in 71 of these stocks, both types of institutional investors have reduced their stake compared to the June quarter.When it comes to market performance, the picture isn’t too rosy — nearly half of these 71 stocks have delivered negative returns so far in FY26. We have highlighted the top seven underperformers, which have plunged between 15% and 60% in just under seven months of the current fiscal year. (Data Source: ACE Equity).",
            "pubDate": "2025-10-20T08:48:39.448627"
        }
    ]
}