{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-26T21:30:32.636931",
    "items": [
        {
            "title": "Jain Irrigation net profit declines 8.5% to Rs 11.19 crore in Jun quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jain-irrigation-net-profit-declines-8-5-pc-to-rs-11-19-cr-in-jun-qtr/articleshow/122921219.cms",
            "description": "Jain Irrigation Systems reported a consolidated net profit of Rs 11.19 crore for the quarter ended June 2025, an 8.5% decrease from the previous year. Despite early monsoon impacting pipe demand, the company saw revenue growth in Micro Irrigation Systems, Tissue Culture, Exports, and Solar Agri Pumps.",
            "pubDate": "2025-07-26T21:30:14.895741"
        },
        {
            "title": "IDFC First Bank Q1 results: PAT declines 32% YoY, NII rises by 5.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idfc-first-bank-q1-results-pat-declines-32-yoy-nii-rises-by-5-5/articleshow/122921136.cms",
            "description": "IDFC First Bank's first quarter of fiscal year 2026 reveals a mixed financial performance. While the profit after tax declined by 32% year-over-year to ₹463 crore, the net interest income experienced a growth of 5.1%, reaching ₹4,933 crore. However, on a quarter-on-quarter basis, the PAT grew significantly by 52.1%.",
            "pubDate": "2025-07-26T21:30:14.895872"
        },
        {
            "title": "CDSL Q1 results: PAT declines 24% YoY, revenue marginally up by 0.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cdsl-q1-results-pat-declines-24-yoy-revenue-marginally-up-by-0-5/articleshow/122920653.cms",
            "description": "CDSL's Q1 FY26 results reveal a 23.7% YoY decline in consolidated net profit, reaching Rs 102.40 crore, while revenue from operations saw a marginal increase of 0.55% to Rs 258.81 crore. Depository activity revenue increased, but data entry and storage revenue decreased. Total expenses surged by 27.35% YoY to Rs 143.60 crore.",
            "pubDate": "2025-07-26T21:30:14.895981"
        },
        {
            "title": "Kotak Bank Q1 results: PAT falls 7% YoY to Rs 3,282 crore. NII up 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/kotak-bank-q1-results-pat-falls-7-yoy-to-rs-3282-crore-nii-up-6/articleshow/122919655.cms",
            "description": "Kotak Mahindra Bank reported a 7% YoY decrease in standalone net profit for Q1FY26, reaching Rs 3,282 crore, down from Rs 3,520 crore in the previous year. The bank's net interest income (NII) saw a 6% increase, climbing to Rs 7,259 crore.",
            "pubDate": "2025-07-26T21:30:14.896091"
        },
        {
            "title": "Sobha Ltd Q1 results: PAT zooms 123% YoY, revenue up by 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sobha-ltd-q1-results-pat-zooms-123-yoy-revenue-up-by-35/articleshow/122919153.cms",
            "description": "Sobha Limited has announced impressive first-quarter results. The company's profit after tax surged by 123%. Revenue also increased by 35%. Sobha achieved its highest-ever quarterly sales value, crossing Rs 2,000 crore. New area sold increased by 23%. The company's managing director, Jagadish Nangineni, expressed optimism about sustained growth due to a strong balance sheet and stable demand.",
            "pubDate": "2025-07-26T21:30:14.896197"
        },
        {
            "title": "Authum Investment bulk deal: Goldman Sachs buys stake worth Rs 200 crore in multibagger midcap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/authum-investment-bulk-deal-goldman-sachs-buys-stake-worth-rs-200-crore-in-multibagger-midcap/articleshow/122909324.cms",
            "description": "Goldman Sachs bought nearly 9 lakh Authum Investment shares for Rs 200 crore at a 20% discount. Despite recent volatility, the stock remains a strong multibagger performer.",
            "pubDate": "2025-07-26T21:30:14.896314"
        },
        {
            "title": "Orient Cement Q1 Results: Profit rises multi-fold to Rs 205 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/orient-cement-q1-results-profit-rises-multi-fold-to-rs-205-crore/articleshow/122909246.cms",
            "description": "Orient Cement Ltd, now part of billionaire Gautam Adani-led Adani Group, on Friday reported a multi-fold jump in its net profit to Rs 205.37 crore for the first quarter ended June 2025.",
            "pubDate": "2025-07-26T21:30:14.896415"
        },
        {
            "title": "SAIL Q1 Results: Net profit zooms to Rs 745 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sail-q1-results-net-profit-zooms-to-rs-745-crore/articleshow/122909202.cms",
            "description": "country's largest steel maker, on Friday reported a multi-fold rise in consolidated net profit at Rs 744.58 crore in the quarter ended June 2025 on the back of improved operational efficiency, better cash flow and strong growth in sales volume.",
            "pubDate": "2025-07-26T21:30:14.896512"
        },
        {
            "title": "Tata Chemicals Q1 Results: PAT jumps 80% to Rs 316 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-chemicals-q1-results-pat-jumps-80-to-rs-316-crore/articleshow/122908630.cms",
            "description": "Tata Chemicals on Friday reported an 80.57 per cent increase in consolidated profit after tax (PAT) to Rs 316 crore for the quarter ended June 30.",
            "pubDate": "2025-07-26T21:30:14.896607"
        },
        {
            "title": "Petronet Q1 Results: Net profit falls 25%, to invest Rs 6,355 crore in new LNG terminal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/petronet-q1-results-net-profit-falls-25-to-invest-rs-6355-crore-in-new-lng-terminal/articleshow/122908574.cms",
            "description": "Petronet LNG Ltd, India's largest gas importer, on Friday reported a 25 per cent drop in its June quarter net profit, and said it will invest Rs 6,355 crore in setting up a new import facility at Odisha.",
            "pubDate": "2025-07-26T21:30:14.896705"
        },
        {
            "title": "Tamilnad Mercantile Bank Q1 Results: Net profit up 6% to Rs 305 crore on lower provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tamilnad-mercantile-bank-q1-results-net-profit-up-6-to-rs-305-crore-on-lower-provisions/articleshow/122908050.cms",
            "description": "Tamilnad Mercantile Bank reported a 6% YoY rise in Q1 net profit to ₹305 crore, aided by sharply lower provisions, despite a 12% fall in operating profit. NII and other income remained nearly flat, while asset quality improved.",
            "pubDate": "2025-07-26T21:30:14.896801"
        },
        {
            "title": "Hexaware Technologies Q2 Results: Profit jumps 38% YoY to Rs 380 crore but misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hexaware-technologies-q2-results-profit-jumps-38-yoy-to-rs-380-crore-but-misses-estimates/articleshow/122908008.cms",
            "description": "Hexaware Technologies posted a 38% YoY profit rise to ₹380 crore in Q2, but missed expectations due to higher costs and muted revenue. Revenue guidance was also lowered, prompting a 10.7% stock decline despite steady overall growth.",
            "pubDate": "2025-07-26T21:30:14.896903"
        },
        {
            "title": "Sobha Ltd Q1 profit jumps over 2-fold to Rs 13.61 cr, revenue rises to Rs 901 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sobha-ltd-q1-profit-jumps-over-2-fold-to-rs-13-61-cr-revenue-rises-to-rs-901-cr/articleshow/122907927.cms",
            "description": "Realty firm Sobha Ltd on Friday reported a more than two times increase in its consolidated net profit to Rs 13.61 crore for the quarter ended June.",
            "pubDate": "2025-07-26T21:30:14.896998"
        },
        {
            "title": "Aadhar Housing Q1 net profit rises 18% to Rs 237 crore despite higher provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/aadhar-housing-q1-net-profit-rises-18-to-rs-237-crore-despite-higher-provisions/articleshow/122906671.cms",
            "description": "Aadhar Housing Finance posted an 18.5% YoY rise in Q1 net profit to ₹237 crore on a 19.4% income increase, despite higher provisions and a slight NIM dip. Disbursements surged 32%, and AUM grew 22% YoY.",
            "pubDate": "2025-07-26T21:30:14.897096"
        },
        {
            "title": "Bank of Baroda Q1 Results: PAT grows 2% YoY to Rs 4,541 crore, NII decline 1.4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-baroda-q1-results-pat-grows-2-yoy-to-rs-4541-crore-nii-decline-1-4/articleshow/122905928.cms",
            "description": "Bank of Baroda posted a modest 2% YoY rise in Q1 FY26 profit to ₹4,541 crore. Net interest income dipped 1.4%, impacted by tax refund reclassification. Deposits and advances, both domestic and international, grew strongly year-on-year.",
            "pubDate": "2025-07-26T21:30:14.897189"
        },
        {
            "title": "Paras Defence Q1 results: Net profit rises marginally to Rs 14 crore, revenue up 11% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/paras-defence-q1-results-net-profit-rises-marginally-to-rs-14-crore-revenue-up-11-yoy/articleshow/122902353.cms",
            "description": "Paras Defence and Space Technologies posted a marginal 1.1% YoY rise in Q1FY26 PAT to ₹14.27 crore, while revenue grew 11.5% to ₹93.19 crore. Sequentially, profit declined 31.5%. Stock fell 3.8% post results.",
            "pubDate": "2025-07-26T21:30:14.897303"
        }
    ]
}