{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-19T05:54:22.773558",
    "items": [
        {
            "title": "Zen Technologies Q4 results: PAT jumps 189% YoY to Rs 101 crore, dividend declared at Rs 2 per share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/zen-technologies-q4-results-pat-jumps-189-yoy-to-rs-101-crore-dividend-declared-at-rs-2-per-share/articleshow/121246152.cms",
            "description": "Zen Technologies reported a 189% YoY profit surge to Rs 101.04 crore in Q4 FY25, with revenue rising 130%. Strong EBITDA margins, strategic investments in Vector Technics and the US market, and a proposed Rs 2/share dividend boosted sentiment. Shares hit a 5% upper circuit.",
            "pubDate": "2025-05-19T05:54:01.019419"
        },
        {
            "title": "Arvind Fashions reports Rs 17 crore Q4 Loss despite 13.7% YoY revenue growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/arvind-fashions-reports-rs-17-crore-q4-loss-despite-13-7-yoy-revenue-growth/articleshow/121234475.cms",
            "description": "Arvind Fashion Ltd faced a significant standalone net loss of Rs17 crore in Q4, a 192% yoy decline, despite a 13.7% revenue increase to Rs150 crore. However, FY25 saw a strong recovery with a net profit of Rs37.8 crore, driven by strategic execution, focus on womenswear and innerwear, reduced discounting, and retail channel growth.",
            "pubDate": "2025-05-19T05:54:01.019544"
        },
        {
            "title": "Divi’s Laboratories Q4 results: PAT surges 26% YoY, revenue up 12%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/divis-laboratories-q4-results-pat-surges-26-yoy-revenue-up-12/articleshow/121232323.cms",
            "description": "Divi's Laboratories announced a robust financial performance for the March quarter of FY25, with a 25.6% YoY surge in standalone net profit, reaching Rs 667 crore. Revenue from operations also climbed by 12.26% to Rs 2,536 crore. The company's board declared a dividend of Rs 30 per share and its Unit III greenfield project has commenced commercial operations.",
            "pubDate": "2025-05-19T05:54:01.019649"
        },
        {
            "title": "IndusInd Bank to declare Q4, FY25 results on May 21",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-to-declare-q4-fy25-results-on-may-21/articleshow/121225563.cms",
            "description": "A one-time charge of about ₹1,960 crore, tied to accounting discrepancies in its derivatives portfolio, is expected to dent the bottomline at the lender that has lately been consuming column inches over uncomfortable disclosures.",
            "pubDate": "2025-05-19T05:54:01.019753"
        },
        {
            "title": "BLS International Q4 Results: PAT surges 70% to Rs 145 crore, sales up 54%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bls-international-q4-results-pat-surges-70-to-rs-145-crore-sales-up-54/articleshow/121217687.cms",
            "description": "BLS International Services Provider witnessed a significant surge in profitability for both the quarter and fiscal year ending March 31, 2025. The company's PAT for the quarter jumped by approximately 70% to Rs 145.2 crore, while sales increased by 54.74% to Rs 692.8 crore.",
            "pubDate": "2025-05-19T05:54:01.019851"
        },
        {
            "title": "GIC Housing Q4 profit drops 35% YoY despite rise in total income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gic-housing-q4-profit-drops-35-yoy-despite-rise-in-total-income/articleshow/121217062.cms",
            "description": "GIC Housing Finance reported a 35% YoY drop in Q4FY25 net profit to Rs 35 crore due to rising expenses. Total income rose to Rs 276 crore, while expenditure increased faster to Rs 207 crore. A 45% final dividend was announced.",
            "pubDate": "2025-05-19T05:54:01.019951"
        },
        {
            "title": "Repco Home Finance Q4 profit rises 6% as asset quality improves",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/repco-home-finance-q4-profit-rises-6-as-asset-quality-improves/articleshow/121217003.cms",
            "description": "Repco Home Finance posted a 6% YoY rise in Q4FY25 net profit to Rs 115 crore, with improved asset quality. Total income rose 10% to Rs 435 crore, while gross NPAs declined to 3.3%. Loan book grew 7% to Rs 14,492 crore.",
            "pubDate": "2025-05-19T05:54:01.020070"
        },
        {
            "title": "ESAF Small Finance Bank ends FY25 with a net loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/esaf-small-finance-bank-ends-fy25-with-a-net-loss/articleshow/121216979.cms",
            "description": "ESAF Small Finance Bank has suffered a net loss for the third quarter in a row as the asset quality stress in its microfinance portfolio deepened. The bank reported a loss of Rs 183 crore for the fourth quarter of the last fiscal as compared with a loss of Rs 211 crore and Rs 190 crore in the preceding quarters.",
            "pubDate": "2025-05-19T05:54:01.020167"
        },
        {
            "title": "CreditAccess Grameen announces succession plan, net profit at Rs 47 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/creditaccess-grameen-announces-succession-plan-net-profit-at-rs-47-crore/articleshow/121216959.cms",
            "description": "Microfinance lender CreditAccess Grameen has swung back to black with its fourth quarter net profit being at Rs 47.2 crore as against a Rs 99.5 crore net loss in the preceding quarter, as it set aside lower provisions in the comparing quarters.",
            "pubDate": "2025-05-19T05:54:01.020260"
        },
        {
            "title": "Hyundai India plans 26 new models by 2030 despite FY25 profit dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hyundai-india-plans-26-new-models-by-2030-despite-fy25-profit-dip/articleshow/121216926.cms",
            "description": "Hyundai Motor India reported a 4% YoY decline in Q4FY25 profit to Rs 1,614 crore. Despite challenges, it plans to launch 26 new models by FY30—20 ICE, 6 EVs—aiming to boost domestic growth and exports.",
            "pubDate": "2025-05-19T05:54:01.020356"
        },
        {
            "title": "Emami Q4 Results: Profit jumps 10% to Rs 162 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/emami-q4-results-profit-jumps-10-to-rs-162-crore/articleshow/121215016.cms",
            "description": "Homegrown FMCG firm Emami Ltd on Friday reported 10.5 per cent increase in consolidated profit after tax at Rs 162.17 crore for March quarter FY25, helped by a volume growth in its core business.",
            "pubDate": "2025-05-19T05:54:01.020450"
        },
        {
            "title": "Eureka Forbes Q4 Results: Profit up twofold to Rs 49 crore, revenue up 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/eureka-forbes-q4-results-profit-up-twofold-to-rs-49-crore-revenue-up-10/articleshow/121214963.cms",
            "description": "Health and hygiene products maker Eureka Forbes Ltd on Friday reported a twofold increase in its consolidated net profit to Rs 49.48 crore in the March quarter of 2024-25. The company had posted a net profit of Rs 21.38 crore in the January-March quarter a year ago, according to a regulatory filing by the firm now controlled by private equity firm Advent International.",
            "pubDate": "2025-05-19T05:54:01.020545"
        },
        {
            "title": "Delhivery Q4 Results: Cons PAT at Rs 73 crore versus YoY loss, revenue up 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/delhivery-q4-results-cons-pat-at-rs-73-crore-versus-yoy-loss-revenue-up-6/articleshow/121213915.cms",
            "description": "India's plan to achieve 100 GW of nuclear capacity by 2047 hinges on Bharat Small Reactors. Despite challenges like delays and fuel dependency, Rs 200 billion has been allocated to boost nuclear development and achieve net-zero goals.",
            "pubDate": "2025-05-19T05:54:01.020645"
        },
        {
            "title": "BHEL Q4 Results: Net Profit grows 4% YoY to Rs 504 crore, revenue up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bhel-q4-results-net-profit-grows-4-yoy-to-rs-504-crore-revenue-up-9/articleshow/121209898.cms",
            "description": "BHEL posted a 4% YoY rise in Q4FY25 net profit to ₹504 crore and an 8.9% revenue increase to ₹8,993 crore. On a quarterly basis, profit jumped 303%. The board recommended a final dividend of ₹0.50 per share for FY25.",
            "pubDate": "2025-05-19T05:54:01.020743"
        },
        {
            "title": "Hyundai Motor Q4 Results: Cons PAT drops 4% YoY to Rs 1,614 crore, revenue rises marginally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hyundai-motor-q4-results-cons-pat-down-4-to-rs-1614-crore-revenue-rises-marginally/articleshow/121209631.cms",
            "description": "Hyundai Motor Q4 Results: The company reported revenue from operations of ₹17,940 crore for the quarter ended March, marking a 1.5% increase compared to ₹17,671 crore in the same quarter of the previous financial year.",
            "pubDate": "2025-05-19T05:54:01.020843"
        },
        {
            "title": "Policybazaar Q4 Results: PB Fintech's profit skyrockets 185% YoY to Rs 171 crore, revenue jumps 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/policybazaar-q4-results-pb-fintechs-profit-skyrockets-185-yoy-to-rs-171-crore-revenue-jumps-38/articleshow/121193663.cms",
            "description": "PB Fintech reported a significant surge in Q4FY25, with net profit soaring by 185% to ₹171 crore, driven by a 38% increase in revenue to ₹1,508 crore. Policybazaar's core online business grew by 31%, contributing ₹877 crore. The company's consolidated PAT for FY25 rose by 448% to ₹353 crore, accompanied by a 37% YoY rise in premium at ₹7,030 crore.",
            "pubDate": "2025-05-19T05:54:01.020939"
        }
    ]
}