{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-21T02:58:00.295678",
    "items": [
        {
            "title": "Asian stocks drop after Wall Street, bonds steady",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-drop-after-wall-street-bonds-steady/articleshow/126898819.cms",
            "description": "Asian markets fell Wednesday, mirroring a Wall Street slump. Investors reacted to trade tensions over Greenland and bond market volatility. Gold prices reached a new record. Japanese, South Korean, and Australian stocks opened lower. US Treasury yields saw a significant rise. Global funds are pulling back from American assets. This situation highlights growing investor unease.",
            "pubDate": "2026-01-21T00:56:49.464375"
        },
        {
            "title": "Wall Street posts biggest daily drop in three months, Trump Greenland tariff threat triggers wide selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-posts-biggest-daily-drop-in-three-months-trump-greenland-tariff-threat-triggers-wide-selloff/articleshow/126897472.cms",
            "description": "Major Wall Street indexes experienced their largest one-day drops in three months, driven by renewed tariff threats from President Trump against Europe. This \"risk-off\" sentiment boosted gold to record highs and pressured U.S. Treasuries, while Bitcoin also declined. The selloff, triggered by Trump's proposed tariffs on European goods, raises concerns about market volatility.",
            "pubDate": "2026-01-21T00:56:49.464498"
        },
        {
            "title": "Narmadesh Brass shares to debut today on BSE SME platform. Check GMP and other detaills",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/narmadesh-brass-shares-to-debut-today-on-bse-sme-platform-check-gmp-and-other-detaills/articleshow/126914204.cms",
            "description": "The ₹44.87 crore fixed-price IPO of Narmadesh Brass was open for subscription from January 12 to January 16. Priced at ₹515 per share, the issue included a fresh share issuance worth ₹36.09 crore along with an offer for sale amounting to ₹8.78 crore.",
            "pubDate": "2026-01-21T02:57:46.353788"
        },
        {
            "title": "Negative Breakout: These 12 stocks cross below their 200 DMA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-12-stocks-cross-below-their-200-dma/slideshow/126913633.cms",
            "description": "In the Nifty200 pack, 12 stocks' closing prices crossed below their 200 DMA (Daily Moving Averages) on January 20, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock.",
            "pubDate": "2026-01-21T02:57:46.353893"
        },
        {
            "title": "Foreign funds return to Indian tech stocks on AI growth bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-funds-return-to-indian-tech-stocks-on-ai-growth-bets/articleshow/126912698.cms",
            "description": "Foreign investors are returning to Indian IT stocks, driven by the rising adoption of artificial intelligence and improved business visibility. Companies such as TCS, Infosys and HCL Tech are seeing strong AI-led growth, reviving sector sentiment despite near-term earnings pressure and uneven performance across firms.",
            "pubDate": "2026-01-21T02:57:46.353982"
        },
        {
            "title": "Investors eye Budget to unlock gains in state companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-eye-budget-to-unlock-gains-in-state-companies/articleshow/126910699.cms",
            "description": "Indian state-run stocks are poised for further outperformance as investors anticipate the upcoming budget to signal renewed stake sales for fund-raising and economic support. Attractive valuations and a potential government push for disinvestments are boosting these companies, which currently trade at a significant discount to their asset values.",
            "pubDate": "2026-01-21T02:57:46.354064"
        },
        {
            "title": "Warren Buffett's successor eyes selling off Berkshire Hathaway's 325 million Kraft Heinz shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffetts-successor-eyes-selling-off-berkshire-hathaways-325-million-kraft-heinz-shares/articleshow/126909405.cms",
            "description": "Warren Buffett's successor, Greg Abel, is signaling a potential shift at Berkshire Hathaway. Kraft Heinz disclosed that Berkshire, its largest shareholder, may sell its substantial stake. This move, if completed, could mark a departure from Buffett's acquisition-focused strategy, with Abel potentially reviewing all company holdings for performance.",
            "pubDate": "2026-01-21T02:57:46.354142"
        },
        {
            "title": "BHEL slides almost 5% in a weak market despite ‘strong’ Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bhel-slides-almost-5-in-a-weak-market-despite-strong-q3/articleshow/126905602.cms",
            "description": "On Tuesday, Bharat Heavy Electricals' stock suffered a notable plunge of more than 4%, representing its most dramatic decline in five months. This downturn stemmed from investor concerns over margin pressures revealed in the company's third-quarter report. Analysts are optimistic, predicting that improvements in margins could surface once new contracts are underway post-fiscal year 2026.",
            "pubDate": "2026-01-21T02:57:46.354225"
        },
        {
            "title": "D-Street has an upside & downside on Hindustan Zinc",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-has-an-upside-downside-on-hindustan-zinc/articleshow/126905166.cms",
            "description": "Hindustan Zinc's December quarter results have drawn mixed reactions from brokerages. While analysts are impressed by the company's robust operating performance, they express caution regarding the stock's high valuation. Price targets from various firms suggest potential downside or modest upside from current levels.",
            "pubDate": "2026-01-21T02:57:46.354307"
        },
        {
            "title": "IT earnings recovery not quite made to order, but seen on track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-earnings-recovery-not-quite-made-to-order-but-seen-on-track/articleshow/126903785.cms",
            "description": "Despite strong order bookings, the BSE Infotech index has seen minimal gains, reflecting investor concerns over project execution delays slowing revenue growth. Analysts anticipate a gradual recovery driven by large deal ramp-ups and AI opportunities, though short-term trends remain subject to geopolitical factors.",
            "pubDate": "2026-01-21T02:57:46.354387"
        },
        {
            "title": "With nearly Rs 10 lk cr m-cap lost, D-Street shivers as winds blow in from Greenland",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/with-nearly-rs-10-lk-cr-m-cap-lost-d-street-shivers-as-winds-blow-in-from-greenland/articleshow/126901683.cms",
            "description": "Indian markets experienced their steepest single-day plunge in nine months, with the Nifty and Sensex falling significantly. This sell-off was driven by heightened geopolitical uncertainty surrounding US President Trump's Greenland plans and threatened tariffs on European nations. The fear gauge jumped, while gold and silver extended their record-breaking rally.",
            "pubDate": "2026-01-21T02:57:46.354483"
        },
        {
            "title": "Gift Nifty signals positive start for the day; here's the trading setup for the session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-signals-negative-start-for-the-day-heres-the-trading-setup-for-the-session/articleshow/126900271.cms",
            "description": "Indian stock markets saw a sharp correction on Wednesday. The Nifty closed 353 points lower, and the Sensex fell by 1066 points. Analysts suggest the market is oversold, and a pullback rally is possible. Global markets also experienced declines, influenced by trade tensions and bond market volatility. The Indian Rupee hit a record low against the US dollar.",
            "pubDate": "2026-01-21T02:57:46.354563"
        },
        {
            "title": "Stocks in news: Eternal, Tata Motors, Restaurant Brands Asia, AU Small Finance Bank, RBL Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-eternal-tata-motors-restaurant-brands-asia-au-small-finance-bank-rbl-bank/articleshow/126899405.cms",
            "description": "Indian markets saw a decline on Tuesday due to widespread selling and weak global sentiment. Analysts are watching key sectors like banking and IT for potential rebounds. Several companies including Eternal, Tata Motors, and AU Small Finance Bank are in focus due to news and third-quarter results.",
            "pubDate": "2026-01-21T02:57:46.354640"
        }
    ]
}