{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-12T01:50:16.964128",
    "items": [
        {
            "title": "Zerodha to change how it releases margins on equity F&O expiry day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-to-change-how-it-releases-margins-on-equity-fo-expiry-day/articleshow/125917812.cms",
            "description": "Zerodha has updated its margin release policy for equity derivatives expiry days, now making funds available by 4 PM after cash market close. This change allows active traders to immediately redeploy capital into commodity markets, which trade until late evening, easing previous capital constraints.",
            "pubDate": "2025-12-12T01:50:08.175076"
        },
        {
            "title": "Asian stocks rise at open after S&P 500 hits record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-rise-at-open-after-sp-500-hits-record-high/articleshow/125923717.cms",
            "description": "Asian stocks opened higher, mirroring record highs in US and global equities following the Federal Reserve's interest-rate cut. SoftBank Group saw a significant jump, while caution lingered for some tech names despite the broader rally. The market anticipates continued momentum into year-end and potentially 2026.",
            "pubDate": "2025-12-12T01:50:08.175183"
        },
        {
            "title": "GIFT Nifty up 110 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125917689.cms",
            "description": "Indian equities rose on Thursday, with the Nifty ending its three-day decline. Foreign institutional investors continued their selling streak for the eleventh consecutive session. Key economic data releases from India and the UK are anticipated today, while the Indian rupee hit an all-time low against the US dollar.",
            "pubDate": "2025-12-12T01:50:08.175282"
        },
        {
            "title": "Stocks in news: BEML, IndiGo, Jindal Steel, ITC Hotels, Glenmark Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-beml-indigo-jindal-steel-itc-hotels-glenmark-pharma/articleshow/125917645.cms",
            "description": "Indian markets saw a rebound on Thursday after three days of decline. Analysts suggest caution until a key resistance level is cleared. Investors should watch banking and IT stocks closely for market direction. Global market trends, especially from the US, will also play a role.",
            "pubDate": "2025-12-12T01:50:08.175380"
        },
        {
            "title": "Fairfax emerges as frontrunner to acquire government–LIC stake in IDBI Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fairfax-emerges-as-frontrunner-to-acquire-governmentlic-stake-in-idbi-bank/articleshow/125923675.cms",
            "description": "Fairfax Financial seems poised to take the lead in acquiring a significant stake in IDBI Bank, with Kotak Mahindra Bank hot on its heels. As financial bids draw near, there’s speculation about a potential deadline extension. Fairfax is leaning towards a full cash offer amidst the government and LIC's plans to offload more than 60% of the bank's shares.",
            "pubDate": "2025-12-12T01:50:08.175499"
        },
        {
            "title": "Oracle's 14.4% plunge weighs on Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracles-14-4-plunge-weighs-on-wall-street/articleshow/125923499.cms",
            "description": "The Nasdaq experienced a one-week low as Oracle's significant AI spending plans overshadowed a dovish Federal Reserve. Oracle's stock plummeted after its quarterly forecasts missed expectations, raising concerns about its AI cloud strategy burning cash. Technology stocks, including Nvidia and Broadcom, also declined, impacting the S&P 500 and semiconductor index.",
            "pubDate": "2025-12-12T01:50:08.175602"
        },
        {
            "title": "Despite the stress, big banks keep playing credit cards",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/despite-the-stress-big-banks-keep-playing-credit-cards/articleshow/125923546.cms",
            "description": "Several mid-sized lenders, including Kotak Mahindra Bank, RBL Bank, and IndusInd Bank, are slowing new credit card issuances due to ongoing sector stress and a focus on cleaning up books. This contrasts with larger banks like HDFC Bank and ICICI Bank, which continue aggressive portfolio expansion.",
            "pubDate": "2025-12-12T01:50:08.175884"
        },
        {
            "title": "Kotak Bank eyes mid-market loans amid slow big-corp demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-bank-eyes-mid-market-loans-amid-slow-big-corp-demand/articleshow/125923548.cms",
            "description": "Kotak Mahindra Bank is expanding its mid-market corporate loan book, targeting companies with ₹500 crore to ₹1,500 crore in turnover. This segment, which has grown over 35% compounded annually since its launch, is expected to see 20-25% growth over the next five years. The bank aims for this mid-market book to reach at least 20% of its total corporate portfolio.",
            "pubDate": "2025-12-12T01:50:08.175978"
        },
        {
            "title": "RBI relaxes rules on current, CC and OD accounts; threshold raised to ₹10 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-relaxes-rules-on-current-cc-and-od-accounts-threshold-raised-to-10-crore/articleshow/125923536.cms",
            "description": "The Reserve Bank of India has relaxed norms for business accounts. Customers can now open current, cash credit, and overdraft accounts more easily. The aggregate exposure limit for opening these accounts without restriction has been raised. New rules will be effective from April 2026. Banks will have specific criteria for maintaining accounts with higher exposures.",
            "pubDate": "2025-12-12T01:50:08.176254"
        },
        {
            "title": "Lenders to MSME units face concentration risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lenders-to-msme-units-face-concentration-risk/articleshow/125923621.cms",
            "description": "MSME lenders face significant concentration risk as a small fraction of borrowers holds over half of the total outstanding loans. Despite this, the sector's portfolio quality improved, with the share of loans at risk declining. Public sector banks lead in the micro segment, while private banks dominate small and medium enterprises.",
            "pubDate": "2025-12-12T01:50:08.176343"
        }
    ]
}