{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-07T15:58:59.036492",
    "items": [
        {
            "title": "Power Grid shares to approach ex-date for Rs 4.5 per share interim dividend. Last chance to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-grid-shares-to-approach-ex-date-for-rs-4-5-per-share-interim-dividend-last-chance-to-buy/articleshow/125148084.cms",
            "description": "Investors have a final chance today to buy Power Grid Corporation of India shares for a Rs 4.50 interim dividend. The stock will trade ex-dividend from November 10. This dividend is for the financial year 2025-26. Eligible shareholders will receive the payout on December 1. Other companies also have ex-dividend dates soon.",
            "pubDate": "2025-11-07T02:49:18.203526"
        },
        {
            "title": "Japan's Nikkei drops 2% as tech shares track US peers lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-drops-2-as-tech-shares-track-us-peers-lower/articleshow/125147787.cms",
            "description": "Japan's Nikkei index experienced a significant weekly decline, its largest since April, driven by a sell-off in heavyweight tech stocks mirroring U.S. market trends. Concerns over stretched valuations and disappointing corporate earnings impacted major players like SoftBank and Advantest. Despite a strong October rally, a cautious market sentiment emerged, with investors now closely watching upcoming company results for direction.",
            "pubDate": "2025-11-07T02:49:18.203644"
        },
        {
            "title": "Gift Nifty drops over 50 pts; here's the trading setup for the day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-drops-over-50-pts-heres-the-trading-setup-for-the-day/articleshow/125147603.cms",
            "description": "Indian stock markets closed lower on Thursday. Early gains faded as investors booked profits. Analysts suggest the market is in a consolidation phase with a negative outlook. Key support levels are being watched closely. Global markets showed mixed movements. Foreign investors were net sellers, while domestic investors bought shares. The Indian Rupee saw a slight appreciation against the US dollar.",
            "pubDate": "2025-11-07T02:49:18.203746"
        },
        {
            "title": "US Stocks fall with tech shares; sterling up as BoE keeps rates unchanged",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-fall-with-tech-shares-sterling-up-as-boe-keeps-rates-unchanged/articleshow/125147591.cms",
            "description": "Global markets experienced a downturn Thursday, with tech and consumer stocks leading the decline. The British pound strengthened as the Bank of England held interest rates steady. U.S. chipmaker Qualcomm saw its shares fall on future product concerns. Investors are closely watching corporate earnings, U.S. government shutdown impacts, and trade tariff developments.",
            "pubDate": "2025-11-07T02:49:18.203839"
        },
        {
            "title": "Adani Enterprises to spread Rs 25,000-cr rights issue over 4 tranches",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-to-spread-rs-25000-cr-rights-issue-over-4-tranches/articleshow/125147510.cms",
            "description": "Adani Enterprises is set to launch its largest fundraising yet, a ₹25,000 crore rights issue. This will be spread over six to eight months in four tranches. The company plans to use a significant portion to repay loans from its promoters. This move will free up capital for future debt. The rights issue details are expected soon.",
            "pubDate": "2025-11-07T02:49:18.203936"
        },
        {
            "title": "Fortis, Siemens, Paytm and GE Vernova join MSCI India index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fortis-siemens-paytm-and-ge-vernova-join-msci-india-index/articleshow/125147482.cms",
            "description": "MSCI has updated its global indices. Fortis Healthcare, GE Vernova T&D India, Paytm, and Siemens Energy India are now part of the Global Standard Index. This move is expected to bring substantial investment into these stocks. Changes also affect the India Small Cap Index. Several companies will see their index weights adjusted, influencing fund movements.",
            "pubDate": "2025-11-07T02:49:18.204031"
        },
        {
            "title": "LIC Q2 net rises 31% on business growth, higher margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-q2-net-rises-31-on-business-growth-higher-margins/articleshow/125147417.cms",
            "description": "Life Insurance Corp, or LIC, saw its September quarter profit jump 31% to over ₹10,000 crore. This growth was fueled by its core business and improved margins. While premium growth faced a temporary dip due to GST benefits, LIC anticipates a strong second half. The company is focusing on profitable products and passing on GST benefits to customers.",
            "pubDate": "2025-11-07T02:49:18.204139"
        },
        {
            "title": "Sebi plans smoother IPO listings, rationalise offer documents",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-plans-smoother-ipo-listings-rationalise-offer-documents/articleshow/125147362.cms",
            "description": "The Securities and Exchange Board of India (Sebi) is set to simplify IPO processes by reducing offer document summary content and streamlining procedures for companies with pre-IPO pledged shares. Chairman Tuhin Kanta Pandey stated these changes aim to encourage informed investor feedback and prevent listing delays.",
            "pubDate": "2025-11-07T02:49:18.204228"
        },
        {
            "title": "Stocks in news: Infosys, Apollo Hospitals, Airtel, Nykaa, Bajaj Housing, Trent",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-apollo-hospitals-airtel-nykaa-bajaj-housing-trent/articleshow/125147322.cms",
            "description": "Indian markets saw a slight dip on Thursday. Key companies like Infosys, Apollo Hospitals, and Airtel are in focus due to corporate news and earnings. Infosys announced its record date for a large share buyback. Apollo Hospitals reported strong profit growth. LIC also posted a significant rise in net profit. Singtel plans to sell a stake in Bharti Airtel.",
            "pubDate": "2025-11-07T02:49:18.204320"
        },
        {
            "title": "Asian stocks dip after volatile US day, bonds ease",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-dip-after-volatile-us-day-bonds-ease/articleshow/125147289.cms",
            "description": "Markets are reacting to private data as economic figures are scarce due to the US government shutdown. Job cuts are rising, particularly in technology and warehousing. Concerns about high tech valuations are also unsettling investors. Meanwhile, Federal Reserve officials are weighing inflation risks against labor market strength. Oil prices are seeing increased supply.",
            "pubDate": "2025-11-07T02:49:18.204410"
        },
        {
            "title": "Elon Musk's $1 trillion Tesla pay plan wins shareholder approval",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musks-1-trillion-tesla-pay-plan-wins-shareholder-approval/articleshow/125147804.cms",
            "description": "Tesla shareholders overwhelmingly approved Elon Musk's record-breaking $878 billion pay package, endorsing his ambitious AI and robotics vision. The vote allows Musk to pursue self-driving cars, a robotaxi network, and humanoid robots, despite concerns over his political rhetoric and potential conflicts with his xAI startup. This approval is seen as crucial for Tesla's future valuation and Musk's continued leadership.",
            "pubDate": "2025-11-07T02:49:18.204495"
        },
        {
            "title": "Zydus Lifesciences to raise Rs 5,000 cr via equity; Q2 profit up 38%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zydus-lifesciences-to-raise-rs-5000-cr-via-equity-q2-profit-up-38/articleshow/125140600.cms",
            "description": "Zydus Lifesciences plans to raise Rs 5,000 crore via share sales. This move aims to reduce debt and boost future expansion. Funds will support R&D, international market growth, and new specialty product launches. The company reported strong profit and revenue growth in the second quarter.",
            "pubDate": "2025-11-07T02:49:18.204586"
        },
        {
            "title": "Infosys shares in focus as board fixes Nov 14 record date for Rs 18,000 cr share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-as-board-fixes-nov-14-record-date-for-rs-18000-cr-share-buyback/articleshow/125148991.cms",
            "description": "Infosys shares are under scrutiny as the record date for its Rs 18,000 crore share buyback approaches on November 14. This marks the company's largest buyback ever, despite recent stock underperformance. The IT giant reported strong Q2 FY26 results with a 13% net profit increase and revised revenue guidance upwards.",
            "pubDate": "2025-11-07T03:57:09.550515"
        },
        {
            "title": "Stock Radar: HPCL hits fresh record high in November 2025; should you book profits or buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-hpcl-hits-fresh-record-high-in-november-2025-should-you-book-profits-or-buy/articleshow/125148957.cms",
            "description": "Hindustan Petroleum Corporation (HPCL) has surged to a record high in November, and technical charts suggest the momentum may continue. Experts advise short-term traders to buy on dips, targeting Rs 500–540 over the next 3–4 weeks. The stock has broken out of its long-term resistance zone of 450–460, supported by strong sectoral buying in OMCs and a steadily rising price base.",
            "pubDate": "2025-11-07T03:57:09.550636"
        },
        {
            "title": "Blue Star among 5 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blue-star-among-5-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/125148834.cms",
            "description": "As of November 6, there was a notable surge in futures open interest for five stocks in the NSE F&O pack, contributing to a total increase in open interest of over 10% compared to the previous trade. A significant uptick in futures open interest indicates substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-11-07T03:57:09.550739"
        },
        {
            "title": "LIC shares in focus after Q2 profit surges 31% YoY; Citi projects 50% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-shares-in-focus-after-q2-profit-surges-31-yoy-citi-projects-50-upside/articleshow/125148907.cms",
            "description": "Life Insurance Corporation of India's profit rose 31 percent year-on-year in the July-September quarter. This strong performance has led global brokerage Citi to predict a 50 percent upside for the stock. Citi maintains a 'Buy' rating, citing product mix realignment and improving margins. The company's net premium income also saw a rise.",
            "pubDate": "2025-11-07T03:57:09.550847"
        },
        {
            "title": "Bharti Airtel shares in focus as Singtel likely to offload 0.8% stake worth Rs 10,300 crore block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-shares-in-focus-as-singtel-likely-to-offload-0-8-stake-worth-rs-10300-crore-block-deal/articleshow/125148784.cms",
            "description": "Bharti Airtel is in focus as Singtel plans a block deal to sell 0.8% stake (~Rs 10,300 crore) at a 3.1% discount. The sale follows previous stake reductions and strong Q2 performance, with 6% QoQ EBITDA growth and Rs 14,600 crore free cash flow. Analysts cite premiumisation, a possible tariff hike, and African operations as drivers, maintaining a “Buy” rating.",
            "pubDate": "2025-11-07T03:57:09.551144"
        },
        {
            "title": "Redington among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-among-6-stocks-showing-bullish-rsi-upswing/slideshow/125148802.cms",
            "description": "On November 6, in the Nifty500 pack, six stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI Trending Up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-07T03:57:09.551248"
        },
        {
            "title": "Negative Breakout: These 11 stocks close below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-11-stocks-close-below-their-200-dmas/slideshow/125148724.cms",
            "description": "In the Nifty200 pack, 11 stocks' closing prices fell below their 200 DMA (Daily Moving Average) on November 6, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-11-07T03:57:09.551342"
        },
        {
            "title": "Studds Accessories shares list at over 3% discount despite strong IPO demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/studds-accessories-shares-list-at-over-3-discount-despite-strong-ipo-demand/articleshow/125149487.cms",
            "description": "Studds Accessories share price: Studds Accessories, India's largest helmet manufacturer, experienced a weak market debut, listing below its IPO price despite strong investor demand. The company, which raised Rs 455 crore through an OFS, saw its shares open lower on both NSE and BSE. Despite a blockbuster IPO subscribed 73.3 times, the stock's initial performance suggests near-term challenges.",
            "pubDate": "2025-11-07T04:50:09.982572"
        },
        {
            "title": "First cracks in AI bubble rattle India's proxy stock investors. How worried should you be?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/first-cracks-in-ai-bubble-rattle-indias-proxy-stock-investors-how-worried-should-you-be/articleshow/125149444.cms",
            "description": "Global AI stocks are showing early signs of a slowdown, with major tech companies experiencing sell-offs. This caution is now impacting Indian companies linked to the digital and data ecosystem, leading to volatility. Analysts suggest this is a valuation reset rather than a structural issue, with long-term AI potential still intact but requiring patience.",
            "pubDate": "2025-11-07T04:50:09.982701"
        },
        {
            "title": "Kaynes Technology, Blue Star, among 5 stocks that dropped below VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-blue-star-among-5-stocks-that-dropped-below-vwap/slideshow/125149039.cms",
            "description": "On November 6, the closing prices of five stocks from Nifty500 dropped over 5% relative to the VWAP (Volume Weighted Average Price), and a shift below the VWAP suggests a potential bearish trend, according to stockedge.com's technical scan data.When the closing price falls below the VWAP, it signifies that the closing price is lower than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This can be seen as a potential indication of increased selling pressure.",
            "pubDate": "2025-11-07T04:50:09.982807"
        },
        {
            "title": "Amber Enterprises shares tumble 13% after reporting Q2 net loss at Rs 32 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amber-enterprises-shares-tumble-13-after-reporting-q2-net-loss-at-rs-32-crore/articleshow/125149216.cms",
            "description": "Amber Enterprises shares slumped up to 13% after the company reported a consolidated net loss of Rs 32 crore in Q2FY26, compared to a profit last year, with revenue slipping 2% and EBITDA down 19%. Higher financing costs, elevated inventories and JV losses weighed on performance. Despite challenges, H1 revenue grew 25%. The stock was trading 12% lower at Rs 6,900.",
            "pubDate": "2025-11-07T04:50:09.982914"
        },
        {
            "title": "TVS Motor shares in focus as company divests stake in Rapido for Rs 288 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-shares-in-focus-as-company-divests-stake-in-rapido-for-rs-288-crore/articleshow/125149193.cms",
            "description": "TVS Motor Company is selling its stake in Rapido for Rs 287.93 crore. This marks a strategic exit from the bike-taxi aggregator. The deal involves selling shares to Accel India VIII and MIH Investments One BV. TVS Motor had partnered with Rapido in 2022. This divestment occurs as Rapido's shareholder mix changes.",
            "pubDate": "2025-11-07T04:50:09.983022"
        },
        {
            "title": "Cummins India shares in focus as Q2 profit jumps 42% to Rs 638 crore, sales up 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cummins-india-shares-in-focus-as-q2-profit-jumps-42-to-rs-638-crore-sales-up-28/articleshow/125149172.cms",
            "description": "Cummins India's shares are poised for action after the company reported a strong September quarter with profit after tax up 42% year-on-year to Rs 638 crore. Driven by broad-based growth in domestic and export markets, total sales surged 28% YoY to Rs 3,122 crore. The company remains cautiously optimistic despite global uncertainties.",
            "pubDate": "2025-11-07T04:50:09.983132"
        },
        {
            "title": "Apollo Hospitals shares in focus as Q2 PAT rises 26% YoY; Morgan Stanley maintains ‘Overweight’ call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-hospitals-shares-in-focus-as-q2-pat-rises-26-yoy-morgan-stanley-maintains-overweight-call/articleshow/125149132.cms",
            "description": "Apollo Hospitals shares: The company posted a 26% YoY rise in Q2FY26 profit to ₹477 crore, led by robust growth across its hospital, diagnostics, and digital health verticals. Revenue grew 13% to ₹6,304 crore, driven by higher patient volumes and improved margins.",
            "pubDate": "2025-11-07T04:50:09.983233"
        },
        {
            "title": "Sensex tumbles over 600 pts, Nifty below 25,350 as D-Street heads for weekly loss amid profit-taking",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-tumbles-over-550-pts-nifty-below-25400-as-d-street-heads-for-weekly-loss-amid-profit-taking/articleshow/125149027.cms",
            "description": "Indian stock markets opened lower on Friday. Both Sensex and Nifty are continuing their decline for the third day. Investors are booking profits. Foreign investors are also selling shares. This caution is overshadowing positive corporate earnings and trade talks. The Sensex and Nifty are set to end the week with small losses.",
            "pubDate": "2025-11-07T04:50:09.983349"
        },
        {
            "title": "Bajaj Housing Finance shares in focus as Q2 profit rises 18% YoY; Morgan Stanley sets Rs 1,150 TP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-finance-shares-in-focus-as-q2-profit-rises-18-yoy-morgan-stanley-sets-rs-1150-tp/articleshow/125149073.cms",
            "description": "Bajaj Housing Finance will be in focus after reporting an 18% YoY rise in Q2 net profit to Rs 643 crore, with revenue up 14% to Rs 2,755 crore. Sequentially, PAT grew 10%. Morgan Stanley maintained an ‘Overweight’ rating and set a target price of Rs 1,150, adding to the stock’s positive sentiment.",
            "pubDate": "2025-11-07T04:50:09.983450"
        },
        {
            "title": "Crompton Greaves shares slide 3% as Q2 net profit tumbles 41% to Rs 75 crore. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/crompton-greaves-shares-in-focus-as-q2-net-profit-tumbles-41-to-rs-75-crore-what-should-investors-do/articleshow/125148985.cms",
            "description": "Crompton Greaves Consumer Electricals reported a 41% YoY drop in Q2 FY25 net profit to Rs 75 crore, though revenue rose 1% to Rs 1,916 crore. Margins weakened due to commodity inflation and higher costs, but subsidiary Butterfly Gandhimathi posted double-digit growth. The company entered the solar rooftop segment with Rs 500 crore in new orders. Brokerages remain divided—Morgan Stanley retained Equalweight with a Rs 310 target, while Goldman Sachs maintained Buy with a trimmed Rs 330 target, citing long-term growth potential.",
            "pubDate": "2025-11-07T04:50:09.983547"
        },
        {
            "title": "Citi sees 51% growth potential in Vodafone Idea shares, drives stock 5% high. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/citi-sees-51-growth-potential-in-vodafone-idea-shares-drives-stock-5-high-heres-why/articleshow/125151788.cms",
            "description": "Citi reiterates “BUY” rating on Vodafone Idea with a target price of Rs 14, suggesting a 51% upside. The Supreme Court's order enables reassessment of Vodafone Idea’s AGR dues, providing potential government relief.",
            "pubDate": "2025-11-07T07:17:03.547688"
        },
        {
            "title": "Lupin shares jump 2% as Q2 PAT soars 73% YoY to Rs 1,485 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lupin-shares-jump-2-as-q2-pat-soars-73-yoy-to-rs-1485-crore/articleshow/125151551.cms",
            "description": "Lupin shares rose on Friday after the pharma major reported a robust 73% YoY surge in Q2 FY26 PAT to Rs 1,485 crore, driven by strong sales growth, margin expansion, and operational efficiency. Revenue jumped 24% YoY to Rs 6,831 crore, while EBITDA soared 76%.",
            "pubDate": "2025-11-07T07:17:03.547824"
        },
        {
            "title": "Multibaggers in a mixed year: 10 SME IPOs doubled, even tripled investor wealth in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibaggers-in-a-mixed-year-10-sme-ipos-doubled-even-tripled-investor-wealth-in-2025/slideshow/125150629.cms",
            "description": "Even though the broader SME market has a mixed picture, some of the outliers delivered investors with outsized gains, doubling or even tripling investors' wealth. The common trend among these companies is that there is a strong sectoral tailwind going for them or healthy growth over the past few quarters.",
            "pubDate": "2025-11-07T07:17:03.547928"
        },
        {
            "title": "Sebi flags 1 lakh social media posts for misleading content, says unregulated influencers pose direct risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-flags-1-lakh-social-media-posts-for-misleading-content-says-unregulated-influencers-pose-direct-risk/articleshow/125151291.cms",
            "description": "SEBI Chairperson Tuhin Kanta Pandey said the regulator has flagged over 1 lakh misleading social media posts, warning that unregulated influencers pose a direct threat to investors. Speaking at the CNBC-TV18 Summit, he outlined reforms to enhance transparency, governance, and capital market inclusivity.",
            "pubDate": "2025-11-07T07:17:03.548033"
        },
        {
            "title": "LIC’s margins surprises street; JM Financial sees strong H2, maintains ‘Buy’ on stock with Rs 1,111 target",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lics-margins-surprises-street-jm-financial-sees-strong-h2-maintains-buy-on-stock-with-rs-1111-target/articleshow/125150855.cms",
            "description": "LIC stock edged higher after the insurer reported stronger-than-expected margins of 17.6% in 1H FY26, prompting JM Financial to reiterate its ‘Buy’ rating with a Rs 1,111 target. Analysts expect margin resilience, product diversification, and potential GST tailwinds to drive a stronger second half.",
            "pubDate": "2025-11-07T07:17:03.548136"
        },
        {
            "title": "MCX shares rise 1% as exchange posts 29% YoY surge in Q2FY26 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-rise-1-as-exchange-posts-29-yoy-surge-in-q2fy26-pat/articleshow/125150715.cms",
            "description": "MCX shares rose on Friday after the exchange reported a 29% YoY surge in Q2FY26 PAT to Rs 197.47 crore, driven by strong revenue growth, higher bullion trading activity, and new product launches. Average daily turnover jumped 87% YoY, led by increased participation in gold and silver contracts.",
            "pubDate": "2025-11-07T07:17:03.548237"
        },
        {
            "title": "Piramal Finance makes strong debut at Rs 1,270 on BSE, lists at 13% premium over discovered price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/piramal-finance-makes-strong-debut-at-rs-1270-on-bse-lists-at-13-premium-over-discovered-price/articleshow/125150676.cms",
            "description": "Piramal Finance made its market debut on November 7 at ₹1,270 per share on the BSE, a 13% premium to the discovered price of ₹1,124.20. The stock further rose 3% to ₹1,309 intraday. The listing came via a merger with Piramal Enterprises Ltd (PEL) and was not preceded by an IPO.",
            "pubDate": "2025-11-07T07:17:03.548333"
        },
        {
            "title": "Nomura raises target price of Rekha Jhunjhunwala-owned Tata stock that's up 15% this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-raises-target-price-of-rekha-jhunjhunwala-owned-tata-stock-thats-up-15-this-year/articleshow/125150284.cms",
            "description": "Nomura has raised its target price for Tata’s Titan Company to Rs 4,500, citing strong demand and festive-season jewellery sales. The stock has gained 15% this year. Titan reported 22% revenue growth in Q2 FY26, with jewellery sales up 18.8%. Margins remain steady despite gold price pressure, though risks exist from high gold prices and competition. Nomura forecasts strong earnings growth at a 24% CAGR through FY28.",
            "pubDate": "2025-11-07T07:17:03.548428"
        },
        {
            "title": "This smallcap jewellery stock is up over 50% in just 5 sessions and experts predict more upside. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-jewellery-stock-is-up-over-50-in-just-5-sessions-and-experts-predict-more-upside-do-you-own/articleshow/125150038.cms",
            "description": "Thangamayil Jewellery has surged over 53% in five days, becoming 2025's top-performing jewellery stock. Stellar September-quarter results and a record October, with revenue crossing Rs 1,000 crore, fueled this rally. Analysts see strong technical momentum but advise caution, suggesting dips for entry points around Rs 2,800 and Rs 2,570.",
            "pubDate": "2025-11-07T07:17:03.548544"
        },
        {
            "title": "Ola Electric shares extend fall; down for 3rd consecutive session as Q2 revenue slips 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-extend-fall-down-for-3rd-consecutive-session-as-q2-revenue-slips-43/articleshow/125150087.cms",
            "description": "Ola Electric shares slipped over 4% after reporting a mixed Q2 FY26 performance. While losses narrowed, revenue fell 43% YoY. The company achieved Auto EBITDA profitability and cut operating costs sharply.",
            "pubDate": "2025-11-07T07:17:03.548643"
        },
        {
            "title": "Why are stock markets down today? Sensex slumps over 600 pts, Nifty below 25,350; 7 factors steering D-St toward weekly loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-are-stock-markets-down-today-sensex-slumps-over-600-pts-nifty-below-25350-7-factors-steering-d-st-toward-weekly-loss/articleshow/125150014.cms",
            "description": "Indian stock markets, the Sensex and Nifty, saw a significant drop on Friday. This marks the third consecutive day of losses. Investors are booking profits after a strong rally in October. Foreign investor outflows and a cautious global mood are also impacting the market. Despite positive corporate earnings, the benchmarks are headed for a weekly decline.",
            "pubDate": "2025-11-07T07:17:03.548739"
        },
        {
            "title": "Vedanta among top 10 stocks with dividend yield up to 10% in FY25. Check full list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-among-top-10-stocks-with-dividend-yield-up-to-10-in-fy25-check-full-list/slideshow/125150140.cms",
            "description": "Dividends represent a critical component of shareholder returns, especially for long-term investors seeking consistent income alongside capital appreciation. A company’s dividend yield—calculated as dividends paid per share divided by its market price—serves as a key metric for assessing the income-generating potential of an equity investment. High and consistent dividend yields often reflect strong underlying cash flows and shareholder-friendly policies, making such companies attractive in volatile or low-growth market environments.Below are the companies, as compiled by SBI Securities, that have consistently paid dividends over the last three financial years—FY23, FY24, and FY25. The dividend yield figures presented here are computed using the closing stock prices as of 31st October 2025, providing an up-to-date snapshot of current income potential:",
            "pubDate": "2025-11-07T07:17:03.548840"
        },
        {
            "title": "Japan's Nikkei suffers worst week since April as AI shares sell off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-suffers-worst-week-since-april-as-ai-shares-sell-off/articleshow/125152633.cms",
            "description": "Japan's Nikkei index experienced its largest weekly fall since April. This decline was driven by tech stocks mirroring a drop in US markets. Investors are concerned about high valuations. Corporate results also played a role, with some companies reporting disappointing figures. However, Recruit Holdings and Nissan Motor saw gains following their financial updates.",
            "pubDate": "2025-11-07T07:31:16.914460"
        },
        {
            "title": "NSE's long-term trajectory intact, F&O tightening key risk: Motilal Oswal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nses-long-term-trajectory-intact-fo-tightening-key-risk-motilal-oswal/articleshow/125155277.cms",
            "description": "Motilal Oswal expects NSE’s long-term growth to remain strong despite near-term pressure from a one-time SEBI settlement fee, forecasting steady revenue and profit growth driven by diversified income streams, product innovation, and sustained market dominance.",
            "pubDate": "2025-11-07T09:17:38.722996"
        },
        {
            "title": "Europe's STOXX 600 steady after volatile week; ITV soars",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-600-steady-after-volatile-week-itv-soars/articleshow/125155150.cms",
            "description": "European shares edged up on Friday, in what appeared to be a steady end to a week marred by worries about elevated valuations of technology-related stocks globally, while the UK's ITV jumped on a potential sale of its broadcasting division",
            "pubDate": "2025-11-07T09:17:38.723112"
        },
        {
            "title": "10 high-growth, high-margin stocks surged up to 97% in a year; Are you in or out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-high-growth-high-margin-stocks-surged-up-to-97-in-a-year-are-you-in-or-out/slideshow/125155189.cms",
            "description": "In the bustling world of Dalal Street, a quiet but powerful group of 41 companies from the BSE 500 has started turning heads. These firms have not only delivered solid sales and profit growth of over 10% in the September quarter but have also managed to keep their profit margins comfortably above 10%, an impressive achievement given the challenging economic backdrop. Notably, this list excludes banking and financial sector stocks.When investors took a closer look at how these stocks performed over the past year, the results were encouraging. More than half of the pack rewarded shareholders with positive price returns, signaling market confidence in their business strength. What stood out most were the top ten performers—stocks that surged between a striking 20% and an extraordinary 97%, turning steady performers into market heroes. (Data Source: ACE Equity)",
            "pubDate": "2025-11-07T09:17:38.723213"
        },
        {
            "title": "Brokerages reaffirm bullish outlook on Paytm; cite profitability momentum, AI-led growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brokerages-reaffirm-bullish-outlook-on-paytm-cite-profitability-momentum-ai-led-growth/articleshow/125155079.cms",
            "description": "Major brokerages, including Bernstein, Jefferies, JM Financial, Mirae Asset Capital Markets, Emkay Global, and YES Securities, have reiterated their positive stance on One 97 Communications Ltd (Paytm) following its Q2FY26 results.",
            "pubDate": "2025-11-07T09:17:38.723315"
        },
        {
            "title": "F&O Radar | Deploy Bear Put Spread in Nifty to trade the downside with defined risk-reward",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bear-put-spread-in-nifty-to-trade-the-downside-with-defined-risk-reward/articleshow/125154606.cms",
            "description": "Nifty has turned bearish after forming a “Double Top” near 26,100 and slipping below its 20-DEMA. Experts expect further downside toward 25,300, with 25,800 acting as resistance. Kotak Securities suggests deploying a Bear Put Spread to trade the decline with defined risk and reward.",
            "pubDate": "2025-11-07T09:17:38.723411"
        },
        {
            "title": "SEBI to comprehensively review short selling and SLBM frameworks: Tuhin Kanta Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-comprehensively-review-short-selling-and-slbm-frameworks-tuhin-kanta-pandey/articleshow/125152933.cms",
            "description": "SEBI chief Tuhin Kanta Pandey announced a comprehensive review of short selling and the securities lending and borrowing mechanism, highlighting the need for development. He emphasised strong investor participation and ongoing reforms to streamline capital-raising processes.",
            "pubDate": "2025-11-07T09:17:38.723507"
        },
        {
            "title": "Market Wrap: Sensex slips 0.1%, Nifty holds below 25,500 as D-St pares sharp intraday losses but ends week lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slips-0-1-nifty-holds-below-25500-as-d-st-pares-sharp-intraday-losses-but-end-week-lower/articleshow/125156965.cms",
            "description": "Indian stocks ended lower for a third consecutive session on Friday, paring significant early losses as investors booked profits after October's rally. Foreign outflows and a cautious global outlook contributed to the sell-off, though corporate earnings optimism and potential India-U.S. trade progress offered some support.",
            "pubDate": "2025-11-07T10:25:32.455196"
        },
        {
            "title": "BSE, other capital market stocks zoom up to 11% on supportive F&O commentary by FM, SEBI chairman",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-other-capital-market-stocks-zoom-up-to-11-on-supportive-fo-commentary-by-fm-sebi-chairman/articleshow/125156679.cms",
            "description": "BSE shares rose sharply along with other capital market-linked stocks like CDSL and Angel One after Finance Minister Nirmala Sitharaman and Sebi chief Tuhin Kanta Pandey offered supportive comments on the Futures & Options (F&O) segment, assuring calibrated reforms and continued regulatory consultation.",
            "pubDate": "2025-11-07T10:25:32.455308"
        },
        {
            "title": "Shedding market myopia: Excessive QoQ focus can make you miss some multibaggers, says Gurmeet Chadha",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shedding-market-myopia-excessive-qoq-focus-can-make-you-miss-some-multibaggers-says-gurmeet-chadha/articleshow/125156085.cms",
            "description": "Market experts caution against overemphasizing quarter-on-quarter earnings, urging investors to look at long-term growth drivers in sectors like manufacturing and pharma, where firms are investing heavily in R&D, capacity expansion, and strategic acquisitions that may temporarily impact short-term profitability but build lasting value.",
            "pubDate": "2025-11-07T10:25:32.455481"
        },
        {
            "title": "AU Small Finance, UPL among 7 stocks that hit 52-week highs; gained up to 22% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-upl-among-7-stocks-that-hit-52-week-highs-gained-up-to-22-in-a-month/slideshow/125157896.cms",
            "description": "On Friday, the benchmark Sensex declined by around 95 points, closing at 83,216. Despite the market downturn, seven stocks from the BSE 200 Index reached their 52-week highs, marking their strongest levels in a year. Traders and investors often view such breakouts as bullish signals, suggesting strong upward momentum and the possibility of further gains ahead.",
            "pubDate": "2025-11-07T10:59:28.023982"
        },
        {
            "title": "Fab 7 isn’t a bubble: Ansid Capital’s Anurag Singh says big tech still has legs, but India needs a year of cooling off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fab-7-isnt-a-bubble-ansid-capitals-anurag-singh-says-big-tech-still-has-legs-but-india-needs-a-year-of-cooling-off/articleshow/125157325.cms",
            "description": "Anurag Singh of Ansid Capital says the AI-led “Fab 7” rally isn’t a bubble, though smaller speculative stocks show froth. He believes Indian markets need “another year of absorption” after a sharp rally, adding that moderation will strengthen long-term returns and investor resilience.",
            "pubDate": "2025-11-07T10:59:28.024110"
        },
        {
            "title": "PSU banks: A real comeback; is a basket or an individual stock the better option? 13 PSU banks, 8 with upside potential of up to 27%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/psu-banks-a-real-comeback-is-a-basket-or-an-individual-stock-the-better-option-13-psu-banks-8-with-upside-potential-of-up-to-27/articleshow/125158419.cms",
            "description": "When it comes to a change in a policy framework some things are inevitable. For instance, it brings both opportunities and complexity. Why opportunity? Because history tells us that policy changes in the past 10 years have brought in a new set of the winners. And complexity because when policy changes happen, it is not easy to figure out how to navigate them as they may impact some companies in the short term. There is a way to navigate this complexity and still make gains. But it is slightly different from the conventional way.",
            "pubDate": "2025-11-07T11:29:53.409035"
        },
        {
            "title": "Gainers & Losers: BSE, Vodafone and Ola among 7 stocks that hogged limelight on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-bse-vodafone-and-ola-among-7-stocks-that-hogged-limelight-on-friday/slideshow/125158394.cms",
            "description": "BSE, Vodafone and Ola among 7 stocks that hogged limelight on Friday. Here’s why",
            "pubDate": "2025-11-07T11:29:53.409154"
        },
        {
            "title": "Swiggy approves Rs 10,000 crore fundraise as quick-commerce battle with Zepto and Blinkit heats up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-board-approves-plans-to-raise-rs-10000-crore-via-qip/articleshow/125158184.cms",
            "description": "Swiggy’s Board has approved a fundraising plan of up to Rs 10,000 crore through public or private offerings, including QIP, to enhance its financial position and support growth initiatives. The company aims to use the proceeds to strengthen operations across food delivery and quick-commerce amid rising industry competition.",
            "pubDate": "2025-11-07T11:29:53.409246"
        },
        {
            "title": "US stocks set for weekly decline as concerns over economy, tech valuations weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-set-for-weekly-decline-as-concerns-over-economy-tech-valuations-weigh/articleshow/125163814.cms",
            "description": "Wall Street's main indexes opened lower on Friday, and were set for sharp weekly declines, as concerns about the economy and towering valuations in the technology sector soured sentiment.",
            "pubDate": "2025-11-07T14:53:32.372596"
        },
        {
            "title": "Sebi issues draft circular on pro-rata, pari-passu rights of AIF investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-issues-draft-circular-on-pro-rata-pari-passu-rights-of-aif-investors/articleshow/125163149.cms",
            "description": "Markets regulator Sebi on Friday came out with a draft circular to clarify operational aspects of maintaining pro-rata and pari-passu rights of investors in alternative investment funds (AIFs).",
            "pubDate": "2025-11-07T14:53:32.372719"
        },
        {
            "title": "8 stocks with rising EPS over four quarters. Are you missing out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-stocks-with-rising-eps-over-four-quarters-are-you-missing-out/slideshow/125160239.cms",
            "description": "Consistently increasing quarterly earnings per share (EPS) indicates that a company is improving its profitability over time. This trend suggests strong financial health, effective management strategies, and potential for sustainable growth. In the Nifty500 pack, nine companies have notably improved their EPS, showing increases for four consecutive quarters (till September'25 quarter) compared to the previous quarter, according to profitability scan data from StockEdge.com.",
            "pubDate": "2025-11-07T14:53:32.372820"
        },
        {
            "title": "Is gold price too high or is it still low? Aswath Damodaran finds out using 2 metrics",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-gold-price-too-high-or-is-it-still-low-aswath-damodaran-finds-out-using-2-metrics/articleshow/125162424.cms",
            "description": "Gold’s surge above $4,000 an ounce in 2025 could signal overvaluation, says NYU professor Aswath Damodaran. Comparing gold’s price to inflation and silver ratios, he argues it far exceeds historical medians, driven more by sentiment than fundamentals.",
            "pubDate": "2025-11-07T14:53:32.372918"
        },
        {
            "title": "PFC declares second interim dividend of Rs 3.65/share, sets Nov 26 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pfc-declares-second-interim-dividend-of-rs-3-65/share-sets-nov-26-as-record-date/articleshow/125161948.cms",
            "description": "Power Finance Corporation (PFC) has declared a second interim dividend of Rs 3.65 per share for FY26, with November 26 as the record date and payment by December 6. The PSU NBFC reported a 2% YoY rise in standalone net profit to Rs 4,462 crore for Q2FY26.",
            "pubDate": "2025-11-07T14:53:32.373016"
        },
        {
            "title": "HSBC sees India as way to diversify from crowded AI holdings, sets Sensex target at 94,000 by 2026 end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-sees-india-as-way-to-diversify-from-crowded-ai-holdings-sets-sensex-target-at-94000-by-2026-end/articleshow/125161606.cms",
            "description": "HSBC has reiterated its bullish outlook on India, setting a Sensex target of 94,000 by end-2026. The brokerage sees India as a key diversification play away from crowded AI trades, expecting earnings recovery in 2026 and improved valuations following recent market corrections.",
            "pubDate": "2025-11-07T14:53:32.373165"
        },
        {
            "title": "Fed Vice Chair Jefferson: Slow approach to cuts makes sense as policy rate approaches neutral",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-vice-chair-jefferson-slow-approach-to-cuts-makes-sense-as-policy-rate-approaches-neutral/articleshow/125164671.cms",
            "description": "The Federal Reserve should \"proceed slowly\" in approving further interest rate cuts as monetary policy moves closer to a neutral stance, Fed Vice Chair Philip Jefferson said on Friday.",
            "pubDate": "2025-11-07T15:31:15.189137"
        },
        {
            "title": "Jack Dorsey-led Block's shares fall 11% amid concerns over Square profitability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jack-dorsey-led-blocks-shares-fall-11-amid-concerns-over-square-profitability/articleshow/125164531.cms",
            "description": "Shares of fintech Block fell 11.1% on Friday, as investors balked at profit growth lagging volume increase at its payments unit, Square.",
            "pubDate": "2025-11-07T15:31:15.189247"
        },
        {
            "title": "Shipping Corporation declares Rs 3 per share dividend, sets Nov 19 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shipping-corporation-declares-rs-3-per-share-dividend-sets-nov-19-as-record-date/articleshow/125164885.cms",
            "description": "Shipping Corporation of India (SCI) announced a ₹3 per share interim dividend for FY26, with November 19 as the record date. Q2FY26 profit fell 35% YoY to ₹189 crore, while revenue declined 8% to ₹1,339 crore.",
            "pubDate": "2025-11-07T15:58:57.877254"
        }
    ]
}