{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-16T10:58:57.025346",
    "items": [
        {
            "title": "Can domestic formulations shield Indian pharma from US pricing pressure in Q3?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-domestic-formulations-shield-indian-pharma-from-us-pricing-pressure-in-q3/articleshow/126555072.cms",
            "description": "Indian drugmakers anticipate a mixed third quarter. Domestic sales and new specialty drugs will drive growth. US generics will see new product boosts. Contract services and APIs are set for moderate gains. Sun Pharma and Lupin are poised for leadership. Cipla and Dr Reddy's face softer US sales. Divi's Laboratories expects strong custom synthesis growth.",
            "pubDate": "2026-01-16T00:54:14.011661"
        },
        {
            "title": "Q3 results today: RIL, Wipro among 42 companies to report earnings on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-ril-wipro-among-42-companies-to-report-earnings-on-friday/articleshow/126556000.cms",
            "description": "Apart from these, companies such as JSW Infrastructure, Poonawalla Fincorp, Central Bank of India, JB Chemicals, Tata Technologies, Sobha, KPI Green will also report their quarterly numbers",
            "pubDate": "2026-01-16T03:58:06.956638"
        },
        {
            "title": "ICICI Bank Q3 preview: PAT growth seen up to 7.5% YoY, NII likely to rise 6–8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q3-preview-pat-growth-seen-up-to-7-5-yoy-nii-likely-to-rise-68/articleshow/126558278.cms",
            "description": "ICICI Bank is set to announce its Q3FY26 results, with analysts projecting a steady performance. Profit After Tax (PAT) growth is anticipated between 1% and 7% year-on-year, supported by healthy loan growth in retail and SME segments. Net Interest Income (NII) is expected to rise 6-8% YoY, while Net Interest Margins (NIMs) are forecast to remain stable around 4.3%",
            "pubDate": "2026-01-16T05:58:55.342315"
        },
        {
            "title": "Reliance Industries Q3 results today: What to expect and 5 key things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q3-results-today-what-to-expect-and-5-key-things-to-track/articleshow/126556915.cms",
            "description": "Reliance Industries is set to announce its Q3 results today, with analysts expecting a strong performance from its refining division, driven by higher diesel cracks and a weaker rupee. However, the retail segment faces headwinds from quick commerce losses and a consumption slowdown, while Jio's ARPU trajectory and petrochemical pain are key areas to watch.",
            "pubDate": "2026-01-16T05:58:55.342435"
        },
        {
            "title": "HDFC Bank Q3 preview: PAT growth seen up to 13% YoY, NII likely to rise 4-8%. Here’s what investors can expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q3-preview-pat-growth-seen-up-to-13-yoy-nii-likely-to-rise-4-8-heres-what-investors-can-expect/articleshow/126558714.cms",
            "description": "HDFC Bank is set to announce its Q3 earnings on January 17th, with analysts projecting a year-on-year net profit growth of up to 13%. Net Interest Income is expected to rise between 4-8%. Investors will be closely watching management commentary on deposit mobilization and margin trajectory for future performance insights.",
            "pubDate": "2026-01-16T06:38:11.461198"
        },
        {
            "title": "Tech Mahindra Q3 Results: Profit rises 14% YoY to Rs 1,122 crore, revenue up 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q3-results-profit-rises-14-to-rs-1122-crore-revenue-up-8/articleshow/126564084.cms",
            "description": "Tech Mahindra Q3 Results: Tech Mahindra reported a 14.1% year-on-year rise in December quarter consolidated profit to Rs 1,122 crore, with revenue climbing 8.3% to Rs 14,393 crore. The company saw a significant 47% year-on-year increase in new deal wins, reaching $1,096 million, highlighting strong momentum and sustained investments in AI-led offerings.",
            "pubDate": "2026-01-16T10:58:51.129998"
        },
        {
            "title": "Wipro Q3 Results: Profit falls 7% YoY to Rs 3,119 crore; co declares dividend of Rs 6 per share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wipro-q3-results-profit-falls-7-yoy-to-rs-3119-crore-co-declares-dividend-of-rs-6-per-share/articleshow/126563756.cms",
            "description": "Wipro’s Q3 results showed mixed performance, with net profit down 7% YoY to Rs 3,119 crore even as revenue rose 6%. Margins improved to 17.6%, cash flows strengthened, and attrition fell, but deal bookings remained weak. The company guided for flat to 2% sequential IT services growth.",
            "pubDate": "2026-01-16T10:58:51.130110"
        },
        {
            "title": "Federal Bank Q3 Results: Profit rises 9% YoY to Rs 1,041 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/federal-bank-q3-results-profit-rises-9-yoy-to-rs-1041-crore/articleshow/126563627.cms",
            "description": "Federal Bank announced a significant rise in its third-quarter net profit, reaching Rs 1,041 crore. This marks an improvement from the previous year's earnings. The bank's total income also saw an increase. Asset quality metrics showed positive movement with a reduction in gross and net non-performing assets.",
            "pubDate": "2026-01-16T10:58:51.130226"
        },
        {
            "title": "Central Bank of India Q3 Results: Profit jumps 32% YoY to Rs 1,263 crore as bad loans dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/central-bank-of-india-q3-results-profit-jumps-32-yoy-to-rs-1263-crore-as-bad-loans-dip/articleshow/126563503.cms",
            "description": "Total income increased to Rs 10,969 crore during the quarter under review against Rs 9,739 crore in the same period of last year, Central Bank of India said in a regulatory filing.",
            "pubDate": "2026-01-16T10:58:51.130322"
        },
        {
            "title": "Leela Palaces Hotels & Resorts Q3 Results: Consolidated net profit more than doubles to Rs 148 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/leela-palaces-hotels-resorts-consolidated-net-profit-more-than-doubles-to-rs-147-88-cr-in-q3/articleshow/126563476.cms",
            "description": "Leela Palaces Hotels & Resorts announced a significant profit increase for the third quarter. Net profit rose to Rs 147.88 crore from Rs 56.40 crore a year ago. Revenue from operations also saw a strong jump. The company noted an impact from new Labour Codes. This performance highlights the brand's luxury positioning and pricing power.",
            "pubDate": "2026-01-16T10:58:51.130424"
        }
    ]
}