{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-17T11:50:34.743818",
    "items": [
        {
            "title": "Should you buy the Swiggy stock because it’s cheaper than Zomato on a relative valuation basis? Learn how to make that decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/should-you-buy-the-swiggy-stock-because-its-cheaper-than-zomato-on-a-relative-valuation-basis-learn-how-to-make-that-decision/articleshow/115384723.cms",
            "description": "Valuation is a combination of numbers and narratives. But there is only one way to value – and multiple ways to evaluate. Join ETMarket’s four-day Value and Valuation workshop for a dive into value investing principles and its application in the real world.",
            "pubDate": "2024-11-17T11:50:16.852623"
        },
        {
            "title": "Ahead of Market: 10 things that will decide D-Street action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/115384165.cms",
            "description": "The Nifty index has formed a Doji candle near its 200-day exponential moving average (DEMA) support at 23,540, indicating uncertainty. Immediate support is at 23,500-23,540, with a break below 23,500 potentially targeting 23,300-23,200. While the short-term trend is down, a pullback rally remains possible if Nifty holds above 23,500, according to Hrishikesh Yedve of Asit C. Mehta Investment Intermediates.",
            "pubDate": "2024-11-17T11:50:16.852742"
        },
        {
            "title": "How to calculate P/E and CAPE Ratios to assess stock valuation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-calculate-p/e-and-cape-ratios-to-assess-stock-valuation/slideshow/115382151.cms",
            "description": "",
            "pubDate": "2024-11-17T11:50:16.852842"
        },
        {
            "title": "Tata Chemicals, RBL Bank among 10 midcap stocks that mutual funds bought and sold in October",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-chemicals-rbl-bank-among-10-midcap-stocks-that-mutual-funds-bought-and-sold-in-october/slideshow/115381037.cms",
            "description": "In October 2024, mutual funds made significant adjustments to their portfolios, adding and reducing holdings in several mid-cap stocks. Notable acquisitions included 360 One Wam, Tata Chemicals, and Angel One, while key reductions were seen in RBL Bank and CDSL. Here is a list of mid-cap stocks that mutual funds bought and sold in October, according to a report by Nuvama Institutional Equities:",
            "pubDate": "2024-11-17T11:50:16.852948"
        },
        {
            "title": "Market Trading Guide: Bajaj Holdings among top 3 stock recommendations for Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-bajaj-holdings-among-top-3-stock-recommendations-for-monday/slideshow/115379887.cms",
            "description": "Indian benchmark indices ended with declines on Thursday, marking their fifth consecutive fall. Today's decline was led by FMCG and pharma stocks, which wiped out earlier morning gains. While the S&P BSE Sensex fell by 110 points, or 0.14%, to close at 77,580, the broader Nifty dropped by 26 points, or 0.11%, to end at 23,532, amid concerns over foreign outflows.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities, said that the Nifty closed near its 200-day EMA, forming a gravestone doji-like pattern on the daily chart, signaling bearish sentiment. \"This suggests a 'sell on rise' approach, as the index hovers in an oversold zone near a key EMA level. A bounce is likely, but it should be seen as an opportunity to sell. If Nifty breaks below the 200-day EMA, selling pressure could intensify. The index has support at 23,450, with resistance expected at 23,650, framing the short-term trading range,\" De said.Here are 3 stock recommendations for Monday:",
            "pubDate": "2024-11-17T11:50:16.853051"
        },
        {
            "title": "​Adani Ports, IndusInd Bank among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-ports-indusind-bank-among-5-stocks-with-short-buildup/slideshow/115378580.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of the underlying stock in the Futures and Options segment. This indicates that more traders expect prices to decline and are creating short positions. In Thursday's trading session, five stocks saw fresh short positions being built. Here's the list:",
            "pubDate": "2024-11-17T11:50:16.853146"
        },
        {
            "title": "Ramco Cements, Oberoi Realty among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ramco-cements-oberoi-realty-among-5-stocks-with-long-buildup/slideshow/115378493.cms",
            "description": "A long buildup occurs when open interest and trading volumes increase alongside a rise in the underlying stock price in the Futures and Options segment, signaling a bullish market trend. In Thursday's trading session, five stocks saw fresh long positions. Here’s the list:",
            "pubDate": "2024-11-17T11:50:16.853241"
        },
        {
            "title": "8 of top 10 most-valued firms lose nearly Rs 2 lakh crore in m-cap",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-of-top-10-most-valued-firms-lose-nearly-rs-2-lakh-crore-in-m-cap/articleshow/115377842.cms",
            "description": "\"Mounting concerns over rising CPI inflation and persistent disappointments in corporate earnings weighed heavily on sentiment,\" Ajit Mishra - SVP, Research, Religare Broking Ltd, said.",
            "pubDate": "2024-11-17T11:50:16.853338"
        },
        {
            "title": "Maharashtra election, FII flows and 5 more factors to likely impact stock markets this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/maharashtra-election-fii-flows-and-5-more-factors-to-likely-impact-stock-markets-this-week/articleshow/115377422.cms",
            "description": "The Indian equity market experienced a loss exceeding 2.5% last week due to declining earnings and foreign outflows.  Market movements this week will likely be influenced by the Maharashtra election, foreign investor activity, rising bond yields, and global market trends.  Several new IPOs and listings are also on the horizon.",
            "pubDate": "2024-11-17T11:50:16.853432"
        },
        {
            "title": "Part A conventional, Part B unconventional: Dividend yield & capital gains. 5 stocks with dividend yield of 5-8% & upside potential of up to 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/part-a-conventional-part-b-unconventional-dividend-yield-capital-gains-5-stocks-with-dividend-yield-of-5-8-upside-potential-of-up-to-35/articleshow/115376508.cms",
            "description": "There are many MF schemes – maybe not those headed by star fund managers – whose stated objective at the time of the new fund offering (NFO) is clear: To invest in stocks with a certain dividend yield. In a bull market, these MFs may find it difficult to buy such stocks. But as soon as the bears arrive, they not only find the opportunity to do so, but also become bottom makers. Now, bottom makers are buyers who ensure that a stock does not fall below a certain level – in this case, these MFs buy some stocks when they fall to a certain level. Because, at that level, dividend yield becomes reason enough to buy them. Two months back it was tough to find a stock with a dividend yield matching the interest rate of a savings bank account. Today there are some matching rates offered by fixed deposits. But they come with more than the usual caveats.",
            "pubDate": "2024-11-17T11:50:16.853523"
        },
        {
            "title": "Breakout Stocks: How to trade JSW Holdings and HCL Technologies on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-jsw-holdings-and-hcl-technologies-on-monday/slideshow/115376738.cms",
            "description": "The Indian market remained volatile throughout Thursday's trading session. The BSE Sensex fell by more than 100 points, while the Nifty50 closed above the 23,500 level.",
            "pubDate": "2024-11-17T11:50:16.853615"
        },
        {
            "title": "These 7 penny stocks slipped 10-25% in a week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-penny-stocks-slipped-10-25-in-a-week/slideshow/115376517.cms",
            "description": "In the week ending November 14, the benchmark Sensex index recorded a weekly decline of around 2.4%. During this downturn, seven penny stocks experienced sharp drops ranging from 10% to 25%. Our selection criteria focused on stocks with a market capitalization below Rs 1,000 crore, a share price under Rs 20, and a minimum trading volume of 5 lakh shares. (Data Source: ACE Equity)",
            "pubDate": "2024-11-17T11:50:16.853705"
        },
        {
            "title": "Focus on owning the correct business, corrections will not matter. 9 basic principles of investing in small- and mid-cap stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/focus-on-owning-the-correct-business-corrections-will-not-matter-9-basic-principles-of-investing-in-small-and-mid-cap-stocks/articleshow/115367385.cms",
            "description": "All segments of the market have witnessed a decline in the last eight weeks. The whole street is talking about FII selling and its impact – and whether or not it is over. It is not the first time – nor will it be the last – that such corrections have taken place. Just this year, in March, market breadth suffered a lot, though at that time the cut in the Nifty and Sensex was lesser than what it has been this time. As an investor, your focus has to be on owning the correct business – and not corrections. Now, what is a “correct business”? Simple: One with a track record of growth; a company that does not require constant doses of capital; and where not only is income generated, it is shared with minority investors as dividends. The other important thing: Stick to the nine basic principles of investing.",
            "pubDate": "2024-11-17T11:50:16.853792"
        },
        {
            "title": "A better way to handle volatility, have advantage of a strong parent: 4 large-cap stocks with an upside potential up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-better-way-to-handle-volatility-have-advantage-of-a-strong-parent-4-large-cap-stocks-with-an-upside-potential-up-to-39/articleshow/115360560.cms",
            "description": "Just a couple of months back, an industrial house issued an IPO for one of its group companies. It was heavily oversubscribed. The listing was at a premium, and there was a mad rush to buy the stock. The reason: The group has a track record of corporate governance and wealth creation. Today, in a volatile, falling market, that stock has corrected sharply and is available much cheaper. All talk of big industry and promoters with a track record seems to have vanished just because the Nifty and Sensex are falling. So treat this overall market correction as an opportunity to own a good business with great management. We take a look at four stocks where business is good, promoters have a track record, and the only thing which appears bad is market conditions.",
            "pubDate": "2024-11-17T11:50:16.853878"
        },
        {
            "title": "FPIs pull out Rs 22,400 crore so far in November, selling pressure continues",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-pull-out-rs-22400-crore-so-far-in-november-selling-pressure-continues/articleshow/115359151.cms",
            "description": "FPIs have continued their bearish stance on Indian markets in November, pulling out Rs 22,420 crore. While they sold Rs 32,351 crore in the secondary market, they invested Rs 9,931 crore in the primary market. FPIs have also turned cautious on Indian debt markets, with outflows reaching Rs 4,717 crore.",
            "pubDate": "2024-11-17T11:50:16.853972"
        },
        {
            "title": "Markets weak; caution advised amid potential rebound and selling pressure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-weak-caution-advised-amid-potential-rebound-and-selling-pressure/articleshow/115359019.cms",
            "description": "The market is currently in a weak undercurrent, with a potential for a technical rebound. However, sustained selling pressure cannot be ruled out. The market breadth remains weak, and leveraged exposures should be curtailed. A cautious approach is advised for the coming week.",
            "pubDate": "2024-11-17T11:50:16.854059"
        }
    ]
}