{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-26T04:19:05.497905",
    "items": [
        {
            "title": "Asian stocks to slip as inflation clouds Fed cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-to-slip-as-inflation-clouds-fed-cuts/articleshow/123513626.cms",
            "description": "Asian equities are poised to decline, mirroring Wall Street's downturn, as investors await a crucial US inflation report that could influence the Federal Reserve's rate cut decisions. Concerns linger about the pace of potential rate reductions amid mixed signals from the labor market and persistent inflation.",
            "pubDate": "2025-08-26T01:25:48.133208"
        },
        {
            "title": "Stocks in news: Vodafone Idea, Sai Life, BPCL, IndusInd Bank, IREDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vodafone-idea-sai-life-bpcl-indusind-bank-ireda/articleshow/123507341.cms",
            "description": "Markets opened positively, fueled by global cues, with several companies in focus due to significant developments. Protean eGov Technologies secured a substantial order from UIDAI, while TGP Asia plans to sell a stake in Sai Life Sciences.",
            "pubDate": "2025-08-26T01:25:48.133333"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123507389.cms",
            "description": "Indian equity markets began the week with gains, buoyed by positive global cues. Analysts suggest focusing on thematic movers for better performance, advising traders to be cautious in Bank Nifty, awaiting bullish reversal confirmation. Meanwhile, India VIX edged up, and the rupee weakened slightly against the dollar, influenced by a strong US currency and rising crude oil prices.",
            "pubDate": "2025-08-26T01:25:48.133446"
        },
        {
            "title": "TPG beats Advent to emerge frontrunner for Tessolve stake; to invest $140–150 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tpg-in-advanced-talks-to-invest-140150-million-in-hero-electronix-backed-tessolve/articleshow/123513559.cms",
            "description": "TPG Inc. is leading the race to acquire a significant minority stake in Tessolve, a semiconductor design and engineering company primarily owned by Hero Electronix. TPG's growth fund has entered into an exclusivity agreement with Tessolve for final negotiations, surpassing Advent International's bid, valuing Tessolve at $475-500 million.",
            "pubDate": "2025-08-26T01:25:48.133545"
        },
        {
            "title": "Rajiv Anand takes charge as MD & CEO of IndusInd Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rajiv-anand-takes-charge-as-md-ceo-of-indusind-bank/articleshow/123513334.cms",
            "description": "Rajiv Anand has officially taken over as the MD & CEO of IndusInd Bank, commencing his three-year term that extends until August 2028. Following his appointment, the previously established 'Committee of Executives' and the 'Oversight Committee of the Board' have been dissolved, marking a new chapter for the bank's leadership.",
            "pubDate": "2025-08-26T01:25:48.133650"
        },
        {
            "title": "FPIs continue to sell in August, financial & IT stocks take biggest hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-continue-to-sell-in-august-financial-it-stocks-take-biggest-hit/articleshow/123513277.cms",
            "description": "Foreign fund managers increased selling of Indian equities in early August due to tariff concerns, a weak rupee, and poor corporate earnings. Financial services and IT stocks experienced the most significant selling pressure. Investors offloaded shares worth ₹34,022 crore across various sectors, driven by muted earnings expectations and uncertainty surrounding India-US relations, impacting market sentiment.",
            "pubDate": "2025-08-26T01:25:48.133752"
        },
        {
            "title": "SBI chief advocates for regulatory changes to boost corporate M&A",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-chief-advocates-for-regulatory-changes-to-boost-corporate-ma/articleshow/123513222.cms",
            "description": "SBI Chairman CS Setty advocates for regulatory flexibility, urging the RBI to allow local lenders to fund corporate M&As, particularly for listed companies with transparent shareholder approvals. This comes amid discussions on evolving corporate credit trends, with banks shifting towards short-term working capital.",
            "pubDate": "2025-08-26T01:25:48.133850"
        },
        {
            "title": "Top IT services stocks offer 10-15% upside, says Investec",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investec-upgrades-it-services-stocks-with-10-15-return-potential/articleshow/123513149.cms",
            "description": "Investec reports an improved risk-reward scenario for most IT services stocks, projecting potential one-year returns exceeding 10-15%. The brokerage upgraded Infosys to 'Buy' with a target price of ₹1,655, anticipating an 8% gain. Tech Mahindra, Infosys, and TCS are favored among larger stocks, while Mphasis, Zensar, and KPIT are preferred in the mid-sized category.",
            "pubDate": "2025-08-26T01:25:48.133947"
        },
        {
            "title": "Chinese stocks euphoria spreads as turnover tops $430 billion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinese-stocks-euphoria-spreads-as-turnover-tops-430-billion/articleshow/123513097.cms",
            "description": "Chinese stocks surged again, fueled by abundant liquidity and optimism surrounding DeepSeek's updated model. The rally, led by technology shares, broadened to include property stocks after Shanghai eased home-buying rules. While some see room for further gains, concerns about overheating are emerging as key benchmarks rise significantly from their lows, with investors closely monitoring liquidity indicators.",
            "pubDate": "2025-08-26T01:25:48.134040"
        },
        {
            "title": "Stock Radar: July breakout level holding firm for Aadhar Housing Finance; check for target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-july-breakout-level-holding-firm-for-aadhar-housing-finance-check-for-target-stop-loss/articleshow/123500194.cms",
            "description": "Aadhar Housing Finance Ltd, after a period of consolidation, is showing signs of a rebound following a retest of breakout levels from July. Experts suggest short-term traders consider buying the stock, targeting a price of Rs 560 in the near term. The stock's recent performance and technical indicators point towards renewed positive momentum.",
            "pubDate": "2025-08-26T01:25:48.134139"
        },
        {
            "title": "Seize the opportunity, invest boldly: RBI Guv Sanjay Malhotra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/seize-the-opportunity-invest-boldly-rbi-guv-sanjay-malhotra/articleshow/123513372.cms",
            "description": "\"Financial stability and price stability do not inhibit growth. Far from it. They are essential for sustainable growth. I look forward to working together with the regulated entities, to improve the efficiency and effectiveness of our financial intermediation, to ensure that the due benefits reach the people of our nation,\" RBI Guv Sanjay Malhotra said.",
            "pubDate": "2025-08-26T01:25:48.134262"
        },
        {
            "title": "Grihum Housing Finance set to name ex-Citi banker MD, CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grihum-housing-finance-set-to-name-ex-citi-banker-md-ceo/articleshow/123513383.cms",
            "description": "In a notice to stock exchanges on August 21, Grihum Housing Finance had announced that its current MD & CEO Manish Jaiswal will step down with effect from August 31. Jaiswal will continue as an advisor to the board until December 31. The company had said it would identify a suitable candidate for the top post in due course.",
            "pubDate": "2025-08-26T01:25:48.134361"
        },
        {
            "title": "Protean eGov Technologies shares in focus after bagging Rs 1,160 crore Aadhaar services work order from UIDAI",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/protean-egov-technologies-shares-in-focus-after-bagging-rs-1160-crore-aadhaar-services-work-order-from-uidai/articleshow/123515900.cms",
            "description": "Protean eGov Technologies share price:  The UIDAI, under the Ministry of Electronics and Information Technology, has awarded a contract to Protean eGov Technologies for setting up and managing Aadhaar Seva Kendras across 188 districts in the country. These centres will provide citizens with Aadhaar enrolment, demographic and biometric updates, and other related services.",
            "pubDate": "2025-08-26T03:56:18.540615"
        },
        {
            "title": "YES Bank shares down 20% in 1 year. Can RBI’s nod to SMBC deal push the stock towards Rs 23?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-down-20-in-1-year-can-rbis-nod-to-smbc-deal-push-the-stock-towards-rs-23/articleshow/123515805.cms",
            "description": "YES Bank shares show recovery signs after RBI approved Sumitomo Mitsui Banking Corporation's stake purchase. While the deal is expected to bring capital infusion and expertise, analysts remain cautiously optimistic, citing structural challenges and resistance levels. Technical indicators suggest a potential upside, but broader trends and regulatory conditions warrant careful consideration for investors.",
            "pubDate": "2025-08-26T03:56:18.540744"
        },
        {
            "title": "Delhivery, SBI Cards, Angel One among 7 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/delhivery-sbi-cards-angel-one-among-7-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123515659.cms",
            "description": "There was a notable surge in futures open interest (OI) for seven stocks in the NSE F&O pack, with total OI rising over 7% on August 27 compared to the previous session. A sharp rise in futures OI indicates a significant increase in active, unexpired contracts of a particular security. This trend reflects growing participation in the market, as traders either initiate fresh positions or expand their existing ones in the futures segment.",
            "pubDate": "2025-08-26T03:56:18.540848"
        },
        {
            "title": "Stock Market Holiday 2025: Are NSE, BSE open or closed on August 27 for Ganesh Chaturthi 2025? Check now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-2025-are-nse-bse-open-or-closed-on-august-27-for-ganesh-chaturthi-2025-check-now/articleshow/123515717.cms",
            "description": "Indian stock and commodity markets will be closed on August 27, 2025, for Ganesh Chaturthi. Trading on BSE and NSE will halt, including equities and derivatives. MCX will have limited hours. NCDEX will be fully closed. Markets will reopen on August 28. More holidays are scheduled for October, November and December. Market participants will monitor global cues during the break.",
            "pubDate": "2025-08-26T03:56:18.540945"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Cohance Lifesciences, Divi’s Lab among 5 stocks that could give 10-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-cohance-lifesciences-divis-lab-among-5-stocks-that-could-give-10-30-return/slideshow/123515264.cms",
            "description": "Brokerages remain upbeat on select stocks across sectors, rolling out fresh Buy calls with healthy upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-26T03:56:18.541050"
        },
        {
            "title": "At multi-year highs: Maruti Suzuki, Apollo Micro among 10 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-maruti-suzuki-apollo-micro-among-10-stocks-witness-5-year-swing-high-breakout/slideshow/123515136.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, 10 stocks witnessed a 5-year swing high at the close on August 25, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-08-26T03:56:18.541153"
        },
        {
            "title": "Infosys, Wipro, TCS and 6 other Nifty stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-tcs-and-6-other-nifty-stocks-showing-rsi-trending-up/slideshow/123514990.cms",
            "description": "Nine stocks from the Nifty50 pack were highlighted in the RSI Trending Up scan on August 25, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-08-26T03:56:18.541255"
        },
        {
            "title": "Last day to buy shares of 13 companies to qualify for dividends as Aug 27 record date approaches",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-shares-of-13-companies-to-qualify-for-dividends-as-aug-27-record-date-approaches/articleshow/123514746.cms",
            "description": "Investors seeking dividend income should purchase shares by August 26 to qualify for payouts from companies like Procter & Gamble Hygiene, Vedant Fashions, and Jyothy Labs. These firms, along with others such as Gujarat Pipavav Port and Route Mobile, have set August 27 as the record date for dividend eligibility.",
            "pubDate": "2025-08-26T03:56:18.541355"
        },
        {
            "title": "Positive Breakout: These 10 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-close-cross-above-their-200-dmas/slideshow/123514707.cms",
            "description": "The closing price of 10 stocks from the Nifty500 pack crossed above their 200 DMA (Daily Moving Averages) on August 25, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-08-26T03:56:18.541449"
        },
        {
            "title": "LGT Business Connextions shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lgt-business-connextions-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/123514554.cms",
            "description": "LGT Business Connextions Ltd. is set to debut on the BSE SME platform on Tuesday, August 26, with expectations of a flat listing as its grey market premium remains at the issue price of Rs 107. The IPO, which closed on August 21 and was subscribed 1.25 times, aims to utilize the Rs 28.",
            "pubDate": "2025-08-26T03:56:18.541541"
        },
        {
            "title": "HDFC Bank shares in focus as stock to trade ex-bonus for 1:1 issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-in-focus-as-stock-to-trade-ex-bonus-for-11-issue/articleshow/123514532.cms",
            "description": "HDFC Bank's shares are in focus as August 26 marks the record date for its first-ever 1:1 bonus share issue. Investors holding the stock on Monday qualify to receive one additional share for each share owned. This move signals management's confidence and rewards investors, following a Q1FY26 report of a 12% year-on-year standalone net profit growth to ₹18,155 crore.",
            "pubDate": "2025-08-26T03:56:18.541670"
        },
        {
            "title": "Indian stocks struggles to shake off pessimism ahead of tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-stocks-struggles-to-shake-off-pessimism-ahead-of-tariffs/articleshow/123514287.cms",
            "description": "Indian equities are expected to continue underperforming emerging markets due to escalating trade tensions with the US, including a new 25% tariff on Indian imports, bringing the cumulative levies to 50%.",
            "pubDate": "2025-08-26T03:56:18.541765"
        },
        {
            "title": "Wall Street ends down as traders focus on Nvidia, Fed after last week's rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-down-as-traders-focus-on-nvidia-fed-after-last-weeks-rally/articleshow/123514304.cms",
            "description": "Wall Street experienced a downturn on Monday as investors analyzed the U.S. interest rate outlook and awaited Nvidia's earnings report. Friday's rally, fueled by hints of a potential rate cut from the Federal Reserve, gave way to cautious trading. Upcoming inflation and jobs data are crucial, influencing expectations for Fed action.",
            "pubDate": "2025-08-26T03:56:18.541854"
        },
        {
            "title": "Asian Energy, Megasoft among 6 stocks with White Marubozu Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-energy-megasoft-among-6-stocks-with-white-marubozu-pattern/slideshow/123516440.cms",
            "description": "On August 25, six stocks with a market cap of over Rs 1,000 crore appeared on the NSE’s bullish “White Marubozu” scanner, according to StockEdge’s technical scan data.A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest and the closing price is the highest for a given period. Represented by a long white (or green) candlestick with no upper shadow and little to no lower shadow, it signals strong buying pressure throughout the session, indicating that buyers were in control from start to finish. Traders often view this as a potential indicator of further upside.",
            "pubDate": "2025-08-26T04:18:58.568566"
        },
        {
            "title": "GST reforms, RBI support to cushion India’s growth risks: Rob Subbaraman",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-reforms-rbi-support-to-cushion-indias-growth-risks-rob-subbaraman/articleshow/123516270.cms",
            "description": "Jerome Powell's recent remarks at the Jackson Hole Symposium have fueled market expectations of a U.S. Federal Reserve rate cut in September. While Nomura anticipates three cuts, they foresee a more cautious approach than markets predict. India faces potential tariff hikes from the U.S., but proactive policy responses are expected to mitigate the impact.",
            "pubDate": "2025-08-26T04:18:58.568693"
        },
        {
            "title": "Vodafone Idea shares slide 7% after Centre rules out further AGR relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-after-centre-rules-out-further-agr-relief/articleshow/123516200.cms",
            "description": "Vodafone Idea share price: The government has ruled out additional AGR relief for Vodafone Idea. The Centre clarified that no further concessions are planned beyond past equity conversions, leaving the telco’s Rs 75,000 crore liability and post-moratorium repayments a key concern for investors.",
            "pubDate": "2025-08-26T04:18:58.568801"
        },
        {
            "title": "Cantor initiates coverage on Ambuja Cements with 'Overweight' rating, sets target price at Rs 745",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cantor-initiates-coverage-on-ambuja-cements-with-overweight-rating-sets-target-price-at-rs-745/articleshow/123516147.cms",
            "description": "Global brokerage Cantor has initiated coverage on Ambuja Cements with an ‘Overweight’ rating and a target price of Rs 745, implying 28% upside. The firm cites Ambuja’s capacity expansion, cost efficiencies, and premium products as key drivers of growth and valuation re-rating potential.",
            "pubDate": "2025-08-26T04:18:58.568905"
        },
        {
            "title": "Sai Life Sciences shares in focus as TPG Asia likely to sell Rs 2,500 crore worth shares via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sai-life-sciences-shares-in-focus-as-tpg-asia-likely-to-sell-rs-2500-crore-worth-shares-via-block-deal/articleshow/123516100.cms",
            "description": "Sai Life Sciences is set to be in focus as TPG Asia prepares to exit its entire 14.72% stake via a Rs 2,500 crore block deal at a floor price of Rs 860 per share, a 5% discount to Monday’s close. The Hyderabad-based CRDMO has seen strong earnings growth, margin improvement, and steady share price gains in recent months.",
            "pubDate": "2025-08-26T04:18:58.569020"
        },
        {
            "title": "Sensex tumbles over 600 pts, Nifty below 24,800 after U.S. moves to levy steep tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-tumbles-over-500-pts-nifty-below-24800-after-u-s-moves-to-levy-steep-tariffs/articleshow/123515750.cms",
            "description": "Indian benchmark indices Sensex and Nifty experienced a downturn at the opening on Tuesday. This decline was triggered by concerns regarding potential U.S. trade measures, specifically the proposed tariffs of up to 50% on Indian goods.",
            "pubDate": "2025-08-26T04:18:58.569121"
        },
        {
            "title": "PTC Industries, eClerx Services among 7 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ptc-industries-eclerx-services-among-7-stocks-closed-crossing-above-vwap/slideshow/123516061.cms",
            "description": "The closing prices of seven stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on August 25, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-26T04:18:58.569221"
        }
    ]
}