{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-06T10:56:16.875288",
    "items": [
        {
            "title": "Indian equities can recover on slightest indication of pause in FII outflows, says Motilal Oswal. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-equities-can-recover-on-slightest-indication-of-pause-in-fii-outflows-says-motilal-oswal-heres-why/articleshow/124337843.cms",
            "description": "A halt in foreign outflows could spark a rebound in Indian equities, Motilal Oswal said in its October 6 report. The brokerage expects improving corporate earnings, robust domestic inflows, and pro-growth government policies to attract overseas investors back. After a year of underperformance, India’s more attractive valuations may further drive a reversal in foreign investment trends.",
            "pubDate": "2025-10-06T10:55:55.961703"
        },
        {
            "title": "Market Wrap: Sensex rallies 580 points, Nifty tops 25,000 as banks surge on solid loan growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-rallies-580-points-nifty-tops-25000-as-banks-surge-on-solid-loan-growth/articleshow/124337192.cms",
            "description": "Indian equity benchmarks Sensex and Nifty closed higher on Monday, driven by banking and financial heavyweights after lenders posted strong quarterly loan growth, while IT stocks gained ground ahead of the upcoming earnings releases.",
            "pubDate": "2025-10-06T10:55:55.961828"
        },
        {
            "title": "These 8 FII-backed debt-free smallcaps rally up to 70% in FY26. Are you missing out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-8-fii-backed-debt-free-smallcaps-rally-up-to-70-in-fy26-are-you-missing-out/slideshow/124335957.cms",
            "description": "In smallcap investing, a clean, debt-free balance sheet often stands out, providing financial flexibility, lower risk, and stronger investor confidence. Filtering BSE smallcaps (excluding banking/finance) with net profits above Rs 100 crore in FY25, we identified 96 debt-free companies. Focusing further on firms where Foreign Institutional Investors (FIIs) increased their stake in Q1 FY26 narrows the list to 54 promising stocks. In FY26 so far, 34 of these stocks have delivered double-digit gains, with 8 standout performers surging 40–70% in just six months. While the combination of zero debt and FII backing is attractive, investors must carefully evaluate fundamentals, growth prospects, and market dynamics before investing.",
            "pubDate": "2025-10-06T10:55:55.961938"
        },
        {
            "title": "Ramesh Damani, Aashish Somaiyaa invest in Zerodha's competitor Dhan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ramesh-damani-aashish-somaiyaa-invest-in-zerodhas-competitor-dhan/articleshow/124336731.cms",
            "description": "Stock-trading startup Dhan raised $120 million at a $1.2 billion valuation, attracting marquee investors including Ramesh Damani and Aashish Somaiyaa. Led by Hornbill Capital, the funding will support expansion, diversification, and AI innovation. Despite regulatory headwinds, Dhan has boosted active trader share and quadrupled volumes since FY23.",
            "pubDate": "2025-10-06T10:55:55.962042"
        },
        {
            "title": "Indian Bank, Canara Bank jump 40% in FY26. Are PSU bank stocks set for a golden comeback?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-bank-canara-bank-jump-40-in-fy26-are-psu-bank-stocks-set-for-a-golden-comeback/articleshow/124336126.cms",
            "description": "Public sector banks have staged a major comeback in FY26, with the Nifty PSU Bank Index soaring 20% in six months. Indian Bank and Canara Bank lead gains, each up nearly 41%. Analysts see PSU lenders outperforming private peers as profits, RoA, and credit growth improve.",
            "pubDate": "2025-10-06T10:55:55.962144"
        },
        {
            "title": "KIOCL shares soar 19%, extend three-session rally to 48%; exchanges seek clarification on unusual volume spike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kiocl-shares-soar-19-extend-three-session-rally-to-48-exchanges-seek-clarification-on-unusual-volume-spike/articleshow/124336051.cms",
            "description": "KIOCL shares soared 19% to a 52-week high of Rs 629.30 amid heavy volumes, prompting exchanges to seek clarification. The PSU stock has jumped nearly 48% in three sessions, delivering over 230% returns in three years despite weak Q1 results and volatility concerns.",
            "pubDate": "2025-10-06T10:55:55.962268"
        },
        {
            "title": "BSE shares rally 5% as IIFL assigns Rs 2,300 target on softer than feared expiry swap impact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-rally-5-as-iifl-assigns-rs-2300-target-on-softer-than-feared-expiry-swap-impact/articleshow/124335244.cms",
            "description": "Shares of BSE Ltd rose sharply on Monday after IIFL noted that the expiry day swap impact was softer than expected. Strong derivatives activity and resilient market share support the rally, with IIFL maintaining an “Add” rating and a target of Rs 2,300.",
            "pubDate": "2025-10-06T10:55:55.962372"
        },
        {
            "title": "Q2 preview: Coforge set to lead IT earnings as mid-tier firms outshine largecaps; 8 stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-preview-coforge-set-to-lead-it-earnings-as-mid-tier-firms-outshine-largecaps-8-stocks-to-buy/articleshow/124334348.cms",
            "description": "Mid-tier IT firms like Coforge, Persistent, Mphasis, and Hexaware are expected to drive Q2FY26 revenue growth, outperforming largecaps amid macro headwinds and pricing pressures. The challenges faced by the industry have reflected in the share prices which have fallen up to 19% in three months. But Motilal Oswal and Nuvama highlight opportunities in mid-tier and select largecap IT stocks for medium-to-long-term gains.",
            "pubDate": "2025-10-06T10:55:55.962467"
        },
        {
            "title": "Netweb Technologies shares soar 19% in a week. 5 factors driving the rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-shares-soar-19-in-a-week-5-factors-driving-the-rally/articleshow/124333782.cms",
            "description": "Netweb Technologies shares surged 19%, hitting a 52-week high on robust AI infrastructure order wins, cloud adoption tailwinds, expansion initiatives, strong technical momentum, and rising profitability, attracting investor attention in tech.",
            "pubDate": "2025-10-06T10:55:55.962570"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 23% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-23-in-1-year/articleshow/124333198.cms",
            "description": "We are going with the assumption that recent reforms, both GST and banking, make a fresh case for being bullish on India. But with valuations still high, the probability of volatility hitting the street is high. Also, the global situation could get bearish. Though no one is talking about it now, the increasing cost of goods in the US may well become the talk of the street soon. If that happens, one cannot rule out more damage to stock prices. In such times, if you are investing in the market, ensure you target quality stocks where the business and fundamentals are sound.",
            "pubDate": "2025-10-06T10:55:55.962667"
        },
        {
            "title": "TruAlt Bioenergy shares slip 7% in 2 trading sessions after market debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trualt-bioenergy-shares-slip-7-in-2-trading-sessions-after-market-debut/articleshow/124332549.cms",
            "description": "TruAlt Bioenergy shares slipped 6.7% in two sessions after listing, as early investors booked profits. Despite strong FY25 growth—54% revenue rise, fivefold net profit surge—valuations remain steep at 29x earnings. Analysts suggest partial profit booking amid robust renewable energy demand.",
            "pubDate": "2025-10-06T10:55:55.962765"
        },
        {
            "title": "Top stock ideas this week: Tata Motors, Vodafone among 7 picks offering up to 41% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-stock-ideas-this-week-tata-motors-vodafone-among-7-picks-offering-up-to-41-gains/slideshow/124331957.cms",
            "description": "Nifty closed the previous week with a 1% gain, supported by rallies over the last two sessions. Asit C. Mehta investment expert Hrishikesh Yedve notes the formation of a bullish candle near the 100-DEMA of 24,747, signalling strength. He cautions about resistance around 24,915, as the index remains below the 21-DEMA. With stock-specific action likely to dominate, ETMarkets has compiled seven technical and fundamental picks for potential upside of up to 41%.",
            "pubDate": "2025-10-06T10:55:55.962860"
        },
        {
            "title": "Kotak Mahindra Bank shares jump 2% after Q2 updates impress investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-jump-2-after-q2-updates-impress-investors/articleshow/124331739.cms",
            "description": "Kotak Mahindra Bank shares: The stock rose after strong provisional Q2 FY26 results. The bank reported a 14.4% YoY rise in average total deposits to Rs 5,10,138 crore and a sequential increase of 3.7% from the June quarter. Total deposits at quarter-end stood at Rs 5,28,776 crore, up 14.6% YoY, reflecting robust operational strength and continued customer trust.",
            "pubDate": "2025-10-06T10:55:55.962956"
        },
        {
            "title": "Yes Bank shares up 4% in 1 week as Q2 metrics impress. What’s next?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-up-4-in-1-week-as-q2-metrics-impress-whats-next/articleshow/124331680.cms",
            "description": "Shares of Yes Bank rose over the past week, supported by strong quarterly loan growth, improved CASA ratios, and investor interest after a strategic stake sale to Sumitomo Mitsui Banking Corporation. Provisional Q2 updates show robust growth in advances and deposits, while technical indicators point to a sustained bullish trend.",
            "pubDate": "2025-10-06T10:55:55.963051"
        },
        {
            "title": "Q2 earnings beginning this week to be modest but 3 themes can make money: Motilal Oswal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-earnings-beginning-this-week-to-be-modest-but-3-themes-can-make-money-motilal-oswal/articleshow/124331652.cms",
            "description": "Q2 earnings, starting October 9, are expected to show modest 6% YoY growth for Nifty companies. Motilal Oswal highlights three investment themes—financials vs IT divergence, consumption revival, and new-age sectors—and recommends top large- and mid-cap stocks in autos, healthcare, BFSI, and technology for potential gains.",
            "pubDate": "2025-10-06T10:55:55.963152"
        },
        {
            "title": "Kalyan Jewellers shares drop despite strong festive demand, driving 30% revenue growth in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-jewellers-shares-drop-despite-strong-festive-demand-driving-30-revenue-growth-in-q2/articleshow/124331612.cms",
            "description": "Kalyan Jewellers shares: The stock dropped despite a strong Q2 FY26 performance. The company’s consolidated revenue rose about 30% YoY, driven by festive buying and strong market traction. India operations grew 31% YoY, supported by robust wedding demand and early festive sales, including Navratri. Same-store sales increased roughly 16%, reflecting steady underlying demand.",
            "pubDate": "2025-10-06T10:55:55.963267"
        }
    ]
}