{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-28T04:53:40.513263",
    "items": [
        {
            "title": "These 10 penny stocks plunged up to 55% in just a month — Are you affected?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-penny-stocks-plunged-up-to-55-in-just-a-month-are-you-affected/slideshow/124190659.cms",
            "description": "In the past month, 10 penny stocks have witnessed steep declines, shedding between 25% and 55% of their value. These underperformers were identified using a targeted screening approach, focusing on stocks with a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum recent trading volume of 5 lakh shares. This strategy is designed to highlight low-priced, actively traded penny stocks that have experienced notable downside. (Data Source: ACE Equity)Although penny stocks often attract investors with their low entry prices and potential for rapid gains, they come with substantial risks. Due to low liquidity, high volatility, and limited transparency, they are prone to manipulation and sudden drops. Without a clear strategy and strong risk controls, investors may face more losses than gains.",
            "pubDate": "2025-09-28T04:53:37.644429"
        },
        {
            "title": "September IPO Rush: 11 Listings, but half are below their issue price. Still Holding?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/september-ipo-rush-11-listings-but-half-are-below-their-issue-price-still-holding/slideshow/124190515.cms",
            "description": "September 2025 was an active month for IPOs, with 11 companies making their market debut. On listing day, excitement was high—10 out of 11 stocks opened in the green, delivering an average listing gain of 9.57%. However, the post-listing performance tells a different story. According to Trendlyne data, only five stocks are currently trading above their issue price, while six have slipped into the red, bringing the overall average return down to 9.04%.",
            "pubDate": "2025-09-28T04:53:37.644545"
        },
        {
            "title": "Will Laurus Labs, Wockhardt see more pain on Monday? Anand James reads the charts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-laurus-labs-wockhardt-see-more-pain-on-monday-anand-james-reads-the-charts/articleshow/124190472.cms",
            "description": "Pharma and IT stocks faced heavy pressure after Trump’s 100% tariff and H-1B visa fee hike, dragging Nifty lower. Laurus Labs showed a topping pattern while Wockhardt stayed in consolidation. Nifty IT broke support, hinting further downside. Analysts suggest cautious trading, with Tata Motors and VTL offering potential bullish setups.",
            "pubDate": "2025-09-28T04:53:37.644644"
        },
        {
            "title": "RBI MPC, IPO action and FII trends among 8 factors to impact stock markets in holiday-truncated week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-mpc-ipo-action-and-fii-trends-among-8-factors-to-impact-stock-markets-in-holiday-truncated-week/articleshow/124190447.cms",
            "description": "Indian markets ended the week down 2.7%, dragged by IT and pharma amid U.S. tariff and visa fee worries. Key drivers ahead include RBI policy outcome, U.S. market cues, IPO rush, rupee weakness, and crude price trends. Analysts suggest caution with focus on fundamentally strong stocks.",
            "pubDate": "2025-09-28T04:53:37.644733"
        }
    ]
}