{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-16T16:00:37.803768",
    "items": [
        {
            "title": "IMF urges Japan to keep rates low amid global trade uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-urges-japan-to-keep-rates-low-amid-global-trade-uncertainty/slideshow/124595538.cms",
            "description": "The BOJ ended a decade-long stimulus programme last year, raising its key interest rate to 0.5% in January. Sticky food inflation, partly driven by a weak yen, complicates rate decisions. Policymakers are cautious: in September, two of nine board members’ proposals to raise rates were rejected. Core inflation and consumption show no signs of overheating.",
            "pubDate": "2025-10-16T04:55:24.980220"
        },
        {
            "title": "KEI Industries shares crash 9% despite reporting 31% growth in Q2 net profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kei-industries-shares-crash-9-despite-reporting-31-growth-in-q2-net-profit/articleshow/124595421.cms",
            "description": "KEI Industries’ shares fell 9% to Rs 4,032 despite strong Q2 FY26 results. Net profit rose 31.3% to Rs 204 crore, supported by revenue growth, while EBITDA was muted. Analysts maintain a Buy rating, citing robust demand in cables. Investors await commentary on volumes, margins, and Sanand plant timelines.",
            "pubDate": "2025-10-16T04:55:24.980347"
        },
        {
            "title": "Canara Robeco AMC shares list at 5% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canara-robeco-amc-shares-list-at-5-premium-over-ipo-price/articleshow/124595028.cms",
            "description": "Canara Robeco AMC is poised for its market debut on October 16, with early indicators suggesting a modest listing around Rs 285-290 per share, slightly above its IPO price. Despite strong investor demand, particularly from QIBs, analysts note the IPO was fully priced, leaving limited room for immediate upside. Long-term investors may benefit from India's growing mutual fund penetration.",
            "pubDate": "2025-10-16T04:55:24.980459"
        },
        {
            "title": "Healthy start! Rubicon Research shares list at 28% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/healthy-start-rubicon-research-shares-list-at-28-premium-over-ipo-price/articleshow/124595019.cms",
            "description": "Rubicon Research debuted on stock exchanges with a significant 27.9% premium, opening at Rs 620. The Rs 1,377 crore IPO saw overwhelming demand, subscribed 109 times, driven by strong QIB interest. Analysts cite robust financials, a specialized US generics portfolio, and a scalable model for the excitement.",
            "pubDate": "2025-10-16T04:55:24.980563"
        },
        {
            "title": "Ola Electric & Ather Energy: Can you bet on India’s EV stocks as China tightens lithium grip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-ather-energy-can-you-bet-on-indias-ev-stocks-as-china-tightens-lithium-grip/articleshow/124595225.cms",
            "description": "China’s new export curbs on lithium battery materials may disrupt India’s EV supply chain. Analysts say Ather Energy’s localisation efforts could limit the impact, while Ola Electric remains exposed due to its reliance on Chinese components. Ather’s technical outlook appears stronger, whereas Ola’s charts signal continued weakness.",
            "pubDate": "2025-10-16T04:55:24.980663"
        },
        {
            "title": "IMF, World Bank urge accelerated restructuring of non-bonded debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-world-bank-urge-accelerated-restructuring-of-non-bonded-debt/slideshow/124595386.cms",
            "description": "On Wednesday, during the IMF and World Bank annual meetings in Washington, top officials gathered to discuss debt vulnerabilities in developing countries and explore solutions for improved debt management. (Source: Reuters)",
            "pubDate": "2025-10-16T04:55:24.980761"
        },
        {
            "title": "HDFC Life shares fall 5% as Q2 results fail to impress the Street. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-life-shares-fall-5-as-q2-results-fail-to-impress-the-street-should-you-buy-sell-or-hold/articleshow/124595058.cms",
            "description": "HDFC Life Insurance shares dropped 4.6% despite a 3% YoY rise in Q2 FY26 consolidated PAT to Rs 448 crore. Net premium income surged 14% YoY to Rs 18,871 crore. Brokerages like Morgan Stanley, Goldman Sachs, and Nuvama maintain positive ratings, citing growth potential and target prices, though acknowledging margin pressures.",
            "pubDate": "2025-10-16T04:55:24.980860"
        },
        {
            "title": "Up to 10,000% returns! 10 multibagger stocks you'll wish you bought last Diwali",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/up-to-10000-returns-10-multibagger-stocks-youll-wish-you-bought-last-diwali/articleshow/124594971.cms",
            "description": "Dalal Street saw remarkable gains in small and midcap stocks from Diwali 2024 to Diwali 2025. Several stocks delivered returns up to 10,000%, turning modest investments into significant wealth. RRP Semiconductor led the pack with a nearly 10,000% surge. Other companies like GHV Infra Projects and Elitecon International also saw substantial growth.",
            "pubDate": "2025-10-16T04:55:24.980964"
        },
        {
            "title": "TVS Motor shares in focus on adventure touring segment entry with Apache RTX launch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-shares-in-focus-on-adventure-touring-segment-entry-with-apache-rtx-launch/articleshow/124594939.cms",
            "description": "TVS Motor Company enters the premium adventure motorcycle segment with the launch of the Apache RTX at Rs 1.99 lakh. Built on the new Next-Gen RT-XD4 engine platform, the 299cc bike blends track performance with touring comfort. The move complements TVS’s lifestyle-oriented strategy. In Q1 FY26, the company reported 32% YoY profit growth to Rs 610 crore.",
            "pubDate": "2025-10-16T04:55:24.981058"
        },
        {
            "title": "US banks tap Fed’s repo facility amid liquidity tightening",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-banks-tap-feds-repo-facility-amid-liquidity-tightening/slideshow/124594992.cms",
            "description": "US banks borrowed $6.5 billion from the Federal Reserve’s Standing Repo Facility (SRF) on Wednesday. This was the largest daily borrowing since the COVID-19 pandemic, excluding end-of-quarter periods. Repurchase rates also rose, signalling tightening conditions in the market ahead of major Treasury settlements. (Source: Reuters)",
            "pubDate": "2025-10-16T04:55:24.981174"
        },
        {
            "title": "BEL shares in focus after bagging order worth Rs 592 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-after-bagging-order-worth-rs-592-crore/articleshow/124594924.cms",
            "description": "BEL shares:  The Navratna defence PSU secured new orders worth ₹592 crore since September 29, 2025, covering a wide range of defence and technology systems such as tank subsystems, communication gear, combat and ship management systems, Kavach, jammers, and related upgrades and services.",
            "pubDate": "2025-10-16T04:55:24.981277"
        },
        {
            "title": "Hyundai Motor shares in focus as automaker bets Rs 45,000 crore on India push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-shares-in-focus-as-automaker-bets-rs-45000-crore-on-india-push/articleshow/124594908.cms",
            "description": "Hyundai Motor unveiled a Rs 45,000 crore India roadmap through FY30, including 26 new products, entry into MPV, off-road SUV, and hybrid segments, and a locally developed electric SUV by 2027. The company will launch its finance arm Hyundai Capital by FY26 and luxury brand Genesis by 2027, aiming to boost exports to 30% and revenues to Rs 1 lakh crore.",
            "pubDate": "2025-10-16T04:55:24.981374"
        },
        {
            "title": "Hero MotoCorp shares in focus on partnership with Noria Motos to enter Spain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-on-partnership-with-noria-motos-to-enter-spain/articleshow/124594864.cms",
            "description": "Hero MotoCorp has entered the Spanish market through a distribution partnership with Noria Motos, marking its presence in 50 international markets and strengthening its European expansion following its recent Italy launch.",
            "pubDate": "2025-10-16T04:55:24.981468"
        },
        {
            "title": "Sensex jumps over 300 pts, Nifty holds above 25,400 on earnings optimism and fresh FII inflows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-300-pts-nifty-holds-above-25400-on-earnings-optimism-and-fresh-fii-inflows/articleshow/124594828.cms",
            "description": "Indian stock markets opened higher on Tuesday. The Sensex and Nifty saw gains, led by financial and consumer durable stocks. This rise was driven by positive sentiment regarding a domestic earnings recovery. Additionally, new foreign investments contributed to the upward trend. Investors are showing renewed confidence in the market.",
            "pubDate": "2025-10-16T04:55:24.981562"
        },
        {
            "title": "Buy, Sell or Hold: Motilal Oswal maintains buy on HDFC AMC; Nuvama initiates coverage on Hyundai Motor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-motilal-oswal-maintains-buy-on-hdfc-amc-nuvama-initiates-coverage-on-hyundai-motor/articleshow/124594743.cms",
            "description": "Brokerages remain optimistic on select large-caps, backing HDFC AMC, HDFC Life, and Hyundai Motor India for strong earnings growth, product expansion, and robust fundamentals over the next few years.",
            "pubDate": "2025-10-16T04:55:24.981655"
        },
        {
            "title": "ICICI Lombard General, HDFC AMC among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-lombard-general-hdfc-amc-among-5-stocks-showing-bullish-rsi-upswing/slideshow/124594747.cms",
            "description": "On October 15, in the Nifty200 pack, five stocks with gains of over 2.5% were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. An uptrend signal occurs when the RSI value crosses above 50 from below.“RSI Trending Up” indicates that the Relative Strength Index (RSI) values are rising, suggesting strengthening momentum in the stock’s price. This can signal potential upward movement and may help traders identify buying opportunities.",
            "pubDate": "2025-10-16T04:55:24.981750"
        },
        {
            "title": "Tata Investment Corp shares tumble over 12% in two days after trading ex-split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corp-shares-tumble-over-12-in-two-days-after-trading-ex-split/articleshow/124595794.cms",
            "description": "Tata Investment Corporation shares slipped 3.5% to Rs 908 after trading ex-split, following a 1:10 stock split on October 14. Despite an apparent 90% drop, market capitalisation remained unchanged. Q1 results showed strong profit growth, while the stock gained over 7% post-adjustment. Investor attention is on Tata Sons’ potential listing.",
            "pubDate": "2025-10-16T05:13:32.695434"
        },
        {
            "title": "10 stocks to buy this Diwali 2025: HDFC Securities spots up to 26% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-stocks-to-buy-this-diwali-2025-hdfc-securities-spots-up-to-26-upside/slideshow/124596287.cms",
            "description": "Indian equities enter Samvat 2082 at a turning point. After a lacklustre year marked by global trade tensions and high valuations, domestic tailwinds — from policy easing and robust capex to softer commodity prices — are expected to reignite growth. HDFC Securities sees the ongoing correction as a buying window, identifying ten quality stocks positioned to deliver selective, stock-specific returns over the next year.",
            "pubDate": "2025-10-16T05:50:13.119379"
        },
        {
            "title": "IMF urges Japan to keep rates low amid global trade uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/imf-urges-japan-to-keep-rates-low-amid-global-trade-uncertainty/slideshow/124596168.cms",
            "description": "The IMF has advised that the Bank of Japan (BOJ) should maintain loose monetary policy and raise interest rates very gradually, given the uncertainty in global trade and economic conditions. (Source: Reuters)",
            "pubDate": "2025-10-16T05:50:13.119509"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in IndiGo shares to gain benefit from upward momentum",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-indigo-shares-to-gain-benefit-from-upward-momentum/articleshow/124599540.cms",
            "description": "IndiGo shares show strong upward momentum after a breakout from consolidation, supported by robust volumes and positive RSI trends. Analysts suggest deploying a Bull Call Spread strategy to capitalise on potential upside, with key support and resistance levels guiding risk management in the derivatives market.",
            "pubDate": "2025-10-16T08:23:49.466442"
        },
        {
            "title": "European stocks inch up after mixed earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-inch-up-after-mixed-earnings/articleshow/124599354.cms",
            "description": "Today, European stocks experienced a modest uptick as investors sift through a mixed bag of corporate earnings. This rebound follows recent anxieties over trade tariffs. The earnings season has opened on a positive note, with Nestle showing remarkable sales growth. In contrast, Pernod Ricard and Whitbread have faced declines in their sales figures.",
            "pubDate": "2025-10-16T08:23:49.466588"
        },
        {
            "title": "China’s rare earth curbs: 10 Indian stocks that could feel the heat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-rare-earth-curbs-10-indian-stocks-that-could-feel-the-heat/slideshow/124596905.cms",
            "description": "China, which controls roughly 49% of the world’s rare earth reserves, 69% of mining output, and 90% of refining capacity, has tightened its grip on global supply. Under new export rules, even products containing as little as 0.1% of Chinese-sourced rare earths will now require government approval—a move that could ripple through India’s fast-growing EV, electronics, and renewable energy sectors.Here are 10 Indian companies that could feel the heat if the rare earth squeeze persists, according to brokerage Ventura.",
            "pubDate": "2025-10-16T08:23:49.466707"
        },
        {
            "title": "For medium-term investors looking to put in fresh money: 5 large-caps from different sectors with an upside potential of up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-medium-term-investors-looking-to-put-in-fresh-money-5-large-caps-from-different-sectors-with-an-upside-potential-of-up-to-40/articleshow/124598942.cms",
            "description": "Understand a simple stock market fact: A rise in a company’s stock price does not mean the business is strong. Conversely, a fall in price does not mean the business is weak. So, the ability to make a distinction between the stock price and the business and its growth path is extremely important. This ability is what is needed to make that extra return from the stock market. This distinction is important when the market is bearish. But it is also important when the bulls are seeking to make a comeback, as they are these days.",
            "pubDate": "2025-10-16T08:23:49.466812"
        },
        {
            "title": "Tata Motors shares rise 2%. What should investors do after demerger?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-rise-2-what-should-investors-do-after-demerger/articleshow/124599079.cms",
            "description": "Tata Motors shares saw a rise as the company demerged its passenger and commercial vehicle businesses. Shareholders will receive new shares in the commercial vehicle entity soon. Brokerages anticipate value creation from this separation. The commercial vehicle arm is seen as a strong performer, while the passenger vehicle segment's outlook depends on Jaguar Land Rover's recovery.",
            "pubDate": "2025-10-16T08:23:49.466922"
        },
        {
            "title": "Japan's Nikkei rises on improving bets of Takaichi becoming next PM",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-on-improving-bets-of-takaichi-becoming-next-pm/articleshow/124598632.cms",
            "description": "Japan's Nikkei index surged more than 1 percent on Thursday, driven by increasing optimism toward Liberal Democratic Party leader Sanae Takaichi stepping into the role of prime minister. This upbeat sentiment surrounding possible government spending initiatives had investors rallying, particularly within the technology and property markets.",
            "pubDate": "2025-10-16T08:23:49.467022"
        },
        {
            "title": "Nestle India shares jump 5% despite Q2 profit tumbling 24% YoY; here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nestle-india-shares-jump-5-despite-q2-profit-tumbling-24-yoy-heres-why/articleshow/124598303.cms",
            "description": "Shares of Nestlé India surged 5% to Rs 1,281 on the NSE on October 16 after the company reported its Q2 FY26 results. Standalone profit after tax (PAT) fell 23.6% YoY to Rs 753.2 crore, while revenue rose 10.6% to Rs 5,643.61 crore. On a consolidated basis, PAT declined 17.4% to Rs 743.17 crore.",
            "pubDate": "2025-10-16T08:23:49.467121"
        },
        {
            "title": "Goldman Sachs is betting big on bank stocks. Here are 4 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-is-betting-big-on-bank-stocks-here-are-4-reasons-why/articleshow/124597868.cms",
            "description": "Goldman Sachs is bullish on Indian bank stocks, citing easing financial conditions, low earnings expectations, improving profitability, and attractive valuations. The brokerage expects Nifty Bank to outperform the broader market, with banks and NBFCs offering up to 30% upside.",
            "pubDate": "2025-10-16T08:23:49.467216"
        },
        {
            "title": "Gold, silver boom makes MCX proxy play for stock investors. Is it better than bullion?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-silver-boom-makes-mcx-proxy-play-for-stock-investors-is-it-better-than-bullion/articleshow/124597579.cms",
            "description": "MCX shares hit a record Rs 9,617 on Wednesday, driven by surging gold and silver prices and record derivative trading. Technical indicators and strong volumes signal continued bullish momentum, with analysts advising ‘buy on dips.’ Options growth and regulatory tailwinds support long-term revenue and profit expansion.",
            "pubDate": "2025-10-16T08:23:49.467318"
        },
        {
            "title": "Cement makers’ earnings likely peaked in Q2; price moderation & rising costs could limit gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cement-makers-earnings-likely-peaked-in-q2-price-moderation-rising-costs-could-limit-gains/articleshow/124597191.cms",
            "description": "India’s cement makers likely saw peak earnings in Q2, supported by volume growth and acquisitions. However, GST-led price moderation, higher petcoke costs, and new capacity additions may cap future gains, with sequential EBITDA per tonne expected to slip after three quarters of growth.",
            "pubDate": "2025-10-16T08:23:49.467417"
        },
        {
            "title": "Cian Agro shares hit 5% lower circuit after 16-day upper circuit run. Stock still up over 8,400% in 2 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cian-agro-shares-hit-5-lower-circuit-after-16-day-upper-circuit-run-stock-still-up-over-8400-in-2-years/articleshow/124597106.cms",
            "description": "Cian Agro Industries & Infrastructure shares experienced a significant halt on Thursday, falling 5% to Rs 3,287.15 after a remarkable 16-session rally. Despite this correction, the stock has delivered extraordinary returns, skyrocketing over 8,450% in two years and showing substantial gains across various recent timeframes.",
            "pubDate": "2025-10-16T08:23:49.467514"
        },
        {
            "title": "Australian shares notch record closing high as unemployment spike fuels rate-cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-notch-record-closing-high-as-unemployment-spike-fuels-rate-cut-bets/articleshow/124596983.cms",
            "description": "Australian stocks reached a new peak on Thursday. Financials, property, and gold sectors saw significant gains. This surge followed an unexpected rise in unemployment. Investors now anticipate an interest rate cut next month. The S&P/ASX 200 index climbed, marking a historic high. This positive market movement reflects growing confidence in the Australian economy.",
            "pubDate": "2025-10-16T08:23:49.467627"
        },
        {
            "title": "Canara Robeco AMC shares rally 12% after listing. Should you buy, sell or hold the stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/canara-robeco-amc-shares-rally-12-after-listing-should-you-buy-sell-or-hold-the-stock/articleshow/124596428.cms",
            "description": "Canara Robeco Share Price: Canara Robeco Asset Management Company shares surged over 12% on Thursday after a strong listing, trading significantly above its issue price. Analysts are optimistic about its growth prospects, citing strong equity market performance and the company's well-positioned business model. Investors are advised to book partial profits while holding the remainder for long-term gains.",
            "pubDate": "2025-10-16T08:23:49.467730"
        },
        {
            "title": "FII selling slows in October as foreign investors flip script, pumping Rs 3,000 crore in 7 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-selling-slows-in-october-as-foreign-investors-flip-script-pumping-rs-3000-crore-in-7-days/articleshow/124596675.cms",
            "description": "After months of outflows, FIIs have turned net buyers in October, investing over Rs 3,000 crore in just seven sessions. The shift to inflows has lifted Sensex and Nifty by about 3%, reflecting improved sentiment amid easing India–US trade tensions and supportive domestic policies.",
            "pubDate": "2025-10-16T08:23:49.467825"
        },
        {
            "title": "Eternal shares rise 2%, hit record high ahead of Q2 earnings; quick commerce to lead growth, say experts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-rise-2-hit-record-high-ahead-of-q2-earnings-quick-commerce-to-lead-growth-say-experts/articleshow/124596612.cms",
            "description": "Eternal share price: Eternal shares hit a record high ahead of Q2 results, with analysts expecting robust topline growth led by Blinkit’s quick commerce business. However, profit may drop up to 71% year-on-year due to elevated delivery costs and weak margins in the food delivery segment.",
            "pubDate": "2025-10-16T08:23:49.467922"
        },
        {
            "title": "Diwali holiday on October 20 or 21? Here’s when the stock market will close, and open for Muhurat Trading",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-holiday-on-october-20-or-21-heres-when-the-stock-market-will-close-and-open-for-muhurat-trading/articleshow/124600402.cms",
            "description": "The BSE and NSE will remain closed on October 21 for Diwali Lakshmi Puja and on October 22 for Balipratipada. A one-hour Muhurat Trading session will be held on October 21, marking the start of Samvat 2082.",
            "pubDate": "2025-10-16T09:36:38.722724"
        },
        {
            "title": "Sensex surges 1,500 pts in 2 days, Nifty tops 25,600. Here are key factors driving the rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-surges-1300-pts-in-2-days-nifty-tops-25550-heres-whats-driving-the-rally/articleshow/124600207.cms",
            "description": "Indian equities continued their upward trend on Thursday, driven by strong performance in financials and consumer durables. The Sensex and Nifty saw significant gains, fueled by optimism surrounding a domestic earnings rebound and renewed foreign investment. This rally marks a continuation of recent positive momentum for the markets.",
            "pubDate": "2025-10-16T09:36:38.722849"
        },
        {
            "title": "Mining Multibaggers: 13 smallcaps rocketed up to 2,098% over last 3 Diwali seasons",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mining-multibaggers-13-smallcaps-rocketed-up-to-2098-over-last-3-diwali-seasons/slideshow/124600217.cms",
            "description": "As the markets gear up for the festive season and investors prepare to welcome Samvat 2082, the buzz around smallcap stocks is louder than ever. While blue chips continue to dominate the headlines, a handful of lesser-known smallcaps have quietly turned into wealth creators, delivering staggering returns and lighting up investors’ portfolios year after year.Market data reveals that 13 smallcap stocks have consistently gained more than 50% in every Diwali-to-Diwali period over the last three years, including the ongoing Samvat year. What’s more remarkable is the cumulative performance these counters have achieved — soaring anywhere between 450% to a jaw-dropping 2098% over the three-year stretch. Adding to the fireworks, six out of these 13 stocks have turned tenfold multipliers, creating significant wealth for long-term investors who stayed the course. With Diwali approaching, many in the market are keenly watching whether these outperformers can continue to shine bright in Samvat 2082 — or if new contenders will join the elite league. (Data Source: ACE Equity)",
            "pubDate": "2025-10-16T09:36:38.722956"
        },
        {
            "title": "Nomura sets Nifty50 target at 26,140 for March 2026, adds 3 stocks to preferred list",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-sets-nifty50-target-at-26140-for-march-2026-adds-3-stocks-to-preferred-list/articleshow/124601434.cms",
            "description": "Nomura maintains its Nifty50 target at 26,140 for March 2026, adding Prestige Estates, Swiggy, and Titan to its preferred stocks list. The brokerage favours sectors like Financials, Autos, Cement, and Pharmaceuticals while remaining cautious on Capital Goods, IT Services, and Metals amid modest recovery expectations.",
            "pubDate": "2025-10-16T09:54:46.476589"
        },
        {
            "title": "Infosys announces Rs 23 per share interim dividend. Check payout and record dates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-announces-rs-23-per-share-interim-dividend-check-payout-and-record-dates/articleshow/124603030.cms",
            "description": "Infosys has announced an interim dividend of Rs 23 per equity share. The record date for this dividend is October 27, 2025. Shareholders can expect the payout on November 7, 2025. This announcement coincides with Infosys's Q2 earnings report. The company reported a 13% year-on-year growth in net profit. Revenue from operations also saw a 9% increase.",
            "pubDate": "2025-10-16T11:11:23.281459"
        },
        {
            "title": "Eternal shares fall 4% after Q2 results. 10 things team Deepinder Goyal said in shareholders’ letter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-fall-4-after-q2-results-10-things-team-deepinder-goyal-said-in-shareholders-letter/articleshow/124602896.cms",
            "description": "Eternal (formerly Zomato) shares fell nearly 4% after Q2 results showed a sharp drop in profit. In a shareholder letter, CEO Deepinder Goyal highlighted gradual growth recovery, strong quick commerce expansion, improved margins, and continued investments in Blinkit, Hyperpure, and District despite weak discretionary demand.",
            "pubDate": "2025-10-16T11:11:23.281608"
        },
        {
            "title": "Ola Electric shares hit 5% upper circuit on foray into energy storage biz with Ola Shakti",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-hit-5-upper-circuit-on-foray-into-energy-storage-biz-with-ola-shakti/articleshow/124601854.cms",
            "description": "Ola Electric shares hit a 5% upper circuit after the company announced its entry into the energy storage market with “Ola Shakti,” a residential battery energy storage system. The innovation, built on indigenous 4680 Bharat Cells, marks Ola’s expansion beyond EVs into clean energy, targeting homes and small businesses.",
            "pubDate": "2025-10-16T11:11:23.281832"
        },
        {
            "title": "Vijay Kedia-backed TAC InfoSec hits 5% upper circuit as PAT surges 138% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-backed-tac-infosec-hits-5-upper-circuit-as-pat-surges-138-yoy/articleshow/124601715.cms",
            "description": "TAC InfoSec, backed by Vijay Kedia, hit a 5% upper circuit on robust H1 FY26 results, reporting a 138% YoY PAT surge. Strong revenue growth, improved margins, AI-led initiatives, and marquee clients like Salesforce and Autodesk fueled investor interest in the cybersecurity firm.",
            "pubDate": "2025-10-16T11:11:23.281938"
        },
        {
            "title": "Angel One hikes brokerage fees as profit falls for three straight quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/angel-one-hikes-brokerage-fees-as-profit-falls-for-three-straight-quarters/articleshow/124601517.cms",
            "description": "Angel One will revise its brokerage structure from November 17, increasing minimum charges on delivery and intraday trades as retail activity slows after regulatory curbs on derivatives trading hit brokers’ core revenues and profitability.",
            "pubDate": "2025-10-16T11:11:23.282040"
        },
        {
            "title": "Eternal Q2 Results: Profit falls 63% to Rs 65 cr; revenue jumps 183%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-q2-results-profit-falls-63-to-rs-65-cr-revenue-jumps-183/videoshow/124609155.cms",
            "description": "Food delivery firm Eternal reported a sharp 63% YoY drop in Q2 net profit at Rs 65 crore, missing Street estimates of Rs 108 crore. Despite the profit decline, revenue from operations surged 183% to Rs 13,590 crore, compared with Rs 4,799 crore a year ago, reflecting strong top-line growth amid ongoing profitability pressures.",
            "pubDate": "2025-10-16T16:00:26.519795"
        },
        {
            "title": "Market Trading Guide: Buy Sona BLW, Jindal Stainless and Navin Fluorine on Friday for up to 10% potential upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-sona-blw-jindal-stainless-and-navin-fluorine-on-friday-for-up-to-10-potential-upside/slideshow/124608403.cms",
            "description": "India’s benchmark indices, Nifty and Sensex, ended sharply higher on Thursday, boosted by strong buying in banking and automobile stocks. Bulls remained at the helm as the Nifty surpassed the crucial resistance of 25,500 during the day and also closed above it. Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities said that the index has given a swing high breakout, indicating the possibility of a strong rally in the short term on the technical front. \"The momentum indicator RSI is in a bullish crossover and rising. Overall, the short-term trend looks positive, with potential to move towards 25,750–25,800, while on the lower end, support is placed at 25,500,\" De said.Here are 3 stock recommendations for Friday:",
            "pubDate": "2025-10-16T16:00:26.519930"
        },
        {
            "title": "Sebi aims to boost institutional participation in commodity markets, says chair Tuhin Kanta Pandey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-markets-regulator-aims-to-boost-institutional-participation-in-commodity-markets-chair-says/articleshow/124607988.cms",
            "description": "India's markets regulator aims to boost institutional participation in the country's agriculture and non-agriculture commodity markets to make them more attractive for hedging, Chairman Tuhin Kanta Pandey said on Thursday.",
            "pubDate": "2025-10-16T16:00:26.520041"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124607638.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-10-16T16:00:26.520147"
        },
        {
            "title": "US stocks advance after TSMC's results support renewed AI optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-rise-as-tsmc-results-renew-ai-optimism/articleshow/124606962.cms",
            "description": "Wall Street's main indexes opened higher on Thursday, driven by an upbeat quarterly update from TSMC that added to investor optimism around AI and extended a rally in chip stocks.",
            "pubDate": "2025-10-16T16:00:26.520259"
        },
        {
            "title": "Ather Energy, TVS Motor among 8 stocks that hit 52-week highs and rallied up to 30% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ather-energy-tvs-motor-among-8-stocks-that-hit-52-week-highs-and-rallied-up-to-30-in-a-month/slideshow/124606628.cms",
            "description": "On Thursday, the benchmark Sensex surged by approximately 862 points, closing at 83,468. Fueled by a broader market rally, eight stocks from the BSE Consumer Discretionary Index reached their 52-week highs, marking their peak levels over the past year. Traders and investors often view such breakouts as bullish signals, indicating strong upward momentum and the potential for further gains.",
            "pubDate": "2025-10-16T16:00:26.520369"
        },
        {
            "title": "Phishing attack hits Zerodha’s Nithin Kamath, ‘one slip of the mind’ is all it took",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/phishing-attack-hits-zerodhas-nithin-kamath-one-slip-of-the-mind-is-all-it-took/articleshow/124604729.cms",
            "description": "Zerodha CEO Nithin Kamath's personal Twitter account was compromised via a phishing attack, highlighting a single lapse in judgment. Despite two-factor authentication, attackers accessed one login session, posting scam crypto links. Kamath emphasized that human factors, not just technical measures, are crucial for cybersecurity, advocating for holistic approaches.",
            "pubDate": "2025-10-16T16:00:26.520476"
        },
        {
            "title": "Vijay Kedia's portfolio multibagger surges 20%, extends rally to 30% in three sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedias-portfolio-multibagger-surges-20-extends-rally-to-30-in-three-sessions/articleshow/124604637.cms",
            "description": "Global Vectra shares surged 20% to Rs 243.14 on the NSE, marking a third consecutive session of gains and a 31% rally over this period. The rise followed ace investor Vijay Kedia increasing his stake, while the stock remains volatile but continues to trade above key moving averages.",
            "pubDate": "2025-10-16T16:00:26.520603"
        },
        {
            "title": "Stock Radar: SBI hits fresh 52-week high in October; will the rally continue? Check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-sbi-hits-fresh-52-week-high-in-october-will-the-rally-continue-check-target-stop-loss/articleshow/124580523.cms",
            "description": "State Bank of India has broken out of a 9-month consolidation on weekly charts, hitting a fresh 52-week high. Experts suggest short-term traders can buy the stock for a target above 940 levels in the coming weeks. The PSU stock is showing sustained bullish momentum across multiple timeframes.",
            "pubDate": "2025-10-16T16:00:26.520706"
        }
    ]
}