{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-02T11:57:17.423558",
    "items": [
        {
            "title": "Swiggy to launch Rs 10,000 crore share sale next week: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-plans-rs-10000-crore-share-sale-next-week/articleshow/125712970.cms",
            "description": "Indian food delivery giant Swiggy Ltd. is reportedly preparing to raise up to 100 billion rupees ($1.1 billion) from institutional investors as early as next week. The company has shortlisted Citigroup, JPMorgan Chase, and Kotak Mahindra to manage the potential share sale, which was approved by its board on November 7th.",
            "pubDate": "2025-12-02T07:58:11.041662"
        },
        {
            "title": "Ashok Leyland shares hit 52-week high, jump 4% in 2 days. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-hit-52-week-high-jump-4-in-2-days-heres-why/articleshow/125712927.cms",
            "description": "Ashok Leyland shares hit a new 52-week high on Tuesday, rising 2.7% to ₹164.50 and extending a two-day rally of nearly 4%. The stock is gaining on strong November sales and improving financial performance, which have boosted investor sentiment.",
            "pubDate": "2025-12-02T07:58:11.041782"
        },
        {
            "title": "China stocks attract fund managers amid economic uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-attract-fund-managers-amid-economic-uncertainty/slideshow/125710142.cms",
            "description": "China's CSI300 blue-chip index has matched the S&P 500 with roughly a 16% gain, while Hong Kong's Hang Seng Index is up about 30% year-to-date, on track for its best annual rise since 2017. Despite a less euphoric mood compared to last year's stimulus-driven rally, investors see room for continued growth. (Source: Reuters)",
            "pubDate": "2025-12-02T07:58:11.041898"
        },
        {
            "title": "RBI likely to cut repo rate by 25 bps in Dec amid low inflation, strong growth: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-likely-to-cut-repo-rate-by-25-bps-in-dec-amid-low-inflation-strong-growth-report/articleshow/125711479.cms",
            "description": "A report by CareEdge suggests the RBI may cut the repo rate by 25 basis points in December, citing a decadal low in inflation and strong growth momentum. With inflation projected to remain subdued and real policy rates above neutral, the central bank has room for a rate cut. Despite external challenges, India's external sector shows resilience.",
            "pubDate": "2025-12-02T07:58:11.041997"
        },
        {
            "title": "Wockhardt shares jump over 4%, extend two-day rally following FDA nod for Zaynich",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wockhardt-shares-jump-over-4-extend-two-day-rally-following-fda-nod-for-zaynich/articleshow/125711011.cms",
            "description": "Wockhardt Ltd shares jumped over 4% to ₹1,533, extending a two-day rally after surging nearly 20% on Tuesday. The rise follows the US FDA’s acceptance of its New Drug Application for Zaynich, a first-in-class antibiotic, marking the first NDA approval for a New Chemical Entity by an Indian pharma company.",
            "pubDate": "2025-12-02T07:58:11.042098"
        },
        {
            "title": "Aequs IPO opens tomorrow: Strong GMP signals robust investor interest. Should you subscribe?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aequs-ipo-opens-tomorrow-strong-gmp-signals-robust-investor-interest-should-you-subscribe/articleshow/125710964.cms",
            "description": "Belagavi-based Aequs Limited is launching its Rs 921.81 crore IPO on December 3, 2025, with strong grey market premium indicating investor enthusiasm. The precision engineering firm, serving aerospace and other sectors, aims to use IPO proceeds for debt repayment. Analysts recommend subscribing despite current losses, citing its integrated model and attractive valuation.",
            "pubDate": "2025-12-02T07:58:11.042195"
        },
        {
            "title": "Smallcaps hit pause after a 4-year rally. Is the turnaround finally here?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcaps-hit-pause-after-a-4-year-rally-is-the-turnaround-finally-here/articleshow/125710821.cms",
            "description": "Indian small-cap stocks have consolidated after a strong rally, facing headwinds like stretched valuations and tighter liquidity. However, easing macro pressures, improving earnings, and attractive valuations now present opportunities. Selective stock-picking in the small-cap space is poised to deliver strong long-term returns as the tide turns.",
            "pubDate": "2025-12-02T07:58:11.042288"
        },
        {
            "title": "Nifty to reach 29,300 by 2026 as D-St regains momentum, says Nomura; ICICI Bank, Infosys among top picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-projects-indias-nifty-rising-to-29300-by-2026-as-growth-recovers/articleshow/125710591.cms",
            "description": "Nomura forecasts Indian equities to climb 12% by end-2026, targeting the Nifty 50 at 29,300. This optimistic outlook is driven by calmer geopolitics, stable macros, and a recovering earnings cycle. The brokerage advises selective stock picking, favoring segments with muted expectations likely to improve.",
            "pubDate": "2025-12-02T07:58:11.042381"
        },
        {
            "title": "Tariff uncertainty clouds outlook as key US industries slip into contraction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-uncertainty-clouds-outlook-as-key-us-industries-slip-into-contraction/slideshow/125709732.cms",
            "description": "US manufacturing contracted for the ninth consecutive month in November, reflecting a broad slowdown driven by slumping orders and rising input costs. Import tariffs continue to weigh heavily on producers, reinforcing a difficult environment for factories. (Source: Reuters)",
            "pubDate": "2025-12-02T07:58:11.042471"
        },
        {
            "title": "Why India's famous multibagger hunter Vijay Kedia is now chasing tortoise stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-indias-famous-multibagger-hunter-vijay-kedia-is-now-chasing-tortoise-stocks/articleshow/125709275.cms",
            "description": "Renowned investor Vijay Kedia is adopting a cautious approach, favoring 'tortoise stocks' like PSU banks and even Chinese ETFs over his usual 'cheetah stocks'. He believes the current market, despite record highs, lacks genuine excitement and offers limited opportunities for quick gains.",
            "pubDate": "2025-12-02T07:58:11.042564"
        },
        {
            "title": "BofA predicts 25bps Fed rate cut in December amid weak labor market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bofa-predicts-25bps-fed-rate-cut-in-december-amid-weak-labor-market/slideshow/125709213.cms",
            "description": "BofA Global Research now anticipates a 25‑basis‑point rate cut at the Federal Reserve’s December meeting, reversing its earlier view that borrowing costs would remain unchanged. This revision is driven by signs of weakening labor market conditions and increasingly dovish signals from policymakers. (Source: Reuters)",
            "pubDate": "2025-12-02T07:58:11.042658"
        },
        {
            "title": "Sensex drops over 300 pts, Nifty below 26,100 as D-Street pauses record run",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-over-150-pts-nifty-below-26200-as-d-street-pauses-record-run/articleshow/125708928.cms",
            "description": "Indian equities opened lower on Tuesday, with the Sensex and Nifty retreating from recent record highs. Investors engaged in profit-taking, while foreign funds continued to reduce their holdings, leading to a softer market sentiment. Both benchmarks had reached 14-month highs in the previous session before momentum faded.",
            "pubDate": "2025-12-02T07:58:11.042753"
        },
        {
            "title": "Vodafone Idea shares jump 4% on anticipation of AGR relief by year-end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-as-government-reviews-agr-relief-proposal/articleshow/125708878.cms",
            "description": "Vodafone Idea shares rose as the government nears a decision on its relief proposal for Adjusted Gross Revenue (AGR) dues. Union Telecom Minister Jyotiraditya Scindia indicated that recommendations could be announced in the coming weeks, following a careful evaluation of the Supreme Court's judgment and legal boundaries.",
            "pubDate": "2025-12-02T07:58:11.042854"
        },
        {
            "title": "Bharat Dynamics shares jump 2% on securing Rs 2,4612 crore order from the Indian Army",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bdl-shares-in-focus-on-securing-rs-24612-crore-order-from-the-indian-army/articleshow/125708848.cms",
            "description": "Bharat Dynamics shares: The company has secured additional defence orders worth ₹2,461.62 crore from the Indian Army since November 13, 2025, mainly for Anti-Tank Guided Missiles and Surface-to-Air Missiles under emergency procurement. The development is expected to keep the stock in focus on Tuesday.",
            "pubDate": "2025-12-02T07:58:11.042966"
        },
        {
            "title": "Indian Energy Exchange among 6 stocks showing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-energy-exchange-among-6-stocks-showing-bullish-signals/slideshow/125708828.cms",
            "description": "On December 1, among NSE-listed stocks with a market capitalization of over Rs 1,000 crore, nine stocks appeared on the bullish “White Marubozu” scanner, according to technical scan data from StockEdge.com. Of these, six stocks gained over 4%.A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns to make informed decisions about future price movements.",
            "pubDate": "2025-12-02T07:58:11.043058"
        },
        {
            "title": "Aditya Birla Capital shares likely in focus after co plans Rs 300-cr rights issue for housing finance arm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-capital-shares-likely-in-focus-after-co-plans-rs-300-cr-rights-issue-for-housing-finance-arm/articleshow/125708745.cms",
            "description": "Aditya Birla Capital shares: The company has launched a ₹300-crore rights issue to strengthen its housing finance subsidiary and support growth. The stock recently hit a 52-week high and has surged 83% over the past year, valuing the company at ₹93,031 crore. It currently trades at a P/E of 28.67, reflecting investor confidence in its earnings potential.",
            "pubDate": "2025-12-02T07:58:11.043156"
        },
        {
            "title": "Meesho faces investor protest over anchor allotment to SBI Funds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-faces-investor-protest-over-anchor-allotment-to-sbi-funds/articleshow/125716449.cms",
            "description": "Meesho's anchor book faced investor withdrawals after a significant allocation to SBI Funds Management, prompting other large funds to exit in protest. Despite this, the IPO lineup includes global investors like GIC and Abu Dhabi Investment Authority, highlighting strong demand for Indian tech startups.",
            "pubDate": "2025-12-02T11:11:00.503111"
        },
        {
            "title": "Why the stock market ended lower today? Sensex down 503 pts, Nifty below 26,050. Key factors that dragged D-St lower",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-the-stock-market-ended-lower-today-sensex-down-503-pts-nifty-below-26050-5-factors-that-dragged-d-st-lower/articleshow/125715917.cms",
            "description": "Indian equities retreated on Tuesday, with the Sensex and Nifty falling after touching record highs. Investors engaged in profit-taking, while foreign funds continued to reduce their holdings. This combination of domestic selling and external pressures led to the benchmarks closing lower.",
            "pubDate": "2025-12-02T11:11:00.503237"
        },
        {
            "title": "Insurance firms cut stakes in these 10 Largecap stocks in Q2FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurance-firms-cut-stakes-in-these-10-largecap-stocks-during-september-quarter/slideshow/125716226.cms",
            "description": "A decrease in insurance shareholding indicates that insurance companies have lowered their stakes in a specific company during the current quarter compared to the previous one. In the NSE largecap segment, we identified the top 10 stocks that saw a reduction in insurance shareholding from the June ’25 quarter to the September ’25 quarter, according to the StocksEdge shareholding scan.",
            "pubDate": "2025-12-02T11:11:00.503352"
        },
        {
            "title": "Bajaj Finance, HDFC Bank, 4 others among Axis Securities’ top largecap picks for December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-hdfc-bank-4-others-among-axis-securities-top-largecap-picks-for-december/slideshow/125714971.cms",
            "description": "Nifty 50 has seen a broad-based recovery of over 1,500 points since October 2025, after experiencing some pullback in July and August. The rally was led by better-than-expected earnings performance for the first half, optimism building for 15% tariffs for India, early signs of consumption pickup, a stable currency, relative attractiveness in valuations versus other emerging markets, and positive sentiments.Based on these developments and after almost 14 months of underperformance, Nifty touched the all-time high levels. During the same period, the Midcap index was marginally up by 1% while the Smallcap index was still lower by 9%. With this picture, brokerage firm Axis Securities has released its list of top six large-cap picks, with upside potential of up to x%.",
            "pubDate": "2025-12-02T11:11:00.503475"
        },
        {
            "title": "Nifty set for fresh uptrend, says Motilal Oswal. Here are 4 catalysts, 25 stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-set-for-fresh-uptrend-says-motilal-oswal-here-are-4-catalysts-25-stocks-to-buy/articleshow/125714541.cms",
            "description": "Motilal Oswal sees the Nifty entering a fresh uptrend after its record high, backed by stronger earnings, supportive policy measures, firm DII inflows and reasonable valuations. The brokerage flags four bullish catalysts, key risks, and highlights 25 stock ideas across largecaps, midcaps and smallcaps in its latest model portfolio.",
            "pubDate": "2025-12-02T11:11:00.503583"
        },
        {
            "title": "S&P Global Ratings upgrades outlook on Vedanta Resources to 'positive' from 'stable'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-global-ratings-upgrades-outlook-on-vedanta-resources-to-positive-from-stable/articleshow/125714337.cms",
            "description": "S&P Global Ratings has upgraded Vedanta Resources' outlook to 'positive' from 'stable', affirming its 'B' rating on senior unsecured notes. This move is driven by the anticipated improvement in the company's cost structure and earnings from its newly commissioned aluminium facilities.",
            "pubDate": "2025-12-02T11:11:00.503688"
        },
        {
            "title": "Indonesia to maintain presence in global bonds issuance, official says",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indonesia-to-maintain-presence-in-global-bonds-issuance-official-says/articleshow/125713901.cms",
            "description": "Indonesia will maintain its presence in the issuance of global bonds next year, including Kangaroo and Dim Sum bonds, a Finance Ministry official said on Tuesday, adding that the ministry is \"open-minded\" about the issuance of Panda bonds.",
            "pubDate": "2025-12-02T11:11:00.503788"
        },
        {
            "title": "Sunil Singhania-backed Emmvee Photovoltaic surges 10% as Q2 profit rockets 578% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sunil-singhania-backed-emmvee-photovoltaic-surges-10-as-q2-profit-rockets-578-yoy/articleshow/125713515.cms",
            "description": "Emmvee Photovoltaic rose sharply on Tuesday after the company reported a stellar Q2FY26 performance, with net profit jumping 578% YoY to Rs 238 crore and revenue rising 181%. Strong demand for high-efficiency solar modules, improved margins, and IPO-led debt reduction strengthened its financials as the company positions for growth in India’s expanding renewable energy market.",
            "pubDate": "2025-12-02T11:11:00.503884"
        },
        {
            "title": "In volatility, look beyond the obvious & be selective: 7 mid-cap stocks from different sectors with upside potential of up to 35%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/in-volatility-look-beyond-the-obvious-be-selective-7-mid-cap-stocks-from-different-sectors-with-upside-potential-of-up-to-35/articleshow/125713292.cms",
            "description": "Here are conversation topics you will hear on the street in the next few weeks: Decline in the rupee and its impact; lower market liquidity due to FPI selling; and, of course, the delay in the India-US trade deal. All these will all lead to higher volatility. But here’s the question to ask: Is investing about what will happen this quarter? No. Consider this for perspective: There’s a mid-cap specialty chemical company whose capex cycle is coming to an end and its impact will be visible in the next couple of quarters. Should you look at stock? The answer is yes. The message: Look beyond what the street is currently talking about.",
            "pubDate": "2025-12-02T11:11:00.503978"
        },
        {
            "title": "MF-backed 8 Nifty500 stocks crash up to 55% from their highs. Are you in or out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mf-backed-8-nifty500-stocks-crash-up-to-55-from-their-highs-should-you-buy-the-dip-or-bail/slideshow/125713363.cms",
            "description": "When large institutional investors like mutual funds put money into a stock, it’s often a signal worth paying attention to. These funds carry out extensive research and focus on long-term growth, investing only when there’s strong reasoning behind it. But what happens when some of their most favored stocks plummet by as much as 55% from their highs?Despite ongoing market volatility, several well-owned Nifty500 stocks have taken a hit. Interestingly, mutual funds haven’t retreated—instead, they’ve been steadily increasing their holdings in 147 Nifty500 stocks over the past three quarters. Among these, 54 stocks have already delivered double-digit returns in CY25. But today, we turn our attention away from the winners to the underperformers. Around 44 mutual fund-backed stocks have fallen more than 25% from their 52-week highs, with the eight biggest losers dropping between 40% and 55%. Such steep declines can test even the most patient investors. Are these sharp corrections a chance for savvy bottom-fishing, or a cautionary signal to stay wary? Only time will tell. (Data Source: ACE Equity).",
            "pubDate": "2025-12-02T11:11:00.504074"
        },
        {
            "title": "Stock Radar: Sun Pharma stock showing signs of bottoming out; breaks above falling trendline resistance on daily charts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-sun-pharma-stock-showing-signs-of-bottoming-out-breaks-above-falling-trendline-resistance-on-daily-charts/articleshow/125692643.cms",
            "description": "Sun Pharma's stock has shown a strong rebound, breaking a year-long downtrend and a descending triangle pattern. Experts suggest this bullish reversal, supported by increased volumes and trading above key moving averages, could propel the stock towards Rs 2000 in the coming months. Traders are advised to watch the Rs 1750 support level.",
            "pubDate": "2025-12-02T11:49:45.572167"
        },
        {
            "title": "​Gainers & Losers: Swiggy, Bajaj Housing Finance among 7 stocks in focus on Tuesday​",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-swiggy-bajaj-housing-finance-among-7-stocks-in-focus-on-tuesday/slideshow/125718127.cms",
            "description": "",
            "pubDate": "2025-12-02T11:57:16.761564"
        }
    ]
}