{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-06T10:32:52.201249",
    "items": [
        {
            "title": "SpiceJet Q1 Results: Airline slips into red with Rs 234 crore YoY loss, revenue falls 36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spicejet-q1-results-airline-slips-into-red-with-rs-234-crore-loss-revenue-falls-36-yoy/articleshow/123719521.cms",
            "description": "SpiceJet faced a setback in the first quarter of fiscal year 2025. The budget carrier announced a consolidated net loss of Rupees 234 crore. This contrasts with a net profit of Rupees 158 crore in the same period last year. Revenue from operations also declined significantly. It fell by 36 percent year-on-year, reaching Rupees 1,060 crore.",
            "pubDate": "2025-09-06T10:32:49.995295"
        },
        {
            "title": "Oyo Q1 FY26 PAT doubles YoY to Rs 200 crore; revenue grows 47% to Rs 2,019 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oyo-q1-fy26-pat-doubles-yoy-to-rs-200-crore-revenue-grows-47-to-rs-2019-crore/articleshow/123718763.cms",
            "description": "Oyo has reported a profit after tax of over Rs 200 crore in the first quarter of fiscal year 2026, with revenue growing 47% to Rs 2,019 crore. The company's Gross Booking Value surged 144% to Rs 7,227 crore, driven by hotel openings and premiumization.",
            "pubDate": "2025-09-06T10:32:49.995418"
        },
        {
            "title": "Small and mid-cap firms lag behind large caps in Q1 earnings show",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/small-and-mid-cap-firms-lag-behind-large-caps-in-q1-earnings-show/articleshow/123687735.cms",
            "description": "An ETIG analysis reveals that small and mid-cap firms underperformed large caps in the June quarter, with profit growth hitting multi-quarter lows. Large caps saw improved profit and sales growth, maintaining stable profit margins, while smaller firms experienced declines.",
            "pubDate": "2025-09-06T10:32:49.995527"
        }
    ]
}