{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-30T23:51:11.744414",
    "items": [
        {
            "title": "Positive Breakout: These 13 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-13-stocks-close-cross-above-their-200-dmas/slideshow/124223828.cms",
            "description": "The closing prices of 13 stocks from the Nifty500 pack crossed above their 200 DMA (Daily Moving Averages) on September 29, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-30T02:36:00.471126"
        },
        {
            "title": "Wall Street indexes climb as investors brush off government shutdown uncertainties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-indexes-climb-as-investors-brush-off-government-shutdown-uncertainties/articleshow/124223656.cms",
            "description": "Wall Street indexes closed higher on Monday. Nasdaq led gains driven by technology stocks. Investors focused on artificial intelligence and future interest rate cuts. Concerns over a potential US government shutdown were largely overlooked. Market experts noted investor focus on economic resilience. This positive sentiment propelled major indices upwards.",
            "pubDate": "2025-09-30T02:36:00.471263"
        },
        {
            "title": "Technical breakout fuels bullish outlook on Canara Bank, say Rajesh Palviya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-breakout-fuels-bullish-outlook-on-canara-bank-say-rajesh-palviya/videoshow/124216081.cms",
            "description": "“The chart for Canara Bank shows a bullish trend in recent months, with the price moving up from its lows. Traders can buy for a target of Rs 140-145 in the short-term,” Rajesh Palviya, Senior Vice President – Research (Head Technical & Derivatives), Axis Securities, said.",
            "pubDate": "2025-09-30T02:36:00.471386"
        },
        {
            "title": "Asian shares flat; gold hits record, dollar drops on shutdown fears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-flat-gold-hits-record-dollar-drops-on-shutdown-fears/articleshow/124223323.cms",
            "description": "Global markets reacted to US government shutdown fears. Gold reached a new record high. The dollar saw losses. US equity futures dipped while Asian shares remained flat. Treasuries gained. Investors worried about delayed economic data, including the jobs report. China announced capital to boost growth. Australia's central bank held rates steady. Oil prices declined.",
            "pubDate": "2025-09-30T02:36:00.471524"
        },
        {
            "title": "Stocks in news: L&T, M&M, Tata Motors, Reliance Power, BEL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-lt-mm-tata-motors-reliance-power-bel/articleshow/124217150.cms",
            "description": "Markets saw volatility but ended flat after a recent slide. L&T secured a $700 million facility. M&M sold its Sampo Rosenlew stake. Premier Energies won $19.95 million solar contracts. Reliance Power sold Indonesian coal entities. BEL secured Rs 1092 crore orders. IRFC inked two loan agreements. Tata Motors faced a rating downgrade. Godrej Agrovet received a Sebi warning.",
            "pubDate": "2025-09-30T02:36:00.471645"
        },
        {
            "title": "GIFT Nifty up 5 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124217445.cms",
            "description": "Indian equities closed flat on Monday amidst mixed global cues and ahead of RBI's MPC decision, with analysts expecting near-term consolidation. Foreign portfolio investors net sold shares worth Rs 2,831 crore. The rupee hit an all-time closing low of 88.79 against the US dollar due to persistent foreign capital outflows and risk-off sentiments.",
            "pubDate": "2025-09-30T02:36:00.471756"
        },
        {
            "title": "SBI sees major growth in credit card business as HDFC Bank holds the top spot",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-sees-major-growth-in-credit-card-business-as-hdfc-bank-holds-the-top-spot/articleshow/124223165.cms",
            "description": "SBI's credit card business experienced a significant post-Covid surge, driven by its youth-focused expansion. HDFC Bank maintained its dominant position in both card issuance and transaction value. Conversely, Standard Chartered Bank faced a sharp decline in both the volume and value of its credit card operations.",
            "pubDate": "2025-09-30T02:36:00.471870"
        },
        {
            "title": "Can MAS Financial regain momentum after a 10% slide?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-mas-financial-regain-momentum-after-a-10-slide/articleshow/124223131.cms",
            "description": "MAS Financial Services stock declined ten percent over two months. Its June quarter net profit rose slower despite higher interest income. Asset quality showed a slight dip. The company projects twenty to twenty-five percent AUM growth this fiscal year. It also expects improved disbursements in the second half.",
            "pubDate": "2025-09-30T02:36:00.471983"
        },
        {
            "title": "Sebi bars Man Industries, executives from market for two years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bars-man-industries-executives-from-market-for-two-years/articleshow/124223125.cms",
            "description": "Sebi has barred Man Industries and three senior executives, including its chairman, from the securities market for two years. This action follows alleged diversion of funds to subsidiaries and misrepresentation of financials. A forensic audit revealed non-disclosure of related party transactions and material events, alongside fund rotation.",
            "pubDate": "2025-09-30T02:36:00.472095"
        },
        {
            "title": "Stock Radar: Canara Bank stock gives a breakout from falling channel to hit fresh 52-week high in September; will the rally continue in October?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-canara-bank-stock-gives-a-breakout-from-falling-channel-to-hit-fresh-52-week-high-in-september-will-the-rally-continue-in-october/articleshow/124210304.cms",
            "description": "Canara Bank has broken out from a falling channel on weekly charts, hitting a fresh 52-week high, with experts suggesting the rally will continue. Short-term traders can buy the stock for a target of Rs 140-145 in the coming weeks, supported by strong technical indicators and rising volumes.",
            "pubDate": "2025-09-30T02:36:00.472208"
        },
        {
            "title": "RBI unveils norms to enable faster transmission of rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-unveils-norms-to-enable-faster-transmission-of-rates/articleshow/124223101.cms",
            "description": "Under the revised directions on interest rate on advances, banks will now be allowed to reduce spread components on floating rate loans before the current three-year lock-in period, a move aimed at benefiting borrowers. This could result in faster transmission of rate cuts, leading to lower EMIs or interest outgo. Additionally, banks may offer borrowers the option to switch to fixed-rate loans at the time of interest rate resets, though this will no longer be mandatory.",
            "pubDate": "2025-09-30T02:36:00.472323"
        },
        {
            "title": "Stocks to buy in 2025 for long term: TVS Motor, Mahanagar Gas among 5 stocks that could give 20-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-tvs-motor-mahanagar-gas-among-5-stocks-that-could-give-20-30-return/slideshow/124224542.cms",
            "description": "Brokerages remain optimistic on select stocks across autos, energy, metals, and renewables, citing strong growth potential and healthy upside.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-30T03:19:59.517647"
        },
        {
            "title": "Ecoline Exim IPO debuts today. GMP signals flat listing ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ecoline-exim-ipo-debuts-today-gmp-signals-flat-listing-ahead/articleshow/124224418.cms",
            "description": "Sustainable packaging manufacturer Ecoline Exim, with exports to over 27 countries, is set to list on the NSE SME platform on September 30. Its IPO drew healthy institutional participation, but subdued retail interest and zero GMP point to cautious listing-day sentiment.",
            "pubDate": "2025-09-30T03:19:59.517781"
        },
        {
            "title": "Matrix Geo Solutions IPO listing today: GMP suggests cautious debut despite strong subscription",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/matrix-geo-solutions-ipo-listing-today-gmp-suggests-cautious-debut-despite-strong-subscription/articleshow/124224388.cms",
            "description": "Matrix Geo Solutions IPO closed with healthy investor interest. The company will list on NSE SME on September 30. The issue was subscribed 7.69 times overall. Qualified institutional buyers led demand. The firm specializes in geospatial and drone technology. It shows strong financial growth. Proceeds will fund equipment and working capital. Grey market premium indicates a restrained listing outlook.",
            "pubDate": "2025-09-30T03:19:59.517900"
        },
        {
            "title": "True Colors IPO listing today. GMP hints at muted listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/true-colors-ipo-listing-today-gmp-hints-at-muted-listing/articleshow/124224354.cms",
            "description": "True Colors, a digital textile printing solutions provider, will debut on the BSE SME platform on September 30. Its IPO saw strong investor demand, subscribed over 45 times. Despite this, grey market signals indicate limited listing gains. The company reported significant revenue and profit growth recently. It focuses on digital textile printing solutions.",
            "pubDate": "2025-09-30T03:19:59.518006"
        },
        {
            "title": "Tata Motors shares in focus as Moody’s downgrades outlook after JLR cyber incident",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-as-moodys-downgrades-outlook-after-jlr-cyber-incident/articleshow/124224310.cms",
            "description": "Tata Motors share price: Moody’s downgraded Tata Motors’ outlook to negative after a cyberattack at JLR halted production. The company's FY26 EBITDA is expected to take a massive hit due to this attack. While JLR has started a phased restart, prolonged disruptions could further affect earnings and cash flows, Moody’s added.",
            "pubDate": "2025-09-30T03:19:59.518111"
        },
        {
            "title": "Power Finance Corporation among 7 stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-finance-corporation-among-7-stocks-showing-bullish-rsi-upswing/slideshow/124224278.cms",
            "description": "Seven stocks from the NSE large cap pack were highlighted in the RSI Trending Up scan on September 29, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-30T03:19:59.518237"
        },
        {
            "title": "Aptus Pharma shares to debut today. Here's what GMP indicates ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aptus-pharma-shares-to-debut-today-heres-what-gmp-indicates-ahead-of-listing/articleshow/124224165.cms",
            "description": "Aptus Pharma will debut on the BSE SME platform on September 30. Its initial public offering closed with high investor participation. The IPO was subscribed over 22 times across categories. Retail and high net worth individuals showed significant demand. The company distributes pharmaceutical formulations. It reported revenue and profit growth. Proceeds will fund working capital and new office infrastructure.",
            "pubDate": "2025-09-30T03:19:59.518339"
        },
        {
            "title": "Subros among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/subros-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/124224135.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, six stocks witnessed a 5-year swing high at the close on September 29, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-30T03:19:59.518438"
        },
        {
            "title": "BharatRohan Airborne Innovations IPO GMP suggests a cautious listing outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharatrohan-airborne-innovations-ipo-gmp-suggests-a-cautious-listing-outlook/articleshow/124223965.cms",
            "description": "Agritech startup BharatRohan Airborne Innovations, leveraging drones and hyperspectral imaging, saw robust demand for its ₹45.04 crore IPO with 10.07x subscription, but muted grey market signals point to a moderate listing.",
            "pubDate": "2025-09-30T03:19:59.518537"
        },
        {
            "title": "IRFC shares in focus on signing loan agreements worth Rs 16,489 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irfc-shares-in-focus-on-signing-loan-agreements-worth-rs-16489-crore/articleshow/124224823.cms",
            "description": "Indian Railway Finance Corporation (IRFC) has inked two loan agreements worth Rs 16,489 crore with Maharashtra and Haryana state utilities to fund thermal power expansion projects. The Rs 10,560 crore deal with MAHAGENCO will support Koradi’s 1,320 MW expansion, while Rs 5,929 crore with HPGCL will aid Yamunanagar’s 800 MW unit, reinforcing IRFC’s role as a diversified infrastructure financier.",
            "pubDate": "2025-09-30T03:52:47.792081"
        },
        {
            "title": "​Nifty September 2025 rejig: IndiGo, Max Health in. Check full list of inclusions, exclusions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-september-2025-rejig-indigo-max-health-in-check-full-list-of-inclusions-exclusions/slideshow/124224792.cms",
            "description": "The NSE Nifty 50 index is set for a major shake-up, with five stocks poised to draw in more than $1 billion in passive flows as the semi-annual Nifty rejig takes effect on September 30, according to Nuvama Institutional Equities. InterGlobe Aviation (IndiGo), and Max Healthcare will together account for the bulk of inflows, while major names such as Hero MotoCorp and IndusInd Bank will exit the 50-share index. Here’s a full list of additions, exclusions, and stocks that will see their weightage increase and decrease.",
            "pubDate": "2025-09-30T03:52:47.792200"
        },
        {
            "title": "HPCL, BPCL among 5 stocks showing Bullish Candlestick Pattern",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hpcl-bpcl-among-5-stocks-showing-bullish-candlestick-pattern/slideshow/124224718.cms",
            "description": "On September 29, five stocks from the Nifty500 pack appeared on the bullish \"White Marubozu\" scanner, according to technical scan data from stockedge.com.A White Marubozu is a bullish candlestick pattern that forms when the opening price is the lowest of the session and the closing price is the highest. Represented by a long white (or green) candle with no upper shadow and little to no lower shadow, it signals strong buying momentum throughout the trading day. Traders often view this as a sign that buyers were firmly in control, using the pattern as a potential indicator of bullish sentiment.",
            "pubDate": "2025-09-30T03:52:47.792301"
        },
        {
            "title": "Sensex, Nifty down 6% in 1 year, yet SIP investors walk away with 9% profit. Here's the trick",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-down-6-in-1-year-yet-sip-investors-walk-away-with-9-profit-heres-the-trick/articleshow/124224657.cms",
            "description": "Indian stock markets saw a 6% decline over the past year. Foreign investors avoided Indian equities. Lumpsum investments in largecap funds resulted in losses. However, systematic investment plans yielded profits for investors. SIPs delivered up to 9% returns even from market peaks. Rupee cost averaging helped mitigate market volatility. This approach provided wealth creation opportunities.",
            "pubDate": "2025-09-30T03:52:47.792401"
        },
        {
            "title": "Sammaan Capital, Oil India, and 5 other F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sammaan-capital-oil-india-and-5-other-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/124224625.cms",
            "description": "As of September 29, futures open interest (OI) saw a notable surge across seven NSE F&O stocks, driving an overall increase of over 6% compared to the previous session. A rise in futures OI indicates higher activity in unexpired contracts, reflecting growing participation as traders either initiate new positions or scale up existing ones.",
            "pubDate": "2025-09-30T03:52:47.792500"
        },
        {
            "title": "BEL shares in focus as co secures orders worth Rs 1,092 crore since last disclosure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-shares-in-focus-as-co-secures-orders-worth-rs-1092-crore-since-last-disclosure/articleshow/124224561.cms",
            "description": "BEL Order Win News: Bharat Electronics Limited (BEL) has secured significant additional orders totaling Rs 1,092 crore since mid-September, encompassing EW system upgrades, defence network improvements, and various equipment. These new contracts further solidify BEL's leading position in India's defence electronics sector. The company's shares are anticipated to be in focus following this announcement.",
            "pubDate": "2025-09-30T03:52:47.792601"
        },
        {
            "title": "Seshaasai Technologies shares slump 7% post listing. Should investors buy the dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/seshaasai-technologies-shares-slump-7-post-listing-should-investors-buy-the-dip/articleshow/124228074.cms",
            "description": "Seshaasai Technologies shares fell nearly 7% from their listing price post-debut, sliding to Rs 405.80 on the BSE after opening with a modest premium over its IPO.",
            "pubDate": "2025-09-30T06:59:00.528781"
        },
        {
            "title": "Hindustan Zinc’s exposure to silver is underpriced, calls for re-rating, says Emkay Global",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zincs-exposure-to-silver-is-underpriced-calls-for-re-rating-says-emkay-global/articleshow/124227003.cms",
            "description": "Hindustan Zinc may gain from silver’s 63% rally this year, with analysts noting its exposure is underpriced, offering potential valuation upside for parent Vedanta.",
            "pubDate": "2025-09-30T06:59:00.528941"
        },
        {
            "title": "BOJ board signals possible near-term rate hike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-board-signals-possible-near-term-rate-hike/slideshow/124226904.cms",
            "description": "Bank of Japan board members discussed whether it is time to raise interest rates, signalling a potential shift toward a hawkish stance. The debate took place during the September policy meeting. (Source: Reuters)",
            "pubDate": "2025-09-30T06:59:00.529056"
        },
        {
            "title": "Tata Motors demerger effective from tomorrow. What is known so far on record date, listing timeline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-demerger-effective-from-tomorrow-what-is-known-so-far-on-record-date-listing-timeline/articleshow/124226946.cms",
            "description": "Tata Motors’ demerger of its passenger and commercial vehicle businesses takes effect from October 1. Shareholders will receive TMLCV shares, with the CV business expected to list in November, aiming to unlock value and provide both units with greater strategic focus amid JLR challenges.",
            "pubDate": "2025-09-30T06:59:00.529162"
        },
        {
            "title": "For investors who can ignore volatility for next 1 year: 5 mid-caps from different sectors with upside potential of over 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-investors-who-can-ignore-volatility-for-next-1-year-5-mid-caps-from-different-sectors-with-upside-potential-of-over-22/articleshow/124226677.cms",
            "description": "We live in uncertain times. The Nifty and Sensex are behaving like yo-yos, up one day and down the next. In such times, it is perhaps good to hit the pause button and take a hard look at your portfolio, especially if it has greater exposure to mid-cap stocks. Why do we say this? Well,  because history teaches us that it is not necessarily the same sectors and stocks which did well in the past that will do well in the next leg of the rally. Even if you do venture into the market, do so with caution and discernment. Be selective in terms of the stock you are buying – especially if you are looking at the mid-cap space.",
            "pubDate": "2025-09-30T06:59:00.529267"
        },
        {
            "title": "Coforge shares rise 2% as CLSA initiates coverage with 'outperform' rating; 51% upside seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coforge-shares-rise-2-as-clsa-initiates-coverage-with-outperform-rating-51-upside-seen/articleshow/124226185.cms",
            "description": "Coforge shares rose to Rs 1,584 after CLSA initiated coverage with an ‘outperform’ rating and a Rs 2,346 price target, citing strong growth in financial services and travel segments.",
            "pubDate": "2025-09-30T06:59:00.529372"
        },
        {
            "title": "Japan’s factory output and retail sales show unexpected slowdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-factory-output-and-retail-sales-show-unexpected-slowdown/slideshow/124226237.cms",
            "description": "Japan’s factory output fell more than expected in August, while retail sales declined for the first time in over three years. These developments have heightened uncertainties about the economic outlook and are keeping the Bank of Japan on alert. (Source: Reuters)",
            "pubDate": "2025-09-30T06:59:00.529472"
        },
        {
            "title": "Japan's Nikkei falls on half-yearly portfolio adjustment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-falls-on-half-yearly-portfolio-adjustment/articleshow/124225949.cms",
            "description": "Japan's Nikkei share average saw a slight decline on Tuesday, attributed to portfolio adjustments and a pause in corporate buybacks at the fiscal half-year end. This market adjustment occurred despite record buybacks this year, as investors remained cautious ahead of the U.S. jobs report and the LDP leadership election. Energy explorers were the worst performers, while the insurance sector gained.",
            "pubDate": "2025-09-30T06:59:00.529569"
        },
        {
            "title": "October seasonality favours bulls as Nifty advanced in 7 of last 10 years. What’s in store this time?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/october-seasonality-favours-bulls-as-nifty-advanced-in-7-of-last-10-years-whats-in-store-this-time/articleshow/124225917.cms",
            "description": "Nifty often rises in October, largely due to domestic investor strength. Foreign investors frequently sold shares, but domestic institutions provided consistent market support. October 2025 faces tariff uncertainties and rich valuations. Q2 earnings and festive consumption are key factors influencing market direction. Experts predict Nifty consolidation, with strong support levels identified for investors.",
            "pubDate": "2025-09-30T06:59:00.529669"
        },
        {
            "title": "Seshaasai Technologies shares debut at 3% premium over IPO price on exchanges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/seshaasai-technologies-shares-debut-at-3-premium-over-ipo-price-on-exchanges/articleshow/124225631.cms",
            "description": "Seshaasai Technologies debuted on exchanges with a modest premium over its Rs 423 IPO price, despite robust subscription numbers. The Rs 813 crore IPO, heavily oversubscribed by institutional investors, saw shares list slightly below unlisted market expectations. Valued at 30.",
            "pubDate": "2025-09-30T06:59:00.529769"
        },
        {
            "title": "Festive tailwinds put auto, FMCG among 9 sectors on smallcase managers’ radar for Navratri 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/festive-tailwinds-put-auto-fmcg-among-9-sectors-on-smallcase-managers-radar-for-navratri-2025/slideshow/124225811.cms",
            "description": "As India steps into its high-energy festive season, buoyed by robust consumption trends, policy tailwinds, and structural growth drivers, attention is turning to sectors ranging from auto components and FMCG to defence and clean energy. In 2025, the country’s Navratri economy is gaining significant traction, with e-commerce festive sales projected to touch Rs 1.2 lakh crore, marking a 27% year-on-year surge.UPI transactions surpassed 20 billion in August, while MSME festive credit demand is expected to climb 35–40% to Rs 3.45 lakh crore. In this environment, investment managers on smallcase have spotlighted nine key sectors poised to benefit from the confluence of festive sentiment, policy reforms, and long-term growth opportunities.",
            "pubDate": "2025-09-30T06:59:00.529885"
        },
        {
            "title": "Solarworld Energy Solutions shares list at 11% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/solarworld-energy-solutions-shares-list-at-a-11-premium-over-ipo-price/articleshow/124225187.cms",
            "description": "Solarworld Energy Solutions debuted on exchanges with a 10.8% premium, listing at Rs 389 against an issue price of Rs 351. Its Rs 490 crore IPO was heavily oversubscribed 68.49 times, reflecting strong investor confidence. The company, providing solar EPC services, reported robust FY25 financials with significant revenue and profit growth.",
            "pubDate": "2025-09-30T06:59:00.529985"
        },
        {
            "title": "Anand Rathi Share and Stock Brokers shares list at 4% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anand-rathi-share-and-stock-brokers-shares-list-at-4-premium-over-ipo-price-on-bse-nse/articleshow/124225291.cms",
            "description": "Anand Rathi Share and Stock Brokers debuted on exchanges with a premium. The listing was below unlisted market expectations. Its initial public offering saw subscription over 21 times. Institutional investors drove demand. The company reported financial performance. Investors will now closely monitor its ability to sustain growth and protect margins. Competition from other brokers remains a challenge.",
            "pubDate": "2025-09-30T06:59:00.530079"
        },
        {
            "title": "Trade tensions and weak demand weigh on Chinese economy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trade-tensions-and-weak-demand-weigh-on-chinese-economy/slideshow/124225671.cms",
            "description": "China’s manufacturing sector shrank for the sixth consecutive month in September. The official Purchasing Managers’ Index (PMI) rose slightly to 49.8 from August’s 49.4 but remained below the 50-mark that separates growth from contraction. This highlights continued pressure on domestic manufacturing. (Source: Reuters)",
            "pubDate": "2025-09-30T06:59:00.530173"
        },
        {
            "title": "Strong uptrend: 5 Nifty stocks that outperformed index in latest quarter may gain up to 28%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-uptrend-5-nifty-stocks-that-outperformed-index-in-latest-quarter-may-gain-up-to-28/slideshow/124225332.cms",
            "description": "The benchmark Nifty50 slipped 3.91% in the latest trailing quarter, but not all stocks followed the downtrend. Trendlyne data shows some counters stood tall, delivering strong double-digit gains and outperforming the benchmark by a wide margin. Here's a look",
            "pubDate": "2025-09-30T06:59:00.530268"
        },
        {
            "title": "These 5 penny stocks have zero debt, returning up to 200% in one year. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-penny-stocks-have-zero-debt-returning-up-to-200-in-one-year-do-you-own-any/slideshow/124225174.cms",
            "description": "In a year when the Nifty delivered muted returns, a few penny stocks with zero debt stood out by delivering massive gains. These counters rallied up to 200% in the past 12 months, attracting investor attention despite their small market caps.",
            "pubDate": "2025-09-30T06:59:00.530368"
        },
        {
            "title": "Tata Investment shares rally over 17% to cross Rs 10,000 mark for first time. What's behind the bull rush?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-shares-rally-over-17-to-cross-rs-10000-mark-for-first-time-whats-behind-the-bull-rush/articleshow/124230029.cms",
            "description": "Tata Investment Corporation shares soared 17.5% to a record high amid heightened anticipation of Tata Sons' potential listing, driven by an RBI mandate deadline. Investor optimism is further boosted by Tata Investment's stake in Tata Capital's upcoming IPO and its recent 1:10 stock split announcement.",
            "pubDate": "2025-09-30T08:49:01.306573"
        },
        {
            "title": "GIFT Nifty derivatives diverge from mainland curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-derivatives-diverge-from-mainland-curbs/articleshow/124229199.cms",
            "description": "India's National Stock Exchange will offer a daily expiry on GIFT Nifty contracts to foreign investors via a tax-neutral jurisdiction as it seeks to attract more global funds, diverging from domestic markets' tighter equity derivatives rules.",
            "pubDate": "2025-09-30T08:49:01.306703"
        },
        {
            "title": "Anand Rathi Share and Stock Brokers extend gains after debut. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anand-rathi-share-and-stock-brokers-extend-gains-after-debut-should-you-buy-sell-or-hold/articleshow/124228840.cms",
            "description": "Anand Rathi shares rose after listing on the exchange. The company's business model includes multiple revenue streams. Client participation and financial product distribution drive income. Experts note the shift in household savings to financial assets. This trend offers growth opportunities for the company.",
            "pubDate": "2025-09-30T08:49:01.306933"
        },
        {
            "title": "Sebi extends timeline to roll out algo trading for retail investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-extends-timeline-to-roll-out-algo-trading-for-retail-investors/articleshow/124236705.cms",
            "description": "India's markets regulator has extended the timeline to roll out algorithmic trading for retail investors, giving stock brokers more time to upgrade their computer networks for ensuring safer participation.",
            "pubDate": "2025-09-30T13:42:06.551885"
        },
        {
            "title": "Gainers & Losers: Tata Investment, Prime Focus among 8 stocks under spotlight on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-tata-investment-prime-focus-among-8-stocks-under-spotlight-on-tuesday/slideshow/124235946.cms",
            "description": "",
            "pubDate": "2025-09-30T13:42:06.552011"
        },
        {
            "title": "India Inc’s proportion of rating upgrades to downgrades rises 2.56x in H1FY26: CareEdge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-incs-proportion-of-rating-upgrades-to-downgrades-rises-2-56x-in-h1fy26-careedge/articleshow/124235471.cms",
            "description": "India Inc.’s credit profile strengthened in H1 FY26, with upgrades outpacing downgrades and corporate leverage at a decade-low. Infrastructure, BFSI, and manufacturing led gains, while microfinance, auto ancillaries, and chemical sectors faced pressure.",
            "pubDate": "2025-09-30T13:42:06.552126"
        },
        {
            "title": "Trump's tariffs on foreign films akin to 'watching a train wreck in slow motion': Capitalmind's Deepak Shenoy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-tariffs-on-foreign-films-akin-to-watching-a-train-wreck-in-slow-motion-capitalminds-deepak-shenoy/articleshow/124235240.cms",
            "description": "US President Donald Trump’s 100% tariff on foreign films rattled Hollywood-linked stocks, but Capitalmind AMC’s Deepak Shenoy said Bollywood will remain resilient, likely pivoting to online releases. The move underscores escalating protectionist trade actions impacting multiple global industries.",
            "pubDate": "2025-09-30T13:42:06.552231"
        },
        {
            "title": "Tata Investment and eight other stocks hit fresh 52-week high; rally up to 65% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-and-eight-other-stocks-hit-fresh-52-week-high-rally-up-to-65-in-a-month/slideshow/124234527.cms",
            "description": "On Tuesday, the benchmark Sensex declined by nearly 97 points, closing at 80,267. However, bucking the broader market trend, nine stocks from the BSE 1000 index surged to their 52-week highs — marking their highest level in the past year. Such breakouts are typically viewed by traders and investors as bullish signals, indicating strong upward momentum and the possibility of further gains.",
            "pubDate": "2025-09-30T13:42:06.552333"
        },
        {
            "title": "Stock Radar: 30% rally in a month! Why Anant Raj stock is looking attractive on charts; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-30-rally-in-a-month-why-anant-raj-stock-is-looking-attractive-on-charts-check-target-stop-loss/articleshow/124212244.cms",
            "description": "Anant Raj stock shows strong momentum. It trades above key moving averages. Experts suggest the stock may be bottoming out. Short-term traders can consider buying. A target of Rs 870 is set for the coming months. The stock rallied over 35 percent recently. It sustained above a strong resistance level. Caution is advised due to overbought conditions.",
            "pubDate": "2025-09-30T13:42:06.552435"
        },
        {
            "title": "China opens stock option market to foreign investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-opens-stock-option-market-to-foreign-investors/articleshow/124233866.cms",
            "description": "China has opened its stock option market to foreign investors, allowing qualified institutions to trade options for hedging purposes. This move by the Shanghai Stock Exchange is part of Beijing's broader strategy to boost the appeal of yuan assets and attract global investors, complementing recent expansions in bond market access and digital yuan promotion.",
            "pubDate": "2025-09-30T13:42:06.552541"
        },
        {
            "title": "Tougher rules on intraday positions to hit F&O traders from tomorrow. How will it impact you?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tougher-rules-on-intraday-positions-to-hit-fo-traders-from-tomorrow-how-will-it-impact-you/articleshow/124233695.cms",
            "description": "Sebi introduces strict intraday limits for index derivatives from October 1, capping positions, enforcing checks, and penalizing breaches, aiming to curb speculative excess, reduce volatility, and ensure orderly trading.",
            "pubDate": "2025-09-30T13:42:06.552658"
        },
        {
            "title": "Market Wrap: D-Street falls for 8th straight session on FMCG, IT sell-off; Sensex drops 97 points, Nifty below 24,650",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-d-street-falls-for-8th-straight-session-on-fmcg-it-sell-off-sensex-drops-97-points-nifty-below-24650/articleshow/124232024.cms",
            "description": "India's heartbeat indices Nifty and the BSE Sensex ended negative on Tuesday recording their eighth successive loss led by selling pressure in consumer, realty and IT stocks though auto, banks and metals capped the declines.",
            "pubDate": "2025-09-30T13:42:06.552760"
        },
        {
            "title": "Tariffs, tech and trouble: Gurmeet Chadha sees bubble in US stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariffs-tech-and-trouble-gurmeet-chadha-sees-bubble-in-us-stocks/articleshow/124231439.cms",
            "description": "Concerns over stretched US tech valuations are mounting as Donald Trump revives tariff-driven trade policies. Gurmeet Chadha warns of a potential “big bubble,” citing digital sovereignty and declining global dependence on American platforms, threatening future growth prospects.",
            "pubDate": "2025-09-30T13:42:06.552858"
        },
        {
            "title": "11 penny stocks with high mutual fund stakes. Hidden gems or risky bets?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-penny-stocks-with-high-mutual-fund-stakes-hidden-gems-or-risky-bets/slideshow/124231156.cms",
            "description": "Mutual funds are making some bold moves—data from the June quarter reveals that they are holding stakes in nearly 100 penny stocks, defined as stocks trading under Rs 20 with market caps below Rs 1,000 crore. Interestingly, 11 of these have MF holdings above 2%, raising eyebrows across the market. But here’s the twist: eight out of these 11 penny stocks have posted negative returns in the last three months, and most of them trade on alarmingly low volumes. Meanwhile, the more actively traded penny stocks barely have any mutual fund presence.This raises a key question: are mutual funds identifying long-term value early, or stepping into risky territory? Penny stocks may seem attractive due to their low prices, but they carry major risks—poor liquidity, high volatility, and limited transparency. Institutional backing can add a layer of credibility, but it doesn’t guarantee safety or returns. (Data Source: ACE Equity)",
            "pubDate": "2025-09-30T13:42:06.552954"
        },
        {
            "title": "PVR Inox, Ranbir Kapoor-backed firm's shares slide 5% as Trump slaps 100% tariff on foreign films",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pvr-inox-ranbir-kapoor-backed-firms-shares-slide-5-as-trump-slaps-100-tariff-on-foreign-films/articleshow/124230587.cms",
            "description": "US President Donald Trump's announcement of a 100% tariff on foreign-made films sent shockwaves through the global entertainment industry. Indian firms PVR Inox and Prime Focus saw their shares decline 5% following the protectionist move. This decision, part of Trump's broader trade policy, creates significant uncertainty for studios reliant on international revenue, raising questions about its implementation and legal basis.",
            "pubDate": "2025-09-30T13:42:06.553052"
        },
        {
            "title": "Florintree-backed Seshaasai shares list at 3% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/florintree-backed-seshaasai-shares-list-at-3-premium-over-ipo-price/articleshow/124238162.cms",
            "description": "Seshaasai Technologies debuted on BSE at ₹436, a 3.07% premium over its IPO price of ₹423. The ₹933 crore issue saw strong demand, subscribed 68x, led by institutional investors. Founders retain 80% stake post listing.",
            "pubDate": "2025-09-30T15:10:58.199249"
        },
        {
            "title": "Two Trades for Today: A PSU oil & gas major for a 5.6% rise, a PSU bank stock for almost 6% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-psu-oil-gas-major-for-a-5-6-rise-a-psu-bank-stock-for-almost-6-gain/articleshow/124237979.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-09-30T15:10:58.199382"
        },
        {
            "title": "Market Trading Guide: Buy Canara Bank, NALCO and 5 more stocks on Wednesday for up to 13% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-canara-bank-nalco-and-5-more-stocks-on-wednesday-for-up-to-13-gains/slideshow/124238121.cms",
            "description": "India’s benchmark indices, the Nifty and Sensex, extended their losing streak to eight sessions on Tuesday, closing in the red amid selling in consumer, realty, and IT stocks. The Nifty index ended weak on the monthly expiry day, facing stiff resistance near its 100-day EMA around the 24,750 zone.Commenting on the day’s action, Vatsal Bhuva, Technical Analyst at LKP Securities said that the index has been forming a lower highs–lower lows pattern for the past three sessions, highlighting strong bearish control. “Unless Nifty reclaims and sustains above its 50-day EMA, the short-term outlook remains negative. Immediate support is placed at 24,500, while resistance lies near 24,800. Post RBI policy outcome and auto sales data, market sentiment may shape further, hence a cautious stance is advised,\" Bhuva said.Here are 7 stock recommendations for Wednesday:",
            "pubDate": "2025-09-30T15:10:58.199478"
        },
        {
            "title": "US stocks trade lower as government shutdown looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-on-last-day-of-quarter-as-government-shutdown-looms/articleshow/124236891.cms",
            "description": "Wall Street's main indexes opened lower on Tuesday, the final day of the third quarter, as investors fretted over likely delays in the release of key economic data due to a potential U.S. government shutdown.",
            "pubDate": "2025-09-30T15:10:58.199561"
        },
        {
            "title": "These 7 banking stocks can give more than 27% returns in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-banking-stocks-can-give-more-than-27-returns-in-1-year-according-to-analysts/articleshow/124240825.cms",
            "description": "One sector where actual performance has been better than what was expected has been banking. Look at the NPA trend. From private banks to PSUs, practically every bank continues to improve its NPA situation. Yes, there are exceptions among small finance banks, but large parts of the retail and wholesale banking space are better placed than they were a year back. Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks along with detailed company analysis focusing on five key components ,earnings, fundamentals, relative valuation, risk, and price momentum, to generate standardized scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2025-09-30T18:25:08.241304"
        },
        {
            "title": "Sebi, stock exchanges waive fines, penalties on Unitech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-stock-exchanges-waive-fines-penalties-on-unitech/articleshow/124239015.cms",
            "description": "Sebi, NSE, and BSE have waived fines on Unitech for past non-compliances and will shift its shares from the restricted Z category to actively traded B category from October 7.",
            "pubDate": "2025-09-30T18:25:08.241436"
        },
        {
            "title": "Pakistan's KSE 100 index rallies 8,000 points in 6 unbeaten sessions. 2 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pakistans-kse-100-index-rallies-8000-points-in-6-unbeaten-sessions-2-reasons-why/articleshow/124238924.cms",
            "description": "Pakistan’s KSE 100 index surged nearly 8,000 points in six sessions, hitting a 52-week high amid improving US ties and a strategic defence pact with Saudi Arabia, boosting investor sentiment and top stock performances.",
            "pubDate": "2025-09-30T18:25:08.241656"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-wednesday/articleshow/124238471.cms",
            "description": "Nifty and Sensex slipped for the eighth straight session on Tuesday amid weakness in consumer, realty, and IT stocks. Analysts flagged a bearish setup with resistance near 24,800 and immediate support at 24,500, urging cautious positioning ahead of RBI policy.",
            "pubDate": "2025-09-30T18:25:08.241759"
        },
        {
            "title": "Stock Radar: This largecap Sensex stock trading in broadening formation; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-this-largecap-sensex-stock-trading-in-broadening-formation-check-target-stop-loss/articleshow/124231055.cms",
            "description": "Larsen & Toubro stock recently bounced back after consolidation. It showed a breakout from its trading range. Experts recommend buying the stock. They suggest a target above Rs 4,000-4,100. This target is for the next two to four months. The stock is currently trading around Rs 3,700. Technical indicators show positive signs.",
            "pubDate": "2025-09-30T23:51:10.967349"
        }
    ]
}