{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-04T20:50:41.159508",
    "items": [
        {
            "title": "S&P 500, Nasdaq end higher on Amazon-OpenAI deal; Fed path forward grows murky",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-end-higher-on-amazon-openai-deal-fed-path-forward-grows-murky/articleshow/125072658.cms",
            "description": "Artificial intelligence deals propelled the S&P 500 and Nasdaq higher on Monday, with Amazon's $38 billion agreement with OpenAI and Nvidia's chip allocation boosting tech stocks.  Despite a foggy monetary policy outlook due to scarce economic data and a government shutdown, market sentiment was supported by positive trade news and dovish Fed commentary.",
            "pubDate": "2025-11-04T02:48:58.266453"
        },
        {
            "title": "GIFT Nifty down 40 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125072365.cms",
            "description": "Indian equities closed modestly higher as investors adopted a cautious stance amidst mixed global signals. Key earnings reports from major companies are due today, with market sentiment expected to be influenced by the ongoing earnings season and potential developments in the India-US trade deal. The India VIX rose, indicating increased trader caution and potential market volatility.",
            "pubDate": "2025-11-04T02:48:58.266575"
        },
        {
            "title": "Stocks in news: SBI, M&M, Airtel, Adani Enterprises, Power Grid",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-sbi-mm-airtel-adani-enterprises-power-grid/articleshow/125072325.cms",
            "description": "Indian markets showed stability, consolidating after October's gains. Corporate earnings and trade developments are now key drivers. Titan reported strong Q2 profit growth, while Bharti Airtel saw a significant jump. Vodafone Idea received relief from the Supreme Court. Cipla is acquiring Inzpera Healthscience, and Adani Power is pursuing international arbitration for payment disputes.",
            "pubDate": "2025-11-04T02:48:58.266674"
        },
        {
            "title": "Asian stocks edge lower after Wall Street gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-lower-after-wall-street-gains/articleshow/125072304.cms",
            "description": "Asian stocks opened lower Tuesday, diverging from Wall Street's tech-driven gains fueled by AI enthusiasm. Traders eyed central bank decisions and economic data, with concerns over high valuations and the Fed's policy outlook persisting despite strong equity market performance this year.",
            "pubDate": "2025-11-04T02:48:58.266767"
        },
        {
            "title": "BSE shares surge as traders build fresh bullish F&O bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-surge-as-traders-build-fresh-bullish-fo-bets/articleshow/125072285.cms",
            "description": "BSE shares surged on Monday following Sebi's assurance against a ban on weekly options, encouraging fresh bullish derivative positions. The stock jumped 4% and ended 2.6% higher, with analysts citing trader confidence and bullish technical indicators for potential further upside. This relief comes after recent pressure due to regulatory uncertainty.",
            "pubDate": "2025-11-04T02:48:58.266884"
        },
        {
            "title": "Nifty Next 50 poised for catch-up rally as valuations turn attractive",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-next-50-poised-for-catch-up-rally-as-valuations-turn-attractive/articleshow/125072245.cms",
            "description": "Cost-conscious investors can consider the Nifty Next 50 index fund for value in large-cap stocks, offering higher earnings growth potential and reasonable valuations. This index provides diversification with exposure to unique industries and lower concentration risk compared to the Nifty 50, making it an attractive option for long-term investors.",
            "pubDate": "2025-11-04T02:48:58.266983"
        },
        {
            "title": "A month without data muddles the economic picture in the US",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-month-without-data-muddles-the-economic-picture-in-the-us/articleshow/125072232.cms",
            "description": "The US economy faces unprecedented uncertainty due to a prolonged government shutdown, halting crucial economic data. This data blackout, the longest in history, leaves economists and policymakers like the Federal Reserve struggling to assess the labor market's health and inflation trends, akin to driving in heavy fog.",
            "pubDate": "2025-11-04T02:48:58.267072"
        },
        {
            "title": "Warburg in talks to sell its 26% stake in IndiaFirst Life",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warburg-in-talks-to-sell-its-26-stake-in-indiafirst-life/articleshow/125072090.cms",
            "description": "Warburg Pincus is in advanced talks to sell its 26% stake in IndiaFirst Life Insurance for approximately ₹10,000 crore. The private equity firm is approaching global strategic investors and PE funds for the exit, with bids expected in early December. Barclays is managing the deal, aiming for a March 2026 signing.",
            "pubDate": "2025-11-04T02:48:58.267167"
        },
        {
            "title": "Are PSU banks entering a new bull phase after stellar Q2 results?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-psu-banks-entering-a-new-bull-phase-after-stellar-q2-results/articleshow/125072059.cms",
            "description": "Public sector banks are performing strongly. Their September quarter earnings have boosted investor confidence. Bank of Baroda and Indian Bank saw significant gains. Analysts note improved valuations and declining NPAs. This resilience makes PSU banks an attractive investment. Their performance outshines private banks and the broader market over the last six months.",
            "pubDate": "2025-11-04T02:48:58.267255"
        },
        {
            "title": "Brookfield lines up $12 bn for green energy in Andhra as it eyes $100 bn India expansion by 2030",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brookfield-lines-up-12-bn-for-green-energy-in-andhra-as-it-eyes-100-bn-india-expansion-by-2030/articleshow/125072192.cms",
            "description": "Brookfield Asset Management will invest twelve billion dollars in Andhra Pradesh's renewable energy sector over the next three years. This is the largest overseas commitment to India's green energy sector. The global firm also plans to establish a township and multiple hotels under its Leela brand.",
            "pubDate": "2025-11-04T02:48:58.267347"
        },
        {
            "title": "Digital units of public banks to undergo review",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/digital-units-of-public-banks-to-undergo-review/articleshow/125072120.cms",
            "description": "The government is gearing up for a comprehensive review of digital banking units with the goal of amplifying financial inclusion and simplifying customer interactions. These innovative units will aid in efforts such as regular customer verification and reclaiming unclaimed assets.",
            "pubDate": "2025-11-04T02:48:58.267525"
        },
        {
            "title": "One Mobikwik Systems Q2 Results: Net loss widens YoY to Rs 29 crore; revenue down 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/one-mobikwik-systems-q2-results-net-loss-widens-yoy-to-rs-29-crore-revenue-down-7/articleshow/125078864.cms",
            "description": "One Mobikwik Systems Q2 Results: Mobikwik reported a sharp drop in Q2FY26 profit to ₹28.6 crore from a net loss of ₹3.3 crore a year earlier, while revenue slipped 7% YoY to ₹270.2 crore, reflecting weaker operational performance.",
            "pubDate": "2025-11-04T07:58:32.505479"
        },
        {
            "title": "Hitachi Energy India shares surge 14% as Q2 profit jumps fourfold, margins expand sharply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hitachi-energy-india-shares-surge-14-as-q2-profit-jumps-fourfold-margins-expand-sharply/articleshow/125078696.cms",
            "description": "Hitachi Energy India shares jumped up to 14% to ₹20,399 after the company reported a stellar Q2FY26 performance, with net profit surging 406% YoY to ₹264.4 crore and PAT margin expanding to 13.8% from 3.4% a year ago.",
            "pubDate": "2025-11-04T07:58:32.505605"
        },
        {
            "title": "Mutual funds bet on 10 high-growth stocks rallying up to 85% — Is your stock on the list?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-bet-on-10-high-growth-stocks-rallying-up-to-85-is-your-stock-on-the-list/slideshow/125078029.cms",
            "description": "Investors often pay close attention to where major institutional players, particularly mutual funds (MFs), are allocating their capital, as these investors typically commit funds only after thorough research and due diligence. When the companies they support also deliver robust profit growth, it becomes an added advantage for retail investors. In the September quarter, around 51 companies reported year-on-year profit growth of 25%, and notably, mutual funds increased their holdings in these companies compared to the previous quarter. Many of these stocks have also rewarded investors with strong price returns in CY25, reflecting both solid fundamentals and market confidence. Among them, we spotlight the top 10 performers, which have recorded gains of 25–85% so far this year. (Data Source: ACE Equity)",
            "pubDate": "2025-11-04T07:58:32.505714"
        },
        {
            "title": "Ambuja Cements shares rise marginally after Q2 PAT surges 268% YoY, brokerages hike target price. Should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ambuja-cements-shares-rise-marginally-after-q2-pat-surges-268-yoy-brokerages-hike-target-price-should-you-buy/articleshow/125077548.cms",
            "description": "Ambuja Cements' share price saw a marginal uptick on Tuesday after the company reported a  268% YoY surge in Q2 FY26 net profit to Rs 1,766 crore, driven by record volumes and strong cost control. Brokerages, including Motilal Oswal, JM Financial, and Elara Capital, raised target prices, citing improving margins and a profitability outlook.",
            "pubDate": "2025-11-04T07:58:32.505816"
        },
        {
            "title": "NSE holidays 2025: Is the stock market closed or open on Nov 5 for Guru Nanak Jayanti 2025?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-holidays-2025-is-the-stock-market-closed-or-open-on-nov-5-for-guru-nanak-jayanti-2025/articleshow/125077286.cms",
            "description": "Indian stock markets, including NSE and BSE, will remain closed on Wednesday, November 5, 2025, for Guru Nanak Jayanti. Trading across all segments will be suspended, marking the only market holiday in November, while MCX will remain shut for the morning session and reopen in the evening.",
            "pubDate": "2025-11-04T07:58:32.505915"
        },
        {
            "title": "FIIs dump Indian consumer stocks despite tax cut boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-dump-indian-consumer-stocks-despite-tax-cut-boost/articleshow/125077082.cms",
            "description": "Foreign investors reduced their stakes in Indian consumer stocks during the September quarter, despite a consumption tax cut aimed at boosting spending. While retail sales saw an 8.5% increase during the festival season, economists caution that pent-up demand and ongoing economic headwinds like slow income growth may temper the outlook.",
            "pubDate": "2025-11-04T07:58:32.506018"
        },
        {
            "title": "F&O Radar| Deploy Bear Put Spread in Nifty to benefit from volatility amid short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bear-put-spread-in-nifty-to-benefit-from-volatility-amid-short-buildup/articleshow/125076689.cms",
            "description": "Nifty held above 25,700 despite weakness in futures, while rising India VIX and FII short buildup signal caution. ICICI Securities’ Jay Thakkar suggests deploying a Bear Put Spread strategy, with a 41-point outflow, breakeven at 25,759, and maximum profit of 590 points below 25,700.",
            "pubDate": "2025-11-04T07:58:32.506113"
        },
        {
            "title": "Fitch Ratings upgrades outlook on Adani Ports and Adani Energy to 'Stable'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fitch-ratings-upgrades-outlook-on-adani-ports-and-adani-energy-to-stable/articleshow/125076740.cms",
            "description": "Fitch Ratings has taken a positive step by upgrading the outlook for Adani Ports and Adani Energy Solutions to Stable. This decision underscores the Adani Group's impressive access to a wide range of funding options.",
            "pubDate": "2025-11-04T07:58:32.506230"
        },
        {
            "title": "3M India shares zoom 13% after reporting 43% YoY surge in Q2 PAT, ICICI Securities raises target price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/3m-india-shares-zoom-13-after-reporting-43-yoy-surge-in-q2-pat-icici-securities-raises-target-price/articleshow/125076296.cms",
            "description": "Shares of 3M India surged 13% to Rs 34,700 after reporting a 43% year-on-year rise in Q2FY26 profit to Rs 191 crore. Revenue grew 14%, led by broad-based sales across all segments. ICICI Securities raised its target to Rs 35,700, citing strong auto demand and government-led infrastructure momentum.",
            "pubDate": "2025-11-04T07:58:32.506324"
        },
        {
            "title": "Thangamayil Jewellery shares rise 19%, up 50% in 4 sessions. What’s fuelling the sharp surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thangamayil-jewellery-shares-rise-19-up-50-in-4-sessions-whats-fuelling-the-sharp-surge/articleshow/125076185.cms",
            "description": "Thangamayil Jewellery surged 19% to a record high of Rs 3,089 after posting a strong turnaround in Q2FY26 and record sales in October. The company reported a net profit of Rs 58.5 crore versus a loss last year, while revenue jumped 45% YoY. October revenue crossed Rs 1,000 crore for the first time, driven by festive demand.",
            "pubDate": "2025-11-04T07:58:32.506426"
        },
        {
            "title": "For risk-takers with slightly long-term perspective: 7 mid-cap stocks from different sectors with an upside potential of up to 45%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-risk-takers-with-slightly-long-term-perspective-7-mid-cap-stocks-from-different-sectors-with-an-upside-potential-of-up-to-45/articleshow/125075897.cms",
            "description": "While it is at the index level, there are indications that mid-caps are making a serious attempt at a comeback. There is, however, a mix of head and tailwinds. As an investor, what should you do in such a scenario? We say it is time to increase your risk-quotient. Why? Because you need to make a distinction between tariff-related politics and macro-economic reform. The direct impact of politics will pass, but the impact of macro reforms lasts much longer. So be bullish. But exercise caution.",
            "pubDate": "2025-11-04T07:58:32.506517"
        },
        {
            "title": "4 stocks Ashish Kacholia trimmed in September quarter amid Rs 2,740 crore portfolio reshuffle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/4-stocks-ashish-kacholia-trimmed-in-september-quarter-amid-rs-2740-crore-portfolio-reshuffle/slideshow/125076015.cms",
            "description": "Veteran investor Ashish Kacholia pared stakes in a handful of portfolio companies during the September 2025 quarter, signaling selective profit-taking after a strong multi-year run in several of his bets. Kacholia currently holds 48 publicly listed stocks worth over Rs 2,739 crore. In the latest quarter, he marginally trimmed his holdings in Dhabriya Polywood, Fineotex Chemical, Xpro India, and Brand Concepts, as part of a broader realignment across his diversified portfolio spanning manufacturing, infra, and specialty chemical plays.",
            "pubDate": "2025-11-04T07:58:32.506616"
        },
        {
            "title": "Hero MotoCorp shares fall 3% as October sales drop 6%; exports jump 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-fall-3-as-october-sales-drop-6-exports-jump-43/articleshow/125075694.cms",
            "description": "Hero MotoCorp shares slipped 3% to Rs 5,382 after reporting a 6.3% decline in October sales for FY26, driven by lower motorcycle and domestic sales. However, scooter and export volumes rose sharply. Citi retained its Buy rating with a Rs 6,100 target, citing festive demand and solid retail momentum.",
            "pubDate": "2025-11-04T07:58:32.506710"
        },
        {
            "title": "Vodafone Idea shares in focus after SC order paves way for AGR relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-after-sc-order-paves-way-for-agr-relief/articleshow/125075602.cms",
            "description": "Vodafone Idea shares: The Supreme Court has allowed the Centre to reassess telecom companies’ pending AGR dues beyond FY 2016-17, clarifying that the review isn’t restricted to that year alone — a move that could offer wider relief to the debt-laden firms.",
            "pubDate": "2025-11-04T07:58:32.506804"
        },
        {
            "title": "Cipla shares in focus after deal to acquire Inzpera Healthsciences for Rs 111 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cipla-shares-in-focus-after-deal-to-acquire-inzpera-healthsciences-for-rs-111-crore/articleshow/125075539.cms",
            "description": "Cipla shares: Cipla has agreed to acquire a 100% stake in Inzpera Healthsciences, making it a wholly owned subsidiary, as part of its strategy to strengthen its presence in the paediatric and wellness segment.",
            "pubDate": "2025-11-04T07:58:32.506895"
        },
        {
            "title": "Japan’s factory activity hits 19-month low as demand slumps",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-factory-activity-hits-19-month-low-as-demand-slumps/slideshow/125075548.cms",
            "description": "Japan’s manufacturing activity shrank at the fastest pace in 19 months in October, as weakness in the automotive and semiconductor industries deepened. The S&P Global Manufacturing PMI slipped to 48.2 from 48.5 in September, marking the fourth consecutive month below the 50.0 threshold that separates expansion from contraction. (Source: Reuters)",
            "pubDate": "2025-11-04T07:58:32.506983"
        },
        {
            "title": "Debt-free and FII-favourites: The small-cap stars shining in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/debt-free-and-fii-favourites-the-small-cap-stars-shining-in-2025/articleshow/125082548.cms",
            "description": "A study identifies 22 debt-free small-cap companies with rising FII stakes and solid FY25 profits above ₹100 crore. CarTrade Tech, FIEM, eClerx, Swaraj Engines, and NBCC (India) lead gains with up to 103% returns.",
            "pubDate": "2025-11-04T09:28:10.586283"
        },
        {
            "title": "Earnings rebound on the cards? Q2 results so far show marginal Nifty upgrades, midcaps outperform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-rebound-on-the-cards-q2-results-so-far-show-marginal-nifty-upgrades-midcaps-outperform/articleshow/125082119.cms",
            "description": "India Inc’s Q2 FY26 earnings are outperforming expectations, led by oil & gas, capital goods, and technology sectors. Motilal Oswal notes modest Nifty EPS upgrades as midcaps continue to outperform largecaps, margins expand 170 bps YoY, and the earnings cycle shows signs of bottoming out for sustained growth.",
            "pubDate": "2025-11-04T09:28:10.586411"
        },
        {
            "title": "Adani Enterprises board approves Rs 25,000 crore rights issue to eligible shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-board-approves-rs-25000-crore-rights-issue-to-eligible-shareholders/articleshow/125083437.cms",
            "description": "Adani Enterprises, the flagship Adani Group company, announced on Tuesday, November 4, that its board has approved raising up to Rs 25,000 crore through a rights issue of partly paid-up equity shares with a face value of Re 1 each.",
            "pubDate": "2025-11-04T09:59:52.781345"
        },
        {
            "title": "Bernstein initiates coverage on Eternal, Swiggy with ‘Outperform’ ratings, sees strong upside in QC, food delivery",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bernstein-initiates-coverage-on-eternal-swiggy-with-outperform-ratings-sees-strong-upside-in-qc-food-delivery/articleshow/125082928.cms",
            "description": "Global brokerage firm Bernstein has initiated coverage on India’s leading e-commerce platforms, Eternal and Swiggy, assigning an ‘Outperform’ rating to both, with target prices of Rs 390 and Rs 570, respectively.",
            "pubDate": "2025-11-04T09:59:52.781469"
        },
        {
            "title": "SBICAP Securities appoints Bhuvaneshwari A. as Managing Director & CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbicap-securities-appoints-bhuvaneshwari-a-as-managing-director-ceo/articleshow/125091939.cms",
            "description": "SBICAP Securities has appointed Bhuvaneshwari A. as its new Managing Director and Chief Executive Officer. She brings over three decades of experience from SBI. Bhuvaneshwari aims to make SBICAP Securities a digitally driven, customer-centric, and innovation-led investment services company. The focus will be on strengthening technology, expanding products, and deepening customer engagement.",
            "pubDate": "2025-11-04T17:43:24.260067"
        },
        {
            "title": "Nuvama announces 1:5 stock split, Rs 70 per share interim dividend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-announces-15-stock-split-rs-70-per-share-interim-dividend/articleshow/125091430.cms",
            "description": "Nuvama Wealth Management has announced a 1:5 stock split and a Rs 70 interim dividend. The company reported its Q2 earnings, showing a marginal decrease in consolidated net profit. Revenue from operations saw an increase compared to the previous year. The stock split will divide each Rs 10 share into five Rs 2 shares.",
            "pubDate": "2025-11-04T17:43:24.260176"
        },
        {
            "title": "Shriram Finance, Bharti Airtel among 9 stocks that hit 52-week highs and gained up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-bharti-airtel-among-9-stocks-that-hit-52-week-highs-and-gained-up-to-25-in-a-month/slideshow/125087010.cms",
            "description": "On Tuesday, the benchmark Sensex dropped by about 519 points, ending the session at 83,459. Despite the broader market downturn, 9 stocks from the BSE 200 Index hit their 52-week highs — the highest levels in a year. Such breakouts are typically seen by traders and investors as bullish indicators, pointing to solid upward momentum and potential for additional gains.",
            "pubDate": "2025-11-04T17:43:24.260270"
        },
        {
            "title": "Palantir's bull run stalls as Burry bets against the AI darling; shares fall 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/palantirs-bull-run-stalls-as-burry-bets-against-the-ai-darling-shares-fall-6/articleshow/125091115.cms",
            "description": "Palantir Technologies shares dropped 6 percent on Tuesday. This occurred even after the company released a strong quarterly update and forecast. Demand for its data analytics services is rising due to AI adoption. Investor Michael Burry has placed bearish bets on Palantir. This has raised concerns about the AI and tech industry's spending.",
            "pubDate": "2025-11-04T17:43:24.260383"
        },
        {
            "title": "Bajaj Financial Securities buys stake in Lemnisk as early investors partly exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-financial-securities-buys-stake-in-lemnisk-as-early-investors-partly-exit/articleshow/125090523.cms",
            "description": "Bajaj Financial Securities has acquired a stake in customer data platform Lemnisk through a secondary transaction, offering partial exits to early investors like growX Ventures. The deal highlights the growing demand for real-time customer data platforms and AI-driven personalization among Indian enterprises. Investors maintain their stakes, underscoring continued confidence in Lemnisk's long-term potential.",
            "pubDate": "2025-11-04T17:43:24.260492"
        },
        {
            "title": "Berger Paints Q2 profit drops 23% to Rs 206 crore on weak monsoon demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berger-paints-q2-profit-drops-23-to-rs-206-crore-on-weak-monsoon-demand/articleshow/125090408.cms",
            "description": "Berger Paints India reported a 23% drop in September quarter profit. Extended monsoon rains affected demand. Revenue saw a slight increase. The company expects demand to pick up after Diwali. Improved weather and pent-up demand are anticipated. Raw material prices are also expected to aid gross margins.",
            "pubDate": "2025-11-04T17:43:24.260587"
        },
        {
            "title": "Dow crashes 400 points, S&P 500, Nasdaq tumble 1% after big banks flag pullback risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-crashes-400-points-sp-500-nasdaq-tumble-1-after-big-banks-flag-pullback-risk/articleshow/125090046.cms",
            "description": "Wall Street's main indexes tumbled on Tuesday as investors questioned lofty tech valuations after the CEOs of top Wall Street banks warned of a stock market selloff, while AI favorite Palantir's sales forecast failed to impress investors.",
            "pubDate": "2025-11-04T17:43:24.260694"
        },
        {
            "title": "Arvind Fashions reports 25% growth in footwear as GST reduction boosts consumer demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/arvind-fashions-reports-25-growth-in-footwear-as-gst-reduction-boosts-consumer-demand/articleshow/125090001.cms",
            "description": "Arvind Fashions' CEO Amisha Jain reported a settlement in BIS certification disruptions, leading to over 25% year-on-year growth in the footwear category during the July-September quarter. Reduced GST rates are expected to boost demand in the coming months, with premium apparel brands like US Polo, Tommy Hilfiger, and Calvin Klein maintaining strong growth momentum.",
            "pubDate": "2025-11-04T17:43:24.260791"
        },
        {
            "title": "Zerodha helps Groww grow: Nithin Kamath’s cheeky congrats steals the show on IPO day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zerodha-helps-groww-grow-nithin-kamaths-cheeky-congrats-steals-the-show-on-ipo-day/articleshow/125089531.cms",
            "description": "Zerodha founder Nithin Kamath humorously acknowledged competitor Groww's IPO, noting a significant portion of applications came from Zerodha customers. Groww's IPO opened to a decent start, with the retail portion showing strong enthusiasm. Despite competition, both platforms are instrumental in simplifying investing for millions in India.",
            "pubDate": "2025-11-04T17:43:24.260890"
        },
        {
            "title": "Fitch ups rating outlook for Adani Ports, Adani Energy to ‘stable’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fitch-ups-rating-outlook-for-adani-ports-adani-energy-to-stable/articleshow/125088945.cms",
            "description": "Fitch Ratings has upgraded its outlook for Adani Ports and Adani Energy Solutions to stable. The agency believes contagion risks for these Adani group companies have eased. Fitch maintained the BBB- rating for both companies and Adani Electricity Mumbai. The Adani group has shown access to diverse funding sources. Investments are continuing with capital expenditure picking up.",
            "pubDate": "2025-11-04T17:43:24.260982"
        },
        {
            "title": "Stock Radar: RIL stock showing signs of bottoming out 2-month consolidation; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-ril-stock-showing-signs-of-bottoming-out-2-month-consolidation-what-should-investors-do/articleshow/125056471.cms",
            "description": "Reliance Industries finds support above its 50-week moving average after months of consolidation. Experts see bullish momentum, projecting an upside target of Rs 1,565 with a stop loss at Rs 1,450.",
            "pubDate": "2025-11-04T17:43:24.261075"
        },
        {
            "title": "Gainers & Losers: Hitachi Energy, Hero MotoCorp among 6 stocks that moved most on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-hitachi-energy-hero-motocorp-among-6-stocks-that-moved-most-on-tuesday/slideshow/125085887.cms",
            "description": "",
            "pubDate": "2025-11-04T17:43:24.261167"
        },
        {
            "title": "Angel One pays Rs 34.57 lakh to Sebi to settle case of disclosure lapses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/angel-one-pays-rs-34-57-lakh-to-sebi-to-settle-case-of-disclosure-lapses/articleshow/125085521.cms",
            "description": "Brokerage house Angel One on Tuesday settled a case of alleged disclosure lapses with markets regulator Sebi by paying Rs 34.57 lakh.",
            "pubDate": "2025-11-04T17:43:24.261267"
        },
        {
            "title": "Turnaround Story: 10 stocks shift from loss to profit in September '25 quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/turnaround-story-10-stocks-shift-from-loss-to-profit-in-september-25-quarter/slideshow/125085290.cms",
            "description": "A \"Turnaround Story YoY\" indicates that the company has gone from incurring a net loss in the same quarter last year to reporting a net profit in the latest quarter, signaling a significant improvement in its financial performance and recovery. In the Nifty500 pack, we have highlighted the top 10 stocks that reported net profits in the September '25 quarter, compared to net losses in the same quarter last year, according to StockEdge profitability scan data.",
            "pubDate": "2025-11-04T17:43:24.261358"
        },
        {
            "title": "Market Wrap: Nifty slips below 25,600, Sensex plunges 520 points on sell-off in IT, auto stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-nifty-slips-below-25600-sensex-plunges-by-520-points-on-sell-off-in-it-auto-stocks/articleshow/125084883.cms",
            "description": "Indian equity benchmarks Nifty and Sensex experienced sharp declines on Tuesday, extending their losing streak. The IT, auto, and metal sectors were major contributors to the downturn. Despite broader market weakness, select stocks like Bharti Airtel and Titan Company reached record or multi-year highs on positive earnings reports.",
            "pubDate": "2025-11-04T17:43:24.261472"
        },
        {
            "title": "These 9 banking stocks can give more than 20% returns in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-banking-stocks-can-give-more-than-20-returns-in-1-year-according-to-analysts/articleshow/125096225.cms",
            "description": "It is probably after a long time that a PSU bank’s results have surprised the street. Why? Because it was able to maintain its net interest margin, or NIM, at a time when margins were expected to decline in the entire banking space. Declining interest rates tend to create short-term pressure on margins. But look at the performance of a large number of banks – they have been able to buck this old trend. It appears that the RBI’s oversight has had a salutary effect on banks. Gross NPAs are at decadal lows across many banks. Provisioning buffers are strong, reducing future credit cost pressures. Will this lead to a situation where banks lead the next phase of rally in the markets?",
            "pubDate": "2025-11-04T20:50:40.489568"
        }
    ]
}