{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-26T02:33:43.492479",
    "items": [
        {
            "title": "RBI's oversubscribed VRRR auction signals strong bank participation amid falling overnight rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbis-oversubscribed-vrrr-auction-signals-strong-bank-participation-amid-falling-overnight-rates/articleshow/122916015.cms",
            "description": "The variable rate reverse repo auction saw strong demand. Banks chose to deposit funds with the Reserve Bank of India. This happened amidst a decrease in overnight money market rates. The central bank intervened to maintain rates around the policy repo rate. Lower auction size and liquidity expectations drove higher participation. The weighted average call rate also experienced a decline.",
            "pubDate": "2025-07-26T02:33:28.704021"
        },
        {
            "title": "Bajaj Finance drops nearly 5% amid analyst concerns over MSME asset quality",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-drops-nearly-5-amid-analyst-concerns-over-msme-asset-quality/articleshow/122915997.cms",
            "description": "Bajaj Finance shares experienced a 4.7% drop on Friday due to analysts' concerns about asset quality pressures within the MSME sector following the first-quarter results. JP Morgan anticipates potential negative earnings revisions stemming from downside risks to growth guidance and emerging stress in the MSME portfolio. UBS's price target even suggests a possible downside of 18%.",
            "pubDate": "2025-07-26T02:33:28.704151"
        },
        {
            "title": "These 9 stocks witness decreasing promoter holdings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-stocks-witness-decreasing-promoter-holdings/slideshow/122906706.cms",
            "description": "",
            "pubDate": "2025-07-26T02:33:28.704261"
        },
        {
            "title": "India's equity indices fall for fourth consecutive week amid weak earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-equity-indices-fall-for-fourth-consecutive-week-amid-weak-earnings/articleshow/122915881.cms",
            "description": "Indian equity indices experienced a nearly 1% decline on Friday, marking the fourth consecutive week of losses, influenced by disappointing earnings from major companies and cautious sentiment in Asian markets. The NSE Nifty concluded at 24,837.00, while the BSE Sensex closed at 81,463.09. Investors are also showing concern about the potential impact of the India-US trade deal.",
            "pubDate": "2025-07-26T02:33:28.704367"
        },
        {
            "title": "Dixon’s JV with Chinese firm gets govt nod, other Indian companies may follow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixons-jv-with-chinese-firm-gets-govt-nod-other-indian-companies-may-follow/articleshow/122915930.cms",
            "description": "Indian electronics companies are now eager to collaborate with Chinese firms. This follows the government's approval of Dixon Technologies' joint venture. Epack Durable and others are considering similar partnerships. The move signals a potential easing of restrictions on Chinese investment. This is crucial for India's electronics component manufacturing scheme.",
            "pubDate": "2025-07-26T02:33:28.704469"
        },
        {
            "title": "IRDAI warns brokers on deal rush",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/irdai-warns-brokers-on-deal-rush/articleshow/122915951.cms",
            "description": "\"We have been witnessing record activity among brokers and other distribution intermediaries,\" said Satyajit Tripathy, member (distribution), IRDAI, at an Insurance Brokers Association of India event. \"While this is fine by all means, I must add a word of caution that with increased growth being seen, we need not be adopting what we call as sharp practices to increase valuation, get listed, and to do business in a way, which may in the long run prove detrimental to the whole ecosystem.\"",
            "pubDate": "2025-07-26T02:33:28.704569"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of 13 to 45% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-13-to-45-in-1-year/articleshow/122910885.cms",
            "description": "More than the Nifty and Sensex taking a beating, what has changed in the last two sessions (and is more worrying) is negative market breadth. The risk of the situation getting worse if the indices remain under pressure is high. Especially as valuations are still on the higher side. In such a situation, what should bother you more? What happens in the market over the next few days or months? Or how a business is going to pan out? The business, of course.",
            "pubDate": "2025-07-26T02:33:28.704664"
        },
        {
            "title": "TVS Motor board to consider raising funds next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tvs-motor-board-to-consider-raising-funds-next-week/articleshow/122907716.cms",
            "description": "TVS Motor Company on Friday said its board will next week consider and approve raising of funds via the issue of securities on a private placement basis.",
            "pubDate": "2025-07-26T02:33:28.704776"
        },
        {
            "title": "US stocks rise on US-EU trade deal prospects; Intel falls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-steady-as-investors-prepare-for-august-1-deadline/articleshow/122907279.cms",
            "description": "Wall Street's main indexes opened steady on Friday following record closes for the S&P 500 and the Nasdaq in the previous session, while investors looked for signs of progress in trade talks as they braced for the August 1 tariff deadline.",
            "pubDate": "2025-07-26T02:33:28.704877"
        },
        {
            "title": "Airtel Africa Q1 profit jumps 20% on Nigeria-led tariff boost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/airtel-africa-q1-profit-jumps-20-on-nigeria-led-tariff-boost/articleshow/122906597.cms",
            "description": "Airtel Africa posted a 25% YoY revenue surge to $1.41 billion and a 20% profit rise to $156 million in Q1 FY26, driven by tariff hikes, strong data growth, and subscriber expansion, especially in Nigeria and Francophone Africa.",
            "pubDate": "2025-07-26T02:33:28.704976"
        },
        {
            "title": "Laurus Labs among 7 stocks that hit 52-week highs and rallied up to 25% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/laurus-labs-among-7-stocks-that-hit-52-week-highs-and-rallied-up-to-25-in-a-month/slideshow/122906020.cms",
            "description": "",
            "pubDate": "2025-07-26T02:33:28.705074"
        },
        {
            "title": "Youngsters want to become Nikhil or Nithin Kamath but don't want to use Zerodha: Ankur Warikoo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/youngsters-want-to-become-nikhil-or-nithin-kamath-but-dont-want-to-use-zerodha-ankur-warikoo/articleshow/122905282.cms",
            "description": "Influencer Ankur Warikoo critiqued Zerodha's shrinking appeal among young investors, citing its lack of fun, relatability, and aspirational branding. He advised content revamp, cultural relevance, and positioning Zerodha as a cool, quiet rebel in investing. It was in response to Founder and CEO Nithin Kamath, posing a question for founders and marketing professionals on his X handle if traditional strategies used in the past to acquire customers will be useful now.",
            "pubDate": "2025-07-26T02:33:28.705262"
        },
        {
            "title": "Stock Radar: This smallcap stock breaks out from Flag pattern to hit fresh record high in July 2025; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-this-smallcap-stock-breaks-out-from-flag-pattern-to-hit-fresh-record-high-in-july-2025-time-to-buy-or-book-profits/articleshow/122882221.cms",
            "description": "Swaraj Engines Ltd. recently broke out from a flag pattern on weekly charts, reaching new record highs. Experts suggest a potential buying opportunity for short-term traders, targeting Rs 5,500 within 1-2 months. The stock exhibits bullish indicators, supported by strong volumes and consistent trading above key exponential moving averages, indicating a continued uptrend.",
            "pubDate": "2025-07-26T02:33:28.705355"
        },
        {
            "title": "Sensex set to hit 115,836 by FY28 on earnings momentum: Ventura",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-set-to-hit-115836-by-fy28-on-earnings-momentum-ventura/articleshow/122904050.cms",
            "description": "Ventura Securities projects Sensex at 115,836 and Nifty at 43,876 by FY28, backed by 12–14% EPS growth and resilient macro trends. Sectors like engineering and BFSI drive earnings momentum. India’s demographics, reforms, and stable debt levels position it as a top global investment destination despite persistent risks.",
            "pubDate": "2025-07-26T02:33:28.705447"
        },
        {
            "title": "Short-term valuation headwinds? Yes. Long-term growth potential intact? Yes. Which ‘Yes’ is more relevant?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/short-term-valuation-headwinds-yes-long-term-growth-potential-intact-yes-which-yes-is-more-relevant/articleshow/122903632.cms",
            "description": "What is “financialization of savings”? Well, it is the trend of shifting savings from traditional, physical assets like real estate or gold to financial assets like stocks, mutual funds, or bonds. It is a trend that is only catching on in India, compared to developed economies where it is the norm. How do we say it is a growing trend? Because there is clear historical evidence of this. And there is no doubt that, on an absolute basis, the total number of investors trading in the Indian markets will be higher two years from now. Also, given the corrections and volatility we have seen of late, this participation may well take the safer MF route.",
            "pubDate": "2025-07-26T02:33:28.705538"
        }
    ]
}