{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-07T11:55:15.746652",
    "items": [
        {
            "title": "Trent Q2 Results: Profit rises 11% YoY to Rs 377 crore, revenue up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trent-q2-results-profit-rises-11-yoy-to-rs-377-crore-revenue-up-16/articleshow/125159074.cms",
            "description": "Trent Ltd on Friday consolidated profit at Rs 377 crore, marking an 11% YoY rise. Revenues during the quarter improved 16% YoY to Rs 4,818 crore.",
            "pubDate": "2025-11-07T11:39:47.876682"
        },
        {
            "title": "Smartworks reports 21% growth in revenue during Q2FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/smartworks-reports-21-growth-in-revenue-during-q2fy26/articleshow/125159233.cms",
            "description": "Managed workspace provider Smartworks reported a 21% year-on-year revenue growth to Rs 424 crore in Q2FY26, alongside a significant 45% reduction in gross debt post-IPO. The company also secured the world's largest managed office campus in Mumbai, bolstering its portfolio to 12.7 million sq. ft. across 14 cities.",
            "pubDate": "2025-11-07T11:39:47.876809"
        },
        {
            "title": "Nykaa Q2 Results: Cons PAT skyrockets 243% YoY to Rs 34 crore, revenue jumps 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nykaa-q2-results-cons-pat-skyrockets-243-yoy-to-rs-34-crore-revenue-jumps-by-25/articleshow/125157804.cms",
            "description": "Nykaa Q2 Results: FSN E-Commerce Ventures which operates Nykaa brand, reported a 243% YoY jump in its consolidated Q2 net profit at Rs 34 crore versus Rs 10 crore in the year ago period. The profit after tax (PAT) is attributable to the equity shareholders of parent.",
            "pubDate": "2025-11-07T11:39:47.876942"
        },
        {
            "title": "Triveni Engineering Q2 Results: Net loss narrows to Rs 21.38 crore, revenue sees upstick",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/triveni-engineering-q2-results-net-loss-narrows-to-rs-21-38-crore-revenue-sees-upstick/articleshow/125157549.cms",
            "description": "Triveni Engineering and Industries has reported a consolidated net profit of Rs 21.38 crore for the second quarter of the 2025-26 fiscal on higher income.",
            "pubDate": "2025-11-07T11:39:47.877048"
        },
        {
            "title": "Hindalco Q2 Results: Cons profit jumps 21% YoY to Rs 4,741 crore, revenue up 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hindalco-q2-results-cons-profit-jumps-21-yoy-to-rs-4741-crore-revenue-up-13/articleshow/125154351.cms",
            "description": "Hindalco Q2 Results: Hindalco Industries announced a robust 21% year-on-year increase in its consolidated net profit for Q2, reaching Rs 4,741 crore. This growth was accompanied by a 13% rise in revenue from operations, which stood at Rs 66,058 crore for the quarter. The company's financial performance reflects strong year-on-year gains.",
            "pubDate": "2025-11-07T11:39:47.877149"
        },
        {
            "title": "Divi’s Laboratories Q2 Results: Cons profit jumps 35% YoY to Rs 689 crore, revenue up 16%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/divis-laboratories-q2-results-cons-profit-jumps-35-yoy-to-rs-689-crore-revenue-up-16/articleshow/125151857.cms",
            "description": "Divi's Laboratories reported a robust financial performance for the second quarter of FY26, with consolidated net profit soaring by 35% year-on-year to Rs 689 crore. The pharmaceutical major also witnessed a significant 16% increase in consolidated revenue from operations, reaching Rs 2,715 crore for the period.",
            "pubDate": "2025-11-07T11:39:47.877245"
        },
        {
            "title": "Bajaj Auto Q2 Results: Cons PAT soars 53% YoY to Rs 2,122 crore, revenue rises 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q2-results-cons-pat-soars-53-yoy-to-rs-2122-crore-revenue-rises-19/articleshow/125159539.cms",
            "description": "Bajaj Auto Q2 Results: Two-wheeler major Bajaj Auto on Friday reported a 53% YoY jump in its consolidated Q2 net profit at Rs 2,122 crore versus Rs 1,385 crore in the year ago period.​​ The profit after tax (PAT) is attributable to the owners of the company.",
            "pubDate": "2025-11-07T11:55:14.845612"
        }
    ]
}