{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-04T17:43:21.304034",
    "items": [
        {
            "title": "Adani Port Q2 Results: Cons net profit rises 27% YoY to Rs 3,109 crore, revenue jumps 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-port-q2-results-cons-net-profit-rises-27-yoy-to-rs-3109-crore-revenue-jumps-30/articleshow/125079388.cms",
            "description": "Adani Port Q2 Results: Adani Ports has announced strong financial results for the second quarter ending September 2025. The company's consolidated net profit saw a significant jump of 27 percent year-on-year. Revenue from operations also climbed by nearly 30 percent compared to the same period last year. These figures highlight robust growth for Adani Ports.",
            "pubDate": "2025-11-04T07:50:49.284162"
        },
        {
            "title": "Suzlon Energy Q2 Results: PAT soars 538% YoY to Rs 1,279 crore, highest in 30 years; revenue jumps 85%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/suzlon-energy-q2-results-pat-soars-538-yoy-to-rs-1279-crore-highest-in-30-years-revenue-jumps-85/articleshow/125076590.cms",
            "description": "Suzlon Energy Q2 Results: Suzlon Energy achieved a record profit in the second quarter of FY26. Profit After Tax surged 538 percent year-on-year. Revenue from operations also rose 85 percent. This strong performance was driven by the wind turbine generator segment and increased deliveries. The company's orderbook crossed 6 GW, highlighting its robust market position and future growth prospects.",
            "pubDate": "2025-11-04T07:50:49.284310"
        },
        {
            "title": "IndiGo Q2 Results: Airline back in red, posts loss of Rs 2,582 crore on currency depreciation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indigo-q2-results-airline-reports-loss-of-rs-2582-crore-in-a-complete-u-turn-from-june-quarter/articleshow/125085374.cms",
            "description": "IndiGo Q2 Results: Aviation major IndiGo slipped into a loss of Rs 2,582 crore in the September quarter as against a profit of Rs 2,176 crore in the preceding June quarter. However, when compared with the year-ago period, the airline's loss widened from Rs 987 crore.",
            "pubDate": "2025-11-04T11:55:47.992387"
        },
        {
            "title": "Adani Enterprises Q2 Results: Cons profit soars 84% YoY to Rs 3,199 crore despite 6% drop in revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-enterprises-q2-results-cons-profit-soars-84-yoy-to-rs-3199-crore-but-revenue-declines-6/articleshow/125082873.cms",
            "description": "Adani Enterprises Q2 Results: ​​Adani Enterprises reported an 84% surge in Q2 net profit to Rs 3,199 crore, driven by exceptional gains from stake sales in Adani Wilmar. Despite a 6% dip in revenue to Rs 21,249 crore, the company's PAT jumped significantly sequentially. The board also approved a Rs 25,000 crore rights issue.",
            "pubDate": "2025-11-04T11:55:47.992527"
        },
        {
            "title": "Sun Pharma Q2 Preview: PAT may rise 2% YoY; Leqselvi spending to weigh on margins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sun-pharma-q2-preview-pat-may-rise-2-yoy-leqselvi-spending-to-weigh-on-margins/articleshow/125080476.cms",
            "description": "Sun Pharma is expected to report modest Q2 FY26 earnings growth, with PAT likely up 2% YoY and revenue rising 7%. Analysts cite Leqselvi launch costs, weak Taro performance, and high R&D spend as margin drags, even as domestic and specialty segments continue to drive overall growth.",
            "pubDate": "2025-11-04T11:55:47.992636"
        },
        {
            "title": "SBI Q2 Results: Standalone profit jumps 10% YoY to Rs 20,160 crore, beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sbi-q2-results-pat-jumps-10-yoy-to-rs-20160-crore-beats-street-estimates/articleshow/125080060.cms",
            "description": "SBI Q2 Results:  State Bank of India (SBI) reported a 10% year-on-year rise in standalone Q2 net profit to Rs 20,160 crore, beating Street estimates. Brokerages had expected up to a 17% decline, but higher interest income of Rs 1,19,654 crore, up 5% YoY, helped offset pressures, showcasing resilience in the lender’s core operations.",
            "pubDate": "2025-11-04T11:55:47.992735"
        },
        {
            "title": "M&M Q2 Results: PAT surges 28% YoY to Rs 3,673 crore, revenue jumps 22%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mm-q2-results-pat-jumps-16-yoy-to-rs-3673-crore-revenue-shoots-up-22/articleshow/125080137.cms",
            "description": "Mahindra & Mahindra (M&M) reported a strong Q2FY26 performance, with consolidated PAT up 28% YoY to ₹3,673 crore and revenue rising 21.7%. The automaker maintained leadership across SUVs, tractors, and electric 3-wheelers, while its finance and tech subsidiaries delivered robust margin and profit growth.",
            "pubDate": "2025-11-04T11:55:47.992839"
        },
        {
            "title": "Paytm Q2 Results: Profit falls 98% to Rs 21 crore, revenue rises 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/paytm-q2-results-profit-falls-98-to-rs-21-crore-revenue-rises-24/articleshow/125091590.cms",
            "description": "Paytm Q2 Results: Fintech firm Paytm reported a significant 98% drop in net profit to Rs 21 crore for Q2, despite a 24% rise in revenue to Rs 2061 crore. The company attributes revenue growth to increased subscription merchants and financial services distribution. Paytm plans to expand merchant offerings, grow financial services, and leverage AI for product innovation and market expansion.",
            "pubDate": "2025-11-04T17:43:18.757293"
        },
        {
            "title": "Novelis Q2 net income rises 27% YoY to $163 million on higher aluminium prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/novelis-q2-net-income-rises-27-yoy-to-163-million-on-higher-aluminium-prices/articleshow/125090203.cms",
            "description": "Novelis Inc., a Hindalco subsidiary, reported a 27% year-on-year net income growth to $163 million for the September quarter, despite a fire at its Oswego plant. Net sales rose 10% to $4.7 billion, driven by higher aluminum prices, though adjusted EBITDA declined 9% due to tariff impacts and scrap prices.",
            "pubDate": "2025-11-04T17:43:18.757434"
        },
        {
            "title": "IHCL reports revenues of Rs 2,124 crore for Q2, PAT at Rs 285 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ihcl-reports-revenues-of-rs-2124-crore-for-q2-pat-at-rs-285-crore/articleshow/125089122.cms",
            "description": "Tata Group's Indian Hotels Company (IHCL) reported a 12% year-on-year revenue increase to Rs 2,124 crore for the September quarter, marking its fourteenth consecutive quarter of record financial performance. The company's first-half fiscal year revenues grew 21% to Rs 4,226 crore, driven by strong performance in existing and new businesses, and an expanding hotel portfolio.",
            "pubDate": "2025-11-04T17:43:18.757540"
        },
        {
            "title": "NSE Q2 Results: Cons PAT falls 33% YoY to Rs 2,098 crore, revenue declines 18%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nse-q2-results-cons-pat-falls-33-yoy-to-rs-2098-crore-revenue-declines-18/articleshow/125088664.cms",
            "description": "NSE Q2 Results: India's leading exchange NSE reported a consolidated net profit of Rs 2,098 crore in the September ended quarter, down 33% from Rs 3,137 crore reported in the year ago period. Company's revenue from operations in the quarter under review stood at Rs 3,677 crore, down 18% from Rs 4,510 crore in the corresponding quarter of the last financial year.",
            "pubDate": "2025-11-04T17:43:18.757634"
        }
    ]
}