{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-14T18:52:40.441699",
    "items": [
        {
            "title": "Tech Mahindra Q2 preview: PAT may jump up to 20% QoQ while 4% revenue uptick seen led by steady BFSI and retail. 5 things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q2-preview-pat-may-jump-up-to-20-qoq-while-4-revenue-uptick-seen-led-by-steady-bfsi-and-retail-5-things-to-track/articleshow/124542467.cms",
            "description": "Tech Mahindra is poised for a double-digit sequential improvement in its September quarter net profit, with estimates ranging from 11.4% to 19.5% growth. Revenue is also expected to see a modest uptick, driven by large deal ramp-ups. Brokerages anticipate a strong recovery in EBIT and margins due to cost controls and operational efficiency.",
            "pubDate": "2025-10-14T04:45:26.183380"
        },
        {
            "title": "HCLTech revenue up 10.7% in Q2, rakes in $100m from AI alone",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcltech-revenue-up-10-7-in-q2-rakes-in-100m-from-ai-alone/articleshow/124540764.cms",
            "description": "HCLTech reported a flat second-quarter net profit despite revenue beating estimates, driven by strong ER&D services and AI-related revenue crossing $100 million. The company revised its services revenue growth guidance upwards and plans annual salary increments, while addressing skill-location mismatches in its workforce.",
            "pubDate": "2025-10-14T04:45:26.183517"
        },
        {
            "title": "Can HCLTech sustain its revenue momentum after a strong September quarter?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-hcltech-sustain-its-revenue-momentum-after-a-strong-september-quarter/articleshow/124540705.cms",
            "description": "HCLTech's September quarter revenue grew better than anticipated, marking a return to sequential growth. Profit growth met expectations. The company is focusing on AI services and intellectual property. New deal wins showed strong momentum, particularly in smaller contracts. Headcount increased, and attrition softened. Salary increments in October may impact future margins.",
            "pubDate": "2025-10-14T04:45:26.183634"
        },
        {
            "title": "Lower fund costs to lift NBFC margins, MSME stress stays",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lower-fund-costs-to-lift-nbfc-margins-msme-stress-stays/articleshow/124540692.cms",
            "description": "NBFCs anticipate a boost from lower funding costs in Q2, potentially improving net interest margins. However, purchase deferrals due to GST cuts and ongoing asset quality concerns, particularly in MSME and microfinance portfolios, could temper earnings. Vehicle financiers face growth challenges, while gold loan providers are poised for expansion.",
            "pubDate": "2025-10-14T04:45:26.183765"
        },
        {
            "title": "HCL Tech Q2 Results: Profit flat at Rs 4,235 cr, revenue up 11% YoY; Rs 12/share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-q2-results-profit-flat-at-rs-4235-cr-revenue-up-11-yoy-rs-12/share-dividend-declared/videoshow/124528614.cms",
            "description": "India's third-largest IT services company, HCL Technologies, on Monday reported a flat Q2 net profit at Rs 4,235 crore versus Rs 4,235 crore in the year-ago period. The profit after tax (PAT) is attributable to the shareholders of the company and was in line with Street's expectations of Rs 4,231 crore. The revenue from operations stood at Rs 31,942 crore, up 11% over Rs 28,862 crore posted in the corresponding quarter of the last financial year.",
            "pubDate": "2025-10-14T04:45:26.183882"
        },
        {
            "title": "HCL Tech announces 91st straight quarterly dividend at Rs 12 per share as Q2 profit holds steady",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-announces-91st-straight-quarterly-dividend-at-rs-12-per-share-as-q2-profit-holds-steady/articleshow/124527382.cms",
            "description": "HCLTech announced an interim dividend of Rs 12 per share, its 91st consecutive payout, alongside steady Q2 FY26 revenue growth of 11% YoY. While net income remained flat year-on-year, operating profit rose to Rs 5,550 crore. The company highlighted strong execution and demand for AI solutions, with new deal wins exceeding $2.5 billion.",
            "pubDate": "2025-10-14T04:45:26.183983"
        },
        {
            "title": "HCL Technologies Q2 Results: Cons PAT flat at Rs 4,235 crore, revenue up 11% YoY. Rs 12/share dividend announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-technologies-q2-results-cons-pat-flat-yoy-at-rs-4235-crore-revenue-up-11-rs-12/share-dividend-announced/articleshow/124526932.cms",
            "description": "HCL Tech Q2 results: HCL Technologies announced its Q2 financial results. The company's net profit remained steady compared to last year. However, revenue from operations saw a significant increase of 11%. This performance met market expectations. The board also declared an interim dividend. Sequential growth in both profit and revenue was also reported.",
            "pubDate": "2025-10-14T04:45:26.184083"
        },
        {
            "title": "Indian banks face slow loan growth and muted earnings in September quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-banks-face-slow-loan-growth-and-muted-earnings-in-september-quarter/articleshow/124514801.cms",
            "description": "Indian banks are poised for a tepid September quarter with muted earnings and loan growth, driven by a slowdown in retail and corporate segments. Analysts anticipate weaker treasury gains and potential net interest margin compression due to rising bond yields and recent repo rate cuts. Asset quality in SME and commercial vehicle segments remains a key concern.",
            "pubDate": "2025-10-14T04:45:26.184184"
        },
        {
            "title": "Can US generics momentum and CDMO strength keep pharma earnings steady this quarter?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-us-generics-momentum-and-cdmo-strength-keep-pharma-earnings-steady-this-quarter/articleshow/124514758.cms",
            "description": "Indian pharmaceutical companies are set for a steady September quarter. Growth in the US generics market and domestic sales will drive performance. Companies like Apollo Hospitals, Lupin, and Aurobindo are expected to show strong results. Despite some cost pressures, the sector anticipates positive medium-term prospects. New product launches and expanding facilities will support earnings.",
            "pubDate": "2025-10-14T04:45:26.184283"
        },
        {
            "title": "IREDA Q2 Results: Cons profit jumps 41% YoY to Rs 549 crore; stock rises 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ireda-q2-results-cons-profit-jumps-41-yoy-to-rs-549-crore-stock-rises-4/articleshow/124545823.cms",
            "description": "IREDA Q2 Results FY26: Indian Renewable Energy Development Agency (IREDA) reported a consolidated net profit of ₹549.33 crore for Q2 FY26, up 41.5% YoY from ₹388 crore in Q2 FY25. Revenue from operations rose 26.2% YoY to ₹2,057 crore.",
            "pubDate": "2025-10-14T07:33:07.814103"
        },
        {
            "title": "Axis Bank Q2 preview: Profit seen falling 19% YoY as margin and cost pressures persist",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-q2-preview-profit-seen-falling-19-yoy-as-margin-and-cost-pressures-persist/articleshow/124545742.cms",
            "description": "Axis Bank is expected to report a 19% YoY drop in Q2 PAT, pressured by margin compression, higher deposit costs, and elevated operating expenses. While loan growth remains steady, asset quality concerns and elevated credit costs could keep earnings subdued, with a gradual recovery anticipated.",
            "pubDate": "2025-10-14T07:33:07.814227"
        },
        {
            "title": "ICICI Prudential Life Q2 Results: Net profit up 18% to Rs 296 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-prudential-life-q2-profit-up-18-pc-to-rs-296-cr/articleshow/124549026.cms",
            "description": "ICICI Prudential Life Insurance Company on Tuesday reported 18 per cent growth in consolidated net profit at Rs 296 crore for three months ended September 30, 2025.",
            "pubDate": "2025-10-14T09:41:12.249817"
        },
        {
            "title": "Tech Mahindra Q2 Preview: PAT may jump up to 20% QoQ, 4% revenue uptick seen on steady BFSI and retail. 5 things to track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q2-preview-pat-may-jump-up-to-20-qoq-4-revenue-uptick-seen-on-steady-bfsi-and-retail-5-things-to-track/articleshow/124548631.cms",
            "description": "Tech Mahindra is poised for a double-digit sequential improvement in its September quarter net profit, with estimates ranging from 11.4% to 19.5% growth. Revenue is also expected to see a modest uptick, driven by large deal wins in key verticals. Analysts will be watching demand trends and deal pipeline visibility.",
            "pubDate": "2025-10-14T09:41:12.249941"
        },
        {
            "title": "Bank of Maharashtra Q2 Results: Profit rises 23% YoY as net interest income boosts earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bank-of-maharashtra-q2-results-profit-rises-23-yoy-as-net-interest-income-boosts-earnings/articleshow/124551602.cms",
            "description": "Bank of Maharashtra reported a 23% jump in net profit to Rs 1,633 crore for September quarter, driven by a 16% rise in net interest income. Pre-provision operating profit increased 17%, while asset quality remained stable and deposits grew 12%.",
            "pubDate": "2025-10-14T11:58:44.653686"
        },
        {
            "title": "Citigroup Q3 profit jumps 16% on record revenue, while Mexico sale drags",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/citigroup-profit-climbs-on-record-revenue-while-mexico-sale-drags/articleshow/124552747.cms",
            "description": "Citigroup reported a rise in third-quarter profit, as all its divisions brought in record revenue, sending the bank's shares up about 1% in trading before the bell.",
            "pubDate": "2025-10-14T12:44:58.519779"
        },
        {
            "title": "Leela Palaces Hotels & Resorts reports Q2 PAT of Rs 75 crore, revenue up 11% YoY to Rs 333 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/leela-palaces-hotels-resorts-q2-pat-at-rs-75-crore-revenue-up-11-yoy-to-rs-333-crore/articleshow/124552144.cms",
            "description": "Leela Palaces Hotels & Resorts reported a 11% year-on-year revenue increase to Rs 333.4 crore in Q2, with profit after tax at Rs 75 crore. The luxury chain achieved its fourth consecutive quarter of profitability, driven by a 13% growth in revenue per available room. Leela also announced its international expansion into Dubai's Palm Jumeirah.",
            "pubDate": "2025-10-14T12:44:58.519890"
        },
        {
            "title": "Wells Fargo tops profit estimates, raises return target after asset cap lifted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/wells-fargo-tops-profit-estimates-raises-return-target-after-asset-cap-lifted/articleshow/124551908.cms",
            "description": "Wells Fargo on Tuesday beat Wall Street estimates for third-quarter profit and raised its closely watched profitability target after regulators removed an asset cap imposed on the bank, paving the way for it to pursue growth.",
            "pubDate": "2025-10-14T12:44:58.519980"
        },
        {
            "title": "Goldman Sachs September quarter profit jumps 37% as bankers cash in on big deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/goldman-sachs-september-quarter-profit-jumps-37-as-bankers-cash-in-on-big-deals/articleshow/124551823.cms",
            "description": "Goldman Sachs' quarterly profit jumped more than 37% on Tuesday as its investment bankers earned higher advisory fees and rallying markets boosted revenue from managing client assets.",
            "pubDate": "2025-10-14T12:44:58.520080"
        },
        {
            "title": "Tech Mahindra announces Rs 15 per share interim dividend, sets October 21 as record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-announces-rs-15-per-share-interim-dividend-sets-october-21-as-record-date/articleshow/124553607.cms",
            "description": "Tier-1 IT services company Tech Mahindra on Tuesday company declared an interim dividend of Rs 15 per equity shares for the financial year 2025-26 and has fixed Tuesday, October 21 as the record date for determining the members entitled to receive the interim dividend.",
            "pubDate": "2025-10-14T13:43:25.373781"
        },
        {
            "title": "Tech Mahindra Q2 Results: Cons PAT falls 4.4% YoY to Rs 1,194 crore, revenue rises 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tech-mahindra-q2-results-cons-pat-falls-4-4-yoy-to-rs-1194-crore-revenue-rises-5/articleshow/124553236.cms",
            "description": "Tech Mahindra on Tuesday reported a 4.4% YoY fall in its Q2 net profit at Rs 1,194 crore versus Rs 1,250 crore in the year ago period. The profit after tax (PAT) is attributable to the owners of the company.",
            "pubDate": "2025-10-14T13:43:25.373908"
        },
        {
            "title": "JPMorgan lifts interest income forecast after profit beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jpmorgan-lifts-interest-income-forecast-after-profit-beats-estimates/articleshow/124556560.cms",
            "description": "JPMorgan Chase has surpassed profit expectations for the third quarter. The bank has also increased its full-year net interest income forecast. Strong performance in trading and investment banking businesses fueled this success. Dealmaking is on the rise, with expectations for an even stronger 2026. The US economy shows resilience, though geopolitical risks remain a concern.",
            "pubDate": "2025-10-14T18:52:39.591092"
        }
    ]
}