{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-22T08:35:12.695696",
    "items": [
        {
            "title": "Stocks to buy in 2026: SRF, Oberoi Realty among 5 stocks that could give 10-20% return in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-srf-oberoi-realty-among-5-stocks-that-could-give-10-20-return-in-long-term/slideshow/127084368.cms",
            "description": "Brokerage firms have maintained a mixed but largely constructive view across stocks spanning chemicals, real estate, automobiles, tyres and IT services, reflecting selective optimism amid evolving sector dynamics.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-22T02:07:50.982143"
        },
        {
            "title": "Armour Security IPO shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/armour-security-ipo-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/127083987.cms",
            "description": "Armour Security India is poised for its NSE SME debut with muted grey market sentiment, showing a 0% premium. The Rs 26.51 crore IPO, fully a fresh issue, saw modest subscription of 1.82 times.  The private security and facility management firm, serving diverse sectors nationwide, plans to utilize IPO funds for working capital, equipment, and debt repayment.",
            "pubDate": "2026-01-22T02:07:50.982237"
        },
        {
            "title": "GIFT Nifty up 200 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127079725.cms",
            "description": "Indian equities declined for a third straight session, with stock-specific action anticipated from major company earnings. Analysts foresee a sideways trading range for the Nifty, influenced by ongoing results and global sentiment. The India VIX surged, reflecting increased market fear, while the rupee hit an all-time low against the dollar amid foreign fund outflows.",
            "pubDate": "2026-01-22T02:07:50.982320"
        },
        {
            "title": "Stocks in news: Eternal, IndiGo, Adani Green, Dr Reddy's, Vodafone Idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-eternal-indigo-adani-green-dr-reddys-vodafone-idea/articleshow/127079288.cms",
            "description": "Markets closed lower amid weak cues, with the Nifty nearing its 200 DEMA. Select heavyweight stocks may offer short-term relief due to oversold conditions. Companies like Eternal, IndiGo, and Dr Reddy's are in focus due to Q3 results and news developments.",
            "pubDate": "2026-01-22T02:07:50.982400"
        },
        {
            "title": "Asian stocks gain after Trump touts Greenland deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-gain-after-trump-touts-greenland-deal/articleshow/127078702.cms",
            "description": "Asian stocks rose, mirroring Wall Street's gains, as President Trump's comments on a \"framework\" deal regarding Greenland eased market concerns. Precious metals retreated, with gold and silver falling. The US president's remarks signaled a de-escalation of geopolitical and trade tensions, leading to a return of risk appetite in equities.",
            "pubDate": "2026-01-22T02:07:50.982485"
        },
        {
            "title": "Central bank sold $9.7 billion in Nov as rupee falls 0.7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/central-bank-sold-9-7-billion-in-nov-as-rupee-falls-0-7/articleshow/127076287.cms",
            "description": "The Reserve Bank of India sold dollars in November. This action aimed to manage the Indian rupee's value. The rupee saw depreciation last year. India's currency's real effective exchange rate also decreased. This rate reflects the rupee's strength against other major currencies. The figures show a shift in the rupee's standing.",
            "pubDate": "2026-01-22T02:07:50.982562"
        },
        {
            "title": "FDI inflows dip marginally, outflows fall sharply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fdi-inflows-dip-marginally-outflows-fall-sharply/articleshow/127075622.cms",
            "description": "India experienced a slight dip in gross FDI to $6.4 billion in November, while net FDI saw a reduced outflow of $446 million. Singapore, Mauritius, the US, and the UK were major contributors to outward FDI, primarily directed towards manufacturing, financial, insurance, and business services sectors.",
            "pubDate": "2026-01-22T02:07:50.982643"
        },
        {
            "title": "Kalyan shares fall the most in 3 years as stake-sale fears spook investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-shares-fall-the-most-in-3-years-as-stake-sale-fears-spook-investors/articleshow/127073991.cms",
            "description": "Kalyan Jewellers' shares plummeted over 12% on Wednesday, marking their steepest single-day fall in three years and extending a nine-session losing streak. Investors are nervous due to concerns about a mutual fund potentially reducing its stake, coupled with an increase in promoter share pledging. Margin calls also contributed to the significant decline.",
            "pubDate": "2026-01-22T02:07:50.982722"
        },
        {
            "title": "Foreign investors not done with selling, FMCG tops list in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-investors-not-done-with-selling-fmcg-tops-list-in-2026/articleshow/127071784.cms",
            "description": "Foreign investors withdrew ₹22,420 crore from Indian markets in early January 2026. The FMCG sector saw the largest sell-off, losing shares worth ₹6,128 crore. Financial services and IT also experienced outflows. Investors are reportedly sensitive to high valuations in FMCG. Metals and mining was the only sector to see significant foreign buying.",
            "pubDate": "2026-01-22T02:07:50.982800"
        },
        {
            "title": "Capri Global Capital CEO Monu Ratra steps down",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capri-global-capital-ceo-monu-ratra-steps-down/articleshow/127074883.cms",
            "description": "In his resignation letter addressed to the company's board of directors, Ratra said that after careful thought and personal reflection, he had decided to explore entrepreneurial opportunities.",
            "pubDate": "2026-01-22T02:07:50.982956"
        },
        {
            "title": "This Budget India must re-incentivise global capital or risk being ignored",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-budget-india-must-re-incentivise-global-capital-or-risk-being-ignored/articleshow/127100306.cms",
            "description": "India can no longer assume foreign capital will return on narrative alone. In USD terms, Indian equities have delivered lower returns, deeper drawdowns and weaker risk-adjusted performance than major U.S. indices. Without reducing friction, improving stability and boosting investor confidence, India risks not outflows—but global capital indifference.",
            "pubDate": "2026-01-22T04:39:13.154560"
        },
        {
            "title": "Smallcap investors look away: Over 600 stocks deliver double-digit negative returns already in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-investors-look-away-over-600-stocks-deliver-double-digit-negative-returns-already-in-2026/articleshow/127099491.cms",
            "description": "India's smallcap market is experiencing a deep correction, with over 600 stocks seeing double-digit losses early in 2026. This downturn follows a year of consolidation, impacting midcaps and smallcaps more severely than largecaps. Investors are now prioritizing companies with strong fundamentals and predictable earnings amidst growing concerns over profitability and cash flows.",
            "pubDate": "2026-01-22T04:39:13.154692"
        },
        {
            "title": "High conviction picks! PL Capital selects 4 stocks with upside potential of up to 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-conviction-picks-pl-capital-selects-4-stocks-with-upside-potential-of-up-to-40/slideshow/127097758.cms",
            "description": "The Nifty has given up most of the gains accumulated over the past couple of months and is now trading comfortably below its record peaks amid rising geopolitical tensions and persistent FII outflow. For India, the impact is more pronounced, as the prolonged tariff dispute with the US has heightened volatility and disrupted market momentum. However, PL Capital has added 4 stocks that could do well in the coming quarters, while removing 6 names from its high conviction ideas. Here’s everything you need to know.",
            "pubDate": "2026-01-22T04:39:13.154810"
        },
        {
            "title": "Dr Reddy's shares jump 5% despite 14% YoY fall in Q3 profit. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dr-reddys-shares-jump-5-despite-14-yoy-fall-in-q3-profit-should-you-buy-sell-or-hold/articleshow/127098643.cms",
            "description": "Dr Reddy's shares: The company posted a 14% year-on-year decline in consolidated net profit to Rs 1,210 crore.",
            "pubDate": "2026-01-22T04:39:13.154924"
        },
        {
            "title": "Rs 6.6 lakh crore gain! Sensex soars over 800 pts, Nifty tops 25,300. 4 factors behind market rebound after 3 bruising days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-stock-market-rising-today-rs-5-lakh-core-gain-sensex-surges-over-660-points-nifty-vaults-past-25300-here-are-5-factors-behind-the-stock-market-rebound-after-3-bruising-days/articleshow/127096929.cms",
            "description": "Indian stock markets bounced back strongly on Thursday. This recovery ended a three-day losing spell. Investor confidence returned as global markets showed positive movement. The BSE Sensex and Nifty 50 saw significant gains. This rally helped restore investor wealth. U.S. President Donald Trump's statements eased market jitters. He ruled out force for Greenland and dropped tariff plans on Europe.",
            "pubDate": "2026-01-22T04:39:13.155023"
        },
        {
            "title": "Eternal shares jump 7% on Q3 beat, leadership shift. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-jump-7-on-q3-beat-leadership-shift-what-should-investors-do/articleshow/127097091.cms",
            "description": "Eternal shares surged following strong Q3FY26 earnings, with net profit jumping 73% YoY and revenue soaring 201% YoY. The company announced founder Deepinder Goyal will transition to Vice Chairman, with Blinkit CEO Albinder Singh Dhindsa appointed as the new CEO. Analysts maintain Buy ratings, citing growth momentum and margin expansion.",
            "pubDate": "2026-01-22T04:39:13.155121"
        },
        {
            "title": "Tata Communications Q3 profit jumps 55% on data, margin gains amid AI push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-communications-q3-profit-jumps-55-on-data-margin-gains-amid-ai-push/articleshow/127095289.cms",
            "description": "Tata Communications announced a significant 55% rise in quarterly net profit, reaching Rs 365 crore. This growth was fueled by robust performance in its data services segment and better profit margins. The company is also preparing to launch new AI-first digital infrastructure platforms. These initiatives are expected to drive future expansion and enhance customer interactions.",
            "pubDate": "2026-01-22T04:39:13.155215"
        },
        {
            "title": "Rs 19,000 crore FII selloff: Banks, IT, FMCG worst hit. Metals only bright spot",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-19000-crore-fii-selloff-banks-it-fmcg-worst-hit-metals-only-bright-spot/articleshow/127094399.cms",
            "description": "Foreign institutional investors have divested Rs 19,015 crore from Indian equities in early 2026, heavily impacting banks, IT, and FMCG sectors. Metals, however, emerged as a bright spot, attracting significant foreign inflows. Despite the sell-off, domestic brokerages see opportunities in diversified financials, banks, and healthcare.",
            "pubDate": "2026-01-22T04:39:13.155314"
        },
        {
            "title": "Jindal Saw among three stocks flashing bullish signals, hinting at a possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jindal-saw-among-three-stocks-flashing-bullish-signals-hinting-at-a-possible-uptrend/slideshow/127093142.cms",
            "description": "On January 21, in the NSE list of stocks with a market cap over Rs 10,000 crore, three stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2026-01-22T04:39:13.155407"
        },
        {
            "title": "Senco Gold shares in focus after deal to acquire 68% stake in Melorra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/senco-gold-shares-in-focus-after-deal-to-acquire-68-stake-in-melorra/articleshow/127092360.cms",
            "description": "Senco Gold is set to acquire a 68% stake in Melorra’s parent for Rs 68 crore, strengthening its digital and omnichannel presence. The move targets younger consumers, enhances design capabilities, and supports long-term growth, though near-term technical indicators suggest subdued momentum.",
            "pubDate": "2026-01-22T04:39:13.155499"
        },
        {
            "title": "CreditAccess Grameen among five stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/creditaccess-grameen-among-five-stocks-showing-bullish-rsi-upswing/slideshow/127091667.cms",
            "description": "On January 21, five stocks from the Nifty500 universe that gained over 3% were highlighted in the RSI Trending Up scan, based on data from StockEdge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" implies that the Relative Strength Index (RSI) values are increasing, indicating strengthening of momentum in the stock price. This can indicate potential upward movement and may be used by traders to identify opportunities for buying.",
            "pubDate": "2026-01-22T04:39:13.155594"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/127086904.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1000 crore, nine stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on January 21, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look.",
            "pubDate": "2026-01-22T04:39:13.155693"
        },
        {
            "title": "Angel One shares gain 3%, snap 3 day fall. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/angel-one-shares-gain-3-snap-3-day-fall-what-should-investors-do/articleshow/127102949.cms",
            "description": "Angel One shares rebounded after a three day decline as investors bought at lower levels. Despite a year on year profit dip, sequential revenue growth, margin expansion, dividend announcement and positive brokerage commentary support near term sentiment, though volatility may persist.",
            "pubDate": "2026-01-22T05:05:13.251618"
        },
        {
            "title": "Buy, Sell, or Hold? Nuvama maintains Hold on Gujarat Gas; Morgan Stanley underweights Dalmia Bharat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-maintains-hold-on-gujarat-gas-morgan-stanley-underweights-dalmia-bharat/articleshow/127102711.cms",
            "description": "Brokerages are taking a careful look at industrial and infrastructure stocks. Gujarat Gas faces margin pressure due to policy changes and a shift in sales mix. KEI Industries shows strong performance with good margins and capacity expansion. Dalmia Bharat is prioritizing volume growth amidst weak pricing in its key markets. These insights guide investor decisions.",
            "pubDate": "2026-01-22T05:05:13.251764"
        },
        {
            "title": "CreditAccess shares rally 20% in two days after Q3FY26 profit turnaround",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/creditaccess-shares-rally-20-in-two-days-after-q3fy26-profit-turnaround/articleshow/127110482.cms",
            "description": "CreditAccess Grameen shares surged sharply after the lender returned to profitability in Q3FY26. Lower provisions supported earnings, while improving asset quality and strong technical indicators boosted investor confidence, despite the stock trading at premium valuation levels.",
            "pubDate": "2026-01-22T06:31:31.898527"
        },
        {
            "title": "Budget & the Stock Market: Why the government’s Total Expenditure figure has the power to move the stock indices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-the-stock-market-why-the-governments-total-expenditure-figure-has-the-power-to-move-the-stock-indices/articleshow/127107318.cms",
            "description": "In the overall Union Budget, the Total Expenditure figure is an important pillar, representing the government's entire spending plan for a fiscal year. For the fiscal year 2025-26, this number is a staggering ₹50.65 lakh crore. While its sheer size is impressive, the true story of a nation’s economic priorities and its strategy for growth is not found in this single number, but in its composition. How the government allocates this massive sum – what it spends on, and for what purpose – is fundamentally more important than how much it spends in total.",
            "pubDate": "2026-01-22T06:31:31.898650"
        },
        {
            "title": "No Budget 2026 buzz as railway stocks slump up to 44% from last annual financial statement. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/no-budget-2026-buzz-as-railway-stocks-slump-up-to-44-from-last-annual-financial-statement-what-should-investors-do/articleshow/127104569.cms",
            "description": "Railway stocks have failed to generate Budget excitement this year, with many down sharply since Budget 2025. Valuation concerns, slow execution and muted capex expectations have weighed on sentiment, prompting investors to await fresh growth triggers.",
            "pubDate": "2026-01-22T06:31:31.898868"
        },
        {
            "title": "Waaree Energies shares soars 12% after strong Q3 FY26 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-soars-12-after-strong-q3-fy26-earnings/articleshow/127104146.cms",
            "description": "Waaree Energies' shares surged 12% to Rs 2713 after reporting over 100% year-on-year growth in Q3 FY26 revenue and profit. The company announced a record order book of Rs 60,000 crore and achieved significant solar module and cell production milestones, bolstering confidence in future performance.",
            "pubDate": "2026-01-22T06:31:31.898967"
        },
        {
            "title": "Rs 9,000 crore wipeout! Ola shares tumble nearly 40% in 3 months. Time to buy or wait?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-9000-crore-wipeout-ola-shares-tumble-nearly-40-in-3-months-time-to-buy-or-wait/articleshow/127103211.cms",
            "description": "Ola Electric shares have plummeted nearly 40% in three months, wiping out Rs 9,000 crore in market value and nearing all-time lows. This sharp decline is attributed to a broader downtrend, senior management resignations, and significant stake trimming by major investors like SoftBank, despite recent market share gains.",
            "pubDate": "2026-01-22T06:31:31.899071"
        },
        {
            "title": "Union Budget FY27: Defence budget set to soar, Jefferies says betting on HAL, BEL and Data Patterns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-budget-fy27-defence-budget-set-to-soar-jefferies-says-betting-on-hal-bel-and-data-patterns/articleshow/127119433.cms",
            "description": "Jefferies expects India’s defence budget to rise sharply in FY27, extending the indigenisation push. With strong capex momentum, rising exports and record order inflows, HAL, BEL and Data Patterns emerge as the brokerage’s top sectoral picks.",
            "pubDate": "2026-01-22T07:35:02.360898"
        },
        {
            "title": "Change but no change? What Deepinder Goyal’s resignation means for Eternal shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/change-but-no-change-what-deepinder-goyals-resignation-means-for-eternal-shareholders/articleshow/127117847.cms",
            "description": "Eternal's founder Deepinder Goyal is stepping down as Group CEO after 18 years. Albinder Dhindsa, Blinkit chief, will take the helm. Goyal will focus on long-term strategy, culture, and ethics. Dhindsa will manage day-to-day operations and continue leading Blinkit. This transition aims to drive Eternal's growth and societal impact.",
            "pubDate": "2026-01-22T07:35:02.361034"
        },
        {
            "title": "Trump policies put dollar dominance under fresh global scrutiny",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-policies-put-dollar-dominance-under-fresh-global-scrutiny/articleshow/127117353.cms",
            "description": "Morgan Stanley warns that Donald Trump’s stance on trade, debt, sanctions and institutions could influence the pace of global de-dollarisation. While the dollar’s dominance has been slowly eroding, no clear reserve currency alternative has emerged. Gold has strengthened as the primary challenger amid rising geopolitical and fiscal uncertainties.",
            "pubDate": "2026-01-22T07:35:02.361235"
        },
        {
            "title": "Billionaire Deepinder Goyal to sacrifice Rs 1,000 crore Eternal ESOPs on giving up CEO role",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/billionaire-deepinder-goyal-to-sacrifice-rs-1000-crore-eternal-esops-on-giving-up-ceo-role/articleshow/127121676.cms",
            "description": "Deepinder Goyal is giving up more than ₹1,000 crore worth of unvested ESOPs as he steps down as Group CEO of Eternal, returning 3.3 crore shares to the company’s pool. Seen as a rare corporate governance move, the decision could reduce the need for near-term shareholder dilution.",
            "pubDate": "2026-01-22T07:51:10.982899"
        },
        {
            "title": "Textile, shrimp stocks rally up to 8%. Is the US-India trade deal finally happening?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/textile-shrimp-stocks-rally-up-to-8-is-the-us-india-trade-deal-finally-happening/articleshow/127127709.cms",
            "description": "Export-focused textile and shrimp stocks rallied up to 8% as optimism grew around a possible India–US trade deal. Positive comments from US President Donald Trump at Davos, coupled with supportive signals from the newly appointed US Ambassador, lifted sentiment despite ongoing tariff challenges and the absence of a formal agreement.",
            "pubDate": "2026-01-22T08:35:10.181027"
        },
        {
            "title": "Promoters bet big on 13 smallcap stocks; rally up to 170% in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/promoters-bet-big-on-13-smallcap-stocks-rally-up-to-170-in-a-year/slideshow/127127374.cms",
            "description": "When promoters put more of their own money on the line, it often tells a quiet but powerful story. An increase in promoter shareholding typically signals deep conviction—a belief that a company’s best days still lie ahead. As the December ’25 quarter unfolds, the data shows an interesting contrast.Shareholding details are available for 948 of the 1,217 smallcap stocks tracked. Of these, promoters in nearly 110 companies raised their stakes compared with the previous quarter—a clear vote of confidence despite broader market uncertainty.Yet the market has told a different story. Tracking one-year price performance shows that only about 20 of these stocks remain in positive territory. Among them, 13 posted gains ranging from 10% to a striking 170%. Leading the pack is a standout multibagger, NACL Industries, which more than doubled investor wealth over the past year. (Data source: ACE Equity)",
            "pubDate": "2026-01-22T08:35:10.181139"
        },
        {
            "title": "Japan's Nikkei snaps five-day losing streak as JGBs extend gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-snaps-five-day-losing-streak-as-jgbs-extend-gains/articleshow/127123899.cms",
            "description": "Japan's Nikkei ‍share average rose on Thursday, ​snapping a five-day skid, as a rally in domestic ⁠bonds and de-escalating tensions between the United States and Europe supported demand for risk assets.",
            "pubDate": "2026-01-22T08:35:10.181229"
        },
        {
            "title": "Suzlon Energy shares can gain nearly 50%, says Systematix after initiating with Buy. 4 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-shares-can-gain-nearly-50-says-systematix-after-initiating-with-buy-4-reasons-why/articleshow/127123693.cms",
            "description": "Systematix has initiated coverage on Suzlon Energy with a Buy rating and a target price of Rs 67, implying nearly 50% upside. Analysts cite Suzlon’s market leadership, stronger financials, expanding order book, and improving margins as key drivers. Robust execution and supportive industry tailwinds are expected to sustain growth through FY26–FY28.",
            "pubDate": "2026-01-22T08:35:10.181315"
        }
    ]
}