{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-12T07:57:03.303852",
    "items": [
        {
            "title": "NLC India shares in focus following MoU with KABIL for global critical mineral projects",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nlc-india-shares-in-focus-following-mou-with-kabil-for-global-critical-mineral-projects/articleshow/123842400.cms",
            "description": "Shares of NLC India may remain in focus after the company signed an MoU with Khanij Bidesh India (KABIL) to jointly identify, acquire, and develop critical mineral and rare earth element assets globally. The move aims to secure India’s access to essential minerals vital for EVs, electronics, defence, and renewable energy industries, strengthening mineral security.",
            "pubDate": "2025-09-12T03:46:39.632312"
        },
        {
            "title": "Lodha Developers shares in focus on Rs 30,000-crore MoU with Maharashtra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lodha-developers-shares-in-focus-on-rs-30000-crore-mou-with-maharashtra/articleshow/123842382.cms",
            "description": "Shares of Lodha Developers will be in focus on September 12 after the Maharashtra government signed an MoU with the company to set up a Rs 30,000 crore Green Integrated Data Centre Park in Palava. Planned in the Mumbai Metropolitan Region, the park will have a 2 GW capacity and host both global and domestic operators.",
            "pubDate": "2025-09-12T03:46:39.632451"
        },
        {
            "title": "Oracle Financial Services, BSE, Angel One among 8 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-financial-services-bse-angel-one-among-8-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123842329.cms",
            "description": "There was a notable surge in futures open interest for eight stocks in the NSE F&O pack, contributing to a total increase in open interest of over 8% as of September 11, as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-09-12T03:46:39.632556"
        },
        {
            "title": "At multi-year highs: Jayaswal Neco, Zydus Wellness among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-jayaswal-neco-zydus-wellness-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/123842024.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, six stocks witnessed a 5-year swing high at the close on September 11, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-12T03:46:39.632661"
        },
        {
            "title": "Bharat Forge shares in focus following 2 defence and aerospace collaborations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharat-forge-shares-in-focus-following-2-defence-and-aerospace-collaborations/articleshow/123841918.cms",
            "description": "Bharat Forge has announced international partnerships, boosting its defence and aerospace presence. A collaboration with Windracers (UK) will localize UAV production in India, targeting military and civil sectors. Separately, Kalyani Strategic Systems secured a deal with UAE's GRADEONE to export artillery components, marking a first between Indian and Emirati firms.",
            "pubDate": "2025-09-12T03:46:39.632761"
        },
        {
            "title": "South Korean stocks hit record high on AI, market reform optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korean-stocks-hit-record-high-on-ai-market-reform-optimism/articleshow/123841803.cms",
            "description": "South Korean shares surged to a record high, marking their best weekly performance in over 18 months, fueled by optimism surrounding artificial intelligence and domestic market reforms. Chipmakers like Samsung Electronics and SK Hynix led the gains, driven by anticipated demand from the global AI boom.",
            "pubDate": "2025-09-12T03:46:39.632857"
        },
        {
            "title": "Japan's Nikkei hits record high, overheating caution limits gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-hits-record-high-overheating-caution-limits-gains/articleshow/123841770.cms",
            "description": "Nikkei in Japan reached a record high today, mirroring Wall Street's performance. However, market caution limited further gains. Investors felt the market might be overheating. Wall Street saw record closes due to expectations of Federal Reserve interest rate cuts. Chip-related stocks and Fast Retailing contributed to Nikkei's rise. SoftBank Group experienced a slight dip after a significant surge this week.",
            "pubDate": "2025-09-12T03:46:39.632952"
        },
        {
            "title": "Asian Paints shares in focus as Court rejects plea to quash antitrust probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-shares-in-focus-as-court-rejects-plea-to-quash-antitrust-probe/articleshow/123841759.cms",
            "description": "Asian Paints share price: The Bombay High Court dismissed Asian Paints plea to quash a CCI probe into alleged market abuse. The investigation, triggered by rival Birla Opus, accuses Asian Paints of unfair dealer practices to stifle competition.",
            "pubDate": "2025-09-12T03:46:39.633048"
        },
        {
            "title": "Infosys shares in focus as co announces its biggest Rs 18,000 crore share buyback at 19% premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-in-focus-as-co-announces-its-biggest-rs-18000-crore-share-buyback-at-19-premium/articleshow/123841692.cms",
            "description": "Infosys share price: Infosys has announced its biggest-ever share buyback worth Rs 18,000 crore via the tender route at Rs 1,800 per share, a 19% premium over Thursday's closing price. The move aims to repurchase 10 crore shares (2.41% equity) and boost shareholder value amid a weak demand outlook.",
            "pubDate": "2025-09-12T03:46:39.633141"
        },
        {
            "title": "Axis Bank, Bharti Airtel among 5 Nifty stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-bharti-airtel-among-5-nifty-stocks-showing-rsi-trending-up/slideshow/123841619.cms",
            "description": "Five stocks from the Nifty50 pack were highlighted in the RSI Trending Up scan on September 11, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-12T03:46:39.633235"
        },
        {
            "title": "Oracle nears $1 trillion market cap milestone. So, who all own the cloud giant?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oracle-nears-1-trillion-market-cap-milestone-so-who-all-own-the-cloud-giant/articleshow/123841546.cms",
            "description": "Oracle’s $244 billion rally pushed its market cap to $922 billion, briefly making Larry Ellison the world’s richest man. With Ellison holding 41%, attention shifts to other top shareholders like Vanguard, BlackRock, and State Street as the company eyes the trillion-dollar club.",
            "pubDate": "2025-09-12T03:46:39.633323"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Sobha, Coal India among 4 stocks that could give 12-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-sobha-coal-india-among-4-stocks-that-could-give-12-30-return/slideshow/123841410.cms",
            "description": "Brokerages have turned positive on select names across real estate, energy, capital goods, and commodities, projecting healthy returns for investors.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-12T03:46:39.633431"
        },
        {
            "title": "Glenmark, Texmaco Rail shares in focus on the last day to buy for dividend eligibility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/glenmark-texmaco-rail-shares-in-focus-on-the-last-day-to-buy-for-dividend-eligibility/articleshow/123841360.cms",
            "description": "Investors eyeing dividends from Glenmark Pharmaceuticals, Texmaco Rail & Engineering, and other companies must purchase shares today. September 12, 2025, is the record date for eligibility. Numerous firms, including Aarti Pharmalabs and DOMS Industries, have announced final dividends with the same record date, making today a crucial opportunity for dividend-seeking investors.",
            "pubDate": "2025-09-12T03:46:39.633529"
        },
        {
            "title": "Vigor Plast IPO set for listing today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vigor-plast-ipo-set-for-listing-today-heres-what-gmp-indicates/articleshow/123841318.cms",
            "description": "Vigor Plast India, a Gujarat-based pipes manufacturer, is launching its IPO on the NSE SME platform. The Rs 25-crore IPO opened on September 4 and closed on September 9. The IPO comprises fresh share sale and offer for sale. Proceeds will be used to repay borrowings and fund a new warehouse. The IPO was subscribed 3.9 times overall.",
            "pubDate": "2025-09-12T03:46:39.633619"
        },
        {
            "title": "Sharvaya Metals shares to debut today. Check GMP ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sharvaya-metals-shares-to-debut-today-check-gmp-ahead-of-listing/articleshow/123841300.cms",
            "description": "Sharvaya Metals, an aluminium product manufacturer, will list its shares on the Bombay Stock Exchange SME platform on Friday. The initial public offering of Rupees 58.8 crore was subscribed 4.8 times. The company plans to use the funds for working capital and expansion. Retail investors showed strong interest in the IPO. The company manufactures aluminium products for various industries.",
            "pubDate": "2025-09-12T03:46:39.633708"
        },
        {
            "title": "Austere Systems IPO listing today. GMP hints at robust gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/austere-systems-ipo-listing-today-gmp-hints-at-robust-gains/articleshow/123841278.cms",
            "description": "Austere Systems' IPO received massive subscription. The shares are ready to debut on the Bombay Stock Exchange SME platform this Friday. The IPO was booked 1,077 times. It is one of the most sought-after small-cap issues. The IPO will fund capital expenditure and general corporate purposes.",
            "pubDate": "2025-09-12T03:46:39.633797"
        },
        {
            "title": "Midcap dividend dashboard: Top 10 stocks with highest 1-yr yields",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcap-dividend-dashboard-top-10-stocks-with-highest-1-yr-yields/slideshow/123843100.cms",
            "description": "Dividends are a portion of a company’s profits that it chooses to distribute to its shareholders, usually in cash. They are typically declared by the company’s board of directors and paid periodically — quarterly, semi-annually, or annually. Dividend yield, meanwhile, is a simple ratio that shows how much dividend a company pays relative to its current share price.Dividend yields matter because they show how much cash return an investor is earning relative to the price they pay for the stock. A higher dividend yield can indicate attractive income potential, making the stock appealing for income-focused investors. Here are the top 10 stocks with the highest dividend yields, falling between a market capitalization of Rs 5,000 crore to Rs 25,000 crore, according to Trendlyne.",
            "pubDate": "2025-09-12T04:43:03.421503"
        },
        {
            "title": "Aurobindo Pharma, Hind Zinc among 6 stocks that closed above VWAP on September 11",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aurobindo-pharma-hind-zinc-among-6-stocks-that-closed-above-vwap-on-september-11/slideshow/123842945.cms",
            "description": "On September 11, the closing prices of six Nifty500 stocks rallied over 0.5% above their VWAP (Volume Weighted Average Price). A shift above the VWAP is often seen as a potential bullish trend, according to StockEdge.com’s technical scan data.When a stock closes above its VWAP, it indicates that the closing price is higher than the average price at which it traded throughout the day, weighted by trading volume. Traders and investors often interpret this as a bullish signal, suggesting positive market sentiment.Stocks closing above VWAP on September 11:",
            "pubDate": "2025-09-12T04:43:03.421627"
        },
        {
            "title": "Sebi board meeting today: What to expect and 5 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-board-meeting-today-what-to-expect-and-5-things-to-watch-out-for/articleshow/123842756.cms",
            "description": "Sebi's board meeting is set to bring significant reforms to Indian markets, focusing on IPO regulations, foreign investment, and institutional participation. Relaxations in IPO norms for large firms, a simplified entry framework for low-risk FPIs, and potential quotas for domestic insurers in anchor books are key proposals.",
            "pubDate": "2025-09-12T04:43:03.421722"
        },
        {
            "title": "Rs 1.75 lakh crore wipeout! Sebi's options lottery detox hits BSE, NSE investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-1-75-lakh-crore-wipeout-sebis-options-lottery-detox-hits-bse-nse-investors/articleshow/123842683.cms",
            "description": "Securities and Exchange Board of India's (Sebi) actions against options trading caused a significant market drop. Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) investors faced substantial losses. BSE shares fell, erasing market value. NSE's unlisted shares also plummeted. Discount brokerage Angel One experienced a sharp decline. Concerns over potential regulatory changes on derivative trading are rising.",
            "pubDate": "2025-09-12T04:43:03.421816"
        },
        {
            "title": "Rising jobless claims and inflation keep Fed on cautious rate-cut path",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-jobless-claims-and-inflation-keep-fed-on-cautious-rate-cut-path/slideshow/123842760.cms",
            "description": "Financial markets are anticipating that the Federal Reserve will resume interest rate cuts next week. This expectation is driven by concerns over a softening U.S. job market, which has shown signs of slowing growth and weaker hiring trends.",
            "pubDate": "2025-09-12T04:43:03.421916"
        },
        {
            "title": "Travel Food Services shares in focus on license for lounge operations at India’s 8th busiest airport",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/travel-food-services-shares-in-focus-on-license-for-lounge-operations-at-indias-8th-busiest-airport/articleshow/123842658.cms",
            "description": "Travel Food Services shares: TFS secured a five-year license from Cochin International Airport to operate 11 quick-service restaurants, a lounge, and a bar in the Domestic Terminal’s Security Hold Area, with a two-year extension option, license fees, and minimum guarantee terms.",
            "pubDate": "2025-09-12T04:43:03.422012"
        },
        {
            "title": "Marico shares in focus after full acquisition of True Elements",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/marico-shares-in-focus-after-full-acquisition-of-true-elements/articleshow/123842629.cms",
            "description": "Marico shares price:  The FMCG giant has acquired the remaining 46% stake in HW Wellness, making True Elements a wholly owned subsidiary. The move strengthens Marico’s presence in healthy foods, digital-first brands, and emerging food segments, following robust Q1 FY26 revenue and profit growth.",
            "pubDate": "2025-09-12T04:43:03.422112"
        },
        {
            "title": "Sensex jumps over 150 pts, Nifty50 tops 25,000 amid an 8-day rally; IT stocks gain on Fed rate cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-150-pts-nifty-tops-25000-amid-an-8-day-rally-it-stocks-gain-on-fed-rate-cut-bets/articleshow/123842607.cms",
            "description": "Indian stocks began Friday on a positive note, with the Nifty 50 marking its eighth consecutive session of gains. This surge mirrored global market trends, spurred by encouraging U.S. jobs data that softened concerns about higher inflation. Renewed hopes for Federal Reserve rate cuts and optimism surrounding a potential resurgence in India-U.S. trade relations further bolstered market sentiment.",
            "pubDate": "2025-09-12T04:43:03.422204"
        },
        {
            "title": "RailTel shares in focus after securing Rs 103 crore work orders from Nashik, Panvel municipal bodies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railtel-shares-in-focus-after-securing-rs-103-crore-work-orders-from-nashik-panvel-municipal-bodies/articleshow/123842601.cms",
            "description": "RailTel received two major project orders worth ₹103.46 crore from Nashik Smart City and Panvel Municipal Corporation for smart city and connectivity infrastructure projects aligned with its core services.",
            "pubDate": "2025-09-12T04:43:03.422297"
        },
        {
            "title": "JBM Auto shares rally 8% as subsidiary bags $100 million investment from IFC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jbm-auto-shares-in-focus-as-subsidiary-bags-100-million-investment-from-ifc/articleshow/123842420.cms",
            "description": "JBM Auto shares: JBM Ecolife Mobility secured a $100 million IFC investment to deploy 1,455 electric buses in Maharashtra, Assam, and Gujarat, aiming to cut 1.6 billion kg of CO₂, reduce diesel use by 600 million litres, create 5,500 jobs, and serve over one billion passengers.",
            "pubDate": "2025-09-12T04:43:03.422391"
        },
        {
            "title": "Explained: What Infosys' mega Rs 18,000 crore share buyback means for 26 lakh shareholders",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-what-infosys-mega-rs-18000-crore-share-buyback-means-for-26-lakh-shareholders/articleshow/123843165.cms",
            "description": "Infosys share price: Infosys has announced a significant Rs 18,000 crore share buyback at Rs 1,800 per share, a 19% premium, aiming to benefit its shareholders amidst market volatility. Analysts view this move as a strategic vote of confidence, with potential EPS growth and attractive dividend yields, despite modest revenue growth expectations and concerns about long-term investment strategies.",
            "pubDate": "2025-09-12T04:50:39.610405"
        },
        {
            "title": "Shringar House of Mangalsutra IPO Day 3: Issue booked over 8 times so far; GMP at 17%. Should you apply?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shringar-house-of-mangalsutra-ipo-day-3-issue-booked-over-8-times-so-far-gmp-at-17-should-you-apply/articleshow/123843164.cms",
            "description": "Shringar House of Mangalsutra’s Rs 401 crore IPO is oversubscribed 8.24 times after Day 2 and enters its final bidding day, with strong demand from retail and non-institutional investors. The shares are trading at a grey market premium of around 17%, suggesting a potential listing near Rs 193.",
            "pubDate": "2025-09-12T04:50:39.610542"
        },
        {
            "title": "In a tough year for investors, 5 penny stocks under Rs 5 quietly turn multibaggers, rallying up to 250%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/in-a-tough-year-for-investors-5-penny-stocks-under-rs-5-quietly-turn-multibaggers-rallying-up-to-250/articleshow/123843649.cms",
            "description": "Despite a flat broader market, select penny stocks have delivered substantial returns, with some surging up to 500%. Consecutive Investments leads the rally, while others like Gayatri Highways also saw significant gains. Analysts caution about the high risks associated with these stocks, including volatility and weak governance, as market sentiment turns cautious towards smallcaps.",
            "pubDate": "2025-09-12T05:16:55.234424"
        },
        {
            "title": "As Infosys announces buyback at 19% premium, should investors buy, sell or hold shares?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-infosys-announces-buyback-at-19-premium-should-investors-buy-sell-or-hold-shares/articleshow/123843570.cms",
            "description": "Infosys has announced a buyback of ₹18,000 crore at ₹1,800 per share, a 19% premium over the previous closing price, leading experts to suggest a 'buy on dips' strategy. Analysts anticipate this move could initiate a rally in the stock, supported by a strong balance sheet and potential EPS boost.",
            "pubDate": "2025-09-12T05:16:55.234553"
        },
        {
            "title": "Looking for stocks to boost your portfolio? Jefferies is bullish on 25 companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/looking-for-stocks-to-boost-your-portfolio-jefferies-is-bullish-on-25-companies/slideshow/123843387.cms",
            "description": "International brokerage Jefferies, in its latest equity strategy report, has raised the number of stocks under its buy coverage to 25 out of a total universe of 223. The brokerage has added eight new names across sectors, with picks such as Reliance Industries, HDFC Bank, UltraTech Cement and Coforge featuring in the list. Here’s the full sector-wise snapshot.",
            "pubDate": "2025-09-12T05:16:55.234662"
        },
        {
            "title": "After 3,000% rally in a single day, Wall Street penny stock gives up two-thirds gains in 3 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-3000-rally-in-a-single-day-wall-street-penny-stock-gives-up-two-thirds-gains-in-3-days/articleshow/123844239.cms",
            "description": "Eightco Holdings, the Wall Street penny stock, surged 3,000% in a single day after announcing a private placement linked to Worldcoin. However, shares gave up roughly two-thirds of those gains over the next three sessions, sliding from $45 to around $14 amid profit-taking.",
            "pubDate": "2025-09-12T05:49:12.964040"
        },
        {
            "title": "India bonds ease slightly as traders brace for debt supply",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-bonds-ease-slightly-as-traders-brace-for-debt-supply/articleshow/123844094.cms",
            "description": "Indian government bonds experienced a slight dip in early trading on Friday as traders adjusted positions before the weekly debt auction. The yield on the benchmark 10-year note edged up to 6.4718%. Market participants are awaiting the details of India's second-half borrowing plan and closely monitoring the August inflation data, projected at 2.1%.",
            "pubDate": "2025-09-12T05:49:12.964158"
        },
        {
            "title": "BSE shares jump 3% to break two-day losing streak amid Sebi board meet buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-jump-3-to-break-two-day-losing-streak-amid-sebi-board-meet-buzz/articleshow/123844089.cms",
            "description": "BSE shares experienced a surge, climbing as high as 2.7% following reports that Sebi's board meeting wouldn't address ending weekly F&O contract expiries. This news reversed an 8% stock decline triggered by speculation about a shift to monthly expiries. While Sebi considers longer-duration F&O contracts, any changes will involve industry consultation, aiming to balance market quality and hedging.",
            "pubDate": "2025-09-12T05:49:12.964370"
        },
        {
            "title": "Waaree Energies shares snap 3-day rally, retreat 2% as investors lock in gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-snap-3-day-rally-retreat-2-as-investors-lock-in-gains/articleshow/123844988.cms",
            "description": "Waaree Energies' shares experienced a slight dip on Friday after a significant three-day rally, yet remain up nearly 30% over the last three months. The renewable energy firm's market capitalization briefly exceeded ₹1 lakh crore, prompting profit-booking. This pullback follows strong Q1 FY26 results, with net profit jumping 89.1% to ₹745.20 crore, driven by growth across its solar business verticals.",
            "pubDate": "2025-09-12T06:23:46.954380"
        },
        {
            "title": "Trump seeks court approval to fire Lisa Cook ahead of Fed meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-seeks-court-approval-to-fire-lisa-cook-ahead-of-fed-meeting/slideshow/123844656.cms",
            "description": "The Trump administration has asked a federal appeals court to allow it to move ahead with firing Lisa Cook from the Federal Reserve Board. The effort aims to prevent her from participating in the central bank’s interest rate meeting next week. (Source: AP)",
            "pubDate": "2025-09-12T06:23:46.954509"
        },
        {
            "title": "Traders split on future ECB moves after rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/traders-split-on-future-ecb-moves-after-rate-decision/slideshow/123844445.cms",
            "description": "The European Central Bank held its key interest rate at 2% for the second straight meeting, signaling a cautious approach. ECB chief Christine Lagarde described the economic outlook as balanced, which has led traders to reassess expectations for further rate cuts. (Source: Reuters)",
            "pubDate": "2025-09-12T06:23:46.954737"
        },
        {
            "title": "Will Sebi tweak F&O expiry days? A 4-scenario analysis from Jefferies for BSE and Nuvama investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-sebi-tweak-fo-expiry-days-a-4-scenario-analysis-from-jefferies-for-bse-and-nuvama-investors/articleshow/123845297.cms",
            "description": "Amid speculation over changes to index derivatives expiry cycles, Jefferies warns that BSE could face cuts of 20–50%, while Nuvama Wealth Management may see profits impacted. The brokerage modelled four scenarios, including fortnightly and monthly expiries. In a fortnightly expiry scenario with separate settlements, BSE’s options revenue could fall 38%, leading to a 22% drop in total revenue and a 21% profit hit by FY27.",
            "pubDate": "2025-09-12T06:44:39.412657"
        },
        {
            "title": "Rupee slides amid trade tensions; RBI seen playing a calibrated role",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rupee-slides-amid-trade-tensions-rbi-seen-playing-a-calibrated-role/articleshow/123846707.cms",
            "description": "The Indian rupee faces pressure, testing levels near 88.6. Currency experts, like Anindya Banerjee, draw parallels to 2013's underperformance. Factors include FPI outflows, reduced FDI, and trade disputes with the U.S. Despite a weaker rupee compared to other currencies, optimism remains. The Reserve Bank of India may intervene if the rupee weakens further.",
            "pubDate": "2025-09-12T07:41:44.456409"
        },
        {
            "title": "F&O Radar | Deploy Short Strangle in Nifty to play equilibrium between Bears and Bulls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-short-strangle-in-nifty-to-play-equilibrium-between-bears-and-bulls/articleshow/123846536.cms",
            "description": "The Nifty 50 is consolidating after hitting 25,030, trading sideways between 24,800 and 25,250. A break above 25,250 could lead to new highs. Derivatives markets show mixed signals, and the NSE's expiry shift may impact volatility. Kotak Securities' Sahaj Agrawal suggests a Short Strangle options strategy to profit from the expected range-bound movement, benefiting from time decay within these levels.",
            "pubDate": "2025-09-12T07:41:44.456519"
        },
        {
            "title": "US-India trade talks will take time, markets should stay patient: Sudip Bandyopadhyay",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-india-trade-talks-will-take-time-markets-should-stay-patient-sudip-bandyopadhyay/articleshow/123846315.cms",
            "description": "Indian markets remain range-bound as investors await clear triggers, with buybacks in IT stocks sparking excitement and metals gaining on order flows. Sudip Bandyopadhyay notes structural strength in large-caps, cement, and infrastructure, while FMCG recovery and festive demand may take time to reflect in prices.",
            "pubDate": "2025-09-12T07:41:44.456721"
        },
        {
            "title": "Infosys buyback sensible amid global uncertainty, says Trip Chowdhry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-buyback-sensible-amid-global-uncertainty-says-trip-chowdhry/articleshow/123845858.cms",
            "description": "Infosys' share buyback is viewed as a pragmatic move amidst global IT challenges, according to Trip Chowdhry, who anticipates similar actions from other Indian IT firms. While immediate stock jumps are unlikely, the buyback aims to boost EPS. Chowdhry also advises caution regarding AI pricing and visibility in the U.S. market, contrasting Indian firms' approach with IBM's holistic AI strategy.",
            "pubDate": "2025-09-12T07:41:44.456817"
        },
        {
            "title": "TCS, Infosys, Wipro see price targets slashed by Jefferies as AI shift clouds outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-infosys-wipro-see-price-targets-slashed-by-jefferies-as-ai-shift-clouds-outlook/articleshow/123845773.cms",
            "description": "Jefferies has cut price targets for TCS, Infosys, Wipro, HCLTech, and Tech Mahindra amid AI-driven disruption and slow global tech spending. While preferring Coforge and HCLTech, the brokerage warns that large-cap IT valuations already reflect optimism, advising selective exposure amid near-term demand softness.",
            "pubDate": "2025-09-12T07:41:44.456912"
        },
        {
            "title": "Fed set to cut rates next week as markets anticipate policy shift: Willem Buiter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-set-to-cut-rates-next-week-as-markets-anticipate-policy-shift-willem-buiter/articleshow/123845651.cms",
            "description": "Anticipation of a Federal Reserve rate cut, potentially starting with 25 basis points in September, fuels market optimism despite inflation concerns. Economist Willem Buiter suggests further cuts are likely, prioritizing employment data. While a weaker dollar is expected, bullish sentiment towards US assets could counter this.",
            "pubDate": "2025-09-12T07:41:44.457004"
        },
        {
            "title": "Rupee slide calibrated by RBI, FII comeback hinges on earnings growth: Ajay Bagga",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rupee-slide-calibrated-by-rbi-fii-comeback-hinges-on-earnings-growth-ajay-bagga/articleshow/123845450.cms",
            "description": "Indian stock market shows resilience after positive signals between Narendra Modi and Donald Trump. Domestic investors provide support while foreign investors are cautious. Reserve Bank of India allows rupee to depreciate to boost exports. Experts believe corporate earnings may improve in coming quarters. Breakthrough in US tariff talks or government reforms could trigger foreign investment.",
            "pubDate": "2025-09-12T07:41:44.457100"
        },
        {
            "title": "GRSE, Apollo Micro, other defence stocks rally up to 8% as analysts tout structural growth play. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grse-apollo-micro-other-defence-stocks-rally-up-to-8-as-analysts-tout-structural-growth-play-heres-why/articleshow/123846774.cms",
            "description": "Defence company stocks experienced a surge. This was fueled by government spending and indigenisation efforts. Apollo Micro Systems and GRSE saw significant gains. Technology transfer deals and new orders boosted MTAR Technologies. HAL received engines for the Tejas Mk1A program. Experts highlight the sector's structural growth potential. They cite strong order books and profitability as key factors.",
            "pubDate": "2025-09-12T07:57:02.751662"
        }
    ]
}