{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-19T18:37:13.123449",
    "items": [
        {
            "title": "Bumble shares slide 27% after weak forecast signals slow dating app turnaround",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bumble-shares-slide-27-after-weak-forecast-signals-slow-dating-app-turnaround/articleshow/118393570.cms",
            "description": "Bumble's shares fell 27% on Wednesday after the dating app operator forecast first-quarter revenue below market estimates, as it continues to grapple with a slowdown in the growth of paying users.",
            "pubDate": "2025-02-19T18:36:56.265149"
        },
        {
            "title": "Nikola shares slump 38% after it goes bankrupt, to sell assets in latest EV market turmoil",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nikola-shares-slump-38-after-it-goes-bankrupt-to-sell-assets-in-latest-ev-market-turmoil/articleshow/118393448.cms",
            "description": "Nikola said on Wednesday it had filed for Chapter 11 bankruptcy protection and would pursue a sale of its assets, the latest electric-vehicle maker to stumble after grappling with tepid demand, rapid cash burn and funding challenges.",
            "pubDate": "2025-02-19T18:36:56.265279"
        },
        {
            "title": "Market Trading Guide: Gulf Oil Lubricants, Infosys are stock recommendations for Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-gulf-oil-lubricants-infosys-are-stock-recommendations-for-thursday/slideshow/118391856.cms",
            "description": "Indian markets ended with minor cuts on Wednesday as selling pressure in IT and pharma stocks neutralised gains from the bank and financial services counters. The 30-stock S&P BSE Sensex finished at 75,939.18, declining by 28.21 points or 0.04% and the broader Nifty rose by 12.40 points or 0.05% to close at 22,932.90.Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that Nifty has moved within a band, keeping the volatile vibe intact. \"On the lower end, 22,800 is likely to remain crucial support. Until 22,800 is broken, we do not expect a significant fall in the market. A decisive fall below 22,800 might trigger a meaningful correction. However, until that happens, we believe the market is likely to remain range-bound. On the higher end, 23,000/23,150 might act as resistance for Nifty. A decisive breakout above 23,150 could induce a significant rally in the market,\" De said.Here are 2 stock recommendations forThursday:",
            "pubDate": "2025-02-19T18:36:56.265385"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/118393013.cms",
            "description": "Indian markets closed nearly flat as gains in financials offset pharma losses amid U.S. tariff concerns. Analysts see range-bound movement, with optimism over India’s GDP growth and government expenditure supporting sentiment despite global uncertainties.",
            "pubDate": "2025-02-19T18:36:56.265494"
        },
        {
            "title": "Burmans' Rs 2,116-crore open offer for Religare gets tepid response",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/burmans-rs-2116-crore-open-offer-for-religare-gets-tepid-response/articleshow/118393272.cms",
            "description": "Burmans' open offer for acquiring an additional 26% stake in Religare Enterprises Ltd. received a weak response, with only 0.07% of shares tendered. Despite the lack of interest, their shareholding will increase to 24.02% after the open offer. The process involved multiple entities and regulatory complaints.",
            "pubDate": "2025-02-19T18:36:56.265604"
        },
        {
            "title": "US stocks slide as markets assess latest tariff threats",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-slightly-lower-as-markets-assess-latest-tariff-threats/articleshow/118391920.cms",
            "description": "US stocks: Wall Street's main indexes declined on Wednesday as investors evaluated President Trump's latest tariff threats and awaited the Fed's January meeting minutes. The potential auto tariffs and impact on inflation have raised concerns, with materials sector leading the declines and energy sector seeing gains.",
            "pubDate": "2025-02-19T18:36:56.265704"
        },
        {
            "title": "Goldman Sachs buys BSE shares for Rs 401 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-buys-bse-shares-for-rs-401-crore/articleshow/118391802.cms",
            "description": "Banking and financial services major Goldman Sachs on Wednesday bought shares of leading stock exchange BSE for Rs 401 crore through an open market transaction. According to the bulk deal data available on National Stock Exchange (NSE), US-based Goldman Sachs through its arm Goldman Sachs (Singapore) purchased 7.28 lakh shares of BSE Ltd.",
            "pubDate": "2025-02-19T18:36:56.265822"
        },
        {
            "title": "5 stocks with a PE ratio higher than Industry average",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-stocks-with-a-pe-ratio-higher-than-industry-average/slideshow/118391389.cms",
            "description": "",
            "pubDate": "2025-02-19T18:36:56.265918"
        },
        {
            "title": "These 4 smallcap stocks hit 52-week highs, rallied up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-smallcap-stocks-hit-52-week-highs-rallied-up-to-20-in-a-month/slideshow/118390613.cms",
            "description": "On Wednesday, the benchmark Sensex dropped by approximately 28 points, closing at 75,939. Despite the minor market decline, four stocks from the BSE smallcap index hit their 52-week highs, marking their highest prices in the past year. A 52-week high is an important indicator for traders and investors, reflecting a stock's peak value over the last 12 months. It serves as a useful metric for assessing a stock’s current performance and forecasting its future growth potential.",
            "pubDate": "2025-02-19T18:36:56.266014"
        },
        {
            "title": "Tech View: Nifty forms green candle, buy-on-dips favoured above 22,725. How to trade on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-forms-green-candle-buy-on-dips-favoured-above-22725-how-to-trade-on-thursday/articleshow/118389595.cms",
            "description": "Given broader market strength, a buy-on-dips strategy remains favourable if Nifty holds its recent low of 22,725. The 21-Day Simple Moving Average at 23,230 is a key hurdle, and a breakout above this level could confirm a near-term bottom reversal, said Hrishikesh Yedve of Asit C. Mehta Investment Intermediates.",
            "pubDate": "2025-02-19T18:36:56.266215"
        },
        {
            "title": "Breakout Stocks: How to trade UPL, Shree Cement & Kotak Mahindra Bank which hit a 52-week high on Thursday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-upl-shree-cement-amp-kotak-mahindra-bank-which-hit-a-52-week-high-on-thursday/slideshow/118388843.cms",
            "description": "Indian market closed in the red for the second consecutive day on Wednesday. The BSE Sensex and Nifty50 closed flat with a negative bias.",
            "pubDate": "2025-02-19T18:36:56.266311"
        },
        {
            "title": "Shivaji Maharaj’s 5 top secrets to winning battles – and how it applies to your portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shivaji-maharajs-5-top-secrets-to-winning-battles-and-how-it-applies-to-your-portfolio/slideshow/118388081.cms",
            "description": "\"The stock market is going through a rough phase, and investor sentiment is shaky. However, history teaches us that great leaders do not fear turbulent times—they prepare for them,\" Amar Ambani, Executive Director, YES SECURITIES highlighted in a note.As we celebrate Chhatrapati Shivaji Maharaj Jayanti, it is the perfect occasion to reflect on his leadership, vision, and strategic acumen. Shivaji Maharaj’s journey was never about short-term victories but about long-term planning, patience, and calculated decisions—qualities that every investor should embrace in today’s volatile markets.",
            "pubDate": "2025-02-19T18:36:56.266407"
        },
        {
            "title": "Over 15 MF schemes slashed holdings in 5 stocks in January. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/over-15-mf-schemes-slashed-holdings-in-5-stocks-in-january-do-you-own-any/slideshow/118387172.cms",
            "description": "ETMarkets’ analysis of mutual funds (MFs) reveals that over 15 schemes cut their investments in five stocks in January 2025, compared to December 2024. Interestingly, two of these share prices have seen a rise of about 20% in fiscal year 2025 so far, while two stocks have dropped by roughly 8-16% during the same period (Data Source: ACE MF). Take a look at the list to find out if you hold any of these stocks.",
            "pubDate": "2025-02-19T18:36:56.266499"
        },
        {
            "title": "D-Street ends marginally lower as banks offset decline in pharma stocks; Sensex sheds 28 pts, Nifty below 22,950",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-ends-flat-as-banks-offset-decline-in-pharma-stocks-sensex-shed-28-pts-nifty-below-22950/articleshow/118385333.cms",
            "description": "Stock Market Highlights: Indian benchmark indices closed little changed on Wednesday, as advances in heavyweight financial stocks offset losses in the pharma sector, which was hit by U.S. President Donald Trump's tariff threats.",
            "pubDate": "2025-02-19T18:36:56.266592"
        },
        {
            "title": "BSE 500 loses Rs 34 lakh crore in m-cap in 2025 so far. LIC, Trent among worst hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-500-loses-rs-34-lakh-crore-in-m-cap-in-2025-so-far-lic-trent-among-worst-hit/articleshow/118385054.cms",
            "description": "Several major stocks have seen significant market cap declines in 2025, led by LIC (-Rs 84,059 crore), Trent (-Rs 71,076 crore), SBI (-Rs 65,194 crore), Zomato (-Rs 59,832 crore), TCS (-Rs 59,499 crore), HDFC Bank (-Rs 58,833 crore), HCL Tech (-Rs 56,322 crore), Siemens (-Rs 55,272 crore), L&T (-Rs 50,852 crore), and Varun Beverages (-Rs 50,812 crore). ITC faced the steepest erosion (-Rs 91,000 crore) due to its hotel business carve-out, weak earnings, and market sentiment.",
            "pubDate": "2025-02-19T18:36:56.266688"
        }
    ]
}