{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-24T08:15:22.401617",
    "items": [
        {
            "title": "Sebi accuses executives at EY, PwC of insider trading",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-accuses-executives-at-ey-pwc-of-insider-trading/articleshow/127351094.cms",
            "description": "India's securities regulator has accused current and former executives from PwC, EY, Carlyle, and Advent. They allegedly breached insider trading rules concerning a 2022 Yes Bank share sale. The regulator claims unpublished price-sensitive information was shared, leading to unlawful gains. The notice follows an investigation into Yes Bank's share movements before a significant offering.",
            "pubDate": "2026-01-24T01:48:27.651019"
        },
        {
            "title": "Adani Group stocks slide up to 14% on US SEC heat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-slide-up-to-14-on-us-sec-heat/articleshow/127350409.cms",
            "description": "Adani Group stocks saw a sharp decline on Friday. This followed news that the US SEC is seeking court permission to email summons to founder Gautam Adani and nephew Sagar Adani. Allegations involve fraud and a bribery plot. The group's market value dropped by over $9 billion. Investors are advised to wait for clarity.",
            "pubDate": "2026-01-24T01:48:27.651145"
        },
        {
            "title": "RBI lines up a big liquidity push amid rupee's slideshow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-lines-up-a-big-liquidity-push-amid-rupees-slideshow/articleshow/127350000.cms",
            "description": "The Reserve Bank of India has announced three liquidity-boosting measures, including open market operations and a dollar-rupee swap, totaling approximately ₹1.92 lakh crore. These actions aim to enhance system liquidity and support the transmission of previous rate cuts. Experts anticipate further liquidity injections in the coming months.",
            "pubDate": "2026-01-24T01:48:27.651357"
        },
        {
            "title": "Sensex, Nifty slide nearly 1% as falling rupee, global tensions spark risk-off trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-slide-nearly-1-as-falling-rupee-global-tensions-spark-risk-off-trade/articleshow/127348656.cms",
            "description": "Indian stock markets ended a difficult week with a significant drop on Friday. The rupee hit new record lows, and global tensions fueled investor caution. Shares of Adani Group companies saw a sharp decline. Broader markets also experienced substantial losses. Investors are concerned about global uncertainty and potential conflicts.",
            "pubDate": "2026-01-24T01:48:27.651453"
        },
        {
            "title": "Three more global companies set to hop on India’s GCC train",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/three-more-global-companies-set-to-hop-on-indias-gcc-train/articleshow/127348472.cms",
            "description": "Videotelephony firm Zoom, telecom giant T-Mobile and low-cost airline Southwest Airlines are among the latest global companies considering the establishment of global capability centres (GCCs) in India, said people aware of the matter, adding that they are in talks with several states toward this end.",
            "pubDate": "2026-01-24T01:48:27.651569"
        },
        {
            "title": "Higher costs, capacity curbs weigh on IndiGo shares after Q3 show",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/higher-costs-capacity-curbs-weigh-on-indigo-shares-after-q3-show/articleshow/127352041.cms",
            "description": "IndiGo's shares fell on Friday following a significant drop in quarterly profit. Brokerages offered mixed views, citing short-term challenges like rising costs and currency issues. However, many remain positive about the airline's long-term growth potential. Analysts project potential upside for the stock in the coming year, despite some caution regarding immediate future earnings.",
            "pubDate": "2026-01-24T03:17:32.770394"
        },
        {
            "title": "‘Quiet-Quitting’ of US assets fuels fresh EM, gold bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/quiet-quitting-of-us-assets-fuels-fresh-em-gold-bets/articleshow/127361950.cms",
            "description": "Emerging-market assets and precious metals are experiencing a strong start to 2026, driven by US-Europe tensions that are weakening the dollar and encouraging global diversification. Investors are pouring record cash into emerging-market funds, with Asian technology and Latin American equities leading the rally, as a rotation out of US holdings gains momentum.",
            "pubDate": "2026-01-24T04:45:25.616676"
        },
        {
            "title": "Ashish Kacholia reshuffles Rs 2,400 portfolio in Q3, adds 2 stocks, exits another. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-reshuffles-rs-2400-portfolio-in-q3-adds-2-stocks-exits-another-check-details/slideshow/127361759.cms",
            "description": "Ace investor Ashish Kacholia reshuffled his Rs 2,400 crore equity portfolio during the December quarter, adding new names, increasing exposure to select holdings and trimming stakes in others. The changes reflect a mix of fresh bets and tactical adjustments following sharp stock-specific corrections and selloff in smallcap stocks in 2025. Here is a closer look at the additions, stake increases, trims and exits made during the third quarter.",
            "pubDate": "2026-01-24T04:45:25.616801"
        },
        {
            "title": "Ashish Kacholia reshuffles Rs 2,400 crore portfolio in Q3, adds 2 stocks, exits another. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-reshuffles-rs-2400-crore-portfolio-in-q3-adds-2-stocks-exits-another-check-details/slideshow/127361759.cms",
            "description": "Ace investor Ashish Kacholia reshuffled his Rs 2,400 crore equity portfolio during the December quarter, adding new names, increasing exposure to select holdings and trimming stakes in others. The changes reflect a mix of fresh bets and tactical adjustments following sharp stock-specific corrections and selloff in smallcap stocks in 2025. Here is a closer look at the additions, stake increases, trims and exits made during the third quarter.",
            "pubDate": "2026-01-24T05:00:40.879524"
        },
        {
            "title": "Concurrent Losers: 15 small-cap stocks decline for 5 consecutive sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-losers-15-small-cap-stocks-decline-for-5-consecutive-sessions/slideshow/127369462.cms",
            "description": "Over the five trading sessions ending January 23, the Sensex benchmark declined sharply, falling about 2,033 points to close at 81,538. The index ended lower in four of the five sessions. During this period, as many as 92 stocks in the BSE small-cap index recorded consecutive losses across all five sessions. From this group, we highlighted 15 stocks that plunged 15–20% over the same timeframe. (Data Source: ACE Equity)",
            "pubDate": "2026-01-24T06:48:53.518116"
        },
        {
            "title": "Defence, self-reliance, and budgetary priorities: Sectoral opportunities in a shifting strategic landscape",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-self-reliance-and-budgetary-priorities-sectoral-opportunities-in-a-shifting-strategic-landscape/articleshow/127367486.cms",
            "description": "India's defence sector is transforming.  A record budget and focus on domestic production are boosting capabilities.  Exports are growing, reaching over 100 countries.  New technologies and private sector involvement are key.  This presents a multi-decade opportunity for investors.  The upcoming budget is expected to further enhance capital expenditure and promote exports.",
            "pubDate": "2026-01-24T06:48:53.518223"
        },
        {
            "title": "Auto sector shifts gears in Q3; TVS Motors, Maruti Suzuki top buys, says Siddhartha Khemka",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-sector-shifts-gears-in-q3-tvs-motors-maruti-suzuki-top-buys-says-siddhartha-khemka/articleshow/127366786.cms",
            "description": "India's auto sector saw a strong Q3 recovery driven by GST cuts, festive demand, and lean inventories. Broad-based growth in two-wheelers, passenger, and commercial vehicles continued post-festive season. TVS Motor and Maruti Suzuki are highlighted for market share gains and strong growth prospects.",
            "pubDate": "2026-01-24T06:48:53.518313"
        },
        {
            "title": "Wipro, Persistent Systems, 21 other stocks approach ex-dates for dividends, rights issues. Check details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-persistent-systems-21-other-stocks-approach-ex-dates-for-dividends-rights-issues-check-details-here/slideshow/127376933.cms",
            "description": "Corporate actions such as dividends and rights issues continue to shape short-term market sentiment. While these events do not alter a company’s underlying fundamentals, they often act as catalysts for liquidity, trading interest, and investor participation.In the upcoming week, a host of companies have announced such actions, ranging from high-percentage interim dividends to rights issues at discounted prices. The following slides provide a detailed, day-wise summary based on StockEdge data.",
            "pubDate": "2026-01-24T08:15:21.766710"
        }
    ]
}