{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-11T10:58:53.386642",
    "items": [
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-25/articleshow/118130775.cms",
            "description": "There is a difference between a large-cap stock and a large runway for business. Just to put in context: When you buy Larsen & Toubro (LT), you own a part of the best engineering and technical minds of this country. But will the infrastructure, construction and engineering business grow at the same pace every year? The answer is, no. But will it grow in the long term? The answer is, yes. Owning LT is, thus, probably the best thing to do in the long term. But you have to live with phases of underperformance. So, learn to ignore the noise about a stock’s price and focus on the business which you will own when you buy it. Focus on owning a part of good business, rather than what the Nifty and Sensex are doing every day.",
            "pubDate": "2025-02-11T01:35:52.577452"
        },
        {
            "title": "Asian shares mixed, dollar rallies in sign of caution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-mixed-dollar-rallies-in-sign-of-caution/articleshow/118130770.cms",
            "description": "US equity futures dropped, and the dollar and gold gained as President Trump imposed 25% tariffs on steel and aluminum imports. This move affects global markets, with investors seeking safer assets amidst uncertainties. Focus remains on inflation data and Fed Chair Jerome Powell’s Congressional testimony this week.",
            "pubDate": "2025-02-11T01:35:52.577592"
        },
        {
            "title": "Market Trading Guide: IRCTC, Redington among 5 stock recommendations for Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-irctc-redington-among-5-stock-recommendations-for-tuesday/slideshow/118123066.cms",
            "description": "Indian markets sustained their downward trajectory, primarily influenced by global market uncertainties. Investors remained wary ahead, leading to persistent selling pressure at higher levels.\"Nifty closed near its immediate support and Fibonacci 0.50 retracement level, making 23,300 a crucial level to hold for any recovery. The 23,800–23,850 range, coinciding with a previous swing high, continues to act as a strong supply zone, further bolstered by aggressive call writing. Notably, the RSI has slipped below 50, indicating fading bullish momentum and rising sluggishness,\" said Dhupesh Dhameja, Derivatives Analyst, SAMCO Securities.Here are 5 stock recommendations for Tuesday",
            "pubDate": "2025-02-11T01:35:52.577698"
        },
        {
            "title": "GIFT Nifty up 45 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/118130637.cms",
            "description": "The daily momentum indicator has a positive crossover which is a buy signal and hence this minor degree pullback towards the support zone should be considered as a buying opportunity",
            "pubDate": "2025-02-11T01:35:52.577795"
        },
        {
            "title": "Stocks in news: Nykaa, Vodafone Idea, Apollo Hospitals, Hindalco, Lupin",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-nykaa-vodafone-idea-apollo-hospitals-hindalco-lupin/articleshow/118130605.cms",
            "description": "Shares of Vodafone Idea, SAIL, IRCTC, Tata Investment and Ircon will be in focus as the companies will announce their third quarter results today.",
            "pubDate": "2025-02-11T01:35:52.577893"
        },
        {
            "title": "Vedanta demerger gets vote of proxy advisory companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-demerger-gets-vote-of-proxy-advisory-companies/articleshow/118130448.cms",
            "description": "As per Vedanta's revised December 2024 composite scheme of the arrangement, the demerger will result in the creation of five sector-focused entities - Vedanta Aluminium, Vedanta Oil & Gas, Vedanta Power and Vedanta Iron & Steel, while Vedanta Limited will hold both upcoming and some existing businesses not covered by the above four verticalised revenue streams.",
            "pubDate": "2025-02-11T01:35:52.577987"
        },
        {
            "title": "Trump pumps up tariff talk, dents Indian metal stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-pumps-up-tariff-talk-dents-indian-metal-stocks/articleshow/118130381.cms",
            "description": "NSE's Metal index fell 2.64% on Monday, while the Nifty declined 0.8% - extending losses to the fourth straight trading session. National Aluminium was the top loser on the index, down 4.9%, whereas Steel Authority of India (SAIL), Vedanta, and NMDC declined over 4% each.",
            "pubDate": "2025-02-11T01:35:52.578079"
        },
        {
            "title": "Stock Radar: Kotak Mahindra Bank hits fresh 52-week high in February; will the rally continue?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-kotak-mahindra-bank-hits-fresh-52-week-high-in-february-will-the-rally-continue/articleshow/118115437.cms",
            "description": "Kotak Mahindra Bank's stock surpassed Rs 1,942 in February 2025, suggesting continued momentum. Technical indicators like the breakout from a five-month consolidation range and the formation of bullish patterns point to a possible target of Rs 2,080-2,100. Experts recommend buying on dips and setting a stop loss below Rs 1,870.",
            "pubDate": "2025-02-11T01:35:52.578171"
        },
        {
            "title": "Corrections come and go, look at the big picture. 6 stocks from the sugar sector, 4 with an upside potential of up to 43%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corrections-come-and-go-look-at-the-big-picture-6-stocks-from-the-sugar-sector-4-with-an-upside-potential-of-up-to-43/articleshow/118124835.cms",
            "description": "It is important to have a “reason” to buy a stock. That has a direct correlation to the amount of time you may hold it. It is equally important to assign a reason for selling a stock at a particular point. Why? Because that has a strong correlation to the probability that you will buy the stock again at a higher price. These days, with bears in control of the street, it needs some ability to be contrarian. But just ask yourself the question: Do you think the Nifty being at 23000 or 24000 makes a difference to the bottom lines of companies, say, from the sugar sector that have successfully transitioned from being just agro-commodity stocks to being part of the clean energy basket?",
            "pubDate": "2025-02-11T01:35:52.578261"
        },
        {
            "title": "Two Trades for Today: A large-cap consumer stock for 5% gain; a major private bank, also for 5% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-large-cap-consumer-stock-for-5-gain-a-major-private-bank-also-for-5-rise/articleshow/118123937.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Picks by the technical charts today.",
            "pubDate": "2025-02-11T01:35:52.578362"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/118120746.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-02-11T01:35:52.578456"
        },
        {
            "title": "Torrent pads up for Gujarat Titans deal with CVC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/torrent-pads-up-for-gujarat-titans-deal-with-cvc/articleshow/118130542.cms",
            "description": "Torrent Group is in the final stages of acquiring around 66% of the IPL team Gujarat Titans, valuing the franchise at about Rs 7,500 crore. The deal requires BCCI approval and would be the first majority stake sale since IPL's inception in 2008.",
            "pubDate": "2025-02-11T01:35:52.578546"
        },
        {
            "title": "Insurers seek clarity on 10% hike cap for senior health premiums",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurers-seek-clarity-on-10-hike-cap-for-senior-health-premiums/articleshow/118130436.cms",
            "description": "Health insurers are seeking clarity from IRDAI on how the 10% annual premium hike cap for senior citizens affects long-term policies. The cap aims to protect financially vulnerable older adults from steep premium increases. Insurers must also standardize pricing and obtain regulatory approval before discontinuing or modifying products.",
            "pubDate": "2025-02-11T01:35:52.578661"
        },
        {
            "title": "McDonald's shares up 5% as international markets prop up sales growth even as US lags",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcdonalds-shares-up-5-international-markets-prop-up-sales-growth-even-as-us-lags/articleshow/118123728.cms",
            "description": "McDonald's experienced unexpected growth in global sales during the fourth quarter, driven by demand in the Middle East, Japan, and China despite a decline in U.S. sales. The company's value meals have attracted lower-income consumers; however, this strategy might pressure store profits in the long term.",
            "pubDate": "2025-02-11T01:35:52.578752"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/118123302.cms",
            "description": "Indian markets closed lower as U.S. tariff threats on steel and aluminum imports dampened sentiment. The Sensex fell 548 points, while Nifty dropped 178 points. Analysts cite weak demand, margin pressures, and cautious investor outlook amid rising domestic yields.",
            "pubDate": "2025-02-11T01:35:52.578844"
        },
        {
            "title": "Just 10 months after listing, Sebi bars SME company from markets over financial irregularities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/just-10-months-after-listing-sebi-bars-sme-company-from-markets-over-financial-irregularities/articleshow/118122427.cms",
            "description": "Sebi has barred Gujarat-based SME Kalahridhaan Trendz and its promoters from the securities market for concealing loan defaults, misleading investors, and diverting IPO funds. The company also fabricated financials and falsely claimed major orders from a fictitious Bangladeshi entity.",
            "pubDate": "2025-02-11T01:35:52.578942"
        },
        {
            "title": "Trump policies: Reciprocal US tariffs loom on India’s auto, textile and a dozen other sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-policies-reciprocal-us-tariffs-loom-on-indias-auto-textile-and-a-dozen-other-sectors/articleshow/118145116.cms",
            "description": "Trump tariff: Trump’s threat of reciprocal tariffs could impact India, which has higher tariffs on US imports than vice versa. Key vulnerable sectors include machinery, gems, pharmaceuticals, and steel. India’s trade surplus with the US may face pressure under new tariff policies.",
            "pubDate": "2025-02-11T10:58:32.811076"
        },
        {
            "title": "12 stocks that delivered over 10% profit margins and 100%+ growth this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-stocks-that-delivered-over-10-profit-margins-and-100-growth-this-year/slideshow/118144948.cms",
            "description": "Profit margin shows the percentage of sales that turns into profit, making it a key indicator of a company’s profitability. To identify strong performers, ETMarkets analyzed stocks with a profit margin of at least 10% in each of the last three quarters (June 2024 to December 2025). From the BSE’s list of stocks with a market cap over Rs 5000 crore, 200 met the criteria. Among them, we have highlighted the top 12 stocks that have delivered over 100% price growth in FY25 so far. Here's a look:",
            "pubDate": "2025-02-11T10:58:32.811211"
        },
        {
            "title": "Amidst volatility: Be contrarian or sit it out? 6 mid-caps from different sectors with an upside potential of up to 36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amidst-volatility-be-contrarian-or-sit-it-out-6-mid-caps-from-different-sectors-with-an-upside-potential-of-up-to-36/articleshow/118143768.cms",
            "description": "At a time when mid-cap indices are the biggest losers and market breadth is negative in the segment, looking at mid-caps may seem like a wrong idea. Yes, in the short term (perhaps six months) they may face pressure because the street is adjusting for less-than-expected Q3 earnings. But if you look at the long-term track record, if chosen rightly by quantitative and qualitative criteria, mid-caps give good returns. If in doubt, look at the 10-year returns of mid-cap focused mutual funds. They may have been battered in the past couple of months, but the fact is that they have delivered good returns. As an investor, put some of these stocks on your watchlist. And, as and when market conditions change for the better, start nibbling at them.",
            "pubDate": "2025-02-11T10:58:32.811315"
        },
        {
            "title": "Sunil Subramaniam remains bullish on IT, pharma, banking as metals remain volatile",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sunil-subramaniam-remains-bullish-on-it-pharma-banking-as-metals-remain-volatile/slideshow/118143169.cms",
            "description": "Sunil Subramaniam, a market expert, analyzes how Trumponomics is shaping Indian markets. He highlights opportunities in IT and pharmaceuticals, the impact on metals, the contrasting outlook for private and public sector banks, shifting consumer behavior, and the ongoing FII selling pressure.",
            "pubDate": "2025-02-11T10:58:32.811413"
        },
        {
            "title": "Nifty down 12% from peak, but these five stock ideas stand out in slowdown: HSBC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-struggling-but-these-5-ideas-stand-out-in-slowdown-hsbc/articleshow/118142727.cms",
            "description": "The market continues to face pressure, with foreign institutional investors withdrawing over $20 billion since September. Earnings results for the December quarter were weak, with 42% of companies missing expectations, according to HSBC.",
            "pubDate": "2025-02-11T10:58:32.811512"
        },
        {
            "title": "European shares flat with focus on Trump's tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-flat-with-focus-on-trumps-tariffs/articleshow/118142177.cms",
            "description": "European shares were largely unchanged on Tuesday after a record close in the previous session, with investors assessing the risks of an escalating trade war after U.S. President Donald Trump raised tariffs on metals.",
            "pubDate": "2025-02-11T10:58:32.811609"
        },
        {
            "title": "Grasim’s profit plunges 41% on weak cement ops, investments in biz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grasims-profit-plunges-41-on-weak-cement-ops-investments-in-biz/articleshow/118142132.cms",
            "description": "Grasim: Grasim Industries' Q3 profit dropped 41% to Rs 899 crore, impacted by lower cement realisations, investments in paints, and higher costs. Revenue grew 9% to Rs 34,793 crore. The company invested Rs 9,000 crore in its paints business and Rs 2,785 crore in capex. Financial services and chemical segments showed growth.",
            "pubDate": "2025-02-11T10:58:32.811705"
        },
        {
            "title": "Navigating Market Volatility: S. Naren on asset allocation & market valuations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/navigating-market-volatility-s-naren-on-asset-allocation-amp-market-valuations/slideshow/118141439.cms",
            "description": "Small and midcap stocks are facing valuation issues. High valuations and excessive fundraising through IPOs and private equity investments have created instability. Unlike small and midcaps, large caps are more stable due to FII selling.",
            "pubDate": "2025-02-11T10:58:32.811818"
        },
        {
            "title": "HDFC Securities' CEO Dhiraj Relli discusses investment trends and opportunities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-securities-ceo-dhiraj-relli-discusses-investment-trends-and-opportunities/slideshow/118140584.cms",
            "description": "Mid and small-cap stocks have displayed significant valuation concerns, delivering approximately 24% returns despite only 6% earnings growth. Dhiraj Relli, MD & CEO of HDFC Securities, highlights key market trends, the impact of income tax relief on consumption, and the sectors best positioned for growth post-budget. With a focus on banking, real estate, cement, and consumption, he shares insights on navigating the evolving investment landscape.",
            "pubDate": "2025-02-11T10:58:32.811917"
        },
        {
            "title": "Devyani International Q3 results: Company reverses profits, reports Rs 7.6 crore net loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/devyani-international-q3-results-company-reverses-profits-reports-rs-7-6-crore-net-loss/articleshow/118140165.cms",
            "description": "Devyani International reported a Q3 FY25 net loss of Rs 7.6 crore, despite a 53.5% YoY revenue growth. The stock fell 5% following the results. The company expanded aggressively, adding 111 new stores, surpassing 2,000 outlets. It also expanded KFC operations in Thailand, reaching 305 stores. Expansion remains a key growth strategy.",
            "pubDate": "2025-02-11T10:58:32.812014"
        },
        {
            "title": "Sebi bans 'pied piper' company with zero revenue, Rs 5,500 crore valuation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bans-pied-piper-company-with-zero-revenue-rs-5500-crore-valuation/articleshow/118139993.cms",
            "description": "SEBI has banned LS Industries (LSIL) from accessing the capital market due to stock price manipulation and zero revenue, despite a Rs 5,500 crore market valuation. The regulator froze the bank accounts of investor JPP, who made unlawful gains. SEBI is investigating suspicious trading, insider activity, and potential FEMA violations.",
            "pubDate": "2025-02-11T10:58:32.812107"
        },
        {
            "title": "Why market is falling today: Investors lose Rs 9 lakh crore as Sensex crashes over 1,000 points; key factors that fueled the crash",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-market-is-falling-today-investors-lose-rs-10-lakh-crore-as-sensex-crashes-over-1000-points-key-factors-that-fueled-the-crash/articleshow/118139879.cms",
            "description": "Stock market crash today: Indian equity indices fell for the fifth day, driven down by banking, auto, metal, and IT stocks. Contributing factors include U.S. trade policy, weak earnings, and foreign investor selling. President Trump's tariff hike on steel and aluminum, nervousness ahead of Fed Chair Powell’s testimony, and high U.S. bond yields added to the market's decline.",
            "pubDate": "2025-02-11T10:58:32.812207"
        },
        {
            "title": "Infosys, Airtel among 5 stocks with long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-airtel-among-5-stocks-with-long-buildup/slideshow/118139890.cms",
            "description": "A long buildup occurs when both open interest (OI) and trading volumes rise alongside an increase in the underlying stock price, signaling a bullish trend in the Futures and Options segment. In Tuesday's trading session, five stocks witnessed fresh long positions. Here's the list:",
            "pubDate": "2025-02-11T10:58:32.812299"
        },
        {
            "title": "Varun Beverages shares crack over 6% after Q3 results. What analysts say?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/varun-beverages-shares-crack-over-6-after-q3-results-what-analysts-say/articleshow/118139177.cms",
            "description": "Varun Beverages share price: Varun Beverages, PepsiCo’s bottling partner, reported a healthy 38.3% increase in net revenues, reaching Rs 3,688.79 crore after accounting for excise duty. Meanwhile, revenue from operations saw a notable 39.8% year-over-year growth, rising to Rs 3,817.61 crore from Rs 2,730.98 crore in the same period last year.",
            "pubDate": "2025-02-11T10:58:32.812392"
        },
        {
            "title": "Ashish Kacholia-backed Zaggle Prepaid Ocean shares tumble 19% in 2 days after Q3 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashish-kacholia-backed-zaggle-prepaid-ocean-shares-tumble-19-in-2-days-after-q3-results/articleshow/118138332.cms",
            "description": "Shares of Zaggle Prepaid Ocean Services dropped 10% after its Q3 earnings report, despite a 29.6% YoY rise in profit to Rs 19.7 crore. The company’s revenue surged 68.8% YoY, but expenses rose sharply. Zaggle also announced a stake acquisition in Mobileware and a restructuring move with **",
            "pubDate": "2025-02-11T10:58:32.812485"
        },
        {
            "title": "Hexaware Technologies shares trade at 1% GMP ahead of IPO opening tomorrow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hexaware-technologies-shares-trade-at-1-gmp-ahead-of-ipo-opening-tomorrow/articleshow/118137723.cms",
            "description": "Hexaware Technologies' IPO GMP stands at 1%, signaling a flat listing. The Rs 8,750-crore IPO is a pure OFS by Carlyle, reducing its stake to 74.1%. Hexaware's revenue grew 12.8% in 2023. The IPO opens on February 12, with listing expected on February 19. Investors eye demand amid market sentiment.",
            "pubDate": "2025-02-11T10:58:32.812577"
        }
    ]
}