{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-06T17:42:14.072371",
    "items": [
        {
            "title": "PVR Inox Q1 Results: Cons loss narrows to Rs 54 crore, revenue jumps 23% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pvr-inox-q1-results-cons-loss-narrows-to-rs-54-crore-revenue-jumps-23-yoy/articleshow/123139608.cms",
            "description": "PVR Inox Q1 Results: PVR Inox reported a 23.4% year-on-year increase in consolidated revenue from operations, reaching ₹1,469.1 crore for the June 2025 quarter, up from ₹1,190.7 crore in the same period last year.",
            "pubDate": "2025-08-06T10:14:40.192511"
        },
        {
            "title": "Divi’s Laboratories Q1 Results: Cons net profit rises 27% YoY to Rs 545 crore, revenue up 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/divis-laboratories-q1-results-cons-net-profit-rises-27-yoy-to-rs-545-crore-revenue-up-14/articleshow/123137851.cms",
            "description": "Divi’s Laboratories Q1 Results: The Hyderabad-based pharma giant posted a consolidated revenue of ₹2,410 crore from operations in the first quarter of FY26, reflecting a 13.8% increase from ₹2,118 crore in the corresponding quarter last year.",
            "pubDate": "2025-08-06T10:14:40.192635"
        },
        {
            "title": "Titan Q1 Preview: PAT likely up 22% as gold surge, weddings drive growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/titan-q1-preview-pat-likely-up-22-as-gold-surge-weddings-drive-growth/articleshow/123137430.cms",
            "description": "Titan is expected to post a steady Q1FY26, with 22% PAT growth on strong jewellery demand and festive tailwinds. Rising gold prices and loan rates may impact margins. Watches, eyewear, and CaratLane are also likely to post healthy growth, supported by store expansion and a strong consumer demand environment.",
            "pubDate": "2025-08-06T10:14:40.192745"
        },
        {
            "title": "Bajaj Auto Q1 Results: Cons profit jumps 14% YoY to Rs 2,210 crore; revenue rises 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q1-results-cons-profit-jumps-14-yoy-to-rs-2210-crore-revenue-rises-10/articleshow/123135916.cms",
            "description": "Bajaj Auto Q1 Results: Bajaj Auto announced its Q1FY26 results. The company's consolidated profit after tax rose to Rs 2,210 crore. Revenue from operations also increased to Rs 13,133 crore. This growth was fueled by strong exports and premium motorcycle sales. The company maintained a healthy balance sheet. Surplus funds reached Rs 16,726 crore after strategic investments.",
            "pubDate": "2025-08-06T10:14:40.192863"
        },
        {
            "title": "Gokaldas Exports Q1 net profit rises 53% on tight cost management",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/gokaldas-exports-q1-net-profit-rises-53-on-tight-cost-management/articleshow/123121997.cms",
            "description": "Gokaldas Exports reported a 53% YoY rise in Q1FY26 net profit at ₹41 crore, driven by strong cost controls and productivity. Total income rose 4% to ₹977 crore. EBITDA margin improved by 336 bps to 12.1%, with EBITDA up 44%.",
            "pubDate": "2025-08-06T10:14:40.192978"
        },
        {
            "title": "Britannia Q1 profit dips 0.8% YoY; revenue up 8.8%, misses estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/britannia-q1-profit-dips-0-8-yoy-revenue-up-8-8-misses-estimates/articleshow/123121669.cms",
            "description": "Britannia Industries reported a 0.8% YoY dip in standalone Q1 profit at Rs 498.27 crore, with revenue rising 8.8% to Rs 4,452.74 crore, missing market expectations. Management remains focused on growth and margin protection amid rising competition.",
            "pubDate": "2025-08-06T10:14:40.193087"
        },
        {
            "title": "Airtel Q1 profit jumps 40% YoY, ARPU at industry-best Rs 250",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/airtel-q1-profit-jumps-40-yoy-arpu-at-industry-best-rs-250/articleshow/123121262.cms",
            "description": "Bharti Airtel’s consolidated net profit surged nearly 40% on-year in the June quarter, as India's second-largest telco added more higher paying smartphone users that boosted data consumption and the average revenue per user (ARPU). The earnings, however, missed analyst estimates.",
            "pubDate": "2025-08-06T10:14:40.193201"
        },
        {
            "title": "Britannia Q1 Results: Cons PAT rises 3% YoY to  Rs 521 crore, revenue grows 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/britannia-q1-results-cons-pat-rises-3-yoy-to-rs-521-crore-revenue-grows-9/articleshow/123120842.cms",
            "description": "Britannia Industries reported a 3% YoY rise in Q1FY26 net profit to Rs 521 crore, with revenue up 9% at Rs 4,622 crore. Sequentially, profit fell 7%. Higher raw material costs impacted margins. The company saw double-digit sales growth in key markets, supported by improving consumption trends and operational efficiencies.",
            "pubDate": "2025-08-06T10:14:40.193300"
        },
        {
            "title": "Exide Industries Q1FY'26 net profit rises 24pc to Rs 275 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/exide-industries-q1fy26-net-profit-rises-24pc-to-rs-275-crore/articleshow/123120603.cms",
            "description": "",
            "pubDate": "2025-08-06T10:14:40.193411"
        },
        {
            "title": "BLS International reports revenues of Rs 711 cr for Q1FY26M PAT at Rs 181 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bls-international-reports-revenues-of-rs-711-cr-for-q1fy26m-pat-at-rs-181-crore/articleshow/123120584.cms",
            "description": "BLS International reported a strong Q1 FY26 with revenue up 44% YoY to Rs 711 crore and net profit rising 50% to Rs 181 crore. The company, operating in over 70 countries, attributed its performance to a diversified business model, AI-driven strategy, and expansion in global citizen service markets.",
            "pubDate": "2025-08-06T10:14:40.193513"
        },
        {
            "title": "Trent Q1 earnings preview: Robust topline growth up to 36% YoY seen on store additions. Brokerages divided on PAT growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trent-q1-earnings-preview-robust-topline-growth-up-to-36-yoy-seen-on-store-additions-brokerages-divided-on-pat-growth/articleshow/123119649.cms",
            "description": "Tata’s Trent is expected to report strong Q1FY26 revenue growth driven by store expansion, especially in Zudio. However, rising costs and lower-margin sales may squeeze profitability, with mixed broker estimates on net profit and EBITDA trends.",
            "pubDate": "2025-08-06T10:14:40.193609"
        },
        {
            "title": "Bharti Airtel Q1 Results: Cons PAT jumps 43% YoY to Rs 5,948 crore, misses Street estimates; ARPU rises to Rs 250",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bharti-airtel-q1-results-cons-pat-jumps-43-yoy-to-rs-5948-crore-misses-street-estimates/articleshow/123118816.cms",
            "description": "Airtel Q1 Results FY26: Bharti Airtel on Tuesday reported a 43% YoY growth in its Q1 consolidated net profit at Rs 5,948 crore compared to Rs 4,159 crore in the year ago period. The profit after tax (PAT) is attributable to the owners of the parent and was below the Street estimates of Rs 6,400 crore.",
            "pubDate": "2025-08-06T10:14:40.193703"
        },
        {
            "title": "Exide Industries Q1 Results: Net profit rises 24 % to Rs 275 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/exide-industries-q1-results-net-profit-rises-24-to-rs-275-crore/articleshow/123118550.cms",
            "description": "Exide Industries Ltd on Tuesday reported a 24 per cent year-on-year (YoY) rise in its consolidated net profit to Rs 275 crore for the first quarter of the 2025-26 fiscal (FY'26), aided by higher revenues and improved operating efficiencies.",
            "pubDate": "2025-08-06T10:14:40.193795"
        },
        {
            "title": "Bajaj Auto Q1 Results Preview: Muted earnings seen amid flat volumes. 6 things to keep watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bajaj-auto-q1-results-preview-muted-earnings-seen-amid-flat-volumes-6-things-to-keep-watch/articleshow/123115450.cms",
            "description": "Bajaj Auto is expected to report subdued Q1FY26 results on August 6, with modest revenue growth and pressure on margins due to commodity inflation and regulatory costs. Brokerages have mixed views on net profit, forecasting a range of -4% to +4% YoY change.",
            "pubDate": "2025-08-06T10:14:40.193886"
        },
        {
            "title": "Adani Ports Q1 Results: Cons net profit rises 7% YoY to Rs 3,314 cr, revenue jumps 31%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-ports-q1-results-cons-net-pofit-jumps-7-yoy-to-rs-3314-cr-revenue-rises-31/articleshow/123114362.cms",
            "description": "Adani Ports Q1FY26 Results: The company reported a consolidated net profit of Rs 3,314.59 crore for the quarter ended June 2025, marking a 6.5% year-on-year increase. The company's revenue from operations also saw a significant jump, rising by 31.2% year-on-year to reach Rs 9,126.14 crore during the same period.",
            "pubDate": "2025-08-06T10:14:40.193975"
        },
        {
            "title": "Hero MotoCorp Q1 Preview: Revenue, Profit seen declining amid volume weakness and EV drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hero-motocorp-q1-preview-revenue-profit-seen-declining-amid-volume-weakness-and-ev-drag/articleshow/123113084.cms",
            "description": "Hero MotoCorp is expected to post muted Q1FY26 results, with both revenue and profit likely declining YoY due to weak volumes, supply issues, and higher EV mix. Brokerages see limited margin support from price hikes. Management's demand outlook and EV strategy will be key focus areas for investors.",
            "pubDate": "2025-08-06T10:14:40.194067"
        },
        {
            "title": "Hero MotoCorp reports nominal Q1 PAT growth despite lower sales, beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hero-motocorp-reports-nominal-q1-pat-growth-despite-lower-sales-beats-street-estimates/articleshow/123146318.cms",
            "description": "Hero MotoCorp reported a slight increase in net profit to Rs 1125.70 crore for Q1 2025, despite a 5.6% drop in revenue to Rs 9578.86 crore and a 10.9% decrease in two-wheeler sales. The company's EBITDA margin remained stable at 14.4%. Executives are optimistic about future growth due to positive customer sentiment, the upcoming festive season, and new product launches.",
            "pubDate": "2025-08-06T17:42:05.597312"
        },
        {
            "title": "Trent reports healthy revenue growth despite monsoon, geopolitical disruptions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trent-reports-healthy-revenue-growth-despite-monsoon-geopolitical-disruptions/articleshow/123144894.cms",
            "description": "Tata-owned Trent saw a revenue increase of 19% reaching Rs 4,883 crore. Net profit rose by 9% to Rs 425 crore. The company opened one Westside store and eleven Zudio stores. Ten Zudio stores were shut. Trent is focusing on expanding in key markets and newer cities. The company aims to build a strong direct-to-customer business.",
            "pubDate": "2025-08-06T17:42:05.597455"
        },
        {
            "title": "BHEL Q1 Results: Consolidated net loss widens to Rs 455 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bhel-q1-results-consolidated-net-loss-widens-to-rs-608-crore/articleshow/123144731.cms",
            "description": "Bharat Heavy Electricals Ltd reported a consolidated net loss of Rs 608.04 crore for Q1FY26, widening from Rs 278.99 crore in the previous year. Despite an increase in total income to Rs 5658.07 crore, rising expenses contributed to the loss. The company is addressing overdue receivables from STPG and RVUNL, with RVUNL having already paid Rs 90 crore.",
            "pubDate": "2025-08-06T17:42:05.597564"
        },
        {
            "title": "Hero MotoCorp Q1 Results: Profit flat at Rs 1,126 crore, revenue falls 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hero-motocorp-q1-results-profit-flat-at-rs-1126-crore-revenue-falls-6/articleshow/123143192.cms",
            "description": "Hero MotoCorp's Q1 standalone net profit remained relatively stable at Rs 1,126 crore, with revenues experiencing a 6% YoY decrease to Rs 9,579 crore. The company saw strong demand for its entry-level and deluxe motorcycles, along with its 125cc scooter segment, while its electric mobility business under the VIDA brand gained traction.",
            "pubDate": "2025-08-06T17:42:05.597668"
        },
        {
            "title": "Trent Q1 Results: Cons PAT climbs 9% YoY to Rs 425 crore, revenue jumps 19%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/trent-q1-results-cons-pat-climbs-9-yoy-to-rs-425-crore-revenue-jumps-19/articleshow/123142972.cms",
            "description": "Lifestyle retailer Trent on Wednesday reported a 9% YoY growth in its Q1 consolidated net profit to Rs 425 crore compared to Rs 391 crore in the year ago period.",
            "pubDate": "2025-08-06T17:42:05.597786"
        },
        {
            "title": "LIC Q1 results preview: PAT may rise 5% YoY, VNB to record up to 25% growth. 5 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-q1-results-preview-pat-may-rise-5-yoy-vnb-to-record-up-to-25-growth-5-things-to-watch-out-for/articleshow/123141404.cms",
            "description": "LIC is expected to report a 42% QoQ rise in Q1 profit, with a modest 5% YoY growth. APE and VNB projections vary across brokerages, reflecting mixed business trends. NBP may grow 10% YoY. Analysts cite investment income decline and business mix shifts as key performance drivers.",
            "pubDate": "2025-08-06T17:42:05.597895"
        },
        {
            "title": "PFC Q1 Results: Cons PAT zooms 25% YoY to Rs 8,981 crore, revenue rises by 15%; dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pfc-q1-results-cons-pat-zooms-25-yoy-to-rs-8981-crore-revenue-rises-by-15-dividend-declared/articleshow/123141284.cms",
            "description": "Power Finance Corporation reported a 25% YoY rise in Q1 FY26 net profit to ₹8,981 crore, with revenue up 15.5%. It also announced a ₹3.70 interim dividend. Strong margins and healthy asset quality supported performance, despite a 10% rise in expenses.",
            "pubDate": "2025-08-06T17:42:05.598001"
        }
    ]
}