{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-19T03:03:11.593970",
    "items": [
        {
            "title": "Reliance Industries shares in focus after majority stake acquisition in Naturedge Beverages",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-in-focus-after-majority-stake-acquisition-in-naturedge-beverages/articleshow/123376005.cms",
            "description": "Reliance Industries' FMCG arm, Reliance Consumer Products, has acquired a majority stake in Naturedge Beverages. The move marks RCPL’s entry into the healthy functional beverages market with flagship brand Shunya, expanding its portfolio into herbal, natural, and wellness-driven drinks.",
            "pubDate": "2025-08-19T03:02:53.789150"
        },
        {
            "title": "At multi-year highs: TVS Motor, Maruti Suzuki, M&M among 7 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-tvs-motor-maruti-suzuki-mm-among-7-stocks-witness-5-year-swing-high-breakout/slideshow/123375832.cms",
            "description": "Seven stocks from the Nifty200 pack witnessed a 5-year swing high at the close on August 18, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.\"",
            "pubDate": "2025-08-19T03:02:53.789276"
        },
        {
            "title": "Positive Breakout: These 10 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-close-cross-above-their-200-dma/slideshow/123375746.cms",
            "description": "In the Nifty200 pack, 10 stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on August 18, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders to determine a particular stock's overall trend. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered an overall uptrend. Take a look:",
            "pubDate": "2025-08-19T03:02:53.789394"
        },
        {
            "title": "Icodex Publishing Solutions shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icodex-publishing-solutions-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/123375569.cms",
            "description": "Icodex Publishing Solutions is set to debut on the BSE SME platform on August 19, 2025, with shares priced at Rs 102. The IPO, which was subscribed 3.95 times, saw strong interest from institutional and retail investors. Despite robust FY25 financials, analysts are cautious about the sustainability of earnings, leading to expectations of a muted listing.",
            "pubDate": "2025-08-19T03:02:53.789497"
        },
        {
            "title": "6 companies to go ex-dividend tomorrow. Last chance to buy; check list here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/6-companies-to-go-ex-dividend-tomorrow-last-chance-to-buy-check-list-here/articleshow/123375520.cms",
            "description": "Investors eyeing dividends from select companies must act swiftly, as today is the last day to purchase shares of firms like Bhansali Engineering Polymers, Colab Platforms, and others with a record date of August 20, 2025. To be eligible for the declared dividends, ensure your name appears in the company's records by this date, considering the T+1 settlement cycle.",
            "pubDate": "2025-08-19T03:02:53.789598"
        },
        {
            "title": "Multibagger stock with 700% gains in 2 years to go ex-split tomorrow. Last day to buy today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-stock-with-700-gains-in-2-years-to-go-ex-split-tomorrow-last-day-to-buy-today/articleshow/123375456.cms",
            "description": "Chandrima Mercantiles, a multibagger stock, is undergoing a stock split. The face value is changing from Rs 10 to Rs 1. August 20 is the record date. Today is the last day to buy shares to qualify. The split aims to improve liquidity and accessibility. The stock has delivered nearly 700% returns in two years.",
            "pubDate": "2025-08-19T03:02:53.789700"
        },
        {
            "title": "Wall Street ends on muted note ahead of Jackson Hole summit, retailers' earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-on-muted-note-ahead-of-jackson-hole-summit-retailers-earnings/articleshow/123375254.cms",
            "description": "Wall Street's indexes remained mostly flat as investors awaited key retail earnings reports and the Federal Reserve's Jackson Hole symposium for insights into the economy. Concerns about trade uncertainty, inflation, and potential shifts in the Fed's policy framework contributed to market caution. Energy stocks gained following new tax subsidy rules, while investors continue to anticipate a rate cut next month.",
            "pubDate": "2025-08-19T03:02:53.789791"
        },
        {
            "title": "Strong Volumes, Channel Breakout Keep M&M Stock in Bullish Zone, says Rajesh Palviya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strong-volumes-channel-breakout-keep-mm-stock-in-bullish-zone-says-rajesh-palviya/videoshow/123367456.cms",
            "description": "“The technical outlook for M&M stock appears bullish in the short term, supported by a steady uptrend and recent price consolidation near all-time highs. Traders can buy the stock for a target of Rs 3500 in the near-term,” Rajesh Palviya, SVP - Research, Axis Securities, said.",
            "pubDate": "2025-08-19T03:02:53.789884"
        },
        {
            "title": "Asian shares mixed; oil in spotlight after Trump’s Ukraine meeting",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-mixed-oil-in-spotlight-after-trumps-ukraine-meeting/articleshow/123374748.cms",
            "description": "Oil markets are closely watching President Trump's efforts to mediate between Ukraine and Russia, impacting regional stability and energy flows. The Federal Reserve's upcoming Economic Policy Symposium in Jackson Hole is also a key event, with Jerome Powell expected to unveil the Fed's new policy framework. Market anticipates potential rate cuts in September amid signs of labor-market weakness.",
            "pubDate": "2025-08-19T03:02:53.789972"
        },
        {
            "title": "Can Dabur India sustain its margins despite inflationary pressures?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-dabur-india-sustain-its-margins-despite-inflationary-pressures/articleshow/123374656.cms",
            "description": "Dabur India maintained its operating margin in the June quarter. This was achieved through price increases and cost savings. The company anticipates margin improvements in fiscal year 2026. A proposed GST rate reduction may boost demand. Analysts suggest a potential upside for Dabur's shares. The rural market performed well. Dabur expects double-digit growth in the September quarter.",
            "pubDate": "2025-08-19T03:02:53.790066"
        },
        {
            "title": "Stocks in news: Vedanta, LIC, Reliance, GMR Airports, Vodafone Idea",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vedanta-lic-reliance-gmr-airports-vodafone-idea/articleshow/123369889.cms",
            "description": "Markets rallied strongly, with Vedanta considering a second interim dividend. LIC launched a policy revival campaign, while GMR Airports announced the redemption of non-convertible bonds. Reliance Consumer entered the beverage sector through a joint venture, and Vodafone Idea seeks funds for its capex plan.",
            "pubDate": "2025-08-19T03:02:53.790157"
        },
        {
            "title": "GIFT Nifty up 30 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123369951.cms",
            "description": "Indian equities rebounded strongly following the Prime Minister's GST reform announcement. Experts predict corporate earnings recovery in the second half of FY26, driven by policy reforms, potential stimulus, and festive demand, maintaining a positive outlook for the next 6-9 months. Technically, Nifty's ability to surpass 25,000 will dictate further upward movement, with a potential target of 25,300-25,500.",
            "pubDate": "2025-08-19T03:02:53.790249"
        },
        {
            "title": "Indian equities surge as GST simplification prospects drive market gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-equities-surge-as-gst-simplification-prospects-drive-market-gains/articleshow/123374385.cms",
            "description": "Indian equities surged on Monday, driven by optimism surrounding potential GST simplification, leading to short covering in sectors like auto and FMCG. The Nifty and Sensex both experienced gains, fueled by positive domestic investor activity and a slight decrease in market volatility. Consumption-based stocks led the rally, with Maruti Suzuki emerging as a top gainer.",
            "pubDate": "2025-08-19T03:02:53.790337"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-26/articleshow/123374271.cms",
            "description": "There’s an old market saying: Even when the bulls are in control, never write off the bears. Similarly, when the bears seem to be taking control, don't write off the bulls. Monday was an example of this. Now, how long will the upmove sustain? Especially as there is no clarity on the India-US trade deal or on the threatened additional tariff. At this point, the bulls and bears are pretty evenly matched. It is also likely that the street will tilt toward the bulls over a period of time (given there are no major negative surprises). If that happens, the tilt will first be toward stocks where the quality of the balance sheet is strong and there is little need for further debt in the business.",
            "pubDate": "2025-08-19T03:02:53.790454"
        },
        {
            "title": "How will GST reforms impact Indian stock market and key industries?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-gst-reforms-impact-indian-stock-market-and-key-industries/articleshow/123374045.cms",
            "description": "Indian stock market anticipates GST simplification, potentially benefiting autos, cement, consumer goods, retail, hotels, and financials. Auto sector, especially two-wheelers, could see increased demand due to lower tax rates and potential RBI rate cuts. Financials may indirectly gain from credit growth in key sectors.",
            "pubDate": "2025-08-19T03:02:53.790552"
        },
        {
            "title": "Stock Radar: M&M hits fresh record high in August 2025; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-mm-hits-fresh-record-high-in-august-2025-time-to-buy-or-book-profits/articleshow/123361719.cms",
            "description": "Mahindra & Mahindra (M&M) shares have surged to a new record high in August 2025, breaking out from a period of consolidation. Technical indicators suggest a continuation of this upward trend.",
            "pubDate": "2025-08-19T03:02:53.790642"
        }
    ]
}