{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-24T05:00:26.838691",
    "items": [
        {
            "title": "Asian stocks edge lower after mixed Fed signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-lower-after-mixed-fed-signals/articleshow/124080969.cms",
            "description": "Asian stocks declined following a tech-driven dip in the S&P 500, compounded by cautious signals from Federal Reserve officials regarding interest-rate cuts. Jerome Powell highlighted persistent risks in both the labor market and inflation, maintaining flexibility amid pressure for aggressive easing. Oil prices rose due to concerns over Russian supply disruptions.",
            "pubDate": "2025-09-24T01:24:26.909333"
        },
        {
            "title": "JM Financial, Group firms settle case over NCDs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-group-firms-settle-case-over-ncds/articleshow/124080849.cms",
            "description": "JM Financial, along with JM Financial Services and JM Financial Products, settled with SEBI for ₹1.9 crore over securities law violations related to NCD public issues in 2023. They also face a three-month debarment from debt security distribution and IPO financing. The case involved concerns about retail ownership decline and loan provisions for NCD applications.",
            "pubDate": "2025-09-24T01:24:26.909454"
        },
        {
            "title": "Stocks in news: Mazagon Dock, Swiggy, Tata Motors, Indian Hotels, YES Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-mazagon-dock-swiggy-tata-motors-indian-hotels-yes-bank/articleshow/124074849.cms",
            "description": "Markets experienced a slight dip amid volatility on expiry day, continuing a consolidation phase. Optimism from GST reforms and festive demand is countered by external pressures like visa-fee hikes and foreign outflows. Mazagon Dock, Indian Hotels, YES Bank, Tata Motors, Puravankara, and Swiggy saw significant developments, including partnerships, stake acquisitions, and leadership changes.",
            "pubDate": "2025-09-24T01:24:26.909658"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124074890.cms",
            "description": "Equities closed slightly lower as India-US trade talks progressed. Analysts anticipate market firmness, driven by GST reforms and festive demand. Technically, the index finds strong support at 25,000, suggesting a potential rebound. FIIs net sold shares, while DIIs were net buyers, and the rupee weakened against the US dollar.",
            "pubDate": "2025-09-24T01:24:26.909754"
        },
        {
            "title": "India may raise foreign investment limit in PSU banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-may-raise-foreign-investment-limit-in-psu-banks/articleshow/124080934.cms",
            "description": "India is planning to allow more foreign investment in Public Sector Banks. The current limit is 20%. The government wants to strengthen these banks. This will help them raise more capital. The government will keep at least 51% stake. This ensures the banks remain public. The goal is to make them globally competitive.",
            "pubDate": "2025-09-24T01:24:26.909850"
        },
        {
            "title": "Complacency and not valuations, real risk: BlackRock Quant Head",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/complacency-and-not-valuations-real-risk-blackrock-quant-head/articleshow/124080748.cms",
            "description": "BlackRock's Raffaele Savi remains optimistic about equities, citing strong growth drivers and investor caution outside US tech. He dismisses dot-com comparisons, highlighting real revenues in today's tech firms. Savi emphasizes quant funds' role in providing steady returns and the importance of combining AI with human judgment to navigate market shifts, advocating for equity-heavy portfolios for better retirement outcomes.",
            "pubDate": "2025-09-24T01:24:26.909941"
        },
        {
            "title": "Amwoodo raises $4 million from Rainmatter, others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amwoodo-raises-4-million-from-rainmatter-others/articleshow/124080839.cms",
            "description": "Kamath's Rainmatter has put in $2 million while Adventz, Caspian and Singapore's ThinKuvate have invested $2 million between them, Amwoodo founder and chief executive Agni Mitra told ET.",
            "pubDate": "2025-09-24T01:24:26.910350"
        },
        {
            "title": "Banking liquidity turns deficit in FY26 as tax outflows rise, RBI steps in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banking-liquidity-turns-deficit-in-fy26-as-tax-outflows-rise-rbi-steps-in/articleshow/124080795.cms",
            "description": "For the first time in fiscal year 2026, banking system liquidity has moved into deficit due to tax outflows. The Reserve Bank of India is infusing funds to stabilize overnight rates. Tax payments, including GST and advance taxes, caused the shift. The RBI conducted variable rate repo auctions to manage rates.",
            "pubDate": "2025-09-24T01:24:26.910628"
        },
        {
            "title": "US tariffs loom over Southeast Asia trade talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-tariffs-loom-over-southeast-asia-trade-talks/slideshow/124083294.cms",
            "description": "US Trade Representative Jamieson Greer is meeting ASEAN counterparts in Kuala Lumpur to discuss a trade and investment agreement. The talks come amid heavy U.S. tariffs that are affecting exports across the region and creating economic uncertainty. (Source: Reuters)",
            "pubDate": "2025-09-24T05:00:06.984279"
        },
        {
            "title": "What makes Unimech, Solar Industries & Bharat Dynamics most expensive defence stocks - should you bet?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-makes-unimech-solar-industries-bharat-dynamics-most-expensive-defence-stocks-should-you-bet/articleshow/124083123.cms",
            "description": "Several Indian defense stocks, including Unimech Aerospace, Bharat Dynamics, and Solar Industries, are trading at high valuations, raising concerns about justification. Despite valuation worries, analysts cite strong order books, policy support, rising exports, and the government's self-reliance push as reasons for investor confidence.",
            "pubDate": "2025-09-24T05:00:06.984412"
        },
        {
            "title": "Hyundai shares rally nearly 90% from April lows. Can it turn multibagger?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-shares-rally-nearly-90-from-april-lows-can-it-turn-multibagger/articleshow/124082777.cms",
            "description": "Hyundai Motor India's stock is performing well due to GST reforms and festive sales. Shares hit a record high, and analysts predict further growth. Nomura expects India to contribute significantly to Hyundai's global sales by 2030. Capacity expansion is underway with a new Pune facility. The company plans new EV and hybrid models.",
            "pubDate": "2025-09-24T05:00:06.984525"
        },
        {
            "title": "Sensex drops over 300 pts, Nifty below 25,100 as D-St slide stretches to day 4, US visa worries cloud sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-over-300-pts-nifty-below-25100-as-d-st-slide-stretches-to-day-4-us-visa-worries-cloud-sentiment/articleshow/124082576.cms",
            "description": "Indian stocks commenced trading on Wednesday with a decline, as both the Sensex and Nifty extended their losing streak to a fourth consecutive day. Investor sentiment was negatively impacted by concerns surrounding U.S. H-1B visa regulations. The downturn was widespread, with continuous foreign capital outflows overshadowing expectations of increased consumption during the festive season.",
            "pubDate": "2025-09-24T05:00:06.984623"
        },
        {
            "title": "Tata Motors shares in focus as Jaguar Land Rover extends production halt after cyberattack",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-as-jaguar-land-rover-extends-production-halt-after-cyberattack/articleshow/124082752.cms",
            "description": "Tata Motors shares: Tata Motors’ unit Jaguar Land Rover has extended its production halt until October 1, 2025, after a September 2 cyberattack disrupted operations and supply chains, leaving tens of thousands of workers idle. The automaker, which earlier planned to resume on September 24, said the extension provides clarity as it works on a phased restart and continues its investigation.",
            "pubDate": "2025-09-24T05:00:06.984723"
        },
        {
            "title": "Dilip Buildcon shares rally 6% on Rs 1,115 crore Kerala industrial project win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dilip-buildcon-shares-in-focus-on-rs-1115-crore-kerala-industrial-project-order-win/articleshow/124082667.cms",
            "description": "Dilip Buildcon shares: Dilip Buildcon has emerged as the lowest bidder (L-1) for a ₹1,115 crore industrial corridor project in Kerala. The contract, awarded by the Kerala Industrial Corridor Development Corporation, includes design, construction, and O&M of infrastructure at Pudussery Central and Kannambra in Palakkad.",
            "pubDate": "2025-09-24T05:00:06.984821"
        },
        {
            "title": "Mukesh Ambani, Gautam Adani clash in battle of Kutch. Who will win multi-billion dollar green goldmine?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukesh-ambani-gautam-adani-clash-in-battle-of-kutch-who-will-win-multi-billion-dollar-green-goldmine/articleshow/124082603.cms",
            "description": "Billionaires Mukesh Ambani and Gautam Adani are in a high-stakes battle to lead India's new energy sector. Both Reliance Industries and Adani Group are investing heavily in renewable energy projects located in Gujarat's Rann of Kutch. RIL's focus is on manufacturing while Adani has a natural edge in renewable power sales. The winner will likely dominate India's renewable energy landscape.",
            "pubDate": "2025-09-24T05:00:06.984934"
        },
        {
            "title": "Torrent Power shares in focus after buying Newzone firms for Rs 211 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/torrent-power-shares-in-focus-after-buying-newzone-firms-for-rs-211-crore/articleshow/124082567.cms",
            "description": "Torrent Power has acquired Newzone India and Newzone Power Projects for ₹211 crore, gaining control of 922 acres in Madhya Pradesh earmarked for a thermal power project. While both companies have reported no recent turnover, this acquisition expands Torrent Power's land holdings for potential power generation. The company's Q1 results showed a decline, with net profit falling 24.",
            "pubDate": "2025-09-24T05:00:06.985035"
        },
        {
            "title": "Tata Motors, AU Small Finance among 8 stocks that show bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-au-small-finance-among-8-stocks-that-show-bullish-rsi-upswing/slideshow/124082517.cms",
            "description": "On September 23, in the Nifty500 pack, eight stocks were highlighted in the RSI Trending Up scan, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-24T05:00:06.985129"
        },
        {
            "title": "Tata Investment Corporation, GMDC among 6 stocks flashing bullish VWAP signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corporation-gmdc-among-6-stocks-flashing-bullish-vwap-signals/slideshow/124082441.cms",
            "description": "The closing prices of six stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on September 23, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-09-24T05:00:06.985225"
        },
        {
            "title": "Mazagon Dock Shipbuilders shares in focus after signing MoU for greenfield shipyard in Tamil Nadu",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mazagon-dock-shipbuilders-shares-in-focus-after-signing-mou-for-greenfield-shipyard-in-tamil-nadu/articleshow/124082316.cms",
            "description": "Mazagon Dock share price: Mazagon Dock Shipbuilders signed an MoU with Guidance Tamil Nadu to explore a greenfield shipyard on India’s eastern coast. The agreement, formalised at a Ministry of Defence event, underscores MDL’s plans to expand its footprint and enhance shipbuilding capabilities in the region.",
            "pubDate": "2025-09-24T05:00:06.985320"
        },
        {
            "title": "Swiggy shares in focus after Rs 2,399 crore stake sale in Rapido, Instamart slump sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-in-focus-after-rs-2399-crore-stake-sale-in-rapido-instamart-slump-sale/articleshow/124082260.cms",
            "description": "Swiggy's board has approved the sale of its stake in Rapido. The sale will be to MIH Investments One B.V. and Setu AIF Trust. The total value of the deal is Rs 2,399 crore. Swiggy will also transfer its Instamart business to a subsidiary. The transfer includes all assets and liabilities. The deal awaits regulatory and shareholder approvals.",
            "pubDate": "2025-09-24T05:00:06.985413"
        },
        {
            "title": "Sampat Aluminium shares set to list today; GMP hints at modest debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sampat-aluminium-shares-set-to-list-today-gmp-hints-at-modest-debut/articleshow/124082216.cms",
            "description": "Sampat Aluminium is set to list on the Bombay Stock Exchange SME platform on Wednesday. The Initial Public Offering saw massive investor interest, subscribing 169.09 times. The IPO included 25.44 lakh fresh shares priced between Rs 114 and Rs 120. The grey market premium indicates positive sentiment. The retail portion was subscribed 161.68 times.",
            "pubDate": "2025-09-24T05:00:06.985505"
        },
        {
            "title": "Technical call: Tata Investment heading towards Rs 12,000 after breakout rally, stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-call-tata-investment-heading-towards-rs-12000-after-breakout-rally-stock-split/articleshow/124082162.cms",
            "description": "Ventura Securities predicts a rise in Tata Investment Corporation shares. The target is Rs 12,000 from the current level. The stock shows a strong breakout with high trading volumes. Technical indicators also suggest a positive trend. Shareholders have approved a stock split. The stock recently hit a new 52-week high. This reflects strong investor confidence in Tata Investment.",
            "pubDate": "2025-09-24T05:00:06.985596"
        },
        {
            "title": "HSBC upgrades India to ‘Overweight’, sees Sensex rallying till 94,000 by 2026 end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-upgrades-india-to-overweight-sees-sensex-rallying-till-94000-by-2026-end/articleshow/124081995.cms",
            "description": "HSBC has upgraded India’s equities to ‘Overweight’ from ‘Neutral’, citing strong domestic investor flows, supportive government policies, and attractive valuations. The firm projects the Sensex could reach 94,000 by the end of 2026, highlighting India’s resilience amid broader Asian market volatility and policy-driven growth.",
            "pubDate": "2025-09-24T05:00:06.985686"
        },
        {
            "title": "Yes Bank shares in focus after SMBC picks up additional 4.22% stake, overtakes SBI as largest shareholder",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-after-smbc-picks-up-additional-4-22-stake-overtakes-sbi-as-largest-shareholder/articleshow/124081822.cms",
            "description": "Yes Bank share price: SMBC has become the largest shareholder in Yes Bank after acquiring an additional 4.22% stake for Rs 8,888.97 crore, raising its holding to 24.22% and overtaking SBI. The deal, executed via Carlyle affiliate CA Basque, strengthens SMBC’s India banking presence.",
            "pubDate": "2025-09-24T05:00:06.985787"
        }
    ]
}