{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-13T03:54:34.942979",
    "items": [
        {
            "title": "Sebi’s new norms: FPI path to India eased; new rulebook for IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-new-norms-fpi-path-to-india-eased-new-rulebook-for-ipos/articleshow/123863084.cms",
            "description": "The Securities and Exchange Board of India is set to ease Foreign Portfolio Investors entry norms. This move aims to counter their withdrawal from the Indian equity market. Sebi will also relax IPO issue sizes for large Indian companies. Insurance companies and pension funds will get a quota in IPO anchor books.",
            "pubDate": "2025-09-13T03:54:33.230336"
        },
        {
            "title": "Wall Street coasts to the finish of its best week in the last 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-coasts-to-the-finish-of-its-best-week-in-the-last-5/articleshow/123863060.cms",
            "description": "Wall Street concluded its strongest week in five, hovering near record highs as investors anticipate a Federal Reserve interest rate cut. The S&P 500 remained relatively stable, while the Dow Jones Industrial Average declined, and the Nasdaq composite increased.",
            "pubDate": "2025-09-13T03:54:33.230461"
        },
        {
            "title": "Wall Street Week Ahead: Investors seek Fed's view of shaky labor market as rate cut looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-seek-feds-view-of-shaky-labor-market-as-rate-cut-looms/articleshow/123863039.cms",
            "description": "Investors anticipate the Federal Reserve will likely cut interest rates next week, potentially the first time in nine months, amid concerns about a weakening U.S. labor market. Despite recent inflation data, a rate cut is widely expected, with speculation focusing on the size of the reduction.",
            "pubDate": "2025-09-13T03:54:33.230696"
        }
    ]
}