{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-27T15:59:34.882932",
    "items": [
        {
            "title": "Q3 results today: Asian Paints, Vodafone and Tata Consumer among 59 BSE-listed companies to announce earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-asian-paints-vodafone-and-tata-consumer-among-59-bse-listed-companies-to-announce-earnings/articleshow/127587902.cms",
            "description": "As earnings season progresses, investors are keenly watching 59 BSE-listed companies, including Nifty giants Asian Paints and Tata Consumer Products. Asian Paints is expected to show stable performance with improved volumes, while Vodafone Idea anticipates subdued results with widening losses. Tata Consumer Products is projected for a significant year-on-year profit increase.",
            "pubDate": "2026-01-27T02:08:47.102029"
        },
        {
            "title": "Axis Bank posts a 2.9% rise in Q3 net amid thinning margin",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-posts-a-2-9-rise-in-q3-net-amid-thinning-margin/articleshow/127584253.cms",
            "description": "Axis Bank reported a modest 2.9% net profit increase for the third quarter, impacted by a narrower net interest margin and higher credit costs. This was partly due to a technical change in loan accounting, which also affected gross slippages. Despite this, the bank saw deposit and loan book growth, with a focus on recalibrating its loan portfolio.",
            "pubDate": "2026-01-27T02:08:47.102154"
        },
        {
            "title": "Vodafone Idea Q3 Results Preview: Losses to widen further; marginal revenue growth seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vodafone-idea-q3-results-preview-losses-to-widen-further-marginal-revenue-growth-seen/articleshow/127597396.cms",
            "description": "Vodafone Idea is expected to report a weak December-quarter showing, with revenue growth remaining muted and losses widening as modest ARPU gains are offset by continued subscriber erosion. An average of five brokerages forecasts revenue growth of about 1% YoY in Q3, while losses are seen expanding to around Rs 6,700-7,000 crore.",
            "pubDate": "2026-01-27T05:54:46.245113"
        },
        {
            "title": "Maruti Suzuki Q3 Preview: PAT seen rising up to 35% YoY. 5 key parameters to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q3-preview-pat-seen-rising-up-to-35-yoy-5-key-parameters-to-watch/articleshow/127602967.cms",
            "description": "Maruti Suzuki is expected to deliver a strong Q3 performance, driven by robust volumes, an improved product mix and operating leverage. Brokerages forecast a 24–35% surge in net profit and over 30% revenue growth, though margin trends may vary. The automaker will announce its October–December earnings on January 28.",
            "pubDate": "2026-01-27T06:56:54.219695"
        },
        {
            "title": "Tata Consumer Products Q3 Results: Cons PAT jumps 38% YoY to Rs 385 crore; revenue up 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-products-q3-results-cons-pat-jumps-38-yoy-to-rs-385-crore-revenue-up-15/articleshow/127607200.cms",
            "description": "Tata Consumer Products Q3 Results: Tata Consumer Products reported a robust 38% year-on-year increase in net profit for the December quarter, reaching Rs 385 crore. Revenue from operations also saw a significant 15% jump to Rs 5,112 crore, driven by strong volume growth across its India Branded business, including notable performance in coffee and the Tata Sampann portfolio.",
            "pubDate": "2026-01-27T08:30:04.205012"
        },
        {
            "title": "L&T Q3 Results Preview: Profit seen surging 20–35% YoY, revenue uptick likely around 16%. 6 things to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-q3-results-preview-profit-seen-surging-2035-yoy-revenue-uptick-likely-around-16-6-things-to-watch/articleshow/127612111.cms",
            "description": "Larsen & Toubro is set for a strong December quarter, with brokerages forecasting 20–35% profit growth, double-digit revenue and EBITDA gains, improving margins, and a robust order book driven by steady execution and operating leverage across infrastructure and hydrocarbons segments.",
            "pubDate": "2026-01-27T09:57:57.174621"
        },
        {
            "title": "Asian Paints Q3 Results: Cons profit slips over 4% YoY to Rs 1,060 crore; revenue up 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/asian-paints-q3-results-cons-net-profit-slips-over-4-yoy-revenue-up-3/articleshow/127609725.cms",
            "description": "Asian Paints announced its third quarter results for FY26. The company's net profit saw a slight decrease of 4.5 percent compared to the previous year. However, its revenue from operations showed positive growth. This indicates a mixed financial performance for the paint giant during the period.",
            "pubDate": "2026-01-27T09:57:57.174746"
        },
        {
            "title": "Raymond profit jumps 78% YoY on aero, defence component demand; shares surge 14%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/raymond-profit-jumps-78-yoy-on-aero-defence-component-demand-shares-surge-14/articleshow/127608887.cms",
            "description": "India's Raymond reported a 78% rise in ‍quarterly profit on Tuesday, ​supported by robust demand for its ⁠aero and defense components.",
            "pubDate": "2026-01-27T09:57:57.174844"
        },
        {
            "title": "Marico Q3 Results: Profit up 13.3% to Rs 460 crore, revenue up 26.6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/marico-q3-results-profit-up-13-3-to-rs-460-crore-revenue-up-26-6/articleshow/127623992.cms",
            "description": "Homegrown FMCG major Marico Ltd on Tuesday reported a 13.3 per cent rise in consolidated profit to Rs 460 crore for the December quarter, led by a high single-digit volume growth from the Indian market.",
            "pubDate": "2026-01-27T14:21:19.746865"
        },
        {
            "title": "Vodafone Idea Q3 Results: Cons loss narrows YoY to Rs 5,286 crore, revenue up 2%; ARPU rises to Rs 186",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vodafone-idea-q3-results-cons-loss-narrows-yoy-to-rs-5286-crore-revenue-up-2-arpu-rises-to-rs-186/articleshow/127633674.cms",
            "description": "Vodafone Idea Q3 Results: Vodafone Idea narrowed its consolidated losses to Rs 5,286 crore in Q3FY26 versus Rs 6,609 crore in the year ago period. The telecom company's revenue from operations for the quarter stood at Rs 11,323 crore, up 2% over Rs 11,117 crore in the corresponding quarter of the last financial year.",
            "pubDate": "2026-01-27T15:20:34.134152"
        },
        {
            "title": "PC Jeweller Q3 Results: Profit jumps 28% to Rs 190 crore on higher revenue amid festive demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pc-jeweller-q3-results-profit-jumps-28-to-rs-190-crore-on-higher-revenue-amid-festive-demand/articleshow/127635799.cms",
            "description": "PC Jeweller Ltd on Tuesday reported a 28 per cent increase in its consolidated net profit at Rs 190.10 crore in the quarter ended December, mainly on festive demand.",
            "pubDate": "2026-01-27T15:59:33.378948"
        },
        {
            "title": "Spandana Sphoorty cuts Q3 losses as NPAs fall and disbursements rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spandana-sphoorty-cuts-q3-losses-as-npas-fall-and-disbursements-rise/articleshow/127635615.cms",
            "description": "Spandana Sphoorty narrowed its December-quarter loss to Rs 95 crore as asset quality improved and collections stabilised. Gross NPAs declined, disbursements rose sequentially, but loan book contraction, write-offs and covenant non-compliance kept the microfinance lender in the red this quarter.",
            "pubDate": "2026-01-27T15:59:33.379053"
        }
    ]
}