{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-13T04:31:24.291375",
    "items": [
        {
            "title": "Sebi’s new norms: FPI path to India eased; new rulebook for IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebis-new-norms-fpi-path-to-india-eased-new-rulebook-for-ipos/articleshow/123863084.cms",
            "description": "The Securities and Exchange Board of India is set to ease Foreign Portfolio Investors entry norms. This move aims to counter their withdrawal from the Indian equity market. Sebi will also relax IPO issue sizes for large Indian companies. Insurance companies and pension funds will get a quota in IPO anchor books.",
            "pubDate": "2025-09-13T03:54:33.230336"
        },
        {
            "title": "Wall Street coasts to the finish of its best week in the last 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-coasts-to-the-finish-of-its-best-week-in-the-last-5/articleshow/123863060.cms",
            "description": "Wall Street concluded its strongest week in five, hovering near record highs as investors anticipate a Federal Reserve interest rate cut. The S&P 500 remained relatively stable, while the Dow Jones Industrial Average declined, and the Nasdaq composite increased.",
            "pubDate": "2025-09-13T03:54:33.230461"
        },
        {
            "title": "Wall Street Week Ahead: Investors seek Fed's view of shaky labor market as rate cut looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-investors-seek-feds-view-of-shaky-labor-market-as-rate-cut-looms/articleshow/123863039.cms",
            "description": "Investors anticipate the Federal Reserve will likely cut interest rates next week, potentially the first time in nine months, amid concerns about a weakening U.S. labor market. Despite recent inflation data, a rate cut is widely expected, with speculation focusing on the size of the reduction.",
            "pubDate": "2025-09-13T03:54:33.230696"
        },
        {
            "title": "NARCL to auction Rs 3,700 crore Wind World debt; Omkara files anchor offer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/narcl-to-auction-wind-world-debt-omkara-files-anchor-offer/articleshow/123863230.cms",
            "description": "National Asset Reconstruction Company is selling Wind World's debt. The reserve bid is ₹1,250 crore. Omkara ARC has emerged as the anchor bidder. They offered around ₹1,250 crore. NARCL acquired the distressed company's loans 18 months ago. The acquisition amount was ₹672 crore. The resolution process is underway. The Swiss Challenge auction is expected to wrap up soon.",
            "pubDate": "2025-09-13T04:31:22.619999"
        },
        {
            "title": "Nifty closes above 25,000 for a 2nd day, points to more gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-closes-above-25000-for-a-2nd-day-points-to-more-gains/articleshow/123863208.cms",
            "description": "Domestic equities marked a second consecutive week of gains, propelled by a surge in IT stocks following positive remarks from Donald Trump on India and Infosys' share buyback announcement. The NSE Nifty closed above 25,000, fueling optimism for further gains, while the Volatility Index declined, signaling reduced market risk.",
            "pubDate": "2025-09-13T04:31:22.620131"
        }
    ]
}