{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-18T04:33:43.837224",
    "items": [
        {
            "title": "Strides Founder raises Rs 1000 crore to refinance debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strides-founder-raises-rs-1000-crore-to-refinance-debt/articleshow/124652167.cms",
            "description": "Arun Kumar, founder of Strides Group and OneSource, has secured ₹1,000 crore by pledging shares. This move refinances existing loans, extending maturities and simplifying repayments. The transaction aims to consolidate smaller borrowings into larger, long-term facilities. It reflects a broader effort to clean up the promoter's balance sheet and shows a decline in pledged shares, indicating deleveraging.",
            "pubDate": "2025-10-18T02:33:40.041368"
        },
        {
            "title": "PSBs reap gains from rising interest income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-india-central-bank-and-uco-bank-post-q2-profit-gains-despite-margin-pressure/articleshow/124652381.cms",
            "description": "Public sector banks Uco Bank, Central Bank of India, and Bank of India reported increased net profits in the September quarter, driven by higher interest income and reduced provisions. Despite a dip in net interest margins, all three banks saw loan growth outpace deposit growth, indicating a positive operational trend.",
            "pubDate": "2025-10-18T02:33:40.041524"
        },
        {
            "title": "After a tough quarter, SFBs hope for credit quality, growth uptick",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-bank-jana-ujjivan-report-lower-q2-net-profit-on-higher-expenses-credit-cost/articleshow/124652260.cms",
            "description": "Small finance banks faced profitability pressures in the second quarter due to higher credit costs and expenses. AU Small Finance Bank saw a dip in net profit, while Ujjivan and Jana reported significant drops. Lenders expressed confidence in improving credit quality from unsecured business in the coming quarter.",
            "pubDate": "2025-10-18T02:33:40.041959"
        },
        {
            "title": "Banking stocks lead markets to four-month high ahead of Diwali",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banking-stocks-lead-markets-to-four-month-high-ahead-of-diwali/articleshow/124652984.cms",
            "description": "Indian stock markets saw their best weekly performance in four months. Banking stocks led the rally, fueled by positive business updates and loan growth. Investors are optimistic ahead of the Diwali trading session. While short-term gains are expected, analysts suggest caution post-Diwali as loan growth may not sustain. Foreign investors showed buying interest.",
            "pubDate": "2025-10-18T03:08:52.423461"
        },
        {
            "title": "JSW Infra plans Rs 5,500 crore capex push; Q2 PAT down 3.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-infra-plans-rs-5500-crore-capex-push-q2-pat-down-3-5/articleshow/124652742.cms",
            "description": "JSW Infrastructure will invest ₹4,000 crore in its port operations and ₹1,500 crore in its logistics arm in FY26. This spending will support both organic and inorganic growth. The company reported a profit after tax decline of 3.5% for the June quarter. Total revenue increased by 26% year-on-year.",
            "pubDate": "2025-10-18T03:08:52.423594"
        },
        {
            "title": "Wall Street ends higher as investors digest Trump trade comments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-as-investors-digest-trump-trade-comments/articleshow/124653434.cms",
            "description": "Wall Street closed higher Friday as investors weighed President Trump's remarks on China tariffs and regional bank earnings eased credit risk concerns. Trump's comments on tariffs were seen as mixed, while regional banks rebounded, with Truist Financial and Zions Bancorporation showing gains.",
            "pubDate": "2025-10-18T03:36:11.919866"
        },
        {
            "title": "Fed's Musalem leans toward supporting October interest rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-musalem-leans-toward-supporting-october-interest-rate-cut/articleshow/124654524.cms",
            "description": "St. Louis Federal Reserve President Alberto Musalem indicated a potential interest rate cut is on his mind. He stated he could support a reduction if job market risks appear and inflation stays under control. However, Musalem stressed the Federal Reserve should not follow a predetermined plan. His comments were made before a financial meeting.",
            "pubDate": "2025-10-18T04:33:41.578838"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/124654388.cms",
            "description": "Investors gear up for a whirlwind week. As US corporations unveil their earnings, inflation stats will also take center stage. In Japan, the possibility of a new prime minister could catalyze stock surges. Bolivia approaches a watershed election that marks the end of socialism.",
            "pubDate": "2025-10-18T04:33:41.578969"
        },
        {
            "title": "Rapid growth of ETF market triggers fears of bubble",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rapid-growth-of-etf-market-triggers-fears-of-bubble/articleshow/124654276.cms",
            "description": "The U.S. ETF landscape is booming with an influx of innovative products, sparking concerns of a potential bubble. Investors and brokerage firms are becoming increasingly discerning about their choices, with analysts predicting that numerous newcomers may struggle to stand the test of time.",
            "pubDate": "2025-10-18T04:33:41.579181"
        }
    ]
}