{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-09T15:42:50.520538",
    "items": [
        {
            "title": "Interglobe Aviation among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/interglobe-aviation-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/125861102.cms",
            "description": "As of 8 December, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% compared to the previous trade. A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-09T04:16:46.606485"
        },
        {
            "title": "Bond investors shift to mid-curve as Fed prepares for final 2025 rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bond-investors-shift-to-mid-curve-as-fed-prepares-for-final-2025-rate-cut/articleshow/125861002.cms",
            "description": "Investors expect a shallow Fed easing cycle, shifting preference to intermediate Treasuries as inflation stays stubborn and long-term yields remain sticky, prompting portfolio adjustments across the bond market.",
            "pubDate": "2025-12-09T04:16:46.606589"
        },
        {
            "title": "Why stock market is falling today? Sensex slumps 600 pts, Nifty below 25,800; key factors behind the decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slides-over-450-pts-nifty-below-25850-as-fed-jitters-keep-traders-on-defense/articleshow/125860832.cms",
            "description": "Indian stocks opened lower on Tuesday, with both the Sensex and Nifty extending their previous day's significant decline. Investors remained cautious, anticipating the Federal Reserve's interest rate decision and ongoing uncertainty surrounding a U.S. trade agreement. This cautious sentiment followed their steepest drop in over two months.",
            "pubDate": "2025-12-09T04:16:46.606677"
        },
        {
            "title": "Multibagger Tata stock delivers Rs 1 lakh crore shock, turns into worst Nifty performer of 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-tata-stock-delivers-rs-1-lakh-crore-shock-turns-into-worst-nifty-performer-of-2025/articleshow/125860080.cms",
            "description": "Trent's stock faces a sharp decline, becoming the worst performer in the Nifty50. Aggressive store expansion has led to cannibalization, while a consumption slowdown and rising competition impact Zudio's dominance. Despite headwinds, some analysts remain optimistic about long-term recovery and valuation.",
            "pubDate": "2025-12-09T04:16:46.606762"
        },
        {
            "title": "HCL Technologies shares in focus after strategic pact to co-develop energy-efficient chips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-technologies-shares-in-focus-after-strategic-pact-to-co-develop-energy-efficient-chips/articleshow/125859964.cms",
            "description": "HCL Technologies said it has entered a strategic partnership with France-based Dolphin Semiconductor to co-develop energy-efficient chips. The collaboration will integrate Dolphin’s low-power semiconductor IP into HCLTech’s silicon design workflows to build high-efficiency system-on-chip solutions. HCLTech executives said the move aligns with rising demand for sustainable, high-performance computing as AI workloads expand. Dolphin Semiconductor said the partnership will extend the reach of its low-power technology across applications from IoT devices to data-centre ecosystems.",
            "pubDate": "2025-12-09T04:16:46.606844"
        },
        {
            "title": "Welspun Corp shares in focus as subsidiary bags Rs 1,165 crore order win. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/welspun-corp-shares-in-focus-as-subsidiary-bags-rs-1165-crore-order-win-check-details/articleshow/125859929.cms",
            "description": "Welspun Corp's associate, East Pipes Integrated Company (EPIC), secured a significant 485 million SAR steel pipe order from the Saudi Water Authority. This deal, valued at approximately Rs 1,165 crore, will impact WCL's financials in Q4 FY2025-26 and Q1 FY2026-27.",
            "pubDate": "2025-12-09T04:16:46.606926"
        },
        {
            "title": "Fujiyama Power Systems shares rally 5% as Q2 net profit nearly doubles to Rs 63 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fujiyama-power-systems-shares-in-focus-as-q2-net-profit-nearly-doubles-to-rs-63-crore/articleshow/125859259.cms",
            "description": "On December 9, Fujiyama Power Systems experienced a significant stock surge following the release of their impressive FY26 second-quarter financial results. The company reported remarkable year-on-year increases in both revenue and profits. With plans to expand their manufacturing facilities and retail presence, Fujiyama is gaining momentum.",
            "pubDate": "2025-12-09T04:16:46.607010"
        },
        {
            "title": "Siemens shares in focus as co approves Rs 2,200 crore sale of low voltage motors business to Innomotics",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/siemens-shares-in-focus-as-co-approves-rs-2200-crore-sale-of-low-voltage-motors-business-to-innomotics/articleshow/125859284.cms",
            "description": "Siemens shares may be in focus after the company approved the sale of its Low Voltage Motors and Geared Motors business to Innomotics India for Rs 2,200 crore. The transaction, based on a slump sale, is expected to close by June 2026 following regulatory clearances and aligns with Siemens’ global restructuring.",
            "pubDate": "2025-12-09T04:16:46.607091"
        },
        {
            "title": "KRBL, LT Foods, other rice stocks crack up to 10% as Trump hints at possible tariffs on Indian imports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/krbl-lt-foods-other-rice-stocks-in-focus-as-trump-hints-at-possible-tariffs-on-indian-imports/articleshow/125858967.cms",
            "description": "Indian rice exporter shares tumbled as US President Donald Trump signaled potential new tariffs on rice imports from India. Trump cited \"dumping\" of cheaper rice, aiming to support American farmers facing rising costs. This move adds to existing trade tensions between the US and India, with further tariff threats also looming for Canadian fertilizer imports.",
            "pubDate": "2025-12-09T04:16:46.607170"
        },
        {
            "title": "Latent View Analytics and 3 other stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/latent-view-analytics-and-3-other-stocks-showing-bullish-rsi-upswing/slideshow/125858835.cms",
            "description": "On December 8, four stocks from the Nifty500 universe appeared in the RSI Trending Up scan using stockedge.com data. An RSI moving above 50 suggests improving momentum, offering traders early-stage buying cues where strength is building after a consolidation phase.",
            "pubDate": "2025-12-09T04:16:46.607257"
        },
        {
            "title": "Death Crossovers: These 5 stocks signal bearishness on December 9",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/death-crossovers-these-5-stocks-signal-bearishness-on-december-9/slideshow/125858121.cms",
            "description": "In the Nifty500 pack, five stocks are witnessing Death Crossovers, according to stockedge.com's technical scan data. The death cross is a technical indicator of bearishness. The death cross appears on a chart when a stock’s short-term simple moving average (SMA) crosses below its long-term moving average on the downside. These stocks' 50-day SMA crossed below their 200-day SMAs on December 8. Take a look:",
            "pubDate": "2025-12-09T04:16:46.607333"
        },
        {
            "title": "IndiGo shares snap 5-day losing streak to trade in green as airline responds to DGCA show-cause notice",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-as-airline-responds-to-dgca-show-cause-notice/articleshow/125857857.cms",
            "description": "IndiGo has formally responded to the DGCA's notice concerning widespread flight cancellations and delays. The airline cited changes in pilot duty norms and minor technical issues as contributing factors. IndiGo is working to resolve operational challenges and has processed significant refunds for affected passengers. The DGCA is reviewing the response and will take necessary action.",
            "pubDate": "2025-12-09T04:16:46.607412"
        },
        {
            "title": "PhysicsWallah shares surge 5% after Q2 PAT jumps 70% YoY to Rs 70 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/physicswallah-shares-in-focus-after-q2-pat-jumps-70-yoy-to-rs-70-cr/articleshow/125857730.cms",
            "description": "PhysicsWallah has soared to new heights, boasting an impressive 70% profit increase year-on-year for the September quarter. Such financial success has not only driven revenue growth but also strengthened investor confidence substantially. The edtech company is actively extending its physical presence and diversifying into various testing categories.",
            "pubDate": "2025-12-09T04:16:46.607494"
        },
        {
            "title": "Stocks to buy in 2025: HSBC initiates buy on Tata Consumer Products; Goldman Sachs recommends buy on Max Healthcare",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-hsbc-initiates-buy-on-tata-consumer-products-goldman-sachs-recommends-buy-on-max-healthcare/slideshow/125857422.cms",
            "description": "Brokerages remain optimistic across key sectors, rolling out a series of positive ratings backed by strong earnings visibility and favourable sector trends.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-09T04:16:46.607572"
        },
        {
            "title": "Helloji Holidays shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/helloji-holidays-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/125857247.cms",
            "description": "Helloji Holidays is set to list on the BSE SME platform on December 9. The company's IPO saw strong demand, closing 30.16 times subscribed. Despite a modest grey market premium, investors anticipate its debut. Helloji Holidays operates in the travel and tourism sector, offering customized packages and end-to-end travel solutions. The IPO proceeds will fund working capital and software systems.",
            "pubDate": "2025-12-09T04:16:46.607648"
        },
        {
            "title": "Neochem Bio Solutions IPO listing today. GMP hints at mild premium",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/neochem-bio-solutions-ipo-listing-today-gmp-hints-at-mild-premium/articleshow/125857174.cms",
            "description": "Neochem Bio Solutions is set to debut on the NSE SME platform on December 9, with its IPO seeing strong subscription despite a muted grey market. The company, a player in speciality performance chemicals with over 350 formulations, reported significant profit growth. Funds raised will bolster working capital and repay debt, positioning Neochem for a steady market entry.",
            "pubDate": "2025-12-09T04:16:46.607724"
        },
        {
            "title": "Berkshire reshuffles top ranks as Greg Abel prepares to succeed Warren Buffett",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-reshuffles-top-ranks-as-greg-abel-prepares-to-succeed-warren-buffett/articleshow/125861541.cms",
            "description": "Berkshire Hathaway is undergoing a significant management overhaul as Greg Abel prepares to succeed Warren Buffett as CEO. Key investment manager Todd Combs is departing for JPMorgan Chase, while Marc Hamburg, the veteran finance chief, will retire in 2027, with Charles Chang set to take over. These changes signal a new era for Berkshire's leadership and investment strategy.",
            "pubDate": "2025-12-09T04:43:56.496849"
        },
        {
            "title": "Buy, Sell or Hold: Citi, Morgan Stanley highlight fresh upside in GAIL, insurance majors, and Coforge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-morgan-stanley-highlight-fresh-upside-in-gail-insurance-majors-and-coforge/articleshow/125861141.cms",
            "description": "Brokerages are turning constructive on key sectors like energy, financial services, and IT. Citi reiterates a Buy on GAIL India, seeing an improved risk-reward, and notes robust growth for life insurers. Morgan Stanley maintains an Overweight on Coforge, highlighting its focus on large deals and ServiceNow expansion.",
            "pubDate": "2025-12-09T04:43:56.496964"
        },
        {
            "title": "Kaynes Technology shares now cheapest in JPMorgan’s coverage after 40% correction in a month. Time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-shares-now-cheapest-in-jpmorgans-coverage-after-40-correction-in-a-month-time-to-buy/articleshow/125861105.cms",
            "description": "Kaynes Technology shares are now the cheapest in JPMorgan's coverage. A recent 40% stock drop occurred without fundamental changes. JPMorgan maintains an Overweight rating, seeing significant upside. The company expects working capital and receivables to improve in the coming quarters. Investor concerns arose from a Kotak Equities note regarding financial disclosures.",
            "pubDate": "2025-12-09T04:43:56.497154"
        },
        {
            "title": "Wall Street shrugs off predictions of a dovish turn at the Fed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-shrugs-off-predictions-of-a-dovish-turn-at-the-fed/articleshow/125861996.cms",
            "description": "Financial analysts expect a dovish Fed leader aligned with Trump, yet markets imply only modest easing ahead. With inflation elevated, prior rate cuts largely priced in, and fiscal expansion limiting flexibility, aggressive policy shifts look unlikely. A split FOMC with hawkish voters further reduces the scope for deeper monetary accommodation.",
            "pubDate": "2025-12-09T05:16:15.216411"
        },
        {
            "title": "SpiceJet shares rally 15% in 3 days as rival IndiGo faces flight cancellations, delays",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-rally-15-in-3-days-as-rival-indigo-faces-flight-cancellations-delays/articleshow/125861708.cms",
            "description": "SpiceJet shares surged on Tuesday, extending a 3-day winning streak. This rise follows significant disruptions at rival IndiGo, India's largest airline. IndiGo's operational issues have created an opportunity for SpiceJet. The airline is now operating additional flights to assist stranded passengers. IndiGo's parent company, InterGlobe Aviation, saw its stock slide further due to the ongoing crisis.",
            "pubDate": "2025-12-09T05:16:15.216518"
        },
        {
            "title": "Swiggy’s Rs 10,000-crore QIP kicks off after shareholders clear fundraise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggys-rs-10000-crore-qip-kicks-off-after-shareholders-clear-fundraise/articleshow/125862150.cms",
            "description": "Swiggy opened its Rs 10,000-crore QIP on Tuesday, a day after shareholders cleared the plan with 99.47% approval. The fundraise—its first since the 2024 IPO—comes as the company boosts spending in quick commerce to rival Blinkit and Zepto while strengthening its balance sheet.",
            "pubDate": "2025-12-09T05:37:35.994962"
        },
        {
            "title": "Kaynes Technology shares rebound 5% after crashing 30% in 4 days. Should you get in or get out now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-technology-shares-rebound-5-after-crashing-30-in-4-days-should-you-get-in-or-get-out-now/articleshow/125862026.cms",
            "description": "Kaynes Technology rebounded 5% on Tuesday after a 30% drop in four days, raising the question: buy, sell, or hold? The sell-off followed a Kotak report flagging disclosure gaps, but the company says issues are resolved. Analysts see value, with JPMorgan assigning a fair value of Rs 4,900, citing stable fundamentals and improving working capital.",
            "pubDate": "2025-12-09T05:37:35.995097"
        },
        {
            "title": "Meesho, Aequs or Vidya Wires: Which IPO has the highest listing potential tomorrow?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-aequs-or-vidya-wires-which-ipo-has-the-highest-listing-potential-tomorrow/articleshow/125863626.cms",
            "description": "Meesho, Aequs, and Vidya Wires debut tomorrow; Meesho leads in grey market premium, while Aequs offers balanced post-listing potential.",
            "pubDate": "2025-12-09T06:54:44.657157"
        },
        {
            "title": "Jefferies revamps 2026 portfolio: Cuts Indigo; adds BPCL, Axis Bank, 4 other stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-revamps-2026-portfolio-cuts-indigo-adds-bpcl-axis-bank-4-other-stocks/articleshow/125863365.cms",
            "description": "Jefferies updates its India model portfolio for 2026, adding six stocks including Axis Bank, AU Small Finance Bank, BPCL, JSW Energy, Godrej Properties, and SAMIL, while removing ICICI Bank, NTPC, Tata Steel, Crompton Consumer, Belrise, and IndiGo.",
            "pubDate": "2025-12-09T06:54:44.657260"
        },
        {
            "title": "HSBC on IndiGo: No structural damage, no de-rating. Here's all you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hsbc-on-indigo-no-structural-damage-no-de-rating-heres-all-you-need-to-know/articleshow/125863031.cms",
            "description": "IndiGo’s worst operational meltdown led to thousands of cancellations, rising costs and reputational strain, but HSBC says the airline’s long-term fundamentals remain intact. The brokerage cut its target price but kept a ‘Buy’ rating, arguing that despite new pilot-duty rules and short-term disruptions, IndiGo’s cost advantage and market position are unchanged as operations begin to stabilise.",
            "pubDate": "2025-12-09T06:54:44.657458"
        },
        {
            "title": "Nuvama Wealth fixes December 26 record date for first-ever stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nuvama-wealth-fixes-december-26-record-date-for-first-ever-stock-split/articleshow/125862772.cms",
            "description": "Nuvama Wealth Management will execute a 1:5 stock split on December 26, 2025, after shareholder approval. Each ₹10 share will be split into five ₹2 shares, with no change in total investment value for shareholders.",
            "pubDate": "2025-12-09T06:54:44.657553"
        },
        {
            "title": "Community boiler pioneer Steamhouse India files UDRHP with Sebi for Rs 425 cr IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/community-boiler-pioneer-steamhouse-india-files-udrhp-with-sebi-for-rs-425-cr-ipo/articleshow/125864533.cms",
            "description": "Steamhouse India Ltd has filed its Updated Draft Red Herring Prospectus I (UDRHP I) with Securities and Exchange Board of India (SEBI) for a proposed IPO. The IPO — totaling up to ₹425 crore — will include a fresh share issue of ₹345 crore and an Offer For Sale (OFS) worth ₹80 crore by promoter Vishal Sanwarprasad Budhia.",
            "pubDate": "2025-12-09T07:45:46.060406"
        },
        {
            "title": "European shares flat on caution ahead of Fed's rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-flat-on-caution-ahead-of-feds-rate-decision/articleshow/125865883.cms",
            "description": "European shares were muted on Tuesday, as caution lingered ahead of the U.S. Federal Reserve's two-day policy meeting starting later in the day, while gains in financial and industrial stocks kept the index afloat.",
            "pubDate": "2025-12-09T09:00:35.512629"
        },
        {
            "title": "Emkay Global sees up to 26% upside for IndiGo, expects operations to normalise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emkay-global-sees-up-to-26-upside-for-indigo-expects-operations-to-normalise/articleshow/125865799.cms",
            "description": "Emkay Global maintains a BUY on IndiGo-parent InterGlobe Aviation with a target of Rs 6,300, citing a potential 28.6% upside. The brokerage notes that recent operational disruptions caused over 4,200 cancellations, but expects normalization from December 10. Crew shortages, regulatory reviews, and elevated costs may weigh on near-term results, yet operational recovery could support a rebound in coming quarters.",
            "pubDate": "2025-12-09T09:00:35.512751"
        },
        {
            "title": "Smallcaps to face another tough year on earnings-valuations mismatch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-small-caps-to-face-another-tough-year-on-earnings-valuations-mismatch/articleshow/125865378.cms",
            "description": "The underperformance of India's small-cap firms relative to large- and mid-caps this year, after two years of strong gains, is likely to persist into 2026 as stretched valuations, moderate earnings and thin liquidity continue to weigh, analysts said.",
            "pubDate": "2025-12-09T09:00:35.512959"
        },
        {
            "title": "‘Buy’ calls pour in for Suzlon as analysts see 55% upside despite a 20% slide from the peak. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-calls-pour-in-for-suzlon-as-analysts-see-55-upside-despite-a-20-slide-from-the-peak-heres-why/articleshow/125866475.cms",
            "description": "Suzlon Energy shares remain in bear territory, but four major brokerages  Anand Rathi, ICICI Securities, Motilal Oswal, and Nuvama have turned bullish, projecting up to 55% upside driven by strong order books, capacity expansion, export readiness, and improving wind energy demand.",
            "pubDate": "2025-12-09T09:30:48.092105"
        },
        {
            "title": "Adani Energy Solutions, Adani Green see Moody’s outlook raised to stable; ratings affirmed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-energy-solutions-adani-green-see-moodys-outlook-raised-to-stable-ratings-affirmed/articleshow/125866457.cms",
            "description": "Moody’s revises its outlook to stable for key Adani Group energy and renewable subsidiaries, affirming their ratings on the back of steady operations, predictable cash flows and fully amortising debt structures, while noting manageable risks tied to weak state discoms and long-term licence periods.",
            "pubDate": "2025-12-09T09:30:48.092239"
        },
        {
            "title": "MFs double down on 12 smallcap stocks; 2 deliver double-digit gains in just 2 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mutual-funds-boost-holdings-in-12-smallcap-stocks-2-deliver-double-digit-gains-in-2-months/slideshow/125866249.cms",
            "description": "Retail investors often track the moves of large institutional players, especially mutual funds (MFs), which invest based on thorough research and long-term perspectives. September 2025 shareholding data shows that MFs increased their stakes in nearly 380 listed companies compared with the June quarter. Their top five high-conviction holdings were Equitas Small Finance Bank, Multi Commodity Exchange of India, Gokaldas Exports, Awfis Space Solutions, and Medi Assist Healthcare Services, where fund houses own 33-43%.However, the more interesting trend lies deeper. We highlight 12 stocks where MF holdings more than doubled quarter-on-quarter, each now having at least 1% MF ownership. Such sharp increases often signal renewed confidence and can precede a rebound or re-rating. Yet most of these stocks have posted negative returns since October, immediately after the September quarter ended. Still, three of the twelve stocks have risen over the past two months, with two delivering strong double-digit gains, early wins for institutional buyers. (Data Source: ACE Equity)",
            "pubDate": "2025-12-09T09:30:48.092346"
        },
        {
            "title": "Why less trading might actually work better for you, Zerodha co-founder Nithin Kamath explains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-less-trading-might-actually-work-better-for-you-zerodha-co-founder-nithin-kamath-explains/articleshow/125866948.cms",
            "description": "Nithin Kamath argued that increased trading activity reduces profitability for retail investors. He highlighted Zerodha’s model of discouraging frequent trades, resulting in significantly lower brokerage revenue compared to peers. By avoiding nudges that push volumes and not incentivising employees on revenue, Zerodha aims to promote thoughtful participation and long-term investor retention.",
            "pubDate": "2025-12-09T09:55:42.022212"
        },
        {
            "title": "Suzlon Energy shares are down 29% from peak but Nuvama just upgraded the stock to buy. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aequs-ipo-mehta-equities-sees-up-to-39-listing-pop-on-wednesday-but-says-no-to-booking-gains-heres-why/articleshow/125868128.cms",
            "description": "Suzlon Energy’s sharp correction has prompted Nuvama and other brokerages to turn bullish, citing improving sector visibility, strong order inflows, export potential, and expanding manufacturing capacity, even as the stock trades below key technical levels.",
            "pubDate": "2025-12-09T11:13:15.997482"
        },
        {
            "title": "Aequs IPO: Mehta Equities sees up to 39% listing pop on Wednesday, but says no to booking gains. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aequs-ipo-mehta-equities-sees-up-to-39-listing-pop-on-wednesday-but-says-no-to-booking-gains-heres-why/articleshow/125868041.cms",
            "description": "Aequs IPO is set for a strong listing with an expected premium of up to 39%, backed by heavy subscription, solid global customer relationships, and its position as a leading integrated aerospace precision manufacturing platform. Analysts advise holding the stock long term.",
            "pubDate": "2025-12-09T11:13:15.997617"
        },
        {
            "title": "Rupee finds breathing room on modest inflows, exporter hedging",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rupee-finds-breathing-room-on-modest-inflows-exporter-hedging/articleshow/125867884.cms",
            "description": "The Indian rupee closed modestly stronger on Tuesday, supported by dollar sales from exporters and modest foreign inflows while traders held onto caution ahead of the U.S. Federal Reserve's policy decision later this week.",
            "pubDate": "2025-12-09T11:13:15.997822"
        },
        {
            "title": "Adani Enterprises Rs 25,000 cr rights issue subscribed 82% ahead of closing tomorrow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-rs-25000-cr-rights-issue-subscribed-82-ahead-of-closing-tomorrow/articleshow/125867831.cms",
            "description": "Adani Enterprises’ Rs 25,000 crore rights issue has reached 82.6% subscription ahead of its December 10 close. The issue, priced at Rs 1,800 per share, has seen strong participation from promoters and institutional investors. Bids have crossed 11.6 crore shares against the 13.85 crore on offer, according to BSE data. Caption: The issue opened on November 25. Investors are required to pay Rs 900 per share at the time of application.",
            "pubDate": "2025-12-09T11:13:15.997980"
        },
        {
            "title": "Stock Radar: Samvardhana Motherson stock breaks out from rounding bottom formation; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-samvardhana-motherson-stock-breaks-out-from-rounding-bottom-formation-time-to-buy/articleshow/125828763.cms",
            "description": "Samvardhana Motherson International Ltd has broken out from a rounding bottom formation, reaching a 52-week high of Rs 119. Experts suggest buying the stock for a target of Rs 130 in the next 1-2 months, citing sustained momentum and bullish technical indicators.  Traders are advised to consider buying near Rs 115 with stop-losses below Rs 108.",
            "pubDate": "2025-12-09T11:42:39.788557"
        },
        {
            "title": "Dredging Corporation, 3 other smallcap stocks  hit 52-week highs; gains of up to 50% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dredging-corporation-3-other-smallcap-stocks-hit-52-week-highs-gains-of-up-to-50-in-a-month/slideshow/125869724.cms",
            "description": "Benchmark Sensex dropped 610 points to close at 85,103 on Tuesday. Despite the overall market decline, four BSE 500 stocks climbed to new 52-week highs, marking their strongest levels in a year. Such breakouts typically signal bullish momentum and the potential for further short-term gains.",
            "pubDate": "2025-12-09T12:43:42.767783"
        },
        {
            "title": "Brokerage takes down faulty article on PG Electroplast, conveys regrets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brokerage-takes-down-faulty-article-on-pg-electroplast-conveys-regrets/articleshow/125870726.cms",
            "description": "HDFC Securities apologised to PG Electroplast after an article on its HDFC Sky platform was found to contain factual inaccuracies and misleading claims, prompting the brokerage to remove it and initiate an internal review following the company’s objections.",
            "pubDate": "2025-12-09T13:24:48.800294"
        },
        {
            "title": "These 10 Nifty500 stocks are showing very high PE ratio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-nifty500-stocks-are-showing-very-high-pe-ratio/slideshow/125871408.cms",
            "description": "A P/E ratio above 250 indicates that a company’s stock price is increasing significantly faster than its earnings. This is calculated using the latest end-of-day price and trailing twelve months (TTM) earnings per share. From the Nifty500 pack, we have highlighted the top 10 stocks with the highest TTM P/E ratios, based on a valuation scan by Stockedge.com.While a high P/E suggests strong growth expectations from investors, it can also signal overvaluation or speculative buying. It's important to assess the company's fundamentals and market conditions for a more accurate evaluation.",
            "pubDate": "2025-12-09T13:50:57.151654"
        },
        {
            "title": "Two Trades for Today: A large-cap stock for a 6.35% gain; a mid-cap for an almost 6% rise – both from the pharma space",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-large-cap-stock-for-a-6-35-gain-a-mid-cap-for-an-almost-6-rise-both-from-the-pharma-space/articleshow/125871642.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-09T13:59:35.340571"
        },
        {
            "title": "US stocks subdued at open as Fed rate cut decision nears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-subdued-at-open-as-fed-rate-cut-decision-nears/articleshow/125872283.cms",
            "description": "Wall Street's main stock indexes were subdued at the open on Tuesday as investors awaited the Federal Reserve's policy decision, while Nvidia shares were whipsawed by contrasting news around exports of advanced AI chips to China.",
            "pubDate": "2025-12-09T14:58:37.908210"
        },
        {
            "title": "Market Trading Guide: Buy Policybazaar, AUSFB & 2 stocks on Wednesday for up to 11% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-policybazaar-ausfb-amp-2-stocks-on-wednesday-for-up-to-11-gains/slideshow/125872225.cms",
            "description": "Indian headline indices fell for the second day in a row dragged by IT and auto stocks. The Nifty slipped in the opening hour before finding support around the 61.80% Fibonacci retracement level of the previous rise. Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that the short-term sentiment might remain weak as the index is sustaining below the 21EMA. \"The RSI is in a bearish crossover, adding to the weak momentum. In the short term, the trend may remain weak with a possible decline towards 25,615/25,535. Resistance is placed at 25,970–26,000,\" De said.Here are 4 stock recommendations for Wednesday:",
            "pubDate": "2025-12-09T14:58:37.908323"
        },
        {
            "title": "Former news anchor Hemant Ghai pays Rs 1.45 cr to Sebi to settle regulatory violation case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/former-news-anchor-hemant-ghai-pays-rs-1-45-cr-to-sebi-to-settle-regulatory-violation-case/articleshow/125871669.cms",
            "description": "Former news anchor Hemant Ghai on Tuesday settled a case involving fraudulent trades based on advance information with markets regulator Sebi after paying Rs 1.45 crore.",
            "pubDate": "2025-12-09T14:58:37.908515"
        },
        {
            "title": "JSW Energy block deal: Rajiv Jain–backed GQG Partners sells stake worth Rs 677 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-energy-block-deal-rajiv-jainbacked-gqg-partners-sells-stake-worth-rs-677-crore/articleshow/125872938.cms",
            "description": "GQG Partners sold 1.52 crore JSW Energy shares worth Rs 677 crore at a slight discount, amid the stock’s sharp one-year underperformance. JSW Energy trades far below key averages, with oversold indicators and declining FII holdings following weak quarterly earnings.",
            "pubDate": "2025-12-09T15:42:49.804881"
        }
    ]
}