{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-02T06:14:10.525544",
    "items": [
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 32% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-32-in-1-year/articleshow/114872401.cms",
            "description": "From another China stimulus, to the US Fed’s actions, to the US elections. The coming days will be dominated by global news flows. Add to this mix the Q2 results season – with numbers mostly below the street's expectations. So the market might see movements it is not prepared for. Given this scenario, if you are seeking to increase exposure, look for stocks where the business operating matrix is showing improvement. They tend to weather any storm better. Our selected stocks this week depict a strong upward trajectory in their overall average score which is based on five key pillars – earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2024-11-02T06:13:51.415888"
        },
        {
            "title": "Coal India, REC among 41 stocks with record dates for dividend, bonus, split this week. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/coal-india-rec-among-41-stocks-with-record-dates-for-dividend-bonus-split-this-week-do-you-own-any/articleshow/114872469.cms",
            "description": "This week, several companies including Coal India, Hindustan Unilever (HUL), and REC Ltd are scheduled for record dates related to dividends, bonus issues, and stock splits. Shareholders must own stocks before the ex-date to be eligible. Notable dividends include Rs 24 by Colgate-Palmolive, Rs 15.75 by Coal India, and Rs 28 by Ajanta Pharma.",
            "pubDate": "2024-11-02T06:13:51.416005"
        },
        {
            "title": "NSE launches new mobile app, upgrades website to empower investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-launches-new-mobile-app-upgrades-website-to-empower-investors/articleshow/114872255.cms",
            "description": "On Diwali, the NSE introduces the NSEIndia mobile app and expands its website to support eleven regional languages, enhancing accessibility and inclusivity for Indian investors. The app provides market insights, personalized watchlists, and derivatives market data, aiming to empower investors with intuitive tools and real-time information.",
            "pubDate": "2024-11-02T06:13:51.416111"
        },
        {
            "title": "Planning to spot wealth creators in chemical space? PI Industries, Atul could give over 20% return each",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/planning-to-spot-wealth-creators-in-chemical-space-pi-industries-atul-could-give-over-20-return-each/articleshow/114870824.cms",
            "description": "India is positioning its chemical and petrochemical industry to become a global leader. The sector aims to increase its output to USD6 trillion. This growth will be driven by strategic partnerships, investments in sustainable practices, and innovation. Various states are key contributors, with policies and projects enhancing production and exports. The industry's expansion is crucial for India's economic goals.",
            "pubDate": "2024-11-02T06:13:51.416209"
        },
        {
            "title": "Primary markets can become as efficient as secondary markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/primary-markets-can-become-as-efficient-as-secondary-markets/articleshow/114870495.cms",
            "description": "SEBI's technology-driven efforts have accelerated IPO timelines significantly, reducing them from months to days. Reevaluating the mandatory 50% allocation to retail and HNI investors could further streamline IPO processes and improve market efficiency, suggesting alternatives like increased institutional involvement or mutual fund schemes for retail investors.",
            "pubDate": "2024-11-02T06:13:51.416320"
        },
        {
            "title": "How inflation and interest rates are shaping investment strategies in US",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-inflation-and-interest-rates-are-shaping-investment-strategies-in-us/articleshow/114870415.cms",
            "description": "The Federal Reserve's recent decision to lower interest rates significantly impacts Indian investors with US market exposure. Lower rates can present opportunities in US stocks, especially in dividend-paying equities. It is essential for investors to stay vigilant, bearing in mind currency fluctuations and inflation concerns while maintaining exposure to both US and Indian markets.",
            "pubDate": "2024-11-02T06:13:51.416412"
        },
        {
            "title": "FII sell-off and market correction: Temporary dip or new trend?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-sell-off-and-market-correction-temporary-dip-or-new-trend/articleshow/114870312.cms",
            "description": "Nifty index fell by over 2,000 points from its peak within a month, impacted mainly by foreign portfolio investors' net outflows. Meanwhile, domestic investors kept investing in the market. Historically, markets often regain a significant portion of these outflows quickly, suggesting potential recovery ahead.",
            "pubDate": "2024-11-02T06:13:51.416506"
        },
        {
            "title": "Wall Street Week Ahead: US election, Fed meeting loom in big week for markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-week-ahead-us-election-fed-meeting-loom-in-big-week-for-markets/articleshow/114869398.cms",
            "description": "Next week, the U.S. presidential election and the Federal Reserve's monetary policy meeting bring potential market volatility. Polls show a tight race between Donald Trump and Kamala Harris, while the Fed may cut rates by 25 basis points amid strong economic data and mixed corporate earnings.",
            "pubDate": "2024-11-02T06:13:51.416595"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/take-five-only-one-show-in-town-5-world-market-themes-for-the-week-ahead/articleshow/114869174.cms",
            "description": "U.S. voters head to the polls in a tight presidential race between Republican Donald Trump and Democrat Kamala Harris, with major implications for financial markets, global trade, and monetary policies. Central banks, including the Fed, Bank of England, and central banks in China and Brazil, prepare for potential impacts and policy adjustments.",
            "pubDate": "2024-11-02T06:13:51.416683"
        },
        {
            "title": "Nvidia to take Intel's spot on Dow Jones Industrial Average",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nvidia-to-take-intels-spot-on-dow-jones-industrial-average/articleshow/114869150.cms",
            "description": "Once the dominant force in chipmaking, Intel has in recent years ceded its manufacturing edge to rival TSMC and missed out on the generative artificial intelligence boom after missteps including passing on an investment in ChatGPT-owner OpenAI.",
            "pubDate": "2024-11-02T06:13:51.416771"
        },
        {
            "title": "Wall Street closes higher as Amazon's gains offset weak job growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-higher-as-amazons-gains-offset-weak-job-growth/articleshow/114868330.cms",
            "description": "Other so-called Magnificent Seven members Meta Platforms and Microsoft also reported earnings earlier this week and warned on AI-related infrastructure costs, dragging the Nasdaq down on Thursday.",
            "pubDate": "2024-11-02T06:13:51.416866"
        },
        {
            "title": "Auspicious start to Samvat 2081: Experts expect moderate returns of 5-10% in new year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auspicious-start-to-samvat-2081-experts-expect-moderate-returns-of-5-10-in-new-year/articleshow/114868188.cms",
            "description": "Nifty gained 24.47% in Samvat 2080—the second-best in a decade—yet most experts anticipate moderate returns of 5-10% in the new year.",
            "pubDate": "2024-11-02T06:13:51.416953"
        },
        {
            "title": "In dead-heat US polls, hedge funds hunt for trades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/in-dead-heat-us-polls-hedge-funds-hunt-for-trades/articleshow/114867769.cms",
            "description": "As the nearly deadlocked race nears, some are looking for so-called \"asymmetric trades\" involving bitcoin or the yuan, assets which could yield big profits if Trump wins but would not cause big losses if the wagers are wrong. \"Trading the election is difficult given how tight it is,\" said Edoardo Rulli, head of UBS Hedge Fund Solutions.",
            "pubDate": "2024-11-02T06:13:51.417043"
        },
        {
            "title": "A cracker of a start to Samvat 2081: Indices climb nearly half a percent in Muhurat Trading Session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-cracker-of-a-start-to-samvat-2081-indices-climb-nearly-half-a-percent-in-muhurat-trading-session/articleshow/114867471.cms",
            "description": "​The local trader community actively participates in the Muhurat trading session, engaging in token transactions with an intent to take home profits. Making money in this hour is considered auspicious, setting the tone for the year to come.",
            "pubDate": "2024-11-02T06:13:51.417134"
        },
        {
            "title": "Sebi proposes doubling threshold for 'High Value Debt Listed Entities' to Rs 1,000 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-doubling-threshold-for-high-value-debt-listed-entities-to-rs-1000-cr/articleshow/114854176.cms",
            "description": "Sebi proposes raising the threshold for High Value Debt Listed Entities from Rs 500 crore to Rs 1,000 crore to reduce compliance burdens. It includes governance obligations, filing reports in XBRL format, and harmonising reports with equity-listed entities. Public comments are open until November 15.",
            "pubDate": "2024-11-02T06:13:51.417222"
        },
        {
            "title": "Sebi mulls measures to facilitate ease of doing biz for ESG Rating Providers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-mulls-measures-to-facilitate-ease-of-doing-biz-for-esg-rating-providers/articleshow/114854109.cms",
            "description": "Markets regulator Sebi suggests changes to the framework for ESG Rating Providers, especially those using a subscriber-pays model. Sebi recommends exemption from disclosing ESG ratings to stock exchanges and sharing reports with subscribers and rated issuers simultaneously. The proposals aim to improve clarity and transparency in ESG ratings. Public comments on the proposals are invited until November 15.",
            "pubDate": "2024-11-02T06:13:51.417310"
        }
    ]
}