{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-24T06:52:08.869422",
    "items": [
        {
            "title": "Cipla Q1 results preview: Muted US sales to hit revenue YoY. 4 things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/cipla-q1-results-preview-muted-us-sales-to-hit-revenue-yoy-4-things-to-watch-out-for/articleshow/122874757.cms",
            "description": "Cipla's June quarter earnings are anticipated to reveal a mixed performance, with robust India sales partially offsetting challenges in the US generics market. Revenue is expected to increase, while EBITDA margins may decline due to lower US contributions. Investor attention will be directed towards the US business trajectory, pricing dynamics, and the resurgence of India's trade generics segment.",
            "pubDate": "2025-07-24T06:52:06.918967"
        },
        {
            "title": "Nestle Q1 Results: Consolidated PAT falls 13% YoY to Rs 647 crore, revenue rises 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/nestle-q1-results-consolidated-pat-falls-13-yoy-to-rs-646-crore-revenue-rises-6/articleshow/122873969.cms",
            "description": "Nestle Q1 Results: Nestle India's consolidated profit after tax decreased by 13.4% year-on-year, reaching Rs 647 crore. However, revenue from operations saw a 6% increase, totaling Rs 5,096 crore. Domestic sales grew by 5.5%, while export sales experienced a significant 16% rise. Total income for the quarter amounted to Rs 5,100 crore, a 5% increase.",
            "pubDate": "2025-07-24T06:52:06.919119"
        },
        {
            "title": "Can Infosys maintain its momentum after reporting strong June 2025 quarter growth?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-infosys-maintain-its-momentum-after-reporting-strong-june-2025-quarter-growth/articleshow/122868732.cms",
            "description": "Infosys showcased robust sequential revenue growth in the June 2025 quarter, driven by a lower base, improved pricing, and higher utilization, outperforming its peers. The company revised its FY26 constant currency revenue guidance upwards to 1-3% due to strong new deal wins.",
            "pubDate": "2025-07-24T06:52:06.919235"
        }
    ]
}