{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-06T17:20:19.084649",
    "items": [
        {
            "title": "Indian equities can recover on slightest indication of pause in FII outflows, says Motilal Oswal. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-equities-can-recover-on-slightest-indication-of-pause-in-fii-outflows-says-motilal-oswal-heres-why/articleshow/124337843.cms",
            "description": "A halt in foreign outflows could spark a rebound in Indian equities, Motilal Oswal said in its October 6 report. The brokerage expects improving corporate earnings, robust domestic inflows, and pro-growth government policies to attract overseas investors back. After a year of underperformance, India’s more attractive valuations may further drive a reversal in foreign investment trends.",
            "pubDate": "2025-10-06T10:55:55.961703"
        },
        {
            "title": "Market Wrap: Sensex rallies 580 points, Nifty tops 25,000 as banks surge on solid loan growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-rallies-580-points-nifty-tops-25000-as-banks-surge-on-solid-loan-growth/articleshow/124337192.cms",
            "description": "Indian equity benchmarks Sensex and Nifty closed higher on Monday, driven by banking and financial heavyweights after lenders posted strong quarterly loan growth, while IT stocks gained ground ahead of the upcoming earnings releases.",
            "pubDate": "2025-10-06T10:55:55.961828"
        },
        {
            "title": "These 8 FII-backed debt-free smallcaps rally up to 70% in FY26. Are you missing out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-8-fii-backed-debt-free-smallcaps-rally-up-to-70-in-fy26-are-you-missing-out/slideshow/124335957.cms",
            "description": "In smallcap investing, a clean, debt-free balance sheet often stands out, providing financial flexibility, lower risk, and stronger investor confidence. Filtering BSE smallcaps (excluding banking/finance) with net profits above Rs 100 crore in FY25, we identified 96 debt-free companies. Focusing further on firms where Foreign Institutional Investors (FIIs) increased their stake in Q1 FY26 narrows the list to 54 promising stocks. In FY26 so far, 34 of these stocks have delivered double-digit gains, with 8 standout performers surging 40–70% in just six months. While the combination of zero debt and FII backing is attractive, investors must carefully evaluate fundamentals, growth prospects, and market dynamics before investing.",
            "pubDate": "2025-10-06T10:55:55.961938"
        },
        {
            "title": "Ramesh Damani, Aashish Somaiyaa invest in Zerodha's competitor Dhan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ramesh-damani-aashish-somaiyaa-invest-in-zerodhas-competitor-dhan/articleshow/124336731.cms",
            "description": "Stock-trading startup Dhan raised $120 million at a $1.2 billion valuation, attracting marquee investors including Ramesh Damani and Aashish Somaiyaa. Led by Hornbill Capital, the funding will support expansion, diversification, and AI innovation. Despite regulatory headwinds, Dhan has boosted active trader share and quadrupled volumes since FY23.",
            "pubDate": "2025-10-06T10:55:55.962042"
        },
        {
            "title": "Indian Bank, Canara Bank jump 40% in FY26. Are PSU bank stocks set for a golden comeback?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-bank-canara-bank-jump-40-in-fy26-are-psu-bank-stocks-set-for-a-golden-comeback/articleshow/124336126.cms",
            "description": "Public sector banks have staged a major comeback in FY26, with the Nifty PSU Bank Index soaring 20% in six months. Indian Bank and Canara Bank lead gains, each up nearly 41%. Analysts see PSU lenders outperforming private peers as profits, RoA, and credit growth improve.",
            "pubDate": "2025-10-06T10:55:55.962144"
        },
        {
            "title": "KIOCL shares soar 19%, extend three-session rally to 48%; exchanges seek clarification on unusual volume spike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kiocl-shares-soar-19-extend-three-session-rally-to-48-exchanges-seek-clarification-on-unusual-volume-spike/articleshow/124336051.cms",
            "description": "KIOCL shares soared 19% to a 52-week high of Rs 629.30 amid heavy volumes, prompting exchanges to seek clarification. The PSU stock has jumped nearly 48% in three sessions, delivering over 230% returns in three years despite weak Q1 results and volatility concerns.",
            "pubDate": "2025-10-06T10:55:55.962268"
        },
        {
            "title": "BSE shares rally 5% as IIFL assigns Rs 2,300 target on softer than feared expiry swap impact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-rally-5-as-iifl-assigns-rs-2300-target-on-softer-than-feared-expiry-swap-impact/articleshow/124335244.cms",
            "description": "Shares of BSE Ltd rose sharply on Monday after IIFL noted that the expiry day swap impact was softer than expected. Strong derivatives activity and resilient market share support the rally, with IIFL maintaining an “Add” rating and a target of Rs 2,300.",
            "pubDate": "2025-10-06T10:55:55.962372"
        },
        {
            "title": "Q2 preview: Coforge set to lead IT earnings as mid-tier firms outshine largecaps; 8 stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-preview-coforge-set-to-lead-it-earnings-as-mid-tier-firms-outshine-largecaps-8-stocks-to-buy/articleshow/124334348.cms",
            "description": "Mid-tier IT firms like Coforge, Persistent, Mphasis, and Hexaware are expected to drive Q2FY26 revenue growth, outperforming largecaps amid macro headwinds and pricing pressures. The challenges faced by the industry have reflected in the share prices which have fallen up to 19% in three months. But Motilal Oswal and Nuvama highlight opportunities in mid-tier and select largecap IT stocks for medium-to-long-term gains.",
            "pubDate": "2025-10-06T10:55:55.962467"
        },
        {
            "title": "Netweb Technologies shares soar 19% in a week. 5 factors driving the rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-shares-soar-19-in-a-week-5-factors-driving-the-rally/articleshow/124333782.cms",
            "description": "Netweb Technologies shares surged 19%, hitting a 52-week high on robust AI infrastructure order wins, cloud adoption tailwinds, expansion initiatives, strong technical momentum, and rising profitability, attracting investor attention in tech.",
            "pubDate": "2025-10-06T10:55:55.962570"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and return potential of more than 23% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-return-potential-of-more-than-23-in-1-year/articleshow/124333198.cms",
            "description": "We are going with the assumption that recent reforms, both GST and banking, make a fresh case for being bullish on India. But with valuations still high, the probability of volatility hitting the street is high. Also, the global situation could get bearish. Though no one is talking about it now, the increasing cost of goods in the US may well become the talk of the street soon. If that happens, one cannot rule out more damage to stock prices. In such times, if you are investing in the market, ensure you target quality stocks where the business and fundamentals are sound.",
            "pubDate": "2025-10-06T10:55:55.962667"
        },
        {
            "title": "TruAlt Bioenergy shares slip 7% in 2 trading sessions after market debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trualt-bioenergy-shares-slip-7-in-2-trading-sessions-after-market-debut/articleshow/124332549.cms",
            "description": "TruAlt Bioenergy shares slipped 6.7% in two sessions after listing, as early investors booked profits. Despite strong FY25 growth—54% revenue rise, fivefold net profit surge—valuations remain steep at 29x earnings. Analysts suggest partial profit booking amid robust renewable energy demand.",
            "pubDate": "2025-10-06T10:55:55.962765"
        },
        {
            "title": "Top stock ideas this week: Tata Motors, Vodafone among 7 picks offering up to 41% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-stock-ideas-this-week-tata-motors-vodafone-among-7-picks-offering-up-to-41-gains/slideshow/124331957.cms",
            "description": "Nifty closed the previous week with a 1% gain, supported by rallies over the last two sessions. Asit C. Mehta investment expert Hrishikesh Yedve notes the formation of a bullish candle near the 100-DEMA of 24,747, signalling strength. He cautions about resistance around 24,915, as the index remains below the 21-DEMA. With stock-specific action likely to dominate, ETMarkets has compiled seven technical and fundamental picks for potential upside of up to 41%.",
            "pubDate": "2025-10-06T10:55:55.962860"
        },
        {
            "title": "Kotak Mahindra Bank shares jump 2% after Q2 updates impress investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-mahindra-bank-shares-jump-2-after-q2-updates-impress-investors/articleshow/124331739.cms",
            "description": "Kotak Mahindra Bank shares: The stock rose after strong provisional Q2 FY26 results. The bank reported a 14.4% YoY rise in average total deposits to Rs 5,10,138 crore and a sequential increase of 3.7% from the June quarter. Total deposits at quarter-end stood at Rs 5,28,776 crore, up 14.6% YoY, reflecting robust operational strength and continued customer trust.",
            "pubDate": "2025-10-06T10:55:55.962956"
        },
        {
            "title": "Yes Bank shares up 4% in 1 week as Q2 metrics impress. What’s next?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-up-4-in-1-week-as-q2-metrics-impress-whats-next/articleshow/124331680.cms",
            "description": "Shares of Yes Bank rose over the past week, supported by strong quarterly loan growth, improved CASA ratios, and investor interest after a strategic stake sale to Sumitomo Mitsui Banking Corporation. Provisional Q2 updates show robust growth in advances and deposits, while technical indicators point to a sustained bullish trend.",
            "pubDate": "2025-10-06T10:55:55.963051"
        },
        {
            "title": "Q2 earnings beginning this week to be modest but 3 themes can make money: Motilal Oswal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-earnings-beginning-this-week-to-be-modest-but-3-themes-can-make-money-motilal-oswal/articleshow/124331652.cms",
            "description": "Q2 earnings, starting October 9, are expected to show modest 6% YoY growth for Nifty companies. Motilal Oswal highlights three investment themes—financials vs IT divergence, consumption revival, and new-age sectors—and recommends top large- and mid-cap stocks in autos, healthcare, BFSI, and technology for potential gains.",
            "pubDate": "2025-10-06T10:55:55.963152"
        },
        {
            "title": "Kalyan Jewellers shares drop despite strong festive demand, driving 30% revenue growth in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-jewellers-shares-drop-despite-strong-festive-demand-driving-30-revenue-growth-in-q2/articleshow/124331612.cms",
            "description": "Kalyan Jewellers shares: The stock dropped despite a strong Q2 FY26 performance. The company’s consolidated revenue rose about 30% YoY, driven by festive buying and strong market traction. India operations grew 31% YoY, supported by robust wedding demand and early festive sales, including Navratri. Same-store sales increased roughly 16%, reflecting steady underlying demand.",
            "pubDate": "2025-10-06T10:55:55.963267"
        },
        {
            "title": "68% of Indian retail investors now invest in passive funds: Motilal Oswal Mutual Fund survey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/68-of-indian-retail-investors-now-invest-in-passive-funds-motilal-oswal-mutual-fund-survey/articleshow/124339347.cms",
            "description": "Passive funds are increasingly popular among Indian retail investors, with 68% investing in index funds or ETFs. AUM has grown sixfold in six years to ₹12.2 lakh crore, driven by low costs, diversification, and rising awareness.",
            "pubDate": "2025-10-06T11:57:23.845732"
        },
        {
            "title": "Stock Radar: Aditya Birla Capital stock hits fresh record high in October 2025; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-aditya-birla-capital-stock-hits-fresh-record-high-in-october-2025-time-to-buy-or-book-profits/articleshow/124339043.cms",
            "description": "Aditya Birla Capital shares hit a record ₹304 in October 2025, maintaining strong bullish momentum. Analysts expect the rally to continue, targeting ₹325 in the coming weeks amid robust technical indicators and sustained uptrend signals.",
            "pubDate": "2025-10-06T11:57:23.845852"
        },
        {
            "title": "Fortis Healthcare, Nykaa and 7 other midcap stocks hit 52-week high; rally up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fortis-healthcare-nykaa-and-7-other-midcap-stocks-hit-52-week-high-rally-up-to-20-in-a-month/slideshow/124338216.cms",
            "description": "On Monday, the benchmark Sensex jumped 583 points to close at 81,790. Riding the wave of a broader market rally, nine stocks from the BSE Midcap index hit their 52-week highs — reaching their highest levels in a year. Such breakouts are often seen by traders and investors as bullish signals, reflecting strong upward momentum and the potential for continued gains.",
            "pubDate": "2025-10-06T11:57:23.845984"
        },
        {
            "title": "NBFC sector: Time to look at select survivors of multi-year clean-up. 7 stocks that fit the bill, with an upside potential of up to 29%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfc-sector-time-to-look-at-select-survivors-of-multi-year-clean-up-7-stocks-that-fit-the-bill-with-an-upside-potential-of-up-to-29/articleshow/124338790.cms",
            "description": "Last week it was the auto companies which came up with business updates for Q2. They were extremely positive. This week has started with lenders, both banks and NBFCs. Again, they are positive. Has the market sensed something? For the past few sessions, it is the financial sector stocks that have been shoring up the Nifty and Sensex. Perhaps it is time to take a closer look at these, especially NBFCs. Why now? After being under a RBI tight policy rejig which reduced business, they were getting by just because of policy arbitrage. Are they in a healthier and happier space today?",
            "pubDate": "2025-10-06T11:57:23.846085"
        },
        {
            "title": "Over 1 lakh unlawful contents removed from social media in 18 months: Sebi chief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/over-1-lakh-unlawful-contents-removed-from-social-media-in-18-months-sebi-chief/articleshow/124342601.cms",
            "description": "Over 1 lakh unlawful contents were removed from social media platforms in the last 18 months, Sebi Chairman Tuhin Kanta Pandey said on Monday highlighting the need to save gullible investors from fraudsters.",
            "pubDate": "2025-10-06T14:33:39.911615"
        },
        {
            "title": "AMD signs AI chip-supply deal with OpenAI, shares surge 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amd-signs-ai-chip-supply-deal-with-openai-shares-surge-34/articleshow/124342165.cms",
            "description": "AMD said on Monday it will supply artificial intelligence chips to OpenAI in a multi-year deal that would bring in tens of billions of dollars in annual revenue and give the ChatGPT creator the option to buy up to roughly 10% of the chipmaker.",
            "pubDate": "2025-10-06T14:33:39.911747"
        },
        {
            "title": "Gainers & Losers: KIOCL, BSE and TCS among 9 stocks that moved most on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-kiocl-bse-and-tcs-among-9-stocks-that-moved-most-on-monday/slideshow/124341069.cms",
            "description": "",
            "pubDate": "2025-10-06T14:33:39.911854"
        },
        {
            "title": "Sebi fines two former Brightcom Group directors Rs 35 lakh for accounting irregularities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-fines-two-former-brightcom-group-directors-rs-35-lakh-for-accounting-irregularities/articleshow/124341823.cms",
            "description": "Sebi imposed fines of Rs 30 lakh and Rs 5 lakh on former Brightcom Group independent directors for financial statement irregularities between FY15-FY20, which inflated profits by Rs 1,280 crore and misled investors during share sales.",
            "pubDate": "2025-10-06T14:33:39.911957"
        },
        {
            "title": "US stocks trade higher on AI boost as OpenAI, AMD unveil new deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-on-ai-boost-as-openai-amd-unveil-new-deal/articleshow/124341757.cms",
            "description": "Wall Street's main indexes opened higher on Monday, building on last week's gains, as AMD's chip-supply tie-up with OpenAI became the latest in a series of AI deals and offset concerns around a prolonged federal government shutdown.",
            "pubDate": "2025-10-06T14:33:39.912056"
        },
        {
            "title": "Trent Q2 Update: Lifestyle retailer’s revenue rises 17% YoY to Rs 5,002 crore but stock slips 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-q2-update-lifestyle-retailers-revenue-rises-17-yoy-to-rs-5002-crore-but-stock-slips-2/articleshow/124341287.cms",
            "description": "Trent’s standalone June quarter revenue grew 17% YoY to Rs 5,002 crore, supported by 53 new store openings. Profit rose 9% YoY, but shares fell 2.3% amid slowing growth.",
            "pubDate": "2025-10-06T14:33:39.912156"
        },
        {
            "title": "Jubilant FoodWorks' Q2 revenue up 20% to Rs 2,340 cr, adds 93 stores",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jubilant-foodworks-q2-revenue-up-20-to-rs-2340-cr-adds-93-stores/articleshow/124340822.cms",
            "description": "Jubilant FoodWorks Ltd (JFL), which operates fast-food chains Domino's Pizza and Dunkin' Donuts, on Monday said its consolidated revenue from operations increased 19.7 per cent to Rs 2,340.4 crore in September quarter FY26.",
            "pubDate": "2025-10-06T14:33:39.912256"
        },
        {
            "title": "Fino Payments Bank settles disclosure lapses case with Sebi; pays Rs 5.88 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fino-payments-bank-settles-disclosure-lapses-case-with-sebi-pays-rs-5-88-lakh/articleshow/124340614.cms",
            "description": "Fino Payments Bank on Monday settled a case pertaining to failure to make timely and complete disclosure regarding frauds perpetrated by its employees with markets regulator Sebi after paying Rs 5.88 lakh.",
            "pubDate": "2025-10-06T14:33:39.912360"
        },
        {
            "title": "How to understand Debt to Equity Ratio: A must-know guide for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-understand-debt-to-equity-ratio-a-must-know-guide-for-investors/slideshow/124340341.cms",
            "description": "",
            "pubDate": "2025-10-06T14:33:39.912481"
        },
        {
            "title": "7 largecap stocks with EBITDA margins over 50%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-largecap-stocks-with-ebitda-margins-over-50-do-you-own-any/slideshow/124340030.cms",
            "description": "A higher EBITDA margin indicates a company’s strong operational efficiency, achieved by either keeping operating costs low or increasing revenue. This metric is important as it reflects the core profitability of a business before financial and non‑cash expenses. According to StocksEdge’s profitable scan data, we highlight seven large‑cap stocks (excluding banks and financial companies) that posted an impressive EBITDA margin of over 50% for FY25. Furthermore, these companies have sustained even higher EBITDA margins in the most recent financial year, demonstrating their strong financial health and effective management.",
            "pubDate": "2025-10-06T14:33:39.912585"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/124343593.cms",
            "description": "Indian markets rose for the third session, led by strong gains in banking, financials, and IT ahead of Q2 earnings. Nifty reclaimed the 25,000 mark, supported by upbeat loan growth data and improving technical momentum suggesting a potential rally toward 25,500.",
            "pubDate": "2025-10-06T15:41:28.172620"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/124342929.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-10-06T15:41:28.172733"
        },
        {
            "title": "Market Trading Guide: Buy Nykaa, one smallcap multibagger on Tuesday for up to 12% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-nykaa-one-smallcap-multibagger-on-tuesday-for-up-to-12-gains/slideshow/124343035.cms",
            "description": "India’s benchmark indices Nifty and the BSE Sensex extended their winning streak for a third straight session on Monday, closing higher as investors piled into IT, banking, and healthcare stocks. The strong momentum helped the Nifty comfortably reclaim the 25,000 mark. It is now trading comfortably above both its key short-term and long-term moving averages. Commenting Nilesh Jain, Head – Technical and Derivatives Research Analyst at Centrum Broking said that the support base has shifted higher, with major support now established around the 24,800 level. \"The Nifty has completed a 50% retracement of the recent decline from 25,448 to 24,588, with the retracement level placed at 25,020. Momentum indicators and oscillators have begun to strengthen, suggesting a continuation of the upward move. If the index sustains above the 25,020 mark, a further rally towards 25,500 in the October series appears likely,\" he said.Here are 2 stock recommendations for Tuesday:",
            "pubDate": "2025-10-06T15:41:28.172836"
        },
        {
            "title": "As Nifty & Sensex recover, these large-caps have ‘strong buy’, ‘buy’ recos, with an upside potential of more than 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-nifty-sensex-recover-these-large-caps-have-strong-buy-buy-recos-with-an-upside-potential-of-more-than-26/articleshow/124344980.cms",
            "description": "We are in a market where, as an investor, either be very agile or be extremely passive. And if you are passive, stick to ETFs. But being agile comes with its own risks (and rewards, of course). As the market continues to move upward, we are probably going to see a phase where the momentum itself becomes fuel for fresh money to flow in. Today, we take a look at stocks that are not only large-cap stocks but are large businesses and strong brands – or have something else that makes them stand out. The focus is also on managing the relationship between upside potential and drawdowns.",
            "pubDate": "2025-10-06T17:20:15.371049"
        },
        {
            "title": "Two Trades for Today: A two-wheeler major for a 4.65% upmove, a  mid-cap digital financial service stock for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-two-wheeler-major-for-a-4-65-upmove-a-mid-cap-digital-financial-service-stock-for-almost-7-rise/articleshow/124344225.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-06T17:20:15.371177"
        },
        {
            "title": "Sebi chairman warns retail investors against speculative trading in derivatives",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-chairman-warns-retail-investors-against-speculative-trading-in-derivatives/articleshow/124344135.cms",
            "description": "SEBI Chairman Tuhin Kanta Pandey advises retail investors to avoid speculative derivative trading, emphasizing risks and urging informed, long-term investment strategies to prevent losses and promote responsible participation in India’s securities market.",
            "pubDate": "2025-10-06T17:20:15.371423"
        },
        {
            "title": "SBI Life Insurance, Aditya Birla MF, others buy 6% stake in AB Lifestyle Brands for Rs 998 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-life-insurance-aditya-birla-mf-others-buy-6-stake-in-ab-lifestyle-brands-for-rs-998-cr/articleshow/124343790.cms",
            "description": "SBI Life Insurance, Aditya Birla MF, Morgan Stanley, Goldman Sachs, and other entities have cumulatively acquired over 7.31 crore shares, representing a 6 per cent stake, in Aditya Birla Lifestyle Brands from Flipkart Investments for Rs 998 crore through open market transactions on Monday.",
            "pubDate": "2025-10-06T17:20:15.371529"
        },
        {
            "title": "Only 36% investors have adequate stock market knowledge, says Sebi Chairman, shares 4 tips to avoid scams",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/only-36-investors-have-adequate-stock-market-knowledge-says-sebi-chairman-shares-4-tips-to-avoid-scams/articleshow/124343763.cms",
            "description": "SEBI Chairman Tuhin Kanta Pandey warns that only 36% of investors have adequate market knowledge, leaving many vulnerable to scams. He shares four tips to protect against fraud amid growing retail participation.",
            "pubDate": "2025-10-06T17:20:15.371634"
        }
    ]
}