{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-19T07:51:47.376806",
    "items": [
        {
            "title": "JSW Steel Q1 profit more than doubles to Rs 2,209 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q1-profit-more-than-doubles-to-rs-2209-crore/articleshow/122776704.cms",
            "description": "JSW Steel witnessed a significant surge in net profit during the June quarter. The profit more than doubled, reaching '2,209 crore. This boost was fueled by increased sales volume in India and reduced costs. Steel sales volume rose by 9% to 6.69 million tonnes. Revenue remained largely stable at '43,147 crore.",
            "pubDate": "2025-07-19T05:29:56.931159"
        },
        {
            "title": "Yes Bank to announce Q1 results today. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-to-announce-q1-results-today-heres-what-to-expect/articleshow/122776604.cms",
            "description": "Yes Bank is expected to post a mixed Q1FY26 performance, with PAT forecast to rise 7–49% YoY and NII showing flat to slight growth. Brokerages differ on outlook, citing margin pressure and weak sequential trends in key metrics.",
            "pubDate": "2025-07-19T05:29:56.931300"
        },
        {
            "title": "Reliance Industries’ Q1 consolidated profit at record Rs 26,994 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q1-consolidated-profit-at-record-rs-26994-crore/articleshow/122776540.cms",
            "description": "Reliance Industries reported a significant 78% surge in its June quarter earnings, reaching a record ₹26,994 crore, fueled by robust growth in consumer businesses and a one-time gain from an Asian Paints stake sale. Jio Platforms saw a 25% profit increase, while Reliance Retail expanded its store network and digital presence.",
            "pubDate": "2025-07-19T05:29:56.931416"
        },
        {
            "title": "Yes Bank Q1 Results: PAT jumps 59% YoY to Rs 801 crore, NII up 5.7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-q1-results-pat-jumps-59-yoy-to-rs-801-crore-interest-income-falls-1-6/articleshow/122778951.cms",
            "description": "Yes Bank Q1 Results: Yes Bank on Saturday reported a 59% year-on-year (YoY) growth in its Q1FY26 standalone net profit at Rs 801 crore versus Rs 502 crore in the year-ago period.",
            "pubDate": "2025-07-19T07:51:46.647543"
        }
    ]
}