{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-17T03:10:10.856858",
    "items": [
        {
            "title": "Bumper IT buyback helps India ETF pull off rare index beat",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bumper-it-buyback-helps-india-etf-pull-off-rare-index-beat/articleshow/126029614.cms",
            "description": "Aditya Birla Sun Life Nifty 50 ETF has outperformed its benchmark by nearly 12% this financial year, a feat achieved by strategically tendering shares into a buyback at a premium. This \"passive-plus\" approach, also benefiting its Nifty IT ETF, aims to offset fees and generate incremental alpha for investors.",
            "pubDate": "2025-12-17T03:09:56.362828"
        },
        {
            "title": "Mukul Agrawal, Ramesh Damani-backed Protean eGov Technologies shares in focus on 4.95% stake acquisition in NSDL Payments Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-ramesh-damani-backed-protean-egov-technologies-shares-in-focus-on-4-95-stake-acquisition-in-nsdl-payments-bank/articleshow/126029424.cms",
            "description": "Protean eGov Technologies is set to gain investor attention after announcing its acquisition of a 4.95% stake in NSDL Payments Bank. This strategic move aims to bolster Protean's digital financial infrastructure, fostering partnerships and developing scalable solutions for underserved segments. The collaboration leverages NSDL Payments Bank's digital-first platform to expand Protean's reach in citizen-centric financial services.",
            "pubDate": "2025-12-17T03:09:56.362962"
        },
        {
            "title": "Stocks to buy for 2026: JSW Infrastructure, Polycab India among 5 stocks that could give 18-40% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-jsw-infrastructure-polycab-india-among-5-stocks-that-could-give-18-40-return-in-1-year/slideshow/126029345.cms",
            "description": "Brokerage recommendations remain focused on companies with strong sectoral tailwinds, healthy balance sheets, and visible earnings growth, even as markets remain selective.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-12-17T03:09:56.363072"
        },
        {
            "title": "Vedanta shares in focus as NCLT approves demerger into independent listed companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-as-nclt-approves-demerger-into-independent-listed-companies/articleshow/126029388.cms",
            "description": "Vedanta's demerger plan has received formal approval from the NCLT. This will create five separate listed companies. Vedanta Aluminium, Vedanta Oil & Gas, Vedanta Power, and Vedanta Iron & Steel will become independent. The residual Vedanta Limited will house Hindustan Zinc. This move aims for sharper focus and independent capital access for each business.",
            "pubDate": "2025-12-17T03:09:56.363198"
        },
        {
            "title": "Shipwaves Online IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shipwaves-online-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/126029223.cms",
            "description": "Shipwaves Online is set to list on the BSE SME platform today with no grey market premium, indicating muted investor expectations for immediate listing gains. The company's Rs 56.35 crore IPO, which closed on December 12, offered shares at Rs 12 apiece.",
            "pubDate": "2025-12-17T03:09:56.363301"
        },
        {
            "title": "Unisem Agritech shares to list on BSE SME today. Check GMP and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/unisem-agritech-shares-to-list-on-bse-sme-today-check-gmp-and-other-details/articleshow/126029111.cms",
            "description": "Unisem Agritech is set to list on the BSE SME platform on December 17, with grey market indicators suggesting a flat debut. The seed manufacturer's IPO, which saw moderate demand, aims to raise Rs 21.45 crore primarily for working capital. The company's post-listing performance will depend on its execution and ability to sustain growth in the competitive agri sector.",
            "pubDate": "2025-12-17T03:09:56.363400"
        },
        {
            "title": "Negative Breakout: These 13 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-13-stocks-cross-below-their-200-dmas/slideshow/126029032.cms",
            "description": "In the Nifty500 pack, 13 stocks' closing prices crossed below their 200 DMA (Daily Moving Averages) on December 16, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-12-17T03:09:56.363495"
        },
        {
            "title": "Wall Street ends mixed, healthcare and energy stocks weigh on S&P",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-ends-mixed-healthcare-and-energy-stocks-weigh-on-sp/articleshow/126028828.cms",
            "description": "The Nasdaq closed higher Tuesday, while the S&P 500 and Dow declined as investors assessed economic data for the Federal Reserve's policy outlook. Nonfarm payrolls saw a modest increase, but the unemployment rate rose. Investors are now pricing in significant interest rate cuts for next year.",
            "pubDate": "2025-12-17T03:09:56.363592"
        },
        {
            "title": "Asian stocks slip after US jobs data, oil rises",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-slip-after-us-jobs-data-oil-rises/articleshow/126028619.cms",
            "description": "Asian shares dipped, mirroring Wall Street's decline as weak US jobs data failed to bolster expectations for Federal Reserve interest-rate cuts. Oil prices surged after President Trump announced a \"total and complete blockade\" of Venezuelan oil tankers, escalating tensions.",
            "pubDate": "2025-12-17T03:09:56.363689"
        },
        {
            "title": "Stocks in news: Ola Electric, Vedanta, Coal India, IOB, Lodha Developers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ola-electric-vedanta-coal-india-iob-lodha-developers/articleshow/126010813.cms",
            "description": "Markets ended lower on the weekly expiry day, mirroring weak global and domestic cues, with analysts suggesting a consolidation view for the Nifty. Continued currency deterioration could widen the trading range, potentially dragging the index below 25,700. A stock-specific approach with hedged positions is recommended due to prevailing volatility.",
            "pubDate": "2025-12-17T03:09:56.363786"
        },
        {
            "title": "GIFT Nifty up 10 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126010977.cms",
            "description": "Indian equities declined as caution prevailed due to persistent FII selling and a weakening rupee hitting new lows. Analysts anticipate sideways trading in the near term, lacking significant triggers. The rupee fell to an all-time low of 91.01 against the dollar, attributed to a widening trade deficit.",
            "pubDate": "2025-12-17T03:09:56.363884"
        },
        {
            "title": "Sebi alleges insider trading in Adani Group's open offer for NDTV",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-alleges-insider-trading-in-adani-groups-open-offer-for-ndtv/articleshow/126028477.cms",
            "description": "Sebi has alleged Pranav Adani shared price-sensitive information about Adani Group's NDTV open offer with his brothers-in-law, violating insider trading norms. The regulator served show cause notices, citing communication frequency during the UPSI period. This comes after Sebi recently dropped a similar case against Pranav Adani and his relatives due to lack of evidence.",
            "pubDate": "2025-12-17T03:09:56.363980"
        },
        {
            "title": "NSE turnover slides to two-year low as investors weigh uncertain returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-turnover-slides-to-two-year-low-as-investors-weigh-uncertain-returns/articleshow/126028314.cms",
            "description": "Investor interest in Indian equities has hit a nearly two-year low, with average daily turnover declining significantly. This subdued activity stems from uncertainty and underperformance in mid- and small-cap stocks, impacting retail investors, HNIs, and brokerages alike.",
            "pubDate": "2025-12-17T03:09:56.364074"
        },
        {
            "title": "India set for real GDP growth of 7.5% as inflation stays cool: Axis Bank chief economist Neelkanth Mishra",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-set-for-real-gdp-growth-of-7-5-as-inflation-stays-cool-axis-bank-chief-economist-neelkanth-mishra/articleshow/126028498.cms",
            "description": "Axis Bank chief economist Neelkanth Mishra projects India's real GDP to grow 7.5% in the next fiscal, driven by reforms and supportive policies. Headline inflation is expected to remain within the RBI's comfort zone around 4%, with the central bank likely maintaining a softer monetary stance.",
            "pubDate": "2025-12-17T03:09:56.364289"
        },
        {
            "title": "SBI rejigs MD portfolios after Ranjan's elevation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-rejigs-md-portfolios-after-ranjans-elevation/articleshow/126028507.cms",
            "description": "State Bank of India's chairman CS Setty has reshuffled top management portfolios following the arrival of new MD Ravi Ranjan. Ranjan will now oversee risk, compliance, and stressed assets, while Rana Ashutosh Kumar Singh takes charge of international banking, global markets, and technology. The changes aim to streamline operations and leverage expertise across key banking functions.",
            "pubDate": "2025-12-17T03:09:56.364385"
        }
    ]
}