{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-03T03:54:20.570350",
    "items": [
        {
            "title": "How will Sebi's new intraday limits impact equity index derivatives?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-sebis-new-intraday-limits-impact-equity-index-derivatives/articleshow/123667026.cms",
            "description": "Sebi is tightening intraday position limits in equity index derivatives starting October 1, aiming to curb volatility and potential market manipulation, especially on expiry days. The new framework sets a ₹5,000 crore intraday net futures-equivalent position limit in index options, down from the existing ₹1,500 crore end-of-day cap.",
            "pubDate": "2025-09-03T00:55:26.613648"
        },
        {
            "title": "Jane Street's $10.1-biilion trading haul sets Wall Street record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-streets-10-1-biilion-trading-haul-sets-wall-street-record/articleshow/123666969.cms",
            "description": "Jane Street Group achieved a record-breaking $10.1 billion in net trading revenue during the second quarter, surpassing major Wall Street banks. This surge, more than double the previous year's figure, propelled their first-half trading revenue to an unprecedented $17.3 billion. The firm benefited significantly from the market volatility spurred by President Trump's tariffs and subsequent investor repositioning.",
            "pubDate": "2025-09-03T00:55:26.613813"
        },
        {
            "title": "Sugar stocks soar up to 20% as govt lifts ethanol curbs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sugar-stocks-soar-up-to-20-as-govt-lifts-ethanol-curbs/articleshow/123666936.cms",
            "description": "Sugar stocks witnessed a surge following the central government's decision to remove restrictions on ethanol production from sugarcane. This move has boosted investor confidence in sugar companies. Analysts anticipate improved profitability and a potential rise in ethanol prices. The Supreme Court's stance on ethanol-blended petrol further supports the demand for ethanol. Rajshree Sugars and Shree Renuka Sugars experienced significant gains.",
            "pubDate": "2025-09-03T00:55:26.614030"
        },
        {
            "title": "Stock Radar: Short-term traders look to buy Hindalco stock on dips; 20-DEMA acts as a support",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-short-term-traders-look-to-buy-hindalco-stock-on-dips-20-dema-acts-as-a-support/articleshow/123653756.cms",
            "description": "Hindalco Industries, after breaking a key resistance in August 2025, is showing bullish signs. Despite a previous dip from an October 2024 high, the stock has been trending upwards since April 2025. Experts suggest short-term traders consider buying on dips, targeting Rs 750 in the coming weeks.",
            "pubDate": "2025-09-03T00:55:26.614135"
        },
        {
            "title": "Yes Bank shares in focus following CCI’s approval for SMBC stake acquisition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-following-ccis-approval-for-smbc-stake-acquisition/articleshow/123668532.cms",
            "description": "Yes Bank’s shares are in focus following the Competition Commission of India’s approval of Sumitomo Mitsui Banking Corporation’s (SMBC) stake acquisition via secondary purchase from SBI and seven other banks. This regulatory nod is a key step, though completion depends on customary closing conditions. Yes Bank shares closed flat at Rs 19.56 on Tuesday.",
            "pubDate": "2025-09-03T03:54:06.166682"
        },
        {
            "title": "Dividend stocks: 60 stocks including ONGC, OIL go ex-dividend tomorrow – last chance to buy!",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-stocks-60-stocks-including-ongc-oil-go-ex-dividend-tomorrow-last-chance-to-buy/articleshow/123668510.cms",
            "description": "Investors aiming for dividend payouts from PSUs should note today's deadline. Buying shares of Oil India Limited, NTPC, and ONGC today ensures eligibility for final dividends. These stocks will trade ex-dividend tomorrow, September 4, 2025. Several other companies, including A-1 Limited and AIA Engineering Limited, have also declared dividends with the same record date.",
            "pubDate": "2025-09-03T03:54:06.166861"
        },
        {
            "title": "NTPC among 5 Nifty stocks showing RSI Trending Up on September 2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ntpc-among-5-nifty-stocks-showing-rsi-trending-up-on-september-2/slideshow/123668434.cms",
            "description": "On September 2, five stocks in the Nifty50 pack appeared in the RSI Trending Up scan, based on data from StockEdge.com. An upward trend is signaled when the RSI (Relative Strength Index) crosses above 50 from below. \"RSI trending up\" indicates that RSI values are rising, suggesting strengthening momentum in a stock's price. This is often interpreted as a potential sign of upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-03T03:54:06.166981"
        },
        {
            "title": "Eternal shares in focus as Zomato hikes platform fee to Rs 12 amid festive demand surge",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-in-focus-as-zomato-hikes-platform-fee-to-rs-12-amid-festive-demand-surge/articleshow/123668469.cms",
            "description": "Zomato's parent company, Eternal, is in focus as the food delivery platform has increased its platform fee to ₹12 before the festive season, following a similar move by Swiggy. Both companies are investing heavily in quick commerce. Zomato reported a profit decline but revenue growth, while Swiggy's losses doubled due to Instamart investments.",
            "pubDate": "2025-09-03T03:54:06.167089"
        },
        {
            "title": "Reliance Power, Aster DM among 6 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-aster-dm-among-6-stocks-closed-crossing-above-vwap/slideshow/123668260.cms",
            "description": "On September 2, the closing prices of six stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price). A shift above the VWAP suggests a potential bullish trend, according to technical scan data from StockEdge.com.When the closing price rises above the VWAP, it indicates that the stock closed higher than the average price at which it was traded throughout the day, with the average weighted by trading volume. This is often interpreted by traders and investors as a bullish signal, potentially reflecting positive market sentiment.",
            "pubDate": "2025-09-03T03:54:06.167189"
        },
        {
            "title": "At multi-year highs: Eicher Motors, MRF among 6 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-eicher-motors-mrf-among-6-stocks-witness-5-year-swing-high-breakout/slideshow/123667991.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, six stocks witnessed a 5-year swing high at the close on September 2, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-09-03T03:54:06.167290"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Suzlon, Inox Wind among 5 stocks that could give 12-36% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-suzlon-inox-wind-among-5-stocks-that-could-give-12-36-return/slideshow/123667876.cms",
            "description": "Brokerages remain upbeat on select stocks across renewables, infrastructure, and real estate, projecting healthy upsides in the near to medium term.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-03T03:54:06.167393"
        },
        {
            "title": "Current Infraprojects IPO lists today. GMP hints at strong debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/current-infraprojects-ipo-lists-today-gmp-hints-at-strong-debut/articleshow/123667668.cms",
            "description": "Current Infraprojects is set to debut on the NSE SME after a highly successful IPO, oversubscribed by 379 times. The IPO, priced at ₹80 per share, saw significant interest from retail, NII, and QIB investors.",
            "pubDate": "2025-09-03T03:54:06.167488"
        },
        {
            "title": "Sattva Engineering shares to debut today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sattva-engineering-shares-to-debut-today-check-gmp-ahead-of-debut/articleshow/123667640.cms",
            "description": "Chennai's Sattva Engineering Construction is set for its SME debut today, following a highly successful IPO that was oversubscribed 198 times. The Rs 35.38 crore IPO, priced at Rs 75 per share, saw significant interest across all investor categories, particularly from non-institutional investors.",
            "pubDate": "2025-09-03T03:54:06.167585"
        },
        {
            "title": "Positive Breakout: These 8 stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/123667590.cms",
            "description": "In the Nifty200 pack, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on September 2,2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-03T03:54:06.167678"
        },
        {
            "title": "Wall Street ends lower as ruling on Trump tariffs raises concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-lower-as-ruling-on-trump-tariffs-raises-concerns/articleshow/123667476.cms",
            "description": "Wall Street experienced a downturn on Tuesday, influenced by uncertainty surrounding President Trump's tariffs after a court ruling deemed them largely illegal. Investors are also anticipating the upcoming U.S. payrolls report amidst concerns of weak job growth. The Dow, S&P 500, and Nasdaq all declined. While real estate suffered, PepsiCo saw gains due to activist investor interest.",
            "pubDate": "2025-09-03T03:54:06.167794"
        },
        {
            "title": "GIFT Nifty down 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123667199.cms",
            "description": "Equities experienced a slight downturn on Tuesday, reversing earlier gains driven by positive macro data due to profit booking. Investors are keenly awaiting the GST Council meeting. Technically, the daily RSI indicates a bearish trend, with support at 24,500 and resistance at 24,700. The rupee weakened to a record low of 88.15 against the US dollar.",
            "pubDate": "2025-09-03T03:54:06.167984"
        },
        {
            "title": "Stocks in news: Vikran Engineering, Indus Towers, Waaree Energies, TCS, YES Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vikran-engineering-indus-towers-waaree-energies-tcs-yes-bank/articleshow/123667179.cms",
            "description": "Domestic equities closed lower despite positive macro data, influenced by caution ahead of the GST Council meeting. Several companies are in focus, including Vikran Engineering and Anlon Healthcare, debuting on the exchanges. Indus Towers plans expansion in African markets, while Waaree Energies will acquire a 64% stake in Kotson.",
            "pubDate": "2025-09-03T03:54:06.168079"
        },
        {
            "title": "Treasuries stabilize after debt-sale jitters and budget concerns rattle markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/treasuries-stabilize-after-debt-sale-jitters-and-budget-concerns-rattle-markets/articleshow/123667141.cms",
            "description": "Treasuries stabilized in Asian trading following corporate-debt sales and budget worries that impacted bonds and stocks. US 30-year bond yields remained near 5%, affecting tech shares, while Japan's ultra-long bonds also declined. Investors are navigating economic data, tariffs, Fed policy, and fiscal outlooks as the S&P 500 experiences minimal gains.",
            "pubDate": "2025-09-03T03:54:06.168169"
        },
        {
            "title": "Can Smartworks maintain its growth momentum after a 29% surge since IPO?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-smartworks-maintain-its-growth-momentum-after-a-29-surge-since-ipo/articleshow/123667106.cms",
            "description": "Smartworks Coworking Spaces has shown strong performance since its IPO, gaining 29%, driven by robust June quarter results. With 1.1 million sq ft of space to be handed over soon, the company anticipates margin growth in the second half of FY26. They are targeting 30% revenue growth in FY26, leveraging an expanding operational footprint and long-term client relationships.",
            "pubDate": "2025-09-03T03:54:06.168260"
        }
    ]
}