{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-02T11:27:18.289584",
    "items": [
        {
            "title": "BSE shares in focus as NSE moves weekly expiry to Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-in-focus-as-nse-moves-weekly-expiry-to-tuesday/articleshow/123646717.cms",
            "description": "BSE shares: NSE has shifted Nifty weekly contract expiry from Thursday to Tuesday, reshaping trading strategies and boosting prospects for Sensex derivatives.",
            "pubDate": "2025-09-02T03:49:50.142779"
        },
        {
            "title": "IGL shares in focus after formation of solar JV with Rajasthan government",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/igl-shares-in-focus-after-formation-of-solar-jv-with-rajasthan-government/articleshow/123646674.cms",
            "description": "IGL shares: Indraprastha Gas Ltd (IGL) has formed a joint venture with Rajasthan Rajya Vidyut Utpadan Nigam Ltd to set up a solar power project in Rajasthan, marking its entry into the renewable energy sector.",
            "pubDate": "2025-09-02T03:49:50.142888"
        },
        {
            "title": "Torrent Power, Ashok Leyland among 8 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/torrent-power-ashok-leyland-among-8-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/123646216.cms",
            "description": "There was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% as of September 1, in comparison to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.\"",
            "pubDate": "2025-09-02T03:49:50.142985"
        },
        {
            "title": "Sebi to impose fresh intraday derivative position limits from October 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-tighten-intraday-rules-for-index-options-from-october-1/articleshow/123646246.cms",
            "description": "Sebi has introduced a new framework to monitor intraday positions in index options, effective October 1. The rules cap net and gross intraday exposure, mandate random compliance checks, and impose expiry-day penalties to curb aggressive bets while balancing liquidity and institutional participation in the derivatives market.",
            "pubDate": "2025-09-02T03:49:50.143095"
        },
        {
            "title": "Tata Motors, M&M among 10 Nifty stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-mm-among-10-nifty-stocks-showing-rsi-trending-up/slideshow/123646126.cms",
            "description": "Ten stocks from the Nifty50 pack were highlighted in the RSI Trending Up scan on September 1, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-09-02T03:49:50.143196"
        },
        {
            "title": "Hero MotoCorp shares in focus as August sales jump 8% YoY to 5.54 lakh units",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hero-motocorp-shares-in-focus-as-august-sales-jump-8-yoy-to-5-54-lakh-units/articleshow/123645980.cms",
            "description": "Hero MotoCorp share price: The automaker reported an 8% YoY rise in August sales to 5.54 lakh units. Motorcycles and scooters both saw growth, while exports surged 72%. The company also highlighted steady electric sales and festive season optimism.",
            "pubDate": "2025-09-02T03:49:50.143289"
        },
        {
            "title": "Stocks to buy in 2025 for long term: UltraTech Cement, SRF among 5 stocks that could give 13-40% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-ultratech-cement-srf-among-5-stocks-that-could-give-13-40-return/slideshow/123645924.cms",
            "description": "Brokerages have turned positive on a diverse set of companies across sectors, underlining strong earnings visibility, sectoral tailwinds, and expansion-driven growth opportunities.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-09-02T03:49:50.143382"
        },
        {
            "title": "Patanjali Foods, Prestige Estates among 13 dividend stocks to watch: Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patanjali-foods-prestige-estates-among-13-dividend-stocks-to-watch-last-day-to-buy/articleshow/123645801.cms",
            "description": "Investors eyeing dividend payouts should note today is the last day to buy shares of Patanjali Foods and Prestige Estates Projects to qualify for final dividends. Patanjali Foods announced a 100% dividend (Rs 2/share), while Prestige Estates declared 18% (Rs 1.8/share). Other companies with September 3rd as the record date include Concord Biotech (1070%), V.S.T.",
            "pubDate": "2025-09-02T03:49:50.143486"
        },
        {
            "title": "Positive Breakout: These 9 midcap stocks close cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-midcap-stocks-close-cross-above-their-200-dmas/slideshow/123645779.cms",
            "description": "In the NSE midcap pack, nine stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on September 1, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-09-02T03:49:50.143577"
        },
        {
            "title": "NIS Management IPO to list on September 2. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nis-management-ipo-to-list-on-september-2-heres-what-gmp-indicates/articleshow/123645660.cms",
            "description": "Kolkata's NIS Management, a security and facility management firm, is set to debut on the BSE SME platform. The IPO, priced at ₹105-111, saw moderate subscription, led by non-institutional investors. The company plans to use the ₹60.01 crore raised for working capital and general purposes. Despite full subscription, grey market activity is nil, suggesting a debut around the issue price.",
            "pubDate": "2025-09-02T03:49:50.143678"
        },
        {
            "title": "Indian local funds’ stock buying nears record as foreigners exit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-local-funds-stock-buying-nears-record-as-foreigners-exit/articleshow/123645329.cms",
            "description": "Indian institutions are close to a record in stock purchases this year. This cushions the market as foreign funds sell. Local investors have bought over $59 billion in equities. Foreigners have withdrawn $14 billion in 2025. Retail participation drives most inflows. Investors are moving from traditional savings to equity funds. Local institutions' ownership hit a record high.",
            "pubDate": "2025-09-02T03:49:50.143770"
        },
        {
            "title": "Asian stocks edge up, Japan bond auction in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-up-japan-bond-auction-in-focus/articleshow/123644763.cms",
            "description": "Asian stocks saw modest gains, driven by technology and AI sectors, particularly Alibaba's surge. Investors are eyeing upcoming jobs and inflation data, along with the Federal Reserve's rate decision, amid historical September market weakness. Meanwhile, Indonesian markets face political risks, and longer-maturity bonds brace for a potentially challenging month.",
            "pubDate": "2025-09-02T03:49:50.143871"
        },
        {
            "title": "GIFT Nifty up 25 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123644717.cms",
            "description": "Nifty recovered following three days of losses, boosted by robust GDP growth figures. Despite a positive domestic outlook, potential US tariffs and continuous selling by foreign investors may limit market gains. Technically, the index faces resistance below 25,000, while strong support lies at 24,350, with the rupee hitting a record low.",
            "pubDate": "2025-09-02T03:49:50.143962"
        },
        {
            "title": "Stocks in news: Hero MotoCorp, Hyundai India, IGL, Maruti Suzuki, BEL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hero-motocorp-hyundai-india-igl-maruti-suzuki-bel/articleshow/123644684.cms",
            "description": "The markets opened positively, buoyed by strong Q1 GDP figures. Hero MotoCorp reported an 8% YoY increase in sales, while Hyundai India saw a 4% dip. Maruti Suzuki began exporting its first BEV, the eVITARA, and BEL secured additional orders worth ₹644 crore.",
            "pubDate": "2025-09-02T03:49:50.144073"
        },
        {
            "title": "Can Jubilant Ingrevia sustain its recovery after recent challenges?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-jubilant-ingrevias-recovery-sustain-after-recent-challenges/articleshow/123644568.cms",
            "description": "Jubilant Ingrevia shares are recovering after a period of decline. Domestic operations and limited US exposure shield it from tariffs. EU's anti-dumping duty on Chinese choline chloride benefits the company. Capacity expansion and agriculture sector opportunities drive growth. Cost optimization measures are expected to improve margins. The company anticipates higher choline chloride exports to Europe.",
            "pubDate": "2025-09-02T03:49:50.144170"
        },
        {
            "title": "Stock market's fate comes down to next 14 trading sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-markets-fate-comes-down-to-next-14-trading-sessions/articleshow/123644525.cms",
            "description": "Wall Street faces a crucial period as key economic reports and the Federal Reserve's interest rate decision loom. The stock market, showing signs of uncertainty after a modest August gain, enters historically weak September. Despite low volatility, analysts predict a potential fall correction before a year-end rebound, creating a tricky environment for investors.",
            "pubDate": "2025-09-02T03:49:50.144258"
        },
        {
            "title": "OLA Electric among 6 stocks that rose above VWAP on September 1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-among-6-stocks-that-rose-above-vwap-on-september-1/slideshow/123646906.cms",
            "description": "On September 1, the closing prices of seven stocks in the Nifty200 pack rallied over 1.5% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-09-02T03:58:32.182001"
        },
        {
            "title": "Choice Institutional initiates coverage on Nazara Technologies with Buy rating, sees 21% upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/choice-institutional-initiates-coverage-on-nazara-technologies-with-buy-rating-sees-21-upside-potential/articleshow/123650687.cms",
            "description": "Choice Institutional Equities initiated coverage on Nazara Technologies with a BUY rating. Strong growth, acquisitions, and global expansion support momentum, though regulatory risks and underperforming IPs remain key challenges",
            "pubDate": "2025-09-02T07:18:01.426225"
        },
        {
            "title": "Apollo Micro Systems 140% gain is 2x higher than every other defence stock. Can you buy it now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apollo-micro-systems-140-gain-is-2x-higher-than-every-other-defence-stock-can-you-buy-it-now/articleshow/123650648.cms",
            "description": "Apollo Micro Systems has given investors great returns. The company's stock has performed better than other defence stocks. Its financial results are strong and orders are increasing. The company is expanding into exports and new technologies. Government initiatives are helping the defence sector grow. Experts believe the stock will continue to perform well.",
            "pubDate": "2025-09-02T07:18:01.426356"
        },
        {
            "title": "Will drug prices soar under Trump’s tariff plan?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-drug-prices-soar-under-trumps-tariff-plan/slideshow/123649270.cms",
            "description": "President Donald Trump has already slapped tariffs on autos, steel, aluminium, and a host of imports. Now, he has set his sights on pharmaceuticals — an industry that has long enjoyed duty-free entry into the U.S. (Source: AP)",
            "pubDate": "2025-09-02T07:18:01.426465"
        },
        {
            "title": "GST cuts lift market sentiment, IT gains on valuation play: Dhananjay Sinha",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-cuts-lift-market-sentiment-it-gains-on-valuation-play-dhananjay-sinha/articleshow/123650142.cms",
            "description": "Stock markets rebounded after last week’s selloff, driven by GST cuts, festive demand expectations, and global partnerships. Dhananjay Sinha highlighted auto, FMCG, and consumer goods as key beneficiaries. The IT sector rally was attributed to sector rotation and Fed rate cut hopes, though outlook depends on future commentary and exports.",
            "pubDate": "2025-09-02T07:18:01.426664"
        },
        {
            "title": "Reliance Industries shares jump 2%. Is it about AGM or what China is doing?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-industries-shares-jump-2-is-it-about-agm-or-what-china-is-doing/articleshow/123650077.cms",
            "description": "Reliance Industries shares rose over 2% after two days of losses, driven by upbeat brokerage calls post-AGM and a Morgan Stanley report highlighting RIL as a key beneficiary of China’s anti-innovation push, supporting its energy, solar, and consumer businesses with strong long-term growth prospects.",
            "pubDate": "2025-09-02T07:18:01.426768"
        },
        {
            "title": "SCO Summit optics misleading; China still a strategic rival, warns Swaminathan Aiyar",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sco-summit-optics-misleading-china-still-a-strategic-rival-warns-swaminathan-aiyar/articleshow/123650036.cms",
            "description": "Donald Trump's claim about India agreeing to reduce tariffs to \"almost nothing\" has been dismissed by economist Swaminathan Aiyar as unpredictable rhetoric. Aiyar argues that Trump's tariff war is more about geopolitics, stemming from India's stance on Russia and oil imports. Despite external pressures, India's economy shows resilience, with GDP growth surpassing expectations, indicating a capacity to withstand tariff pressures.",
            "pubDate": "2025-09-02T07:18:01.426862"
        },
        {
            "title": "Rs 2.4 lakh crore wiped out from Mukesh Ambani stocks in 1 year. Can Reliance drive the comeback?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-2-4-lakh-crore-wiped-out-from-mukesh-ambani-stocks-in-1-year-can-reliance-drive-the-comeback/articleshow/123649886.cms",
            "description": "Mukesh Ambani's ten companies collectively experienced a market value erosion of nearly Rs 2.4 lakh crore in the past year, with Reliance Industries leading the decline. Despite this downturn, brokerages remain optimistic about Reliance's long-term prospects in telecom, new energy, and AI, while concerns linger regarding the Jio IPO and its potential benefits for RIL shareholders.",
            "pubDate": "2025-09-02T07:18:01.426958"
        },
        {
            "title": "One MobiKwik Systems shares surge 12% following ADIA stake sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/one-mobikwik-systems-shares-surge-up-to-12-following-adia-stake-sale/articleshow/123649710.cms",
            "description": "One MobiKwik Systems shares: MobiKwik shares jumped on Tuesday after Abu Dhabi Investment Authority exited its 2.1% stake worth ₹39.2 crore. The stock later pared gains to trade 8.5% higher, as BofA Securities Europe and SI Investments bought a combined 1.15% stake for ₹22.1 crore.",
            "pubDate": "2025-09-02T07:18:01.427060"
        },
        {
            "title": "NSE weekly expiry moves to Tuesday: 10 key things traders must know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-weekly-expiry-moves-to-tuesday-10-key-things-traders-must-know/articleshow/123649383.cms",
            "description": "Starting August 28, 2025, the NSE has shifted Nifty’s weekly expiry from Thursday to Tuesday, ending a 25-year tradition. This historic move reshapes trading strategies, accelerates weekend time decay, and redistributes volatility. While traders adjust to the change, experts believe it will enhance price discovery, boost BSE volumes, and create new strategic opportunities across India’s derivatives landscape.",
            "pubDate": "2025-09-02T07:18:01.427182"
        },
        {
            "title": "Technical strength: 5 sectors with the most stocks above key moving averages",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-strength-5-sectors-with-the-most-stocks-above-key-moving-averages/slideshow/123649551.cms",
            "description": "Axis Securities’ Moving Average Distribution report indicates strong momentum across several sectors, with a significant percentage of stocks trading above their key moving averages. Here are the top five sectors currently exhibiting the most strength:",
            "pubDate": "2025-09-02T07:18:01.427284"
        },
        {
            "title": "Market in a phase of consolidation; 3 major domestic-centric themes to watch: Devang Mehta",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-in-a-phase-of-consolidation-3-major-domestic-centric-themes-to-watch-devang-mehta/articleshow/123648671.cms",
            "description": "Indian markets are consolidating after a volatile year, but Spark Private Wealth’s Devang Mehta sees opportunity in adversity. He highlights GST clarity, strong domestic inflows, and three key themes—capex cycle, consumption, and financials—as drivers for long-term investors despite near-term global uncertainties.",
            "pubDate": "2025-09-02T07:18:01.427383"
        },
        {
            "title": "BOJ’s Balancing Act: Rate hikes amid global uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bojs-balancing-act-rate-hikes-amid-global-uncertainty/slideshow/123648591.cms",
            "description": "Bank of Japan Deputy Governor Ryozo Himino said the central bank should continue raising interest rates but cautioned that global economic uncertainty remains high. He emphasised that there is no urgency to accelerate the pace of tightening given the unpredictable environment. (Source: Reuters)",
            "pubDate": "2025-09-02T07:18:01.427474"
        },
        {
            "title": "Balrampur Chini, other sugar stocks zoom up to 20% as govt policies boost ethanol outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balrampur-chini-other-sugar-stocks-zoom-up-to-20-as-govt-policies-boost-ethanol-outlook/articleshow/123648130.cms",
            "description": "Sugar stocks surged up to 20% on Tuesday after the Supreme Court upheld the rollout of 20% ethanol-blended petrol and the government eased curbs on ethanol production. Rajshree Sugars, Shree Renuka, Dhampur, Avadh, and Balrampur Chini led the rally as policy support boosted ethanol demand outlook.",
            "pubDate": "2025-09-02T07:18:01.427571"
        },
        {
            "title": "Tuesday is the new Thursday for Nifty traders: How expiry day change will rewrite trader strategies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tuesday-is-the-new-thursday-for-nifty-traders-how-expiry-day-change-will-rewrite-trader-strategies/articleshow/123647630.cms",
            "description": "Starting September 2025, NSE will shift Nifty’s weekly F&O expiry from Thursday to Tuesday, marking a major shift in trading dynamics. Mondays become the new “expiry eve,” with weekend risk rising and option strategies needing a reset. Traders must now recalibrate positioning and risk management, as traditional Thursday volatility gives way to a new cycle, impacting volumes and timing.",
            "pubDate": "2025-09-02T07:18:01.427662"
        },
        {
            "title": "Stock-specific opportunities emerging in defence, renewables after recent market pullback: Narendra Solanki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-specific-opportunities-emerging-in-defence-renewables-after-recent-market-pullback-narendra-solanki/articleshow/123651342.cms",
            "description": "Railway and defence stocks are recovering, sparking discussions about their value. Experts suggest long-term growth potential in defence, electronics, and renewable energy. Banking sector remains strong, particularly PSU banks. Focus shifts to domestic growth, with rural demand and consumption driving financial plays. Investors are eyeing sectors aligned with government spending for future gains.",
            "pubDate": "2025-09-02T07:42:18.133173"
        },
        {
            "title": "GenAI meets capex: Telco data centers as the next earnings driver",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/genai-meets-capex-telco-data-centers-as-the-next-earnings-driver/articleshow/123651051.cms",
            "description": "India's smartphone market sees a surge in 5G adoption. Data traffic grows due to fixed wireless access and GenAI. Telcos are building data centers integrated with core networks. India's data center capacity is projected to reach 3 GW by 2028. Airtel focuses on domain-specific AI, while Reliance aims for gigawatt-scale AI-ready data centers.",
            "pubDate": "2025-09-02T07:42:18.133286"
        },
        {
            "title": "Tata, M&M shares hit as report on higher GST for luxury EVs sparks concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-mm-shares-hit-as-report-on-higher-gst-for-luxury-evs-sparks-concerns/articleshow/123655335.cms",
            "description": "Shares of Tata Motors, M&M, and Hyundai fell as reports suggested the GoM may raise GST on luxury EVs ahead of the September 3–4 Council meeting. Higher levies on EVs above Rs 20 lakh could affect sales and demand, particularly for high-end models from Tesla, Mercedes, and BMW.",
            "pubDate": "2025-09-02T11:27:03.775083"
        },
        {
            "title": "F&O Radar | Deploy Broken Wing in Hindalco shares to gain from bullish view on the stock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-broken-wing-in-hindalco-shares-to-gain-from-bullish-view-on-the-stock/articleshow/123654964.cms",
            "description": "Hindalco shares closed near Rs 721, breaking out of a wide trading range after repeated resistance tests, supported by higher highs–higher lows and rising EMAs. Momentum indicators like RSI signal bullish continuation. Options data and the Broken Wing Butterfly strategy offer traders opportunities to capitalize on potential upside toward Rs 760–775.",
            "pubDate": "2025-09-02T11:27:03.775210"
        },
        {
            "title": "5 midcap stocks with rising promoter pledges in Q1FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-midcap-stocks-with-rising-promoter-pledges-in-q1fy26/slideshow/123653810.cms",
            "description": "",
            "pubDate": "2025-09-02T11:27:03.775314"
        },
        {
            "title": "Metals outperform peers; technical charts point to strength ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/metals-outperform-peers-technical-charts-point-to-strength-ahead/articleshow/123654759.cms",
            "description": "The Nifty crossed the 24,700 mark in early trade, but the Bank Nifty lagged, managing to stay just about in the green. Market experts, however, remain confident that the banking index will soon join the rally.",
            "pubDate": "2025-09-02T11:27:03.775415"
        },
        {
            "title": "Market Wrap: Sensex slips 750 points from day’s high, Nifty below 24,600; 4 key reasons behind market fall",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-slips-750-points-from-days-high-nifty-below-24600-4-key-reasons-behind-market-fall/articleshow/123654693.cms",
            "description": "NSE marked history with its first Tuesday expiry, but markets slipped amid weak global cues and profit booking. FMCG stocks gained ahead of the GST council meet, while auto heavyweights like M&M, Maruti, and Tata Motors fell.",
            "pubDate": "2025-09-02T11:27:03.775519"
        },
        {
            "title": "Festive season, GST cut seen as key triggers for auto demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/festive-season-gst-cut-seen-as-key-triggers-for-auto-demand/articleshow/123654284.cms",
            "description": "The latest auto sales data paints a mixed picture for the industry. While two-wheelers and tractors continued to deliver strong performances, passenger vehicle sales remained subdued, leaving analysts watching closely for potential demand revival on the back of an anticipated GST cut.",
            "pubDate": "2025-09-02T11:27:03.775620"
        },
        {
            "title": "Reliance Power, Reliance Infra shares hit 5% upper circuit. A look at Anil Ambani group stocks' 1-year run",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-reliance-infra-shares-hit-5-upper-circuit-a-look-at-anil-ambani-group-stocks-1-year-run/articleshow/123654185.cms",
            "description": "Reliance Power and Reliance Infrastructure shares surged to 5% on Tuesday, continuing a two-day rally. Reliance Power shares have seen a sharp rally buoyed by positive developments in its renewable energy business.",
            "pubDate": "2025-09-02T11:27:03.775717"
        },
        {
            "title": "Goldman Sachs trims stake in smallcap firm, stock drops over 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-trims-stake-in-smallcap-firm-stock-drops-over-3/articleshow/123654065.cms",
            "description": "Shares of Zinka Logistics Solutions, parent of trucking platform BlackBuck, dropped 3.5% after Goldman Sachs offloaded a 2.74% stake worth Rs 295 crore via a bulk deal. Nomura India bought a 2.3% stake in return. Despite the sell-off, the stock has gained over 34% YTD, reflecting investor interest in the tech-led logistics player’s strong growth trajectory.",
            "pubDate": "2025-09-02T11:27:03.775836"
        },
        {
            "title": "CG Power shares rally 12% in three sessions on semiconductor push",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cg-power-shares-rally-12-in-three-sessions-on-semiconductor-push/articleshow/123653623.cms",
            "description": "Shares of CG Power and Industrial Solutions rose nearly 4% on Tuesday, extending a three-day winning streak and 12% gain over the past sessions. The rally follows the launch of CG Semi, India’s first end-to-end OSAT semiconductor facility in Sanand, backed by a Rs 7,600 crore investment.",
            "pubDate": "2025-09-02T11:27:03.775934"
        },
        {
            "title": "Markets look to GST cuts for boost; consumption, auto and metals stocks in focus: Deven Choksey",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-look-to-gst-cuts-for-boost-consumption-auto-and-metals-stocks-in-focus-deven-choksey/articleshow/123653444.cms",
            "description": "Deven Choksey expects GST cuts to spark a demand revival across FMCG, autos, and manufacturing, with metals, power distribution, defence, sugar, and PSUs also offering selective opportunities. He sees pent-up demand reflecting from the September quarter.",
            "pubDate": "2025-09-02T11:27:03.776033"
        },
        {
            "title": "Nestle investors face more turbulence after another CEO ousted",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nestle-investors-face-more-turbulence-after-another-ceo-ousted/articleshow/123653198.cms",
            "description": "Nestle faces leadership change. Laurent Freixe is out as CEO due to a relationship with a subordinate. Philipp Navratil replaces him. This follows Mark Schneider's earlier departure. Investors are worried about Nestle's direction. Share prices have fallen. A review of the vitamins business is underway. Analysts express concern over the lack of a thorough CEO search.",
            "pubDate": "2025-09-02T11:27:03.776129"
        },
        {
            "title": "GST push, lower rates could power consumption despite tariff shock: Vikas Khemani",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gst-push-lower-rates-could-power-consumption-despite-tariff-shock-vikas-khemani/articleshow/123653119.cms",
            "description": "Despite tariff concerns, market veteran Vikas Khemani remains bullish on India’s growth story, citing GST rationalisation and falling interest rates as key consumption drivers. He warns investors against chasing hype-driven valuations, urging focus on fundamentals and long-term opportunities.",
            "pubDate": "2025-09-02T11:27:03.776221"
        },
        {
            "title": "After a 55% surge in a month, are Ola Electric shares still a buy or is it time to take profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-a-55-surge-in-a-month-are-ola-electric-shares-still-a-buy-or-is-it-time-to-take-profits/articleshow/123652782.cms",
            "description": "Ola Electric surged 55% in a month following PLI scheme inclusion and strong technical momentum. Analysts cite breakout patterns, higher volumes, and support zones driving upside, despite Q1 net losses. PLI incentives and cost-structure improvements bolster prospects, making the stock a key focus for medium-term gains.",
            "pubDate": "2025-09-02T11:27:03.776312"
        },
        {
            "title": "Top 10 high-growth midcap stocks mutual funds are betting on now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-10-midcap-stocks-mutual-funds-are-accumulating-right-now/slideshow/123652320.cms",
            "description": "A strong blend of fundamentals and momentum is driving action in the midcap space, as mutual funds increase exposure to high-growth companies delivering impressive FY26 returns. In the June 2025 quarter, mutual funds boosted stakes in 23 midcap firms, each posting over 15% year-on-year growth in both revenue and profit in FY25 — a clear sign of solid business performance. Many of these stocks have also delivered robust gains in FY26 (since April), with several rallying sharply.From this group, we highlight 10 standout midcap stocks that have gained between 10% and 45% in FY26 so far, alongside rising mutual fund interest. This rare combination of growth, momentum, and institutional backing makes these names worthy of close attention. (Data source: ACE Equity)",
            "pubDate": "2025-09-02T11:27:03.776406"
        },
        {
            "title": "Time to look again, but make a distinction: 11 FMCG stocks which can give from just 1% to 22% returns in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/time-to-look-again-but-make-a-distinction-11-fmcg-stocks-which-can-give-from-just-1-to-22-returns-in-1-year/articleshow/123651488.cms",
            "description": "It is after quite some time that FMCG stocks are in greenish territory. This is not only because they are seen as defensive stocks during a correction, but also because some green shoots are visible in terms of their real business thanks to the good monsoon this year. Adding to the positive bias is the GST rate rationalisation that is likely to happen soon. But that is where one needs to be more cautious. In terms of the GST rate move, don’t paint every FMCG stock with the same brush.",
            "pubDate": "2025-09-02T11:27:03.776503"
        }
    ]
}