{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-19T19:27:52.077009",
    "items": [
        {
            "title": "Balaji Telefilms to raise Rs 131 crore via preferential share allotment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balaji-telefilms-to-raise-rs-131-crore-via-preferential-share-allotment/articleshow/116480112.cms",
            "description": "The company stated that the proceeds will be utilised for general business purposes aligned with its long-term strategy. The proposal is subject to shareholder and regulatory approval. An Extraordinary General Meeting (EGM) will be held virtually on 11 January 2025 to secure shareholder consent.",
            "pubDate": "2024-12-19T19:27:34.164053"
        },
        {
            "title": "Six entities pay Rs 3.49 crore to settle front-running trade case with Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/six-entities-pay-rs-3-49-crore-to-settle-front-running-trade-case-with-sebi/articleshow/116479578.cms",
            "description": "Six entities, including Samir Kothari and Jitendra N Kewalramani, settled with Sebi after being accused of front-running trades. They paid a total of ₹3.49 crore in settlement charges and disgorged ₹2.06 crore in unlawful gains. The entities also agreed to a six-month voluntary ban from securities markets.",
            "pubDate": "2024-12-19T19:27:34.164193"
        },
        {
            "title": "Market Trading Guide: Muthoot Finance, Dr Reddy's Laboratories are stock recommendations for Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-muthoot-finance-dr-reddys-laboratories-are-stock-recommendations-for-friday/slideshow/116477869.cms",
            "description": "Indian benchmark indices fell sharply today (Thursday, December 19) not taking kindly to the hawkish commentary by the US Fed on Wednesday. IT stocks were the ones most hit followed by banks and financials. The 30-stock S&P BSE Sensex finished at 79,218.05, declining by 964.15 points or 1.20% while the Nifty50 settled at 23,951.70, falling by 247.15 points or 1.02%. Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that Nifty has broken below the neckline of the inverse head and shoulders pattern after witnessing a sharp decline today. \"On the lower end, it found support at the low of the right shoulder. Sentiment remains weak following a hawkish comment from the Fed, which could continue to weigh on market sentiment in the short term. Support is placed at 23,850, below which further correction appears likely. Resistance is seen at 24,200,\" De said.Here are 2 stock recommendations for Friday:",
            "pubDate": "2024-12-19T19:27:34.164307"
        },
        {
            "title": "Senores Pharmaceuticals collects Rs 261 cr from anchor investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/senores-pharmaceuticals-collects-rs-261-cr-from-anchor-investors/articleshow/116478891.cms",
            "description": "Senores Pharmaceuticals Ltd on Thursday said it has secured nearly Rs 261 crore from anchor investors, ahead of its initial share-sale opening for public subscription.",
            "pubDate": "2024-12-19T19:27:34.164418"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/116478345.cms",
            "description": "Indian markets declined on Thursday, dragged by global market weakness after the Fed's hawkish stance. Selling pressure was seen across sectors, especially in banking and real estate. FII outflows and a strong dollar further weighed on the market. Defensive sectors like pharma outperformed.",
            "pubDate": "2024-12-19T19:27:34.164525"
        },
        {
            "title": "Infosys, Wipro ADRs jump 3% on Accenture's Q1 revenue beat, guidance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-adrs-jump-nearly-3-on-accentures-q2-revenue-beat-guidance/articleshow/116478182.cms",
            "description": "Infosys and Wipro ADRs surged nearly 3% after Accenture's strong Q1 earnings beat. Accenture's revenue growth was driven by increased demand for AI-powered services. This positive sentiment boosted investor confidence in Indian IT companies.",
            "pubDate": "2024-12-19T19:27:34.164630"
        },
        {
            "title": "These 5 stocks have shown consistently increasing Free Cash Flow per share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-stocks-have-shown-consistently-increasing-free-cash-flow-per-share/slideshow/116477473.cms",
            "description": "",
            "pubDate": "2024-12-19T19:27:34.164728"
        },
        {
            "title": "US stocks bounce back day after Fed's hawkish cut triggers selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-jump-at-open-day-after-selloff-on-fed-rate-cut-caution/articleshow/116477348.cms",
            "description": "Wall Street's main indexes broadly rose at the open on Thursday, a day after the Federal Reserve's projections of fewer-than-expected interest rate cuts and higher inflation next year wrong footed some investors and pummeled U.S. stocks.",
            "pubDate": "2024-12-19T19:27:34.164825"
        },
        {
            "title": "Inventurus Knowledge Solutions block deal: Norges Bank buys 34 lakh shares worth Rs 652 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inventurus-knowledge-solutions-block-deal-norges-bank-buys-34-lakh-shares-worth-rs-652-crore/articleshow/116477345.cms",
            "description": "Norges Bank, on behalf of the Government Pension Fund Global, acquired 16.59 lakh and 17.50 lakh shares of Inventurus Knowledge Solutions at Rs 1,923.92 and Rs 1,899.67 per share, respectively. IKS stock debuted at Rs 1,900, a 43% premium to its issue price of Rs 1,329, and closed at Rs 2,030 on Thursday, up 6.84% or Rs 130 over the listing price.",
            "pubDate": "2024-12-19T19:27:34.164924"
        },
        {
            "title": "Concord Enviro offers exposure to high potential water treatment sector",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concord-enviro-offers-exposure-to-high-potential-water-treatment-sector/articleshow/116477199.cms",
            "description": "Concord Enviro, a water and wastewater management solutions provider, is launching an IPO to raise Rs 500 crore. The company has a strong international presence and a growing order book. However, its financial performance has been inconsistent. Investors should carefully assess the company's future prospects before making an investment decision.",
            "pubDate": "2024-12-19T19:27:34.165024"
        },
        {
            "title": "These 6 stocks hit 52-week highs, rallied up to 21% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-stocks-hit-52-week-highs-rallied-up-to-21-in-a-month/slideshow/116477017.cms",
            "description": "On Thursday, the benchmark Sensex dropped by approximately 964 points, closing at 79,218. Despite this market slump, six stocks from the BSE 200 index reached their 52-week highs. A 52-week high represents the highest price a stock has reached in the past year, offering valuable insights for traders and investors. This metric is crucial for assessing a stock's current value and forecasting its future potential.",
            "pubDate": "2024-12-19T19:27:34.165136"
        },
        {
            "title": "Tech View: Nifty struggles below 24,180 resistance, relief rally hinges on 23,800 support. How to trade on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-struggles-below-24180-resistance-relief-rally-hinges-on-23800-support-how-to-trade-on-friday/articleshow/116475916.cms",
            "description": "The recent breakdown point at 24,180 serves as an immediate resistance, followed by the 100-day exponential moving average around 24,350. According to Hrishikesh Yedve of Asit C. Mehta Investment Intermediates, a relief rally is possible if the index holds above 23,800. However, weakness will persist as long as it stays below 24,350.",
            "pubDate": "2024-12-19T19:27:34.165237"
        },
        {
            "title": "Sebi defers ESG disclosure deadline under BRSR framework by one year till FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-defers-esg-disclosure-deadline-under-brsr-framework-by-one-year-till-fy26/articleshow/116475801.cms",
            "description": "Markets regulator Sebi has decided to defer the ESG disclosure deadline for value chain partners of listed companies by one year until FY26, giving more time to them to comply with the Business Responsibility and Sustainability Reporting (BRSR) requirements.",
            "pubDate": "2024-12-19T19:27:34.165328"
        },
        {
            "title": "Breakout Stocks: How to trade BSE, Lemon Tree Hotels & KFin Technologies on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-bse-lemon-tree-hotels-amp-kfin-technologies-on-friday/slideshow/116475785.cms",
            "description": "Indian market closed in the red for the fourth day in a row on Thursday. The BSE Sensex fell by over 900 points while the Nifty50 closed below 24,000.",
            "pubDate": "2024-12-19T19:27:34.165422"
        },
        {
            "title": "Two Sharp with ET: Markets Fed Up! Hawkish US Fed tanks Sensex, Rupee hits ₹85/$",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-markets-fed-up-hawkish-us-fed-tanks-sensex-rupee-hits-85/videoshow/116475630.cms",
            "description": "The U.S. Federal Reserve has reduced the interest rates by 25 basis points, as has been anticipated by the markets world over. Following this, the Fed's hawkish statement has also given more strength to the dollar index. And that has caused a lot of damage to the Indian rupee. Indian rupee touched the psychological sentimental level of ₹85 to a dollar for the first time. Nisha Poddar of the Economic Times decodes.",
            "pubDate": "2024-12-19T19:27:34.165516"
        },
        {
            "title": "These 5 companies show rising cash from operations",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-5-companies-show-rising-cash-from-operations/slideshow/116474749.cms",
            "description": "",
            "pubDate": "2024-12-19T19:27:34.165607"
        }
    ]
}