{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-13T07:21:47.780423",
    "items": [
        {
            "title": "Nifty’s fastest mover Bajaj Finance faces a growth bottleneck as swelling loan book raises red flags. What lies ahead?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/niftys-fastest-mover-bajaj-finance-faces-a-growth-bottleneck-as-swelling-loan-book-raises-red-flags-what-lies-ahead/articleshow/125290274.cms",
            "description": "Bajaj Finance, Nifty's top performer, faces a growth slowdown due to stress in SME and captive 2/3 wheeler loan segments. The company has cut its growth guidance for FY26 to 22-23%, expecting asset quality to improve by Q4FY26/Q1FY27. New growth engines are expected to partially offset the impact.",
            "pubDate": "2025-11-13T04:40:18.336903"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs maintains buy on Info Edge; Elara Securities recommends sell on Asian Paints",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-maintains-buy-on-info-edge-elara-securities-recommends-sell-on-asian-paints/articleshow/125290022.cms",
            "description": "Brokerages offered mixed views on key stocks as Goldman Sachs reaffirmed its bullish stance on Info Edge, citing improved valuations, while Elara Securities maintained a cautious ‘Sell’ on Asian Paints due to limited growth. Morgan Stanley remained positive on Tata Steel, highlighting strong quarterly results and sustained margin recovery momentum.",
            "pubDate": "2025-11-13T04:40:18.337035"
        },
        {
            "title": "Gujarat Fluorochemicals, Hexaware Tech among 5 stocks showing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-fluorochemicals-hexaware-tech-among-5-stocks-showing-bullish-signals/slideshow/125290027.cms",
            "description": "Five stocks in the Nifty500 pack came to the bullish scanner of \"White Marubozu\" on November 12, according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.\"",
            "pubDate": "2025-11-13T04:40:18.337148"
        },
        {
            "title": "Sensex drops 50 pts, Nifty below 25,850 as D-St awaits cues on India-U.S. trade deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-200-pts-nifty-below-25850-as-d-st-awaits-cues-on-india-u-s-trade-deal/articleshow/125289747.cms",
            "description": "Indian stocks traded lower on Thursday, with the Sensex and Nifty snapping a three-day winning streak. Investors watched for progress on a potential India-U.S. trade agreement. Financial and IT shares led the declines. However, the market soon saw a quick recovery and traded in the green. Midcap and smallcap stocks edged up.",
            "pubDate": "2025-11-13T04:40:18.337256"
        },
        {
            "title": "Ashok Leyland shares in focus as Q2 net profit rises 7% to Rs 820 crore. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-in-focus-as-q2-net-profit-rises-7-to-rs-820-crore-should-you-buy-sell-or-hold/articleshow/125289893.cms",
            "description": "Ashok Leyland share price: Ashok Leyland reported a 7% YoY rise in Q2 net profit to Rs 820 crore, driven by strong exports, operational efficiencies, and steady margins. Brokerages remain bullish, with Nomura and Morgan Stanley raising target prices, citing improved profitability, structural growth, and attractive valuations.",
            "pubDate": "2025-11-13T04:40:18.337358"
        },
        {
            "title": "Info Edge shares in focus as Q2 profit soars 1,260%; check Goldman Sachs and Nomura’s target prices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/info-edge-shares-in-focus-as-q2-profit-soars-1260-check-goldman-sachs-and-nomuras-target-prices/articleshow/125289853.cms",
            "description": "Info Edge reported a sharp 1,260% YoY jump in Q2 profit to Rs 316 crore, driven by higher revenue and exceptional gains. Revenue rose 15% to Rs 805 crore, with billings up 12% YoY. Brokerages Nomura and Goldman Sachs maintained Buy ratings, citing strong margins, stable growth outlook, and attractive valuations despite muted hiring trends.",
            "pubDate": "2025-11-13T04:40:18.337460"
        },
        {
            "title": "Asian Paints shares jump 4% to fresh 52-week high on Q2 beat. Should investors buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-shares-in-focus-after-q2-results-should-you-buy-sell-or-hold/articleshow/125289818.cms",
            "description": "Asian Paints shares surged to a new high after reporting a strong 43 percent profit jump for the September quarter. Decorative paint demand and cost savings fueled this growth. Revenues also saw a rise. While the company declared a dividend, analysts hold differing views on its stock valuation and future growth prospects.",
            "pubDate": "2025-11-13T04:40:18.337589"
        },
        {
            "title": "M&M shares in focus after announcing 50:50 life insurance JV with Manulife",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-shares-in-focus-after-announcing-5050-life-insurance-jv-with-manulife/articleshow/125289644.cms",
            "description": "Mahindra & Mahindra announced a 50:50 life insurance joint venture with Manulife, approved by its board on November 12. The JVCo will offer life insurance solutions in India, with an initial investment of Rs 1,250 crore from each party. This venture aims to tap into India's growing life insurance market, particularly in rural and semi-urban areas.",
            "pubDate": "2025-11-13T04:40:18.337684"
        },
        {
            "title": "FIIs pull out Rs 80,000 crore from 10 bluechip stocks but the selling may finally be getting over",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-pull-out-rs-80000-crore-from-10-bluechip-stocks-but-the-selling-may-finally-be-getting-over/articleshow/125289481.cms",
            "description": "Foreign investors have withdrawn substantial funds from top Indian stocks. However, a shift is occurring with expectations that the worst is over. Domestic mutual funds are increasing their holdings, providing market stability. Analysts are optimistic about India's future growth prospects, projecting potential gains for the Nifty index.",
            "pubDate": "2025-11-13T04:40:18.337781"
        },
        {
            "title": "Parag Milk Foods, Max Financial Services among 7 stocks hitting 5-year swing highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/parag-milk-foods-max-financial-services-among-7-stocks-hitting-5-year-swing-highs/slideshow/125289437.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, seven stocks hit a 5-year swing high at the close on November 12, suggesting bullishness in these counters, according to StockEdge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a key resistance point, beyond which the price has historically struggled to move. Such a move may be seen as a bullish signal, indicating potential for further upward momentum. However, it differs from a 5-year breakout, which occurs when a stock’s price surpasses a key resistance level that has held for five years or more.",
            "pubDate": "2025-11-13T04:40:18.337883"
        },
        {
            "title": "Asian Paints posts first double-digit sales volume growth in 7 quarters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-paints-posts-first-double-digit-sales-volume-growth-in-7-quarters/articleshow/125289298.cms",
            "description": "Asian Paints reported double-digit sales volume growth in its decorative paints segment for the first time in seven quarters, helping it surpass July–September profit estimates. The company also posted year-on-year net profit growth for the first time in six quarters, supported by improved operations. Sales volume rose 10.9% and value increased 6%, aided by a low base from last year.",
            "pubDate": "2025-11-13T04:40:18.337981"
        },
        {
            "title": "Shringar House of Mangalsutra shares in focus as Q2 PAT rises over 42% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shringar-house-of-mangalsutra-shares-in-focus-as-q2-pat-rises-over-42-yoy/articleshow/125289270.cms",
            "description": "Shringar House of Mangalsutra posted a robust Q2FY26 performance, with PAT rising 42.5% YoY to Rs 22.85 crore. Revenue grew 27% to Rs 528.79 crore, while EBITDA and gross margins expanded. The company also launched its 24K SHUDDH Hallmarked Mangalsutra collection, boosting product offerings.",
            "pubDate": "2025-11-13T04:40:18.338075"
        },
        {
            "title": "Ather Energy shares in focus as NIIF II likely to offload up to 2.3% stake via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ather-energy-shares-in-focus-as-niif-ii-likely-to-offload-up-to-2-3-stake-via-block-deal/articleshow/125289221.cms",
            "description": "Ather Share price: NIIF II is set to sell up to 2.34% of its Ather Energy stake through a block deal, with the floor price fixed at Rs 620 per share. The transaction, valued at around Rs 551 crore, will be executed via the open market block window mechanism, potentially altering the company’s shareholding structure.",
            "pubDate": "2025-11-13T04:40:18.338171"
        },
        {
            "title": "Tata Steel shares rise 3% after Q2 PAT surges fourfold to Rs 3,183 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-in-focus-after-q2-pat-surges-fourfold-to-rs-3183-crore/articleshow/125288779.cms",
            "description": "Tata Steel share price: Tata Steel's September quarter profit soared fourfold to Rs 3,183 crore, driven by robust Indian sales and improved Netherlands operations. Consolidated sales climbed nearly 9% to Rs 58,689 crore, with Ebitda jumping 46%. The company also saw a reduction in UK operating losses and a decrease in tax expenses, signaling a strong financial performance.",
            "pubDate": "2025-11-13T04:40:18.338271"
        },
        {
            "title": "Mamaearth shares surge 9% as co swings to Rs 39 crore profit in Q2",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mamaearth-shares-in-focus-as-q2fy26-pat-turns-positive-at-rs-39-crore/articleshow/125288680.cms",
            "description": "Honasa Consumer, the company behind Mamaearth, has reported a strong financial performance. The company achieved a net profit of Rs 39 crore in the second quarter of FY26. This marks a significant recovery from a net loss in the same period last year. Revenue from operations also saw a healthy year-on-year growth.",
            "pubDate": "2025-11-13T04:40:18.338366"
        },
        {
            "title": "Stocks to buy in 2025 for long term: KEC International, Jindal Stainless among 5 stocks that could give 10-40% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-kec-international-jindal-stainless-among-5-stocks-that-could-give-10-40-return/slideshow/125288589.cms",
            "description": "Brokerage houses remain optimistic on select mid- and large-cap names across sectors, highlighting strong growth potential and reasonable valuations.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-13T04:40:18.338463"
        },
        {
            "title": "Gold prices firm above Rs 1.26 lakh at 3-week high, silver holds strong above 3.5-week peak. What’s driving the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-prices-firm-above-rs-1-26-lakh-at-3-week-high-silver-holds-strong-above-3-5-week-peak-whats-driving-the-rally/articleshow/125291318.cms",
            "description": "Gold and silver prices on the MCX opened higher, defying global sentiment after the US government ended its record shutdown. Strong bullion performance and a softer rate outlook supported the rally, while traders awaited key US data for cues on future Fed policy amid weakening labour market signals.",
            "pubDate": "2025-11-13T05:39:12.465926"
        },
        {
            "title": "Biocon shares jump 3% to hit new 52-week high on $4.5 billion Biologics IPO, merger review",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-shares-jump-3-to-hit-new-52-week-high-on-4-5-billion-biologics-ipo-merger-review/articleshow/125291263.cms",
            "description": "Biocon shares hit a new 52-week high after the company confirmed it is evaluating a potential merger of Biocon Biologics with the parent entity. The $4.5 billion deal is among options under review, including an IPO and share swap, to unlock value and streamline operations.",
            "pubDate": "2025-11-13T05:39:12.466057"
        },
        {
            "title": "Kirloskar Oil Engines, BLS International among 8 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kirloskar-oil-engines-bls-international-among-8-stocks-showing-bullish-rsi-upswing/slideshow/125290809.cms",
            "description": "Eight stocks from the Nifty500 pack that gained over 4% were highlighted in the RSI Trending Up scan on November 12, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-11-13T05:39:12.466163"
        },
        {
            "title": "Tata Motors CV shares slide over 5% in 2 days after solid debut. Buying opportunity or early warning sign?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-cv-shares-slide-over-5-in-2-days-after-solid-debut-buying-opportunity-or-early-warning-sign/articleshow/125291124.cms",
            "description": "Tata Motors (CV) shares fell sharply on Thursday after a strong market debut in the earlier sessions, prompting questions about whether the correction signals profit-taking or a buying opportunity. Analysts remain positive, citing the demerger’s value unlocking, strong freight demand, easing input costs, and the Iveco acquisition as key long-term catalysts for the commercial vehicle business.",
            "pubDate": "2025-11-13T05:39:12.466270"
        },
        {
            "title": "Vodafone Idea shares soar 14% in a month amid AGR relief hopes; time to buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-soar-14-in-a-month-amid-agr-relief-hopes-time-to-buy-now/articleshow/125291043.cms",
            "description": "Vodafone Idea shares have seen a significant rise driven by optimism regarding relief on Adjusted Gross Revenue dues. Global brokerage Citi has set a target price of Rs 14, suggesting a potential upside. The Supreme Court's order allows for a reassessment of AGR dues, opening avenues for financial relief.",
            "pubDate": "2025-11-13T05:39:12.466370"
        },
        {
            "title": "Multibagger smallcap defence stock jumps 9% as Q2 net profit soars over 60% to Rs 49 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-smallcap-defence-stock-jumps-9-as-q2-net-profit-soars-over-60-to-rs-49-crore/articleshow/125291005.cms",
            "description": "Data Patterns India surged after reporting strong Q2 results, with revenue and profit showing significant growth. Despite a margin dip due to a large strategic contract, management expects normal margins ahead. The company maintains healthy growth guidance, supported by a strong order book and positive outlook for FY26.",
            "pubDate": "2025-11-13T05:39:12.466477"
        },
        {
            "title": "Cochin Shipyard shares tumble 8% as Q2 net profit plummets nearly 50% to Rs 101 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cochin-shipyard-shares-tumble-8-as-q2-net-profit-plummets-nearly-50-to-rs-101-crore/articleshow/125290987.cms",
            "description": "Cochin Shipyard shares saw a sharp decline after the PSU reported a steep 48% YoY drop in Q2 net profit to Rs 101 crore, hurt by higher subcontracting costs and provisions, which surged fourfold year-on-year to Rs 21 crore, though they declined 37% sequentially. Revenue slipped 13% YoY, while EBITDA margin plunged to 5.9%.",
            "pubDate": "2025-11-13T05:39:12.466578"
        },
        {
            "title": "Groww shares extend post-listing rally, surge another 5%. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-extend-post-listing-rally-surge-another-5-should-you-invest/articleshow/125290955.cms",
            "description": "Groww’s parent, Billionbrains Garage Ventures, extended its post-listing rally as shares surged another 5%, taking total gains to nearly 38% over the IPO price. Analysts remain optimistic on its scalable business model, digital investing strength, and long-term structural growth story.",
            "pubDate": "2025-11-13T05:39:12.466676"
        },
        {
            "title": "Stephen Miran warns Fed policy is too tight, calls inflation data “backward-looking”",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stephen-miran-warns-fed-policy-is-too-tight-calls-inflation-data-backward-looking/slideshow/125290677.cms",
            "description": "Federal Reserve Governor Stephen Miran believes US monetary policy is excessively tight and risks damaging the labour market. He argued that the Fed is reacting to outdated inflation data that no longer reflects the true economic picture. “To keep policy so tight in response to an artefact of the statistical measurement process will create the labour market weakness we were tasked with avoiding,” he warned. (Source: Reuters)",
            "pubDate": "2025-11-13T05:39:12.466772"
        },
        {
            "title": "The power of consistency: Why stopping SIPs during market volatility could hurt your long-term portfolio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-power-of-consistency-why-stopping-sips-during-market-volatility-could-hurt-your-long-term-portfolio/articleshow/125293108.cms",
            "description": "SIP investments have surged significantly, highlighting their role in fostering investor discipline and overcoming emotional biases. Despite market volatility and concerns over high valuations, continuing SIPs is crucial for long-term wealth creation and compounding. Investors are advised to maintain discipline and avoid timing the market.",
            "pubDate": "2025-11-13T07:21:40.372131"
        },
        {
            "title": "Dalal Street’s middle-order hits record high before Nifty, smallcaps. What’s driving the midcap boom?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-streets-middle-order-hits-record-high-before-nifty-smallcaps-whats-driving-the-midcap-boom/articleshow/125292982.cms",
            "description": "India's midcap stocks are reaching new heights, outperforming larger companies. Strong company earnings and reasonable stock prices are driving this surge. Experts see this as a fundamental shift, not just a temporary trend. Investors are favoring quality midcap companies with good growth and improving finances. This trend is supported by strong domestic investment.",
            "pubDate": "2025-11-13T07:21:40.372261"
        },
        {
            "title": "Thirteen stocks added by 10+ mutual funds in the October 2025 rally up to 85%, 7 rise over 50%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/thirteen-stocks-added-by-10-mutual-funds-in-the-october-2025-rally-up-to-85-7-rally-over-50/slideshow/125292696.cms",
            "description": "In October 2025, mutual funds (MFs) continued to show strong confidence in Indian equities, with net investments totalling around Rs 23,000 crore for the month. According to an analysis by ETMarkets, 30 stocks were added to the portfolios of at least 10 mutual fund schemes during October, an increase from September 2025. Of these 30 stocks, 27 have delivered positive returns so far in FY26, with 13 surging between 40% and 85%. (Data Source: ACE MF | ACE Equity)",
            "pubDate": "2025-11-13T07:21:40.372384"
        },
        {
            "title": "Urban Company shares tumble nearly 30% from record high after stellar IPO. Time to buy or exit?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/urban-company-shares-tumble-nearly-30-from-record-high-after-stellar-ipo-time-to-buy-or-exit/articleshow/125292874.cms",
            "description": "Urban Company shares have fallen nearly 30% from their post-listing high, prompting investor questions about a buying opportunity. Analysts are divided, with some advising caution due to persistent downtrend and others seeing potential for a gradual recovery. The company reported a widened net loss in Q2 FY25 despite a significant revenue increase.",
            "pubDate": "2025-11-13T07:21:40.372490"
        },
        {
            "title": "Advent Hotel shares list at 17% premium following demerger with Valor Estate",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/advent-hotel-shares-list-at-17-premium-following-demerger-with-valor-estate/articleshow/125292284.cms",
            "description": "Shares of Advent Hotels debuted at Rs 310 on the BSE, a 17.2% premium over Valor Estate Ltd’s last close of Rs 264, following its demerger from the parent company. Under the NCLT-approved scheme, Valor shareholders received 1 Advent share for every 10 Valor shares held. 5.39 crore shares were listed on November 13, 2025.",
            "pubDate": "2025-11-13T07:21:40.372591"
        },
        {
            "title": "Rising food prices and weak Yen keep pressure on the BOJ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-food-prices-and-weak-yen-keep-pressure-on-the-boj/slideshow/125292182.cms",
            "description": "Japan’s wholesale prices rose more than expected in October as food and raw material costs remained elevated, keeping pressure on the Bank of Japan to stay alert on inflation risks. (Source: Reuters)",
            "pubDate": "2025-11-13T07:21:40.372689"
        },
        {
            "title": "Indian stocks are the cheapest vs US in nearly 2 decades. Rare bargain or growth warning? 6 takeaways for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-stocks-are-the-cheapest-vs-us-in-nearly-2-decades-rare-bargain-or-growth-warning-6-takeaways-for-investors/articleshow/125291702.cms",
            "description": "Indian stocks are now trading at their cheapest valuation versus US equities in nearly two decades, with the Nifty 50 roughly 20-25% cheaper than the S&P 500. This divergence is driven by the US AI boom boosting its market, while Indian earnings consolidate. Experts are divided on whether this presents a rare buying opportunity or signals slowing growth.",
            "pubDate": "2025-11-13T07:21:40.372804"
        }
    ]
}