{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-05T18:57:56.915820",
    "items": [
        {
            "title": "Unicommerce Esolutions Q1 results: PAT jumps 31% YoY to Rs 3.5 crore, revenue up 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/unicommerce-esolutions-q1-results-pat-jumps-31-yoy-to-rs-3-5-crore-revenue-up-9/articleshow/112929042.cms",
            "description": "Unicommerce Esolutions reported a net profit of Rs 3.5 crore for the quarter ended June 30, 2024, which was up by 31% from Rs 2.7 crore reported by the company in the year ago period.",
            "pubDate": "2024-09-05T18:57:35.846320"
        },
        {
            "title": "FirstCry Q1 results: Cons loss narrows YoY to Rs 57 crore, revenue jumps 17%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/firstcry-q1-results-cons-loss-narrows-yoy-to-rs-57-crore-revenue-jumps-17/articleshow/112928055.cms",
            "description": "Brainbees Solutions, owner of FirstCry, reported a narrower net loss of Rs 57 crore for the quarter ended June 30, 2024, compared to Rs 90 crore a year ago. Revenue rose 17% to Rs 1,652 crore, while EBITDA saw a significant 106% increase. Annual unique transacting customers grew by 15%, and the company expanded its offline presence.",
            "pubDate": "2024-09-05T18:57:35.846440"
        },
        {
            "title": "Square Yards reports 52% YoY growth in Q1 FY25, hits Rs 261 crore revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/square-yards-reports-52-yoy-growth-in-q1-fy25-hits-rs-261-crore-revenue/articleshow/112869750.cms",
            "description": "Square Yards achieved Q1 FY25 revenue of Rs 261 crore (USD 31 million), marking a 52% YoY increase. This growth continues a 12-quarter trend, driven by a 51% rise in Gross Transaction Value. The company forecasts FY25 revenue of Rs 1,506 crore (USD 180 million).",
            "pubDate": "2024-09-05T18:57:35.846540"
        },
        {
            "title": "Oyo clocks net profit of Rs 132 crore in Q1 of FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oyo-clocks-net-profit-of-rs-132-crore-in-q1-of-fy25/articleshow/112869510.cms",
            "description": "Oravel Stays Ltd., the parent company of Oyo, has clocked a net profit for the first quarter of the fiscal year 2025, founder Ritesh Agarwal said in a townhall on Wednesday.",
            "pubDate": "2024-09-05T18:57:35.846633"
        },
        {
            "title": "Take notice! In a muted Q1 season, these 14 companies doubled sales and profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/take-notice-in-a-muted-q1-season-these-14-companies-doubled-sales-and-profits/articleshow/112823853.cms",
            "description": "14 companies with market capitalization exceeding Rs 2,500 crore demonstrated exceptional performance in Q1 2024, doubling their sales and profits. Top performers included Spright Agro and Diamond Power Infrastructure. The broader market saw mixed results with sectors like BFSI and automobile doing well, but oil marketing companies underperforming.",
            "pubDate": "2024-09-05T18:57:35.846731"
        },
        {
            "title": "Q1 results shocker: 40 companies report more than 50% drop in profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q1-results-shocker-40-companies-report-more-than-50-drop-in-profit/articleshow/112727284.cms",
            "description": "The profits of 40 Indian companies have plummeted by more than 50% in the June quarter, primarily due to higher raw material costs and unfavorable base effects. Notable names like Allcargo Logistics and Rajesh Exports saw drastic declines. Analysts suggest cautious investment strategies amid high market valuations and slowing profit growth.",
            "pubDate": "2024-09-05T18:57:35.846829"
        },
        {
            "title": "After 3 straight quarters of losses, these 10 companies cherish profits in Q1. Should you bet?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/after-3-straight-quarters-of-losses-these-10-companies-cherish-profits-in-q1-should-you-bet/articleshow/112699141.cms",
            "description": "India's corporate earnings had a weak start in the first quarter of fiscal year 2025, with subdued revenues and negative profit growth. Despite this, ten companies, such as ASM Technologies and PC Jewellers, returned to profitability. Analysts recommend a careful, stock-specific approach due to elevated valuation risks in mid and small-cap sectors.",
            "pubDate": "2024-09-05T18:57:35.846924"
        },
        {
            "title": "IPO-bound Kalpataru Ltd's net loss narrows to Rs 101 cr in last fiscal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ipo-bound-kalpataru-ltds-net-loss-narrows-to-rs-101-cr-in-last-fiscal/articleshow/112655878.cms",
            "description": "Real estate firm Kalpataru Ltd, which plans to launch its maiden public issue, has posted a consolidated net loss of Rs 100.74 crore during the last financial year on lower income.",
            "pubDate": "2024-09-05T18:57:35.847024"
        },
        {
            "title": "Adani group EBITDA surges 33% in Q1, leverage at multi-year low",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-group-ebitda-surges-33-in-q1-leverage-at-multi-year-low/articleshow/112624978.cms",
            "description": "\"The consistently advancing EBITDA is largely driven by the Group's highly stable and resilient 'core infrastructure' platform, which constitutes over 80 per cent of the portfolio EBITDA and saw a remarkable 41.6 per cent growth year-on-year in Q1,\" it said.",
            "pubDate": "2024-09-05T18:57:35.847128"
        },
        {
            "title": "Railway sector Q1 review: Average PAT decline 16% QoQ, revenue down 24%. What are your cues?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/railway-sector-q1-review-average-pat-decline-16-qoq-revenue-down-24-what-are-your-cues/articleshow/112622152.cms",
            "description": "The railway sector reported an average 16% drop in net profits and a 24% revenue decline for the quarter ending June 30, 2024. Ten out of thirteen companies saw decreased profits, and all experienced revenue declines. Stocks have fallen by up to 32% from their 52-week highs, raising concerns about performance.",
            "pubDate": "2024-09-05T18:57:35.847226"
        },
        {
            "title": "LIC plays the price game for growth, margins take a back seat, for now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lic-plays-the-price-game-for-growth-margins-take-a-back-seat-for-now/articleshow/112616859.cms",
            "description": "LIC, India's largest insurance provider, shifted its growth strategy, focusing on expansion over margins. In Q1 FY25, it reported a 24% rise in value of new business due to a 21% increase in annualized premium equivalent. This strategy led to a rise in non-par segment premiums but a decline in overall margins.",
            "pubDate": "2024-09-05T18:57:35.847319"
        },
        {
            "title": "ReNew Q1 profit falls 87%, shares slip 6% on Nasdaq",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/renew-q1-profit-falls-87-shares-slip-6-on-nasdaq/articleshow/112600947.cms",
            "description": "ReNew Energy Global Plc's shares declined by 6% after announcing an 87% drop in quarterly profit, largely due to revenue losses from sold assets and higher operational costs.",
            "pubDate": "2024-09-05T18:57:35.847412"
        },
        {
            "title": "Ola Electric Q1 Results: Revenue up 32%, loss widens too",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ola-electric-q1-results-revenue-up-32-loss-widens-too/articleshow/112539774.cms",
            "description": "Ola Electric experienced a 32% increase in revenue for the first quarter of FY25, amounting to ₹1,644 crore, while net losses expanded to ₹347 crore. The automotive division saw a 34% boost in total income. The company plans to introduce electric motorcycles on August 15, with deliveries expected in the last quarter of the fiscal year.",
            "pubDate": "2024-09-05T18:57:35.847500"
        },
        {
            "title": "Reliance Infra Q1 Results: Net loss narrows to Rs 69 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-infra-q1-results-net-loss-narrows-to-rs-69-crore/articleshow/112530649.cms",
            "description": "Reliance Infrastructure Ltd on Wednesday said its consolidated net loss narrowed to Rs 69.47 crore in the June 2024 quarter. It had clocked a net loss of Rs 494.83 crore in the year-ago period, the company said in an exchange filing.",
            "pubDate": "2024-09-05T18:57:35.847593"
        },
        {
            "title": "Tencent Q2 Results: Revenue rises on gaming business recovery",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tencent-q2-results-revenue-rises-on-gaming-business-recovery/articleshow/112530603.cms",
            "description": "China's Tencent Holdings reported an 8% rise in second-quarter revenue on Wednesday, driven by a recovery in its gaming business after a launch of a new mobile game in May that got off to a strong start.",
            "pubDate": "2024-09-05T18:57:35.847678"
        },
        {
            "title": "Glenmark Q1 Results: Net profit doubles to Rs 340 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/glenmark-q1-results-net-profit-doubles-to-rs-340-crore/articleshow/112529977.cms",
            "description": "Glenmark Pharma net profit doubled to Rs 340 crore crore in Q1FY25 led by robust sales growth in India and Europe and reduction in finance, depreciation and ammortisation costs.",
            "pubDate": "2024-09-05T18:57:35.847771"
        }
    ]
}