{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-09T03:24:48.299630",
    "items": [
        {
            "title": "Ex-trader investigating Jane Street ends term at Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ex-trader-investigating-jane-street-ends-term-at-sebi/articleshow/124403480.cms",
            "description": "A key SEBI official, Ananth Narayan, who spearheaded the probe into Jane Street Group LLC's alleged market manipulation, is set to depart as his term concludes. The investigation into the US trading firm, accused of exploiting India's stock and derivatives markets, continues as SEBI faces Jane Street in court. This high-profile case, involving significant financial stakes, has garnered global attention.",
            "pubDate": "2025-10-09T03:24:28.841733"
        },
        {
            "title": "Explained: Reliance Industries is India’s most valuable company but why isn’t it No.1 in Nifty50 weight?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-reliance-industries-is-indias-most-valuable-company-but-why-isnt-it-no-1-in-nifty50-weight/articleshow/124403406.cms",
            "description": "Reliance Industries, despite its massive market capitalization, ranks third in Nifty 50 index weight due to its lower free-float shares. Banks like HDFC Bank and ICICI Bank hold higher weights because a larger portion of their stock is available for public trading, influencing the index more significantly.",
            "pubDate": "2025-10-09T03:24:28.841859"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Kaynes Technology, Titan among 4 stocks that could give 17-40% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-kaynes-technology-titan-among-4-stocks-that-could-give-17-40-return/slideshow/124403133.cms",
            "description": "Brokerages remain upbeat on select Indian equities across sectors, signaling confidence in the country’s growth momentum and corporate earnings outlook for the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-10-09T03:24:28.841963"
        },
        {
            "title": "TCS shares in focus ahead of Q2FY26 results today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-ahead-of-q2fy26-results-today/articleshow/124403360.cms",
            "description": "TCS share price: TCS is set to announce its Q2FY26 results later today, with brokerages projecting net profit between Rs 12,346–13,058 crore and revenue of Rs 64,200–65,700 crore. Analysts will track margins, BFSI growth, GenAI adoption, H1-B visa impact, and deal momentum.",
            "pubDate": "2025-10-09T03:24:28.842069"
        },
        {
            "title": "Bonus issue alert: Last day to buy shares of these 7 companies ahead of record date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bonus-issue-alert-last-day-to-buy-shares-of-these-7-companies-ahead-of-record-date/articleshow/124403327.cms",
            "description": "October 9 is the last day to buy shares of seven companies, including Harshil Agrotech, Laxmi Goldorna, and Narmada Macplast, to qualify for upcoming bonus issues. Stocks will trade ex-bonus from October 10, making today the critical cutoff for eligibility.",
            "pubDate": "2025-10-09T03:24:28.842173"
        },
        {
            "title": "Last day to buy Hexaware Technologies, 2 other stocks to qualify for dividends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-hexaware-technologies-2-other-stocks-to-qualify-for-dividends/articleshow/124403230.cms",
            "description": "October 9 is the last day to buy shares of Hexaware Technologies, Rashtriya Chemicals & Fertilizers, and Sacheta Metals to qualify for the announced dividends. Hexaware offers a 575% interim payout, RCF 13.2%, and Sacheta Metals 2.5%, with ex-dividend from October 10.",
            "pubDate": "2025-10-09T03:24:28.842269"
        },
        {
            "title": "RBL Bank among 5 tocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-among-5-tocks-closed-crossing-above-vwap/slideshow/124402910.cms",
            "description": "The closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on October 8, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-10-09T03:24:28.842381"
        },
        {
            "title": "HCL Technologies and 9 other stocks showing Bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcl-technologies-and-9-other-stocks-showing-bullish-rsi-upswing/slideshow/124402866.cms",
            "description": "Ten stocks from the Nifty500 pack were highlighted in the RSI Trending Up scan on October 8, based on data from stockedge.com. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock's price. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-10-09T03:24:28.842483"
        },
        {
            "title": "Negative Breakout: These 9 stocks close cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-9-stocks-close-cross-below-their-200-dmas/slideshow/124402873.cms",
            "description": "In the Nifty200 pack, nine stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on October 8, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-10-09T03:24:28.842578"
        },
        {
            "title": "S&P 500, Nasdaq end higher as tech strength outweighs Fed concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-end-higher-as-tech-strength-outweighs-fed-concerns/articleshow/124402595.cms",
            "description": "Technology shares propelled U.S. stocks to record highs, led by AI megacaps, as investors awaited Federal Reserve minutes for interest rate clues amid a government shutdown. Chip stocks outperformed, while gold prices surged due to geopolitical uncertainty. The Fed minutes revealed a divided committee on rate cuts.",
            "pubDate": "2025-10-09T03:24:28.842671"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 28%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-28-according-to-analysts/articleshow/124402582.cms",
            "description": "When the underlying bias of the market has changed from bearish to bullish, then volatility should be used to enter the stock market. There is no point fearing volatility. One of the reasons why we are working with underlying bullish assumptions is the fact that, unlike the past when the market used to look at immediate quarterly earnings, the focus of the street is on Q3 numbers, rather than Q2 earnings. Now given the fact that a large number of companies are giving positive business updates and showing confidence, there is good enough reason to be positive. ET Screener, powered by Refinitiv’s Stock Report Plus, lists quality stocks with high upside potential over the next 12 months, and having an average recommendation rating of “Buy” or \"Strong Buy\". This predefined screener is only available to ET Prime users.",
            "pubDate": "2025-10-09T03:24:28.842768"
        },
        {
            "title": "Rs 10 lakh to Rs 1 crore! India's oldest gold ETF sparkles with dazzling 950% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-10-lakh-to-rs-1-crore-indias-oldest-gold-etf-sparkles-with-dazzling-950-return/articleshow/124402561.cms",
            "description": "India's oldest gold ETF, Nippon India ETF Gold BeES, has delivered an impressive 950% return since 2007, transforming a Rs 10 lakh investment into over Rs 1 crore. This remarkable performance coincides with gold's record-breaking surge globally and domestically, driven by inflation, geopolitical concerns, and de-dollarization trends.",
            "pubDate": "2025-10-09T03:24:28.842862"
        },
        {
            "title": "GIFT Nifty up 60 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124402308.cms",
            "description": "Indian markets closed flat on Wednesday following profit booking after an initial strong start. Investors are now awaiting US jobless claims data, with analysts anticipating a range-bound market influenced by global cues and Q2 earnings. The India VIX saw a slight increase, indicating rising market fear.",
            "pubDate": "2025-10-09T03:24:28.842961"
        },
        {
            "title": "Stocks in news: TCS, PVR Inox, Senco Gold, JSW Cement, Maruti Suzuki",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-tcs-pvr-inox-senco-gold-jsw-cement-maruti-suzuki/articleshow/124402285.cms",
            "description": "Indian markets saw a slight dip after recent gains, with all eyes now on TCS's Q2 earnings report. Analysts anticipate further consolidation with a positive outlook. Key stocks in focus include TCS, PVR Inox's new dine-in cinema concept, Lupin's US expansion, Maruti Suzuki's service network growth, JSW Cement's new unit, and Senco Gold's revenue increase.",
            "pubDate": "2025-10-09T03:24:28.843064"
        },
        {
            "title": "Asian shares rise after US gains driven by AI-linked companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-rise-after-us-gains-driven-by-ai-linked-companies/articleshow/124402260.cms",
            "description": "Asian shares opened higher, mirroring Wall Street's gains driven by AI-linked companies. Gold and oil saw slight declines following a reported Middle East peace deal. Investors are closely watching China's market reopening after a holiday break, balancing AI enthusiasm against cautious consumer spending data.",
            "pubDate": "2025-10-09T03:24:28.843155"
        },
        {
            "title": "Adani Enterprises to raise up to Rs 3,000 cr via NCDs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-to-raise-up-to-rs-3000-cr-via-ncds/articleshow/124402226.cms",
            "description": "The company aims to spend ₹36,000 crore in capital expenditure in the current fiscal. Adani Enterprises first tapped the domestic NCD market last year, where it raised ₹800 crore. This was followed by fund raising of ₹1,000 crore in July this year.",
            "pubDate": "2025-10-09T03:24:28.843249"
        }
    ]
}