{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-05T16:46:52.963509",
    "items": [
        {
            "title": "EV poster boy Ola’s 64% crash is worst among peers - stock now half its IPO price. Is the selloff over yet?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ev-poster-boy-olas-64-crash-is-worst-among-peers-stock-now-half-its-ipo-price-is-the-selloff-over-yet/articleshow/125780131.cms",
            "description": "Ola Electric shares plunged to a new lifetime low, losing over half their IPO value and significantly underperforming the booming auto sector. The company faces declining market share, persistent losses, and controversies. Analysts see continued downside, though some suggest a wait-and-watch approach for investors with high risk appetite, citing potential for a rebound similar to other beaten-down stocks.",
            "pubDate": "2025-12-05T04:28:41.838995"
        },
        {
            "title": "Sensex, Nifty off to flat start as Dalal Street braces for RBI rate decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-off-to-flat-start-as-dalal-street-braces-for-rbi-rate-decision/articleshow/125780146.cms",
            "description": "Indian stock markets began Friday trading with caution. The Sensex and Nifty showed little movement as investors awaited the Reserve Bank of India's policy announcement. This comes after a brief recovery on Thursday. Strong economic growth and a weakening rupee are influencing expectations. The Sensex saw a small gain, and the Nifty also opened higher.",
            "pubDate": "2025-12-05T04:28:41.839129"
        },
        {
            "title": "Bharti Airtel among 4 Nifty stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-among-4-nifty-stocks-showing-bullish-rsi-upswing/slideshow/125779519.cms",
            "description": "On December 4, in the Nifty50 pack, four stocks appeared in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal occurs when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index (RSI) is rising, suggesting strengthening price momentum. This may signal potential upward movement and help traders identify buying opportunities.",
            "pubDate": "2025-12-05T04:28:41.839234"
        },
        {
            "title": "IndiGo shares drop amid flight fiasco. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-amid-large-scale-flight-cancellations-regulatory-exemption-requests-should-you-buy-sell-or-hold/articleshow/125780001.cms",
            "description": "IndiGo is facing significant operational disruptions, leading to over 300 daily flight cancellations due to new pilot duty-hour regulations. The airline has requested a two-month exemption from specific night duty rules from the DGCA, aiming to restore stable operations by February 10, 2026.",
            "pubDate": "2025-12-05T04:28:41.839332"
        },
        {
            "title": "HUL demerger record date today: What it means for shareholders & key details to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-demerger-record-date-today-what-it-means-for-shareholders-key-details-to-know/articleshow/125779947.cms",
            "description": "Hindustan Unilever's ice-cream business, Kwality Wall's, is officially spinning off today, December 5th, with shareholders set to receive new shares. This strategic move aims to unlock value by creating a standalone entity for its rapidly growing ice-cream vertical.  The newly formed company is expected to list on the stock exchange in February 2026.",
            "pubDate": "2025-12-05T04:28:41.839428"
        },
        {
            "title": "ITC Hotels shares in focus as BAT plans up to 15.5% stake sale",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-shares-in-focus-as-bat-plans-up-to-15-5-stake-sale/articleshow/125779687.cms",
            "description": "ITC Hotels shares will be in focus after British American Tobacco (BAT) announced plans to sell up to a 15.3% stake. BAT, which acquired the stake during ITC’s hotel business demerger, aims to use the proceeds to reduce leverage and meet its 2026 financial targets. ITC Hotels became a separately listed entity in January 2025.",
            "pubDate": "2025-12-05T04:28:41.839526"
        },
        {
            "title": "HUL shares in focus on record date for ice cream business demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-in-focus-on-record-date-for-ice-cream-business-demerger/articleshow/125779576.cms",
            "description": "Hindustan Unilever Ltd (HUL) has set December 5, 2025, as the record date for the demerger of its ice-cream business into Kwality Wall’s (India) Limited (KWIL). This strategic move aims to unlock value by separating the high-growth ice-cream segment. The demerger is scheduled to be effective December 1, 2025, with KWIL expected to list in February 2026.",
            "pubDate": "2025-12-05T04:28:41.839627"
        },
        {
            "title": "RIL shares in focus as S&P Global upgrades rating to 'A-' on cash flow stability",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-shares-in-focus-as-sp-global-upgrades-rating-to-a-on-cash-flow-stability/articleshow/125779465.cms",
            "description": "Reliance Industries' credit rating has been upgraded to 'A-' by S&P Global Ratings, citing improved cash flow stability and a strong earnings outlook driven by its consumer-facing businesses. The agency anticipates prudent financial management and expects earnings growth to outpace high capital expenditure, maintaining a stable outlook.",
            "pubDate": "2025-12-05T04:28:41.839722"
        },
        {
            "title": "Purple Wave Infocom shares to debut today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/purple-wave-infocom-shares-to-debut-today-heres-what-gmp-indicates/articleshow/125778875.cms",
            "description": "Purple Wave Infocom is set to debut on the BSE SME platform today after a successful IPO, raising Rs 31.45 crore. The digital PRO AV solutions provider saw strong investor demand, particularly from institutional buyers. Despite neutral pre-listing grey market sentiment, the company's robust financial growth and oversubscription across all investor categories will be closely watched for its market debut.",
            "pubDate": "2025-12-05T04:28:41.839833"
        },
        {
            "title": "Logiciel Solutions IPO listing today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/logiciel-solutions-ipo-listing-today-check-gmp-ahead-of-debut/articleshow/125778851.cms",
            "description": "Logiciel Solutions' Rs 40 crore IPO, which opened on November 28 and closed on December 2, is set to debut on the BSE SME platform on December 5. The issue saw selective investor participation, with retail investors driving subscriptions. Grey market activity indicates neutral expectations for the listing day performance.",
            "pubDate": "2025-12-05T04:28:41.839940"
        },
        {
            "title": "Exato Technologies shares to list today. GMP hints at maximum premium on debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/exato-technologies-shares-to-list-today-gmp-hints-at-maximum-premium-on-debut/articleshow/125778814.cms",
            "description": "Exato Technologies is set to list on the BSE SME platform. The company's initial public offering received an overwhelming response from investors. The issue was subscribed over 947 times. High net-worth individuals and retail investors showed strong interest. The grey market premium indicates robust listing expectations. Exato Technologies is a technology transformation company.",
            "pubDate": "2025-12-05T04:28:41.840037"
        },
        {
            "title": "Positive Breakout: These 9 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-9-stocks-cross-above-their-200-dmas/slideshow/125778729.cms",
            "description": "In the Nifty500 pack, nine stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on December 4, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-12-05T04:28:41.840132"
        },
        {
            "title": "Sebi bans influencer Avadhut Sathe from stock market and orders return of Rs 601 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-bans-influencer-avadhut-sathe-from-stock-market-and-orders-return-of-rs-601-crore/articleshow/125778677.cms",
            "description": "Sebi has cracked down on Avadhut Sathe and his firm, Avadhut Sathe Trading Academy. They are banned from the stock market and must return Rs 601.37 crore. This money was collected from over 3.37 lakh investors. Sathe provided unregistered investment advice and stock tips. Sebi's investigation covered activities from July 2017 to October 2025.",
            "pubDate": "2025-12-05T04:28:41.840223"
        },
        {
            "title": "US stocks end flat, supported by Fed hopes but dragged by Amazon",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-flat-supported-by-fed-hopes-but-dragged-by-amazon/articleshow/125778586.cms",
            "description": "U.S. stocks closed near unchanged as investors assessed mixed labor market data and anticipated a Federal Reserve interest rate cut. Initial jobless claims fell to a three-year low, though the November payrolls report remains pending. Markets are pricing in an 87% chance of a 25 basis point cut this month.",
            "pubDate": "2025-12-05T04:28:41.840311"
        },
        {
            "title": "GIFT Nifty down 10 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125778330.cms",
            "description": "Indian markets saw a slight recovery on Thursday, ending a four-day losing streak. However, gains were limited by foreign investor selling and a weakening rupee. Analysts anticipate continued market consolidation. A potential Reserve Bank of India rate cut could provide a short-term boost. The India VIX, a fear gauge, saw a decline.",
            "pubDate": "2025-12-05T04:28:41.840404"
        },
        {
            "title": "Stocks in news: HUL, IndiGo, ITC Hotels, Zaggle Prepaid, Star Health",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-hul-indigo-itc-hotels-zaggle-prepaid-star-health/articleshow/125778309.cms",
            "description": "Markets ended marginally higher on Thursday, taking a breather after recent declines, with the rupee's weakness and caution ahead of the MPC policy outcome persisting. HUL's ice-cream demerger, IndiGo's pilot rest duty waiver, Star Health's claim rejection, ITC Hotels' stake sale by BAT, and Zaggle Prepaid's acquisition of Rivpe Technology were key news drivers.",
            "pubDate": "2025-12-05T04:28:41.840495"
        },
        {
            "title": "US affordability squeeze eases slightly as key delinquency metrics stabilize",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-affordability-squeeze-eases-slightly-as-key-delinquency-metrics-stabilize/articleshow/125781712.cms",
            "description": "Despite fears of an affordability crisis, US consumer delinquency indicators show surprising resilience. While some metrics are elevated, credit card delinquencies are stabilizing, and overall debt servicing remains historically low. Strong wage growth offers a buffer, suggesting household finances might be weathering the storm better than anticipated, though student loan defaults pose a risk.",
            "pubDate": "2025-12-05T05:41:23.696387"
        },
        {
            "title": "CAMS shares plunge 41% in early trade! Here’s why investors shouldn’t worry",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cams-shares-plunge-41-in-early-trade-heres-why-investors-shouldnt-worry/articleshow/125780976.cms",
            "description": "CAMS shares dropped 41% in early trade as the stock began trading ex-split following its 1:5 split, reducing the face value from Rs 10 to Rs 2. The steep fall is a routine technical adjustment reflecting the increased share count, with no impact on fundamentals. The split aims to boost liquidity and enhance retail participation.",
            "pubDate": "2025-12-05T05:41:23.696503"
        },
        {
            "title": "Biocon among 6 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/biocon-among-6-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/125780708.cms",
            "description": "There was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% on December 4 as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-05T05:41:23.696592"
        },
        {
            "title": "RBI Policy: Rate-sensitive banking, NBFC, auto and realty stocks gain up to 2% after 25 bps repo rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-policy-rate-sensitive-banking-nbfc-auto-and-realty-stocks-gain-up-to-2-after-25-bps-repo-rate-cut/articleshow/125780929.cms",
            "description": "Banking, NBFC, auto, and realty stocks saw gains of up to 2% on Friday following the Reserve Bank of India's 25 basis point repo rate cut. This move, aligning with expectations, was driven by record-low retail inflation and a stable price outlook, aiming to bolster economic growth.",
            "pubDate": "2025-12-05T05:41:23.696679"
        },
        {
            "title": "Are trillion-dollar valuations for Nvidia and AI giants built on fairy tale? Aswath Damodaran decodes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/are-trillion-dollar-valuations-for-nvidia-and-ai-giants-built-on-fairy-tale-aswath-damodaran-decodes/articleshow/125780915.cms",
            "description": "Valuation guru Aswath Damodaran questions if trillion-dollar market caps, particularly Nvidia's, are driven by genuine performance or investor fantasy. He uses a 'possible, plausible, probable' framework to assess Nvidia's revenue needs and warns of the 'Big Market Delusion' in AI, where aggregate valuations outstrip realistic revenue potential.",
            "pubDate": "2025-12-05T05:41:23.696760"
        },
        {
            "title": "Global hedge funds outpace major indexes with 15% returns in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-hedge-funds-outpace-major-indexes-with-15-returns-in-2025/articleshow/125780846.cms",
            "description": "Global hedge funds are ending 2025 on a strong footing, delivering nearly 15% returns through November, driven by stock pickers, quant strategies, and a standout rally in healthcare. While long-short equity funds outperformed major U.S. indices, TMT-focused funds lagged due to a tech sell-off. Regionally, managers remained bullish on North America, added exposure to Japan, and pared positions in Europe and Hong Kong.",
            "pubDate": "2025-12-05T05:41:23.696847"
        },
        {
            "title": "India Cements among 5 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-cements-among-5-stocks-closed-crossing-above-vwap/slideshow/125780544.cms",
            "description": "The closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price) on December 4, and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-12-05T05:41:23.696929"
        },
        {
            "title": "Nifty to hit 29,000 in 2026, BofA lists 7 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-to-hit-29000-in-2026-bofa-lists-7-reasons-why/slideshow/125780416.cms",
            "description": "Bank of America Securities expects the Nifty 50 to reach 29,000 by December 2026, an 11.4% upside, driven entirely by earnings growth rather than valuation re-rating, as the index already trades near its +1SD valuation band. The brokerage said large-caps will continue to outperform while domestic flows hold steady. BofA also flagged a supportive macro backdrop with scope for modest growth acceleration in FY27. Here are the seven factors likely to push the index higher:",
            "pubDate": "2025-12-05T05:41:23.697011"
        },
        {
            "title": "SpiceJet shares jump 9% as IndiGo turbulence hits sector. GMR Airports slips 2% on travel chaos",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/spicejet-shares-jump-9-as-indigo-turbulence-hits-sector-gmr-airports-slips-2-on-travel-chaos/articleshow/125783205.cms",
            "description": "SpiceJet rose sharply as massive IndiGo flight disruptions boosted sentiment for the stock. IndiGo’s operational troubles, driven by crew shortages and new duty-hour rules, triggered over 400 cancellations, weighing on InterGlobe Aviation shares and shifting momentum across aviation-linked stocks.",
            "pubDate": "2025-12-05T07:17:13.547708"
        },
        {
            "title": "Wockhardt shares bounce back 4% after two-day slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wockhardt-shares-bounce-back-4-after-two-day-slump/articleshow/125782817.cms",
            "description": "Wockhardt shares on December 1 jumped 19% after the US FDA accepted the company’s New Drug Application for Zaynich, its first-in-class antibiotic. But the rally cooled over the next two days as investors booked profits, leading to back-to-back 5% drops.",
            "pubDate": "2025-12-05T07:17:13.547824"
        },
        {
            "title": "HCC shares crack over 8% on record date for Rs 1,000 crore rights issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hcc-shares-crack-over-8-on-record-date-for-rs-1000-crore-rights-issue/articleshow/125782151.cms",
            "description": "Hindustan Construction Company (HCC) shares dropped as the stock turned ex-rights ahead of its ₹999.99-crore rights issue. The company will issue up to 79.99 crore shares at ₹12.50 each, in a ratio of 277 rights shares for every 630 held. The offer opens on December 12 and closes on December 22, with rights renunciation allowed until December 17 (on-market) and December 19 (off-market).",
            "pubDate": "2025-12-05T07:17:13.548043"
        },
        {
            "title": "Traders ignore Kaynes Tech clarification on governance concerns as shares crash another 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/traders-ignore-kaynes-tech-clarification-on-governance-concerns-as-shares-crash-another-6/articleshow/125782079.cms",
            "description": "Kaynes Technology shares fell sharply on Friday as investors remained unconvinced by the company’s detailed clarification on governance and accounting concerns flagged by Kotak and Investec. Despite management assurances, issues around related-party disclosures, working capital stress, and reliance on acquisitions continued to weigh on sentiment.",
            "pubDate": "2025-12-05T07:17:13.548144"
        },
        {
            "title": "Young shoppers fuel growth as brands turn to AI amid tariff pressures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/young-shoppers-fuel-growth-as-brands-turn-to-ai-amid-tariff-pressures/articleshow/125781830.cms",
            "description": "Young consumers are boosting sales for brands like Warby Parker, Tapestry, and The Honest Company. Despite higher prices, younger shoppers are still buying essential items and accessories. Artificial intelligence is also improving company efficiency and profits. Executives shared these insights at the Reuters NEXT conference, looking ahead to 2026. This trend offers a positive outlook for brands navigating economic challenges.",
            "pubDate": "2025-12-05T07:17:13.548262"
        },
        {
            "title": "European shares steady after three-day rally; focus on US inflation",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-steady-after-three-day-rally-focus-on-us-inflation/articleshow/125784841.cms",
            "description": "European stock markets showed stability on Friday, aiming for a weekly gain. Investors are keenly watching crucial US inflation figures. This data could shape the Federal Reserve's decisions on interest rates. Basic resources and industrial stocks saw significant increases. Swiss Re shares dropped after its 2026 targets fell short. Ocado's stock surged on a payment from Kroger.",
            "pubDate": "2025-12-05T08:32:02.963539"
        },
        {
            "title": "Japan's Nikkei loses ground as investor focus shifts to BOJ, Fed meetings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-loses-ground-as-investor-focus-shifts-to-boj-fed-meetings/articleshow/125784799.cms",
            "description": "Japan's Nikkei share average lost ground on Friday, pausing after a recent rally, as expectations of rising domestic interest rates weighed on sentiment.",
            "pubDate": "2025-12-05T08:32:02.963663"
        },
        {
            "title": "From Boom to Gloom: 10 multibagger stocks of 2024 fall up to 68% in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-boom-to-gloom-10-multibagger-stocks-of-2024-fall-up-to-68-in-2025/slideshow/125784658.cms",
            "description": "The stock market can be a rollercoaster, and last year’s multibaggers are proving it once again. Around 40 stocks that delivered spectacular returns in 2024—doubling or even tripling investor wealth—have now seen their fortunes reverse, falling more than 25% this year.Focusing on strong names, we filtered companies with a current market capitalization above Rs 2,500 crore, identifying stocks that were popular last year and still carry substantial market weight. From this list, we highlighted 10 major laggards that underwent sharp corrections, with share prices dropping between 40% and 68% after spectacular gains in 2024. These stocks, once investor darlings, now offer a cautionary tale of how quickly market sentiment can shift—even for high-flying companies. (Data Source: ACE Equity).",
            "pubDate": "2025-12-05T08:32:02.963774"
        },
        {
            "title": "5 deeper stress signals for Nifty investors even as RBI cuts rates on 'Goldilocks' phase",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-deeper-stress-signals-for-nifty-investors-even-as-rbi-cuts-rates-on-goldilocks-phase/articleshow/125784730.cms",
            "description": "The RBI’s 25 bps rate cut and aggressive liquidity infusion signal rising stress beneath India’s “Goldilocks” growth narrative. Despite record-high GDP prints, weak nominal growth, a sliding rupee, persistent FII outflows and narrow market breadth reveal deeper cracks that Nifty investors must track even as policy support strengthens.",
            "pubDate": "2025-12-05T08:32:02.963883"
        },
        {
            "title": "RBI MPC impact: Rupee slips below 90 versus dollar after 25 bps repo rate cut. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-mpc-impact-rupee-slips-below-90-versus-dollar-after-25-bps-repo-rate-cut-heres-why/articleshow/125785268.cms",
            "description": "The rupee weakened by 18 paise to slip past 90 against the US dollar after the RBI cut the repo rate by 25 bps to 5.25%, triggering a drop in yields and selling pressure. Analysts expect the currency to trade between 89.75 and 90.25 for the day. The RBI’s dovish stance and new liquidity measures — including a ₹1 lakh crore OMO and a three-year dollar–rupee swap — are seen as negative for the rupee in the near term.",
            "pubDate": "2025-12-05T08:52:16.980125"
        },
        {
            "title": "RBI slashes repo rate by 25 bps. Analysts break down what this may mean for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-slashes-repo-rate-by-25-bps-analysts-break-down-what-this-may-mean-for-investors/articleshow/125785242.cms",
            "description": "The RBI cut the repo rate by 25 bps to 5.25%, citing softer inflation and stronger growth. Analysts see the move as aligned with data, supportive of credit and bonds, and aided by liquidity measures. While NIM impact should be limited, the RBI retains flexibility for future policy shifts.",
            "pubDate": "2025-12-05T08:52:16.980280"
        },
        {
            "title": "Avadhut Sathe Trading Academy denies Sebi charges, says it is only an educational platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/avadhut-sathe-trading-academy-denies-sebi-charges-says-it-is-only-an-educational-platform/articleshow/125785431.cms",
            "description": "Avadhut Sathe Trading Academy (ASTA) has rejected Sebi’s allegations that it offered unregistered investment advice, saying it only provides educational training. This comes a day after Sebi barred founder Avadhut Sathe and ordered the academy to halt programmes that the regulator said involved paid live sessions and stock-specific trading calls.",
            "pubDate": "2025-12-05T09:01:15.086008"
        },
        {
            "title": "Sebi order against Avadhut Sathe: What was the wrongdoing and what the order means",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-order-against-avadhut-sathe-what-was-the-wrongdoing-and-what-the-order-means/articleshow/125785397.cms",
            "description": "Sebi has barred financial influencer Avduth Sathe after determining that his academy was providing unregistered investment advice. The regulator found the platform offered live trading sessions with specific buy/sell recommendations and trade levels, effectively acting as an investment adviser and research analyst without authorization.",
            "pubDate": "2025-12-05T09:01:15.086117"
        },
        {
            "title": "Cloudflare Down: Zerodha, Groww and other major stocker broker websites down as Internet service provider goes under maintenance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cloudflare-down-zerodha-groww-and-other-major-stocker-broker-websites-down-as-internet-service-provider-goes-under-maintenance/articleshow/125785802.cms",
            "description": "Zerodha, Groww down: Domestic platforms Zerodha, Groww and Angel One were hit by service disruptions after the US-based internet services provider Cloudflare experienced a major outage on Friday.",
            "pubDate": "2025-12-05T09:30:09.256719"
        },
        {
            "title": "F&O Radar| Deploy Short Strangle in Nifty to capitalize on a range-bound market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-short-strangle-in-nifty-to-capitalize-on-a-range-bound-market/articleshow/125785470.cms",
            "description": "Nifty hit a new high but quickly faced selling pressure, signalling fading upward momentum. Technical analysis highlights a key support zone between 25,840 and 25,900 and resistance around 26,300–26,350, suggesting a range-bound phase ahead. Experts recommend a Short Strangle strategy to benefit from time decay as long as Nifty remains within this consolidation band.",
            "pubDate": "2025-12-05T09:30:09.256845"
        },
        {
            "title": "Top 9 stocks where promoters cut pledges in Q2 FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-9-stocks-where-promoters-cut-pledges-in-q2-fy26/slideshow/125785630.cms",
            "description": "\"Promoter Decreasing Pledge\" refers to a situation where company promoters reduce the portion of their shares pledged as collateral for loans or financial purposes. In the Nifty500, we have highlighted the top nine stocks with a decrease in promoter pledge during the September '25 quarter compared to the June '25 quarter, according to StockEdge promoter holding pledge scan.This usually indicates enhanced financial stability or a reduced dependence on borrowing, which is viewed as a positive signal for investors. It suggests that promoters are in a more robust position, reflecting increased confidence in the company's financial health and potentially boosting investor trust.",
            "pubDate": "2025-12-05T09:30:09.256949"
        },
        {
            "title": "Market Wrap: Sensex up 447 pts, Nifty above 26,150 as rate-sensitive stocks rally after RBI cut repo rate",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-up-447-pts-nifty-above-26150-as-rate-sensitive-stocks-rally-after-rbi-cut-repo-rate/articleshow/125786831.cms",
            "description": "Indian stock markets surged on Friday, with the Sensex and Nifty closing higher after the Reserve Bank of India's 25 basis point policy rate cut. Financial and auto stocks, keenly watching interest rate shifts, spearheaded the rally, reversing an earlier subdued trading session. The Sensex gained 447 points, while the Nifty 50 climbed 153 points, reflecting positive investor sentiment.",
            "pubDate": "2025-12-05T10:45:06.542511"
        },
        {
            "title": "NBFC stocks: 1 advantage is good enough, but is also a must-have; 6 stocks from the NBFC space with upside potential of up to 31%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbfc-stocks-1-advantage-is-good-enough-but-is-also-a-must-have-6-stocks-from-the-nbfc-space-with-upside-potential-of-up-to-31/articleshow/125785778.cms",
            "description": "On a day when the RBI’s Monetary Policy Committee, or MPC, unexpectedly cut the repo rate by 25 basis points, it is no surprise that the market focus was on the financial services sector. Now, though much of the attention is on the banks, where the cut will have an even greater impact is with the NBFCs. Not all NBFCs, but some of them. Those that have learnt their lessons and benefitted from the regulatory tightening of the past few years. And these have mostly been NBFCs with pedigree and a concern for their and their parents’ reputations.",
            "pubDate": "2025-12-05T10:54:10.830471"
        },
        {
            "title": "Gainers & Losers: Indigo, Kaynes Technology among 6 stocks that hogged limelight on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-indigo-kaynes-technology-among-6-stocks-that-hogged-limelight-on-friday/slideshow/125788540.cms",
            "description": "",
            "pubDate": "2025-12-05T12:31:08.966681"
        },
        {
            "title": "Cloudflare outage: Nithin Kamath apologises for Kite disruption, recommends WhatsApp backup to exit trades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cloudflare-outage-nithin-kamath-apologises-for-kite-disruption-recommends-whatsapp-backup-to-exit-trades/articleshow/125789808.cms",
            "description": "A Cloudflare outage disrupted trading platforms including Zerodha, Groww and Angel One. Nithin Kamath apologised and highlighted risks of dependence on single infrastructure. Zerodha activated its independent WhatsApp-based Kite Backup system to help users exit positions during the downtime.",
            "pubDate": "2025-12-05T13:09:51.688464"
        },
        {
            "title": "Tenneco Clean Air posts first results after listing: Q2 PAT up 10% YoY to Rs 150 cr, revenue rises 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tenneco-clean-air-posts-first-results-after-listing-q2-pat-up-10-yoy-to-rs-150-cr-revenue-rises-10/articleshow/125790582.cms",
            "description": "Tenneco Clean Air India reported a 10% YoY profit rise to ₹150 crore and nearly 10% revenue growth in its first post-listing quarter. EBITDA margins stayed strong, while a ₹9,840-crore lifetime order book boosted long-term visibility despite sequential profit moderation.",
            "pubDate": "2025-12-05T14:36:06.650653"
        },
        {
            "title": "US stocks subdued as investors await key inflation report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-subdued-as-investors-await-key-inflation-report/articleshow/125791278.cms",
            "description": "Wall Street's main indexes had a subdued open on Friday as investors avoided large bets and awaited a long-delayed key inflation report that could shape the Federal Reserve's policy path.",
            "pubDate": "2025-12-05T14:48:24.150834"
        },
        {
            "title": "NHAI gets Sebi's in-principle approval to register RIIT as InvIT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nhai-gets-sebis-in-principle-approval-to-register-riit-as-invit/articleshow/125791463.cms",
            "description": "Markets regulator Sebi has granted in-principle approval to the registration of 'Raajmarg Infra Investment Trust' (RIIT) as an Infrastructure Investment Trust (InvIT) and will get the final nod after it meets specific requirements during the next six months, an official statement said on Friday.",
            "pubDate": "2025-12-05T15:37:22.995316"
        },
        {
            "title": "Dabur receives 'no adverse observations' from BSE on merger of Sesa Care",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dabur-receives-no-adverse-observations-from-bse-on-merger-of-sesa-care/articleshow/125791958.cms",
            "description": "Home-grown FMCG firm Dabur on Friday said it has received an observation letter with \"no adverse observations\" from the BSE over its Scheme of Amalgamation of Sesa Care.",
            "pubDate": "2025-12-05T15:57:19.774137"
        },
        {
            "title": "ITC Hotels block deals: HCL Capital snaps up Rs 2,998 crore worth shares; ADIA, Morgan Stanley join marquee buyers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-hotels-block-deals-hcl-capital-snaps-up-rs-2998-crore-worth-shares-adia-morgan-stanley-join-marquee-buyers/articleshow/125792192.cms",
            "description": "HCL Capital Private Limited emerged as the largest acquirer of British American Tobacco's (BAT) stake in ITC Hotels, buying 14.58 crore shares for Rs 2,998 crore. Several other marquee investors also took significant stakes in the Rs 3,856 crore block deals. BAT stated the funds will aid its transition to a target leverage range.",
            "pubDate": "2025-12-05T16:46:52.146355"
        }
    ]
}