{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-28T04:34:08.957454",
    "items": [
        {
            "title": "Aditya Birla Capital shares in focus as RBI grants in-principle approval for payment aggregator license",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-capital-shares-in-focus-as-rbi-grants-in-principle-approval-for-payment-aggregator-license/articleshow/123554613.cms",
            "description": "Aditya Birla Capital's subsidiary, Aditya Birla Capital Digital, has received in-principle authorisation from the Reserve Bank of India to operate as an online payment aggregator. This approval allows the company to strengthen its presence in India's digital payments ecosystem, providing seamless payment aggregation services. The move is expected to enhance Aditya Birla Capital's competitive positioning in the financial services sector.",
            "pubDate": "2025-08-28T03:11:02.735148"
        },
        {
            "title": "Zee Entertainment shares in focus after Chief Growth Officer Ashish Sehgal steps down",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/zee-entertainment-shares-in-focus-after-chief-growth-officer-ashish-sehgal-steps-down/articleshow/123554370.cms",
            "description": "Zee Entertainment Enterprises faces a leadership transition as Ashish Sehgal, Chief Growth Officer for Ad Sales, Broadcast & Digital, resigns after two decades. His departure occurs as Zee focuses on revenue growth in a competitive market. The company has elevated Laxmi Shetty to Head of Advertisement Revenue following Sehgal's exit.",
            "pubDate": "2025-08-28T03:11:02.735271"
        },
        {
            "title": "​​Positive Breakout: These 8 stocks close cross above their 200 DMAs​",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-8-stocks-close-cross-above-their-200-dmas/slideshow/123553985.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, eight stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on August 26, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-08-28T03:11:02.735399"
        },
        {
            "title": "NBCC, Zee Entertainment, among 29 other stocks go ex-dividend today. Last day to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nbcc-zee-entertainment-among-29-other-stocks-go-ex-dividend-today-last-day-to-buy/articleshow/123554289.cms",
            "description": "Investors eyeing dividend income faced a deadline. Many stocks, such as NBCC India and Zee Entertainment, traded ex-dividend. NBCC announced a final dividend. Zee Entertainment also declared a significant dividend. Other companies across various sectors also rewarded shareholders. These included Alfred Herbert India, Asian Hotels East, and Engineers India. Missing the cut-off means ineligibility for payouts.",
            "pubDate": "2025-08-28T03:11:02.735507"
        },
        {
            "title": "IndiGo shares in focus as Rakesh Gangwal Family plans 3.1% stake sale via block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-as-rakesh-gangwal-family-plans-3-1-stake-sale-via-block-deal/articleshow/123554170.cms",
            "description": "The latest stake sale in InterGlobe Aviation is part of a phased dilution plan first outlined in 2022, when Rakesh Gangwal signaled his intention to step away from the airline business. Since then, the family has steadily pared holdings through a series of transactions. Between 2023 and May 2025, the Gangwals executed five major stake sales, offloading more than 9% in 2025 alone and raising over Rs 12,900 crore.",
            "pubDate": "2025-08-28T03:11:02.735608"
        },
        {
            "title": "Last day to buy the shares of smallcap stock to qualify for 4:1 bonus issue as record date approaches",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-the-shares-of-smallcap-stock-to-qualify-for-41-bonus-issue-as-record-date-approaches/articleshow/123547449.cms",
            "description": "The ex-date is crucial for investors since only those holding shares before the ex-date are eligible for the bonus allotment. Transactions made today, August 28, will reflect in the shareholders’ demat accounts before the ex-date, thus qualifying them for the entitlement.",
            "pubDate": "2025-08-28T03:11:02.735708"
        },
        {
            "title": "S&P 500 notches record close; traders turn to Nvidia results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-notches-record-close-traders-turn-to-nvidia-results/articleshow/123553530.cms",
            "description": "The S&P 500 achieved a record high close ahead of Nvidia's quarterly results, a key event testing the AI rally's valuation. While Nvidia's stock dipped slightly, its significant S&P 500 weighting makes its financial performance crucial. Investors are also monitoring potential interest rate cuts and political developments, including Trump's attempt to replace a Federal Reserve Governor.",
            "pubDate": "2025-08-28T03:11:02.735800"
        },
        {
            "title": "US futures, Nvidia drop after chipmaker’s outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-futures-nvidia-drop-after-chipmakers-outlook/articleshow/123553511.cms",
            "description": "US equity futures and Nvidia shares declined after a disappointing sales forecast. This raised concerns about the AI spending boom. Hong Kong and Chinese stocks also weakened. Meituan warned of losses due to competition with Alibaba. Mexico plans to increase tariffs on China. Indian markets will be watched as new tariffs on Indian goods take effect.",
            "pubDate": "2025-08-28T03:11:02.735891"
        },
        {
            "title": "For ‘some’ investors, a crisis is an opportunity: 5 large-caps from different sectors with an upside potential of up to to 32%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-some-investors-a-crisis-is-an-opportunity-5-large-caps-from-different-sectors-with-an-upside-potential-of-up-to-to-32/articleshow/123553363.cms",
            "description": "Here’s what you will now often hear on the street: With the additional 25% Trump tariff kicking in, we are in unprecedented times; job losses, unemployment have risen in some sectors. There is and will be no dearth of lobbyists who will plant the news here and there. Now, when was the last time you heard something like this? When there was tension on the border with Pakistan? When Israel bombed Iran? When the Adani-Hindenburg crisis erupted? When the Russia-Ukraine war started? Every crisis seems the gravest ever when it erupts, but all these events are mere blips when we look back. So, ignore all the panic and focus on the long term. Remember that good businesses have grown and flourished through all the above-mentioned crises.",
            "pubDate": "2025-08-28T03:11:02.735982"
        },
        {
            "title": "Stocks in news: Eternal, Tata Steel, IndiGo, United Breweries, Zaggle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-eternal-tata-steel-indigo-united-breweries-zaggle/articleshow/123548839.cms",
            "description": "Markets faced pressure, slipping below key support levels, impacting recovery. BNP Paribas became a net buyer of Eternal shares worth ₹3,220 crore. J&K Bank appointed S Krishnan as non-executive chairman. Airtel announced support for users in regions disrupted by extreme weather. Tata Steel acquired shares in its Singapore subsidiary, while Zaggle Prepaid partnered with Standard Chartered Bank.",
            "pubDate": "2025-08-28T03:11:02.736080"
        },
        {
            "title": "GIFT Nifty down 50 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123548876.cms",
            "description": "Indian equities faced losses on Tuesday due to escalating global trade concerns and impending US tariffs on Indian goods. Investors are closely monitoring potential deferrals of these tariffs, which could positively impact market sentiment. The rupee weakened, and foreign portfolio investors were net sellers, while domestic institutional investors were net buyers.",
            "pubDate": "2025-08-28T03:11:02.736174"
        },
        {
            "title": "China chipmakers push to triple AI chip capacity, eyes Nvidia alternative",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-chipmakers-push-to-triple-ai-chip-capacity-eyes-nvidia-alternative/articleshow/123553167.cms",
            "description": "China's chipmakers are aggressively pursuing a plan to triple their AI chip production by 2026, aiming to lessen reliance on Nvidia. Huawei intends to initiate AI chip production by the end of the year and establish two more facilities by 2026. SMIC also plans to double its 7-nanometer chip manufacturing capacity next year, with Huawei as its primary client.",
            "pubDate": "2025-08-28T03:11:02.736366"
        },
        {
            "title": "TikTok may get $330-billion valuation in new share buyback",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tiktok-may-get-330-billion-valuation-in-new-share-buyback/articleshow/123553118.cms",
            "description": "ByteDance, the parent company of TikTok, is planning a new employee share buyback, valuing the company at over $330 billion. This decision follows a 25% year-on-year surge in second-quarter sales, reaching approximately $48 billion, primarily driven by its China business. The buyback offers employees liquidity without an IPO, highlighting ByteDance's financial strength.",
            "pubDate": "2025-08-28T03:11:02.736484"
        },
        {
            "title": "Sectoral impact: Industry to sit down with RBI for tariff assessment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sectoral-impact-industry-to-sit-down-with-rbi-for-tariff-assessment/articleshow/123553374.cms",
            "description": "Reserve Bank of India will meet with industry leaders to discuss the impact of US tariffs. The consultation is planned for September. It will assess how the 50% tariffs affect various sectors. Labour-intensive industries may face significant challenges. The meeting will also cover the India-UK trade agreement. RBI aims to cushion the economy from the fallout.",
            "pubDate": "2025-08-28T03:11:02.736586"
        },
        {
            "title": "Ferrous metals post strong gains in Q1, non-ferrous players struggle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ferrous-metals-post-strong-gains-in-q1-non-ferrous-players-struggle/articleshow/123553010.cms",
            "description": "Metal companies' performance in June 2025 quarter was influenced by raw material and product prices. Ferrous producers saw profit growth due to higher domestic prices and lower coking coal costs. Non-ferrous firms had muted results from weaker aluminium and zinc prices. Steelmakers benefited from falling coking coal costs and government safeguard duties.",
            "pubDate": "2025-08-28T03:11:02.736678"
        },
        {
            "title": "TCS shares in focus as IT major sets up new AI transformation unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-as-it-major-sets-up-new-ai-transformation-unit/articleshow/123555817.cms",
            "description": "Tata Consultancy Services (TCS) has formed a dedicated artificial intelligence (AI) and services transformation unit, consolidating its AI capabilities to deliver domain-specific solutions and accelerate innovation across industries. Amit Kapur, who previously headed TCS’s UK and Ireland business, will lead the unit from September. The move underscores TCS’s push to place AI at the core of its growth strategy.",
            "pubDate": "2025-08-28T04:33:54.981058"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Jyothy Labs, Gulf Oil among 5 stocks that could give 11-28% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-jyothy-labs-gulf-oil-among-5-stocks-that-could-give-11-28-return/slideshow/123555790.cms",
            "description": "Brokerages have rolled out fresh recommendations across sectors, highlighting opportunities in FMCG, metals, real estate, consumer retail, and industrials.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-28T04:33:54.981178"
        },
        {
            "title": "RattanIndia Enterprises, Ipca Labs among 5 stocks that rose above VWAP on August 26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rattanindia-enterprises-ipca-labs-among-5-stocks-that-rose-above-vwap-on-august-26/slideshow/123555708.cms",
            "description": "On August 26, the closing prices of five stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-08-28T04:33:54.981292"
        },
        {
            "title": "BSE, Eicher Motors among 9 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-eicher-motors-among-9-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/123555641.cms",
            "description": "As of August 26, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-08-28T04:33:54.981394"
        },
        {
            "title": "Why stock market is down today? Key factors behind the 600-point Sensex crash, Nifty below 24,550",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-stock-market-is-down-today-key-factors-behind-the-650-point-sensex-crash-nifty-below-24550/articleshow/123555258.cms",
            "description": "Indian equities experienced a sharp decline on Thursday, triggered by the implementation of 25% US tariffs on Indian imports. The Sensex and Nifty opened significantly lower, with banks facing the most substantial selling pressure. Weak global cues and continuous foreign fund outflows further intensified the market downturn, resulting in a considerable loss of market capitalization.",
            "pubDate": "2025-08-28T04:33:54.981487"
        },
        {
            "title": "RattanIndia Enterprises, NLC India among 6 stocks showing RSI Trending Up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rattanindia-enterprises-nlc-india-among-6-stocks-showing-rsi-trending-up/slideshow/123555525.cms",
            "description": "On August 26, six stocks from the Nifty500 pack appeared in the RSI Trending Up scan, according to data from stockedge.com. An uptrend signal is generated when the RSI value rises above 50 from below. \"RSI trending up\" indicates strengthening momentum in a stock’s price, often suggesting potential upward movement and possible buying opportunities for traders.Stocks with RSI trending up:",
            "pubDate": "2025-08-28T04:33:54.981581"
        },
        {
            "title": "India Inc earnings downgrade drought shows first signs of breaking: Will Q2 mark the bottom?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-inc-earnings-downgrade-drought-shows-first-signs-of-breaking-will-q2-mark-the-bottom/articleshow/123555478.cms",
            "description": "The earnings decline for Indian companies might be nearing its end. Q1 saw the smallest downgrade cycle in a year. Large companies are showing stability. Oil and Gas sector boosted overall growth. Construction materials and telecom sectors are performing well. Textiles and consumer durables are facing challenges. Rural consumption revival and potential RBI policy changes could aid growth.",
            "pubDate": "2025-08-28T04:33:54.981669"
        },
        {
            "title": "Negative Breakout: Vedanta, Yes Bank among 9 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-vedanta-yes-bank-among-9-stocks-cross-below-their-200-dmas/slideshow/123555418.cms",
            "description": "The closing price of 9 stocks from the Nifty500 pack crossed below their 200 DMA (Daily Moving Averages) on August 26, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look",
            "pubDate": "2025-08-28T04:33:54.981756"
        },
        {
            "title": "At multi-year highs: Eicher Motors, Maruti Suzuki among 5 stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-eicher-motors-maruti-suzuki-among-5-stocks-witness-5-year-swing-high-breakouts/slideshow/123555323.cms",
            "description": "In the NSE list of stocks with a market cap above Rs 1,000 crore, seven stocks closed at a 5-year swing high on August 26, signaling bullish momentum, according to technical scan data from stockedge.com.A 5-year swing high marks the highest price a stock has reached in the past five years. It often acts as a significant resistance level where prices have historically struggled to break through. Reaching this point can be viewed as a bullish indicator, suggesting the potential for further upside. However, it differs from a 5-year breakout, which occurs when a stock surpasses a long-standing resistance level.",
            "pubDate": "2025-08-28T04:33:54.981864"
        },
        {
            "title": "Berkshire raises stake in Japan's Mitsubishi to 10.23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/berkshire-raises-stake-in-japans-mitsubishi-to-10-23/articleshow/123555193.cms",
            "description": "Berkshire Hathaway increased its stake in Mitsubishi Corp to 10.23% through National Indemnity Company.",
            "pubDate": "2025-08-28T04:33:54.981954"
        },
        {
            "title": "Adani Group stocks in focus as CCI approves acquisition of Jaiprakash Associates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-stocks-in-focus-as-cci-approves-acquisition-of-jaiprakash-associates/articleshow/123554802.cms",
            "description": "Adani Share Price: The Competition Commission of India (CCI) has approved Adani Group's acquisition of Jaiprakash Associates Ltd (JAL), a significant step in Adani's infrastructure and real estate expansion. JAL, undergoing insolvency proceedings with substantial creditor claims, possesses extensive assets, including real estate projects, commercial properties, and cement plants. The Committee of Creditors will now review resolution plans.",
            "pubDate": "2025-08-28T04:33:54.982042"
        }
    ]
}