{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-12T15:30:47.150236",
    "items": [
        {
            "title": "Why did Bajaj Finserv's stock plunge despite an increase in Q2 profit?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/why-did-bajaj-finservs-stock-plunge-despite-an-increase-in-q2-profit/articleshow/125262376.cms",
            "description": "Bajaj Finserv reported a 8% rise in Q2 net profit to ₹2,244 crore, but its lending arm, Bajaj Finance, saw its stock slump over 6%. This decline was triggered by a cautious outlook for future expansion and increased credit costs. Bajaj Finance also moderated its FY26 growth forecast. Meanwhile, Bajaj Allianz General Insurance posted a 5% profit increase.",
            "pubDate": "2025-11-12T03:49:10.931841"
        },
        {
            "title": "Hero MotoCorp Q2 Preview: Festive demand, richer product mix could drive 16% profit growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hero-motocorp-q2-preview-festive-demand-richer-product-mix-could-drive-16-profit-growth/articleshow/125270094.cms",
            "description": "Hero MotoCorp is expected to post strong Q2 results, driven by festive demand, volume recovery, and a richer product mix. Brokerages project double-digit growth in revenue and profit, aided by higher ASPs, stable input costs, and improved margins. Analysts remain upbeat on Hero’s festive momentum and EV strategy.",
            "pubDate": "2025-11-12T09:33:06.046687"
        },
        {
            "title": "Info Edge Q2 Results: Cons PAT soars 1,260% YoY to Rs 316 crore on one-time gain, revenue rises 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/info-edge-q2-results-cons-pat-soars-1260-yoy-to-rs-316-crore-on-one-time-gain-revenue-rises-15/articleshow/125269999.cms",
            "description": "Info Edge reported a 7% sequential growth in PAT to Rs 296 crore for Q1FY26, with topline up 2%. The company's standalone revenue increased 14% YoY to Rs 746 crore in Q2FY26, driven by steady billing growth across its recruitment and non-recruitment businesses. Operating profit rose 6.5% YoY to Rs 268 crore.",
            "pubDate": "2025-11-12T09:33:06.046815"
        },
        {
            "title": "SpiceJet Q2 Results: Cons loss widens to Rs 621 crore YoY, revenue falls 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/spicejet-q2-results-cons-loss-widens-yoy-to-rs-621-crore-revenue-falls-13/articleshow/125271593.cms",
            "description": "SpiceJet Q2 Results: Budget carrier SpiceJet widened its consolidated net losses in the September quarter to Rs 621 crore compared to the net loss of Rs 458 crore in the year ago period. The profit after tax (PAT) is attributable to the owners of the holding company.",
            "pubDate": "2025-11-12T10:37:05.897544"
        },
        {
            "title": "Asian Paints Q2 Results: Cons profit surges 43% YoY to Rs 994 crore; Rs 4.5/share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/asian-paints-q2-results-cons-profit-surges-43-yoy-to-rs-994-crore-rs-4-5/share-dividend-declared/articleshow/125270947.cms",
            "description": "Asian Paints Q2 Results: Asian Paints announced a strong performance for the September quarter. Net profit surged 43% year-on-year to Rs 994 crore. Revenues grew 6% to Rs 8,514 crore. The company saw double-digit volume growth in its domestic decorative business. International sales also increased. Asian Paints declared an interim dividend of Rs 4.5 per share.",
            "pubDate": "2025-11-12T10:37:05.897680"
        },
        {
            "title": "Tata Steel Q2 Results: Cons PAT surges 272% YoY to Rs 3,102 crore, revenue rises 9%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-steel-q2-results-cons-pat-surges-272-yoy-to-rs-3101-crore-revenue-rises-9/articleshow/125275073.cms",
            "description": "Tata Steel Q2 Results: Tata Steel on Wednesday reported a 272% jump in its consolidated Q2 net profit at Rs 3,102 crore versus Rs 833 crore in the year ago period. The profit after tax (PAT) is attributable to the owners of the company.",
            "pubDate": "2025-11-12T15:30:45.319230"
        },
        {
            "title": "HAL Q2 Results: Cons profit rises 10% YoY to Rs 1,669, revenue jumps 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hal-q2-results-cons-profit-rises-10-yoy-to-rs-1669-revenue-jumps-11/articleshow/125272007.cms",
            "description": "HAL Q2 Results: Hindustan Aeronautics Ltd (HAL) reported a 10% year-on-year rise in Q2 net profit to ₹1,669 crore, with revenue up 11% to ₹6,629 crore. Sequentially, PAT jumped 21% from ₹1,384 crore in Q1FY26, supported by a 38% increase in revenue to ₹4,819 crore in the previous quarter.",
            "pubDate": "2025-11-12T15:30:45.319389"
        }
    ]
}