{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-10T16:40:28.322604",
    "items": [
        {
            "title": "Corporate actions: SBI, BSE and BEML among 11 stocks with record dates next week. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/corporate-actions-sbi-bse-and-beml-among-11-stocks-with-record-dates-next-week-do-you-own-any/slideshow/121052311.cms",
            "description": "Plenty of corporate action is lined-up next week with record dates for dividends, demerger, rights issue falling over the five-day trading week. Here's what all is scheduled:",
            "pubDate": "2025-05-10T07:24:31.868433"
        },
        {
            "title": "Mother’s Day advice on financial planning for mothers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mothers-day-advice-on-financial-planning-for-mothers/articleshow/121052080.cms",
            "description": "Financial planning is one of the most valuable gifts a mother can give her children. From mutual funds to insurance and gold ETFs, this guide outlines smart saving strategies, retirement planning, and the importance of instilling financial discipline in kids.",
            "pubDate": "2025-05-10T07:24:31.868579"
        },
        {
            "title": "Lupin, APL Apollo Tubes among 7 small & midcap stocks that can surge up to 48%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lupin-apl-apollo-tubes-among-7-small-midcap-stocks-that-can-surge-up-to-48/slideshow/121051234.cms",
            "description": "Domestic brokerage firm Axis Securities is optimistic about several small and midcap stocks, predicting potential rallies of up to 48%. These include Max Healthcare Institute, Prestige Estates Projects, Lupin, Dalmia Bharat, Colgate-Palmolive, and APL Apollo Tubes.Here's a list of 7 small & midcap stocks that can rally up to 48%, according to Axis Securities:",
            "pubDate": "2025-05-10T07:24:31.868789"
        },
        {
            "title": "Foreign love rekindled: What 14 days of FII buying signals for Indian markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-love-rekindled-what-14-days-of-fii-buying-signals-for-indian-markets/articleshow/121049401.cms",
            "description": "After two decades, domestic investors hold more NSE-listed stocks than foreign investors, but FIIs have recently returned as net buyers. Historical data suggests sustained FII buying often precedes market uptrends. Factors like RBI liquidity measures, falling crude oil prices, a stronger rupee, and easing trade tensions are drawing FIIs back to Indian equities, potentially driving the Nifty 50 higher.",
            "pubDate": "2025-05-10T07:24:31.868889"
        },
        {
            "title": "Europe's Stoxx up marginally, Germany's DAX hits record high on hopes of easing trade tensions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/europes-stoxx-up-marginally-germanys-dax-hits-record-high-on-hopes-of-easing-trade-tensions/articleshow/121048322.cms",
            "description": "European stock markets saw gains. Germany's DAX reached a record high. Investors felt relieved by signs of a possible ease in the global trade war. U.S. and China are expected to discuss trade. BP shares increased following takeover speculation. Energy and resources sectors performed well. Commerzbank and Mediobanca also saw gains. Bavarian Nordic shares jumped after strong revenue results.",
            "pubDate": "2025-05-10T07:24:31.869084"
        },
        {
            "title": "Global stocks, Bitcoin rally on renewed trade deal hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-bitcoin-rally-on-renewed-trade-deal-hopes/articleshow/121048110.cms",
            "description": "Global stocks showed strength, nearing six-week highs. This followed a US-UK trade agreement, boosting hopes for tariff talks. India offered tariff cuts to the US, seeking exemptions. Germany's Dax hit a record high. The US-UK deal is seen as a positive sign for trade relations. Investors shifted from bonds to stocks. Bitcoin reached its highest level since January.",
            "pubDate": "2025-05-10T07:24:31.869175"
        },
        {
            "title": "US Stocks end flat as investors await US-China trade talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-flat-as-investors-await-us-china-trade-talks/articleshow/121047974.cms",
            "description": "Wall Street saw a quiet end to the week as investors awaited U.S.-China trade discussions. Donald Trump suggested tariff adjustments before the meeting in Switzerland. The Dow, S&P 500, and Nasdaq experienced slight weekly declines. Energy sector showed gains, while healthcare faced losses. Federal Reserve officials highlighted economic risks from tariffs. Expedia shares dropped after revenue miss.",
            "pubDate": "2025-05-10T07:24:31.869271"
        },
        {
            "title": "Wall Street Week Ahead: US market leadership faces test as economic data takes centre stage",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-market-leadership-faces-test-as-economic-data-takes-centre-stage/articleshow/121047922.cms",
            "description": "Investors are keenly awaiting economic data this week. They are observing if the US stock market's leadership shifts from defensive sectors. This shift could signal a higher risk appetite. Upcoming data includes the Consumer Price Index and retail sales figures. These will offer insights into inflation and consumer spending.",
            "pubDate": "2025-05-10T07:24:31.869370"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 31%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-31/articleshow/121044801.cms",
            "description": "The way things are developing on the India-Pakistan border, one thing is almost certain: The return of volatility. In the current scenario, be prepared to see some amount of drawdown in the value of your overall portfolio. Also, don’t hit the panic button. Focus instead on things you have control over. So, don’t react to every headline, and be discriminatory in stock selection. Remember that the best returns on your investment will come in the medium to long term.",
            "pubDate": "2025-05-10T07:24:31.869479"
        },
        {
            "title": "BofA acquires stakes in Angel One, Nuvama in Rs 500 crore block transactions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bofa-acquires-stakes-in-angel-one-nuvama-in-rs-500-crore-block-transactions/articleshow/121036245.cms",
            "description": "Bank of America acquired stakes worth ₹502 crore in Angel One and Nuvama Wealth Management through block deals, even as Angel One reported a sharp earnings decline in Q4FY25.",
            "pubDate": "2025-05-10T07:24:31.869583"
        },
        {
            "title": "Chipmaker Wolfspeed shares fall 23% as slowing EV sales hit annual revenue forecast",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chipmaker-wolfspeed-shares-fall-23-as-slowing-ev-sales-hit-annual-revenue-forecast/articleshow/121035352.cms",
            "description": "Chipmaker Wolfspeed's shares fell 23% on Friday after it raised going-concern doubts and forecast weaker-than-expected annual revenue as it grapples with slowing electric-vehicle demand amid economic uncertainty.",
            "pubDate": "2025-05-10T07:24:31.869675"
        },
        {
            "title": "Asia Index launches BSE Dividend Leaders 50 index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asia-index-launches-bse-dividend-leaders-50-index/articleshow/121035261.cms",
            "description": "Asia Index, subsidiary of stock exchange BSE, on Friday announced the launch of a new index - BSE Dividend Leaders 50. The index measures the performance of companies in the BSE 500 index that have consistently paid dividends over the past 10 years.",
            "pubDate": "2025-05-10T07:24:31.869763"
        },
        {
            "title": "Two Sharp with ET: India-Pak tensions jolt markets & Adani, Reliance, NHPC among firms at risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-sharp-with-et-india-pak-tensions-jolt-markets-adani-reliance-nhpc-among-firms-at-risk/videoshow/121033253.cms",
            "description": "India-Pakistan tensions have shaken the markets, wiping out ₹1.7 lakh crore in investor wealth. Sensex fell 880 pts, while Nifty barely held the 24K mark. CLSA flags Adani, Reliance, NHPC as vulnerable due to border-zone exposure. Foreign flows and rupee stability now hang in the balance.",
            "pubDate": "2025-05-10T07:24:31.869854"
        },
        {
            "title": "US stocks trade in a range as Trump plans to ease China tariffs ahead of weekend meet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-trump-plans-to-ease-china-tariffs-ahead-of-weekend-meet/articleshow/121033185.cms",
            "description": "Wall Street's main indexes opened higher on Friday as investors assessed fresh remarks from President Donald Trump regarding U.S. tariffs on China ahead of a key weekend meeting between the two countries.",
            "pubDate": "2025-05-10T07:24:31.869942"
        },
        {
            "title": "As India-Pakistan conflict grows, here's how equity markets, GDP have navigated wars",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-india-pakistan-conflict-grows-heres-how-equity-markets-gdp-have-navigated-wars/articleshow/121057273.cms",
            "description": "As tensions escalate between India and Pakistan, a historical review shows past conflicts had limited impact on equity markets but often hurt GDP. Nifty reactions ranged from sharp rallies during Kargil to mild dips post-Pulwama. JM Financial notes that while past wars dented economic growth, India’s economy today is more resilient and better equipped to absorb shocks.",
            "pubDate": "2025-05-10T15:49:05.675950"
        },
        {
            "title": "Look beyond the obvious and think long term: 8 large-cap stocks with an upside potential of up to 54%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/look-beyond-the-obvious-and-think-long-term-8-large-cap-stocks-with-an-upside-potential-of-up-to-54/articleshow/121057158.cms",
            "description": "The intensity of the India-Pakistan conflict has gone up a couple of notches in the last 48 hours. And it may take some time for matters to be resolved. So, the chances are that the market will remain under pressure in the short term. However, focusing on the short term is the biggest mistake you can make at this juncture. If you are looking to put in fresh money, identify a combination of stocks from sectors which are going to do well because of conflict and from others where the demand has an element of annuity and the business will thus grow at all times.",
            "pubDate": "2025-05-10T15:49:05.676075"
        },
        {
            "title": "Nifty ends week down 1.4% amid India-Pakistan tensions; 5 technical cues for next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-ends-week-down-1-4-amid-india-pakistan-tensions-5-technical-cues-for-next-week/slideshow/121053459.cms",
            "description": "Nifty ended with a weekly decline of 1.4%, managing to hold above the 24,000 mark. On Friday, it fell 266 points or 1.1% lower because of the escalation in the India-Pakistan tension. Selling pressure was across sectors but more prominent in private banks, realty and energy stocks. Here's what the charts reveal for next week's action:",
            "pubDate": "2025-05-10T15:49:05.676182"
        },
        {
            "title": "Dalal Street Week Ahead: Nifty faces crucial test at key support zone amid rising volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-week-ahead-nifty-faces-crucial-test-at-key-support-zone-amid-rising-volatility/articleshow/121053634.cms",
            "description": "Despite global uncertainties and geopolitical tensions, Indian equity markets showed resilience, consolidating before a slight weekly loss. The Nifty oscillated within a range, defending key support levels while volatility surged. Technical analysis suggests the 23950-24050 zone is crucial; defending it implies continued consolidation, while breaching 23900 could signal weakness. A defensive approach focusing on low beta stocks is advised.",
            "pubDate": "2025-05-10T15:49:05.676286"
        },
        {
            "title": "5 ways Warren Buffett and Nita Ambani hack aging differently",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-ways-warren-buffett-and-nita-ambani-hack-aging-differently/slideshow/121053167.cms",
            "description": "Warren Buffett, chairman of Berkshire Hathaway, and Nita Ambani, chairperson of Reliance Foundation, are two of the most influential figures in business. Yet when it comes to aging, their approaches couldn’t be more different. Buffett, famed for his love of Coke and hot dogs, stands in stark contrast to Ambani’s disciplined wellness regimen, where yoga and mindful nutrition take center stage. Here are 5 ways they hack aging differently.",
            "pubDate": "2025-05-10T15:49:05.676387"
        },
        {
            "title": "Multibagger or IBC (Series: AA 125), Part 5: This company, at the right place at the right time",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-series-aa-125-part-5-this-company-at-the-right-place-at-the-right-time/articleshow/121062261.cms",
            "description": "In its 2017-18 annual report, this company stated: “The future belongs to Electric vehicles (EVs), and LEDs will be significantly efficient on these vehicles” and that “plans are on the anvil to localise products (for EVs)”. The 2021-22 annual report shows it was not all tall talk. The company, it said, had set up a “state-of-the-art electronics plant in Bawal, Haryana, where [it] will manufacture cutting-edge electronic components and technology software – focusing on developing EV components. Cut to Q3FY25: 33% of its total order book of Rs. 2,600 crore comes from EVs.",
            "pubDate": "2025-05-10T16:40:27.547936"
        }
    ]
}