{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-27T17:20:49.913695",
    "items": [
        {
            "title": "Dalal Street edges down amid low volumes, global uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dalal-street-edges-down-amid-low-volumes-global-uncertainty/articleshow/126199271.cms",
            "description": "On Friday, Indian stock exchanges experienced a downturn as investors opted to trim their portfolios ahead of the weekend break. Meanwhile, bullion markets thrived, with gold and silver prices hitting unprecedented levels, marking a continued upward trend. Global trading activity remained lukewarm, reflecting the seasonal slowdown due to year-end festivities.",
            "pubDate": "2025-12-27T04:02:46.928822"
        },
        {
            "title": "Wall Street closes near record highs; precious metals rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-near-record-highs-precious-metals-rise/articleshow/126200045.cms",
            "description": "Indian markets mirrored global trends as major U.S. stock indexes neared record highs, buoyed by anticipated Federal Reserve rate cuts and a weaker dollar. Precious metals like silver and gold surged to all-time peaks amid geopolitical tensions. Investors are keenly watching for Fed policy shifts and a new chair nomination, while oil prices dipped on supply glut fears.",
            "pubDate": "2025-12-27T05:18:21.748669"
        },
        {
            "title": "US stocks end close to all-time highs in light, post-holiday session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-close-to-all-time-highs-in-light-post-holiday-session/articleshow/126199996.cms",
            "description": "Indian markets saw a flat close on Friday after a strong rally. Investors are watching for the Santa Claus rally, a seasonal trend. This year has been volatile with tariff concerns and geopolitical tensions. Major indexes are set for double-digit gains. Experts advise preparing for continued volatility. Nvidia and Target saw stock movements.",
            "pubDate": "2025-12-27T05:18:21.748782"
        },
        {
            "title": "India’s quiet drift toward duopoly: A risk investors can no longer ignore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-quiet-drift-toward-duopoly-a-risk-investors-can-no-longer-ignore/articleshow/126199642.cms",
            "description": "India's markets are consolidating into duopolies, with two dominant players controlling nearly 90% of sectors like aviation, food delivery, and digital payments. This concentration, exemplified by IndiGo and Air India, shifts incentives from customer service to market management, potentially harming consumers and innovation. The government is now intervening to foster new competition.",
            "pubDate": "2025-12-27T05:18:21.748977"
        },
        {
            "title": "ICICI Bank, AU SFB well-placed as credit cycle turns more disciplined: Siddhartha Khemka",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-au-sfb-well-placed-as-credit-cycle-turns-more-disciplined-siddhartha-khemka/articleshow/126199620.cms",
            "description": "India’s banking sector is recalibrating as asset quality improves and growth turns selective. PSU banks are regaining MSME and home loan share, unsecured lending is moderating, and secured retail drives stability. Analysts favour execution-led lenders like ICICI Bank and AU Small Finance Bank.",
            "pubDate": "2025-12-27T05:18:21.749075"
        },
        {
            "title": "Wall Street Week Ahead: S&P 500 eyes 7,000 mark as investors look for upbeat end to strong 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-sp-500-eyes-7000-mark-as-investors-look-for-upbeat-end-to-strong-2025/articleshow/126199330.cms",
            "description": "US stocks are poised for a strong finish to 2025, nearing record highs. Despite recent tech sector jitters, the S&P 500 is on an impressive streak. Investors are keenly awaiting Fed minutes for clues on interest rate cuts and President Trump's Fed chair nomination, anticipating further market movements.",
            "pubDate": "2025-12-27T05:18:21.749168"
        },
        {
            "title": "Beaten-down solar stocks turn attractive? Waaree Energies, Premier and Vikram Solar offer up to 33% upside, says Prabhudas",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/beaten-down-solar-stocks-turn-attractive-waaree-energies-premier-and-vikram-solar-offer-up-to-33-upside-says-prabhudas/slideshow/126200771.cms",
            "description": "Prabhudas Lilladher has initiated coverage on three solar stocks viz. Waaree Energies, Premiere Energies and Vikram Solar. All the three stocks have been market laggards with Waaree gaining 6% (Nifty 10%) in 2025 while Premiere plunging by 34% YTD. Meanwhile, Vikram Solar, the August 2025 listing, has seen its stock slip 25% below the issue price. Here is why PL sees up to 33% upside in them.",
            "pubDate": "2025-12-27T06:33:46.444702"
        },
        {
            "title": "2025 is the year retail investing matured: Key shifts and the road ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2025-is-the-year-retail-investing-matured-key-shifts-and-the-road-ahead/articleshow/126200498.cms",
            "description": "India’s capital markets are undergoing a structural shift as millions move from trading to disciplined investing. Rising SIP flows, younger investors, and growing retail ownership are reshaping savings habits, market stability, and long-term wealth creation.",
            "pubDate": "2025-12-27T06:33:46.444803"
        },
        {
            "title": "Concurrent Gainers: 14 stocks that gained for 5 sessions in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-14-stocks-that-gained-for-5-sessions-in-a-row/slideshow/126201548.cms",
            "description": "Over the five trading sessions ending December 26, the Sensex benchmark advanced 0.66%, or 560 points, to close at 85,041, posting gains in two of the five sessions. Despite this modest overall rise, about 35 stocks from the BSE 500 index moved higher in each of the five consecutive sessions between December 18 and 26. Among these, we identified 13 stocks that gained on all five days, delivering cumulative returns ranging from 10% to 37% over the period. (Data Source: ACE Equity).",
            "pubDate": "2025-12-27T07:49:19.279899"
        },
        {
            "title": "Warren Buffett retires on December 31 and leaves behind a manual for a life in investing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/warren-buffett-retires-on-december-31-and-leaves-behind-a-manual-for-a-life-in-investing/articleshow/126201710.cms",
            "description": "Warren Buffett will step down as Berkshire Hathaway CEO on December 31, ending a six-decade tenure. Vice-chair Greg Abel takes charge January 1, marking a succession while Buffett remains active, cementing a legacy of patience, discipline, ownership and long-term investing.",
            "pubDate": "2025-12-27T08:22:58.864599"
        },
        {
            "title": "Nifty stalls near highs as record low VIX signals risk beneath calm markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-stalls-near-highs-as-record-low-vix-signals-risk-beneath-calm-markets/articleshow/126202195.cms",
            "description": "Markets stayed rangebound in a holiday-shortened week as Nifty inched higher amid low volumes. India VIX fell to record lows, signalling complacency. Momentum weakened, breadth lagged and volatility compression warned of vulnerability until a decisive breakout emerges in coming sessions.",
            "pubDate": "2025-12-27T08:44:28.646192"
        },
        {
            "title": "Trent, RVNL among 10 former multibaggers that crashed in 2025 after spectacular 2024 rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-rvnl-among-10-former-multibaggers-that-crashed-in-2025-after-spectacular-2024-rally/slideshow/126202149.cms",
            "description": "After a heady rally in 2024, several investor favourites that were once dubbed “multibaggers” turned out to be major disappointments in 2025. A common trait among these stocks was the elevated valuations they carried into the year. With performance expectations sky-high and room for error limited, any earnings miss was met with sharp price corrections.According to Trendlyne data, all the top 10 underperformers of 2025 had valuation scores below 25 in 2024, placing them in the \"expensive/bad\" category. As growth began to normalise and operating metrics softened, stretched valuations triggered steep stock declines, with some names falling over 40% in a year.",
            "pubDate": "2025-12-27T08:44:28.646308"
        },
        {
            "title": "Vijay Kedia’s Portfolio in CY25: Most stocks slide, 6 drop up to 68% — Are you impacted?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedias-portfolio-in-cy25-most-stocks-slide-6-drop-up-to-68-are-you-impacted/slideshow/126202807.cms",
            "description": "Investors often keep a close watch on the portfolios of well-known market veterans. In this context, ETMarkets reviewed the investment holdings of seasoned investor Vijay Kedia. As per the latest available data for the September 2025 quarter, Kedia holds publicly disclosed stakes in around 16 companies, with a combined value of about Rs 1,170 crore as of December 26, 2025, down nearly 38% from Rs 1,896 crore in December 2024.Looking at CY25 price performance, only three stocks from his portfolio generated positive, double-digit returns; the rest delivered negative performance. As many as 6 stocks have declined in the range of 25% to 68%. The analysis also highlights two new additions made to his portfolio during the September quarter. (Data Source: ACE Equity, Trendlyne)",
            "pubDate": "2025-12-27T09:45:10.769905"
        },
        {
            "title": "India set to log record FII outflows as net sale hits Rs 1.58 lakh crore in 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-set-to-log-record-fii-outflows-as-net-sale-hits-rs-1-58-lakh-crore-in-2025/articleshow/126203214.cms",
            "description": "Foreign investors are set to record their biggest-ever exit from Indian equities in 2025, with net outflows of over Rs 1.58 lakh crore, driven by exchange selling, rupee weakness and global capital shifts, despite steady domestic flows.",
            "pubDate": "2025-12-27T10:43:19.205282"
        },
        {
            "title": "MCX among 3 stocks to go ex-date for bonus issue, stock split next week. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-among-3-stocks-to-go-ex-date-for-bonus-issue-stock-split-next-week-do-you-own-any/slideshow/126204077.cms",
            "description": "Corporate actions such as stock splits, bonus issues, and face value consolidations play a key role in reshaping a company’s capital structure and can significantly influence stock liquidity, investor participation, and short-term price movements. These events, while not impacting a company’s core fundamentals, often serve as triggers for renewed investor interest, particularly among retail participants.In the coming days, several listed companies have announced important corporate actions that shareholders should take note of. From stock splits aimed at enhancing affordability to bonus issues that reward existing shareholders, these changes may affect portfolio valuations and trading volumes. The following slides provide a snapshot of key corporate actions scheduled for the week, along with their effective dates and specific details, according to StockEdge data:",
            "pubDate": "2025-12-27T11:56:10.206644"
        },
        {
            "title": "Buying in 2026 & selling at the right time: It could be anytime before 2029, or even later. 15 stocks that fit the bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buying-in-2026-selling-at-the-right-time-it-could-be-anytime-before-2029-or-even-later-15-stocks-that-fit-the-bill/articleshow/126206801.cms",
            "description": "What is the best time to buy stocks? In hindsight, March 2020 might have been the best time. But the fact is that there is no clear answer to this question. The answer closest to reality probably is: Maximum wealth is generated when one is able to gather the courage to buy a stock when the news flow around that sector and stock is negative. The street is not interested in them, because the majority believes that nothing good can happen to them. They may have valid reasons to believe so, but the street is probably missing one point: When the government decides to revive or develop something, it just does. Yes, it might take time, but development happens, sooner or later.",
            "pubDate": "2025-12-27T17:20:48.966361"
        }
    ]
}