{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-07T23:46:47.988783",
    "items": [
        {
            "title": "GIFT Nifty down 70 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126384755.cms",
            "description": "Indian equity markets experienced a second consecutive day of decline, driven by profit-booking in major stocks and escalating geopolitical concerns. Analysts anticipate a sideways trading range as positive Q3 business updates are countered by global uncertainties. The Nifty showed weakness after reaching a new high, with the trend expected to remain range-bound.",
            "pubDate": "2026-01-07T01:52:52.714852"
        },
        {
            "title": "Stocks in news: Titan, Tata Steel, JSW Steel, Pidilite Industries, M&M",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-titan-tata-steel-jsw-steel-pidilite-industries-mm/articleshow/126384740.cms",
            "description": "Markets saw a subdued session, continuing a mild correction after recent highs. Several companies are in focus today. Titan reported strong consumer business growth. Tata Steel and JSW Steel face antitrust allegations. Biocon is expanding its oncology biosimilar portfolio. Lodha Developers saw a 25% rise in sales bookings. Pidilite Industries completed a share swap deal.",
            "pubDate": "2026-01-07T01:52:52.714982"
        },
        {
            "title": "Asian stock rally eases as Japan slips, oil falls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stock-rally-eases-as-japan-slips-oil-falls/articleshow/126384723.cms",
            "description": "Asian markets took a break Wednesday after a strong start to the year. Japanese stocks dipped due to rising tensions with China. Meanwhile, US markets reached new record highs. Optimism around artificial intelligence and expectations of Federal Reserve interest rate cuts are driving investor sentiment. Investors are also watching upcoming economic data releases.",
            "pubDate": "2026-01-07T01:52:52.715087"
        },
        {
            "title": "Can Ashok Leyland sustain its rally after a 27% surge since November?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-ashok-leyland-sustain-its-rally-after-a-27-surge-since-november/articleshow/126384642.cms",
            "description": "Ashok Leyland shares are trading near record highs. The commercial vehicle maker saw strong sales growth in the December quarter. The company anticipates a better second half of FY26. This is due to lower taxes and increased infrastructure activity. Ashok Leyland is expanding its production capacity to meet rising demand.",
            "pubDate": "2026-01-07T01:52:52.715194"
        },
        {
            "title": "RIL market value falls Rs 94,000 crore in a day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ril-market-value-falls-rs-94000-crore-in-a-day/articleshow/126384505.cms",
            "description": "Reliance Industries shares saw a significant drop of 4.4 percent. This marked the biggest single-day fall in 18 months. The company denied a report about Russian oil heading to its Jamnagar refinery. Reliance stated no Russian crude oil deliveries were expected in January. The market value of the company decreased by approximately ₹94,000 crore.",
            "pubDate": "2026-01-07T01:52:52.715298"
        },
        {
            "title": "Sebi proposes a 30-day lag for use of price data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-proposes-a-30-day-lag-for-use-of-price-data/articleshow/126384489.cms",
            "description": "SEBI is proposing a 30-day lag for sharing listed companies' price data for educational purposes, aiming to prevent misuse while maintaining relevance. This move follows a ban on a financial influencer and a prior restriction on real-time data sharing to curb its use by online gaming platforms.",
            "pubDate": "2026-01-07T01:52:52.715394"
        },
        {
            "title": "Trent sees sharpest fall in six months after Q3 update spooks Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-falls-the-most-in-6-months-after-q3-update-spooks-street/articleshow/126384459.cms",
            "description": "Trent's shares plummeted over 8% on Tuesday, marking their steepest single-day fall in six months, following a disappointing third-quarter business update. Analysts cited a failure to meet revenue growth expectations and rich valuations as key concerns, suggesting investors might reduce their exposure to the stock.",
            "pubDate": "2026-01-07T01:52:52.715507"
        },
        {
            "title": "Profit-taking, geopolitical jitters drag indices lower for second straight session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/profit-taking-geopolitical-jitters-drag-indices-lower-in-second-straight-session/articleshow/126384395.cms",
            "description": "Index decline led by heavyweights amid geopolitical concerns Ongoing rally to be driven by Q3 earnings, govt's likely focus on capex-driven strategy, comfortable valuations: Analysts",
            "pubDate": "2026-01-07T01:52:52.715602"
        },
        {
            "title": "TPG nears deal to buy 30-40% stake in Nirmal Jain's IIFL Capital, open offer likely",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tpg-nears-deal-to-buy-30-40-stake-in-nirmal-jains-iifl-capital-open-offer-likely/articleshow/126384677.cms",
            "description": "US buyout group TPG Capital is nearing a deal to acquire a significant minority stake of 30-40% in Nirmal Jain's IIFL Capital Services. This move could position TPG as the largest shareholder, coinciding with Jain's plans to re-enter wealth management. The potential transaction, including an open offer, could be valued up to ₹8,000 crore.",
            "pubDate": "2026-01-07T01:52:52.715694"
        },
        {
            "title": "CalPERS, Enam among investors eye stake in Inox Clean Energy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/calpers-enam-among-investors-eye-atake-in-inox-clean-energy/articleshow/126384684.cms",
            "description": "Major investors are set to acquire a stake in Inox Clean Energy. This deal values the renewable energy firm at over $5 billion. The investment signals strong interest in India's clean energy sector. It will also fund Inox Clean Energy's expansion plans. The company is growing its renewable generation and solar manufacturing capacities.",
            "pubDate": "2026-01-07T01:52:52.715786"
        },
        {
            "title": "Govt, insurers and hospitals line up second consult to offer a healthy cover",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/govt-insurers-and-hospitals-line-up-second-consult-to-offer-a-healthy-cover/articleshow/126384433.cms",
            "description": "The meeting will be chaired by financial services secretary M Nagaraju, with representatives from the General Insurance Council, the Association of Healthcare Providers (India) and senior executives from insurers and hospital chains.",
            "pubDate": "2026-01-07T01:52:52.715970"
        },
        {
            "title": "Top NBFCs seek RBI nod to raise retail deposits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nbfcs-seek-rbi-nod-to-raise-retail-deposits/articleshow/126384420.cms",
            "description": "Except for a few NBFCs with legacy licences, most NBFCs are barred from raising retail deposits. Bajaj Finance, Shriram Finance, and Mahindra Finance are among the few NBFCs that are permitted to accept retail deposits. The governor met the CEOs of NBFCs, housing finance companies, microfinance institutions, and industry representatives on Monday.",
            "pubDate": "2026-01-07T01:52:52.716062"
        },
        {
            "title": "Microfinance disbursals, repayments picking up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/microfinance-disbursals-repayments-picking-up/articleshow/126384550.cms",
            "description": "The microfinance sector is showing signs of a turnaround, with several small finance banks and NBFC-MFIs reporting increased business volumes and improved repayments. While some lenders are experiencing growth, others, particularly smaller ones, continue to face challenges. The overall market has contracted, with Bandhan Bank actively cleansing its balance sheet by selling non-performing loans.",
            "pubDate": "2026-01-07T01:52:52.716151"
        },
        {
            "title": "Over 97% of bank accounts were insured at FY25 end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/over-97-of-bank-accounts-were-insured-at-fy25-end/articleshow/126384545.cms",
            "description": "As of March 2025, the DICGC insured 41.5% of total bank deposits by value, covering ₹100.12 lakh crore. The deposit insurance fund saw a 15.2% year-on-year increase, reaching ₹2.29 lakh crore. The RBI also approved a risk-based deposit insurance framework to enhance financial stability.",
            "pubDate": "2026-01-07T01:52:52.716238"
        },
        {
            "title": "Emmvee Photovoltaic shares gain 17% in 2 sessions. What’s powering the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emmvee-photovoltaic-shares-gain-17-in-2-sessions-whats-powering-the-rally/articleshow/126386975.cms",
            "description": "Emmvee Photovoltaic shares surged following a positive rating from Jefferies. The brokerage initiated coverage with a Buy rating and a target price, highlighting strong growth prospects. India's solar installations are expected to grow significantly, driven by falling tariffs and policy support. Emmvee's focus on advanced cell technology and capacity expansion positions it well.",
            "pubDate": "2026-01-07T04:52:48.530000"
        },
        {
            "title": "IDFC First Bank shares can rally 23%, says Nomura after initiating coverage with Buy call",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/idfc-first-bank-shares-can-rally-23-says-nomura-after-initiating-coverage-with-buy-call/articleshow/126386859.cms",
            "description": "IDFC First Bank shares rose after Nomura initiated coverage with a Buy rating, citing strong loan growth, improving margins and moderating credit costs. The brokerage sees over 23% upside, driven by earnings acceleration and better operating leverage over FY26-28F.",
            "pubDate": "2026-01-07T04:52:48.530107"
        },
        {
            "title": "InCred Equities' top picks: 9 largecap stocks with upside potential of up to 38% in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/incred-equities-top-picks-9-largecap-stocks-with-upside-potential-of-up-to-38-in-2026/slideshow/126386800.cms",
            "description": "After a volatile 2025 marked by persistent foreign institutional investor selling, market sentiment has turned optimistic. Looking ahead to 2026, InCred Equities sees selective opportunities emerging within the large cap space. In a recent report, the brokerage has shortlisted 9 blue-chip stocks across multiple sectors that it believes offer attractive value and the potential to deliver returns of up to 38.40% this year. Here’s the full list.",
            "pubDate": "2026-01-07T04:52:48.530207"
        },
        {
            "title": "Buy, Sell, or Hold? Morgan Stanley downgrades Indian Hotels Company; Citi stays neutral on Titan",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-downgrades-indian-hotels-company-citi-stays-neutral-on-titan/articleshow/126386615.cms",
            "description": "Global brokerages turned cautious on two marquee consumer names, with Morgan Stanley downgrading Indian Hotels Company to Equalweight amid expectations of moderating upside despite steady demand, while Citi maintained a Neutral stance on Titan, flagging rising competitive intensity and potential margin pressure despite strong jewellery sales growth.",
            "pubDate": "2026-01-07T04:52:48.530302"
        },
        {
            "title": "Jefferies lifts RIL target after Rs 1 lakh crore fall, pins next leg of rally on Jio IPO, tariff hikes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-lifts-ril-target-after-rs-1-lakh-crore-fall-pins-next-leg-of-rally-on-jio-ipo-tariff-hikes/articleshow/126386618.cms",
            "description": "A day after Reliance Industries (RIL) shares fell 4.4%, wiping out Rs 94,000 crore in market value, Jefferies raised its 12-month price target to Rs 1,830, maintaining a Buy rating. The brokerage cited a potential Jio tariff hike and an IPO of the telecom arm as key triggers for the conglomerate’s next re‑rating, implying roughly 21% upside.",
            "pubDate": "2026-01-07T04:52:48.530399"
        },
        {
            "title": "Senco Gold shares rally 14% on robust Q3 business update, guidance for Q4",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/senco-gold-shares-rally-14-on-robust-q3-business-update-guidance-for-q4/articleshow/126386614.cms",
            "description": "Senco Gold shares surged following a strong third-quarter business update. The company reported significant sales and revenue growth, driven by festive campaigns and new designs. Senco Gold is optimistic about the upcoming wedding season and local festivals. It expects to achieve over 25% year-on-year growth for FY26, supported by its expansion plans and focus on budget-friendly jewellery.",
            "pubDate": "2026-01-07T04:52:48.530491"
        },
        {
            "title": "Swiggy, Premier Energies among 5 F&O stocks that saw a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-premier-energies-among-5-fo-stocks-that-saw-a-sharp-rise-in-futures-open-interest/slideshow/126386477.cms",
            "description": "As of January 6, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 15% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2026-01-07T04:52:48.530581"
        },
        {
            "title": "Meesho shares slide 5% as lock-in ends, bringing fresh stock into the market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-slide-5-as-lock-in-ends-bringing-fresh-stock-into-the-market/articleshow/126386379.cms",
            "description": "Meesho shares fell on Wednesday as a one-month shareholder lock-in expired, making 110 million shares eligible for trading. While the move raised near-term supply concerns, brokerages remain positive on the e-commerce firm’s long-term growth prospects following its strong post-IPO debut.",
            "pubDate": "2026-01-07T04:52:48.530676"
        },
        {
            "title": "Sensex slips over 100 pts, Nifty below 26,200 as geopolitics weigh on earnings optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-100-pts-nifty-below-26200-as-geopolitics-weigh-on-earnings-optimism/articleshow/126386241.cms",
            "description": "Indian equities commenced Wednesday's trading session on a subdued note, with both the Sensex and Nifty experiencing declines. Geopolitical tensions and tariff concerns are dampening optimism surrounding the earnings outlook, preventing the indices from reaching new record highs.",
            "pubDate": "2026-01-07T04:52:48.530768"
        },
        {
            "title": "Venezuela’s stock market soars 50% in a day after Maduro’s arrest. What's behind the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/venezuelas-stock-market-soars-50-in-a-day-after-maduros-arrest-whats-behind-the-rally/articleshow/126386227.cms",
            "description": "Global markets reeled after a dramatic U.S. strike on Venezuela led to the arrest of President Nicolas Maduro, sharpening investor focus on political change and oil flows. A deal to export up to $2 billion of Venezuelan crude to the U.S. weighed on oil prices, even as equities surged, reviving debate over whether the rally marks lasting re-rating or familiar volatility.",
            "pubDate": "2026-01-07T04:52:48.530857"
        },
        {
            "title": "Rain Industries among 5 stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rain-industries-among-5-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126386067.cms",
            "description": "On January 6, five stocks from the NSE universe with a market capitalisation exceeding Rs 1,000 crore appeared on the bullish “White Marubozu” scanner, according to StockEdge.com’s technical scan data. A White Marubozu is a bullish candlestick pattern formed when the opening price is the session’s low and the closing price is the high.Depicted by a long white or green candlestick with no upper shadow and a small or non-existent lower shadow, the pattern indicates sustained buying pressure throughout the session. Traders view it as a sign of strong buyer control and often use it to assess potential future price direction.",
            "pubDate": "2026-01-07T04:52:48.530990"
        },
        {
            "title": "Indian Energy Exchange among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-energy-exchange-among-6-stocks-showing-bullish-rsi-upswing/slideshow/126385932.cms",
            "description": "On January 6, six stocks from the Nifty500 universe featured in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from lower levels is considered an uptrend signal, indicating strengthening price momentum and rising bullish interest, often tracked by traders to identify potential buying opportunities.",
            "pubDate": "2026-01-07T04:52:48.531086"
        },
        {
            "title": "IEX shares extend gains, up 13% in 2 sessions. What's triggering the rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/iex-shares-in-focus-amid-tribunal-scrutiny-of-market-coupling-rules/articleshow/126385820.cms",
            "description": "Indian Energy Exchange shares saw a significant rise. This surge followed investor focus on the market coupling case. The Electricity Appellate Tribunal raised questions about the regulatory framework's formulation. Meanwhile, the exchange reported strong growth in electricity trading volumes for the December quarter. Improved supply conditions contributed to lower power prices.",
            "pubDate": "2026-01-07T04:52:48.531177"
        },
        {
            "title": "Titan shares zoom 4%, hit 52-week high as consumer biz posts 40% YoY growth in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/titan-shares-in-focus-as-consumer-businesses-post-40-yoy-growth-in-q3fy26/articleshow/126385785.cms",
            "description": "Titan Company shares surged to a 52-week high after reporting a robust 40% year-on-year growth in its consumer businesses for Q3 FY26. Strong festive demand and premiumisation trends fueled significant gains across jewellery, watches, and eye care segments, with international business also seeing a substantial 79% rise.",
            "pubDate": "2026-01-07T04:52:48.531270"
        },
        {
            "title": "Godrej Consumer shares gain 2% on strong Q3 business update. Here’s everything you need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-shares-in-focus-on-strong-q3-business-update-heres-everything-you-need-to-know/articleshow/126385770.cms",
            "description": "Godrej Consumer Products shares saw a rise following a strong operational performance. Demand in India improved, boosting the company's outlook. The Home Care segment led growth, with Personal Care also showing recovery. Profitability is expected to improve due to favorable costs and pricing. International operations in GAUM cluster performed well. Consolidated revenue and EBITDA growth are anticipated.",
            "pubDate": "2026-01-07T04:52:48.531361"
        },
        {
            "title": "Lodha Developers shares rise 2% after strong Q3FY26 operating performance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lodha-developers-shares-in-focus-after-reporting-strong-q3fy26-operating-performance/articleshow/126385752.cms",
            "description": "On Wednesday, shares of Lodha Developers experienced a remarkable surge in value. The company announced impressive sales bookings for the December quarter, showcasing a remarkable 25% year-over-year growth. This spike in performance is attributed to the surging demand for residential properties. Moreover, Lodha Developers has strategically expanded its array of projects, unveiling new constructions in vital markets.",
            "pubDate": "2026-01-07T04:52:48.531452"
        },
        {
            "title": "221% gain in 2026? InCred Equities picks 6 smallcap stocks to bet on this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/221-gain-in-2026-incred-equities-picks-6-smallcap-stocks-to-bet-on-this-year/slideshow/126387202.cms",
            "description": "After a bruising 2025 that saw the smallcap index slip nearly 6% and underperform the Nifty, investor sentiment around the segment has remained cautious. However, looking ahead to 2026, InCred Equities believes select opportunities are emerging across the smallcap space. In a recent report, the brokerage has identified six smallcap stocks spanning multiple sectors that could offer value and potentially deliver returns of up to a staggering 221% over the next year. Here’s the full list.",
            "pubDate": "2026-01-07T05:15:34.835088"
        },
        {
            "title": "Rekha Jhunjhunwala’s Titan holding soars to Rs 20,000 crore as stock hits fresh record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rekha-jhunjhunwalas-titan-holding-soars-to-rs-20000-crore-as-stock-hits-fresh-record-high/articleshow/126388156.cms",
            "description": "Titan Company’s strong December-quarter update drove its shares to a fresh record high, significantly boosting Rekha Jhunjhunwala’s notional wealth. Robust growth across jewellery, watches, emerging categories and international markets, supported by premiumisation and store expansion, reinforced Titan’s leadership position and sustained positive investor sentiment.",
            "pubDate": "2026-01-07T06:21:52.690646"
        },
        {
            "title": "A steep fall and a swift bounce: Cupid shares, up 450% in a year, rebound after sharp 36% correction. Should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-steep-fall-and-a-swift-bounce-cupid-shares-up-450-in-a-year-rebound-after-sharp-36-correction-should-you-buy/articleshow/126387625.cms",
            "description": "Cupid shares, up 450% in a year, saw a sharp 36% correction before rebounding on strong volumes, leaving investors debating the next move. Analysts highlight key support near Rs 350–360 and resistance around Rs 430–440, suggesting the uptrend may still hold, though caution is advised amid heightened volatility.",
            "pubDate": "2026-01-07T06:21:52.690775"
        },
        {
            "title": "Balu Forge shares plunge 20%. Is the rout done or is more pain ahead?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/balu-forge-shares-plunge-20-is-the-rout-done-or-is-more-pain-ahead/articleshow/126387564.cms",
            "description": "",
            "pubDate": "2026-01-07T06:21:52.690982"
        },
        {
            "title": "Eternal slides 30% from peak: Can Blinkit parent deliver quick reversal after a 2025 washout?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-slides-30-from-peak-can-blinkit-parent-deliver-quick-reversal-after-a-2025-washout/articleshow/126387580.cms",
            "description": "Eternal shares have fallen over 30% from their peak after a sharp rally, as earnings pressure and valuation concerns triggered profit booking. Brokerages remain divided, with some advising caution in the short term and selective buying on dips for long-term investors.",
            "pubDate": "2026-01-07T06:21:52.691083"
        },
        {
            "title": "Indian banks seen churning stronger Q3 profits after a weak first half. Brokers pick 10 stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-banks-seen-churning-stronger-q3-profits-after-a-weak-first-half-brokers-pick-10-stocks-to-buy/articleshow/126387347.cms",
            "description": "Indian banks are set for a stronger Q3, with brokerages expecting healthier credit growth, stabilising margins and improving asset quality after a weak first half. Analysts highlight that profitability should see a year-on-year rebound, with large private and select PSU banks emerging as preferred picks ahead of the earnings season.",
            "pubDate": "2026-01-07T06:21:52.691199"
        },
        {
            "title": "Kalyan Jewellers shares jump over 5% on strong Q3 FY2026 revenue growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kalyan-jewellers-shares-jump-over-5-on-strong-q3-fy2026-revenue-growth/articleshow/126387297.cms",
            "description": "Kalyan Jewellers India shares rose over 5% after the company reported strong Q3 FY2026 performance, driven by festive demand, robust domestic and international growth, sharp expansion at Candere and continued showroom additions across India and overseas markets.",
            "pubDate": "2026-01-07T06:21:52.691304"
        },
        {
            "title": "NALCO shares scale fresh record high after 14% jump in 4 days. Can the aluminium-backed momentum last?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nalco-shares-scale-fresh-record-high-after-14-jump-in-4-days-can-the-aluminium-backed-momentum-last/articleshow/126388433.cms",
            "description": "NALCO shares hit a fresh record high after a sharp four-day rally, tracking a surge in global aluminium prices to over $3,000 a tonne and strengthening expectations of a supply deficit. Strong quarterly earnings, an improving industry outlook and bullish technical signals have fuelled the momentum, even as overbought indicators raise questions about sustainability.",
            "pubDate": "2026-01-07T06:53:30.902889"
        },
        {
            "title": "What ITR forms reveal about investing choices of Gen Z, millennials",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-itr-forms-reveal-about-investing-choices-of-gen-z-millennials/articleshow/126390427.cms",
            "description": "India’s tax data shows a shift beyond salary-only incomes, with Gen Z and millennials increasingly reporting multiple income sources. ClearTax’s 2025 report highlights a sharp rise in complex filings, led by a 45.4% jump in ITR-3 returns for business and trading income.",
            "pubDate": "2026-01-07T08:35:30.973351"
        },
        {
            "title": "Sensex sheds over 1,100 points in 3 days, Nifty slips 1%: 4 key factors behind the stock market decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-the-stock-market-down-today-sensex-sheds-over-1100-points-in-3-days-nifty-slips-1-4-key-factors-behind-the-decline/articleshow/126389787.cms",
            "description": "Indian equities extended losses for a third straight session as selling in heavyweight stocks, Venezuela-driven geopolitical tensions and weak global cues dragged the Sensex and Nifty lower. Benchmark indices slipped sharply throughout the week, mirroring risk-off sentiment across global markets and heightened volatility driven by macro uncertainty and large-cap pressure.",
            "pubDate": "2026-01-07T08:35:30.973463"
        },
        {
            "title": "Stock market valuation turns favourable after 5 years, re-rating ahead: Morgan Stanley",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-valuation-turns-favourable-after-5-years-re-rating-ahead-morgan-stanley/articleshow/126389557.cms",
            "description": "Indian equities are poised for a strong performance over the next 12-24 months. Morgan Stanley predicts a target of 95,000 for the Sensex. This outlook is driven by cheaper valuations, improving earnings, and supportive government policies. Foreign investor interest is expected to return, boosting market sentiment. The brokerage recommends focusing on domestic cyclical sectors for potential gains.",
            "pubDate": "2026-01-07T08:35:30.973640"
        },
        {
            "title": "Monopoly business: 5 reasons why SBI Securities says subscribe to Bharat Coking Coal IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/monopoly-business-5-reasons-why-sbi-securities-says-subscribe-to-bharat-coking-coal-ipo/articleshow/126389444.cms",
            "description": "SBI Securities recommends subscribing to the Bharat Coking Coal IPO, citing its dominant market position, long reserve life, capacity expansion plans and reasonable valuation, even as India faces a structural coking coal shortage driven by rising steel demand.",
            "pubDate": "2026-01-07T08:35:30.973724"
        },
        {
            "title": "Is the weak rupee a tailwind, or are valuations expensive? 7 stocks from the tourism ecosystem with upside potential of up to 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-weak-rupee-a-tailwind-or-are-valuations-expensive-7-stocks-from-the-tourism-ecosystem-with-upside-potential-of-up-to-30/articleshow/126388899.cms",
            "description": "It will not stop the rich from traveling abroad on their holidays. But the weakness of the rupee surely impacts fencesitters who might rework their travel plans as any excursion abroad would require more dollars. There are also many things that happen to the domestic tourism ecosystem when the rupee weakens. Do these help select players from the tourism ecosystem continue their growth? Check out Stock Reports Plus, powered by Refinitiv, for price targets of over 4,000 listed stocks, along with detailed company analysis focusing on five key components – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardised scores. SR+ Reports is a complimentary offering to ETPrime members.",
            "pubDate": "2026-01-07T08:35:30.973805"
        },
        {
            "title": "Australian shares rebound from 3-week low on mining boost; banks drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/australian-shares-rebound-from-3-week-low-on-mining-boost-banks-drag/articleshow/126388889.cms",
            "description": "Indian shares rebounded on Wednesday after hitting a three-week low. Gains were driven by iron ore and gold miners. Financial stocks saw a dip as inflation remained a concern. Investors are now watching for quarterly inflation data. This will influence the Reserve Bank of Australia's monetary policy meeting in February. The market anticipates a potential rate hike.",
            "pubDate": "2026-01-07T08:35:30.973881"
        },
        {
            "title": "Silver prices take Rs 5,500 hit, tumble 2% today. Should investors buy this dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-prices-take-rs-5500-hit-tumble-2-today-should-investors-buy-this-dip/articleshow/126388715.cms",
            "description": "Silver prices slipped nearly 2% on profit booking after a sharp 2025 rally, even as experts remain positive on the medium-term outlook. Analysts suggest selective buying on dips, cautioning that silver’s high volatility could trigger short-term corrections.",
            "pubDate": "2026-01-07T08:35:30.973958"
        },
        {
            "title": "European stocks pause rally as traders assess Venezuela fallout ahead of data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-pause-rally-as-traders-assess-venezuela-fallout-ahead-of-data/articleshow/126390905.cms",
            "description": "While markets ​have largely looked past the flare-up in global ‌geopolitical risks, ‍Wednesday's pause could be a healthy reset ‍as investors weigh the impact from U.S. actions ‌in Venezuela.zuela fallout ahead of data",
            "pubDate": "2026-01-07T08:58:47.758432"
        },
        {
            "title": "Japan's Nikkei slips 1% from record as investors book profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-slips-1-from-record-as-investors-book-profit/articleshow/126390832.cms",
            "description": "The market ‌also weighed the impact of China's ban on exports of dual-use items to the country. \"China's export ban was a negative cue, but overall, investors sold stocks as the market rose sharply in the past two sessions,\" said ​Naoki Fujiwara, senior fund manager at Shinkin Asset ​Management.stors book profit",
            "pubDate": "2026-01-07T08:58:47.758560"
        },
        {
            "title": "From 232% IPO surge to 60% fall: Ashish Kacholia picks up stake in smallcap Adcounty Media on dips",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-232-ipo-surge-to-60-fall-ashish-kacholia-picks-up-stake-in-smallcap-adcounty-media-on-dips/articleshow/126390689.cms",
            "description": "Ace investor Ashish Kacholia acquired a 2.89% stake in SME stock Adcounty Media India during the December quarter, even as the stock corrected sharply from its post-IPO peak following a strong multibagger rally after listing.",
            "pubDate": "2026-01-07T08:58:47.758667"
        },
        {
            "title": "Broking stocks soar: Anand Rathi Share & Stock Brokers leads with 45% gain in 3 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/broking-stocks-soar-anand-rathi-share-stock-brokers-leads-with-45-gain-in-3-months/articleshow/126390734.cms",
            "description": "Rathi’s standout performance is particularly notable given its recent debut on the stock exchanges on September 30, 2025. Its initial public offering (IPO), the company raised around Rs 746 crore, setting the stage for its strong early momentum.",
            "pubDate": "2026-01-07T08:58:47.758769"
        },
        {
            "title": "Client Associates sets Sensex's 2026 target at 93,918; sees elevated valuations, earnings moderation as headwinds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/client-associates-sets-sensexs-2026-target-at-93918-sees-elevated-valuations-earnings-moderation-as-headwinds/articleshow/126392018.cms",
            "description": "Client Associates has set a December 2026 Sensex target of 93,918, implying 10% annual growth, while cautioning investors about elevated valuations and near-term earnings moderation, and highlighting gold and silver as strategic allocations amid global uncertainty",
            "pubDate": "2026-01-07T10:28:13.247142"
        },
        {
            "title": "12 Nifty500 stocks fall over 50% from their 52-week highs. Is your portfolio impacted?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-nifty500-stocks-fall-over-50-from-their-52-week-highs-is-your-portfolio-impacted/slideshow/126391988.cms",
            "description": "While the benchmark Nifty 50 is trading just 0.7% below its 52-week high of 26,373, and the Nifty 500 is only 0.5% lower, weakness beneath the surface is evident. Nearly 145 Nifty 500 stocks have declined 25–75% from their yearly highs, underscoring how the rally is concentrated in a few large-caps. From this basket, we identified 12 Nifty 500 stocks that have fallen more than 50% from their 52-week highs. (Data Source: ACE Equity)",
            "pubDate": "2026-01-07T10:28:13.247272"
        },
        {
            "title": "AI-led cybersecurity firm Kratikal Tech files for SME IPO, eyes global expansion",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-led-cybersecurity-firm-kratikal-tech-files-for-sme-ipo-eyes-global-expansion/articleshow/126392943.cms",
            "description": "AI-led cybersecurity firm Kratikal Tech has filed its DRHP for an SME IPO on BSE, aiming to fund global expansion and product development. The company plans to scale its AI-driven platforms amid rising global demand for cybersecurity solutions.",
            "pubDate": "2026-01-07T11:22:50.751263"
        },
        {
            "title": "REC stock showing signs of bottoming out after falling by about 30% from highs, time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rec-stock-showing-signs-of-bottoming-out-after-falling-by-about-30-from-highs-time-to-buy/articleshow/126371917.cms",
            "description": "REC Ltd stock has broken out of a triangular consolidation, signaling a potential resumption of its primary uptrend. Experts suggest short-term traders with a high-risk profile can buy the stock for a target of Rs 430, with a stop loss at Rs 355.",
            "pubDate": "2026-01-07T11:37:42.619360"
        },
        {
            "title": "Vedanta, Titan Company among 7 stocks hit 52-week highs; gains up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-titan-company-among-7-stocks-hit-52-week-highs-gains-up-to-20-in-a-month/slideshow/126394162.cms",
            "description": "On Wednesday, the benchmark Sensex slipped 102 points to end at 84,961. Despite mild weakness in the broader market, seven stocks climbed to new 52-week highs, reaching their best levels in a year. Such breakouts typically signal strong bullish momentum and could indicate further upside in the near term.",
            "pubDate": "2026-01-07T11:55:19.870843"
        },
        {
            "title": "Gainers & Losers: Meesho among 7 stocks that were under the spotlight on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-meesho-among-7-stocks-that-were-under-the-spotlight-on-wednesday/slideshow/126394630.cms",
            "description": "",
            "pubDate": "2026-01-07T12:31:05.372671"
        },
        {
            "title": "Bernstein warns of regulatory storm for IEX as market-coupling case plays out",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bernstein-warns-of-regulatory-storm-for-iex-as-market-coupling-case-plays-out/articleshow/126394510.cms",
            "description": "Bernstein warns that Indian Energy Exchange faces a “regulatory storm” despite recent legal relief in the market-coupling case. The brokerage maintains an underperform rating, arguing that policy risks around coupling, transaction charges, and returns overshadow operating gains, even as IEX shares rally on favourable signals from the appellate tribunal.",
            "pubDate": "2026-01-07T12:31:05.372801"
        },
        {
            "title": "Angel One board to meet on January 15 to consider stock split, first interim dividend for FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/angel-one-board-to-meet-on-january-15-to-consider-stock-split-first-interim-dividend-for-fy26/articleshow/126397192.cms",
            "description": "Angel One’s board will meet on January 15 to consider a stock split and its first interim dividend for FY26, alongside Q3 earnings, amid weak stock performance despite strong recent quarterly profit growth.",
            "pubDate": "2026-01-07T14:57:00.341357"
        },
        {
            "title": "Two Trades for Today: Two pharma stocks, one a mid-cap for a 6.7% gain, the other a large-cap for an upmove of almost 6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-two-pharma-stocks-one-a-mid-cap-for-a-6-7-gain-the-other-a-large-cap-for-an-upmove-of-almost-6/articleshow/126397042.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2026-01-07T14:57:00.341494"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/126397701.cms",
            "description": "Indian equities declined for a third session as heavyweight selling, geopolitical tensions and weak global cues dented sentiment. Analysts expect a cautious, range-bound market ahead of Q3 earnings and key US data, advising selective buying in defensives and large-cap themes.",
            "pubDate": "2026-01-07T15:44:46.936299"
        },
        {
            "title": "Market Trading Guide: Buy IEX and ABB India on Thursday for up to 6% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-iex-and-abb-india-on-thursday-for-up-to-6-gains/slideshow/126397622.cms",
            "description": "Nifty closed lower on Monday, marking their second consecutive decline. Except for IT, selling pressure was broad-based, with realty, metal and chemical stocks seeing the sharpest losses. The index has closed below its 50 EMA on the hourly chart.Commenting on the day's action, Vatsal Bhuva, Technical Analyst at LKP Securities the index has slipped under the strong 26,000 support near its 10-day EMA, forming a bearish candlestick and signaling short-term weakness. \"A further retracement is likely if the index opens or closes below the 10-day EMA at 25950, which could push it toward the 20-day EMA placed at 25850 levels. Support for the index stands at 25850, and a cautious stance is advisable if it breaks below this level, while resistance remains at 26100,\" Bhuva said.Here are 5 stock recommendations for Tuesday:",
            "pubDate": "2026-01-07T15:44:46.936425"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/126399463.cms",
            "description": "This may come as a surprise to many, but the fact is that it is very rare for the first few trading sessions of a new year to see a clear bullish trend. Even in the best of bull years, the initial weeks of the year have had a higher probability of volatility. The reason is simple: The decision on allocation of funds to emerging markets is still to happen, leading to slightly higher volatility during this period. So, be volatility-ready, and be selective in your choice of stocks, especially if they are from the mid-cap segment.",
            "pubDate": "2026-01-07T17:58:37.853323"
        },
        {
            "title": "Mangalam Drugs & Organics bulk deal: Vijay Kedia sells 1.38 lakh shares worth Rs 48 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mangalam-drugs-organics-bulk-deal-vijay-kedia-sells-1-38-lakh-shares-worth-rs-48-lakh/articleshow/126398224.cms",
            "description": "Microcap Mangalam Drugs saw multiple bulk deals as Vijay Kedia’s firm sold shares, yet the stock rose five percent. Despite a month-long rally, the stock remains deeply down year-on-year and trades below key moving averages after prolonged price erosion phase.",
            "pubDate": "2026-01-07T17:58:37.853450"
        },
        {
            "title": "Stock Radar: Tata Steel hits record highs in January 2026; will the rally continue?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-tata-steel-hits-record-highs-in-january-2026-will-the-rally-continue/articleshow/126391306.cms",
            "description": "Tata Steel's shares have hit an all-time high following a phase of stabilization. Analysts suggest that investors seize the opportunity to buy with a target of Rs 215 within the upcoming month or two. The stock demonstrates robust upward trends, consistently trading above crucial moving averages.",
            "pubDate": "2026-01-07T23:46:47.416849"
        }
    ]
}