{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-22T09:57:56.555688",
    "items": [
        {
            "title": "Retail investors cut stake in these 8 multibagger smallcap stocks. Are you in or out?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-cut-stake-in-these-8-multibagger-smallcap-stocks-are-you-in-or-out/slideshow/124733590.cms",
            "description": "The winds of change are sweeping through the smallcap universe. In a surprising twist, retail investors have quietly trimmed their stakes in nearly 278 smallcap companies during the September quarter, even as many of these stocks were sprinting ahead. (Retail investors: resident individuals holding nominal share capital of up to Rs 2 lakh). About 225 stocks have delivered positive returns to investors so far in FY26.Around 58 of them have already soared more than 50%, proving once again that the smallcap segment remains a treasure trove of opportunities for those who dare to stay the course. Among them, eight standout smallcaps have turned into true multibaggers, clocking jaw-dropping gains of 100% to 175%. (Data Source: ACE Equity)",
            "pubDate": "2025-10-22T05:53:24.073537"
        },
        {
            "title": "Fed set to cut interest rates twice before year-end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-set-to-cut-interest-rates-twice-before-year-end/slideshow/124733503.cms",
            "description": "The Federal Reserve is expected to lower its key interest rate by 25 basis points next week, with another cut likely in December, according to a Reuters poll of economists. The focus remains on balancing inflation pressures with a weakening labour market. (Source: Reuters)",
            "pubDate": "2025-10-22T05:53:24.073672"
        },
        {
            "title": "Japan becomes a safe haven amid global market uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japan-becomes-a-safe-haven-amid-global-market-uncertainty/slideshow/124733298.cms",
            "description": "Global investors are returning to Japan’s stock and bond markets, attracted by the promises of the new reflationist government. They are also seeking to diversify from pricier U.S. and European markets. Japan’s Nikkei has reached record highs as investors anticipate stimulative policies from Prime Minister Sanae Takaichi. (Source: Reuters)",
            "pubDate": "2025-10-22T05:53:24.073781"
        },
        {
            "title": "Goldman Sachs sees 30% upside for China stocks through 2027",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-sachs-sees-30-upside-for-china-stocks-through-2027/articleshow/124733215.cms",
            "description": "According to Goldman Sachs, China's stock market is poised for an impressive ascent, potentially surging 30% by the close of 2027. This anticipated growth is turbocharged by favorable government strategies, rising corporate earnings, and burgeoning investor enthusiasm.",
            "pubDate": "2025-10-22T05:53:24.073886"
        },
        {
            "title": "Asian bonds face $5.48 billion outflow in September amid regional slowdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-bonds-face-5-48-billion-outflow-in-september-amid-regional-slowdown/slideshow/124733142.cms",
            "description": "Asian bond markets faced significant outflows in September, driven by fiscal, political, and economic concerns across the region. (Source: Reuters)",
            "pubDate": "2025-10-22T05:53:24.073990"
        },
        {
            "title": "Stocks to buy in Samvat 2082: Over 70 names put together from top brokerages for your ease",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-samvat-2082-over-70-names-put-together-from-top-brokerages-for-your-ease/slideshow/124733165.cms",
            "description": "As the new Samvat year begins, leading brokerages have released their Diwali picks — a collection of more than 70 stock ideas across sectors expected to shine through Samvat 2082. The themes are clear: earnings recovery, domestic consumption, manufacturing tailwinds, and government-led infrastructure push.",
            "pubDate": "2025-10-22T05:53:24.074092"
        },
        {
            "title": "Sensex zooms over 4,000 points in Diwali month: Is this the beginning of new bull run?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/caption-dalal-street-roars-back-as-fiis-return-with-rs-7300-crore-boost/articleshow/124732943.cms",
            "description": "Dalal Street is experiencing a strong rebound, with the Sensex surging 5% in October driven by a significant return of foreign institutional investors. This rally, nearing all-time highs, has market veterans questioning if it signals a new bull cycle or a temporary festive surge, with earnings growth being a key determinant.",
            "pubDate": "2025-10-22T05:53:24.074189"
        },
        {
            "title": "US Fed to trim rates twice more this year; 2026 rate path very unclear",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-to-trim-rates-twice-more-this-year-2026-rate-path-very-unclear/articleshow/124731875.cms",
            "description": "Economists polled by Reuters anticipate the Federal Reserve will implement two 25-basis-point interest rate cuts this year, with the first expected next week. This shift in forecast reflects a growing concern among policymakers about the labor market's weakening, despite ongoing inflation risks. However, significant division exists regarding the Fed's rate trajectory by the end of next year.",
            "pubDate": "2025-10-22T05:53:24.074287"
        },
        {
            "title": "Global investors like the new-look Japan government, for now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-investors-like-the-new-look-japan-government-for-now/articleshow/124731845.cms",
            "description": "Japan's financial landscape is becoming a hotspot for investors once more, thanks to an invigorated government promising fiscal stimulus and tax incentives. Global fund managers are enticed by the prospect of diversifying their portfolios away from the inflated markets of the U.S. and Europe.",
            "pubDate": "2025-10-22T05:53:24.074381"
        },
        {
            "title": "Wall Street ends mixed as earnings lift the Dow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-mixed-as-earnings-lift-the-dow/articleshow/124731754.cms",
            "description": "US stocks saw a mixed close Tuesday. The Dow Jones Industrial Average led gains, driven by strong earnings in industrials and capital goods. Other sectors experienced mixed performance. Investors are closely watching upcoming earnings reports from major companies. The market shows a degree of indecision as it hovers near record highs.",
            "pubDate": "2025-10-22T05:53:24.074494"
        },
        {
            "title": "Stock Market Holiday: Are NSE, BSE open or closed today for Diwali Balipratipada?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-are-nse-bse-open-or-closed-today-for-diwali-balipratipada/articleshow/124731626.cms",
            "description": "Indian stock markets will be closed on Wednesday, October 22, for Diwali Balipratipada. This follows a symbolic Muhurat trading session that marked the start of Samvat 2082. Normal trading will resume on Thursday, October 23. Market experts anticipate a profit-led revival for equities in the new Samvat year. Corporate profit recovery is key to market performance.",
            "pubDate": "2025-10-22T05:53:24.074593"
        },
        {
            "title": "Has Muhurat trading set the tone for a bullish Samvat 2082?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/has-muhurat-trading-set-the-tone-for-a-bullish-samvat-2082/articleshow/124731477.cms",
            "description": "Indian stock markets began the new Samvat year with gains. Experts anticipate double-digit returns in the coming year. This optimism is fueled by ample liquidity and expected consumption growth. A resolution of tariff issues is also a key factor. Foreign investors may engage in short-covering rallies. The market closed higher in special Muhurat trading.",
            "pubDate": "2025-10-22T05:53:24.074695"
        },
        {
            "title": "Goldman basket shows painful month for shorts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/goldman-basket-shows-painful-month-for-shorts/articleshow/124731432.cms",
            "description": "US stocks are seeing aggressive buying as short-sellers are caught in a squeeze. This surge is happening despite lingering uncertainty around trade talks and Federal Reserve policy. Investors are covering their short positions, pushing the market higher. However, this rally might not reflect the true economic outlook. Traders are now increasing protection against downturns, indicating a shift in market sentiment.",
            "pubDate": "2025-10-22T05:53:24.074788"
        },
        {
            "title": "Trader says asset class correlation looks weird",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trader-says-asset-class-correlation-looks-weird/articleshow/124731410.cms",
            "description": "Equity markets are experiencing an unusual rally, with indexes and gold reaching record highs despite ongoing concerns.  Volatility remains low, retail buying is strong, and AI spending continues to surge, defying historical correlations.  Traders are puzzled by this 'weird' market behavior, questioning if recent gains are a temporary blip or a more significant warning.",
            "pubDate": "2025-10-22T05:53:24.074879"
        },
        {
            "title": "Will Samvat 2082 deliver stronger returns after a volatile year for equities?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-samvat-2082-deliver-stronger-returns-after-a-volatile-year-for-equities/articleshow/124731371.cms",
            "description": "Indian equities saw modest gains in Samvat 2081 after a previous year's rally, with domestic investors supporting the market amidst foreign selling. As Samvat 2082 begins, positive sentiment is returning, driven by hopes of GST simplification and RBI liquidity. Experts anticipate better returns this year, with opportunities in banking, consumption, and domestic-focused sectors.",
            "pubDate": "2025-10-22T05:53:24.074976"
        },
        {
            "title": "Sebi panel mulls higher fees for clearing corporations, impacting NSE earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-panel-mulls-higher-fees-for-clearing-corporations-impacting-nse-earnings/articleshow/124731334.cms",
            "description": "A Sebi-constituted working group is proposing to increase transaction charges for clearing corporations like NSE Clearing. This move aims to bolster their financial independence and strengthen their balance sheets, potentially impacting NSE's standalone earnings ahead of its IPO. Clearing members may also contribute to the settlement guarantee fund.",
            "pubDate": "2025-10-22T05:53:24.075067"
        },
        {
            "title": "After consolidation, ripe for another re-rating? 8 power stocks from different segments with an upside potential of up to 46%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-consolidation-ripe-for-another-re-rating-8-power-stocks-from-different-segments-with-an-upside-potential-of-up-to-46/articleshow/124736623.cms",
            "description": "As the bulls make a comeback, investors are faced with the age-old dilemma: Hold, or sell, or, indeed, buy? In the case of some sectors, the dilemma is more acute. In times of such confusion, look for answers to three questions. One: Are the fundamentals of the sector on a strong footing? Two: Does the business and sector have a high probability of continued growth? And three: How is the valuation? The smog will clear and you will take a rational approach rather than looking at the antics of the Nifty and Sensex and making decisions based on their movement.",
            "pubDate": "2025-10-22T09:57:53.942145"
        },
        {
            "title": "Diwali 2025: Top Nifty stocks offering upside of up to 28% to bet on this Samvat 2082",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-2025-top-nifty-stocks-offering-upside-of-up-to-28-to-bet-on-this-samvat-2082/slideshow/124736804.cms",
            "description": "As the festive season draws to a close, leading brokerages have highlighted a select set of Nifty stocks with strong growth potential and robust fundamentals. These companies, spanning banking, energy, healthcare, automotive, defence, and consumer segments, come with buy recommendations and attractive target prices. These picks reflect the analysts’ confidence in sustainable earnings, strategic expansion, and long-term value creation. Here’s the full list!",
            "pubDate": "2025-10-22T09:57:53.942275"
        },
        {
            "title": "Japanese stocks rise to record high on report of new government stimulus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japanese-stocks-rise-to-record-high-on-report-of-new-government-stimulus/articleshow/124735976.cms",
            "description": "Japanese stocks rallied to a record peak on Wednesday as markets reacted positively to a Reuters report that the new premier is preparing a sizeable stimulus package that includes measures to help households tackle inflation.",
            "pubDate": "2025-10-22T09:57:53.942400"
        },
        {
            "title": "Gift Nifty signals gap-up start for Thursday. Can Nifty clinch fresh all-time high above 26,277?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-signals-gap-up-start-for-thursday-can-nifty-clinch-fresh-all-time-high-above-26277/articleshow/124735953.cms",
            "description": "Dalal Street is rebounding after three months of foreign selling, with FIIs pumping over Rs 7,300 crore into equities. Nifty nears its all-time high as optimism around an India-US trade deal lifts sentiment. Muhurat Trading closed positively, and a potential new record looms, driven by easing tariffs and bilateral cooperation.",
            "pubDate": "2025-10-22T09:57:53.942504"
        }
    ]
}