{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-16T06:45:35.158617",
    "items": [
        {
            "title": "Holy trinity of promoters, FIIs and DIIs bought these 21 stocks. Can they be the next big stars?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/holy-trinity-of-promoters-fiis-and-diis-bought-these-21-stocks-can-they-be-the-next-big-stars/articleshow/123329730.cms",
            "description": "In the June 2025 quarter, 21 companies saw simultaneous buying from promoters, FIIs, and DIIs, signaling confidence in long-term prospects despite mixed stock performance. Experts view this “holy trinity” alignment as a strong indicator of underlying business strength and investor trust.",
            "pubDate": "2025-08-16T06:45:27.116110"
        },
        {
            "title": "Power Grid, Suzlon, UltraTech among 5 stocks with 28% potential upside. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-grid-suzlon-ultratech-among-5-stocks-with-28-potential-upside-heres-why/slideshow/123329532.cms",
            "description": "Even as markets remain topsy-turvy (Nifty down 2%) amid lacklustre Q1 and tariff-related uncertainties, a couple of brokerages have picked their conviction buys with potential upside of 28%. Here's what they recommended and why: Buy Power Grid around Rs 289 | Target: 369 | Upside: 28%",
            "pubDate": "2025-08-16T06:45:27.116233"
        },
        {
            "title": "Investors react to US-Russia summit reaching no agreement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-react-to-us-russia-summit-reaching-no-agreement/articleshow/123329403.cms",
            "description": "The Trump-Putin Alaska summit ended without any breakthrough on Ukraine, though both leaders cited progress on unspecified issues. Markets reacted calmly, with analysts noting no sanctions impact and limited geopolitical influence on investor sentiment.",
            "pubDate": "2025-08-16T06:45:27.116339"
        },
        {
            "title": "From Paytm to Eternal: 42 stocks where India's top performing PMS fund managers are betting on",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-paytm-to-eternal-42-stocks-where-indias-top-performing-pms-fund-managers-are-betting-on/articleshow/123329257.cms",
            "description": "India’s top-performing PMS funds placed bold bets in July across 42 stocks, spanning fintech giants, healthcare disruptors, agrochemicals, and industrial leaders. With strategies focused on digital disruption, speciality chemicals, and consumption growth, money managers are positioning portfolios for India’s next phase of growth.",
            "pubDate": "2025-08-16T06:45:27.116442"
        },
        {
            "title": "Wall Street Week Ahead: US stocks train sights on Jackson Hole Fed gathering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-stocks-train-sights-on-jackson-hole-fed-gathering/articleshow/123329006.cms",
            "description": "Investors are keenly waiting for the Jackson Hole symposium. Federal Reserve policymakers will gather to discuss interest rate cuts. These cuts could potentially boost stock prices. Jerome Powell's speech on Friday will be crucial. Market anticipates further rate cuts this year. Sectors like homebuilders and industrials may benefit. Powell needs to balance economic outlook to avoid market disruption.",
            "pubDate": "2025-08-16T06:45:27.116539"
        },
        {
            "title": "World equities flat, crude oil prices fall as Trump, Putin hold high-stakes talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/world-equities-flat-crude-oil-prices-fall-as-trump-putin-hold-high-stakes-talks/articleshow/123328995.cms",
            "description": "Global stock markets remained stable near record highs on Friday. Donald Trump and Vladimir Putin met in Alaska to discuss Ukraine. US Treasury bond prices declined amid expectations of a Federal Reserve rate cut. The Dow reached a new intraday high. European shares saw a slight pullback after nearing a five-month high.",
            "pubDate": "2025-08-16T06:45:27.116633"
        },
        {
            "title": "European shares log second weekly gain, focus on Trump-Putin talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-log-second-weekly-gain-focus-on-trump-putin-talks/articleshow/123328972.cms",
            "description": "European shares experienced a slight dip, influenced by declines in tech and financial sectors, even as investors eyed the U.S.-Russia summit. While miners and healthcare showed gains, corporate earnings painted a mixed picture. Pandora's significant fall due to weakening sales and Standard Chartered's probe call impacted market sentiment.",
            "pubDate": "2025-08-16T06:45:27.116724"
        },
        {
            "title": "Dow ends higher after UnitedHealth gains, other indexes slip on rate cut uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dow-ends-higher-after-unitedhealth-gains-other-indexes-slip-on-rate-cut-uncertainty/articleshow/123328955.cms",
            "description": "The Dow Jones closed higher, hitting a record high, propelled by UnitedHealth's surge after Berkshire Hathaway increased its stake. Other indexes slipped amid mixed economic data impacting Federal Reserve's policy decisions. Investors are anticipating a potential rate cut in September. Trump and Putin's meeting in Alaska raised hopes for resolving the Ukraine conflict and influencing crude prices.",
            "pubDate": "2025-08-16T06:45:27.116830"
        },
        {
            "title": "It's only a matter of time before Trump blinks on tariff: Chris Wood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/its-only-a-matter-of-time-before-trump-blinks-on-tariff-chris-wood/articleshow/123328778.cms",
            "description": "Christopher Wood suggests buying Indian equities despite US tariffs. He believes Trump will eventually reverse the tariffs. Wood highlights India's geopolitical importance and notes the unusual nature of the tariffs. He mentions India's underperformance in equities and links the second tariff tranche to India's Russian oil purchases. Wood also observes the US Federal Reserve's potential rate cut in September.",
            "pubDate": "2025-08-16T06:45:27.116923"
        }
    ]
}