{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-18T19:43:27.289888",
    "items": [
        {
            "title": "Weak credit growth and rate cuts to squeeze profit at HDFC, ICICI Banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/weak-credit-growth-and-rate-cuts-to-squeeze-profit-at-hdfc-icici-banks/articleshow/122721349.cms",
            "description": "Indian markets face pressure as the Reserve Bank of India's rate cuts impact margins. Finance Minister Nirmala Sitharaman urges government banks to boost lending amid weakening credit growth. HDFC Bank and ICICI Bank anticipate limited profit growth due to margin compression. Infosys eyes tariff concerns, while Nestle India expects revenue growth.",
            "pubDate": "2025-07-18T05:47:06.756648"
        },
        {
            "title": "JSW Steel Q1 results today: Strong bottomline surge likely despite muted volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q1-results-today-strong-bottomline-surge-likely-despite-muted-volumes/articleshow/122712033.cms",
            "description": "JSW Steel is poised to announce strong Q1 FY26 results, with analysts predicting a 130% YoY surge in profit after tax. Revenue is expected to increase modestly by 4% YoY, driven by improved realisations and lower raw material costs. While standalone volumes are slightly up YoY, they are down sequentially due to maintenance.",
            "pubDate": "2025-07-18T05:47:06.756787"
        },
        {
            "title": "Can Wipro sustain its momentum despite global business uncertainties?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-wipro-sustain-its-momentum-despite-global-business-uncertainties/articleshow/122702997.cms",
            "description": "Wipro's June quarter exceeded muted expectations, driven by new deal traction and recent acquisitions. The company secured nearly $5 billion in total contract value, including $2.7 billion in large deals. While global uncertainty persists, Wipro anticipates sequential revenue to range from a 1% decline to a 1% increase for the September quarter, reflecting cautious optimism.",
            "pubDate": "2025-07-18T05:47:06.756897"
        },
        {
            "title": "Rising costs, muted demand to weigh on FMCG margins in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rising-costs-muted-demand-to-weigh-on-fmcg-margins-in-q1/articleshow/122702634.cms",
            "description": "FMCG companies anticipate a slight sales volume increase for the June quarter, with revenue growth varying due to pricing strategies and demand. While some firms may face margin pressure from rising material costs and advertising, Marico and Tata Consumer Products are favored by analysts. The Nifty FMCG index has recently outperformed broader market indices.",
            "pubDate": "2025-07-18T05:47:06.756999"
        },
        {
            "title": "Flat income, heavy loan buffers bring down Axis Bank net profit in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/flat-income-heavy-loan-buffers-bring-down-axis-bank-net-profit-in-q1/articleshow/122700681.cms",
            "description": "Axis Bank's June quarter net profit declined by 4% to ₹5,806 crore, falling short of estimates due to increased provisions and sluggish business income. Net interest income remained flat, and net interest margin contracted. Asset quality deteriorated, with a rise in gross non-performing assets and slippages, partly attributed to changes in technical recognition criteria.",
            "pubDate": "2025-07-18T05:47:06.757101"
        },
        {
            "title": "Indian Overseas Bank Q1 profit shoots up 76% YoY to Rs 1,111 crore on recoveries, lower provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-overseas-bank-q1-profit-shoots-up-76-yoy-to-rs-1111-crore-on-recoveries-lower-provisions/articleshow/122762372.cms",
            "description": "Indian Overseas Bank posted a 76% YoY rise in June quarter profit to Rs 1,111 crore, aided by higher recoveries, improved asset quality, lower provisions, and increased income. Gross NPA fell to 1.97%, while NII rose 12.5%.",
            "pubDate": "2025-07-18T09:54:02.145552"
        },
        {
            "title": "ICICI Bank Q1 Results Preview: PAT seen to grow up to 12% YoY. NII could rise by up to 9% amid margin contraction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q1-results-preview-pat-seen-to-grow-up-to-12-yoy-nii-could-rise-by-up-to-9-amid-margin-contraction/articleshow/122761129.cms",
            "description": "ICICI Bank is expected to post steady Q1FY26 results with up to 12% YoY PAT growth and modest NII gains. However, margin compression, higher provisions, and deposit trends are key concerns to monitor ahead of July 19 earnings.",
            "pubDate": "2025-07-18T09:54:02.145681"
        },
        {
            "title": "HDFC Bank Q1 results preview: PAT, NII may grow by up to 6% YoY. 7 key things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q1-results-preview-pat-nii-may-grow-by-up-to-6-yoy-7-key-things-to-watch-out-for/articleshow/122733743.cms",
            "description": "HDFC Bank is set to announce its Q1 earnings, with analysts predicting moderate profit growth but pressure on net interest margins. Net profit is expected to rise by 1.5-6% YoY, while NII may grow by 4.6-6.2%. Loan growth remains sluggish, but deposit growth has improved.",
            "pubDate": "2025-07-18T09:54:02.145806"
        },
        {
            "title": "RIL Q1 Results: 10 key takeaways from Mukesh Ambani-led energy-to-retail conglomerate's earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-q1-results-10-key-takeaways-from-mukesh-ambani-led-energy-to-retail-conglomerates-earnings/articleshow/122768963.cms",
            "description": "Reliance Industries reported its highest-ever quarterly net profit of ₹26,994 crore in Q1FY26, up 78% YoY, driven by strong growth in telecom, retail, and oil-to-chemicals segments. Jio crossed 200 million 5G users, while retail and Jio-bp delivered solid gains.",
            "pubDate": "2025-07-18T19:43:17.437610"
        },
        {
            "title": "JioStar posts Rs 581 crore net profit in Q1 driven by IPL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jiostar-posts-rs-581-crore-net-profit-in-q1-driven-by-ipl/articleshow/122768756.cms",
            "description": "JioStar, the RIL-Disney joint venture, posted a Q1FY26 net profit of ₹581 crore and ₹9,601 crore revenue, driven by IPL’s record performance on TV and digital. Despite weak FMCG ad spends, strong sports and subscription income lifted earnings.",
            "pubDate": "2025-07-18T19:43:17.437739"
        },
        {
            "title": "Jio Platforms Q1 profit rises 25% to Rs 7,110 crore as 5G, broadband user base grows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jio-platforms-q1-profit-rises-25-to-rs-7110-crore-as-5g-broadband-user-base-grows/articleshow/122768599.cms",
            "description": "Jio Platforms reported a 25% YoY rise in Q1FY26 net profit to ₹7,110 crore, led by strong 5G and broadband user growth. Revenue rose 19% YoY to ₹35,032 crore. Subscriber additions and higher ARPU drove performance amid rising digital consumption.",
            "pubDate": "2025-07-18T19:43:17.437856"
        },
        {
            "title": "Reliance Retail Q1 profit rises 28% to Rs 3,271 crore despite early monsoon impact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-retail-q1-profit-rises-28-to-rs-3271-crore-despite-early-monsoon-impact/articleshow/122768406.cms",
            "description": "Reliance Retail posted an 11% revenue rise to Rs 84,171 crore and 28% profit growth in Q1 FY26. Despite early monsoon affecting electronics sales, recovery is underway. Strong gains were seen across grocery, fashion, and digital platforms like JioMart.",
            "pubDate": "2025-07-18T19:43:17.437963"
        },
        {
            "title": "Reliance Retail Q1 Results: PAT rises 28% YoY to Rs 3,271 crore, revenue up 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-retail-q1-results-pat-rises-28-yoy-to-rs-3271-crore/articleshow/122767925.cms",
            "description": "Reliance Retail, a division of RIL, saw its net profit increase by 28% year over year. The profit reached Rs 3,271 crore in the first quarter. Revenues also increased by 11% year over year, totaling Rs 73,720 crore. Mukesh Ambani said that the retail business saw growth in its customer base. The customer base expanded to 358 million.",
            "pubDate": "2025-07-18T19:43:17.438067"
        },
        {
            "title": "Reliance Jio Q1 Results: PAT grows 25% YoY to Rs 7,110 crore; ARPU at Rs 208.8",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-jio-q1-results-pat-grows-25-yoy-to-rs-7110-crore/articleshow/122767664.cms",
            "description": "Reliance Jio, the telecom and digital division of RIL, has announced a significant 25% year-on-year increase in net profit, reaching ₹7,110 crore for the first quarter. The company's revenues also saw substantial growth, climbing 19% year-on-year to ₹41,054 crore during the same period.",
            "pubDate": "2025-07-18T19:43:17.438171"
        },
        {
            "title": "Reliance Industries Q1 Results: Cons PAT jumps 78% YoY to Rs 26,994 cr, beats Street estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/reliance-industries-q1-results-cons-pat-jumps-78-yoy-to-rs-26994-crorem-beats-streets-estimates/articleshow/122767184.cms",
            "description": "Reliance Industries Q1 Results: Mukesh Ambani led Reliance Industries (RIL) on Friday reported a 78% growth in its Q1FY26 consolidated net profit at Rs 26,994 crore versus Rs 15,138 crore in the year ago period. The profit is attributable to the owners of the company and is above Street's estimates of Rs 22,069 crore.",
            "pubDate": "2025-07-18T19:43:17.438276"
        },
        {
            "title": "Bandhan Bank Q1 profit drops 65% to Rs 372 crore due to stress in microfinance book",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bandhan-bank-q1-profit-drops-65-to-rs-372-crore-due-to-stress-in-microfinance-book/articleshow/122767190.cms",
            "description": "Bandhan Bank reported a 65% decline in Q1FY26 net profit at ₹372 crore, hit by elevated slippages and provisions in its microfinance portfolio. Gross NPAs rose to 4.96%. Operating profit fell 14% due to weaker net interest income.",
            "pubDate": "2025-07-18T19:43:17.438376"
        },
        {
            "title": "Bandhan Bank Q1 Results: PAT falls 65% YoY to Rs 372 crore, NII down 8%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bandhan-bank-q1-results-pat-falls-65-yoy-to-rs-372-crore-nii-down-8/articleshow/122765454.cms",
            "description": "Bandhan Bank posted a 65% YoY decline in Q1FY26 net profit to Rs 372 crore, driven by higher provisions. Despite this, deposits grew 16% and retail term deposits surged 34% YoY. Asset quality remains stable with 5% gross NPA.",
            "pubDate": "2025-07-18T19:43:17.438491"
        },
        {
            "title": "JSW Steel Q1 Results: Cons PAT spikes 158% YoY to Rs 2,184 crore, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q1-results-cons-pat-spikes-158-yoy-to-rs-2184-crore-beats-estimates/articleshow/122763301.cms",
            "description": "JSW Steel announced a significant 158% YoY surge in its Q1FY26 consolidated net profit, reaching Rs 2,184 crore, exceeding Street estimates. While revenue saw a marginal increase, the company benefited from higher volumes and reduced coking coal costs, leading to a 37% YoY rise in operating EBITDA. Crude steel production also increased, though capacity utilization was impacted by planned maintenance.",
            "pubDate": "2025-07-18T19:43:17.438596"
        }
    ]
}