{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-18T01:44:44.778755",
    "items": [
        {
            "title": "GIFT Nifty down 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125398804.cms",
            "description": "Nifty closed above 26,000 on Monday, buoyed by positive Q2 earnings and strong domestic factors. Analysts anticipate a continued upward trend, with support at the 21-DMA around 25,790. The market sentiment remains bullish, presenting buying opportunities on pullbacks.",
            "pubDate": "2025-11-18T01:44:30.937562"
        },
        {
            "title": "Stocks in news: RIL, Tata Power, JSW Energy, HCL Tech, Inox Green",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-tata-power-jsw-energy-hcl-tech-inox-green/articleshow/125398778.cms",
            "description": "Indian markets climbed for a sixth day, with Nifty nearing 26,013. Investors watch global cues amid US market volatility. RIL's beauty arm partnered with Germany's cosnova Beauty. Tata Power commissioned a 300 MW solar project. KPI Green secured a Rs 696.50 crore solar project order. Inox Green faced grid connectivity issues for a wind project.",
            "pubDate": "2025-11-18T01:44:30.937677"
        },
        {
            "title": "Asian stocks decline ahead of Nvidia earnings, US jobs data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-decline-ahead-of-nvidia-earnings-us-jobs-data/articleshow/125398758.cms",
            "description": "Asian markets opened lower following a Wall Street slide. Investors are cautious, moving away from risky assets. This sentiment is driven by upcoming Nvidia earnings and a crucial US jobs report. Global stock gauges are at a one-month low. Bitcoin also saw a significant drop. Uncertainty surrounds interest rates and tech valuations.",
            "pubDate": "2025-11-18T01:44:30.937852"
        },
        {
            "title": "Can Groww sustain its rally, or is a correction around the corner?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-groww-sustain-its-rally-or-is-a-correction-around-the-corner/articleshow/125398728.cms",
            "description": "Groww's parent company, Billionbrains Garage Ventures, has achieved a market capitalization exceeding ₹1 lakh crore. This milestone follows a significant surge in its stock price since its listing. Analysts are cautioning investors about potential overvaluation. New investors are advised to wait for dips before entering the market.",
            "pubDate": "2025-11-18T01:44:30.937935"
        },
        {
            "title": "AI story could unwind next year and India's likely to benefit: CLSA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ai-story-could-unwind-next-year-and-indias-likely-to-benefit-clsa/articleshow/125398695.cms",
            "description": "CLSA's equity strategist predicts an AI bubble burst within a year due to concerns over returns on significant sector investments. This sell-off is expected to benefit India as investors reallocate funds from Taiwan and Korea, seeking less frothy markets. India's appeal lies in its cheaper valuations and the exhaustion of alternative investment options.",
            "pubDate": "2025-11-18T01:44:30.938014"
        },
        {
            "title": "Can Hero MotoCorp sustain its fast-paced gains with rising exports, EV sales?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-hero-motocorp-sustain-its-fast-paced-gains-with-rising-exports-and-ev-momentum/articleshow/125398591.cms",
            "description": "Hero MotoCorp's stock reached a 52-week high following a strong second quarter with double-digit revenue and profit growth. The company achieved a record market share for its VIDA EV brand and saw significant growth in global dispatches. Analysts maintain a 'buy' rating, anticipating continued sales volume growth driven by new launches and improving rural demand.",
            "pubDate": "2025-11-18T01:44:30.938106"
        },
        {
            "title": "IL&FS moves NCLAT to update CoC vote shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ilfs-moves-nclat-to-update-coc-vote-shares/articleshow/125398556.cms",
            "description": "IL&FS is adjusting creditor voting rights in committees. This change reflects current outstanding debt after nearly ₹18,000 crore in interim payouts. Some lenders' voting power will decrease as their debt has been substantially repaid. This move aims to ensure fair decision-making in asset sales, preventing outdated claims from influencing outcomes. Major IL&FS assets will see shifts in committee makeup.",
            "pubDate": "2025-11-18T01:44:30.938188"
        },
        {
            "title": "Sebi starts review of corporate disclosure rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-starts-review-of-corporate-disclosure-rules/articleshow/125398493.cms",
            "description": "The Securities and Exchange Board of India is simplifying corporate disclosure rules. A review of Listing Obligations and Disclosure Requirements is underway. Sebi is also overhauling settlement regulations and other norms for stockbrokers and mutual funds. A closing-auction mechanism for equity markets is nearing implementation. Efforts are also focused on easing fundraising processes for companies.",
            "pubDate": "2025-11-18T01:44:30.938266"
        },
        {
            "title": "Bharti Airtel gets S&P upgrade backed by strong Q2 earnings, cash flow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-gets-sp-upgrade-backed-by-strong-q2-earnings-cash-flow-reliance-jio-ipo/articleshow/125398630.cms",
            "description": "Bharti Airtel's credit rating has been upgraded by S&P Global Ratings. This reflects the company's strong earnings and cash flow. The upgrade is expected to drive continued debt reduction over the next 12 to 24 months. Airtel's financial flexibility is anticipated to improve. This positive outlook is supported by rational industry competition and tariff hikes.",
            "pubDate": "2025-11-18T01:44:30.938430"
        },
        {
            "title": "Nomura's India fixed-income chief resigns amid reports of inflated profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomuras-india-fixed-income-chief-resigns-amid-reports-of-inflated-profits/articleshow/125398542.cms",
            "description": "Ujjwal Kumar, managing director of Nomura Fixed Income Securities, has resigned following a Bloomberg report alleging Nomura Holdings is investigating its India fixed-income unit for potentially inflated profits. The company denies any compliance investigation into the issues described, despite a recent net loss in the September quarter attributed to mark-to-market losses.",
            "pubDate": "2025-11-18T01:44:30.938506"
        },
        {
            "title": "LIC seeks GST relief, tax-free premium hike to boost sales",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-seeks-gst-relief-tax-free-premium-hike-to-boost-sales/articleshow/125398536.cms",
            "description": "LIC has urged the government to implement tax and regulatory changes in the upcoming budget to boost policy sales and insurer margins. Key proposals include treating insurance services as 'zero-rated' for GST to allow input tax credit claims and increasing the tax-free maturity proceeds limit to ₹10 lakh annually.",
            "pubDate": "2025-11-18T01:44:30.938585"
        }
    ]
}