{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-14T08:53:24.753017",
    "items": [
        {
            "title": "Just Dial shares in focus as Q3 profit slips 10% YoY on one-time exceptional expense",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/just-dial-shares-in-focus-as-q3-profit-slips-10-yoy-on-one-time-exceptional-expense/articleshow/126516952.cms",
            "description": "Just Dial reported a 10.2% year-on-year decline in net profit for Q3FY26, reaching Rs 118 crore. This was attributed to a higher tax rate and a one-time exceptional expense. Despite the profit dip, operating revenue grew 6.4% to Rs 305.7 crore, with a robust EBITDA margin of 31.2%.",
            "pubDate": "2026-01-14T03:53:43.393957"
        },
        {
            "title": "TCS shares in focus on last day to qualify for Rs 57/share dividend. Check record, payment date",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tcs-shares-in-focus-on-last-day-to-qualify-for-rs-57/share-dividend-check-record-payment-date/articleshow/126516932.cms",
            "description": "Tata Consultancy Services shares will remain in focus as January 14 marks the effective cut-off date for eligibility for its third interim and special dividend. The IT major has announced a combined payout of Rs 57 per share, alongside reporting a year-on-year decline in December-quarter net profit.",
            "pubDate": "2026-01-14T03:53:43.394082"
        },
        {
            "title": "Manappuram Finance among 4 stocks flash bullish signals, indicating possible uptrend",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/manappuram-finance-among-4-stocks-flash-bullish-signals-indicating-possible-uptrend/slideshow/126516864.cms",
            "description": "On January 13, four stocks from the Nifty500 universe featured in the bullish “White Marubozu” scan, based on data from StockEdge.com. A White Marubozu forms when the opening price is the session low and the closing price is the high, reflecting sustained buying pressure and strong buyer control during the trading session.",
            "pubDate": "2026-01-14T03:53:43.394191"
        },
        {
            "title": "Indian Overseas Bank shares in focus after overnight MCLR cut by 5 bps",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-overseas-bank-shares-in-focus-after-overnight-mclr-cut-by-5-bps/articleshow/126516842.cms",
            "description": "Indian Overseas Bank shares are set to draw investor attention after the public-sector lender cut its overnight MCLR by 5 basis points, effective January 15, even as markets track the government’s ongoing Offer For Sale and assess the limited impact of the rate move on existing borrowers.",
            "pubDate": "2026-01-14T03:53:43.394292"
        },
        {
            "title": "Eternal among 4 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-among-4-stocks-showing-bullish-rsi-upswing/slideshow/126516817.cms",
            "description": "On January 13, four stocks from the NSE large-cap universe appeared in the RSI Trending Up scan, based on data from StockEdge.com. An RSI move above 50 from below is considered an uptrend signal, indicating strengthening momentum and growing bullish sentiment, which traders monitor to identify potential buying opportunities.",
            "pubDate": "2026-01-14T03:53:43.394396"
        },
        {
            "title": "Hindustan Zinc shares in focus Silver hits record high, up 26% in 2026. Here’s what experts are saying",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-in-focus-silver-hits-record-high-up-26-in-2026-heres-what-experts-are-saying/articleshow/126516692.cms",
            "description": "Hindustan Zinc shares are poised for attention as silver prices hit record highs, boosting the company's key earnings driver. Analysts recommend a buy-on-dips strategy, citing strong bullish momentum and potential upside driven by rising metal prices and improved cost efficiency.",
            "pubDate": "2026-01-14T03:53:43.394504"
        },
        {
            "title": "ICICI Lombard shares in focus as Q3 PAT declines 9% to Rs 659 crore. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-lombard-shares-in-focus-as-q3-pat-declines-9-to-rs-659-crore-what-should-investors-do/articleshow/126516406.cms",
            "description": "ICICI Lombard General Insurance saw a profit drop in the December quarter. Higher claims and weaker underwriting performance affected results. Despite this, premium income grew, outpacing industry growth. Analysts offer mixed views on the stock. Goldman Sachs maintains a Neutral rating with a reduced target price. Morgan Stanley retains an Equal-weight rating, expecting GST rate cuts to boost future growth.",
            "pubDate": "2026-01-14T03:53:43.394604"
        },
        {
            "title": "Yajur Fibres set for SME debut today. Check GMP ahead of listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yajur-fibres-set-for-sme-debut-today-check-gmp-ahead-of-listing/articleshow/126516009.cms",
            "description": "Yajur Fibres is set to list on the BSE SME platform with grey market indicators suggesting a muted debut, as the Rs 120 crore IPO saw modest investor response. The company, specializing in processing bast fibres into cotton-like materials for sustainable textiles, plans to utilize IPO proceeds for expansion and working capital.",
            "pubDate": "2026-01-14T03:53:43.394707"
        },
        {
            "title": "Stocks to buy for 2026: HCL Tech, TCS among 4 stocks that could give 15-30% return in long term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-hcl-tech-tcs-among-4-stocks-that-could-give-15-30-return-in-long-term/slideshow/126515936.cms",
            "description": "Brokerage houses remain constructive on select frontline stocks, underpinned by valuation comfort, earnings visibility, and improving medium-term fundamentals across sectors.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-14T03:53:43.394830"
        },
        {
            "title": "Positive Breakout: These 10 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-cross-above-their-200-dmas/slideshow/126515898.cms",
            "description": "As of January 13, 2026, 15 stocks in the Nifty 500 universe closed above their 200-day moving average (DMA). Of these, we have highlighted the top 10 that posted gains of more than 1% in the previous trading session, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2026-01-14T03:53:43.394926"
        },
        {
            "title": "Victory Electric shares to list today. Here's what GMP indicates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/victory-electric-shares-to-list-today-heres-what-gmp-indicates/articleshow/126515837.cms",
            "description": "Victory Electric Vehicles International is poised for its NSE SME debut on January 14, with grey market indicators suggesting a flat listing around its Rs 41 issue price. The company's Rs 35 crore IPO saw a lukewarm subscription of 0.95 times.",
            "pubDate": "2026-01-14T03:53:43.395022"
        },
        {
            "title": "GIFT Nifty down 25 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126515589.cms",
            "description": "Benchmark indices experienced volatility on expiry day, with Nifty and Sensex closing lower. Analysts suggest a levels-based trading strategy for day traders due to the non-directional market texture. Buying interest was observed near lower levels, indicating continued bullish participation despite the day's decline.",
            "pubDate": "2026-01-14T03:53:43.395123"
        },
        {
            "title": "Stocks in news: Infosys, Groww, HDFC AMC, ICICI Lombard, Waaree Renewable",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-infosys-groww-hdfc-amc-icici-lombard-waaree-renewable/articleshow/126515565.cms",
            "description": "Indian markets closed slightly lower on the weekly expiry day amidst mixed signals. Analysts advise a cautious approach, suggesting selling on rises until the Nifty reclaims the 26,000 level. A breach of the 100-day EMA near 25,600 could lead to further declines. Several companies like Infosys and HDFC AMC will announce their third-quarter results today.",
            "pubDate": "2026-01-14T03:53:43.395221"
        },
        {
            "title": "Asian shares post modest early gains, Yen weakens",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-post-modest-early-gains-yen-weakens/articleshow/126515545.cms",
            "description": "Asian shares saw a modest rise, with Japan's Nikkei extending its record run on a weaker yen amid reports of a snap election. US equities dipped as JPMorgan's earnings missed guidance, and inflation data reinforced expectations of a Federal Reserve rate pause. Traders await a potential Supreme Court ruling on President Trump's tariffs.",
            "pubDate": "2026-01-14T03:53:43.395311"
        },
        {
            "title": "Piramal Finance raises $350 million; eyes $150 million more",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/piramal-finance-raises-350-million-eyes-150-million-more/articleshow/126515427.cms",
            "description": "Piramal Finance is set to raise $500 million in FY26, having already secured $350 million from the International Finance Corp and the Asian Development Bank. The non-bank lender is in advanced discussions to secure the remaining $150 million from development finance institutions. These funds will support credit expansion into underserved markets.",
            "pubDate": "2026-01-14T03:53:43.395404"
        },
        {
            "title": "RBI plans new eligibility norms for urban co-op bank licences",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-plans-new-eligibility-norms-for-urban-co-op-bank-licences/articleshow/126515373.cms",
            "description": "The Reserve Bank of India is considering new rules for urban cooperative bank licenses.  Credit societies meeting strict financial and operational standards may qualify. This move aims to strengthen the sector.  The proposal seeks to reopen licensing after a long pause.  Only large, well-managed entities will be considered for conversion.  Governance standards will align with commercial banks.",
            "pubDate": "2026-01-14T03:53:43.395494"
        },
        {
            "title": "Oil India among 5 F&O stocks with a sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-india-among-5-fo-stocks-with-a-sharp-rise-in-futures-open-interest/slideshow/126517370.cms",
            "description": "As of January 13, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% compared with the previous trade.A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions in the futures market.",
            "pubDate": "2026-01-14T04:38:30.994732"
        },
        {
            "title": "Tata Elxsi shares shed 3% after Q3 profit declines 45% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-elxsi-shares-shed-3-after-q3-profit-declines-45-yoy/articleshow/126517272.cms",
            "description": "Tata Elxsi shares fell over 3% after the company reported a sharp 45.3% year-on-year drop in Q3 net profit, hit by a one-time exceptional charge linked to changes in India’s labour laws. Revenue grew marginally, while adjusted profit declined 5.4%, reflecting continued pressure on margins despite steady demand in software services.",
            "pubDate": "2026-01-14T04:38:30.994856"
        },
        {
            "title": "Stock Market Holiday 2026: Are BSE, NSE closed tomorrow for Maharashtra municipal elections?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-2026-are-bse-nse-closed-tomorrow-for-maharashtra-municipal-elections/articleshow/126517227.cms",
            "description": "NSE Holidays 2026: Indian stock markets will be closed on January 15 due to municipal elections in Maharashtra, a change from the initial settlement holiday classification. This revision means trading will not occur across all segments on that day. The exchanges have also adjusted the expiry date for certain equity derivative contracts.",
            "pubDate": "2026-01-14T04:38:30.994960"
        },
        {
            "title": "Asahi India Glass among 5 stocks closed crossing above VWAP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asahi-india-glass-among-5-stocks-closed-crossing-above-vwap/slideshow/126517170.cms",
            "description": "On January 13, five stocks from the Nifty500 universe closed more than 1% above their respective VWAPs (Volume Weighted Average Price). According to StockEdge.com’s technical scan data, a move above the VWAP indicates a potential bullish trend.When a stock’s closing price moves above its VWAP, it indicates that the price closed higher than the average price at which it traded during the session, with the average weighted by trading volume. This is commonly viewed by traders and investors as a potential bullish signal, as it may reflect positive market sentiment.",
            "pubDate": "2026-01-14T04:38:30.995057"
        },
        {
            "title": "Sensex falls over 100 points, Nifty below 25,700 amid foreign selling, crude pressure",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-100-points-nifty-below-25700-amid-foreign-selling-crude-pressure/articleshow/126517070.cms",
            "description": "India’s benchmark indices opened slightly lower on Wednesday as persistent foreign investor selling and higher crude prices outweighed the support from steady corporate earnings. Overall sentiment across domestic equities remained cautious, keeping gains in check.",
            "pubDate": "2026-01-14T04:38:30.995158"
        },
        {
            "title": "RailTel shares in focus on cancellation of 3 work orders totalling over Rs 609 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railtel-shares-in-focus-on-cancellation-of-3-work-orders-totalling-over-rs-609-cr/articleshow/126517057.cms",
            "description": "RailTel shares will be in focus after the PSU cancelled three Bihar government education infrastructure work orders worth over Rs 609 crore, citing unavoidable reasons. The cancellations halt project execution and add pressure to a stock already under recent selling pressure.",
            "pubDate": "2026-01-14T04:38:30.995261"
        },
        {
            "title": "Buy, Sell or Hold: Citi maintains buy on Just Dial; Morgan Stanley remains underweight on Tata Elxsi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-buy-on-just-dial-morgan-stanley-remains-underweight-on-tata-elxsi/articleshow/126517043.cms",
            "description": "Brokerages are selectively recommending stocks, prioritizing balance-sheet strength and operating efficiency amid mixed earnings. Just Dial is favored for its strong operating leverage and cash reserves, while Tata Elxsi faces valuation concerns despite growth. ICICI Lombard's profitability is under pressure in a competitive insurance market.",
            "pubDate": "2026-01-14T04:38:30.995384"
        },
        {
            "title": "Rs 1.4 lakh crore shock! Why Reliance shares are hit in New Year selloff & what Q3 results could change",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-1-4-lakh-crore-shock-why-reliance-shares-are-hit-in-new-year-selloff-what-q3-results-could-change/articleshow/126517022.cms",
            "description": "Reliance Industries has seen a significant market cap drop in early 2026 due to concerns over Russian crude exposure and slowing retail growth. Despite near-term headwinds, brokerages view 2026 as a \"year of catalysts,\" anticipating strong energy segment performance and potential upside from Jio's listing and tariff hikes.",
            "pubDate": "2026-01-14T04:38:30.995478"
        },
        {
            "title": "Nomura initiates coverage on ITC Hotels, IHCL with Buy rating. Check target price, upside potential",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-initiates-coverage-on-itc-hotels-ihcl-with-buy-rating-check-target-price-upside-potential/articleshow/126518368.cms",
            "description": "Nomura has initiated coverage on ITC Hotels and Indian Hotels Company with a Buy rating, citing strong demand trends and asset-light expansion. The brokerage expects healthy growth in revenue, margins and cash flows over the medium term, supported by favourable demand–supply dynamics and improving return ratios.",
            "pubDate": "2026-01-14T05:33:01.400580"
        },
        {
            "title": "Vedanta shares jump 6% to record high after Nuvama raises target price to Rs 806",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-rally-3-after-nuvama-gives-rs-806-target-price-on-demerger/articleshow/126517998.cms",
            "description": "Vedanta shares surged to a record high of Rs 678.50 after Nuvama Institutional Equities raised its target price to Rs 806, citing value unlocking from the demerger. The brokerage anticipates strong EBITDA growth driven by sustained commodity prices and cost optimization, maintaining Vedanta as a top pick.",
            "pubDate": "2026-01-14T05:33:01.400712"
        },
        {
            "title": "Motilal Oswal initiates coverage on Canara HSBC Life, sets Rs 180 target; lists 5 growth drivers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-initiates-coverage-on-canara-hsbc-life-sets-rs-180-target-lists-5-growth-drivers/articleshow/126517934.cms",
            "description": "Motilal Oswal has initiated coverage on Canara HSBC Life with a Buy rating and Rs 180 target, citing industry underpenetration, strong bancassurance partnerships, channel diversification and improving VNB margins as key drivers of medium-term earnings growth.",
            "pubDate": "2026-01-14T05:33:01.400923"
        },
        {
            "title": "FII holding in Eternal declines for 7th straight quarter. Is recent correction a buying opportunity?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-holding-in-eternal-declines-for-7th-straight-quarter-is-recent-correction-a-buying-opportunity/articleshow/126517735.cms",
            "description": "Foreign institutional investor holding in Eternal has declined for seven consecutive quarters, falling from 54% to 36.2% due to a 49.5% foreign ownership cap aimed at maintaining Indian ownership status for Blinkit's inventory-led model.",
            "pubDate": "2026-01-14T05:33:01.401034"
        },
        {
            "title": "Did Kotak Mahindra Bank shares really tank 80%? Here’s why investors do not need to panic",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/did-kotak-mahindra-bank-shares-really-tank-80-heres-why-investors-do-not-need-to-panic/articleshow/126517701.cms",
            "description": "Kotak Mahindra Bank shares appeared to crash over 80% in early trade, but the decline was solely due to a technical adjustment as the stock traded ex-split after its 5:1 split. The price reset reflects the revised capital structure and does not affect the bank’s fundamentals, market value or investor wealth.",
            "pubDate": "2026-01-14T05:33:01.401137"
        },
        {
            "title": "Will Budget revive capex stocks? What defence, rail and infra investors should watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-budget-revive-capex-stocks-what-defence-rail-and-infra-investors-should-watch/articleshow/126518763.cms",
            "description": "The Union Budget on February 1 is shaping up as a litmus test for the capex trade, which has slowed over the past year. With fiscal discipline likely to be maintained, any additional spending is expected to be selective, focusing on sectors such as defence, railways, and infrastructure-linked segments, rather than a broad-based capital expenditure push.",
            "pubDate": "2026-01-14T05:51:15.050952"
        },
        {
            "title": "Polycab shares slip 3% after likely Rs 590 cr block deal, domestic mutual fund reportedly sells stake",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/polycab-shares-slip-3-after-likely-rs-590-cr-block-deal-domestic-mutual-fund-reportedly-sells-stake/articleshow/126518418.cms",
            "description": "Polycab India shares fell nearly 3% after a Rs 590 crore block deal involving 7.98 lakh shares, with reports suggesting a domestic mutual fund sold its stake. The stock has shown mixed performance across recent timeframes.",
            "pubDate": "2026-01-14T05:51:15.051067"
        },
        {
            "title": "Budget 2026 to double down on defence? Motilal Oswal flags capex winners, yield risks ahead of FY27",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-to-double-down-on-defence-motilal-oswal-flags-capex-winners-yield-risks-ahead-of-fy27/articleshow/126519121.cms",
            "description": "Motilal Oswal expects Budget 2026 to reinforce defence-led capital expenditure while maintaining fiscal discipline. With limited tax relief, reliance on RBI dividends and elevated borrowing, the brokerage flags capex-linked sectors as equity winners and warns of range-bound bond yields in FY27.",
            "pubDate": "2026-01-14T06:37:40.233608"
        },
        {
            "title": "Vijay Kedia buys stake in smallcap stock that’s down 43% in 1 year. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-buys-stake-in-smallcap-stock-thats-down-43-in-1-year-do-you-own/articleshow/126521178.cms",
            "description": "Ace investor Vijay Kedia acquired a 1.01% stake in Patel Engineering after the smallcap stock fell over 40% in a year. The infrastructure firm recently secured hydropower and coal mining contracts worth over Rs 2,400 crore.",
            "pubDate": "2026-01-14T07:55:52.560086"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to play index’s signs of reversal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-play-indexs-signs-of-reversal/articleshow/126521116.cms",
            "description": "Nifty opened with a gap-up but failed to sustain, declining through most of the session before finding support near 25,600. A bearish candle with a long lower shadow suggests buying interest at lower levels. For an uptrend, Nifty must cross 25,800, with immediate support at 25,600 and resistance at 26,000.",
            "pubDate": "2026-01-14T07:55:52.560194"
        },
        {
            "title": "Miners, energy stocks hold Australian benchmark at 2-month closing high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/miners-energy-stocks-hold-australian-benchmark-at-2-month-closing-high/articleshow/126520310.cms",
            "description": "Indian shares reached a two-month peak on Wednesday. Heavyweight miners and energy stocks saw gains due to rising commodity prices. However, a sharp fall in major banks limited the overall advance. Top miners BHP and Rio Tinto advanced. Gold miners also closed at a peak. Energy stocks climbed significantly. In New Zealand, the benchmark S&P/NZX 50 index ended higher.",
            "pubDate": "2026-01-14T07:55:52.560404"
        },
        {
            "title": "Puravankara shares rally 12% as Q3 sales, collections jump, breaking the slump for the realty stock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/puravankara-shares-rally-12-as-q3-sales-collections-jump-breaking-the-slump-for-the-realty-stock/articleshow/126520002.cms",
            "description": "Puravankara shares jumped more than 12% after the real estate developer reported strong double-digit growth in Q3 sales value and collections, aided by higher realisations, steady deliveries and fresh land additions across key markets. The rally snapped a five-day losing streak for the stock, though it remains sharply lower over the past year.",
            "pubDate": "2026-01-14T07:55:52.560507"
        },
        {
            "title": "Tata Elxsi Q3 PAT slumps 45% YoY; brokerages flag 22% downside risk — here’s what they say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-elxsi-q3-pat-slumps-45-yoy-brokerages-flag-22-downside-risk-heres-what-they-say/articleshow/126519765.cms",
            "description": "Tata Elxsi's net profit plunged 45.3% due to a one-time labour law charge. While revenue and margins showed some strength, brokerages remain divided. Some see potential in auto and healthcare recovery, while others cite rich valuations and muted visibility in key segments, leading to cautious or sell ratings.",
            "pubDate": "2026-01-14T07:55:52.560607"
        },
        {
            "title": "Shadowfax Technologies IPO: GMP signals positive listing outlook after price band announcement",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shadowfax-technologies-ipo-gmp-signals-positive-listing-outlook-after-price-band-announcement/articleshow/126522097.cms",
            "description": "Shadowfax Technologies' upcoming IPO is generating positive buzz, with grey market premiums indicating a strong listing. The logistics provider, which recently turned profitable, aims to raise Rs 1,907 crore. Investors are watching valuation and execution in a competitive sector, but robust revenue growth and a wide client base offer optimism.",
            "pubDate": "2026-01-14T08:53:22.925998"
        },
        {
            "title": "These 9 stocks held by over 100 MFs in December surge up to 115%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-9-stocks-held-by-over-100-mfs-in-december-surge-up-to-115-do-you-own-any/slideshow/126522158.cms",
            "description": "When a large number of mutual fund schemes invest in the same stock, it typically reflects strong institutional conviction and often boosts retail investor confidence. As of December 2025, data shows that 254 stocks were owned by more than 100 mutual fund schemes, highlighting broad-based institutional interest.",
            "pubDate": "2026-01-14T08:53:22.926123"
        }
    ]
}