{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-05T02:51:36.161175",
    "items": [
        {
            "title": "Wall St ends lower as bank CEOs warn of possible pullback, fueling tech bubble jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-st-ends-lower-as-bank-ceos-warn-of-possible-pullback-fueling-tech-bubble-jitters/articleshow/125099973.cms",
            "description": "Indian investors, take note: US stocks plunged Tuesday as banking titans warned of a potential market drawdown, fueled by stretched valuations and AI boom exuberance. Major indexes saw significant drops, with tech shares leading the decline. Concerns over high valuations and profit-taking are mounting, prompting a cautious outlook.",
            "pubDate": "2025-11-05T02:51:29.489304"
        },
        {
            "title": "ChrysCapital raises $2.2 billion in largest Indian PE fund",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chryscapital-raises-2-2-billion-in-largest-indian-pe-fund/articleshow/125099547.cms",
            "description": "ChrysCapital has secured a record $2.2 billion for its latest fund, ChrysCapital X. This marks a significant achievement for the Indian private equity firm. The fund saw strong participation from both global and domestic investors. ChrysCapital's strategy focuses on key sectors like consumer, healthcare, and technology. The firm has a proven track record of delivering substantial returns to its investors.",
            "pubDate": "2025-11-05T02:51:29.489429"
        },
        {
            "title": "Asian markets pull back as stretched valuation fears jolt Wall St",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-markets-pull-back-as-stretched-valuation-fears-jolt-wall-st/articleshow/125099515.cms",
            "description": "Asian markets are in a tailspin, echoing the dip witnessed on Wall Street as investor hesitation grows over inflated stock prices. This market tumble is echoing alerts from top financiers about looming corrections. The current buzz around generative AI is stirring memories of the dot-com bubble. Major Asian indices, particularly in Japan, are experiencing steep declines.",
            "pubDate": "2025-11-05T02:51:29.489557"
        },
        {
            "title": "Stock Market Holiday on Gurunanak Jayanti 2025: Are NSE, BSE open or closed today on November 5 for Gurpurab?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-on-gurunanak-jayanti-2025-are-nse-bse-open-or-closed-today-on-november-5-for-gurpurab/articleshow/125091989.cms",
            "description": "NSE Holidays 2025: Indian stock markets are shut today, November 5, 2025, for Guru Nanak Jayanti. Trading on NSE and BSE is suspended across all segments. This is the second market holiday in November. The festival commemorates the 556th birth anniversary of Guru Nanak Dev Ji. MCX trading is also suspended. Markets reopen tomorrow, November 6.",
            "pubDate": "2025-11-05T02:51:29.489660"
        },
        {
            "title": "Sebi to overhaul 30-yr-old stock broker rules ‘ASAP’",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-to-overhaul-30-yr-old-stock-broker-rules-asap/articleshow/125099380.cms",
            "description": "The Securities and Exchange Board of India (Sebi) plans to update stock broker regulations by December 2025 to enhance risk management and data protection. This review follows a discussion paper on rationalizing existing rules, some of which are over 30 years old.",
            "pubDate": "2025-11-05T02:51:29.489761"
        },
        {
            "title": "Adani Enterprises to raise Rs 25,000 cr via rights issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-to-raise-rs-25000-cr-via-rights-issue/articleshow/125099271.cms",
            "description": "Adani Enterprises plans to raise up to ₹25,000 crore via a rights issue to fund debt repayment and capital expenditure, primarily in its airport business. The company reported an 84% year-on-year net profit increase to ₹3,199 crore for the September quarter, boosted by an exceptional gain from a stake sale in Adani Wilmar.",
            "pubDate": "2025-11-05T02:51:29.489860"
        }
    ]
}