{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-27T05:43:37.822101",
    "items": [
        {
            "title": "Ashok Leyland shares rise 5% to hit 52-week high on proposed merger of finance arm with NDL Ventures",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-rise-5-to-hit-52-week-high-on-proposed-merger-of-finance-arm-with-ndl-ventures/articleshow/125605782.cms",
            "description": "Ashok Leyland shares surged to a 52-week high following its subsidiary Hinduja Leyland Finance's approval to merge with NDL Ventures. This strategic absorption, effective April 2026 pending approvals, involves a 25:10 share exchange ratio. The move is part of a broader realignment of Ashok Leyland's key subsidiaries.",
            "pubDate": "2025-11-27T05:43:16.342330"
        },
        {
            "title": "Tata stock which doubled money for two consecutive years is down 40% in 2025. Is the dip strong enough to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-stock-which-doubled-money-for-two-consecutive-years-is-down-40-in-2025-is-the-dip-strong-enough-to-buy/articleshow/125605687.cms",
            "description": "Trent, a top Tata Group retailer, faces a tough year. Its stock is down 40% in 2025. Growth is slowing, and expansion worries investors. Analysts are cautious. However, long-term prospects remain, with strong brands and investments in technology. The company is navigating a challenging phase.",
            "pubDate": "2025-11-27T05:43:16.342459"
        },
        {
            "title": "Conflicting Fed signals drive surge in hedging activity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/conflicting-fed-signals-drive-surge-in-hedging-activity/slideshow/125605278.cms",
            "description": "US rate-cut uncertainty has ignited volatility and increased hedging flows as investors try to navigate mixed signals from the Federal Reserve. (Source: Reuters)",
            "pubDate": "2025-11-27T05:43:16.342564"
        },
        {
            "title": "Sensex, Nifty hit all-time highs: Is India's 2026 supercycle about to begin?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-hit-all-time-highs-is-indias-2026-supercycle-about-to-begin/articleshow/125605517.cms",
            "description": "Stock Market all time high: Indian markets hit new milestones on Thursday, with the Sensex crossing 86,000 for the first time and the Nifty50 breaking past previous records from September 2024. The rally is fueled by expectations of coordinated rate cuts by the U.S. Fed and RBI next month, which could boost liquidity.",
            "pubDate": "2025-11-27T05:43:16.342665"
        },
        {
            "title": "Patel Engineering shares zoom 10% after securing Rs 798 crore coal excavation order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/patel-engineering-shares-zoom-10-after-securing-rs-798-crore-coal-excavation-order/articleshow/125605442.cms",
            "description": "Patel Engineering's stock soared after securing two significant Letters of Intent worth Rs 798.19 crore for coal excavation and transportation projects in Chhattisgarh. Awarded by South Eastern Coalfields Limited, these nine-year contracts involve extensive overburden removal, coal handling, and logistics. This win further solidifies the company's position in crucial infrastructure development for public sector undertakings.",
            "pubDate": "2025-11-27T05:43:16.342771"
        },
        {
            "title": "Buy, Sell or Hold: Goldman Sachs maintains buy on Emami; Nuvama retains Hold on Kaynes Technology",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-goldman-sachs-maintains-buy-on-emami-nuvama-retains-hold-on-kaynes-technology/articleshow/125605387.cms",
            "description": "Top brokerages issued mixed views across sectors, with Goldman Sachs maintaining a Buy on Emami citing attractive valuations and recovery prospects, while Motilal Oswal reiterated a Buy on Global Health driven by strong momentum and expansion visibility. Nuvama retained a Hold on Kaynes Technology, flagging premium valuations despite robust growth plans.",
            "pubDate": "2025-11-27T05:43:16.342875"
        },
        {
            "title": "How big is the smallcap crisis? Headlines can't do justice as 1,000 stocks drop at least 20% from peak",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-big-is-the-smallcap-crisis-headlines-cant-do-justice-as-1000-stocks-drop-at-least-20-from-peak/articleshow/125605331.cms",
            "description": "India's smallcap market is experiencing a severe downturn, with over 1,000 stocks falling at least 20% from their peaks. This broad-based correction, driven by significant earnings misses and a valuation reset, has seen many companies collapse by over 50%. Analysts suggest the worst of the froth may be gone, but future recovery hinges on consistent earnings growth.",
            "pubDate": "2025-11-27T05:43:16.342976"
        },
        {
            "title": "Reliance Infrastructure shares rally 5%, hit upper circuit for second day after recent sell-off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infrastructure-shares-rally-5-hit-upper-circuit-for-second-day-after-recent-sell-off/articleshow/125604871.cms",
            "description": "Reliance Infrastructure surged 5% to hit the upper circuit for the second consecutive session, extending its rebound after a sharp six-day decline. Despite the recovery, the stock remains under pressure—down 27% in a month and nearly 60% from its 52-week high—while technical indicators continue to signal broader weakness.",
            "pubDate": "2025-11-27T05:43:16.343076"
        },
        {
            "title": "Gold, silver prices witness profit booking but analysts remain optimistic. Is Rs 1.3 lakh target in sight?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gold-silver-prices-witness-profit-booking-but-analysts-remain-optimistic-is-rs-1-3-lakh-target-in-sight/articleshow/125604779.cms",
            "description": "Gold and silver prices opened lower due to profit booking and market volatility, even as expectations of December Fed rate cuts and a weaker dollar provided support. Gold February futures on MCX fell 0.41% to ₹1,27,248 per 10 grams, while silver March futures dropped 0.36% to ₹1,64,349 per kg.",
            "pubDate": "2025-11-27T05:43:16.343166"
        },
        {
            "title": "Sterling and Wilson Renewable Energy shares rise 5% on Rs 1,313-crore order win. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sterling-and-wilson-renewable-energy-shares-rise-5-on-rs-1313-crore-order-win-check-details/articleshow/125604373.cms",
            "description": "Sterling and Wilson Renewable Energy shares saw a significant jump on Thursday. The company announced it secured a major international project in South Africa. This new contract is for a 240 MW AC Solar PV project valued at approximately $147 million. This win strengthens the company's position in the growing South African solar market.",
            "pubDate": "2025-11-27T05:43:16.343279"
        },
        {
            "title": "At fresh record highs! Sensex rallies past 86,000 level, Nifty tops 26,300 mark",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-50-hits-fresh-all-time-high-after-14-months-crosses-26280-sensex-jumps-300-pts-higher/articleshow/125604255.cms",
            "description": "Stock Market Today: Indian equities reached new heights on Thursday, with the Nifty 50 hitting an all-time peak. This surge was driven by optimism surrounding potential interest rate cuts in both the U.S. and domestically next month, which ignited fresh buying interest in the market.",
            "pubDate": "2025-11-27T05:43:16.343377"
        },
        {
            "title": "DOMS, Ajanta Pharma among 7 high conviction small, midcap picks with up to 69% upside: PL Capital",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/doms-ajanta-pharma-among-7-high-conviction-small-midcap-picks-with-up-to-69-upside-pl-capital/slideshow/125604313.cms",
            "description": "Nifty has moved up 4% in the past three months after a long consolidation phase, as markets look ahead with optimism due to a resilient Q2 corporate performance. With hopes of a resolution in the tariff row with the USA and signs of domestic demand revival during the ongoing festival and wedding season, aided by GST rationalization, investor sentiment appears to be improving.The broader economic momentum is expected to be fueled by factors such as income tax rate cuts, lower interest rates, favorable monsoons, a 12-year low in inflation, and the benefits of GST rationalization. These tailwinds are particularly supportive for small and midcap companies, which are witnessing accelerated growth in sales during the festive season. With this, PL Capital has highlighted its high conviction small and midcap picks with upside potential of up to 69%:",
            "pubDate": "2025-11-27T05:43:16.343472"
        },
        {
            "title": "Rs 30,000 crore IPO gold rush triggers worst selling by retail investors since FY19",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-30000-crore-ipo-gold-rush-triggers-worst-selling-by-retail-investors-since-fy19/articleshow/125604126.cms",
            "description": "India's retail investors are exiting the secondary market, offloading Rs 4,729 crore in FY26, their worst selling streak since FY19. This exodus is fueled by a Rs 30,000 crore surge into the booming IPO market, where investors chase listing gains despite rich valuations and a rising share of Offer for Sale transactions.",
            "pubDate": "2025-11-27T05:43:16.343562"
        },
        {
            "title": "Wipro shares in focus on strategic alliance with IISc to drive innovation in frontier technologies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-shares-in-focus-on-strategic-alliance-with-iisc-to-drive-innovation-in-frontier-technologies/articleshow/125604100.cms",
            "description": "Wipro shares may be in focus after the company announced a strategic collaboration with IISc and FSID to advance frontier technologies, including quantum computing, agentic AI, and secure digital infrastructure. The partnership aims to develop autonomous digital systems, sector-specific applications, and industry-ready solutions through joint research and innovation programmes.",
            "pubDate": "2025-11-27T05:43:16.343653"
        },
        {
            "title": "Eternal shares in focus following Rs 600 crore fund infusion into Blinkit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-in-focus-following-rs-600-crore-fund-infusion-into-blinkit/articleshow/125604083.cms",
            "description": "Eternal, the parent of Blinkit, has infused Rs 600 crore into the quick commerce platform, taking its total 2025 investment to Rs 2,600 crore. The funds support Blinkit’s aggressive expansion of dark stores and rising operational needs, even as the company continues to post losses despite efficiency gains and strong growth ambitions.",
            "pubDate": "2025-11-27T05:43:16.343744"
        },
        {
            "title": "MCX, Aditya Birla Capital among 6 stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-aditya-birla-capital-among-6-stocks-witness-5-year-swing-high-breakouts/slideshow/125604062.cms",
            "description": "In the Nifty500 segment, six stocks hit a 5-year swing high at the close on November 26, indicating bullishness in these counters, according to StockEdge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year period. This level often acts as a significant resistance point where prices have historically struggled to move higher. Such an occurrence may be viewed as a bullish signal, suggesting potential for further upside. However, it differs from a 5-year breakout, which occurs when a stock decisively surpasses a resistance level that has held for five years or more.",
            "pubDate": "2025-11-27T05:43:16.343835"
        }
    ]
}