{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-04T03:57:48.248021",
    "items": [
        {
            "title": "Hot stocks for 2025: Brokerages see 15-30% upside in JSW Infra, GAIL India & Supreme Industries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-for-2025-brokerages-see-15-30-upside-in-jsw-infra-gail-india-supreme-industries/articleshow/115957078.cms",
            "description": "Brokerages are optimistic about JSW Infrastructure, GAIL India, and Supreme Industries, citing strong growth potential and attractive valuations. Investec has initiated coverage on JSW Infrastructure with a \"Buy\" recommendation, emphasizing its robust revenue growth and potential opportunities arising from port privatization.",
            "pubDate": "2024-12-04T03:57:26.802344"
        },
        {
            "title": "These 4 stocks showing RSI Trending Up on December 3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-stocks-showing-rsi-trending-up-on-december-3/slideshow/115957004.cms",
            "description": "On December 3, four stocks from the Nifty50 pack appeared in the RSI Trending Up scan, according to the stockedge.com data. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2024-12-04T03:57:26.802464"
        },
        {
            "title": "Vedanta shares in focus as Crisil upgrades long-term debt rating to 'AA'",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-in-focus-as-crisil-upgrades-long-term-debt-rating-to-aa/articleshow/115956903.cms",
            "description": "Vedanta shares are in focus after Crisil Ratings upgraded its rating on the company's long-term bank facilities and debt instruments from 'AA-' to 'AA'. The rating upgrade reflects better capital structure, financial flexibility, and volume growth.",
            "pubDate": "2024-12-04T03:57:26.802570"
        },
        {
            "title": "Bullish Momentum: 3 stocks with White Marubozu Pattern on December 3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullish-momentum-3-stocks-with-white-marubozu-pattern-on-december-3/slideshow/115956869.cms",
            "description": "On December 3, three stocks from the Nifty200 pack came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2024-12-04T03:57:26.802670"
        },
        {
            "title": "Stocks to buy today: Axis Bank, Ashok Leyland among top 6 trading ideas for 4 December 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-axis-bank-ashok-leyland-among-top-6-trading-ideas-for-4-december-2024/articleshow/115956712.cms",
            "description": "The Indian market is likely to consolidate on Wednesday, following mixed global cues. The Nifty futures closed positive on Tuesday, gaining 0.43% to settle at 24,534 levels. On the options front, the maximum Call Open Interest (OI) is at the 25,000 strike, followed by the 24,500 strike.",
            "pubDate": "2024-12-04T03:57:26.802770"
        },
        {
            "title": "Bank stocks in focus as Lok Sabha passes Banking Laws (Amendment) Bill, 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-stocks-in-focus-as-lok-sabha-passes-banking-laws-amendment-bill-2024/articleshow/115955608.cms",
            "description": "Bank stocks are in focus on Wednesday, December 4, after the Lok Sabha passed the Banking Laws (Amendment) Bill, 2024, during Parliament's winter session, bringing key changes to banking regulations. Finance Minister Nirmala Sitharaman highlighted that banks are now being professionally managed with healthy metrics, enabling them to raise funds and operate efficiently.",
            "pubDate": "2024-12-04T03:57:26.802874"
        },
        {
            "title": "Defence stocks in focus after DAC clears Rs 21,772-crore acquisition proposals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/defence-stocks-in-focus-after-dac-clears-rs-21772-crore-acquisition-proposals/articleshow/115955559.cms",
            "description": "Defence stocks are expected to be in the spotlight on Wednesday after the Defence Acquisition Council (DAC), chaired by Defence Minister Rajnath Singh, approved five capital acquisition proposals worth over Rs 21,772 crore.",
            "pubDate": "2024-12-04T03:57:26.802967"
        },
        {
            "title": "RVNL shares in focus after securing Rs 187-crore East Central Railway project",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-after-securing-rs-187-crore-east-central-railway-project/articleshow/115955012.cms",
            "description": "Shares of state-owned Rail Vikas Nigam Ltd (RVNL) are expected to be in focus on Wednesday after the company announced receiving a letter of acceptance (LoA) from East Central Railway for a Rs 186.77-crore contract.",
            "pubDate": "2024-12-04T03:57:26.803056"
        },
        {
            "title": "Swiggy shares in focus after Q2 net loss widens to Rs 626 crore QoQ",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-in-focus-after-q2-net-loss-widens-to-rs-626-crore-qoq/articleshow/115954773.cms",
            "description": "Swiggy shares are likely to attract attention on Wednesday after the food delivery platform, which went public in November, reported a sequential rise in its consolidated net loss for Q2 FY25. The loss for the July-September 2024 period was Rs 625.53 crore, up from Rs 611 crore in the previous quarter.",
            "pubDate": "2024-12-04T03:57:26.803152"
        },
        {
            "title": "Reliance Power shares in focus after SECI withdraws debarment notice",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-in-focus-after-seci-withdraws-debarment-notice/articleshow/115954680.cms",
            "description": "Reliance Power shares are expected to be in focus on Wednesday following the company's announcement that the Solar Energy Corporation of India (SECI) has withdrawn its debarment notice. As a result, Reliance Power and its subsidiary, Reliance NU BESS Limited (formerly Maharashtra Energy Generation Limited), are now eligible to participate in all SECI tenders.",
            "pubDate": "2024-12-04T03:57:26.803256"
        },
        {
            "title": "At multi-year highs: These 5 stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-5-stocks-witness-5-year-swing-high-breakout/slideshow/115954632.cms",
            "description": "In the Nifty500 pack, we have collated a list of five stocks that witnessed a 5-year swing high at the close on December 4, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2024-12-04T03:57:26.803348"
        },
        {
            "title": "Positive Breakout: These 5 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-5-stocks-cross-above-their-200-dmas/slideshow/115954282.cms",
            "description": "In the NSE large-cap pack, five stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on December 3, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2024-12-04T03:57:26.803445"
        },
        {
            "title": "Multibagger stock with over 100% returns in a year trades ex-split on Thursday. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-stock-with-over-100-returns-in-a-year-trades-ex-split-on-thursday-do-you-own/articleshow/115953877.cms",
            "description": "Shares of Tara Chand InfraLogistic Solutions are expected to remain in focus due to the company's stock split from a face value of Rs 10 to Rs 2 per share set for December 5. The stock has delivered a 137.05% return over the past year.",
            "pubDate": "2024-12-04T03:57:26.803540"
        },
        {
            "title": "Big movers on D-Street: What should investors do with ITC, Mazagon Dock and Sky Gold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-street-what-should-investors-do-with-itc-mazagon-dock-and-sky-gold/articleshow/115953804.cms",
            "description": "Benchmark Sensex extends its winning streak, rising 597 points on Tuesday, driven by gains in blue-chip stocks and positive global market trends. Analyst Viral Chheda of SSJ Finance & Securities advises buying Sky Gold and Mazagon Dock at current levels while considering ITC at lower dips, anticipating a positive long-term performance.",
            "pubDate": "2024-12-04T03:57:26.803629"
        },
        {
            "title": "Piramal Enterprises stock has outperformed amid prevailing corrective phase; should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/piramal-enterprises-stock-has-outperformed-amid-prevailing-corrective-phase-should-you-buy/videoshow/115953788.cms",
            "description": "“We have been observing mixed trends within the NBFC pack and PEL outperforming amid the prevailing corrective phase. Traders can buy for a target of Rs 1430 in the next 2-4 months,” Ajit Mishra – SVP, Research, Religare Broking Ltd, said.",
            "pubDate": "2024-12-04T03:57:26.803720"
        },
        {
            "title": "South Korea vows unlimited liquidity after political turmoil; BOK meets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-korea-vows-unlimited-liquidity-after-political-turmoil-bok-meets/articleshow/115953767.cms",
            "description": "South Korea's finance ministry is prepared to inject unlimited liquidity into financial markets following President Yoon Suk Yeol's lifting of martial law. The move, after emergency meetings by financial authorities, aims to stabilize markets after the won hit multi-year lows and political turmoil over the national budget.",
            "pubDate": "2024-12-04T03:57:26.803807"
        }
    ]
}