{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-21T07:46:53.742233",
    "items": [
        {
            "title": "Technical picks: Aadhar Housing Finance, Mahindra Lifespaces among 5 stocks that can rally up to 16% in near term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-aadhar-housing-finance-mahindra-lifespaces-among-5-stocks-that-can-rally-up-to-16-in-near-term/slideshow/122805992.cms",
            "description": "Indian equity benchmarks ended lower last week, with the Nifty 50 falling 0.7% and the Sensex declining 0.9% amid weak earnings from major financial and IT firms and ongoing global trade uncertainty. Despite the downbeat sentiment, several analysts have identified five technical picks that could deliver up to 16% returns in the near term.",
            "pubDate": "2025-07-21T04:51:59.758156"
        },
        {
            "title": "IndiaMART shares in focus as Q1 net profit rises 35% YoY. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indiamart-shares-in-focus-as-q1-net-profit-rises-35-yoy-should-you-invest/articleshow/122805889.cms",
            "description": "IndiaMART InterMESH shares: IndiaMART reported consolidated revenue from operations of ₹372 crore in Q1 FY26, reflecting a 12% year-on-year growth from ₹331 crore in the same quarter last year. This includes ₹346 crore from IndiaMART’s standalone operations, up 10% YoY, and ₹25 crore contributed by Busy Infotech.",
            "pubDate": "2025-07-21T04:51:59.758290"
        },
        {
            "title": "Wipro, Bajaj Finance, GMDC, Yes Bank among 10 stocks showing RSI Trending Up on July 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-bajaj-finance-gmdc-yes-bank-among-10-stocks-showing-rsi-trending-up-on-july-18/slideshow/122805852.cms",
            "description": "On July 18, 10 stocks from the Nifty 500 pack appeared in the RSI Trending Up scan, according to the stockedge.com data. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-07-21T04:51:59.758403"
        },
        {
            "title": "Sensex jumps over 300 pts, Nifty tops 25,000 as strong Q1 earnings lift market sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-150-pts-nifty-tests-24900-it-bank-stocks-tumble/articleshow/122805538.cms",
            "description": "Indian equity indices rebounded on Monday, fueled by strong Q1 earnings from HDFC Bank, ICICI Bank, and Reliance Industries, offsetting concerns about global trade. The Sensex climbed 284 points, while the Nifty50 rose 77 points. Experts are closely watching US-India trade talks, as a favorable deal could further boost market sentiment.",
            "pubDate": "2025-07-21T04:51:59.758511"
        },
        {
            "title": "Jane Street gets Sebi nod to resume trading in Indian markets after escrow deposit: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-allows-jane-street-to-restart-trading-report/articleshow/122805681.cms",
            "description": "Jane Street, a U.S. trading firm, is back in Indian markets. This follows a Sebi directive. The firm deposited Rs 4,844 crore in an escrow account. Sebi had banned Jane Street earlier. The ban was due to alleged market manipulation. The firm's return involves close monitoring by exchanges. Sebi's investigation revealed substantial profits by Jane Street.",
            "pubDate": "2025-07-21T04:51:59.758633"
        },
        {
            "title": "Stocks to buy today: ONGC, HDFC AMC among top 7 trading ideas for 21 July 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-ongc-hdfc-amc-among-top-7-trading-ideas-for-21-july-2025/articleshow/122805677.cms",
            "description": "The Indian market is expected to open lower on Monday amid weak global cues. Nifty futures closed at 25,026, down 0.59%, while India VIX edged up. Options data suggests a broad range of 24,500–25,500, with profit-taking pressure visible. Analysts recommend select stock picks and F&O strategies as Nifty struggles to reclaim the 25,000 mark.",
            "pubDate": "2025-07-21T04:51:59.758737"
        },
        {
            "title": "RBL Bank shares slide 3% after Q1 net profit declines 46% YoY. Should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-as-q1fy26-net-profit-declines-46-yoy-should-you-buy/articleshow/122805622.cms",
            "description": "RBL Bank's shares are under scrutiny following a 46% YoY drop in net profit for Q1FY26, reaching ₹200.33 crore due to decreased interest income and increased operating expenses. NII fell by 13% YoY to ₹1,481 crore, with NIM at 4.50%. Despite a slight rise in GNPA to 2.78%, NNPA improved to 0.45%.",
            "pubDate": "2025-07-21T04:51:59.758837"
        },
        {
            "title": "Sona Comstar shares in focus after China EV JV worth $20 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sona-comstar-shares-in-focus-after-china-ev-jv-worth-20-million/articleshow/122805586.cms",
            "description": "Sona Comstar has signed a $20 million JV deal with China’s Jinnaite Machinery to manufacture driveline systems for EVs and non-EVs. Backed by JNT’s patented tech and strong OEM clientele, the venture aims to tap growth in China and global markets. With a robust order book, operations are expected to begin in H2 FY26.",
            "pubDate": "2025-07-21T04:51:59.758934"
        },
        {
            "title": "HDFC Bank shares gain 2% on 12% YoY profit jump. Is it time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-gain-2-on-12-yoy-profit-jump-is-it-time-to-buy/articleshow/122805477.cms",
            "description": "HDFC Bank's Q1FY26 standalone net profit rose 12% YoY to Rs 18,155 crore. The bank announced its first-ever 1:1 bonus issue and a special interim dividend of Rs 5 per share. Antique maintains a 'Buy' rating with a target price of Rs 2,270, citing an improved growth outlook and potential RoA expansion.",
            "pubDate": "2025-07-21T04:51:59.759029"
        },
        {
            "title": "7 Nifty500 stocks with highest dividend yields. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-nifty500-stocks-with-highest-dividend-yields-do-you-own-any/slideshow/122805536.cms",
            "description": "If you're looking for steady income from your investments, dividend-paying stocks can be a good option. Dividend yield shows how much a company pays out in dividends each year compared to its stock price. As per Trendlyne data, these 7 stocks from the Nifty500 index gave dividend yields of up to 9% in the last 12 months. Here's the list:",
            "pubDate": "2025-07-21T04:51:59.759130"
        },
        {
            "title": "Yes Bank shares in focus after Q1 PAT zooms 59% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-after-q1-pat-zooms-59-yoy/articleshow/122805367.cms",
            "description": "Yes Bank reported a 59% YoY jump in Q1FY26 net profit to Rs 801 crore, driven by higher non-interest income and improved NII. Asset quality remained stable, while NIM rose to 2.5%. Technical indicators suggest a potential trend reversal, with analysts projecting a near-term upside towards Rs 21.50–23.00, backed by bullish chart patterns and strong support levels.",
            "pubDate": "2025-07-21T04:51:59.759225"
        },
        {
            "title": "GMDC, PVR Inox among 6 stocks that rose above VWAP on July 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-pvr-inox-among-6-stocks-that-rose-above-vwap-on-july-18/slideshow/122805336.cms",
            "description": "On July 18, the closing prices of six stocks from the Nifty 500 pack rallied in the range of 1-3% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to Stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-07-21T04:51:59.759320"
        },
        {
            "title": "ICICI Bank shares surge 2% after Q1 profit rises 15% YoY to Rs 12,768 crore. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-shares-in-focus-after-q1-profit-rises-15-5-to-rs-12768-crore-should-you-buy-sell-or-hold/articleshow/122805250.cms",
            "description": "ICICI Bank shares: ICICI Bank's shares experienced a surge following the announcement of a 15.5% YoY increase in net profit for the June quarter, reaching Rs 12,768 crore. While NII saw a 10.6% rise, NIM experienced a slight dip.",
            "pubDate": "2025-07-21T04:51:59.759413"
        },
        {
            "title": "Man Industries, Cupid, ITC Hotels among 6 stocks with White Marubozu Pattern on July 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/man-industries-cupid-itc-hotels-among-6-stocks-with-white-marubozu-pattern-on-july-18/slideshow/122805128.cms",
            "description": "On July 18, in the NSE list of stocks with a market cap of Rs 1,000 crore, six stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-07-21T04:51:59.759626"
        },
        {
            "title": "Cupid, NACL Industries among 5 smallcap stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-nacl-industries-among-5-smallcap-stocks-witness-5-year-swing-high-breakout/slideshow/122805058.cms",
            "description": "In the NSE smallcap pack, we have collated a list of five stocks that witnessed a 5-year swing high at the close on July 18, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years.",
            "pubDate": "2025-07-21T04:51:59.759719"
        },
        {
            "title": "Cupid shares rally 64% in a week, hit new all-time high of Rs 152. Should you book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-shares-rally-64-in-a-week-hit-new-all-time-high-of-rs-152-should-you-book-profits/articleshow/122809819.cms",
            "description": "Cupid Limited shares surged, reaching an all-time high. This surge follows strong technical momentum and increased trading volumes. Aditya Kumar Halwasiya, Chairman, featured in a prestigious list. Analysts suggest booking profits due to overbought conditions. SBI Securities sees potential for further gains. Choice Broking advises caution and profit-taking. Investors should monitor for retracements and consider staggered accumulation.",
            "pubDate": "2025-07-21T07:46:32.744085"
        },
        {
            "title": "Beyond 1:1 bonus issue, why HDFC Bank shares remain top pick after Q1 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/beyond-11-bonus-issue-why-hdfc-bank-shares-remain-top-pick-after-q1-results/articleshow/122809154.cms",
            "description": "HDFC Bank's first bonus issue attracts investors. Brokerages view the bank's fundamentals as strong. They expect stronger growth in the second half of FY26. This growth will be aided by loan demand and easing regulations. The bank's Q1 results show a profit increase. Loan growth is expected to improve. Target prices have been raised across the board.",
            "pubDate": "2025-07-21T07:46:32.744208"
        },
        {
            "title": "Investor sentiment cautious amid Japan leadership doubts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investor-sentiment-cautious-amid-japan-leadership-doubts/slideshow/122808646.cms",
            "description": "Prime Minister Shigeru Ishiba’s ruling coalition suffered a significant political setback by losing control of the upper house in Sunday’s election. Despite the loss, Ishiba has expressed his intention to stay on as party leader, citing the urgency of ongoing tariff negotiations with the United States. While markets were closed for a holiday on Monday, the yen strengthened and Nikkei futures rose slightly, suggesting the election outcome was already priced in by investors. (Source: Reuters)",
            "pubDate": "2025-07-21T07:46:32.744315"
        },
        {
            "title": "Mastek shares rally 13% after Q1 net profit surges 29% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mastek-shares-rally-13-after-q1-net-profit-surges-29-yoy/articleshow/122808751.cms",
            "description": "Mastek's shares surged by 13.08% following a robust Q1FY26 financial report, showcasing a 28.7% increase in net profit. Trading above all key Simple Moving Averages, the company's strengths, including attractive valuation and consistent profit growth, outweigh its weaknesses. With low debt and zero promoter pledge, Mastek's financial stability boosts investor confidence.",
            "pubDate": "2025-07-21T07:46:32.744417"
        },
        {
            "title": "Newgen Software shares slide over 16% in three days after weak Q1 earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/newgen-software-shares-slide-over-16-in-three-days-after-weak-q1-earnings/articleshow/122808217.cms",
            "description": "Newgen Software's share price has slumped over 16% in three sessions after weak Q1FY26 earnings. The company reported flat YoY growth in profit and revenue, with sequential declines across key geographies and segments. Margins also narrowed due to higher costs, triggering bearish investor sentiment.",
            "pubDate": "2025-07-21T07:46:32.744524"
        },
        {
            "title": "Axis Bank, LTIMindtree among 7 F&O stocks that saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-ltimindtree-among-7-fo-stocks-that-saw-a-high-increase-in-futures-open-interest/slideshow/122808151.cms",
            "description": "As of July 18, there was a notable surge in futures open interest for seven stocks in the NSE F&O pack, contributing to a total increase in open interest of over 7% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-07-21T07:46:32.744640"
        },
        {
            "title": "Waaree Renewable Technologies shares slide 6% amid US trade petition on Indian solar panel imports",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-renewable-technologies-shares-slide-6-amid-us-trade-petition-on-indian-solar-panel-imports/articleshow/122808023.cms",
            "description": "Waaree Renewable Technologies' shares plunged 6.2% following a U.S. petition seeking tariffs on solar panel imports from India, Indonesia, and Laos. The petition alleges dumping and unfair subsidies, impacting Indian manufacturers. Despite this, Waaree reported a strong Q1 with a 205% jump in net profit to Rs 86.44 crore and a doubling of revenue. The U.S.",
            "pubDate": "2025-07-21T07:46:32.744738"
        },
        {
            "title": "Rising Costs, Shrinking Choices: The consumer impact of tariffs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-costs-shrinking-choices-the-consumer-impact-of-tariffs/slideshow/122807869.cms",
            "description": "With less than 22 weeks to go before Christmas, U.S. retailers usually finalise holiday orders and pricing. But this year, they're caught in a maze of changing tariffs and trade policies, delaying key decisions. (Source: AP)",
            "pubDate": "2025-07-21T07:46:32.744831"
        },
        {
            "title": "Anthem Biosciences shares rally 3% after healthy listing. Should you buy now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anthem-biosciences-shares-rally-3-after-healthy-listing-should-you-buy-now/articleshow/122807570.cms",
            "description": "Anthem Biosciences share price: Anthem’s IPO did not include a fresh issue, with all proceeds going to existing shareholders. Prior to the IPO opening, anchor investors had already invested Rs 1,016 crore.",
            "pubDate": "2025-07-21T07:46:32.744924"
        },
        {
            "title": "China’s Balancing Act: Stability vs stimulus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-balancing-act-stability-vs-stimulus/slideshow/122807524.cms",
            "description": "China has decided to keep its benchmark lending rates unchanged, following slightly better-than-expected second-quarter economic data. The decision was widely anticipated and indicates cautious optimism from policymakers. (Source: Reuters)",
            "pubDate": "2025-07-21T07:46:32.745016"
        },
        {
            "title": "Union Bank shares slip 4% after Q1 profit rises 12% YoY but NII declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/union-bank-shares-slip-4-after-q1-profit-rises-12-yoy-but-nii-declines/articleshow/122807166.cms",
            "description": "Union Bank shares: Total income increased to Rs 31,791 crore in the June quarter, up from Rs 30,874 crore in the same period last year. However, net interest income (NII) fell 3.2% year-on-year to Rs 9,112.6 crore, compared to Rs 9,412 crore previously.",
            "pubDate": "2025-07-21T07:46:32.745109"
        },
        {
            "title": "Ircon International shares jump over 4% on bagging multiple contracts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ircon-international-shares-jump-over-4-on-bagging-multiple-contracts/articleshow/122807126.cms",
            "description": "Ircon International's shares saw a rise following the acquisition of contracts valued at Rs 755.78 crore. A joint venture with RVNL secured a project, with Ircon's share at Rs 529.04 crore. MMRDA awarded Ircon contracts for Mumbai Metro Lines 5 and 6. The company's Q4 net profit saw a slight decline.",
            "pubDate": "2025-07-21T07:46:32.745201"
        },
        {
            "title": "Explained: Why Reliance Industries shares fell 3% after reporting highest-ever profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-reliance-industries-shares-fell-3-after-reporting-highest-ever-profit/articleshow/122807074.cms",
            "description": "Reliance Industries shares: Jefferies offered a candid assessment, noting that consolidated EBITDA came in 3% below its estimates, with the O2C and Retail segments missing expectations by 5% and 4%, respectively. Despite this, the global brokerage retained its Buy rating with a target price of ₹1,726.",
            "pubDate": "2025-07-21T07:46:32.745295"
        },
        {
            "title": "MRPL shares slide 7% after co slips to loss in Q1 on margin, revenue hit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mrpl-shares-slide-7-after-co-slips-to-loss-in-q1-on-margin-revenue-hit/articleshow/122807020.cms",
            "description": "MRPL reported a net loss of Rs 271 crore in Q1FY26, reversing from a profit last year. Revenue and refining margins declined sharply. The company’s Gross Refining Margin (GRM), a key indicator of profitability in the refining business, dropped to $3.88 per barrel from $4.70 per barrel year-on-year, highlighting the pressure on MRPL’s core operations.",
            "pubDate": "2025-07-21T07:46:32.745388"
        },
        {
            "title": "Axis Bank shares slip 2% after Q1 profit hit linked to RBI-driven bad loan spike",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-bank-shares-slip-2-after-q1-profit-hit-linked-to-rbi-driven-bad-loan-spike/articleshow/122806807.cms",
            "description": "Axis Bank shares faced a dip of 2.4% after Q1FY26 results. The bank's net profit fell 4% to Rs 5,806 crore. This was due to a sharp rise in provisions for bad loans. The Reserve Bank of India's intervention led to this increase. RBI flagged Axis Bank's lenient policies on stressed loans. This prompted corrective action, impacting the bank's profitability.",
            "pubDate": "2025-07-21T07:46:32.745483"
        },
        {
            "title": "BSE shares rally 3% after Jane Street said to have received clearance to resume trading in India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-rally-3-after-jane-street-said-to-have-received-clearance-to-resume-trading-in-india/articleshow/122806741.cms",
            "description": "BSE shares: According to a report, Jane Street has received official confirmation from SEBI that the restriction on its access to Indian securities markets has been lifted.",
            "pubDate": "2025-07-21T07:46:32.745573"
        }
    ]
}