{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-24T01:24:34.133502",
    "items": [
        {
            "title": "Asian stocks edge lower after mixed Fed signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-edge-lower-after-mixed-fed-signals/articleshow/124080969.cms",
            "description": "Asian stocks declined following a tech-driven dip in the S&P 500, compounded by cautious signals from Federal Reserve officials regarding interest-rate cuts. Jerome Powell highlighted persistent risks in both the labor market and inflation, maintaining flexibility amid pressure for aggressive easing. Oil prices rose due to concerns over Russian supply disruptions.",
            "pubDate": "2025-09-24T01:24:26.909333"
        },
        {
            "title": "JM Financial, Group firms settle case over NCDs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-group-firms-settle-case-over-ncds/articleshow/124080849.cms",
            "description": "JM Financial, along with JM Financial Services and JM Financial Products, settled with SEBI for ₹1.9 crore over securities law violations related to NCD public issues in 2023. They also face a three-month debarment from debt security distribution and IPO financing. The case involved concerns about retail ownership decline and loan provisions for NCD applications.",
            "pubDate": "2025-09-24T01:24:26.909454"
        },
        {
            "title": "Stocks in news: Mazagon Dock, Swiggy, Tata Motors, Indian Hotels, YES Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-mazagon-dock-swiggy-tata-motors-indian-hotels-yes-bank/articleshow/124074849.cms",
            "description": "Markets experienced a slight dip amid volatility on expiry day, continuing a consolidation phase. Optimism from GST reforms and festive demand is countered by external pressures like visa-fee hikes and foreign outflows. Mazagon Dock, Indian Hotels, YES Bank, Tata Motors, Puravankara, and Swiggy saw significant developments, including partnerships, stake acquisitions, and leadership changes.",
            "pubDate": "2025-09-24T01:24:26.909658"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/124074890.cms",
            "description": "Equities closed slightly lower as India-US trade talks progressed. Analysts anticipate market firmness, driven by GST reforms and festive demand. Technically, the index finds strong support at 25,000, suggesting a potential rebound. FIIs net sold shares, while DIIs were net buyers, and the rupee weakened against the US dollar.",
            "pubDate": "2025-09-24T01:24:26.909754"
        },
        {
            "title": "India may raise foreign investment limit in PSU banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-may-raise-foreign-investment-limit-in-psu-banks/articleshow/124080934.cms",
            "description": "India is planning to allow more foreign investment in Public Sector Banks. The current limit is 20%. The government wants to strengthen these banks. This will help them raise more capital. The government will keep at least 51% stake. This ensures the banks remain public. The goal is to make them globally competitive.",
            "pubDate": "2025-09-24T01:24:26.909850"
        },
        {
            "title": "Complacency and not valuations, real risk: BlackRock Quant Head",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/complacency-and-not-valuations-real-risk-blackrock-quant-head/articleshow/124080748.cms",
            "description": "BlackRock's Raffaele Savi remains optimistic about equities, citing strong growth drivers and investor caution outside US tech. He dismisses dot-com comparisons, highlighting real revenues in today's tech firms. Savi emphasizes quant funds' role in providing steady returns and the importance of combining AI with human judgment to navigate market shifts, advocating for equity-heavy portfolios for better retirement outcomes.",
            "pubDate": "2025-09-24T01:24:26.909941"
        },
        {
            "title": "Amwoodo raises $4 million from Rainmatter, others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amwoodo-raises-4-million-from-rainmatter-others/articleshow/124080839.cms",
            "description": "Kamath's Rainmatter has put in $2 million while Adventz, Caspian and Singapore's ThinKuvate have invested $2 million between them, Amwoodo founder and chief executive Agni Mitra told ET.",
            "pubDate": "2025-09-24T01:24:26.910350"
        },
        {
            "title": "Banking liquidity turns deficit in FY26 as tax outflows rise, RBI steps in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banking-liquidity-turns-deficit-in-fy26-as-tax-outflows-rise-rbi-steps-in/articleshow/124080795.cms",
            "description": "For the first time in fiscal year 2026, banking system liquidity has moved into deficit due to tax outflows. The Reserve Bank of India is infusing funds to stabilize overnight rates. Tax payments, including GST and advance taxes, caused the shift. The RBI conducted variable rate repo auctions to manage rates.",
            "pubDate": "2025-09-24T01:24:26.910628"
        }
    ]
}