{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-30T08:59:55.414603",
    "items": [
        {
            "title": "GIFT Nifty down 55 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/127788699.cms",
            "description": "Indian equity markets closed mixed on Thursday, buoyed by pre-Budget anticipation and positive sentiment surrounding the India-EU free trade agreement. Analysts anticipate a rangebound market with stock-specific movements dominating ahead of the Budget announcement. The rupee hit an all-time closing low against the dollar.",
            "pubDate": "2026-01-30T02:03:44.692727"
        },
        {
            "title": "Stocks in news: Meesho, ITC, Paytm, Nestle, Vedanta, Tata Consumer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-meesho-itc-paytm-nestle-vedanta-tata-consumer/articleshow/127788682.cms",
            "description": "Indian markets saw a slight rise on Thursday amidst mixed signals. Key companies like Paytm and ITC released their third-quarter financial results. Paytm reported a significant profit jump, while ITC's profit remained flat. Tata Motors experienced a profit decline. Other companies like Vedanta and Tata Consumer are also in focus due to corporate developments.",
            "pubDate": "2026-01-30T02:03:44.692857"
        },
        {
            "title": "US stock futures fall on Apple warning, gold up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-futures-fall-on-apple-warning-gold-up/articleshow/127788649.cms",
            "description": "US equity futures declined as Apple warned of margin pressures, fueling concerns about AI investment returns. Gold and silver saw gains, while Asian shares edged higher. Investors are increasingly wary of the timing and profitability of massive tech spending on artificial intelligence.",
            "pubDate": "2026-01-30T02:03:44.693036"
        },
        {
            "title": "Foreign investors rejig offshore structures to satisfy Indian tax rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-investors-rejig-offshore-structures-to-satisfy-indian-tax-rules/articleshow/127788529.cms",
            "description": "Foreign investors are bolstering offshore arms with tangible operations to demonstrate substance, following a Supreme Court ruling that denied tax benefits to entities lacking it. Measures include appointing local directors and hiring office space to prove these entities are not merely paper companies designed to evade Indian taxes.",
            "pubDate": "2026-01-30T02:03:44.693215"
        },
        {
            "title": "Adani Group plans up to 1.5 billion yen fundraising from Japan after rating upgrade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-plans-up-to-1-5-billion-yen-fundraising-from-japan-after-rating-upgrade/articleshow/127788457.cms",
            "description": "Adani Group is set to borrow between $1 billion and $1.5 billion in Japanese yen. This move follows credit upgrades from a Japanese rating agency. The funds will be raised over the next 12 to 18 months. This will increase Adani's access to long-term capital from Japan. Japanese investors offer long maturities, benefiting infrastructure-heavy groups.",
            "pubDate": "2026-01-30T02:03:44.693590"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley maintains Equal Weight on ITC; Motilal Oswal retains Buy on Swiggy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-maintains-equal-weight-on-itc-motilal-oswal-retains-buy-on-swiggy/articleshow/127790675.cms",
            "description": "Brokerage houses remain selectively bullish on Indian equities, with Motilal Oswal reiterating a Buy on Swiggy, while Morgan Stanley maintains an Overweight on Adani Power and an Equal Weight stance on ITC amid steady operational performance.",
            "pubDate": "2026-01-30T04:15:48.424399"
        },
        {
            "title": "Budget 2026: Stocks to buy, key market triggers and what to expect from Nirmala Sitharaman",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-stocks-to-buy-key-market-triggers-and-what-to-expect-from-nirmala-sitharaman/articleshow/127790660.cms",
            "description": "With foreign investors exiting and the rupee at record lows, all eyes are on Finance Minister Nirmala Sitharaman's Union Budget. Investors seek fiscal prudence, protection from US tariffs, and signals to stabilize capital flows amidst global uncertainty. Key sectors like defense, railways, and data centers are expected to be in focus.",
            "pubDate": "2026-01-30T04:15:48.424524"
        },
        {
            "title": "Budget 2026: Motilal Oswal bullish on 60 stocks across 10 sectors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/budget-2026-motilal-oswal-bullish-on-60-stocks-across-10-sectors/slideshow/127790602.cms",
            "description": "With the Union Budget 2026 set to be unveiled on February 1, Motilal Oswal has identified 60 stocks across ten key sectors that are likely to be in focus as policy announcements shape market direction. The picks are anchored in themes such as infrastructure spending, consumption recovery, and manufacturing push, offering investors a curated list of stocks to watch as budget-related triggers unfold.",
            "pubDate": "2026-01-30T04:15:48.424629"
        },
        {
            "title": "Rs 4 lakh crore wiped out! Sensex slumps 600 pts, Nifty below 25,300 as budget jitters, other factors rattle D-Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-4-lakh-crore-wiped-out-sensex-slumps-600-pts-nifty-below-25300-as-budget-jitters-other-factors-rattle-d-street/articleshow/127790609.cms",
            "description": "Indian stock markets saw a significant drop on Friday. Both the Sensex and Nifty indices fell from their recent peaks. Investors adopted a cautious approach ahead of the upcoming Union Budget. This selloff erased considerable investor wealth. Several factors contributed to the market's decline, including budget uncertainties, a weakening rupee, and foreign fund outflows.",
            "pubDate": "2026-01-30T04:15:48.424727"
        },
        {
            "title": "Swiggy shares tank 7% after Q3 loss widens to Rs 1,065 crore. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-shares-tank-7-after-q3-net-loss-widens-to-rs-1065-crore-what-should-investors-do/articleshow/127790493.cms",
            "description": "Swiggy's shares dropped as its net loss widened to Rs 1,065 crore in Q3FY26, despite a 54% surge in revenue to Rs 6,148 crore. The food delivery segment saw its fastest growth in three years, while quick commerce continued rapid expansion, though segment losses increased.",
            "pubDate": "2026-01-30T04:15:48.424836"
        },
        {
            "title": "ITC shares in focus after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-shares-in-focus-after-q3-results-should-you-buy-sell-or-hold/articleshow/127790233.cms",
            "description": "ITC’s December-quarter performance has drawn a muted response from brokerages, with analysts largely holding their ground despite steady operating metrics and strong FMCG growth. With the stock down over 20% in January and trading near a 52-week low, the focus has shifted to the impact of higher cigarette taxes set to kick in from February, tempering near-term optimism even as fundamentals remain resilient.",
            "pubDate": "2026-01-30T04:15:48.424939"
        },
        {
            "title": "Voltas shares tank 5% after weak Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/voltas-shares-in-focus-after-weak-q3-results-should-you-buy-sell-or-hold/articleshow/127789883.cms",
            "description": "Voltas shares were down 5% after its net profit dropped 35.4% year-on-year in the December quarter of FY26. Revenue also saw a slight dip. The company's room air conditioner business performed well despite seasonal challenges. Brokerages have mixed views, with some reiterating sell ratings due to margin concerns and joint venture losses. Others maintain equal weight, watching for margin recovery and operational readiness.",
            "pubDate": "2026-01-30T04:15:48.425036"
        },
        {
            "title": "Dabur India shares rise 2% as Q3 net profit increases 7%. What are analysts saying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dabur-india-shares-in-focus-as-q3-net-profit-rises-7-what-are-analysts-saying/articleshow/127789443.cms",
            "description": "Dabur India shares were up 2% after it reported a 7% year-on-year increase in consolidated net profit to Rs 560 crore for the December quarter, with revenue growing 6% to Rs 3,559 crore. The company's FMCG business saw broad-based growth, with key brands gaining market share in India. International business also performed strongly, growing 11.1%.",
            "pubDate": "2026-01-30T04:15:48.425151"
        },
        {
            "title": "Tata Motors shares fall 4% as Q3 net profit declines 48%; smart uptick in revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-in-focus-as-q3-net-profit-declines-48-smart-uptick-in-revenue/articleshow/127789265.cms",
            "description": "Tata Motors shares will be in spotlight after it reported a 48% YoY decline in consolidated net profit to Rs 705 crore for the December quarter, despite a 16% rise in revenue to Rs 21,847 crore. The company's commercial vehicle segment saw a 20% increase in wholesales, with domestic market share improving. Management cited disciplined execution and demand tailwinds for the performance.",
            "pubDate": "2026-01-30T04:15:48.425250"
        },
        {
            "title": "Stocks to buy in 2026 for long term: SBI Life, Metro Brands among 5 stocks that could give 10-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-for-long-term-sbi-life-metro-brands-among-5-stocks-that-could-give-10-30-return/slideshow/127789192.cms",
            "description": "Brokerages have turned positive on a mix of insurance, retail, auto and logistics stocks, underlining confidence in earnings visibility and sectoral tailwinds.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-30T04:15:48.425346"
        },
        {
            "title": "Paytm shares fall 4% despite Q3 net profit rocketing 971% QoQ. Buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-in-focus-as-q3-net-profit-rockets-971-qoq-to-rs-225-crore/articleshow/127789137.cms",
            "description": "Paytm shares fell 4% even as it reported a significant turnaround in its third-quarter results, posting a consolidated net profit of Rs 225 crore, a stark contrast to last year's loss. Revenue from operations climbed 20% year-on-year, driven by strong growth in payments GMV and financial services distribution. The company also saw a substantial increase in its EBITDA, reaching Rs 156 crore.",
            "pubDate": "2026-01-30T04:15:48.425443"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/127789142.cms",
            "description": "In the Nifty500 pack, 11 stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on January 29, 2026, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2026-01-30T04:15:48.425536"
        },
        {
            "title": "Shayona Engineering shares to list today. Check GMP ahead of debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shayona-engineering-shares-to-list-today-check-gmp-ahead-of-debut/articleshow/127789078.cms",
            "description": "Shayona Engineering shares are set to debut on the BSE SME platform. The company's Initial Public Offering saw strong investor interest, particularly from non-institutional investors. The IPO was priced at Rs 144 per share. Grey market sentiment indicates a positive but cautious outlook for the listing day. Investors will be watching the company's performance and financial growth post-listing.",
            "pubDate": "2026-01-30T04:15:48.425628"
        },
        {
            "title": "Explained: Why gold, silver ETFs crashed up to 14% and should you buy the dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/explained-why-gold-silver-etfs-crashed-up-to-14-and-should-you-buy-the-dip/articleshow/127791282.cms",
            "description": "Gold, silver ETFs saw a sharp selloff on Friday, plunging as much as 14% as investors rushed to book profits after precious metals retreated from highs. The fall has sparked debate over whether the correction offers a buying opportunity or signals the end of a historic rally that saw silver surge 56% in January and gold post its strongest monthly gain since 1980. The domestic rout mirrored global markets, with spot silver sliding nearly 6% and gold dropping close to 4% from record levels, triggering steep losses across both silver and gold ETFs.",
            "pubDate": "2026-01-30T05:16:00.657528"
        },
        {
            "title": "Hindustan Copper shares tank over 10%. Can investors buy this dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-copper-shares-tank-over-10-can-investors-buy-this-dip/articleshow/127791208.cms",
            "description": "Hindustan Copper shares saw a significant drop on Friday. Investors booked profits after an impressive rally earlier in the week. The stock had reached record highs. Experts advise caution due to current valuations. They suggest waiting for dips for fresh entries. The stock has shown strong performance recently.",
            "pubDate": "2026-01-30T05:16:00.657652"
        },
        {
            "title": "South Indian Bank shares fall by 19% post CEO not seeking reappointment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/south-indian-bank-shares-fall-by-19-post-ceo-not-seeking-reappointment/articleshow/127791238.cms",
            "description": "South Indian Bank shares fell sharply after CEO P R Seshadri decided not to seek reappointment. The stock decline came despite healthy Q3 earnings, improved asset quality and strong long-term returns, highlighting investor concerns over leadership transition.",
            "pubDate": "2026-01-30T05:16:00.657857"
        },
        {
            "title": "Vedanta shares slide 8% after Q3 results. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-shares-slide-8-after-q3-results-should-you-buy-sell-or-hold/articleshow/127791205.cms",
            "description": "Vedanta shares fell over 8% a day after the company posted record quarterly EBITDA, as investors booked profits and brokerages flagged limited near-term upside despite strong operational performance and improving balance sheet metrics.",
            "pubDate": "2026-01-30T05:16:00.657958"
        },
        {
            "title": "Indonesia stock exchange CEO resigns after $80 billion market rout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indonesia-stock-exchange-ceo-resigns-after-80-billion-market-rout/articleshow/127790816.cms",
            "description": "Indonesia Stock Exchange chief has resigned. This follows a warning from MSCI about a potential downgrade. The market experienced a significant fall. Authorities have introduced measures to address concerns. The rupiah has reached a record low. The resignation aims to improve the capital market. Investors are watching for further developments.",
            "pubDate": "2026-01-30T05:16:00.658077"
        },
        {
            "title": "45 stocks turned multibaggers since last Budget; where could FM Sitharaman create the next winners?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/45-stocks-turned-multibaggers-since-last-budget-where-could-fm-sitharaman-create-the-next-winners/articleshow/127790801.cms",
            "description": "The previous Budget reinforced the government's commitment to capital expenditure, especially in infrastructure, defence and manufacturing. As the market heads into another Budget, expectations are more tempered. Brokerages broadly agree that the scope for a large fiscal stimulus is limited, but targeted measures could still shape sectoral performance.",
            "pubDate": "2026-01-30T05:16:00.658182"
        },
        {
            "title": "Rs 42,000 crore boom! Hindustan Copper shares surge 133% in just 2 months. Time to exit or wait for bigger target?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-42000-crore-boom-hindustan-copper-shares-surge-133-in-just-2-months-time-to-exit-or-wait-for-bigger-target/articleshow/127790748.cms",
            "description": "Hindustan Copper shares have surged 133% in two months, adding nearly Rs 41,850 crore to investor wealth. Experts note a strong uptrend and technical breakout, driven by global copper demand and company-specific growth triggers like a new mining block acquisition. While some advise caution on valuations, the overall structure remains bullish.",
            "pubDate": "2026-01-30T05:16:00.658281"
        },
        {
            "title": "Vodafone Idea shares jump 13% on turnaround plan. What CLSA, BofA, other brokerages say",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-jump-13-on-turnaround-plan-what-clsa-bofa-other-brokerages-say/articleshow/127792495.cms",
            "description": "Vodafone Idea shares surged after unveiling a Rs 45,000 crore turnaround plan, but brokerages remain divided, with targets ranging from Rs 10 to Rs 14 amid execution risks, funding concerns and uncertainty over tariff hikes and long-term debt sustainability.",
            "pubDate": "2026-01-30T06:02:16.718964"
        },
        {
            "title": "Jefferies' Chris Wood cuts India weightage in portfolio. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jefferies-chris-wood-cuts-india-weightage-in-portfolio-heres-why/articleshow/127791968.cms",
            "description": "Jefferies strategist Christopher Wood has reduced India’s weighting in his Asia portfolio, citing heavy global investor positioning in AI-linked stocks in North Asia. In his latest GREED & Fear note, he said the rally in semiconductors has boosted Taiwan and Korea’s share in the MSCI EM index, dragging India’s weight down to 13.1%, its lowest since March 2023.",
            "pubDate": "2026-01-30T06:02:16.719069"
        },
        {
            "title": "NALCO shares tumble 9% as metal stocks retreat after 3-day rally. What's behind the slide?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nalco-shares-tumble-9-as-metal-stocks-retreat-after-3-day-rally-whats-behind-the-slide/articleshow/127791869.cms",
            "description": "Shares of National Aluminium Company slid  9% on Friday as a sharp pullback in global and domestic metal prices, a stronger dollar and profit booking dragged the metal index down 4%, snapping a three-day rally and weighing on sentiment across commodity stocks.",
            "pubDate": "2026-01-30T06:02:16.719262"
        },
        {
            "title": "Dixon Tech shares soar 5% after Q3. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-tech-shares-soar-5-after-q3-should-you-buy-sell-or-hold/articleshow/127792990.cms",
            "description": "Dixon Technologies shares jumped after a strong Q3 profit print, but brokerages remain divided. While Motilal Oswal stays bullish, Goldman Sachs maintains a Sell, citing volume pressure and moderating growth, as memory costs and demand challenges persist.",
            "pubDate": "2026-01-30T07:02:54.031568"
        },
        {
            "title": "Indo-MIM is said to plan seeking up to $700 Million in India IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indo-mim-is-said-to-plan-seeking-up-to-700-million-in-india-ipo/articleshow/127792557.cms",
            "description": "Precision components maker Indo-MIM Ltd. is gearing up for its India IPO, aiming to raise up to $700 million. The company has reportedly lowered its valuation target to $2.5 billion from $3.2 billion, reflecting a cautious market sentiment.  The offering includes both new shares and a significant stake sale by existing investors.",
            "pubDate": "2026-01-30T07:02:54.031733"
        },
        {
            "title": "Bullion’s vertical run is over, Ravi Dharamshi says as gold and silver ETFs slide",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bullions-vertical-run-is-over-ravi-dharamshi-says-as-gold-and-silver-etfs-slide/articleshow/127794833.cms",
            "description": "Gold and silver’s blistering rally has stalled, with fund manager Ravi Dharamshi warning that bullion’s “near-vertical rise” has run its course. Precious metals and ETFs tumbled sharply as investors booked profits, global prices retreated, and a stronger dollar added pressure ahead of Trump’s imminent Fed chair announcement.",
            "pubDate": "2026-01-30T08:20:02.353332"
        },
        {
            "title": "Cupid shares surge 13% on stellar Q3 earnings, 4:1 bonus issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-shares-surge-13-on-stellar-q3-earnings-41-bonus-issue/articleshow/127795490.cms",
            "description": "Cupid shares surged after reporting record Q3FY26 earnings and announcing a 4:1 bonus issue. Strong profit growth, margin expansion and robust investor interest lifted the stock, reflecting confidence in the company’s growth outlook across domestic and export businesses.",
            "pubDate": "2026-01-30T08:59:54.853582"
        }
    ]
}