{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-01T15:51:25.070963",
    "items": [
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to benefit from potential upmove with limited downside risk",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-benefit-from-potential-upmove-with-limited-downside-risk/articleshow/125690246.cms",
            "description": "Nifty hit a fresh all-time high of 26,310 last week and continues to trade within a strong upward-sloping channel, supported by bullish weekly and daily technical indicators. Breakout signals, firm RSI readings, and supportive derivatives data all point to sustained positive momentum. With better-than-expected GDP numbers adding to market strength, experts suggest a buy-on-dips approach.",
            "pubDate": "2025-12-01T09:36:45.702438"
        },
        {
            "title": "This multibagger pharma stock rockets 15% after USFDA’s historic approval for antibiotic drug Zaynich",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-multibagger-pharma-stock-rockets-15-after-usfdas-historic-approval-for-antibiotic-drug-zaynich/articleshow/125688777.cms",
            "description": "The US FDA has accepted Wockhardt’s New Drug Application for Zaynich, its first-in-class antibiotic. This marks the first-ever acceptance of an NDA for a New Chemical Entity from an Indian pharma company, representing a major regulatory breakthrough.",
            "pubDate": "2025-12-01T09:36:45.702560"
        },
        {
            "title": "12 Multibaggers: FIIs and MFs-backed stocks deliver over 25% gains in both quarters of FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-multibaggers-fiis-and-mfs-backed-stocks-deliver-over-25-gains-in-both-quarters-of-fy26/slideshow/125688822.cms",
            "description": "Stocks that consistently generate strong returns and attract investments from major institutional players like Foreign Institutional Investors (FIIs) and Mutual Funds (MFs) are worth close attention. In the first two quarters of the current fiscal year (FY26: April–June and July–September), around 21 stocks delivered price gains exceeding 25% in both quarters and were held by FIIs and MFs as of the September ’25 quarter. This analysis focuses only on companies with a market capitalisation above Rs 1,500 crore. Notably, 12 of these 20 stocks have more than doubled investors’ wealth so far this fiscal year, while the remaining eight have also performed impressively, rising between 66% and 99% during the same period. (Data Source: ACE Equity).",
            "pubDate": "2025-12-01T09:36:45.702672"
        },
        {
            "title": "Hindustan Zinc shares gain 3% as silver surge lifts sentiment; up for fifth day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-gain-3-as-silver-surge-lifts-sentiment-up-for-fifth-day/articleshow/125688711.cms",
            "description": "Hindustan Zinc shares rose on Monday, marking a fifth consecutive day of gains, driven by record-high silver prices and robust investor interest. As India’s sole listed silver producer, the company stands to benefit from industrial demand, Fed rate cut expectations, and untapped valuation potential relative to global peers.",
            "pubDate": "2025-12-01T09:36:45.702769"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of more than 22% in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-more-than-22-in-1-year/articleshow/125687993.cms",
            "description": "In the last few days, it is not only the Nifty and Sensex that have moved up; the mid-cap indices have had an upward trajectory as well. And, importantly, market breadth has been positive. All this suggests the bulls are back in the game. So, with the basic assumption that being bullish is better than being bearish and fearful, it might be time to bring select stocks onto your watchlist. Our selected stocks for today depict a strong upward trajectory in their overall average score which is based on five key pillars: Earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2025-12-01T09:36:45.702864"
        },
        {
            "title": "Will AI-driven volatility continue to shape US market sentiment this week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-ai-driven-volatility-continue-to-shape-us-market-sentiment-this-week/slideshow/125688154.cms",
            "description": "Investors will closely track signals on how profitable artificial intelligence ventures are likely to be, along with indicators of the broader economy’s strength. These factors are crucial for helping stabilise the U.S. equity market, which has experienced noticeable volatility. (Source: Reuters)",
            "pubDate": "2025-12-01T09:36:45.702977"
        },
        {
            "title": "2026 Oil Outlook: Will OPEC+ cut again to support prices?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2026-oil-outlook-will-opec-cut-again-to-support-prices/slideshow/125687522.cms",
            "description": "OPEC+ kept oil output unchanged for the first quarter of next year, a move that signals the group may be wary of a potential supply glut. The decision was expected, as members executing voluntary cuts had already indicated they would stick to their plan. The group again stressed its commitment to market stability, pointing to a steady global economic outlook and low oil inventories. (Source: Reuters)",
            "pubDate": "2025-12-01T09:36:45.703076"
        },
        {
            "title": "Paytm shares jump over 3%, extending fourth straight day of gains. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-jump-over-3-extending-fourth-straight-day-of-gains-heres-why/articleshow/125686692.cms",
            "description": "Paytm shares rose sharply on Monday, extending their fourth straight session of gains after One97 Communications announced full ownership of three key group companies.  One97 Communications has secured full ownership of Foster Payment Networks, Paytm Insuretech and PFSL by acquiring the remaining 9.99%, 67.55% and 51.22% stakes. With this, all three firms are now wholly owned subsidiaries.",
            "pubDate": "2025-12-01T09:36:45.703173"
        },
        {
            "title": "India’s PE/VC investments rose to USD 5.3 billion in October 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-pe/vc-investments-rose-to-usd-5-3-billion-in-october-2025/slideshow/125686477.cms",
            "description": "India recorded USD 5.3 billion in PE/VC investments across 102 deals in October 2025, marking a 9% year-on-year rise. Although the total deal value increased, the number of transactions fell 30% month-on-month, reflecting fewer but larger deals. Pure-play PE/VC investments reached a 13-month high of USD 5 billion, representing an 81% increase compared to October 2024. (Source: Reuters)",
            "pubDate": "2025-12-01T09:36:45.703265"
        },
        {
            "title": "Reliance’s 4th monetisation wave: Is Ambani’s $80 billion post-Covid capex about to pay off in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliances-4th-monetisation-wave-is-ambanis-80-billion-post-covid-capex-about-to-pay-off-in-2026/articleshow/125686213.cms",
            "description": "Reliance Industries is entering its fourth major monetisation cycle, aiming to unlock returns from nearly $80 billion invested since Covid. Analysts expect strong cash-flow growth driven by 5G leadership, data centres, refining, and new energy expansion — without increasing leverage.",
            "pubDate": "2025-12-01T09:36:45.703360"
        },
        {
            "title": "Stock markets: Which way will the wind blow in 2026?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-markets-which-way-will-the-wind-blow-in-2026/articleshow/125686157.cms",
            "description": "Markets that moved sideways through 2025 may see a shift in 2026 as FIIs potentially return, supported by currency stability, cooling AI trade, and improving earnings visibility. While a 2024-style rally is unlikely, a balanced mix of momentum and value is expected, creating strong bottom-up opportunities across broader markets.",
            "pubDate": "2025-12-01T09:36:45.703448"
        },
        {
            "title": "Buy, Sell or Hold: Citi maintains buy on largecap pharma stocks like Lupin & Sun Pharma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-citi-maintains-buy-on-largecap-pharma-stocks-like-lupin-sun-pharma/articleshow/125685539.cms",
            "description": "Brokerages like Citi and Choice Institutional Equities are optimistic about the pharmaceutical and flexible workspace sectors. Citi maintains a 'Buy' on Lupin and Sun Pharma, citing strong US growth and product pipelines. Choice Institutional Equities initiates 'Buy' coverage on Smartworks, highlighting India's booming flexible workspace market and the company's strong position for significant expansion.",
            "pubDate": "2025-12-01T09:36:45.703541"
        },
        {
            "title": "BOJ hints at December rate hike as Ueda signals policy shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-hints-at-december-rate-hike-as-ueda-signals-policy-shift/slideshow/125685431.cms",
            "description": "Bank of Japan Governor Kazuo Ueda signaled that the central bank will closely evaluate the pros and cons of raising interest rates at its December 18–19 meeting. His remarks indicated that a potential rate hike is now firmly on the table. (Source: Reuters)",
            "pubDate": "2025-12-01T09:36:45.703631"
        },
        {
            "title": "GAIL among 7 F&O stocks that saw sharp rise in futures open Interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gail-among-7-fo-stocks-that-saw-sharp-rise-in-futures-open-interest/slideshow/125685188.cms",
            "description": "As of November 28, there was a notable surge in futures open interest for seven stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.\"",
            "pubDate": "2025-12-01T09:36:45.703726"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/125684249.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2025-12-01T09:36:45.703816"
        },
        {
            "title": "Sensex, Nifty hit new highs as D-Street cheers Q2 GDP print; banking index scales 60K level",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-hit-new-highs-as-d-street-cheers-q2-gdp-print-banking-index-scales-60k-level/articleshow/125684732.cms",
            "description": "India's benchmark indices, Nifty and Sensex, surged to fresh all-time highs, propelled by a stronger-than-expected 8.2% GDP growth in the second quarter. Nifty Bank also hit a record, with broad market gains reflecting renewed confidence in domestic demand amidst uneven global cues.",
            "pubDate": "2025-12-01T09:36:45.703910"
        },
        {
            "title": "Hyundai Motor India shares rise 4% on robust November sales. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-shares-rise-4-on-robust-november-sales-check-details/articleshow/125691011.cms",
            "description": "Hyundai Motor India’s shares rose up to 4% after the automaker reported strong November 2025 sales. Total volumes grew 9.1% YoY to 66,840 units, supported by 4.3% domestic growth and a sharp 26.9% jump in exports. The company said GST 2.0 reforms boosted momentum, while rising exports underscore Hyundai’s strategy to position India as a key global manufacturing base.",
            "pubDate": "2025-12-01T09:59:32.933556"
        },
        {
            "title": "LIC uses Cipla’s dip as entry point, raises stake by 2% to 7.05%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lic-uses-ciplas-dip-as-entry-point-raises-stake-by-2-to-7-05/articleshow/125690949.cms",
            "description": "LIC increased its stake in Cipla to 7.055% by acquiring 2.03% shares between July 17 and November 27. The purchase comes as Cipla trades near key SMAs, posts modest Q2 growth, and gains a ‘Buy’ rating from Sharekhan.",
            "pubDate": "2025-12-01T09:59:32.933680"
        },
        {
            "title": "Elon Musk says AI & robotics will drive almost all value and names the stocks he sees winning",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/elon-musk-says-ai-robotics-will-drive-almost-all-value-and-names-the-stocks-he-sees-winning/articleshow/125690933.cms",
            "description": "Elon Musk told Zerodha’s Nikhil Kamath that AI and robotics will drive nearly all future economic value, with companies leading these technologies set to dominate in the long term. Asked which firms beyond his own are best positioned, Musk highlighted Google for its foundational AI work and Nvidia for its crucial role in powering the ecosystem.",
            "pubDate": "2025-12-01T09:59:32.933888"
        },
        {
            "title": "Market Wrap: Sensex settles 65 pts lower, Nifty flat after hitting fresh peaks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-settles-65-pts-lower-nifty-flat-after-hitting-fresh-peaks/articleshow/125691398.cms",
            "description": "India's robust 8.2% Q2 GDP growth initially propelled markets to record highs, with the Nifty and Sensex touching new peaks. However, a late pullback, led by pharma and financial stocks, saw indices close with marginal losses. Despite the dip, auto and IT sectors provided some support, with HDFC Bank and Bajaj Finance being notable decliners.",
            "pubDate": "2025-12-01T10:29:02.054527"
        },
        {
            "title": "10 Midcap stocks trading below their industry average PE;  potentially undervalued",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-midcap-stocks-trading-below-their-industry-average-pe-potentially-undervalued/slideshow/125691795.cms",
            "description": "A Price-to-Earnings (PE) ratio lower than the industry average indicates that a stock is valued more cheaply relative to its earnings compared to its peers. Based on a valuation scan by StockEdge.com, we have identified the top 10 stocks from the NSE Midcap segment with PE ratios below their respective industry averages.",
            "pubDate": "2025-12-01T10:29:02.054651"
        },
        {
            "title": "Midcap's 27% slump in 2025 so far is a dip-buying opportunity. Know why this brokerage sees 37% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/midcaps-27-slump-in-2025-so-far-is-a-dip-buying-opportunity-know-why-this-brokerage-sees-37-upside/articleshow/125691992.cms",
            "description": "Despite a 27% decline in 2025, Anand Rathi sees Premier Energis as a strong buy, projecting 37% upside. Growth is driven by high-efficiency solar lines, plant consolidation, technology upgrades, and diversification into inverters and storage. Robust execution, R&D, and sector tailwinds support revenue and margin expansion.",
            "pubDate": "2025-12-01T10:49:26.155759"
        },
        {
            "title": "Dividend yield, trader, investor & income generation: 5 stocks with the right mix of dividend yield & upside potential of up to 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dividend-yield-trader-investor-income-generation-5-stocks-with-the-right-mix-of-dividend-yield-upside-potential-of-up-to-24/articleshow/125692799.cms",
            "description": "With their interest limited to quick capital gains, individual investors and traders rarely look at dividend yields. Institutional investors, on the other hand, do. In fact, many state upfront that they will invest in stocks with a certain dividend yield. They find the opportunity in bear markets and even become bottom makers. They ensure a stock does not fall below a certain level, because, at that level, dividend yield becomes reason enough to buy them. But dividend yield can also be a useful measure for investors and traders for tactical plays. You just need to know how to read its likely impact on stock prices.",
            "pubDate": "2025-12-01T11:16:37.999552"
        },
        {
            "title": "Tata Motors shares rise 4% after impressive November sales. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-rise-4-after-impressive-november-sales-check-details/articleshow/125692824.cms",
            "description": "Tata Motors’ commercial vehicle business surged on strong November sales, posting 29% YoY growth driven by broad-based domestic and export demand. Robust Q2 performance and expectations of continued momentum in construction, infrastructure and mining sectors boosted investor sentiment.",
            "pubDate": "2025-12-01T11:16:37.999678"
        },
        {
            "title": "US stocks open lower ahead of Fed's Powell's speech, manufacturing data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-ahead-of-feds-powell-speech-manufacturing-data/articleshow/125697082.cms",
            "description": "Wall Street's main indexes opened lower on Monday as investors stood on the sidelines ahead of fresh economic data and a closely watched speech from Federal Reserve Chair Jerome Powell to gauge the central bank's policy decision later this month.",
            "pubDate": "2025-12-01T14:56:54.662468"
        },
        {
            "title": "ICICI Prudential AMC, Powerica, 2 others secure Sebi nods to launch IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-prudential-amc-powerica-2-others-secure-sebi-nods-to-launch-ipos/articleshow/125696940.cms",
            "description": "Sebi has approved IPO proposals of ICICI Prudential AMC, Powerica, Annu Projects and Technocraft Ventures, allowing them to proceed after DRHP review. The issues include OFS, fresh equity, and large fundraising across asset management, power, EPC and infrastructure sectors.",
            "pubDate": "2025-12-01T14:56:54.662597"
        },
        {
            "title": "Bank Of Baroda, Mahindra & Mahindra among 9 stocks that hit 52-week highs & gained up to 14% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-baroda-mahindra-amp-mahindra-among-9-stocks-that-hit-52-week-highs-amp-gained-up-to-14-in-a-month/slideshow/125696131.cms",
            "description": "On Monday, the benchmark Sensex closed in the red, slipping 65 points to 85,642. Despite the muted market mood, nine BSE 100 stocks climbed to their 52-week highs, touching their best levels in a year. Traders and investors often see such breakouts as bullish signals, indicating strong momentum and potential for further short-term upside.",
            "pubDate": "2025-12-01T14:56:54.662706"
        },
        {
            "title": "Govt to sell up to 6% stake in Bank of Maharashtra, aims to garner Rs 2,600 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/govt-to-sell-up-to-6-stake-in-bank-of-maharashtra-aims-to-garner-rs-2600-crore/articleshow/125696149.cms",
            "description": "The government will divest up to 6% of its stake in Bank of Maharashtra through an Offer for Sale, aiming to raise approximately Rs 2,600 crore. This move will help the bank meet the minimum public shareholding norm of 25%, bringing the government's stake below 75%.",
            "pubDate": "2025-12-01T14:56:54.662811"
        },
        {
            "title": "Bajaj Finance to sell 2% stake in Bajaj Housing Finance in block deal: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-to-sell-2-stake-in-bajaj-housing-finance-in-block-deal-report/articleshow/125694963.cms",
            "description": "Bajaj Finance may offload a 2% stake in Bajaj Housing Finance via a block deal at a 9% discount. The stock remains oversold despite solid Q2 profit, revenue and NII growth, following a weak post-listing performance.",
            "pubDate": "2025-12-01T14:56:54.662912"
        },
        {
            "title": "Gainers & Losers: Lenskart, Wockhardt among 6 stocks that were in focus on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-amp-losers-lenskart-wockhardt-among-6-stocks-that-were-in-focus-on-monday/slideshow/125694291.cms",
            "description": "",
            "pubDate": "2025-12-01T14:56:54.663008"
        },
        {
            "title": "Stock Radar: 40% rally in 3 months! What should investors do with Shriram Finance stock?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-40-rally-in-3-months-what-should-investors-do-with-shriram-finance-stock/articleshow/125646322.cms",
            "description": "Shriram Finance shares have surged over 40% in three months, reaching record highs and signaling further upward potential. Experts suggest buying for a target of Rs 930 within weeks, citing a strong monthly chart breakout and bullish pennant pattern. The stock's robust performance and trading above key moving averages indicate a strong uptrend, with dips presenting buying opportunities.",
            "pubDate": "2025-12-01T14:56:54.663106"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125697518.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-01T15:18:59.600685"
        },
        {
            "title": "Two Trades for Today: A diversified financial services firm for 7.01 rise%, a large-cap metals stock for an almost 6% upmove",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-diversified-financial-services-firm-for-7-01-rise-a-large-cap-metals-stock-for-an-almost-6-upmove/articleshow/125697360.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-12-01T15:18:59.600815"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-tuesday/articleshow/125698061.cms",
            "description": "Markets hit fresh record highs before slipping into mild losses as pharma and financial weakness offset support from autos and IT. Analysts flagged consolidation, cautious sentiment and key support levels despite strong GDP data, while global cues remained weak.",
            "pubDate": "2025-12-01T15:51:23.803349"
        },
        {
            "title": "Market Trading Guide: Buy Paytm, Bank of Baroda and 2 more stocks on Tuesday for up to 13% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-paytm-bank-of-baroda-and-2-more-stocks-on-tuesday-for-up-to-13-gains/slideshow/125697883.cms",
            "description": "Impact of India’s stellar Q2 GDP growth of 8.2% did not last long for Indian headline indices as Nifty took a U-turn from its lifetime high of 26,325.80 to close in the red. The 50-stock index settled with a bearish candlestick on Monday, marking the third consecutive weak closing. Commenting on the day's action, Vatsal Bhuva, Technical Analyst at LKP Securities said that the day's lackluster closing indicates an extended consolidation at higher levels along with selling pressure. \"Additionally, call writing at 26200 and 26300 suggests that the index may trade sideways in the short term with a mild bearish undertone. The immediate support is placed at 26100, with resistance at 26300, while positional support stands at 26000 levels,\" Bhuva said.Here are 4 stock recommendations for Tuesday:",
            "pubDate": "2025-12-01T15:51:23.803504"
        }
    ]
}