{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-21T04:52:17.003486",
    "items": [
        {
            "title": "Technical picks: Aadhar Housing Finance, Mahindra Lifespaces among 5 stocks that can rally up to 16% in near term",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-picks-aadhar-housing-finance-mahindra-lifespaces-among-5-stocks-that-can-rally-up-to-16-in-near-term/slideshow/122805992.cms",
            "description": "Indian equity benchmarks ended lower last week, with the Nifty 50 falling 0.7% and the Sensex declining 0.9% amid weak earnings from major financial and IT firms and ongoing global trade uncertainty. Despite the downbeat sentiment, several analysts have identified five technical picks that could deliver up to 16% returns in the near term.",
            "pubDate": "2025-07-21T04:51:59.758156"
        },
        {
            "title": "IndiaMART shares in focus as Q1 net profit rises 35% YoY. Should you invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indiamart-shares-in-focus-as-q1-net-profit-rises-35-yoy-should-you-invest/articleshow/122805889.cms",
            "description": "IndiaMART InterMESH shares: IndiaMART reported consolidated revenue from operations of ₹372 crore in Q1 FY26, reflecting a 12% year-on-year growth from ₹331 crore in the same quarter last year. This includes ₹346 crore from IndiaMART’s standalone operations, up 10% YoY, and ₹25 crore contributed by Busy Infotech.",
            "pubDate": "2025-07-21T04:51:59.758290"
        },
        {
            "title": "Wipro, Bajaj Finance, GMDC, Yes Bank among 10 stocks showing RSI Trending Up on July 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wipro-bajaj-finance-gmdc-yes-bank-among-10-stocks-showing-rsi-trending-up-on-july-18/slideshow/122805852.cms",
            "description": "On July 18, 10 stocks from the Nifty 500 pack appeared in the RSI Trending Up scan, according to the stockedge.com data. It is an uptrend signal if the RSI value has crossed above 50 from below. \"RSI trending up\" means that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the price of the stock. This can indicate potential upward movement and may be used by traders to identify buying opportunities.",
            "pubDate": "2025-07-21T04:51:59.758403"
        },
        {
            "title": "Sensex jumps over 300 pts, Nifty tops 25,000 as strong Q1 earnings lift market sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-falls-over-150-pts-nifty-tests-24900-it-bank-stocks-tumble/articleshow/122805538.cms",
            "description": "Indian equity indices rebounded on Monday, fueled by strong Q1 earnings from HDFC Bank, ICICI Bank, and Reliance Industries, offsetting concerns about global trade. The Sensex climbed 284 points, while the Nifty50 rose 77 points. Experts are closely watching US-India trade talks, as a favorable deal could further boost market sentiment.",
            "pubDate": "2025-07-21T04:51:59.758511"
        },
        {
            "title": "Jane Street gets Sebi nod to resume trading in Indian markets after escrow deposit: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-allows-jane-street-to-restart-trading-report/articleshow/122805681.cms",
            "description": "Jane Street, a U.S. trading firm, is back in Indian markets. This follows a Sebi directive. The firm deposited Rs 4,844 crore in an escrow account. Sebi had banned Jane Street earlier. The ban was due to alleged market manipulation. The firm's return involves close monitoring by exchanges. Sebi's investigation revealed substantial profits by Jane Street.",
            "pubDate": "2025-07-21T04:51:59.758633"
        },
        {
            "title": "Stocks to buy today: ONGC, HDFC AMC among top 7 trading ideas for 21 July 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-ongc-hdfc-amc-among-top-7-trading-ideas-for-21-july-2025/articleshow/122805677.cms",
            "description": "The Indian market is expected to open lower on Monday amid weak global cues. Nifty futures closed at 25,026, down 0.59%, while India VIX edged up. Options data suggests a broad range of 24,500–25,500, with profit-taking pressure visible. Analysts recommend select stock picks and F&O strategies as Nifty struggles to reclaim the 25,000 mark.",
            "pubDate": "2025-07-21T04:51:59.758737"
        },
        {
            "title": "RBL Bank shares slide 3% after Q1 net profit declines 46% YoY. Should you buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-as-q1fy26-net-profit-declines-46-yoy-should-you-buy/articleshow/122805622.cms",
            "description": "RBL Bank's shares are under scrutiny following a 46% YoY drop in net profit for Q1FY26, reaching ₹200.33 crore due to decreased interest income and increased operating expenses. NII fell by 13% YoY to ₹1,481 crore, with NIM at 4.50%. Despite a slight rise in GNPA to 2.78%, NNPA improved to 0.45%.",
            "pubDate": "2025-07-21T04:51:59.758837"
        },
        {
            "title": "Sona Comstar shares in focus after China EV JV worth $20 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sona-comstar-shares-in-focus-after-china-ev-jv-worth-20-million/articleshow/122805586.cms",
            "description": "Sona Comstar has signed a $20 million JV deal with China’s Jinnaite Machinery to manufacture driveline systems for EVs and non-EVs. Backed by JNT’s patented tech and strong OEM clientele, the venture aims to tap growth in China and global markets. With a robust order book, operations are expected to begin in H2 FY26.",
            "pubDate": "2025-07-21T04:51:59.758934"
        },
        {
            "title": "HDFC Bank shares gain 2% on 12% YoY profit jump. Is it time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hdfc-bank-shares-gain-2-on-12-yoy-profit-jump-is-it-time-to-buy/articleshow/122805477.cms",
            "description": "HDFC Bank's Q1FY26 standalone net profit rose 12% YoY to Rs 18,155 crore. The bank announced its first-ever 1:1 bonus issue and a special interim dividend of Rs 5 per share. Antique maintains a 'Buy' rating with a target price of Rs 2,270, citing an improved growth outlook and potential RoA expansion.",
            "pubDate": "2025-07-21T04:51:59.759029"
        },
        {
            "title": "7 Nifty500 stocks with highest dividend yields. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-nifty500-stocks-with-highest-dividend-yields-do-you-own-any/slideshow/122805536.cms",
            "description": "If you're looking for steady income from your investments, dividend-paying stocks can be a good option. Dividend yield shows how much a company pays out in dividends each year compared to its stock price. As per Trendlyne data, these 7 stocks from the Nifty500 index gave dividend yields of up to 9% in the last 12 months. Here's the list:",
            "pubDate": "2025-07-21T04:51:59.759130"
        },
        {
            "title": "Yes Bank shares in focus after Q1 PAT zooms 59% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-shares-in-focus-after-q1-pat-zooms-59-yoy/articleshow/122805367.cms",
            "description": "Yes Bank reported a 59% YoY jump in Q1FY26 net profit to Rs 801 crore, driven by higher non-interest income and improved NII. Asset quality remained stable, while NIM rose to 2.5%. Technical indicators suggest a potential trend reversal, with analysts projecting a near-term upside towards Rs 21.50–23.00, backed by bullish chart patterns and strong support levels.",
            "pubDate": "2025-07-21T04:51:59.759225"
        },
        {
            "title": "GMDC, PVR Inox among 6 stocks that rose above VWAP on July 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmdc-pvr-inox-among-6-stocks-that-rose-above-vwap-on-july-18/slideshow/122805336.cms",
            "description": "On July 18, the closing prices of six stocks from the Nifty 500 pack rallied in the range of 1-3% relative to their VWAP (Volume Weighted Average Price), and a shift above the VWAP suggests a potential bullish trend, according to Stockedge.com's technical scan data.When the closing price rises above the VWAP, it signifies that the closing price is higher than the average price at which it was traded throughout the day, with the average being weighted by trading volume. This occurrence is often interpreted as a potential bullish signal by traders and investors. Potentially indicating positive sentiment in the market.",
            "pubDate": "2025-07-21T04:51:59.759320"
        },
        {
            "title": "ICICI Bank shares surge 2% after Q1 profit rises 15% YoY to Rs 12,768 crore. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/icici-bank-shares-in-focus-after-q1-profit-rises-15-5-to-rs-12768-crore-should-you-buy-sell-or-hold/articleshow/122805250.cms",
            "description": "ICICI Bank shares: ICICI Bank's shares experienced a surge following the announcement of a 15.5% YoY increase in net profit for the June quarter, reaching Rs 12,768 crore. While NII saw a 10.6% rise, NIM experienced a slight dip.",
            "pubDate": "2025-07-21T04:51:59.759413"
        },
        {
            "title": "Man Industries, Cupid, ITC Hotels among 6 stocks with White Marubozu Pattern on July 18",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/man-industries-cupid-itc-hotels-among-6-stocks-with-white-marubozu-pattern-on-july-18/slideshow/122805128.cms",
            "description": "On July 18, in the NSE list of stocks with a market cap of Rs 1,000 crore, six stocks came to the bullish scanner of \"White Marubozu\", according to stockedge.com's technical scan data. A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest.Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns for informed decisions about future price movements in financial markets.",
            "pubDate": "2025-07-21T04:51:59.759626"
        },
        {
            "title": "Cupid, NACL Industries among 5 smallcap stocks witness 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cupid-nacl-industries-among-5-smallcap-stocks-witness-5-year-swing-high-breakout/slideshow/122805058.cms",
            "description": "In the NSE smallcap pack, we have collated a list of five stocks that witnessed a 5-year swing high at the close on July 18, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years.",
            "pubDate": "2025-07-21T04:51:59.759719"
        }
    ]
}