{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-27T08:30:04.967883",
    "items": [
        {
            "title": "Q3 results today: Asian Paints, Vodafone and Tata Consumer among 59 BSE-listed companies to announce earnings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/q3-results-today-asian-paints-vodafone-and-tata-consumer-among-59-bse-listed-companies-to-announce-earnings/articleshow/127587902.cms",
            "description": "As earnings season progresses, investors are keenly watching 59 BSE-listed companies, including Nifty giants Asian Paints and Tata Consumer Products. Asian Paints is expected to show stable performance with improved volumes, while Vodafone Idea anticipates subdued results with widening losses. Tata Consumer Products is projected for a significant year-on-year profit increase.",
            "pubDate": "2026-01-27T02:08:47.102029"
        },
        {
            "title": "Axis Bank posts a 2.9% rise in Q3 net amid thinning margin",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/axis-bank-posts-a-2-9-rise-in-q3-net-amid-thinning-margin/articleshow/127584253.cms",
            "description": "Axis Bank reported a modest 2.9% net profit increase for the third quarter, impacted by a narrower net interest margin and higher credit costs. This was partly due to a technical change in loan accounting, which also affected gross slippages. Despite this, the bank saw deposit and loan book growth, with a focus on recalibrating its loan portfolio.",
            "pubDate": "2026-01-27T02:08:47.102154"
        },
        {
            "title": "Vodafone Idea Q3 Results Preview: Losses to widen further; marginal revenue growth seen",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/vodafone-idea-q3-results-preview-losses-to-widen-further-marginal-revenue-growth-seen/articleshow/127597396.cms",
            "description": "Vodafone Idea is expected to report a weak December-quarter showing, with revenue growth remaining muted and losses widening as modest ARPU gains are offset by continued subscriber erosion. An average of five brokerages forecasts revenue growth of about 1% YoY in Q3, while losses are seen expanding to around Rs 6,700-7,000 crore.",
            "pubDate": "2026-01-27T05:54:46.245113"
        },
        {
            "title": "Maruti Suzuki Q3 Preview: PAT seen rising up to 35% YoY. 5 key parameters to watch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/maruti-suzuki-q3-preview-pat-seen-rising-up-to-35-yoy-5-key-parameters-to-watch/articleshow/127602967.cms",
            "description": "Maruti Suzuki is expected to deliver a strong Q3 performance, driven by robust volumes, an improved product mix and operating leverage. Brokerages forecast a 24–35% surge in net profit and over 30% revenue growth, though margin trends may vary. The automaker will announce its October–December earnings on January 28.",
            "pubDate": "2026-01-27T06:56:54.219695"
        },
        {
            "title": "Tata Consumer Products Q3 Results: Cons PAT jumps 38% YoY to Rs 385 crore; revenue up 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-consumer-products-q3-results-cons-pat-jumps-38-yoy-to-rs-385-crore-revenue-up-15/articleshow/127607200.cms",
            "description": "Tata Consumer Products Q3 Results: Tata Consumer Products reported a robust 38% year-on-year increase in net profit for the December quarter, reaching Rs 385 crore. Revenue from operations also saw a significant 15% jump to Rs 5,112 crore, driven by strong volume growth across its India Branded business, including notable performance in coffee and the Tata Sampann portfolio.",
            "pubDate": "2026-01-27T08:30:04.205012"
        }
    ]
}