{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-02T23:50:18.482486",
    "items": [
        {
            "title": "Stock Radar: 30% rally in 3 months! Infosys hits fresh record highs; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-30-rally-in-3-months-infosys-hits-fresh-record-highs-time-to-buy-or-book-profits/articleshow/112996679.cms",
            "description": "Infosys, a major IT player on the Sensex, has seen a remarkable 36% increase in its stock price from May 30th to August 30th, 2024. It has maintained a steady uptrend since surpassing its February 2024 high, consistently setting higher lows over the past 5 weeks. This momentum pushed the stock price beyond its previous peak of Rs 1,959, recorded in January 2022, signalling a potential for further upward movement.",
            "pubDate": "2024-09-02T23:49:58.047143"
        },
        {
            "title": "Financial sector needs detailed, joint approach to address challenges: Sebi member Bhatia",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/financial-sector-needs-detailed-joint-approach-to-address-challenges-sebi-member-bhatia/articleshow/113001608.cms",
            "description": "Ashwani Bhatia, Sebi Whole-Time Member, emphasized the need for a detailed approach in addressing MSMEs' financial challenges. He highlighted the role of financial institutions and fintech partnerships while cautioning against shortcuts in SME listings. With the potential growth in India's startup ecosystem, Bhatia underscores the importance of proper due diligence.",
            "pubDate": "2024-09-02T23:49:58.047256"
        },
        {
            "title": "These 6 energy stocks hit fresh 52-week highs; rallied up to 30% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-energy-stocks-hit-fresh-52-week-highs-rallied-up-to-30-in-a-month/slideshow/112999655.cms",
            "description": "On Monday, India’s benchmark index Sensex climbed approximately 194 points to close at 82,560. During this uptick, 6 stocks within the BSE Energy index reached their highest prices in the past year. Hitting a 52-week high is notable because it signifies the highest price a stock has reached over the past year, offering essential information for traders and investors. This achievement is crucial for assessing a stock’s current value and anticipating future price trends.",
            "pubDate": "2024-09-02T23:49:58.047357"
        },
        {
            "title": "IREDA plans to raise around Rs 29,500 crore in debt, equity in FY25",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ireda-plans-to-raise-around-rs-29500-crore-in-debt-equity-in-fy25/articleshow/113001561.cms",
            "description": "IREDA plans to raise around Rs 25,000 crore from the debt market and Rs 4,500 crore through equity this fiscal. The agency has submitted a draft Green Taxonomy for approval, aimed at increasing capital for climate projects and is eyeing international funding post securing a 'BBB-' rating from S&P Global Ratings.",
            "pubDate": "2024-09-02T23:49:58.047463"
        },
        {
            "title": "She succeeded in 'pushing away' Sony from merger: Zee's Subhash Chandra levels allegations against SEBI chief Madhabi Puri Buch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/she-succeeded-in-pushing-away-sony-from-merger-zee-groups-subhash-chandra-levels-allegations-against-sebi-chief-madhabi-puri-buch/articleshow/113001146.cms",
            "description": "Zee group patriarch Subhash Chandra has made serious allegations against SEBI Chairperson Madhabi Puri Buch, accusing her of corruption and bias. Chandra claims this bias influenced the Zee-Sony merger and has halted cooperation with SEBI. Chandra is exploring legal action and calls on other corporate houses to join his fight.",
            "pubDate": "2024-09-02T23:49:58.047567"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-tuesday/articleshow/112999972.cms",
            "description": "Nifty 50 extended its rally to a record 13 sessions, closing 0.17% higher at 25,278 points, driven by IT stocks and consumer goods. Analysts foresee a sideways trend unless Nifty surpasses 25,300, with support at 25,210–25,120.",
            "pubDate": "2024-09-02T23:49:58.047659"
        },
        {
            "title": "Entrepreneur Siddhartha Yog buys over 10 lakh shares of Trent for Rs 718 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/entrepreneur-siddhartha-yog-buys-over-10-lakh-shares-of-trent-for-rs-718-crore/articleshow/112999816.cms",
            "description": "According to the block deal data available on the National Stock Exchange, Siddhartha Yog bought 10,09,200 shares, amounting to a 0.3 per cent stake in Trent.",
            "pubDate": "2024-09-02T23:49:58.047755"
        },
        {
            "title": "Market Trading Guide: Bajaj Finance, PI Industries among 5 stock recommendations for Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-bajaj-finance-pi-industries-among-5-stock-recommendations-for-tuesday/slideshow/112999534.cms",
            "description": "Benchmark index Nifty50 closed at an all-time high for the fourth straight session on Monday, driven by gains in IT and financial stocks. The S&P BSE Sensex closed 0.24% higher at 82,560, while the NSE Nifty50 ended above the 25,250 mark.\"The underlying trend of Nifty continues to be choppy with positive bias. Further upmove from here could pull Nifty towards 25000-25100 levels in the near term. Immediate support is at 24650,\" said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.Here are 5 stock recommendations for Tuesday:",
            "pubDate": "2024-09-02T23:49:58.047846"
        },
        {
            "title": "Didn't pay any salary or ESOPs to Buch as Sebi chief, clarifies ICICI Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/didnt-pay-any-salary-of-esops-to-buch-as-sebi-chief-clarifies-icici-bank/articleshow/112998207.cms",
            "description": "The lender also stated that during Buch's tenure with the ICICI Group, she was compensated through salary and other benefits in accordance with applicable policies. ICICI Bank highlighted that all payments made to Buch after her retirement were accrued during her employment with the group. These payments include ESOPs and retirement benefits.",
            "pubDate": "2024-09-02T23:49:58.047942"
        },
        {
            "title": "Tech View: Nifty gives no signs of reversal, support at 25,100. Here’s how to trade on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-gives-no-signs-of-reversal-support-at-25100-heres-how-to-trade-on-tuesday/articleshow/112998019.cms",
            "description": "Nifty's short-term uptrend remains strong. While facing resistance around 25,350, there are no signs of a major reversal. A decisive break above 25,400 could propel Nifty towards 25,800. Immediate support lies at 25,100, according to Nagaraj Shetti of HDFC Securities.",
            "pubDate": "2024-09-02T23:49:58.048037"
        },
        {
            "title": "Vodafone Idea, Sun TV among 5 stocks with long unwinding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-sun-tv-among-5-stocks-with-long-unwinding/slideshow/112996678.cms",
            "description": "Long unwinding refers to the selling of positions or stocks owned for a longer period either to book profit or to exit it in anticipation of impending bearishness. In Monday's trading session, five stocks witnessed a long unwinding. Here's the list:",
            "pubDate": "2024-09-02T23:49:58.048130"
        },
        {
            "title": "ITC, Infosys among 7 Nifty50 stocks that hit fresh 52-week highs on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-infosys-among-7-nifty50-stocks-that-hit-fresh-52-week-highs-on-monday/slideshow/112996490.cms",
            "description": "Nifty 50 recorded its thirteenth consecutive session of gains on Monday, marking its longest-ever rally. The index was boosted by gains in IT stocks amid optimism over a potential U.S. rate cut, and a rise in consumer goods shares following predictions of favourable monsoon rainfall. In Monday's session, seven Nifty50 stocks reached new 52-week highs. Here's the list:",
            "pubDate": "2024-09-02T23:49:58.048221"
        },
        {
            "title": "Federal Bank, ACC among 5 stocks with short covering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/federal-bank-acc-among-5-stocks-with-short-covering/slideshow/112996167.cms",
            "description": "Short covering happens when traders buy back shares they previously sold short, often due to a shift in market sentiment or new information. This usually results in a decrease in open interest and can drive the stock price higher. In Monday's trading session, five stocks saw short covering. Here's the list:",
            "pubDate": "2024-09-02T23:49:58.048311"
        },
        {
            "title": "Investors sell 54% of IPO shares within a week, finds Sebi study",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investors-sell-54-of-ipo-shares-within-a-week-finds-sebi-study/articleshow/112995307.cms",
            "description": "A Sebi study reveals that 54% of IPO shares are sold within a week of listing by non-anchor investors. The study shows that 63.3% of shares are sold by non-institutional investors, with a higher exit rate for positive listing gains.",
            "pubDate": "2024-09-02T23:49:58.048398"
        },
        {
            "title": "Vedanta board approves third interim dividend of Rs 20/share. Company payout at Rs 7,821 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-board-approves-third-interim-dividend-of-rs-20/share-company-payout-at-rs-7821-crore/articleshow/112995084.cms",
            "description": "Vedanta's board has approved the third interim dividend for the financial year 2024-25, with a payout of Rs 20 per equity share amounting to Rs 7,821 crore. The record date is set for September 10, 2024. Earlier in May and last month, the company declared two interim dividends amounting to Rs 11 and Rs 4 per share, respectively.",
            "pubDate": "2024-09-02T23:49:58.048492"
        },
        {
            "title": "'Expect volatility for 12 months, but downside limited': Kotak AMC's Nilesh Shah on stock markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/expect-volatility-for-12-months-but-downside-limited-kotak-amcs-nilesh-shah-on-stock-markets/videoshow/112994985.cms",
            "description": "Nilesh Shah, MD of Kotak AMC, suggests that due to various geopolitical and social factors, investors are limited in their choices for emerging markets. He believes that India stands out as a promising option amidst these limitations. He advises that although there may be volatility in the next 3, 6, 9, and 12 months, the downside risk is limited. Watch the full interview here.",
            "pubDate": "2024-09-02T23:49:58.048583"
        }
    ]
}