{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-21T08:23:58.464897",
    "items": [
        {
            "title": "Positive Breakout: These 6 stocks' close cross above their 200 DMA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-6-stocks-close-cross-above-their-200-dma/slideshow/124713472.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 10,000 crore, six stocks' closing prices crossed above their 200 DMA (Daily Moving Averages) on October 20, 2025, according to stockedge.com's technical scan data. The 200-day daily moving average (DMA) is used by traders as a key indicator for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-10-21T04:46:29.102352"
        },
        {
            "title": "Financial stocks to shop for Diwali: Brokerages see 7 counters with up to 30% upside this Samvat 2082",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/financial-stocks-to-shop-for-diwali-brokerages-see-7-counters-with-up-to-30-upside-this-samvat-2082/slideshow/124713329.cms",
            "description": "As Indian markets head into Diwali 2025, domestic sentiment has strengthened on easing global headwinds and resilient macro fundamentals. Brokerages see indices poised for a breakout backed by broad-based strength across banking sectors. Here are seven festive-season picks from the financial sector that reflect this optimism, each positioned for fresh momentum into Samvat 2082",
            "pubDate": "2025-10-21T04:46:29.102484"
        },
        {
            "title": "Diwali 2025: Top stocks offering up to 99% upside to buy on Muhurat trading this Samvat 2082",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-2025-top-stocks-offering-up-to-99-upside-to-buy-on-muhurat-trading-this-samvat-2082/slideshow/124713053.cms",
            "description": "As Samvat 2082 dawns with the auspicious Muhurat trading session today, Dalal Street is set to sparkle with festive optimism. Despite global uncertainties, analysts expect the special one-hour window to reflect India’s resilient growth story, backed by robust corporate earnings, steady domestic liquidity and upbeat investor sentiment. Brokerage houses have lined up their top stock picks across sectors — from banks and IT to autos — offering a mix of stability and strong return potential for the new trading year.",
            "pubDate": "2025-10-21T04:46:29.102600"
        },
        {
            "title": "Diwali bang for D-Street, Nifty hits 52-week high as banks, IT stocks rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-bang-for-d-street-nifty-hits-52-week-high-as-banks-it-stocks-rally/articleshow/124712565.cms",
            "description": "Indian equities surged to a 52-week high Monday, with the Nifty 50 just a percentage point away from its record high, as broad-based buying ahead of Diwali boosted risk assets that have had a rather circumspect run over the trailing 12 months.",
            "pubDate": "2025-10-21T04:46:29.102721"
        },
        {
            "title": "Muhurat to Muhurat: Stock indices see tepid gains; banks shine",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muhurat-to-muhurat-stock-indices-see-tepid-gains-banks-shine/articleshow/124712543.cms",
            "description": "Benchmark indices Sensex and Nifty delivered subdued returns in the one-, three-, and six-month periods since Muhurat trading 2024. Banks outperformed, while midcap and smallcap indices lagged sharply.",
            "pubDate": "2025-10-21T04:46:29.102825"
        },
        {
            "title": "Asian stocks surge as trade tensions ease, Nikkei hits record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-surge-as-trade-tensions-ease-nikkei-hits-record/articleshow/124712358.cms",
            "description": "Asian stocks rose on Tuesday as the prospect of easing trade tensions between the world's top two economies boosted risk sentiment, while the near-certainty of Sanae Takaichi becoming Japan's next prime minister sent the Nikkei to a record high.",
            "pubDate": "2025-10-21T04:46:29.102927"
        },
        {
            "title": "European stocks recover as easing US bank jitters drive risk appetite",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stocks-recover-as-easing-us-bank-jitters-drive-risk-appetite/articleshow/124712234.cms",
            "description": "European shares closed higher on Monday, as initial concerns over the stability of the U.S. banking sector eased, while fresh comments from U.S. President Donald Trump helped calm trade tensions, encouraging investors to move toward riskier assets.",
            "pubDate": "2025-10-21T04:46:29.103028"
        },
        {
            "title": "US stocks end sharply higher as earnings optimism fuels risk appetite",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-end-sharply-higher-as-earnings-optimism-fuels-risk-appetite/articleshow/124712108.cms",
            "description": "U.S. stocks jumped on Monday with finance and technology shares providing much of the upside muscle, as upbeat quarterly earnings results revived risk appetite and investors grew less fearful about regional bank credit quality.",
            "pubDate": "2025-10-21T04:46:29.103159"
        },
        {
            "title": "Global stocks jump as key earnings reports ahead; US yields ease",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/global-stocks-jump-as-key-earnings-reports-ahead-us-yields-ease/articleshow/124712079.cms",
            "description": "Major stock indexes gained sharply on Monday with investors looking forward to quarterly earnings reports from big U.S. companies this week, while U.S. Treasury yields edged lower ahead of upcoming U.S.-China trade discussions.",
            "pubDate": "2025-10-21T04:46:29.103296"
        },
        {
            "title": "Diwali Muhurat trading today: Timings, track record, trading strategy and which stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-muhurat-trading-today-timings-track-record-trading-strategy-and-which-stocks-to-buy/articleshow/124711997.cms",
            "description": "India's stock exchanges are shifting the Diwali Muhurat Trading window to an afternoon slot for the first time in decades, marking the start of Samvat 2082. This auspicious one-hour session, traditionally held in the evening, aims to blend tradition with operational efficiency.",
            "pubDate": "2025-10-21T04:46:29.103401"
        },
        {
            "title": "Stocks in news: PNB, ZEE, JSW Steel, REC, Glenmark",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-pnb-zee-jsw-steel-rec-glenmark/articleshow/124707863.cms",
            "description": "Indian markets are showing strong upward movement. Analysts suggest a potential consolidation before further gains. Several companies are in focus today. PNB faces a credit loss framework impact. Zee partners for baseball broadcasts. REC reported a profit rise. HDFC Bank sees no layoffs from AI. Jindal Steel is in talks for its steel business. JSW Steel anticipates strong demand.",
            "pubDate": "2025-10-21T04:46:29.103498"
        },
        {
            "title": "These large-caps have ‘strong buy’ & ‘buy’ recos and an upside potential of more than 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-caps-have-strong-buy-buy-recos-and-an-upside-potential-of-more-than-25/articleshow/124711608.cms",
            "description": "The markets have a big element of probability. The way things have panned out in the past few weeks, it is very likely that the bulls will strengthen their case for a comeback in all segments of the market. This does not mean that corrections will not happen; they will, as they are a part of the market. But, at this point of time, it is more important to look at how the fundamentals of a sector are shaping up. Check what companies are saying not only of what happened in Q2, but what they expect to happen in Q3.",
            "pubDate": "2025-10-21T04:46:29.103591"
        },
        {
            "title": "Two Trades for Today: A PSU banking major for a 7.05% gain, a mid-cap oil & gas refinery stock for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-psu-banking-major-for-a-7-05-gain-a-mid-cap-oil-gas-refinery-stock-for-almost-7-rise/articleshow/124711450.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-21T04:46:29.103710"
        },
        {
            "title": "Apple nears $4 trillion valuation as shares surge on strong iPhone 17 demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/apple-nears-4-trillion-valuation-as-shares-surge-on-strong-iphone-17-demand/articleshow/124713446.cms",
            "description": "Apple shares have reached an all-time peak, approaching a $4 trillion market valuation. Strong early sales of the latest iPhone models in China and the United States are driving this surge. Analysts anticipate Apple will exceed expectations for the current quarter and provide positive forecasts for the December period. This performance marks a significant turnaround for the company's stock.",
            "pubDate": "2025-10-21T04:46:29.103805"
        },
        {
            "title": "17 multibaggers dampen silver's shine, deliver up to 13,052% returns over one year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/17-multibaggers-dampen-silvers-shine-deliver-up-to-13052-returns-over-one-year/articleshow/124715878.cms",
            "description": "Silver delivered over 75% returns in one year, yet 25 large-cap and small-cap stocks outperformed it. Multibaggers like RRP Semiconductor led gains, while precious metals remain supported by global tensions and industrial demand.",
            "pubDate": "2025-10-21T08:23:50.173435"
        },
        {
            "title": "Muhurat Trading: PNB shares in focus after company flags Rs 9,000 crore hit from RBI credit loss rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muhurat-trading-pnb-shares-in-focus-after-company-flags-rs-9000-crore-hit-from-rbi-credit-loss-rules/articleshow/124715139.cms",
            "description": "Punjab National Bank expects a Rs 9,000 crore impact from RBI’s new expected credit loss (ECL) framework by 2031. The bank can absorb provisions through profits, maintaining strong capital ratios and investor confidence.",
            "pubDate": "2025-10-21T08:23:50.173548"
        },
        {
            "title": "Mukul Agrawal: Star investor on shopping spree with six fresh buys in September quarter",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mukul-agrawal-star-investor-on-shopping-spree-with-six-fresh-buys-in-september-quarter/slideshow/124715007.cms",
            "description": "Veteran investor Mukul Agrawal made fresh entries in six companies during the September 2025 quarter, signalling renewed interest in industrials, electronics, and green energy themes.",
            "pubDate": "2025-10-21T08:23:50.173647"
        },
        {
            "title": "Diwali Muhurat Trading 2025: Top 5 stocks that may shine bright in Samvat 2082",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-muhurat-trading-2025-top-5-stocks-that-may-shine-bright-in-samvat-2082/articleshow/124714548.cms",
            "description": "Indian markets rose ahead of the Muhurat Trading session marking Samvat 2082. Sensex gained 411 points and Nifty 50 added 133 points. Experts recommend top stocks like Paytm, Adani Green, Ambuja, V-Mart, and Royal Orchid Hotels for fresh positions.",
            "pubDate": "2025-10-21T08:23:50.173751"
        },
        {
            "title": "Diwali Muhurat trading today: Here's what the trading setup looks like",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-muhurat-trading-today-heres-what-the-trading-setup-looks-like/articleshow/124714058.cms",
            "description": "Indian markets advanced, supported by strong Q2 corporate results, festival optimism, and positive global cues. FII and DII inflows lifted the rupee, while volatility eased and global indices gained.",
            "pubDate": "2025-10-21T08:23:50.173868"
        },
        {
            "title": "Diwali stocks to buy: RIL, Canara Bank among 10 stocks to buy for Samvat 2082, offer up to 30% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-stocks-to-buy-ril-canara-bank-among-10-stocks-to-buy-for-samvat-2082-offer-up-to-30-gains/slideshow/124714005.cms",
            "description": "With the beginning of a new Samvat 2082, brokerages InCred Equities and Religare Broking have identified 5 stocks each to buy this Diwali. While InCred has suggested techno-funda pick, Religare has recommended fundamental socks. The stocks are from varied sectors. Here is the list of 10 stocks with investment rationale and targets.",
            "pubDate": "2025-10-21T08:23:50.173966"
        }
    ]
}