{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-17T01:13:22.072757",
    "items": [
        {
            "title": "Asian stocks have cautious start, Bitcoin in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-have-cautious-start-bitcoin-in-focus/articleshow/125373908.cms",
            "description": "Asian markets opened with caution. Investors await crucial US economic data. Uncertainty surrounds the US Federal Reserve's next move. Japan and Australia saw slight dips. South Korea's equities climbed. Bitcoin's gains have largely vanished. Oil prices are down, while gold is up. This week promises significant market movements.",
            "pubDate": "2025-11-17T01:13:14.277302"
        },
        {
            "title": "Stocks in news: Kotak Mahindra Bank, Websol, Glenmark Pharma, Minda Corp, Anant Raj",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-kotak-mahindra-bank-websol-glenmark-pharma-minda-corp-anant-raj/articleshow/125367018.cms",
            "description": "Indian markets experienced volatility, ending with modest gains as equities grapple with conflicting signals and cautious sentiment due to US market corrections. Kotak Mahindra Bank's board will consider a stock split, while Godrej Properties plans significant housing unit launches. NTPC aims for a substantial share in India's nuclear capacity, and Websol Energy System is exploring a large solar manufacturing facility.",
            "pubDate": "2025-11-17T01:13:14.277424"
        },
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125367104.cms",
            "description": "Indian equities closed higher on Friday. Nifty gained 31 points, reaching 25,910. Easing retail inflation and a strong corporate earnings season provided a supportive backdrop. Analysts anticipate markets to remain firm. A potential India-US trade deal could drive further gains. Foreign portfolio investors were net sellers, while domestic institutional investors were net buyers.",
            "pubDate": "2025-11-17T01:13:14.277840"
        },
        {
            "title": "Will Nifty break past the 26,000–26,100 hurdle this week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-nifty-break-past-the-2600026100-hurdle-this-week/articleshow/125373721.cms",
            "description": "Nifty is poised for further gains, with analysts eyeing a decisive move above 26,000-26,100 for the next rally leg. Key support is seen at 25,500-25,750. Banking and IT strength are supporting the index, with expectations of retesting previous highs.",
            "pubDate": "2025-11-17T01:13:14.277940"
        },
        {
            "title": "What do Bihar Poll results spell for market, economy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/what-do-bihar-poll-results-spell-for-market-economy/articleshow/125373673.cms",
            "description": "Bihar election results highlight the impact of cash transfers on voter turnout and electoral success. While markets anticipate a positive reaction to the NDA's victory, concerns are rising over the fiscal deficit implications of such populist spending. Brokerages note that increased subsidy spending could push states' fiscal deficits beyond the 3% GDP ceiling.",
            "pubDate": "2025-11-17T01:13:14.278038"
        },
        {
            "title": "Private credit finds deeper funding pools at home",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/private-credit-finds-deeper-funding-pools-at-home/articleshow/125373768.cms",
            "description": "India's private credit sector is becoming the new darling for wealthy investors and family offices. With stock markets frequently in turmoil, these high-net-worth individuals are turning their gaze toward high-yield opportunities that private credit provides.",
            "pubDate": "2025-11-17T01:13:14.278225"
        },
        {
            "title": "RBI's  moratorium on loan repayments could help exporters take a breath amid uncertainties",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbis-moratorium-on-loan-repayments-could-help-exporters-take-a-breath-amid-uncertainties/articleshow/125373764.cms",
            "description": "The Reserve Bank of India is stepping up to assist exporters with a key moratorium on loan repayments. This timely intervention is designed to give businesses the flexibility they need to adapt to the shifting tides of global commerce and pursue fresh avenues for growth.",
            "pubDate": "2025-11-17T01:13:14.278320"
        }
    ]
}