{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-30T09:33:18.338107",
    "items": [
        {
            "title": "These 7 midcap stocks plunge over 50% from their year-high levels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-7-midcap-stocks-plunge-over-50-from-their-year-high-levels/slideshow/121512950.cms",
            "description": "The BSE Midcap index has declined by around 9% from its 52-week high of 49,701, while the benchmark Sensex has dropped approximately 5% from its peak. Within the midcap segment, seven stocks have plunged more than 50% from their respective 52-week highs.",
            "pubDate": "2025-05-30T09:32:59.498120"
        },
        {
            "title": "Reliance Power shares jump 16% to hit fresh 52-week high amid high volume",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-jump-16-to-hit-fresh-52-week-high-amid-high-volume/articleshow/121512548.cms",
            "description": "Reliance Power's shares surged nearly 16% to a 52-week high of Rs 60.5, fueled by robust trading volumes. The stock has delivered multibagger returns, rallying 139% in the past year. The company reported a consolidated net profit of Rs 126 crore for Q4 FY25, reversing a previous loss, and a full-year profit of Rs 2,947.83 crore.",
            "pubDate": "2025-05-30T09:32:59.498263"
        },
        {
            "title": "Ola Electric, Kalyan Jewellers among 10 firms where promoters pledge increased in Q4",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-kalyan-jewellers-among-10-firms-where-promoters-pledge-increased-in-q4/slideshow/121512432.cms",
            "description": "Promoter share pledging is often used as a tool to raise funds for working capital, personal needs, or other business ventures. Based on StockEdge data, here are 10 companies that saw an increase in promoter pledging during Q4 FY25:",
            "pubDate": "2025-05-30T09:32:59.498369"
        },
        {
            "title": "Stocks to Buy | Missed the May Rally? Sandip Sabharwal’s Strategy for June",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-missed-the-may-rally-sandip-sabharwals-strategy-for-june/slideshow/121511822.cms",
            "description": "Sandip Sabharwal, in an interview with ET Now, said that investors who exited in May made a mistake. His mantra for June is simple yet powerful: “You should never have gone away.” The market has surprised many with its strength, and although prices have surged, participation remains low. This reflects a strong fear of missing out (FOMO), but it also underscores the risks of trying to time the market based on short-term sentiment.",
            "pubDate": "2025-05-30T09:32:59.498469"
        },
        {
            "title": "Why Sebi short-circuited Munna Bhai’s Circuit: Arshad Warsi, wife among 59 banned for role in YouTube stock manipulation scheme",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-sebi-short-circuited-munna-bhais-circuit-arshad-warsi-wife-among-59-banned-for-role-in-youtube-stock-manipulation-scheme/articleshow/121511471.cms",
            "description": "SEBI on Thursday barred actor Arshad Warsi, his wife Maria Goretti, and 57 others from trading in securities for one to five years, alleging their involvement in a pump-and-dump scheme that misled retail investors into buying Sadhna Broadcast shares through manipulated online content and coordinated trading.",
            "pubDate": "2025-05-30T09:32:59.498565"
        },
        {
            "title": "BSE shares zoom 11% in two days amid heavy volumes; hit fresh high at Rs 2,670",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-shares-zoom-11-in-two-days-amid-heavy-volumes-hit-fresh-high-at-rs-2670/articleshow/121510600.cms",
            "description": "BSE's stock has surged by 11% in two trading sessions, reaching a new all-time high of Rs 2,670, fueled by high trading volumes and a recent Sebi circular. The regulator's directive asks exchanges to standardize equity derivative expiry days, choosing either Tuesday or Thursday. This follows NSE's move to shift its F&O expiry to Monday, potentially impacting BSE's market share.",
            "pubDate": "2025-05-30T09:32:59.498660"
        },
        {
            "title": "Railways stocks: Time to be contrarian; will bearish analysts go wrong again? 6 stocks, 2 with buy recos, 4 with sell recos",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railways-stocks-time-to-be-contrarian-will-bearish-analysts-go-wrong-again-6-stocks-2-with-buy-recos-4-with-sell-recos/articleshow/121510305.cms",
            "description": "In the stock market, you can expect great rewards only if you take risks. So, is it time to risk investing in railways-related stocks? These stocks did very well up to July 2024 and have since been underperforming. Will they make a sharp comeback, as defence stocks did? Before deciding on whether to buy, sell, or hold railways stocks, let’s consider the bull and bear cases, not so much for the stocks themselves, but for the real business of the companies involved in the railways sector.",
            "pubDate": "2025-05-30T09:32:59.498751"
        },
        {
            "title": "BSE, Bharti Hexacom among 4 midcap stocks that hit 52-week highs on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-bharti-hexacom-among-4-midcap-stocks-that-hit-52-week-highs-on-friday/slideshow/121509657.cms",
            "description": "Indian benchmark indices edged lower on Friday, as weakness in information technology stocks, pressured by renewed uncertainty over U.S. tariffs, outweighed optimism ahead of domestic growth data due later in the day. Meanwhile, 4 midcap stocks from the Nifty200 index hit fresh 52-week highs. Here's a look:",
            "pubDate": "2025-05-30T09:32:59.498850"
        },
        {
            "title": "Birlasoft shares slide over 6% in 2 days post Q4 earnings miss; Nuvama slashes target price on bleak outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/birlasoft-shares-slide-over-6-in-2-days-post-q4-earnings-miss-nuvama-slashes-target-price-on-bleak-outlook/articleshow/121508635.cms",
            "description": "Birlasoft shares dropped after weak Q4 FY25 results, marked by revenue declines and muted growth outlook. Nuvama cut its target price, citing project ramp-downs and soft deal wins. Despite margin gains from efficiencies, growth remains uncertain. Leadership changes and segment focus are yet to show tangible improvement.",
            "pubDate": "2025-05-30T09:32:59.498945"
        },
        {
            "title": "Outdated risk, renewed opportunities: A case for acquisition financing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/outdated-risk-renewed-opportunities-a-case-for-acquisition-financing/articleshow/121508412.cms",
            "description": "India's financial landscape has evolved significantly, making the old restrictions on acquisition financing by banks outdated. Lifting these restrictions would allow Indian banks to participate in the growing M&A market, fostering transparency and boosting the competitiveness of Indian companies. This move aligns with the country's economic progress and strengthens its position in the global arena.",
            "pubDate": "2025-05-30T09:32:59.499040"
        },
        {
            "title": "Samvardhana Motherson shares gain over 4% after Q4 profit rises 20% YoY; announces 1:2 bonus issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/samvardhana-motherson-shares-gain-over-4-after-q4-profit-rises-20-yoy-announces-12-bonus-issue/articleshow/121508257.cms",
            "description": "Samvardhana Motherson's shares surged following a robust Q4FY25 performance, marked by a 20% YoY increase in net profit, reaching Rs 1,050.5 crore. The company announced a 1:2 bonus issue and a final dividend of Rs 0.35 per share. Additionally, the board approved raising up to Rs 8,500 crore through NCDs, with FY25 net profit soaring 40% to Rs 3,803.02 crore.",
            "pubDate": "2025-05-30T09:32:59.499133"
        },
        {
            "title": "F&O Radar| Deploy Bull Call Spread in Nifty to capitalise on volatile swings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-capitalise-on-volatile-swings/articleshow/121508201.cms",
            "description": "Nifty has resumed its uptrend after forming a swing low at 24,462 on May 22 and is now consolidating near 25,100 resistance. With strong sectors like Realty, Metals, IT, and Energy, traders are advised to consider a Bull Call Spread strategy to capitalise on moderate upside amid volatility, aiming for a target around 24,900–25,000 in the near term.",
            "pubDate": "2025-05-30T09:32:59.499243"
        },
        {
            "title": "Muthoot Finance shares surge 6% as FinMin bats for exemption of sub-Rs 2 lakh gold loans from RBI rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/muthoot-finance-shares-surge-6-as-finmin-bats-for-exemption-of-sub-rs-2-lakh-gold-loans-from-rbi-rules/articleshow/121508093.cms",
            "description": "The Finance Ministry recommended exempting sub-Rs 2 lakh gold loans from the RBI’s draft rules. The move aims to protect small borrowers and ease compliance for NBFCs. The ministry also proposed deferring implementation to January 2026, offering relief to lenders reliant on gold-backed loans, especially in rural and semi-urban markets.",
            "pubDate": "2025-05-30T09:32:59.499337"
        },
        {
            "title": "Sadhna Broadcast: Sebi bans actor Arshad Warsi, 58 others from markets for up to 5 yrs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sadhna-broadcast-sebi-bans-actor-arshad-warsi-58-others-from-markets-for-up-to-5-yrs/articleshow/121507704.cms",
            "description": "Sebi has barred Arshad Warsi, Maria Goretti, and 57 entities from the securities market for 1-5 years due to misleading videos promoting Sadhna Broadcast shares. The regulator imposed fines and directed disgorgement of unlawful gains worth Rs 58.01 crore. The scheme involved inflating the stock price through collusive trading and promotional videos to lure investors before a coordinated sell-off.",
            "pubDate": "2025-05-30T09:32:59.499428"
        },
        {
            "title": "Japan’s Inflation Crossroads: Can the BOJ Tame Prices Without Stalling Growth?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-inflation-crossroads-can-the-boj-tame-prices-without-stalling-growth/slideshow/121508022.cms",
            "description": "Core inflation in Tokyo rose by 3.6% year-on-year in May, marking the fastest pace since January 2023. This increase surpassed market expectations of a 3.5% rise and reflects persistent upward pressure on prices. Tokyo’s inflation has now remained above the Bank of Japan’s 2% target for three consecutive years, reinforcing concerns about entrenched price growth. (Source: Reuters)",
            "pubDate": "2025-05-30T09:32:59.499518"
        },
        {
            "title": "Alkem Laboratories shares drop 5% after Q4 results. Should you buy, sell, or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/alkem-laboratories-shares-drop-5-after-q4-results-should-you-buy-sell-or-hold/articleshow/121507469.cms",
            "description": "Alkem Laboratories shares fell 5% after Q4FY25 results showed a modest 4.2% profit rise to Rs 306 crore and margin contraction to 12.4%. While Jefferies downgraded the target to Rs 4,460 citing weak margins, Nomura maintained a ‘Buy’ with a Rs 5,430 target. The company expects high single-digit revenue growth in FY26 and rising tax rates in FY27.",
            "pubDate": "2025-05-30T09:32:59.499609"
        }
    ]
}