{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-25T04:10:51.336527",
    "items": [
        {
            "title": "Wall Street Week Ahead: Megacap-led earnings deluge, Fed meeting headline busy US markets week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-megacap-led-earnings-deluge-fed-meeting-headline-busy-us-markets-week/articleshow/124798509.cms",
            "description": "A crucial week for the US stock rally unfolds with major tech earnings, a likely Federal Reserve rate cut, and escalating US-China trade tensions. Investors are keenly watching corporate results, particularly from tech giants, and the Fed's forward guidance. A prolonged government shutdown adds to market uncertainty, potentially impacting economic growth and investor sentiment.",
            "pubDate": "2025-10-25T03:42:16.069961"
        },
        {
            "title": "Blackstone makes BFSI push, to buy 10% in Federal Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstone-makes-bfsi-push-to-buy-10-in-federal-bank/articleshow/124798702.cms",
            "description": "In a significant move, global investment giant Blackstone has allocated more than six thousand crore rupees to Federal Bank, officially becoming the largest shareholder in the Kerala-based institution. This landmark deal highlights the increasing appetite of foreign investors for India's burgeoning financial landscape.",
            "pubDate": "2025-10-25T04:10:49.748436"
        },
        {
            "title": "Ides of October: Big overseas money flows into banks, auto and metals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ides-of-october-big-overseas-money-flows-into-banks-auto-and-metals/articleshow/124798632.cms",
            "description": "October brought a refreshing wave of optimism as foreign investors rekindled their interest in India’s financial services, funneling impressive amounts of money back into the market after a dry spell of outflows. This shift is primarily spurred by stronger-than-anticipated results from banks and an encouraging outlook for public sector banking.",
            "pubDate": "2025-10-25T04:10:49.748571"
        }
    ]
}