{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-23T05:32:30.505494",
    "items": [
        {
            "title": "​Retail holding drops QoQ in 5 defence stocks in September quarter; BEL and HAL in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-holding-drops-qoq-in-5-defence-stocks-in-september-quarter-bel-and-hal-in-focus/slideshow/125515753.cms",
            "description": "While retail investors’ appetite for defence stocks remained strong in the September quarter, with ownership rising in 13 out of 18 stocks in the Nifty India Defence Index, five counters saw a decline in retail shareholding. Data Patterns reported the sharpest drop, followed by PSU majors Bharat Electronics Ltd (BEL) and Hindustan Aeronautics Ltd (HAL), along with Cyient DLM and Bharat Forge.",
            "pubDate": "2025-11-23T05:32:28.049039"
        },
        {
            "title": "​12 penny stocks crash up to 65% in a month. Are you holding any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-penny-stocks-crash-up-to-65-in-a-month-are-you-holding-any/slideshow/125515621.cms",
            "description": "Over the past month, 12 penny stocks have recorded steep losses, falling between 20% and 65%. These laggards were identified through a focused screening process that considered companies with a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum trading volume of 5 lakh shares in the recent period. The aim was to highlight low-priced, actively traded penny stocks that have witnessed sharp declines. (Data Source: ACE Equity)While penny stocks often entice investors with low entry prices and the prospect of quick gains, they carry significant risks. Their low liquidity, high volatility and limited disclosures make them prone to manipulation and sudden crashes. Without a clear strategy and strict risk controls, investors may incur substantial losses.",
            "pubDate": "2025-11-23T05:32:28.049164"
        },
        {
            "title": "Will Nifty finally cross 26,277? 6 triggers that could break the 421-day deadlock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-nifty-finally-cross-26277-six-triggers-that-could-break-the-421-day-deadlock/articleshow/125515374.cms",
            "description": "Nifty gained 0.6% for the week, briefly approaching its record high of 26,277 before ending Friday lower at 26,068.15. Analysts expect the index to be guided largely by global cues in the coming week, with no major domestic data releases. Sensitivity to global markets, currency movements and FII flows is expected to remain high as investors look for a breakout above record levels.Nifty gained 0.6% for the week, briefly approaching its record high of 26,277 before ending Friday lower at 26,068.15. Analysts expect the index to be guided largely by global cues in the coming week, with no major domestic data releases. Sensitivity to global markets, currency movements and FII flows is expected to remain high as investors look for a breakout above record levels",
            "pubDate": "2025-11-23T05:32:28.049252"
        }
    ]
}