{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-18T18:40:05.523822",
    "items": [
        {
            "title": "Piramal Finance Q2 profit rises 2x, Poonawalla Fincorp back in black",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/piramal-finance-q2-profit-rises-2x-poonawalla-fincorp-back-in-black/articleshow/124652642.cms",
            "description": "Piramal Finance reported a two-fold increase in net profit to ₹327 crore, driven by a 28% rise in net interest income. Poonawalla Fincorp swung to a profit of ₹74 crore from a loss, with net interest income growing over 37%. Both companies saw significant growth in assets under management.",
            "pubDate": "2025-10-18T02:33:42.771335"
        },
        {
            "title": "RIL profit up 16% in Q2 on better O2C, retail play",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ril-profit-up-16-in-q2-on-better-o2c-retail-play/articleshow/124652908.cms",
            "description": "Reliance Industries has announced strong financial results for the September quarter. The company's profit saw a significant 16% increase compared to the previous year. This growth was fueled by excellent performance across its key sectors, including oil-to-chemicals, telecom, and retail.  Jio and Reliance Retail also posted impressive gains. The company is also making strides in its new energy initiatives.",
            "pubDate": "2025-10-18T03:36:10.373246"
        },
        {
            "title": "Yes Bank Q2 results: Standalone PAT jumps 18% YoY at Rs 654 crore, NII rises 4.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/yes-bank-q2-results-standalone-pat-jumps-18-yoy-nii-rises-4-5/articleshow/124659469.cms",
            "description": "Yes Bank has announced its financial results for the quarter ending September 30, 2025. The private lender saw its profit after tax surge by 18.3 percent year-on-year. This brings the profit to Rs 654.47 crore. Net interest income also grew by 4.5 percent. This indicates a positive financial performance for the bank during the period.",
            "pubDate": "2025-10-18T08:00:24.133295"
        },
        {
            "title": "Federal Bank Q2 results: Standalone PAT declines over 9% YoY, all-time high NII posted at Rs 2,495 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/federal-bank-q2-results-standalone-pat-declines-over-9-yoy-all-time-high-nii-posted-at-rs-2495-crore/articleshow/124658951.cms",
            "description": "Federal Bank's net profit saw a year-on-year dip. However, the bank achieved its highest ever net interest income and fee income. Deposits and advances showed growth. Asset quality remained strong. The bank's capital adequacy and net worth also improved. This performance highlights the bank's operational strengths and financial stability.",
            "pubDate": "2025-10-18T08:00:24.133405"
        },
        {
            "title": "UltraTech Cement Q2 results: Cons PAT zooms 75% YoY  to Rs 1,232 crore, net sales jump 21%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ultratech-cement-q2-results-cons-pat-zooms-75-yoy-net-sales-jump-21/articleshow/124660864.cms",
            "description": "Aditya Birla Group company UltaTech Cements has released its results for the quarter ended September 2025, posting an impressive surge of 75.2% YoY to Rs 1,232 crore, while its net sales were up 21.3% YoY.",
            "pubDate": "2025-10-18T08:59:41.974531"
        },
        {
            "title": "ICICI Bank Q2 results: PAT rises 5% YoY to Rs 12,359 cr, NII grows 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q2-results-pat-rises-5-yoy-to-rs-12359-cr-nii-grows-7/articleshow/124662020.cms",
            "description": "ICICI Bank announced a 5.2% year-on-year profit growth to Rs 12,359 crore for Q2FY26, driven by a 7.4% increase in net interest income to Rs 21,529 crore. The bank also reported a 6.5% rise in core operating profit to Rs 17,078 crore, with a net interest margin of 4.30%.",
            "pubDate": "2025-10-18T09:40:01.873235"
        },
        {
            "title": "HDFC Bank Q2 results: Standalone net profit rises 11% YoY to Rs 18,641 cr; NII witnesses 5% growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q2-results-standalone-net-profit-rises-11-yoy-at-rs-18641-cr-nii-witnesses-5-growth/articleshow/124661058.cms",
            "description": "HDFC Bank announced its second quarter results for FY26. The bank's net profit saw a 10.8% year-on-year increase, reaching Rs 18,641.28 crore. Net interest income also grew by 4.8% to Rs 31,550 crore. The net interest margin stood at 3.27% on total assets. These figures reflect the bank's performance in the recent past.",
            "pubDate": "2025-10-18T09:40:01.873385"
        },
        {
            "title": "IndusInd Bank Q2 results: Bank slips into Rs 437 cr loss against net profit year-ago, NII drops 17% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indusind-bank-q2-results-bank-slips-into-rs-437-cr-loss-against-net-profit-year-ago-nii-drops-17-yoy/articleshow/124662682.cms",
            "description": "IndusInd Bank reported a net loss of Rs 437 crore in the second quarter of FY26, a significant reversal from a profit of Rs 1,331 crore in the prior year. Net Interest Income also saw a decline of 17.6% year-on-year, with net interest margins falling to 3.32% from 4.08%.",
            "pubDate": "2025-10-18T10:41:58.409314"
        },
        {
            "title": "Punjab National Bank Q2 results: Net profit grows 14% YoY, NII witnesses marginal dip",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/pnbs-q2-profit-rises-14-pc-to-rs-4904-cr/articleshow/124664056.cms",
            "description": "Punjab National Bank has reported a stellar performance for the September quarter of FY26, reporting a 14 percent increase in standalone net profit, which now stands at Rs 4,904 crore. The bank also highlighted significant year-on-year growth in operating profit and total income. An encouraging trend can be seen in financial ratios, with both gross and net NPAs showing improvement.",
            "pubDate": "2025-10-18T11:24:13.912606"
        },
        {
            "title": "ICICI Bank Q2 net profit up 5% to Rs 12,359 cr on lower provisions, beats estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q2-net-profit-up-5-to-rs-12359-cr-on-lower-provisions-beats-estimates/articleshow/124666740.cms",
            "description": "ICICI Bank's net profit rose 5.2% to Rs 12,359 crore in Q2, exceeding market expectations due to lower provisions. Despite a predicted marginal rise in credit cost, the bank anticipates better loan growth in the second half of the fiscal year, supported by government initiatives.",
            "pubDate": "2025-10-18T13:56:24.039998"
        },
        {
            "title": "Jaiprakash Power Ventures Q2 results: Company reports net profit at Rs 182.10 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jaiprakash-power-ventures-q2-profit-at-rs-182-cr/articleshow/124665845.cms",
            "description": "Jaiprakash Power Ventures reported its September quarter FY26 net profit at Rs 182.10 crore. This figure is nearly the same as the Rs 182.66 crore profit from the previous year. Total income saw an increase to Rs 1,478.49 crore. Expenses also rose to Rs 1,186.48 crore. The company is part of the Jaypee Group and operates power projects across India.",
            "pubDate": "2025-10-18T13:56:24.040134"
        },
        {
            "title": "IDFC First Bank Q2 results: Standalone PAT shoots up by 75% YoY, NII cracks 40%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idfc-first-bank-q2-results-standalone-pat-shoots-up-by-75-yoy-nii-cracks-40/articleshow/124665321.cms",
            "description": "IDFC Bank's standalone net profit surged by 75.5% year-on-year to Rs 352.31 crore in the second quarter of FY26. Despite this significant profit growth, the bank's net interest income experienced a sharp decline of 40% YoY, falling to Rs 5,112.57 crore.",
            "pubDate": "2025-10-18T13:56:24.040244"
        },
        {
            "title": "IDFC First Bank Q2 results: Standalone PAT shoots up by 75% YoY, NII up 7%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/idfc-first-bank-q2-results-standalone-pat-shoots-up-by-75-yoy-nii-up-7/articleshow/124665321.cms",
            "description": "IDFC Bank's standalone net profit surged by 75.5% year-on-year to Rs 352.31 crore in the second quarter of FY26. Despite this significant profit growth, the bank's net interest income experienced a sharp decline of 40% YoY, falling to Rs 5,112.57 crore.",
            "pubDate": "2025-10-18T18:40:04.370120"
        }
    ]
}