{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-11T15:54:02.868159",
    "items": [
        {
            "title": "Pre-market action: Here's the trade setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125900611.cms",
            "description": "Indian stock markets closed lower for the third day in a row. Early gains were lost as traders took profits. Analysts anticipate markets will follow global trends, with a focus on US monetary policy. Foreign investors sold shares, while domestic investors bought them. The Indian Rupee weakened against the US Dollar.",
            "pubDate": "2025-12-11T01:42:42.963937"
        },
        {
            "title": "Stocks in news: Jio Financial, Adani Green, Nestle, Cipla, IOC, Waaree Energies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-jio-financial-adani-green-nestle-cipla-ioc-waaree-energies/articleshow/125900591.cms",
            "description": "Indian markets saw volatility and closed lower on Wednesday. Analysts are watching key support levels. Several companies are in focus due to recent developments. Jio Financial and BlackRock are investing in their joint venture. Adani Enterprises' rights issue saw strong demand. Adani Green experienced a large block deal. Cipla launched a new medication. IOC is planning board restructuring.",
            "pubDate": "2025-12-11T01:42:42.964055"
        },
        {
            "title": "Asian stocks advance as Fed’s rate cut lifts mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-advance-as-feds-rate-cut-lifts-mood/articleshow/125900571.cms",
            "description": "Asian markets followed Wall Street higher after the US Federal Reserve lowered interest rates. Fed Chair Jerome Powell indicated confidence in the US economy's future. This move boosted tech and financial stocks across Asia. Investors anticipate positive trends for Asian equities and currencies. Export companies are expected to benefit from improved US growth prospects.",
            "pubDate": "2025-12-11T01:42:42.964145"
        },
        {
            "title": "Large caps set to deliver; annual market returns could be 12-14%: Raamdeo Agrawal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/large-caps-set-to-deliver-annual-market-returns-could-be-12-14-raamdeo-agrawal/articleshow/125900493.cms",
            "description": "Large-cap stocks are expected to lead market gains in the coming years. Motilal Oswal Financial Services chairman Raamdeo Agrawal sees significant potential in autos and capital markets. He believes the economy is transitioning towards car ownership, similar to China's growth phase. Specific companies in these sectors are highlighted as strong investment opportunities for wealth creation.",
            "pubDate": "2025-12-11T01:42:42.964232"
        },
        {
            "title": "Pension funds can now invest in more stocks, gold, silver ETFs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pension-funds-can-now-invest-in-more-stocks-gold-silver-etfs/articleshow/125900442.cms",
            "description": "Pension regulator PFRDA has revised investment rules, allowing private pension funds to invest in the top 250 market-cap stocks and gold/silver ETFs for better returns. These changes aim to boost pension fund popularity by offering wider options to savers, with the private sector overseeing ₹15.78 trillion in assets.",
            "pubDate": "2025-12-11T01:42:42.964315"
        },
        {
            "title": "TotalEnergies divests Adani Green shares worth Rs 2,778 cr",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/totalenergies-divests-adani-green-shares-worth-rs-2778-cr/articleshow/125900393.cms",
            "description": "TotalEnergies Renewables Indian Ocean divested shares worth ₹2,778.1 crore in Adani Green Energy through a block deal on Wednesday. The entity sold 2.86 crore shares at ₹970 each, reducing its stake by 1.74%. Quant Mutual Fund and Authum Investment & Infrastructure were among the buyers.",
            "pubDate": "2025-12-11T01:42:42.964402"
        },
        {
            "title": "Kotak Securities sees 13% rise in Nifty by next December",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-securities-sees-13-rise-in-nifty-by-next-december/articleshow/125900368.cms",
            "description": "Kotak Securities is optimistic about the stock markets, setting a Nifty target of 29,120 by December 2026, driven by strong earnings growth expectations. The brokerage anticipates over 17% earnings growth for 2027, with improved macro conditions and policy decisions expected to fuel gains. They favor BFSI, technology, healthcare, and hospitality sectors, while also noting positive outlooks for gold and silver.",
            "pubDate": "2025-12-11T01:42:42.964484"
        },
        {
            "title": "Adani Enterprises rights issue oversubscribed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-rights-issue-oversubscribed/articleshow/125900347.cms",
            "description": "Adani Enterprises' ₹25,000 crore rights issue concluded with 108% subscription, attracting applications for 149.5 million shares. The issue, priced at ₹1,800 per share, saw public investors oversubscribe their portion by 30%. Funds raised will be used for debt reduction and capital expenditure.",
            "pubDate": "2025-12-11T01:42:42.964575"
        },
        {
            "title": "Fixed deposit growth finds its key driver in rural incomes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fixed-deposit-growth-finds-its-key-driver-in-rural-incomes/articleshow/125900517.cms",
            "description": "Savings deposits in rural centres also posted a robust 10% increase, the fastest pace in six quarters. Experts attribute this shift to rising rural incomes while growth in the metro areas appears to be losing momentum as financially savvy investors increasingly divert funds into higher-yielding avenues such as mutual funds and equities.",
            "pubDate": "2025-12-11T01:42:42.964654"
        },
        {
            "title": "Stock Radar: Breakout from Ascending Triangle pattern makes Infosys an attractive buy check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-breakout-from-ascending-triangle-pattern-makes-infosys-an-attractive-buy-check-target-stop-loss/articleshow/125889128.cms",
            "description": "Infosys stock has broken out of a bullish technical pattern. This suggests a potential upward movement for the IT major. Experts recommend buying the stock now or on minor dips. The target price is set at Rs 2,000 within the next three to four months. This development offers an attractive opportunity for investors in the IT sector.",
            "pubDate": "2025-12-11T01:42:42.964734"
        },
        {
            "title": "RBI may maintain repo rate at 5.25% through FY27: Fitch",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-may-maintain-repo-rate-at-5-25-through-fy27-fitch/articleshow/125900329.cms",
            "description": "The commentary from BMI comes amid many economists and bond-market experts in India factoring in a further quarter percentage point reduction in policy rates, lowering terminal rate expectations to 5% in the current easing cycle after RBI looked past a sharply retreating rupee to deliver a rate cut last Friday.",
            "pubDate": "2025-12-11T01:42:42.964963"
        },
        {
            "title": "ReNew Power to raise $800m to refinance debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/renew-power-to-raise-800m-to-refinance-debt/articleshow/125900413.cms",
            "description": "ReNew Power is raising $800 million through a five-year loan, with Societe Generale, Standard Chartered, and SMBC acting as lead banks. This significant borrowing, likely to be priced next quarter, will be used to refinance operational projects, aiming for a rate of 350-400 basis points over SOFR.",
            "pubDate": "2025-12-11T01:42:42.965114"
        },
        {
            "title": "Hindustan Zinc shares rise 4%, up nearly 9% in 3 sessions. What’s behind the recent surge?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zinc-shares-rise-4-up-nearly-9-in-3-sessions-whats-behind-the-recent-surge/articleshow/125903033.cms",
            "description": "Hindustan Zinc shares surged 4% to Rs 532 as silver hit a fresh high, driven by a US Fed rate cut. The company, India's sole pure-play silver producer, benefits significantly from rising silver prices, which contribute substantially to its earnings and are expected to boost its valuation.",
            "pubDate": "2025-12-11T05:00:23.659713"
        },
        {
            "title": "Nifty struggling to hold its peak. 5 reasons why this is a worrying sign for investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-struggling-to-hold-its-peak-5-reasons-why-this-is-a-worrying-sign-for-investors/articleshow/125902622.cms",
            "description": "Nifty’s struggle near record highs signals weakening momentum as FII short positions rise, the rupee hovers near 90, and progress on the US-India trade deal remains slow. With midcaps and smallcaps under pressure and technical indicators turning cautious, investors face heightened uncertainty despite steady domestic flows and stabilising earnings.",
            "pubDate": "2025-12-11T05:00:23.659837"
        },
        {
            "title": "AU Small Finance among 6 F&O stocks that saw sharp rise in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-among-6-fo-stocks-that-saw-sharp-rise-in-futures-open-interest/slideshow/125902402.cms",
            "description": "As of December 10, there was a notable surge in futures open interest for six stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-12-11T05:00:23.659940"
        },
        {
            "title": "Kaynes Tech shares rebound 4% in relief rally after 40% crash in 1 month. What’s fuelling the rise today?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-tech-shares-rebound-4-in-relief-rally-after-40-crash-in-1-month-whats-fuelling-the-rise-today/articleshow/125902561.cms",
            "description": "Kaynes Technology India shares saw a rebound on Thursday after a sharp decline. Analysts at Nomura and Morgan Stanley maintain positive ratings, citing potential for growth and improved disclosures. The company faced scrutiny over accounting practices in its smart meters segment. Despite past challenges, future catalysts include working capital improvements and new business lines.",
            "pubDate": "2025-12-11T05:00:23.660043"
        },
        {
            "title": "Divided Fed moves cautiously, markets bet on more easing in 2026",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/divided-fed-moves-cautiously-markets-bet-on-more-easing-in-2026/articleshow/125902567.cms",
            "description": "The Federal Reserve delivered another rate cut but signalled a likely pause as policymakers await clearer labour and inflation data. Despite internal divisions, new projections show steady growth, easing inflation, and stable unemployment through 2026, though limited support for further easing. Market reaction remained positive, even as political scrutiny intensifies ahead of the US midterm elections.",
            "pubDate": "2025-12-11T05:00:23.660138"
        },
        {
            "title": "Fed signals economic stability as US heads towards 2026 midterms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-signals-economic-stability-as-us-heads-towards-2026-midterms/articleshow/125902439.cms",
            "description": "The Fed’s latest projections indicate faster growth, easing inflation and stable employment heading into 2026, offering the White House a supportive economic backdrop despite limited scope for deeper rate cuts. While tariff-driven disruptions and affordability pressures persist, policymakers project cautious stability as the election cycle approaches.",
            "pubDate": "2025-12-11T05:00:23.660232"
        },
        {
            "title": "Sensex jumps over 50 points, Nifty above 25,750 after US Fed rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-50-points-nifty-above-25750-after-us-fed-rate-cut/articleshow/125902210.cms",
            "description": "Indian equities opened higher on Thursday, with both the Sensex and Nifty reversing a three-day decline. This uptick followed the U.S. Federal Reserve's expected 25-basis-point rate cut, a move anticipated to curb foreign investor outflows from the Indian market.",
            "pubDate": "2025-12-11T05:00:23.660350"
        },
        {
            "title": "Buy, Sell or Hold: Morgan Stanley maintains overweight on LG Electronics; Citi recommends sell on Wipro",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-morgan-stanley-maintains-overweight-on-lg-electronics-citi-recommends-sell-on-wipro/articleshow/125902231.cms",
            "description": "Brokerages shared a mixed outlook on India’s IT and tech-linked companies, highlighting both opportunities and near-term hurdles. Morgan Stanley remained positive on LG Electronics India and Kaynes Technology due to export growth and margin expansion drivers. Citi maintained a cautious stance on Wipro despite traction in BFSI and healthcare. Overall sentiment emphasises execution, efficiency, and new growth catalysts such as AI and manufacturing integration.",
            "pubDate": "2025-12-11T05:00:23.660446"
        },
        {
            "title": "Park Medi World IPO Day 2: GMP slips to 9%; check subscription status, review and key highlights",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/park-medi-world-ipo-day-2-gmp-slips-to-9-check-subscription-status-review-and-key-highlights/articleshow/125902188.cms",
            "description": "Park Medi World IPO: The issue is commanding a grey market premium of ₹14, or roughly 9% above its ₹162 issue price, hinting at a possible listing around ₹183–184. The premium has eased from about 13% earlier, indicating a mild dip in grey market interest.",
            "pubDate": "2025-12-11T05:00:23.660543"
        },
        {
            "title": "Fed resumes balance-sheet expansion to ease repo market liquidity strains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fed-resumes-balance-sheet-expansion-to-ease-repo-market-liquidity-strains/articleshow/125902131.cms",
            "description": "The Federal Reserve is resuming Treasury bill purchases to ease liquidity strains in US money markets, responding to rising repo rates and tightened funding conditions. The move aims to stabilise short-term markets, maintain control over interest rates, and prevent year-end volatility.",
            "pubDate": "2025-12-11T05:00:23.660635"
        },
        {
            "title": "Adani Enterprises shares in focus as Rs 25,000-crore rights issue ends oversubscribed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-shares-in-focus-as-rs-25000-crore-rights-issue-ends-oversubscribed/articleshow/125902066.cms",
            "description": "Adani Enterprises shares: Adani Enterprises’ ₹25,000-crore rights issue closed with strong demand, ending 108% subscribed. The public portion saw even higher interest at 130%, while promoters fully subscribed to their entitlements—signalling broad investor confidence in the company’s fundraising effort.",
            "pubDate": "2025-12-11T05:00:23.660728"
        },
        {
            "title": "US Fed delivers 3rd rate cut in a row. What does it mean for Indian equities?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-fed-delivers-3rd-rate-cut-in-a-row-what-does-it-mean-for-indian-equities/articleshow/125901942.cms",
            "description": "The US Federal Reserve cut the federal funds rate by 25 basis points to 3.50–3.75% on December 11, marking its third consecutive reduction. While the Fed signalled only one more cut in 2026, market expectations diverge, with CME FedWatch data showing a 77% probability of two additional reductions. Uncertainty persists over the policy outlook and its global impact.",
            "pubDate": "2025-12-11T05:00:23.660816"
        },
        {
            "title": "Eternal shares tumble 21% from October peaks. Can investors buy this dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/eternal-shares-tumble-21-from-october-peaks-can-investors-buy-this-dip/articleshow/125901922.cms",
            "description": "Eternal, India’s largest quick-commerce player, has slipped 21% from its October peak, falling in 24 of 37 sessions after Q2 results triggered sustained selling. Analysts say fundamentals remain solid, but technical indicators show continued pressure with no confirmed reversal. Traders are watching key support zones to assess whether the correction opens an entry opportunity or if more downside remains.",
            "pubDate": "2025-12-11T05:00:23.660907"
        },
        {
            "title": "KSH International to launch Rs 710 crore IPO on December 16. Check price band, issue size, other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ksh-international-to-launch-rs-710-crore-ipo-on-december-16-check-price-band-issue-size-other-details/articleshow/125901818.cms",
            "description": "KSH International is set to open its Rs 710-crore IPO on December 18 at a price band of Rs 365–384 per share, combining a Rs 420-crore fresh issue with a Rs 290-crore offer-for-sale. Backed by SEBI’s August approval and a revised offer size, the magnet winding wire maker plans to use the proceeds for debt repayment, machinery expansion at its Supa and Chakan plants, and a rooftop solar project. The anchor book opens on December 15, allotment is due on December 19, and trading will begin on December 23.",
            "pubDate": "2025-12-11T05:00:23.660999"
        },
        {
            "title": "Vijay Kedia doubles money in 1 year, but this time investment isn't in a hidden smallcap stock",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-doubles-money-in-1-year-but-this-time-investment-isnt-in-a-hidden-smallcap-stock/articleshow/125901844.cms",
            "description": "Ace investor Vijay Kedia has doubled his money in a year—not through a smallcap multibagger, but via a silver ETF as the metal hit record highs. Despite the windfall, he’s keeping his precious metals allocation limited, citing long historical cycles of underperformance. Silver’s rally, driven by supply deficits and rising industrial demand, marks a rare shift in Kedia’s stock-focused strategy.",
            "pubDate": "2025-12-11T05:00:23.661090"
        },
        {
            "title": "Lloyds Metals & Energy among 5 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/lloyds-metals-energy-among-5-stocks-showing-bullish-rsi-upswing/slideshow/125901810.cms",
            "description": "On December 10, five Nifty500 stocks appeared in the RSI Trending Up scan on stockedge.com. An RSI moving above 50 suggests improving momentum and is often viewed as an early uptrend trigger, pointing to potential buying opportunities as price strength begins to build.",
            "pubDate": "2025-12-11T05:00:23.661181"
        },
        {
            "title": "Dixon Technologies shares bounce back 3% after three consecutive sessions of decline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dixon-technologies-shares-bounce-back-3-after-three-consecutive-sessions-of-decline/articleshow/125903351.cms",
            "description": "Dixon Technologies’ shares rebounded after a three-day fall, even as the stock remains in a broader downtrend with steep declines over the past months. Despite strong quarterly earnings and increased institutional holdings, technical indicators show the stock is oversold. This mix of weak price action and improving fundamentals suggests the potential for a short-term recovery.",
            "pubDate": "2025-12-11T05:29:25.214893"
        },
        {
            "title": "Wall Street's 2026 Outlook: What lies ahead for the US market; Bullish Momentum or Cautious Climb?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-streets-2026-outlook-what-lies-ahead-for-the-us-market-bullish-momentum-or-cautious-climb/articleshow/125904937.cms",
            "description": "Analysts project further gains for U.S. equities in 2026, supported by earnings growth, AI-driven capital expenditure, and a constructive policy backdrop. Forecasts signal potential double-digit returns, but elevated valuations and macro uncertainties mean investors may need a selective, diversified approach to navigate possible volatility.",
            "pubDate": "2025-12-11T06:53:42.209111"
        },
        {
            "title": "Jhunjhunwala's firm, Madhu Kela among I-Pru AMC's pre IPO investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jhunjhunwalas-firm-madhu-kela-among-i-pru-amcs-pre-ipo-investors/articleshow/125904498.cms",
            "description": "ICICI Prudential Asset Management secured Rs4,900 crore from 26 investors in a pre-IPO share sale. This included prominent names like Lunate and Premji Invest. ICICI Bank contributed Rs2,225 crore. The company's Rs10,600 crore IPO opens December 12. This is an offer for sale, with Prudential Corporation Holdings offloading shares. The price band is Rs2,061-2,165.",
            "pubDate": "2025-12-11T06:53:42.209207"
        },
        {
            "title": "Kotak Securities projects 32K Bull case for Nifty by Dec 2026. 9 key factors driving this optimism explained",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-securities-projects-32k-bull-case-for-nifty-by-dec-2026-9-key-factors-driving-this-optimism-explained/slideshow/125904128.cms",
            "description": "The Indian equity market demonstrated strong resilience, recovering from a sharp 17% drawdown in September 2024 to reach a new all-time high by the end of CY25. Despite global uncertainties and underperformance relative to developed and emerging markets during CY25 YTD, the Nifty 50 index bounced back sharply.Kotak Securities projects a base case Nifty target of 29,120 by December 2026, valuing it at 20x FY28E EPS of Rs 1,456. In a bull case, applying a 22x PE, Nifty could touch 32,032. The rally is expected to be driven by strong earnings growth and stable macroeconomic factors. Here are top 9 actors according to Kotak Securities:",
            "pubDate": "2025-12-11T06:53:42.209289"
        },
        {
            "title": "Meesho shares rally 4% on day 2 after blockbuster debut. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-shares-rally-59-from-ipo-issue-price-on-trading-day-2-should-you-buy-sell-or-hold/articleshow/125903919.cms",
            "description": "Meesho’s blockbuster market debut continued into day two, with shares extending their strong post-listing rally. Investor excitement remains high amid bullish brokerage views and heavy IPO subscription, but analysts caution that competitive pressures and profitability challenges could bring volatility. Experts outline what investors should consider now whether to buy, take profits or hold for potential long-term gains.",
            "pubDate": "2025-12-11T06:53:42.209371"
        },
        {
            "title": "Japan's Nikkei ends lower as SoftBank Group tracks Oracle's declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-ends-lower-as-softbank-group-tracks-oracles-declines/articleshow/125905696.cms",
            "description": "Japan's Nikkei share average closed 0.9% lower, led by a sharp 7.69% decline in SoftBank Group. This fall mirrored Oracle's significant drop after missing U.S. earnings forecasts, raising concerns about their joint AI data center project. Other tech and bank shares also declined, though Advantest and Mitsui & Co bucked the trend.",
            "pubDate": "2025-12-11T07:36:40.731125"
        },
        {
            "title": "Silver prices in touching distance from Rs 2 lakh mark. Can it happen next week?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/silver-prices-in-touching-distance-from-rs-2-lakh-mark-can-it-happen-next-week/articleshow/125908288.cms",
            "description": "Silver surged over 2% to ₹1.93 lakh/kg on MCX after the US Fed’s third straight rate cut boosted its already powerful rally driven by strong industrial demand and tight supply. Globally, prices hit a record $63/oz, pushing silver’s gains to 113% this year, supported by robust physical buying and heavy ETF inflows. With futures at all-time highs, investors are now asking whether silver can hit ₹2 lakh/kg before 2026.",
            "pubDate": "2025-12-11T09:50:16.949846"
        },
        {
            "title": "European shares edged lower as tech declines outweigh Fed relief",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-edged-lower-as-tech-declines-outweigh-fed-relief/articleshow/125907619.cms",
            "description": "European shares were muted on Thursday, as declines in technology stocks following a weak forecast from U.S. cloud firm Oracle outweighed relief over the Federal Reserve's comments that were less hawkish than expected.",
            "pubDate": "2025-12-11T09:50:16.949998"
        },
        {
            "title": "Retail investors raise stakes in 13 high profit margin stocks; surge up to 85% in FY26 so far",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-raise-stakes-in-13-high-profit-margin-stocks-surge-up-to-85-in-fy26-so-far/slideshow/125907125.cms",
            "description": "Focusing on companies with consistently strong profit margins signals stable operations, pricing power, and effective cost control—qualities that reduce risk and support predictable, long-term returns. In the September quarter, retail investors increased holdings in 133 stocks (market cap above Rs 2,500 crore, net sales over Rs 100 crore, net profit margin above 10% for four consecutive quarters), excluding banks and financials.So far in FY26, 63 of these stocks posted positive returns, with 13 gaining 35–85% in the first eight months. (Source: ACE Equity)",
            "pubDate": "2025-12-11T09:50:16.950102"
        },
        {
            "title": "Kaynes Tech share selloff: Kotak vs JPMorgan, Morgan Stanley, Nomura. Here’s what brokerages are saying",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kaynes-tech-share-selloff-kotak-vs-jpmorgan-morgan-stanley-nomura-heres-what-brokerages-are-saying/articleshow/125907003.cms",
            "description": "Kaynes Technology’s steep decline has sparked intense scrutiny after accounting inconsistencies flagged by Kotak raised concerns over disclosures and smart-metre dependence. While this triggered the sell-off, most brokerages argue fundamentals remain intact, valuing the stock attractively despite working-capital stress and revised guidance. Analyst views remain divided but broadly constructive with improvement triggers ahead.",
            "pubDate": "2025-12-11T09:50:16.950209"
        },
        {
            "title": "For sustainable wealth creation, one moat is a must: 6 large-caps from different sectors with an upside potential of up to 46%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/for-sustainable-wealth-creation-one-moat-is-a-must-6-large-caps-from-different-sectors-with-an-upside-potential-of-up-to-46/articleshow/125906437.cms",
            "description": "For the last couple of days, all eyes were on the US Fed and whether it would cut rates (it did, by 25 basis points), and more importantly what it would say in terms of outlook (it’s murky when it comes to further cuts). The uncertainty had caused FPIs to adopt a wait-and-watch approach, put the rupee under pressure, and reduced risk-appetite across emerging markets. Expect market volatility for some time before things settle down. And in such times, if you are seeking to increase exposure to the equities, large-caps are the better bet.",
            "pubDate": "2025-12-11T09:50:16.950308"
        },
        {
            "title": "Nifty could surge to 29,000 by 2026 as consumption revives, rates ease, Emkay Global says bet on discretionary stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-could-surge-to-29000-by-2026-as-consumption-revives-rates-ease-emkay-global-says-bet-on-discretionary-stocks/articleshow/125908525.cms",
            "description": "Emkay Global expects the Nifty to hit 29,000 by CY2026, supported by stronger consumption, softer interest rates, stable policy and rising affordability. The brokerage is bullish on Consumer Discretionary, Industrials, Healthcare and Materials, while remaining cautious on Financials, Staples, IT and Telecom. With liquidity support from the RBI, rural revival and steady domestic flows, Emkay sees a multi-year growth cycle ahead, with SMIDs positioned to outperform despite elevated valuations.",
            "pubDate": "2025-12-11T09:57:40.917422"
        },
        {
            "title": "Market Wrap: Sensex rises 427 pts, Nifty above 25,850 as D-St breaks 3-day slide after Fed cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-rises-427-pts-nifty-above-25850-as-d-st-breaks-3-day-slide-after-fed-cut/articleshow/125909017.cms",
            "description": "Indian equities rebounded on Thursday, with the Sensex and Nifty climbing after the U.S. Federal Reserve's 25-basis-point rate cut. This recovery occurred despite the rupee hitting a new record low due to concerns over the lack of a U.S. trade agreement.",
            "pubDate": "2025-12-11T10:57:15.371413"
        },
        {
            "title": "Vodafone Idea and 4 other stocks hit 52-week highs; gains up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-and-4-other-stocks-hit-52-week-highs-gains-up-to-20-in-a-month/slideshow/125911945.cms",
            "description": "Benchmark Sensex fell by 427 points, closing at 84,818 on Thursday. Amid this movement, five BSE 500 stocks reached new 52-week highs, hitting their highest levels in the past year. These breakouts usually indicate bullish momentum and suggest the possibility of additional short-term gains.",
            "pubDate": "2025-12-11T13:37:52.281059"
        },
        {
            "title": "Motilal Oswal names 30 potential multibagger stocks in India's journey to $16 trillion economy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-names-30-potential-multibagger-stocks-in-indias-journey-to-16-trillion-economy/articleshow/125911429.cms",
            "description": "Motilal Oswal forecasts India’s GDP rising from $4 trillion to over $16 trillion by 2042, driving a major wealth-creation cycle. It has created a 30-stock equal-weighted portfolio positioned to benefit from rising incomes, higher savings, strong credit growth, infrastructure expansion and long-term structural demand across autos, financials, capital goods, healthcare, real estate, telecom and capital markets.",
            "pubDate": "2025-12-11T13:37:52.281193"
        },
        {
            "title": "Airtel leads as India's stock market creates Rs 148 lakh crore wealth in 5 years: Motilal Oswal study",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/airtel-leads-as-indias-stock-market-creates-rs-148-lakh-crore-wealth-in-5-years-motilal-oswal-study/articleshow/125911190.cms",
            "description": "India’s stock market created a record Rs 148 lakh crore in wealth between 2020 and 2025, with the top 100 wealth creators delivering 38% CAGR—its strongest cycle ever, according to Motilal Oswal. Bharti Airtel, ICICI Bank, BSE, and HAL topped categories across the biggest, fastest, and most consistent performers during this structural rally.",
            "pubDate": "2025-12-11T13:37:52.281298"
        },
        {
            "title": "BofA upgrades Swiggy to buy rating, lists 3 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bofa-upgrades-swiggy-to-buy-rating-lists-3-reasons-why/articleshow/125910970.cms",
            "description": "Bank of America Securities upgraded Swiggy to buy, citing its stronger balance sheet after a major fundraise, rising cash generation in food delivery, and potential valuation rerating as quick-commerce consolidation accelerates and losses narrow amid improving margins.",
            "pubDate": "2025-12-11T13:37:52.281393"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Friday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-friday/articleshow/125916424.cms",
            "description": "Indian markets reversed a three-day losing streak as Sensex and Nifty rose on Fed’s 25-bps rate cut, boosted by easing US yields, strong auto and IT buying, and broad-based domestic gains despite a weaker rupee and global volatility.",
            "pubDate": "2025-12-11T15:53:58.512905"
        },
        {
            "title": "S&P 500, Nasdaq trade lower on Oracle AI spending jitters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-nasdaq-open-lower-on-oracle-ai-spending-jitters/articleshow/125915525.cms",
            "description": "The S&P 500 and the Nasdaq opened lower on Thursday as fresh worries over Oracle's hefty AI spending plans overshadow optimism over a less hawkish tone from the Federal Reserve.",
            "pubDate": "2025-12-11T15:53:58.513034"
        },
        {
            "title": "Weekly Top Picks: These stocks scored 10 on 10 on Stock Reports Plus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weekly-top-picks-these-stocks-scored-10-on-10-on-stock-reports-plus/articleshow/125914309.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, undertakes detailed company analysis for 4,000+ listed stocks. In addition to detailed company analyses, the report also collates analysts’ forecasts and trend analysis for each component. An average score in Stock Reports Plus is calculated by undertaking quantitative analysis of five key investment tools – earnings, fundamentals, relative valuation, risk, and price momentum.",
            "pubDate": "2025-12-11T15:53:58.513233"
        },
        {
            "title": "Sebi defers timeline to implement third phase of nomination framework for securities mkt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-defers-timeline-to-implement-third-phase-of-nomination-framework-for-securities-mkt/articleshow/125914241.cms",
            "description": "Markets regulator Sebi on Thursday deferred the implementation of the third phase of its nomination framework for the securities market, which was earlier scheduled to take effect on December 15.",
            "pubDate": "2025-12-11T15:53:58.513335"
        },
        {
            "title": "These large- and mid-cap stocks can give more than 25% return in 1 year, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-large-and-mid-cap-stocks-can-give-more-than-25-return-in-1-year-according-to-analysts/articleshow/125913856.cms",
            "description": "While volatility in the market is given, it is important to look at the bias of the volatility. Another important thing to understand is that just three to four stocks can make the Nifty and Sensex move up and down sharply. So, they should not be given more than their due importance. And, when looking at the two indices, make sure that you look at what is making them move up and down.",
            "pubDate": "2025-12-11T15:53:58.513473"
        }
    ]
}