{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-29T15:49:09.421598",
    "items": [
        {
            "title": "BluSmart’s deepening crisis: Why is the EV ride-hailing company in trouble?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blusmarts-deepening-crisis-why-is-the-ev-ride-hailing-company-in-trouble/videoshow/119709088.cms",
            "description": "\"GEL acknowledges the recent credit rating downgrades by CARE and ICRA. The downgrade was due to a short-term liquidity mismatch, which is improving through customer payments. We understand the concerns this has raised and remain committed to addressing them responsibly for all our stakeholders.”",
            "pubDate": "2025-03-29T15:48:51.827855"
        },
        {
            "title": "Vedanta extends demerger deadline till September 30, cites pending govt, NCLT approvals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vedanta-extends-demerger-deadline-till-september-30-cites-pending-govt-nclt-approvals/articleshow/119708119.cms",
            "description": "Vedanta has postponed its business demerger to September 30, 2025, due to pending approvals. The move will separate aluminium, oil & gas, power, and steel into independent entities. Shareholders will receive proportional shares, with no change in the overall structure.",
            "pubDate": "2025-03-29T15:48:51.827977"
        },
        {
            "title": "Concurrent Gainers: 8 stocks that rose for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-8-stocks-that-gain-for-5-days-in-a-row/slideshow/119704121.cms",
            "description": "In the last five trading sessions leading up to March 28, the Sensex rose by approximately 0.66%, or 509 points, finishing at 77,415. The market closed higher in 3 of those 5 sessions. ETMarkets highlighted eight stocks with a market capitalization exceeding Rs 1000 crore that consistently saw price gains during this time. (Data Source: ACE Equity)",
            "pubDate": "2025-03-29T15:48:51.828087"
        },
        {
            "title": "FIIs dump Rs 1.27 lakh crore in FY25 as DIIs buy Rs 6 lakh crore in domestic equities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-sold-rs-1-27-lakh-crore-in-indian-stocks-in-fy25-diis-bought-rs-6-lakh-crore-worth-equities/articleshow/119703540.cms",
            "description": "Foreign Institutional Investors (FIIs) were net sellers in FY25, offloading ₹1.27 lakh crore, while Domestic Institutional Investors (DIIs) remained consistent buyers, investing ₹6.06 lakh crore. March saw reduced FII selling, with DIIs continuing their strong buying streak throughout the year.",
            "pubDate": "2025-03-29T15:48:51.828188"
        },
        {
            "title": "Will the Indian stock market stay shut for Eid on March 31? Check details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-the-indian-stock-market-stay-shut-for-eid-on-march-31-check-details-here/articleshow/119702500.cms",
            "description": "Indian stock markets will remain closed on March 31 for Eid-ul-Fitr. Trading across BSE and NSE, including equities and derivatives, will resume on April 1 after the extended weekend break. Investors should plan trades accordingly to avoid disruptions.",
            "pubDate": "2025-03-29T15:48:51.828298"
        },
        {
            "title": "Will cement sector be a surprise winner and prove analysts wrong? 7 cement stocks with scale, size and track record",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-cement-sector-be-a-surprise-winner-and-prove-analysts-wrong-7-cement-stocks-with-scale-size-and-track-record/articleshow/119698805.cms",
            "description": "From railways to defence to power. The last four years have seen many surprise winners in terms of sectors. What are the typical characteristics of a sector that turns out to be a surprise winner? It would have faced headwinds for many years, even decades, with too many laws governing it; be fragmented, with too many small- and mid-sized companies, one or two large players, and hyper-competition. It is cyclical or seasonal in nature. Another feature: Some companies from the sector would have spelt trouble for the banking system at some point. If you look at the history of the cement sector, it has experienced all of the above. Then comes a phase of consolidation, with things turning around, albeit slowly. But analysts and the street remain wary and skeptical.",
            "pubDate": "2025-03-29T15:48:51.828398"
        },
        {
            "title": "27% of exports at risk as US plans to slap 25% tariff, 4 cos most exposed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/27-of-exports-at-risk-as-us-plans-to-slap-25-tariff-4-cos-most-exposed/slideshow/119698753.cms",
            "description": "The US has announced a 25% tariff on fully assembled vehicles starting April 3, which will extend to auto parts from May 3. These tariffs aim to boost local manufacturing but may result in higher vehicle prices and weakened demand in the US market.The US is India’s second-largest export destination for auto parts, with exports worth $6.79 billion in FY24—about one-third of India’s total auto parts exports. As nearly 27% of Indian auto component exports are US-bound, this move could significantly impact Indian firms. The following data, collated by ET Bureau, shows major companies’ revenue share coming from the US:",
            "pubDate": "2025-03-29T15:48:51.828494"
        },
        {
            "title": "7 reasons why Warren Buffett’s $325 billion cash pile is a warning for Wall Street",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-reasons-why-warren-buffetts-325-billion-cash-pile-is-a-warning-for-wall-street/articleshow/119698642.cms",
            "description": "Warren Buffett’s Berkshire Hathaway has amassed a record $325 billion in cash, citing high stock market valuations. The Buffett Indicator signals overvaluation, and with Treasury yields offering attractive returns, Berkshire remains cautious, awaiting better investment opportunities amid potential market corrections.",
            "pubDate": "2025-03-29T15:48:51.828585"
        },
        {
            "title": "Tata Power & JSW Energy: Why these stocks offer strong upside potential of upto 28% each",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-power-jsw-energy-why-these-stocks-offer-strong-upside-potential-of-upto-28-each/articleshow/119697203.cms",
            "description": "The utilities sector is evolving with a focus on renewable energy, infrastructure upgrades, and decarbonization. While policy support drives growth, challenges like regulatory uncertainties, financing constraints, and coal dependency remain. Companies must balance profitability with sustainability in a shifting landscape.",
            "pubDate": "2025-03-29T15:48:51.828799"
        },
        {
            "title": "Chris Wood’s latest GREED & fear moves: What he’s buying and ditching now",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chris-woods-latest-greed-fear-moves-what-hes-buying-and-ditching-now/slideshow/119696702.cms",
            "description": "Christopher Wood, Global Head of Equity Strategy at Jefferies, has released his latest GREED & fear note. Wood's note reflects a clear shift in focus towards Indian heavyweights, real estate, and digital consumption platforms.There have been certain changes that have been made in GREED & fear’s long-only portfolios. The GREED & fear note is a widely respected investment strategy newsletter written by Christopher Wood, which offers his insights on global markets, economic trends, sector outlooks, and strategic adjustments in his model portfolios.",
            "pubDate": "2025-03-29T15:48:51.828895"
        },
        {
            "title": "India could benefit from reciprocal tariffs even as world fears Trump threats. 3 reasons why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-could-benefit-from-reciprocal-tariffs-even-as-world-fears-trump-tariff-threats-3-reasons-why/articleshow/119695484.cms",
            "description": "India faces minimal macro impact from Trump's proposed tariffs and may even benefit. A resilient domestic economy, reduced reliance on exports, and China's trade losses could create new opportunities for India, bolstering its long-term economic and market prospects.",
            "pubDate": "2025-03-29T15:48:51.828990"
        },
        {
            "title": "March silences naysayers as 186 smallcaps gain up to 74%. Will this last?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/march-silences-naysayers-as-186-smallcaps-gain-up-to-74-will-this-last/articleshow/119695046.cms",
            "description": "March silences naysayers as 186 smallcaps gain up to 74%. Will this last?",
            "pubDate": "2025-03-29T15:48:51.829083"
        },
        {
            "title": "Navigating market swings and sectoral rotation: Key insights for investors for FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/navigating-market-swings-and-sectoral-rotation-key-insights-for-investors-for-fy26/articleshow/119693600.cms",
            "description": "The Indian equity market rebounded after a 16% correction, highlighting sectoral rotation trends. Defensive sectors offer stability, while cyclical sectors like IT, Realty, and Metals follow performance patterns. Understanding sectoral trends helps investors navigate volatility and optimize portfolio positioning.",
            "pubDate": "2025-03-29T15:48:51.829173"
        },
        {
            "title": "Senco Gold to Rajesh Exports: 9 stocks that could skyrocket over 100%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/senco-gold-to-rajesh-exports-9-stocks-that-could-skyrocket-over-100/slideshow/119693154.cms",
            "description": "Several stocks in the Nifty Microcap250 index are expected to deliver strong returns over the next 12 months, according to analyst estimates compiled by Trendlyne. Senco Gold, Rajesh Exports, KPI Green Energy, and Spandana Sphoorty are among the top picks, with potential upsides exceeding 100%. Here’s a look at the stocks analysts believe have the highest growth potential:",
            "pubDate": "2025-03-29T15:48:51.829268"
        },
        {
            "title": "European shares hits a weekly decline as tariff worries persist",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-hits-a-weekly-decline-as-tariff-worries-persist/articleshow/119690432.cms",
            "description": "European stocks fell as U.S. inflation data raised concerns, exacerbated by new tariffs from President Trump. The pan-European STOXX 600 index dropped 0.7% on Friday and 1.4% for the week, its worst since mid-December. German unemployment increased, while below-forecast inflation in Spain and France spurred ECB rate cut bets. Deutsche Bank and Ubisoft also faced notable declines.",
            "pubDate": "2025-03-29T15:48:51.829361"
        }
    ]
}