{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-15T05:50:50.585642",
    "items": [
        {
            "title": "Medanta Q2 Results: Co reports 4.5% jump in net profit to Rs 130.8 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/medanta-q2-results-co-reports-4-5-jump-in-net-profit-to-rs-130-8-crore/articleshow/115308024.cms",
            "description": "Global Health (Medanta) witnessed a 4.5% rise in net profit, reaching Rs. 130.8 crore in Q2FY25, driven by revenue growth from existing and new hospitals, coupled with increased patient numbers. Their revenue climbed 12.7% YoY, hitting Rs 975 crore, with EBITDA at Rs 247 crore, marking a 5.5% YoY increase.",
            "pubDate": "2024-11-15T05:50:30.183265"
        },
        {
            "title": "Sobha Limited Q2 Results: PAT rises 3.3 times QoQ to Rs 26 crore on strong sales growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/sobha-limited-q2-results-pat-rises-3-3-times-qoq-to-rs-26-crore-on-strong-sales-growth/articleshow/115306204.cms",
            "description": "Sobha Ltd reported a 3.3x QoQ and 74% YoY increase in Q2FY25 PAT to Rs 26.1 crore. Revenue grew 44% QoQ and 25% YoY to Rs 965 crore. Real estate collections reached Rs 1,222 crore, and sales value was Rs 1,178 crore with an average price realization of Rs 12,674 per sq ft. Kerala was a key performer with its best-ever quarterly sales.",
            "pubDate": "2024-11-15T05:50:30.183379"
        },
        {
            "title": "Hero MotoCorp Q2 Results: Co beats Street estimates to report 14% rise in profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hero-motocorp-q2-results-co-beats-street-estimates-to-report-14-rise-in-profit/articleshow/115305050.cms",
            "description": "The country’s largest two-wheeler maker Hero MotoCorp Thursday beat street estimates to report 14% increase in net profit at Rs 1,203.54 crore for the second quarter ended Sep 30, 2024.",
            "pubDate": "2024-11-15T05:50:30.183481"
        },
        {
            "title": "Glenmark Pharma Q2 Results: Co posts Rs 355 crore net profit on robust sales growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/glenmark-pharma-q2-results-co-posts-rs-355-crore-net-profit-on-robust-sales-growth/articleshow/115304935.cms",
            "description": "Glenmark Pharma reported Rs 340 crore net profit in Q2FY25 led by robust sales growth in India and Europe. The drugmaker reported a net loss of Rs 180 crore in the corresponding quarter of the previous year.",
            "pubDate": "2024-11-15T05:50:30.183579"
        },
        {
            "title": "Grasim Industries Q2 Results: PAT falls 66% YoY to Rs 390 crore, revenue rises 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/grasim-q2-results-pat-falls-66-yoy-to-rs-390-crore-revenue-rises-11/articleshow/115304754.cms",
            "description": "Grasim Industries Q2 Results FY25: Grasim Industries, the flagship company of Aditya Birla Group, on Thursday reported a 66% fall in its consolidated net profit at Rs 390 crore in the second quarter, compared with Rs 1164 crore in the last year quarter.",
            "pubDate": "2024-11-15T05:50:30.183675"
        },
        {
            "title": "Ipca Labs Q2 Results: Profit shoots up 58% to Rs 229 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/ipca-labs-q2-results-profit-shoots-up-58-to-rs-229-crore/articleshow/115303481.cms",
            "description": "Ipca Laboratories on Thursday said its consolidated net profit declined 58 per cent year-on-year to Rs 229 crore in the September quarter. The drug firm had reported a net profit of Rs 145 crore in the year-ago period.",
            "pubDate": "2024-11-15T05:50:30.183779"
        },
        {
            "title": "Global Health Q2 Results: Medanta operator posts 5% rise in net profit YoY at Rs 131 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/global-health-q2-results-medanta-operator-posts-5-rise-in-net-profit-yoy-at-rs-131-crore/articleshow/115303308.cms",
            "description": "Global Health, which operates hospitals under the Medanta brand, on Thursday said its profit after tax increased 5 per cent to Rs 131 crore in the September 2024 quarter. The healthcare provider reported a Profit After Tax (PAT) of Rs 125 crore in the July-September quarter a year ago.",
            "pubDate": "2024-11-15T05:50:30.183879"
        },
        {
            "title": "Allcargo Logistics Q2 Results: Net profit zooms 161% to Rs 37 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/allcargo-logistics-q2-results-net-profit-zooms-161-to-rs-37-crore/articleshow/115302811.cms",
            "description": "Allcargo Logistics has clocked a net sales of Rs 689.80 crore in Q2 of FY25 up 79.43% from Rs 384.43 crore in Q2 of FY24. The quarterly net profit of the company stood at Rs 36.99 crore in Q2 of FY25 up 161.04% from Rs. 14.17 crore in Q2 of FY24.",
            "pubDate": "2024-11-15T05:50:30.183982"
        },
        {
            "title": "Hero MotoCorp Q2 Results: Standalone profit rises 14% YoY to Rs 1,204 crore, revenue up 11%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hero-motocorp-q2-results-standaone-profit-rises-14-yoy-to-rs-1204-crore-revenue-rises-11/articleshow/115302746.cms",
            "description": "India's leading two-wheeler maker Hero MotoCorp on Thursday reported 14% growth in its standalone net profit at Rs 1,204 crore in the second quarter. It was Rs 1054 crore in the year-ago quarter.",
            "pubDate": "2024-11-15T05:50:30.184077"
        },
        {
            "title": "Muthoot Finance Q2 Results: Net profit rises 21% to Rs 1,321 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/muthoot-finance-q2-results-net-profit-rises-21-to-rs-1321-crore/articleshow/115301720.cms",
            "description": "Muthoot Finance reported a 21% YoY rise in consolidated net profit to Rs 1321 crore in Q2FY25. Standalone net profit grew 26% to Rs 1251 crore. Assets under management increased 31% YoY to Rs 90,197 crore.",
            "pubDate": "2024-11-15T05:50:30.184171"
        },
        {
            "title": "Brainbees Solutions Q2 Results: FirstCry operator narrows loss to Rs 50 crore YoY, revenue jumps 26%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/brainbees-solutions-q2-results-firstcry-operator-narrows-loss-to-rs-50-crore-yoy-revenue-jumps-26/articleshow/115301648.cms",
            "description": "The reduction in the company’s losses was driven by higher revenues on both a yearly and quarterly basis. Firstcry’s operator reported a topline of Rs 1,905 crore in Q2FY25, up from Rs 1,507 crore in the same quarter last year and Rs 1,652 crore in Q1FY25, reflecting a 26% YoY and 15% QoQ increase.",
            "pubDate": "2024-11-15T05:50:30.184269"
        },
        {
            "title": "Disney Q4 Results: Adjusted profit tops estimates on strong results from entertainment unit, streaming",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/disney-q4-results-adjusted-profit-tops-estimates-on-strong-results-from-entertainment-unit-streaming/articleshow/115300828.cms",
            "description": "Disney's fourth-quarter adjusted profit beat Wall Street's expectations, bolstered by strong results from company's entertainment business and its streaming service.",
            "pubDate": "2024-11-15T05:50:30.184357"
        },
        {
            "title": "Bharat Forge Q2 Results: Net profit rises 13% YoY at Rs 243 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/bharat-forge-q2-results-net-profit-rises-13-yoy-at-rs-243-crore/articleshow/115300654.cms",
            "description": "Auto component firm Bharat Forge on Thursday said its consolidated net profit increased 13 per cent year-on-year to Rs 243 crore for the second quarter ended September 30, 2024.",
            "pubDate": "2024-11-15T05:50:30.184450"
        },
        {
            "title": "Delhivery Q2 Results: Co posts Rs 10 cr profit vs YoY loss, revenue up 13%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/delhivery-q2-results-co-posts-rs-10-cr-profit-vs-yoy-loss-revenue-up-13/articleshow/115299961.cms",
            "description": "Delhivery reported a net profit of Rs 10 crore in Q2FY25, compared to a loss of Rs 103 crore in Q2FY24. Revenue grew 13% YoY to Rs 2,190 crore. EBITDA increased to Rs 57 crore. Express Parcel revenue grew 7% YoY, and Part Truckload revenue grew 27% YoY.",
            "pubDate": "2024-11-15T05:50:30.184541"
        },
        {
            "title": "Siemens stock surges 8% after Q4 profit beat, flags rising global risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/update-3-siemens-stock-surges-8-after-q4-profit-beat-flags-rising-global-risks/articleshow/115299233.cms",
            "description": "Siemens stock surged on Thursday after the engineering company posted better than expected results and said it was in a good position to navigate mounting global political and trade tensions.",
            "pubDate": "2024-11-15T05:50:30.184633"
        },
        {
            "title": "Honasa Consumer Q2 Results: Mamaearth operator slips into red with Rs 19 crore YoY loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/honasa-consumer-q2-results-mamaearth-operator-slips-into-red-with-rs-19-crore-yoy-loss/articleshow/115297895.cms",
            "description": "Honasa Consumer Q2 Results: The company's revenue and net loss both declined on a quarter-on-quarter basis. In the prior quarter, Honasa Consumer reported a net profit of Rs 40.25 crore and a topline of Rs 554 crore, reflecting a 17% drop. In its exchange filing, the company noted that revenue, adjusted for inventory correction, reached Rs 525 crore, showing a 5.7% YoY growth.",
            "pubDate": "2024-11-15T05:50:30.184725"
        }
    ]
}