{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-28T15:38:53.834535",
    "items": [
        {
            "title": "L&T Q2 Preview: PAT may rise 16% YoY on healthy order book, execution",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/lt-q2-preview-pat-may-rise-16-yoy-on-healthy-order-book-execution/articleshow/124863288.cms",
            "description": "Larsen & Toubro (L&T) is expected to post strong Q2FY26 results, with consolidated revenue and profit likely to rise around 15–16% year-on-year, driven by robust project execution and a healthy order book. Brokerages expect solid performance from the core engineering and construction segment, aided by domestic infrastructure spending and overseas hydrocarbon projects.",
            "pubDate": "2025-10-28T04:26:33.517603"
        },
        {
            "title": "TVS Motor Q2 Results: Cons PAT zooms 42% YoY to Rs 833 crore, revenue jumps 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tvs-motor-q2-results-cons-pat-zooms-42-yoy-to-rs-833-crore-revenue-jumps-25/articleshow/124870031.cms",
            "description": "TVS Motor Q2 Results: ​​TVS Motor Company posted its highest-ever operating EBITDA of Rs 1,509 crore for the quarter ended September 2025, up 40% from Rs 1,080 crore in the same period last year. The operating EBITDA margin expanded by 100 basis points to 12.7%, compared with 11.7% in the year-ago quarter.",
            "pubDate": "2025-10-28T09:47:31.049491"
        },
        {
            "title": "Adani Green Q2 Results: Profit more than doubles to Rs 583 crore, total income drops 4%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-green-q2-results-profit-more-than-doubles-to-rs-583-crore-yoy-total-income-drops-4/articleshow/124872790.cms",
            "description": "Adani Green Q2 Results: Adani Green more than doubled its profit year-on-year in the second quarter to Rs 583 crore. The bottomline rose 111% from Rs 276 crore posted in the last year quarter. Total income during the quarter, however, fell 4% YoY to Rs 3,249 crore.",
            "pubDate": "2025-10-28T12:00:08.859850"
        },
        {
            "title": "Tata Capital Q2 Results: Cons net profit rises 2% YoY to Rs 1,097 crore; NII jumps 23%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-capital-q1-results-cons-net-profit-rises-2-yoy-to-rs-1097-crore-nii-jumps-23/articleshow/124871847.cms",
            "description": "Tata Capital has announced its second-quarter financial results. The company saw a modest two percent rise in net profit, reaching one thousand ninety-seven crore rupees. Net interest income experienced a significant twenty-three percent increase. Assets under management also grew substantially, indicating strong business performance across various segments.",
            "pubDate": "2025-10-28T12:00:08.860004"
        },
        {
            "title": "NIIT Q2 Results: Profit falls 88% to Rs 1.37 crore; revenue rises 15.6%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/niit-q2-results-profit-falls-88-to-rs-1-37-crore-revenue-rises-15-6/articleshow/124870891.cms",
            "description": "Skills and talent development firm NIIT Ltd on Tuesday posted 88.4 per cent decline in consolidated net profit at Rs 1.37 crore for September quarter FY26, although revenues rose by 15.6 per cent.",
            "pubDate": "2025-10-28T12:00:08.860120"
        },
        {
            "title": "Jindal Steel Q2 Results: Net profit drops 26% to Rs 635 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jindal-steel-q2-results-net-profit-drops-26-to-rs-635-crore/articleshow/124876961.cms",
            "description": "The company had clocked a net profit of Rs 860.47 crore in the July-September period of the preceding 2024-25 financial year, the Naveen Jindal Group entity said in an exchange filing.However, the company's total income rose to Rs 11,707.82 crore from Rs 11,248.14 crore in the second quarter a year ago",
            "pubDate": "2025-10-28T15:38:51.480845"
        },
        {
            "title": "Mahindra & Mahindra Financial Services Q2 Results: Net profit jumps 45% to Rs 566 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/mahindra-mahindra-financial-services-q2-results-net-profit-jumps-45-to-rs-566-crore/articleshow/124876013.cms",
            "description": "Non-bank lender Mahindra and Mahindra Financial Services on Tuesday reported a 45 per cent increase in its September quarter consolidated net profit at Rs 566 crore.",
            "pubDate": "2025-10-28T15:38:51.480979"
        },
        {
            "title": "Adani Total Gas Q2 Results: Net profit falls 9% to Rs 162 crore on higher gas cost",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-total-gas-q2-results-net-profit-falls-9-to-rs-162-crore-on-higher-gas-cost/articleshow/124875989.cms",
            "description": "Adani Total Gas Ltd, the city gas joint venture between Adani Group and TotalEnergies of France, on Tuesday reported a 9 per cent fall in its September quarter net profit on a rise in input gas prices.",
            "pubDate": "2025-10-28T15:38:51.481088"
        }
    ]
}