{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-27T00:59:00.753894",
    "items": [
        {
            "title": "How will new US tariffs affect Indian markets and investor confidence?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-will-new-us-tariffs-affect-indian-markets-and-investor-confidence/articleshow/123535263.cms",
            "description": "Indian markets experienced a significant downturn on Tuesday, with both the Nifty and Sensex falling by over 1% due to the US imposing a 25% tariff. Except for FMCG, all sectoral indices declined, with realty, PSU bank, and consumer durables taking the biggest hit.",
            "pubDate": "2025-08-27T00:58:53.460980"
        },
        {
            "title": "Wealth creation has another name: Ignore noise & Trump. Just hold on to good businesses; 22 stocks from different sectors that fit the bill",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wealth-creation-has-another-name-ignore-noise-trump-just-hold-on-to-good-businesses-22-stocks-from-different-sectors-that-fit-the-bill/articleshow/123535106.cms",
            "description": "With the additional 25% tariff all but a reality, here's a question: What will President Trump say or do next? Can anyone predict that? The answer is no. So, if you cannot predict what the man responsible for all the recent market turmoil will do, why try to predict what will happen to stock prices? At such a juncture, you will do well to remember that while the markets are about buying and selling, there is a third option. Which is hold. And when it comes to wealth creation, there are times when it is more important to just hold on to stocks. So if you have quality stocks, stop analysing what is happening to the Nifty and Sensex every day.",
            "pubDate": "2025-08-27T00:58:53.461115"
        },
        {
            "title": "Nabfid and Nabard set to raise $1 billion in external borrowings this fiscal year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nabfid-and-nabard-set-to-raise-1-billion-in-external-borrowings-this-fiscal-year/articleshow/123535149.cms",
            "description": "Nabfid plans to raise up to $1 billion through bonds and external commercial borrowings (ECB) this fiscal year, according to Managing Director Rajkiran Rai. Nabard also intends to issue its maiden ECB in FY26, having secured permission from the Reserve Bank of India, as stated by Chairman Shaji K V. Both institutions aim to bolster infrastructure and rural development funding.",
            "pubDate": "2025-08-27T00:58:53.461312"
        },
        {
            "title": "Gangwals to sell 3.1% in IndiGo parent via Rs 7,020-crore block deals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gangwals-to-sell-3-1-in-indigo-parent-via-rs-7020-crore-block-deals/articleshow/123535062.cms",
            "description": "Rakesh Gangwal's family is set to sell a 3.1% stake in InterGlobe Aviation (IndiGo) through block deals valued at $801 million, priced at ₹5,808 per share, a 4% discount. This sale marks a continuation of Gangwal's gradual departure from IndiGo since stepping down from the board in February 2022, with a 150-day lock-up period agreed upon for further sales.",
            "pubDate": "2025-08-27T00:58:53.461417"
        },
        {
            "title": "Welspun moves NCLT against Lavasa's top bidder Valor",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/welspun-moves-nclt-against-lavasas-top-bidder-valor/articleshow/123535142.cms",
            "description": "The interlocutory application, filed through a Welspun subsidiary, also highlighted links between Valor's promoters and another defaulting debt-laden jeweller, links the plea claimed automatically disqualify the bidder to participate in any resolution process.",
            "pubDate": "2025-08-27T00:58:53.461515"
        },
        {
            "title": "Jana Small Finance Bank set to merge investment and financial holding firms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jana-small-finance-bank-set-to-merge-investment-and-financial-holding-firms/articleshow/123535131.cms",
            "description": "The decision to merge the two holding companies into one is not related to Jana's universal banking aspirations while this would only help improving efficiency through a leaner structure, managing director and chief executive officer Ajay Kanwal said.",
            "pubDate": "2025-08-27T00:58:53.461609"
        },
        {
            "title": "Cash less, care less? Insurer-hospital standoff may add to patient trauma",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cash-less-care-less-insurer-hospital-standoff-may-add-to-patient-trauma/articleshow/123535052.cms",
            "description": "The General Insurance Council (GIC) has criticized the Association of Healthcare Providers India (AHPI) for discontinuing cashless hospitalization for Bajaj Allianz General Insurance and Care Health Insurance customers, deeming it disruptive and harmful. AHPI's decision, driven by disputes over reimbursement rates amid rising medical costs, will require patients to pay upfront and seek reimbursement later.",
            "pubDate": "2025-08-27T00:58:53.461704"
        },
        {
            "title": "Credit card game is back in full swing as players take the risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/credit-card-game-is-back-in-full-swing-as-players-take-the-risks/articleshow/123535100.cms",
            "description": "Expenditures climbed 5.5% from June to Rs 1.93 lakh crore, which was a third higher than in July last year, the Reserve Bank of India (RBI) data showed. Net new card additions in July hit a five-month high at 425,000, taking the total tally to 111.6 million. The industry had reported a marginal contraction of 235 cards in June.",
            "pubDate": "2025-08-27T00:58:53.461798"
        }
    ]
}