{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-10T05:41:12.219733",
    "items": [
        {
            "title": "D-Street sees worst week since September 2025 amid tariff fears, FPI selling",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-sees-worst-week-since-september-2025-amid-tariff-fears-fpi-selling/articleshow/126447161.cms",
            "description": "The Indian stock market has been on a downward trend, recording losses for the fifth straight day. Investors are pulling back on their portfolios in light of impending US job statistics and a critical Supreme Court verdict on tariffs.",
            "pubDate": "2026-01-10T05:23:09.391426"
        },
        {
            "title": "Sebi approves 5 IPOs including that of Kissht and Alcobrew Distilleries",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-approves-5-ipos-including-that-of-kissht-and-alcobrew-distilleries/articleshow/126447022.cms",
            "description": "Sebi has approved five IPOs across sectors including digital lending, alcoholic beverages, textiles and precision engineering. Major issuers include Kissht, Alcobrew Distilleries, Aastha Spintex, Indo MIM and Kusumgar, signalling a strong and diverse primary market pipeline.",
            "pubDate": "2026-01-10T05:23:09.391554"
        },
        {
            "title": "Swiggy, Infosys among 17 stocks in BNP Paribas' top buy ideas for 2026. Check list here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-infosys-among-17-stocks-in-bnp-paribas-top-buy-ideas-for-2026-check-list-here/slideshow/126447880.cms",
            "description": "BNP Paribas expects 2026 to be a stronger year for Indian equities, with the Nifty 50 seen delivering mid-teens returns and a December 2026 target of 29,500, driven largely by earnings growth rather than valuation re-rating. The brokerage is more constructive on large caps and domestic-oriented sectors such as banks, autos, telecom and consumer staples, citing policy support, improving earnings visibility and resilient domestic flows. Here are the brokerage's top buy ideas for 2026:",
            "pubDate": "2026-01-10T05:41:11.681997"
        }
    ]
}