{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-20T08:40:02.400194",
    "items": [
        {
            "title": "Wall Street closes higher with indexes notching weekly gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-closes-higher-with-indexes-notching-weekly-gains/articleshow/124009253.cms",
            "description": "Wall Street's main indexes closed higher on Friday, securing a weekly gain fueled by FedEx's strong earnings and positive sentiment in the technology sector. Optimism surrounding AI-linked stocks and the Fed's anticipated rate cuts further boosted the market. However, concerns arose from a blocked funding bill and Lennar's disappointing forecast, adding a layer of caution to the overall positive trend.",
            "pubDate": "2025-09-20T03:08:00.242111"
        },
        {
            "title": "AIFs may soon need to report value of units to depositories",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aifs-may-soon-need-to-report-value-of-units-to-depositories/articleshow/124009127.cms",
            "description": "SEBI has proposed that Alternative Investment Funds (AIFs) should report the value of their units to depositories. This move aims to leverage the depository infrastructure, requiring AIFs to maintain updated Net Asset Value (NAV) of units issued to investors. The NAV of all units must be uploaded within 15 days of investment portfolio valuation.",
            "pubDate": "2025-09-20T03:08:00.242261"
        },
        {
            "title": "Markets slip 0.5% as US revokes Chabahar sanctions relief; weekly gains intact",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-slip-0-5-as-us-revokes-chabahar-sanctions-relief-weekly-gains-intact/articleshow/124009084.cms",
            "description": "Indian equity indices experienced a decline of nearly 0.5% on Friday, ending a three-day winning streak due to US sanctions relief revocation concerning the Chabahar port. Despite Friday's dip, the indices concluded the week 0.8% higher, marking the third consecutive week of gains. Investors engaged in profit booking amidst tariff negotiation uncertainties, influencing market caution.",
            "pubDate": "2025-09-20T03:08:00.242471"
        },
        {
            "title": "Sebi verdict in Hindenburg probe lifts Adani stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-verdict-in-hindenburg-probe-lifts-adani-stocks/articleshow/124008957.cms",
            "description": "Adani Group shares surged following Sebi's clearance of the conglomerate and its founder from Hindenburg Research's accusations of stock manipulation and accounting fraud. The regulator found no evidence of fraudulent transactions, boosting investor confidence and adding ₹66,000 crore to the group's market capitalization.",
            "pubDate": "2025-09-20T03:08:00.242579"
        },
        {
            "title": "Standard treatment workflows to help expand health cover",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/standard-treatment-workflows-to-help-expand-health-cover/articleshow/124008986.cms",
            "description": "To standardize healthcare delivery and control rising medical inflation, ICMR, NHA, and WHO have developed 157 Standard Treatment Workflows across 28 specialties. This move aims to bring transparency in hospital billing, prevent overcharging, and ensure consistent, evidence-based treatment for all patients, potentially leading to more affordable health insurance premiums.",
            "pubDate": "2025-09-20T03:08:00.242679"
        },
        {
            "title": "A lost year for Indian equities: Sensex delivers 0% returns in 12 months, leaves investors empty-handed",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/a-lost-year-for-indian-equities-sensex-delivers-0-returns-in-12-months-leaves-investors-empty-handed/articleshow/124012743.cms",
            "description": "Indian equities have underperformed in the last year, with the Sensex posting a -0.7% return. Weak corporate earnings, persistent foreign investor selling, and high valuations are to blame. Despite policy support, global uncertainties and trade tensions have further dampened market sentiment.",
            "pubDate": "2025-09-20T08:39:44.135072"
        },
        {
            "title": "“Aao, ab laut chalen”, says Radhika Gupta as H-1B visa anxiety rises. Backs India as the better bet",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aao-ab-laut-chalen-says-radhika-gupta-as-h-1b-visa-anxiety-rises-backs-india-as-the-better-bet/articleshow/124012633.cms",
            "description": "Amidst H-1B visa anxieties, Edelweiss MF CEO Radhika Gupta encourages Indian professionals in the US to consider opportunities back home. Reflecting on her own journey, she highlights India's growth since 2005, emphasizing fulfilling careers and creation within the country.",
            "pubDate": "2025-09-20T08:39:44.135200"
        },
        {
            "title": "Concurrent Gainers: 9 midcap stocks that gain for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-9-midcap-stocks-that-gain-for-5-days-in-a-row/slideshow/124012582.cms",
            "description": "Over the five trading sessions ending September 19, the Sensex rose by approximately 0.88%, adding 722 points to settle at 82,626. The benchmark index closed in the green on three of those five days. Amid the broader market uptrend, nine midcap stocks posted gains in each of the five sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-09-20T08:39:44.135303"
        },
        {
            "title": "How Jefferies’ Chris Wood tweaked his portfolio after removing RIL. Check full list of stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-jefferies-chris-wood-tweaked-his-portfolio-after-removing-ril-check-full-list-of-stocks/slideshow/124012420.cms",
            "description": "Chris Wood, global head of equity strategy at Jefferies, has revealed the latest holdings in the brokerage's India long-only equity portfolio, adding a basket of Indian stocks across various sectors. Interestingly, Ambuja Cements, Le Travenues Technology (Ixigo) and Lemon Tree Hotels were introduced with a 4% weighting in each. This was done after selling the entire stake in Reliance Industries and Axis Bank and by shaving one percentage point each off the investments in ICICI Bank, REC and JSW Energy. Check the full list of stocks.",
            "pubDate": "2025-09-20T08:39:44.135400"
        },
        {
            "title": "Fed’s Rate Cut: Ripple effects across commodities, currencies, and global markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-rate-cut-ripple-effects-across-commodities-currencies-and-global-markets/articleshow/124012338.cms",
            "description": "The U.S. Federal Reserve's recent interest rate cut, signaling further easing due to labor market concerns, has triggered a global monetary policy shift. The dollar is weakening, boosting the euro, yen, and pound. Gold and silver prices have surged to record highs, while base metals show mixed trends. Crude oil prices remain steady amid oversupply concerns.",
            "pubDate": "2025-09-20T08:39:44.135496"
        },
        {
            "title": "From data to action: How AI is transforming investment management and empowering investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-data-to-action-how-ai-is-transforming-investment-management-and-empowering-investors/articleshow/124012313.cms",
            "description": "HDFC Securities' MD & CEO discusses how AI and ML are transforming stockbroking, democratizing access to market insights. SKY MCP, an AI-driven assistant, bridges the gap between complex data and actionable insights for all investors. The focus is on transparency, holistic integration, and responsible innovation to empower investors and foster a more equitable ecosystem.",
            "pubDate": "2025-09-20T08:39:44.135593"
        },
        {
            "title": "HUL in spotlight: GST tailwinds, rural recovery and premium push fuel upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-in-spotlight-gst-tailwinds-rural-recovery-and-premium-push-fuel-upside/articleshow/124011930.cms",
            "description": "The FMCG sector is preparing for GST 2.0, effective September 22, with companies adjusting pricing and inventory to boost consumption during the festive season. The GST cut is expected to benefit consumers, improve system efficiencies, and shift the market towards organized players.",
            "pubDate": "2025-09-20T08:39:44.135693"
        },
        {
            "title": "Markets ride on momentum, but GST effect already priced in: Sudip Bandyopadhyay",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/markets-ride-on-momentum-but-gst-effect-already-priced-in-sudip-bandyopadhyay/articleshow/124011109.cms",
            "description": "Indian equities had a strong week, boosted by global and local factors. The Goods and Services Tax regime change is expected to further boost sales. Sudip Bandyopadhyay suggests caution regarding GST-specific gains. He recommends watching cement, infrastructure, and auto ancillary sectors. He advises caution on large-cap IT, real estate, and metals due to limited short-term appreciation potential.",
            "pubDate": "2025-09-20T08:39:44.135807"
        },
        {
            "title": "Trading in Piramal Enterprises shares suspends from September 23 following merger with Piramal Finance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trading-in-piramal-enterprises-shares-suspends-from-september-23-following-merger-with-piramal-finance/articleshow/124010903.cms",
            "description": "The NSE will suspend trading of Piramal Enterprises Ltd (PEL) shares effective September 23, 2025, due to its amalgamation with Piramal Finance Ltd (PFL), a move sanctioned by the NCLT. This merger, driven by RBI regulations and strategic benefits, consolidates operations under a single entity, enhancing service and shareholder value. CFO Upma Goel will resign by September 30.",
            "pubDate": "2025-09-20T08:39:44.135903"
        },
        {
            "title": "From Crash to Comeback: 9 small-caps surge 40–80% in 3 months after H1CY25 slump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/from-crash-to-comeback-9-small-caps-surge-4080-in-3-months-after-h1cy25-slump/slideshow/124010753.cms",
            "description": "The small-cap universe in 2025 has been a rollercoaster worth watching. In the first six months of the year (January–June), nearly 169 small-cap stocks crashed more than 25%, leaving investors on shaky ground. But just when pessimism was at its peak, a surprise turnaround came in the second half of the year. In less than three months, nine of those beaten-down counters staged a remarkable comeback, climbing over 40% each.",
            "pubDate": "2025-09-20T08:39:44.135997"
        },
        {
            "title": "Infosys, Wipro ADRs decline up to 4% amid Trump’s proposal for $100,000 annual H-1B visa fee",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-wipro-adrs-decline-up-to-4-amid-trumps-proposal-for-100000-annual-h-1b-visa-fee/articleshow/124010368.cms",
            "description": "American Depositary Receipts of Infosys and Wipro faced a decline. This followed the Trump administration's plan. The plan proposed a $100,000 annual fee for each H-1B visa. The policy could significantly impact companies. These companies rely on foreign skilled workers. The proposed fee is part of a broader immigration overhaul.",
            "pubDate": "2025-09-20T08:39:44.136088"
        },
        {
            "title": "Vijay Kedia’s TechD Cybersecurity to GK Energy: 5 IPOs that could give up to 90% returns next week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedias-techd-cybersecurity-to-gk-energy-5-ipos-that-could-give-up-to-90-returns-next-week/slideshow/124009989.cms",
            "description": "It has been one of the busiest weeks in the IPO market with multiple issues hitting the Street. From decorative laminates to renewable energy, companies across sectors are testing investor appetite in the primary market. Grey market premiums (GMPs) suggest that some of these listings could deliver strong gains — with one even eyeing up to 90% upside on debut.",
            "pubDate": "2025-09-20T08:39:44.136177"
        },
        {
            "title": "Nifty momentum strong; 26,000 possible by Diwali: Rajesh Palviya",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-momentum-strong-26000-possible-by-diwali-rajesh-palviya/articleshow/124009907.cms",
            "description": "The Nifty has reached 25,400 this week. Experts predict the rally may continue next week. Rajesh Palviya suggests Nifty could reach 25,750 if it surpasses 25,500. Banking stocks are currently supporting the market. Palviya sees potential in PSU banks, NBFCs, power, and chemical sectors. Suzlon Energy and Bharat Forge are his stock picks.",
            "pubDate": "2025-09-20T08:39:44.136263"
        },
        {
            "title": "FIIs make Rs 4,500 crore bet on auto stocks before GST cut fuels showroom rush from Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-make-rs-4500-crore-bet-on-auto-stocks-before-gst-cut-fuels-showroom-rush-from-monday/articleshow/124009891.cms",
            "description": "Foreign Institutional Investors (FIIs) have aggressively invested Rs 4,500 crore in Indian auto stocks following the GST rationalization announcement, anticipating a consumption-led rally. The GST Council's decision to slash tax rates across auto segments, coupled with seasonal tailwinds, has fueled this surge. While autos, metals, capital goods, and financials saw inflows, consumer services, IT, and real estate experienced outflows.",
            "pubDate": "2025-09-20T08:39:44.136358"
        },
        {
            "title": "Fed's Miran defends call for steep rate cuts, says Trump didn't direct his vote",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-miran-defends-call-for-steep-rate-cuts-says-trump-didnt-direct-his-vote/articleshow/124009849.cms",
            "description": "Stephen Miran, the new US Federal Reserve Governor, addressed concerns about his independence. This followed his dissent on rate cut decisions. Miran advocated for steeper rate cuts. He argued for a near-neutral interest rate. He cited no inflation risk and lower housing costs. These views contrast with the Fed's consensus. Other policymakers favor gradual cuts.",
            "pubDate": "2025-09-20T08:39:44.136445"
        },
        {
            "title": "U.S. equity funds see large outflows as investors book profit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/u-s-equity-funds-see-large-outflows-as-investors-book-profit/articleshow/124009831.cms",
            "description": "Investors withdrew a massive $43.19 billion from U.S. equity funds, the largest outflow since December 2024, driven by concerns over high market valuations after a significant rally and a Federal Reserve rate cut. Large-cap and technology funds experienced substantial outflows, while bond funds continued to attract inflows for the 22nd consecutive week.",
            "pubDate": "2025-09-20T08:39:44.136532"
        }
    ]
}