{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-08T19:20:05.953969",
    "items": [
        {
            "title": "Sebi issues guideline for research analysts, investment advisers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-issues-guideline-for-research-analysts-investment-advisers/articleshow/117061400.cms",
            "description": "Sebi has released guidelines for research analysts and investment advisers to enhance investor protection and transparency. New requirements include qualification standards, deposit mandates based on client numbers, and stringent compliance for AI usage. Dual registrations are allowed with separate compliance, and client-level segregation is mandatory to avoid conflicts of interest.",
            "pubDate": "2025-01-08T19:19:47.469695"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/117060646.cms",
            "description": "India's benchmark indices ended lower on Wednesday, pressured by financial and consumer stock sell-offs amid cautious market sentiment ahead of corporate earnings and concerns over limited U.S. Federal Reserve interest rate cuts.",
            "pubDate": "2025-01-08T19:19:47.469826"
        },
        {
            "title": "Market Trading Guide: RIL, Bajaj Finserv are among 5 stock recommendations for Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-ril-bajaj-finserv-are-among-5-stock-recommendations-for-thursday/slideshow/117058977.cms",
            "description": "Indian frontline indices recovered from the day’s lows to end Wednesday’s trading session with minor declines. Major spoilers were banks, auto and FMCG stocks though IT and energy stocks threw their weights around. While the S&P BSE Sensex settled at 78,148.49, down by 50.62 points or 0.06%, the broader Nifty closed at 23,689.50, lower by 18.40 points or 0.08%.Commenting on the day's action, expert Hrishikesh Yedve said that the late recovery helped the index close marginally negative. \"Technically, on the daily chart, Nifty found support near 23,500 levels and formed a hammer candle around 250-Days Simple Moving Average (250-DSMA) support, indicating strength. However, the index will find resistance near the 23,920 mark, where its 200-DSMA is located. If the index sustains above 23,920, its upward trajectory may continue to 24,200 levels. As long as Nifty holds above 23,500 levels, a buy on dips strategy should be adopted,\" the AVP Technical and Derivatives Research at Asit C. Mehta Investment Interrmediates said. Here are 5 stock recommendations for Thursday:",
            "pubDate": "2025-01-08T19:19:47.469933"
        },
        {
            "title": "Mahi Madhusudan Kela, Authum Investment offer to buy Prataap Snacks 26% stake at Rs 865.66 per share",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahi-madhusudan-kela-authum-investment-offer-to-buy-prataap-snacks-26-stake-at-rs-865-66-per-share/articleshow/117060557.cms",
            "description": "Prataap Snacks has received an open offer from Authum Investment & Infrastructure and Mahi Madhusudan Kela to acquire 26.01% equity at ₹865.66 per share, totaling 62.98 lakh shares.",
            "pubDate": "2025-01-08T19:19:47.470044"
        },
        {
            "title": "Former Chief Investment Officer, his sister settle front-running case by paying Rs 91 lakh. Details here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/former-chief-investment-officer-his-sister-settle-front-running-case-by-paying-rs-91-lakh-details-here/articleshow/117059428.cms",
            "description": "A former CIO and his sister settled a Sebi front-running case by paying ₹91 lakh and accepting a six-month market ban. Sebi's probe uncovered ₹27.77 lakh unlawful gains from front-running trades worth ₹42.36 crore.",
            "pubDate": "2025-01-08T19:19:47.470143"
        },
        {
            "title": "US stocks subdued as investors assess data, report of Trump's tariff plans",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-muted-as-investors-assess-data-trump-economic-emergency-report/articleshow/117059306.cms",
            "description": "U.S. stocks remained mostly unchanged amid Wall Street uncertainty driven by conflicting jobs data and reports of President-elect Trump considering a national economic emergency declaration. Investors were cautious due to potential tariffs and trade wars, and mixed movements were observed in major sectors and companies.",
            "pubDate": "2025-01-08T19:19:47.470240"
        },
        {
            "title": "These 6 stocks hit 52-week highs, rallied up to 48% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-6-stocks-hit-52-week-highs-rallied-up-to-48-in-a-month/slideshow/117058415.cms",
            "description": "On Wednesday, the benchmark Sensex dropped by around 50 points, closing at 78,148. Despite this decline, six stocks from the BSE 500 Index reached their 52-week highs, marking their highest prices in the past year. A 52-week high is a significant indicator for traders and investors, showing a stock's peak value over the last 12 months. It is a key metric for evaluating a stock's current market standing and forecasting its potential for future growth.",
            "pubDate": "2025-01-08T19:19:47.470337"
        },
        {
            "title": "Breakout Stocks: How to trade Max Healthcare, KIMS and Anant Raj on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-max-healthcare-kims-and-anant-raj-on-thursday/slideshow/117057434.cms",
            "description": "Indian market recouped losses but still closed flat with a negative bias on Wednesday. The BSE Sensex fell more than 50 points while the Nifty50 closed with a loss of just 18 points.",
            "pubDate": "2025-01-08T19:19:47.470461"
        },
        {
            "title": "Tech View: Nifty forms hammer candle; rebound from 23,500 offers hope. How to trade on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-forms-hammer-candle-rebound-from-23500-offers-hope-how-to-trade-on-thursday/articleshow/117057156.cms",
            "description": "The Nifty's short-term trend remains weak, but a smart recovery near 23,500 levels suggests a potential upside bounce. A sustained move above 23,800 levels could confirm this recovery. Immediate support is seen at 23,496 levels, according to Nagaraj Shetti of HDFC Securities, indicating possible market strength if the resistance is surpassed.",
            "pubDate": "2025-01-08T19:19:47.470566"
        },
        {
            "title": "US stock futures fall after report Trump mulls national economic emergency declaration",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stock-futures-fall-after-report-trump-mulls-national-economic-emergency-declaration/articleshow/117056180.cms",
            "description": "U.S. stock index futures fell on Wednesday after CNN reported President-elect Donald Trump was considering a national economic emergency declaration to allow for new tariff program.",
            "pubDate": "2025-01-08T19:19:47.470667"
        },
        {
            "title": "Sebi imposes Rs 9 lakh penalty on stock broker whose 1,103 clients were 'dependent children' aged between 34 & 100 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-imposes-rs-9-lakh-penalty-on-stock-broker-whose-1103-clients-were-dependent-children-aged-between-34-100-years/articleshow/117055067.cms",
            "description": "SEBI penalized Stockholding Services Limited Rs 9 lakh for irregularities in client relationship data. Over 1,100 accounts had listed \"dependent children\" aged 34-100, violating norms. Further issues included mismatched KYC data, irregular mobile/email mapping, and inadequate due diligence.",
            "pubDate": "2025-01-08T19:19:47.470761"
        },
        {
            "title": "Sebi warns Ola Electric for disclosure lapses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-warns-ola-electric-for-disclosure-lapses/articleshow/117052969.cms",
            "description": "India's markets regulator has warned Ola Electric against sharing company-related information on social media before disclosing it to investors, adding to a slew of problems for the electric two-wheeler maker.",
            "pubDate": "2025-01-08T19:19:47.470862"
        },
        {
            "title": "NSE expands colocation facility in Mumbai with 200 new racks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nse-expands-colocation-facility-in-mumbai-with-200-new-racks/articleshow/117052522.cms",
            "description": "The NSE expanded its colocation facility in Mumbai, adding over 200 racks and planning to reach 1,500 racks by FY25. It aims to scale capacity to 4,000 racks within two years, enhancing ultra-low latency trading infrastructure for market participants.",
            "pubDate": "2025-01-08T19:19:47.470958"
        },
        {
            "title": "Market Wrap: Banks drag D-Street lower; Sensex skids 50 points, Nifty below 23,700",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-banks-drag-d-street-lower-sensex-skids-50-points-nifty-below-23700/articleshow/117052479.cms",
            "description": "India's benchmark indexes ended in red on Wednesday, pressured by selling in heavyweight financial and consumer stocks as investor sentiment remained cautious ahead of the upcoming corporate earnings season while concerns over the likelihood of fewer interest rate cuts by the U.S. Federal Reserve added to the overall subdued mood in the market.",
            "pubDate": "2025-01-08T19:19:47.471057"
        },
        {
            "title": "These 13 smallcap stocks soared over 100% in FY25 driven by strong quarterly results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-13-smallcap-stocks-soared-over-100-in-fy25-driven-by-strong-quarterly-results/slideshow/117052212.cms",
            "description": "Smallcap stocks often attract investors seeking fast growth, despite the higher risks. ETMarkets recently analyzed smallcap stocks that showed impressive growth in FY25, finding 80 stocks that became multibaggers. To refine the list, we focused on stocks with at least 15% sales and profit growth in the first two quarters of FY25 compared to the previous year, along with a profit margin of 15% or more in both Q1 and Q2 of FY25. This filter picked out 13 stocks that showed good growth and strong basics, which could be opportunities for investors. It is important to note that past performance does not guarantee future growth. (Data Source: ACE Equity)",
            "pubDate": "2025-01-08T19:19:47.471155"
        },
        {
            "title": "Gillette among 5 stocks that can rally up to 31% in 2025: YES Securities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gillette-among-5-stocks-that-can-rally-up-to-31-in-2025-yes-securities/slideshow/117050875.cms",
            "description": "Brokerage firm YES Securities Wealth Broking is optimistic about five stocks that have the potential to rise by up to 31% in 2025. These stocks span across various sectors, including insurance, jewelry, grooming, infrastructure, and castings. Here's a list of the 5 stocks that can rally up to 31%, according to YES Securities Wealth Broking:",
            "pubDate": "2025-01-08T19:19:47.471248"
        }
    ]
}