{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-19T18:14:46.732852",
    "items": [
        {
            "title": "Market Trading Guide: Top stock recommendations for Monday with up to 8% upside scope",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-top-stock-recommendations-for-monday-with-up-to-8-upside-scope/slideshow/124682431.cms",
            "description": "India’s benchmark indices Nifty and Sensex ended with strong gains on Friday, hitting their 52-week highs led by FMCG, auto, and bank stocks. The sentiment around Nifty remains upbeat as the index moved above its four-month consolidation range.Commenting on the day’s action, Rupak De, Senior Technical Analyst at LKP Securities, said that large-cap stocks clearly outperformed on Friday, leaving behind midcap and smallcap stocks — a classic bull market scenario. In the early phase of a classic bull run, largecaps usually lead the rally, followed by midcap and smallcap companies, he said. “Technically, Nifty looks strong for a decent upside from here, and a ‘buy on dips’ strategy might prove effective. On the lower end, meaningful support is placed at 25,500, while resistance is seen at 25,850–26,000,” De added. Here are 2 stock recommendations for Monday:",
            "pubDate": "2025-10-19T04:42:41.360947"
        },
        {
            "title": "Festive cheer: 10 smallcap stocks rallied up to 42% in pre-Diwali buzz",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/festive-cheer-10-smallcap-stocks-rallied-up-to-42-in-pre-diwali-buzz/slideshow/124682416.cms",
            "description": "A few of India’s smallcap stocks rose in the pre-Diwali rally even as the broader market consolidated. Here are the top 10 names that surged by up to 42% last week.",
            "pubDate": "2025-10-19T04:42:41.361080"
        },
        {
            "title": "Sensex surges 1,900 points in 3 days. What’s in store for investors this Diwali?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-surges-1900-points-in-3-days-whats-in-store-for-investors-this-diwali/articleshow/124682117.cms",
            "description": "India's stock market is delivering the ultimate festive gift. With Nifty scaling fresh 52-week highs and the Sensex rocketing over 1,900 points in just three sessions, investors are entering the holiday week riding a wave of renewed confidence.",
            "pubDate": "2025-10-19T04:42:41.361193"
        },
        {
            "title": "Dussehra to Diwali: 6 penny stocks skyrocket up to 65%. Did you miss festive rally?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dussehra-to-diwali-6-penny-stocks-skyrocket-up-to-65-did-you-miss-festive-rally/slideshow/124682571.cms",
            "description": "As festive lights brighten the markets, six penny stocks have emerged as shining stars, soaring between 35% and 65% in just over two weeks — from Dussehra to Diwali. This pre-Diwali rally reflects investor optimism, bullish sentiment, and a hunt for value in the microcap space. These top performers were identified using a targeted screening approach that focused on stocks with a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a recent trading volume of at least 5 lakh shares. This strategy is designed to highlight low-priced, actively traded small-cap stocks demonstrating strong upward momentum. (Data Source: ACE Equity)",
            "pubDate": "2025-10-19T05:19:22.955388"
        },
        {
            "title": "Calcutta Stock Exchange may mark its last Diwali in 2025 ahead of voluntary exit as bourse",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/calcutta-stock-exchange-may-mark-its-last-diwali-in-2025-ahead-of-voluntary-exit-as-bourse/articleshow/124683182.cms",
            "description": "The Calcutta Stock Exchange (CSE), one of India's oldest bourses, may this year celebrate its last Kali Puja and Diwali on October 20 as a functioning exchange, with the process of voluntary exit as a bourse nearing completion after a decade-long legal battle.",
            "pubDate": "2025-10-19T05:58:56.707658"
        },
        {
            "title": "This Samvat, are you a scientific investor or just following the herd?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/this-samvat-are-you-a-scientific-investor-or-just-following-the-herd/articleshow/124682896.cms",
            "description": "Scientific Investing is an approach that is based on the first principles of investing which are rooted in the concepts of cash flows, intrinsic value and portfolio construction.",
            "pubDate": "2025-10-19T05:58:56.707784"
        },
        {
            "title": "Diwali 2025: Gold, silver prices drop from record highs. Check latest rates on 19 October",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/diwali-2025-gold-silver-prices-drop-from-record-highs-check-latest-rates-on-19-october/articleshow/124684639.cms",
            "description": "Gold and silver prices eased from record highs ahead of Diwali, with 24-karat gold at Rs 1,30,860 per 10 gm and silver at Rs 1,70,000 per kg, amid festive Dhanteras demand.",
            "pubDate": "2025-10-19T10:11:03.898425"
        },
        {
            "title": "After 3-month withdrawal streak, FPIs pump Rs 6,480 cr into Indian equities in Oct",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-3-month-withdrawal-streak-fpis-pump-rs-6480-cr-into-indian-equities-in-oct/articleshow/124684489.cms",
            "description": "In a noticeable shift, foreign investors are once again embracing Indian stocks, infusing over six thousand crore rupees into the market in October alone. This comes on the heels of several months marked by cautious selling. With solid economic fundamentals and attractive stock prices drawing their attention, international capital is gravitating back towards emerging markets.",
            "pubDate": "2025-10-19T10:11:03.898549"
        },
        {
            "title": "Earnings Rush: HUL, Kotak among 45 companies to unveil Q2 results this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-rush-hul-kotak-among-45-companies-to-unveil-q2-results-this-week/slideshow/124684325.cms",
            "description": "A packed earnings week lies ahead as India Inc readies to report September-quarter results. From FMCG and banks to pharma and IT, about 45 companies will announce their results in the Diwali week.",
            "pubDate": "2025-10-19T10:11:03.898652"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms surges by Rs 2.16 lakh cr; Reliance, Airtel biggest gainers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-surges-by-rs-2-16-lakh-cr-reliance-airtel-biggest-gainers/articleshow/124684441.cms",
            "description": "India's top companies saw a significant market valuation jump last week. Reliance Industries and Bharti Airtel led the surge, adding over Rs 2 lakh crore collectively. Seven of the top ten firms experienced growth. This optimistic trend reflects the positive movement in the equity markets. Investors witnessed substantial gains across several major corporations.",
            "pubDate": "2025-10-19T10:11:03.898752"
        },
        {
            "title": "Stock Market Holiday 2025: Are NSE and BSE closed on October 20 or 21 for Diwali?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-holiday-2025-are-nse-and-bse-closed-on-october-20-or-21-for-diwali/articleshow/124684316.cms",
            "description": "There’s been some confusion among investors this year about the exact Diwali date — October 20 or 21. But for traders, one thing is certain. Both the NSE and BSE will remain closed on October 21 for Diwali Lakshmi Puja, and again on October 22 for Balipratipada.",
            "pubDate": "2025-10-19T10:11:03.898853"
        },
        {
            "title": "Good in moderation: 5 stocks from the ‘sin sector’, with a different investing perspective & upside potential of up to 36%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/good-in-moderation-5-stocks-from-the-sin-sector-with-a-different-investing-perspective-upside-potential-of-up-to-36/articleshow/124683350.cms",
            "description": "We are in the midst of the festive season, the season of good cheer that will run up to the New Year. It is also a season, shall we say, of good “cheers”! Yes, this is a good time of the year for the so-called “sin sector”, especially liquor companies. There are, however, good reasons to look at these companies beyond the seasonal cheer. This is a sector where growth never seems to lag. Yet, as investors, you need to be well aware that there are many problems these companies face, some of them very specific to the sector. Read on to find out.",
            "pubDate": "2025-10-19T10:11:03.898972"
        },
        {
            "title": "Two Trades for Today: A top tyre company for a 5.1% upmove, a mid-cap financial stock for close to 6% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-top-tyre-company-for-a-5-1-upmove-a-mid-cap-financial-stock-for-close-to-6-rise/articleshow/124687809.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-10-19T13:32:15.199084"
        },
        {
            "title": "9 stocks in Nifty500 with upside potential of up to 75% — Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-stocks-in-nifty500-with-upside-potential-of-up-to-75-do-you-own-any/slideshow/124687726.cms",
            "description": "Analyst forecasts go beyond mere numbers — they offer a strategic lens into future market potential. For investors on the lookout for the next breakout opportunity, certain Nifty500 stocks stand out as compelling picks. Consensus estimates from Trendlyne indicate that many Nifty500 stocks have the potential to deliver significant returns over the coming 12 months.These upside projections, reflecting average expected price gains, offer a data-backed benchmark for investors seeking high-potential opportunities within the Nifty500 universe. In this overview, we spotlight nine standout Nifty500 stocks — each backed by ratings from five or more analysts — with estimated returns ranging from 35% to as high as 75% over the coming year.",
            "pubDate": "2025-10-19T13:32:15.199211"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/124686633.cms",
            "description": "The Indian market extended its winning streak on Friday, supported by foreign inflows, easing U.S. bond yields, a stronger rupee, and festive optimism.",
            "pubDate": "2025-10-19T13:32:15.199328"
        },
        {
            "title": "Starting Samvat 2082: Question old frameworks, but also stick with some: 10 large-cap stocks with upside potential of up to 24%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/starting-samvat-2082-question-old-frameworks-but-also-stick-with-some-10-large-cap-stocks-with-upside-potential-of-up-to-24/articleshow/124688739.cms",
            "description": "When it comes to investing and creating wealth, we all tend to look for a framework which helps us make money. Yes, there are some frameworks and narratives which you should look at. But the fact is that no framework is perfect all the time. Frameworks tend to change with time. In 2025, the Indian economy is very different from what it was in 2005 or 2015. From government spending to the size and scale of Indian corporations – everything has changed. But yes, some things have remained the same. Some managements were, are, and will remain competent purely because of their experience and intent.",
            "pubDate": "2025-10-19T18:14:45.818092"
        }
    ]
}