{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-03T07:15:08.318651",
    "items": [
        {
            "title": "ITC slides to three-year low as tobacco excise hike prompts brokerage downgrades",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/itc-slides-to-three-year-low-as-tobacco-excise-hike-prompts-brokerage-downgrades/articleshow/126316238.cms",
            "description": "ITC shares plummeted to a three-year low following a government excise duty hike on tobacco products. Brokerages downgraded the stock, citing fears of dampened cigarette demand and significant impact on profitability. Investors are advised to wait for clarity on price hikes and volume trends before considering buying.",
            "pubDate": "2026-01-03T03:36:49.475832"
        },
        {
            "title": "Two executives quit IndusInd, bank fills key posts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-executives-quit-indusind-bank-fills-key-posts/articleshow/126316214.cms",
            "description": "IndusInd Bank announced the resignations of two senior executives, Rana Vikram Anand and Anish Behl, who are leaving to explore new opportunities. Anand will depart in April 2026, while Behl's tenure concludes in January. These departures follow a series of senior-level exits, though the bank has simultaneously bolstered its leadership with recent appointments in wholesale banking, data, and human resources.",
            "pubDate": "2026-01-03T03:36:49.475940"
        },
        {
            "title": "Sebi developing AI-driven tool to analyse cyber safety at entities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-developing-ai-driven-tool-to-analyse-cyber-safety-at-entities/articleshow/126316027.cms",
            "description": "Sebi is developing an AI-powered tool to analyze the cyber safety preparedness of regulated entities, aiming to strengthen risk-based supervision. Additionally, a working group is being formed to create a technology roadmap for market infrastructure institutions, ensuring innovation enhances market integrity.",
            "pubDate": "2026-01-03T03:36:49.476129"
        },
        {
            "title": "Can Nifty sustain its momentum after scaling fresh all-time highs?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-nifty-sustain-its-momentum-after-scaling-fresh-all-time-highs/articleshow/126315944.cms",
            "description": "Indian benchmark indices, Nifty50 and Sensex, closed at record highs on Friday, marking their best weekly gains in seven weeks. This surge followed a period of range-bound trading, with analysts predicting further upward movement.  Market participants anticipate significant gains for both indices in 2026, despite a cautious VIX.",
            "pubDate": "2026-01-03T03:36:49.476226"
        },
        {
            "title": "Vi promoters earmark shares worth ₹3,529 cr to settle legacy liabilities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vi-promoters-earmark-shares-worth-3529-cr-to-settle-legacy-liabilities/articleshow/126316097.cms",
            "description": "Vodafone Idea's promoters will settle legacy merger liabilities worth ₹3,529 crore by earmarking 3.28 billion equity shares. This follows an amended agreement securing ₹5,836 crore, with ₹2,307 crore in cash and the rest via shares held by three Vodafone promoter entities. These shares, representing 3.03% of Vi's equity, will be sold over five years.",
            "pubDate": "2026-01-03T03:36:49.476323"
        },
        {
            "title": "Insurance a long game with hurdles, foreign investors unlikely to rush in",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/insurance-a-long-game-with-hurdles-foreign-investors-unlikely-to-rush-in/articleshow/126315889.cms",
            "description": "India now permits full foreign ownership in insurance firms. However, industry experts believe this change will not immediately bring many new foreign companies. Setting up an insurer requires substantial investment and a long-term view in a competitive market. Existing joint ventures might see increased stakes, but new ventures from scratch are unlikely.",
            "pubDate": "2026-01-03T03:36:49.476414"
        },
        {
            "title": "The 72-hour ‘trap’: How to navigate trade around the Indian markets’ long weekends of 2026 – and there are seven of them",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-72-hour-trap-how-to-navigate-trade-around-the-indian-markets-long-weekends-of-2026-and-there-are-seven-of-them/articleshow/126318339.cms",
            "description": "With 15 official holidays and seven long weekends in 2026, the exchanges are providing more \"off-switches\" than usual. But for a professional trader, a three-day break is no longer a simple holiday; it is a high-stakes risk-management puzzle. So, how do the pros navigate these long pauses in trading?",
            "pubDate": "2026-01-03T07:15:06.414480"
        },
        {
            "title": "7 smallcaps with upside potential of up to 54% to bet in 2026. How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-smallcaps-with-upside-potential-of-up-to-54-to-bet-in-2026-how-many-do-you-own/slideshow/126317798.cms",
            "description": "After a bruising 2025 that saw the smallcap index slip nearly 6% and underperforming Nifty, investor sentiment around the segment has remained cautious. However, looking ahead to 2026, Axis Securities believes select opportunities are emerging across the smallcap space. In a recent report, the brokerage has identified seven smallcap stocks spanning utilities, financials and consumer discretionary that could offer value and potentially deliver returns of up to 54% over the next year. Here’s the full list.",
            "pubDate": "2026-01-03T07:15:06.414603"
        },
        {
            "title": "Concurrent Gainers: 15 stocks gain for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-15-stocks-gain-for-5-days-in-a-row/slideshow/126317593.cms",
            "description": "Over the five trading sessions ending January 2, the Sensex benchmark rose 0.85%, gaining 573 points to close at 85,762. The index ended higher in two of the five sessions between December 29 and January 2. Despite the modest market rally, 15 stocks from the BSE 500 index recorded gains in all five sessions. (Data Source: ACE Equity)",
            "pubDate": "2026-01-03T07:15:06.414715"
        }
    ]
}