{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-16T15:38:52.294970",
    "items": [
        {
            "title": "Rising from the ashes: How a 50-year-old smallcap company avoided bankruptcy and delivered multibagger returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rising-from-the-ashes-how-a-50-year-old-smallcap-company-avoided-bankruptcy-and-delivered-multibagger-returns/articleshow/125361183.cms",
            "description": "Jayaswal Neco Industries has transformed from near bankruptcy to a financially stronger steel and mining player through debt restructuring, operational improvements and better sector conditions. Rising sales, stronger profitability and steady deleveraging support its outlook, though high promoter pledging and regulatory delays remain key risks for future growth.",
            "pubDate": "2025-11-16T07:50:33.699222"
        },
        {
            "title": "​7 stocks in Nifty500 with upside potential of up to 85%. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/7-stocks-in-nifty500-with-upside-potential-of-up-to-85-do-you-own-any/slideshow/125361133.cms",
            "description": "Analyst forecasts go beyond mere numbers; they offer a strategic lens into future market potential. For investors on the lookout for the next breakout opportunity, certain Nifty500 stocks stand out as compelling picks. Consensus estimates from Trendlyne indicate that many Nifty500 stocks have the potential to deliver significant returns over the coming 12 months.These upside projections, reflecting average expected price gains, offer a data-backed benchmark for investors seeking high-potential opportunities within the Nifty500 universe. In this overview, we spotlight seven standout Nifty500 stocks, each backed by ratings from five or more analysts with estimated returns ranging from 25% to as high as 88% over the coming year.",
            "pubDate": "2025-11-16T07:50:33.699352"
        },
        {
            "title": "Aluminium market analysis: Record highs and global dynamics",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aluminium-market-analysis-record-highs-and-global-dynamics/articleshow/125360941.cms",
            "description": "Aluminium prices have surged to record levels in India and abroad, driven by tight domestic supply, robust industrial demand, high energy costs, and geopolitical disruptions. Import restrictions, global trade shifts, tariffs, and structural constraints continue to widen regional price gaps. With EVs and renewables boosting demand, the long-term outlook remains firm despite volatility",
            "pubDate": "2025-11-16T07:50:33.699454"
        },
        {
            "title": "Mcap of eight of top-10 valued firms jumps Rs 2.05 lakh crore; Bharti Airtel, RIL major winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-eight-of-top-10-valued-firms-jumps-rs-2-05-lakh-crore-bharti-airtel-ril-major-winners/articleshow/125360883.cms",
            "description": "HDFC Bank added Rs 9,149.13 crore, taking its market capitalisation to Rs 15,20,524.34 crore, and that of Hindustan Unilever rose by Rs 2,878.25 crore to Rs 5,70,187.06 crore",
            "pubDate": "2025-11-16T07:50:33.699555"
        },
        {
            "title": "Axis Securities offers Nifty playbook for the week, 3 stock picks for up to 13% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-securities-offers-nifty-playbook-for-the-week-3-stock-picks-for-up-to-13-upside/slideshow/125360878.cms",
            "description": "Axis Securities weekly technical note keeps a positive bias on the market with Nifty at 25,910 and Bank Nifty at 58,518. The report highlights a trading range of 26,500-25,200 for Nifty and 59,500-57,200 for Bank Nifty, and picks Sun Pharma, GRSE and Persistent Systems with 7–13% potential upside over the next 3-4 weeks.",
            "pubDate": "2025-11-16T07:50:33.699657"
        },
        {
            "title": "Folding in India, gaming companies lose big",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/folding-in-india-gaming-companies-lose-big/articleshow/125360822.cms",
            "description": "Amid India's recent real-money gaming prohibition, gaming companies are grappling with significant financial setbacks. Flutter Entertainment and Clairvest Group have reported hefty impairments, while Nazara Technologies and Delta Corp aren't far behind, facing considerable write-offs. Payment providers such as Paytm and Mobikwik have seen their profits dwindle as many gaming platforms curtail their operations or exit the market entirely.",
            "pubDate": "2025-11-16T07:50:33.699758"
        },
        {
            "title": "Select rebound: 50 smallcaps gain in double-digits, returning up to 33% last week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/select-rebound-50-smallcaps-gain-in-double-digits-returning-up-to-33-last-week/articleshow/125360617.cms",
            "description": "Smallcap stocks delivered impressive double-digit gains last week. VTM, Yatra Online, and Indigo Paints led the rally. Textiles, consumer, and niche manufacturing sectors saw notable increases. Healthcare and pharma stocks also performed well. This revival is linked to improving macroeconomics and earnings. Investors are anticipating further catalysts from upcoming RBI policy and trade deal news.",
            "pubDate": "2025-11-16T07:50:33.699870"
        },
        {
            "title": "After regulatory clean-up, is a sustained re-rating now possible? 6 private sector banks with upside potential of up to 49%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/after-regulatory-clean-up-is-a-sustained-re-rating-now-possible-6-private-sector-banks-with-upside-potential-of-up-to-49/articleshow/125359932.cms",
            "description": "In the last three months, the amount of money that the banking sector has seen coming by way of foreign direct investment is something that has never happened before. There is, however, another factor worth noticing. All the money is pouring into relatively smaller entities, or those with troubled pasts. There is a set of private sector banks where numbers are getting better. When we talk about numbers, the majority of them have ratios which are not far from the best in the industry. So, can they see a re-rating? Can it be a sustained one is the question, because a part of the interest is clearly visible.",
            "pubDate": "2025-11-16T07:50:33.699960"
        },
        {
            "title": "Market Trading Guide: Buy GRSE and Thyrocare Technologies on Monday for up to 12% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-grse-and-thyrocare-technologies-on-monday-for-up-to-12-gains/articleshow/125359622.cms",
            "description": "Nifty ended higher after a late rebound driven by financials, pharma, and FMCG, supported by sentiment linked to the NDA’s Bihar victory. Technical indicators suggest strength above key support levels. Analysts recommend GRSE and Thyrocare based on strong breakouts, robust volume patterns, and sustained momentum across major moving averages",
            "pubDate": "2025-11-16T07:50:33.700056"
        },
        {
            "title": "Q2 earnings season comes to an end: 6 factors will decide where Nifty is headed this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/q2-earnings-season-comes-to-an-end-6-factors-will-decide-where-nifty-is-headed-this-week/articleshow/125359543.cms",
            "description": "The Nifty is poised for direction as the Q2 earnings season ends. Six key factors will guide its movement this week. These include technical momentum, the mixed performance of Q2 results, FII flows, upcoming macro events, global market sentiment, and a potential India-US trade deal announcement. Traders should focus on stock-specific opportunities and manage risk effectively",
            "pubDate": "2025-11-16T07:50:33.700146"
        },
        {
            "title": "Investor deep dive: Why cash is king again in new era of accounting risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/investor-deep-dive-why-cash-is-king-again-in-new-era-of-accounting-risks/articleshow/125359488.cms",
            "description": "Indian companies face new accounting risks. Traditional debt issues have eased, but profit quality is now a concern, particularly for companies going public. Investors must scrutinize cash flow and related-party deals.  A focus on cash conversion and audit quality offers a clearer view of corporate performance in today's market.",
            "pubDate": "2025-11-16T07:50:33.700236"
        },
        {
            "title": "D-Street set for slower IPO flow this week, Excelsoft emerges as the highlight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/d-street-set-for-slower-ipo-flow-this-week-excelsoft-emerges-as-the-highlight/slideshow/125359460.cms",
            "description": "",
            "pubDate": "2025-11-16T07:50:33.700324"
        },
        {
            "title": "These 10 Penny stocks surged up to 65% in just a month, do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-10-penny-stocks-surged-up-to-65-in-just-a-month-do-you-own-any/slideshow/125359430.cms",
            "description": "Over the past 1 month, 10 penny stocks have posted notable gains, rising between 20% and 65%. Among them, three delivered exceptional returns of over 40%. These standout performers were identified through a focused screening strategy: each had a market capitalisation under Rs 1,000 crore, a share price below Rs 20, and a minimum recent trading volume of 5 lakh shares. This method aims to spotlight low-priced, actively traded small-cap stocks with strong price momentum. (Data Source: ACE Equity)",
            "pubDate": "2025-11-16T07:50:33.700416"
        },
        {
            "title": "Two Trades for Today: An energy major for an upmove of 5.4%, a large-cap health insurance stock for an almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-energy-major-for-an-upmove-of-5-4-a-large-cap-health-insurance-stock-for-an-almost-7-gain/articleshow/125364987.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-16T15:38:50.724452"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/125363688.cms",
            "description": "This week, the Indian stock markets celebrated a bright finish with significant upward momentum, driven primarily by technology and pharmaceutical shares. Positive indicators from the US economy and impressive earnings from local firms instilled a sense of confidence among investors. The recent favorable outcomes from an important state election further amplified the optimistic mood.",
            "pubDate": "2025-11-16T15:38:50.724571"
        }
    ]
}