{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-09T08:42:44.582992",
    "items": [
        {
            "title": "HUL, other FMCG stocks tumble after Godrej Consumer Q3 business update weakened sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-other-fmcg-stocks-tumble-after-godrej-consumer-q3-business-update-weakened-sentiment/articleshow/116127376.cms",
            "description": "HUL saw its sharpest drop in six weeks on Monday, leading the Nifty FMCG index to become the day's worst-performing sector, sliding over 2%. Godrej Consumer Products took the hardest hit, plummeting more than 11%. Other FMCG stocks also declined, with Dabur, Marico, Tata Consumer Products, Britannia, and Colgate shedding between 2% and 5%.",
            "pubDate": "2024-12-09T08:20:09.580289"
        },
        {
            "title": "Mishtann Foods plummets 20% as Sebi ban triggers extended selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mishtann-foods-plummets-20-as-sebi-ban-triggers-extended-sell-off/articleshow/116126571.cms",
            "description": "Mishtann Foods Share Price: Mishtann Foods extended its lower circuit streak after Sebi directed the company to recover nearly ₹100 crore allegedly siphoned off through dubious transactions. Sebi accused the company of circular trading involving fictitious buyers and suppliers, many of which were shell entities linked to its directors and associates.",
            "pubDate": "2024-12-09T08:20:09.580438"
        },
        {
            "title": "Primary play! 5 IPOs to watch out that are already sitting on Sebi approval",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/primary-play-5-ipos-to-watch-out-that-are-already-sitting-on-sebi-approval/slideshow/116123919.cms",
            "description": "The primary market has been hectic so far in 2024 and the near term looks equally promising with as many as 29 companies sitting on Sebi approvals. Of these, here are five IPOs that could be launched anytime soon in the next two to three months.",
            "pubDate": "2024-12-09T08:20:09.580548"
        },
        {
            "title": "Godrej Consumer shares fall 11% as Q3 business update leads to target price cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godrej-consumer-shares-fall-11-as-q3-business-update-leads-to-target-price-cuts/articleshow/116126411.cms",
            "description": "Godrej Consumer Products Share Price: Godrej Consumer shares dropped by up to 11% to Rs 1,104.20 on BSE following a weak Q3 business outlook, prompting brokerages to lower their target prices. The company highlighted a 20-30% year-on-year rise in palm oil and derivatives prices, which has affected its soaps category, contributing one-third of its standalone revenue.",
            "pubDate": "2024-12-09T08:20:09.580659"
        },
        {
            "title": "RITES shares soar 5% on winning $9.7 million order from Guyana",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rites-shares-soar-5-on-winning-9-7-million-order-from-guyana/articleshow/116125545.cms",
            "description": "RITES shares rose by up to 5% to Rs 309.85 on BSE after securing a $9.71 million contract for engineering services to upgrade the Palmyra to Moleson Creek Highway in Guyana. The company was selected as the top bidder for the project by the Ministry of Public Works, Government of Guyana.",
            "pubDate": "2024-12-09T08:20:09.580764"
        },
        {
            "title": "Blackstone-backed International Gemological Institute sets price band for Rs 4,225 crore IPO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blackstone-backed-international-gemological-institute-sets-price-band-for-rs-4225-crore-ipo/articleshow/116125319.cms",
            "description": "Blackstone-backed International Gemological Institute (IGI) India has set a price band of Rs 397-417 per share for its upcoming initial public offering (IPO), targeting a raise of Rs 4,225 crore. The three-day IPO will open for subscription on December 13 and close on December 17.",
            "pubDate": "2024-12-09T08:20:09.580860"
        },
        {
            "title": "Stock Radar: Down 20% from highs! PCBL breaks out of inverse Head & Shoulder pattern; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-down-20-from-highs-pcbl-breaks-out-of-inverse-head-shoulder-pattern-time-to-buy/articleshow/116107709.cms",
            "description": "The stock reached a high of Rs 584 on September 30, 2024, but dropped to Rs 467 by December 5, a decline of over 20%. While the 20% fall signals a bear grip, a recent breakout from an inverse Head & Shoulder pattern indicates a potential comeback by the bulls.",
            "pubDate": "2024-12-09T08:20:09.580954"
        },
        {
            "title": "CEAT shares surge 9% on Camso off-highway tyre acquisition",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ceat-shares-surge-9-on-camso-off-highway-tyre-acquisition/articleshow/116124749.cms",
            "description": "CEAT Share Price: CEAT's shares surged over 9% after announcing a $225 million acquisition of off-highway tire assets from Michelin.  This deal includes the Camso brand and two manufacturing facilities, boosting CEAT's presence in a high-margin sector. Brokerages predict significant EPS growth and view the acquisition positively, despite potential increased leverage.",
            "pubDate": "2024-12-09T08:20:09.581056"
        },
        {
            "title": "Top Nifty50 stocks analysts suggest buying in this volatile week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-nifty50-stocks-analysts-suggest-buying-in-this-volatile-week/articleshow/116124507.cms",
            "description": "Stock Reports Plus, powered by Refinitiv, is a comprehensive research report that evaluates five key components of 4,000+ listed stocks – earnings, fundamentals, relative valuation, risk, and price momentum – to generate standardized scores. The simple average of the above-mentioned five component ratings is normally distributed to reach an average score.",
            "pubDate": "2024-12-09T08:20:09.581152"
        },
        {
            "title": "Hot Stocks: Brokerages initiate coverage on PG Electroplast, Lloyds Metals & GHCL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hot-stocks-brokerages-initiate-coverage-on-pg-electroplast-lloyds-metals-ghcl/articleshow/116124033.cms",
            "description": "InCred has initiated an \"Add\" rating on Lloyd Metals with a target price of Rs 1,476, offering a 40% upside from Rs 1,050. Despite challenges in the iron ore sector, such as flawed policies and bidding practices, the company is well-positioned to benefit from rising prices, driving an expected 76% growth in EPS as it advances with expansion plans.",
            "pubDate": "2024-12-09T08:20:09.581255"
        },
        {
            "title": "Paytm shares up 3% to fresh 52-week high on nod to sale of PayPay stake for Rs 2,364 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-up-3-to-fresh-high-on-nod-to-sale-of-paypay-stake-for-rs-2364-crore/articleshow/116123929.cms",
            "description": "Paytm share price: Paytm shares hit a 52-week high after its Singapore unit agreed to sell its stake in PayPay for ₹2,364 crore.  The deal, expected to close by December 2024, will strengthen Paytm's financial position.  While the company reported a profit in Q2 FY25, its revenue declined year-on-year.",
            "pubDate": "2024-12-09T08:20:09.581356"
        },
        {
            "title": "Sensex marginally lower in early trade, Nifty below 24,700; FMCG cos drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-opens-marginally-lower-nifty-below-24700-godrej-consumer-falls-8-hul-3/articleshow/116123735.cms",
            "description": "The benchmark S&P BSE Sensex opened 47.34 points or 0.06% lower at 81,661.78, while the broader Nifty 50 index opened at 24,669.75, lower by 8.05 points or 0.03%.",
            "pubDate": "2024-12-09T08:20:09.581455"
        },
        {
            "title": "These 4 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-4-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/116123359.cms",
            "description": "As of December 6, there was a notable surge in futures open interest for four stocks in the NSE F&O stocks, contributing to a total increase in open interest of over 50% as compared to the previous trade. A significant uptick in futures open interest signifies a substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2024-12-09T08:20:09.581554"
        },
        {
            "title": "Stocks to buy today: Zomato, Tata Motors among top 9 trading ideas for 9 December, 2024",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-zomato-tata-motors-among-top-9-trading-ideas-for-9-december-2024/articleshow/116122925.cms",
            "description": "The Indian market is predicted to consolidate today, influenced by global trends. Nifty saw gains, closing at 24775.  Experts suggest a trading range between 24,200-25,200 for Nifty.  Stock recommendations include InterGlobe Aviation, REC, Zomato, Oberoi Realty, Tata Power, IRFC, Tata Motors, Kotak Mahindra Bank, and CESC, with specific target and stop-loss levels.",
            "pubDate": "2024-12-09T08:20:09.581652"
        },
        {
            "title": "At multi-year highs: These 4 stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-4-stocks-witness-5-year-swing-high-breakouts/slideshow/116122829.cms",
            "description": "In the Nifty200 pack, we have collated a list of four stocks that witnessed a 5-year swing high at the close on December 6, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2024-12-09T08:20:09.581747"
        },
        {
            "title": "Poonawalla Fincorp shares fall 3% after CTO steps down citing harassment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/poonawalla-fincorp-shares-in-focus-after-chief-technology-officer-steps-down-citing-harassment/articleshow/116122656.cms",
            "description": "Poonawalla Fincorp's CTO, Dhiraj Saxena, resigned, alleging harassment by the CHRO.  Saxena's resignation letter cited \"unnecessary interventions\" disrupting IT operations.  His departure follows recent leadership changes, including a new MD and CHRO. The company has yet to respond to the allegations.",
            "pubDate": "2024-12-09T08:20:09.581845"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-39/articleshow/116132732.cms",
            "description": "The Nifty and Sensex are in a sideways range today, but the market breadth makes it clear that the bulls are back. So, as an investor, having a bullish bias is just the right thing. But make sure you look at every sector and company in terms of both their operating and valuation matrices. If the operating matrix shows improvement, it’s okay to increase exposure. Our selected stocks today depict a strong upward trajectory in their overall average score which is based on five key pillars – earnings, fundamentals, relative valuation, risk, and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2024-12-09T08:42:43.920348"
        }
    ]
}