{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-01T15:53:31.476584",
    "items": [
        {
            "title": "Sensex jumps over 600 points to break 8-day losing streak. What was the good news in RBI policy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-600-points-to-break-8-day-losing-streak-what-was-the-good-news-in-rbi-policy/articleshow/124250107.cms",
            "description": "Dalal Street celebrated the RBI's expected 'dovish pause' and Governor Malhotra's pro-market initiatives, ending an 8-day losing streak. Sensex surged over 600 points as RBI allowed banks to fund M&A, liberalized loans against shares, and reduced risk weights for infrastructure financing. These measures, coupled with optimistic GDP and inflation forecasts, significantly boosted market sentiment, especially for banking and infrastructure stocks.",
            "pubDate": "2025-10-01T06:57:02.752944"
        },
        {
            "title": "10 Small-cap stocks trading below 5-Year average P/E — rallying up to 100%! Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-small-cap-stocks-trading-below-5-year-average-p/e-rallying-up-to-100-do-you-own-any/slideshow/124250288.cms",
            "description": "There are about 230 companies in the BSE smallcap segment whose current trailing twelve-month Price-to-Earnings (P/E) ratios are trading lower than their five-year average P/E. This situation can often indicate that these stocks are undervalued compared to their historical valuations. Interestingly, in just the last three months, the share prices of 10 small-cap stocks from the list have already risen sharply, increasing in the range of 15% to 100%.At first glance, this seems like a strong hint that the broader small-cap segment could be undervalued and attractive for investors. However, valuations alone do not guarantee profitable investments. A lower P/E ratio compared to history is simply an entry point for further analysis—it does not automatically mean that the stock is a good buy. Other factors such as the company’s fundamentals, sector outlook, balance sheet strength, corporate governance, and overall economic conditions must also be considered. (Data Source: ACE Equity)",
            "pubDate": "2025-10-01T06:57:02.753076"
        },
        {
            "title": "RBI hikes limit for loan against shares to Rs 1 crore, IPO financing to Rs 25 lakh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-hikes-limit-for-loan-against-shares-to-rs-1-crore-ipo-financing-to-rs-25-lakh/articleshow/124249397.cms",
            "description": "RBI raises credit limits: Loan against shares ceiling hiked from Rs 20 lakh to Rs 1 crore, and IPO financing limit increased to Rs 25 lakh. Governor Sanjay Malhotra said these measures, part of five steps to boost credit, follow a 100-bps rate cut in 2025.",
            "pubDate": "2025-10-01T06:57:02.753185"
        },
        {
            "title": "Amul, a national brand may never get listed: Next best way, a basket of regional brands. 4 dairy stocks with upside potential of up to 25%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/amul-a-national-brand-may-never-get-listed-next-best-way-a-basket-of-regional-brands-4-dairy-stocks-with-upside-potential-of-up-to-25/articleshow/124248829.cms",
            "description": "Did you know that India is the largest producer – and consumer – of ghee, or clarified butter? The market is estimated to be worth around Rs. 70,000 crore. But less than 10% of that is manufactured by the organised sector. Now, among the big gainers in the GST rate rationalisation were milk and milk products like ghee and paneer. So what does that mean for the listed entities from the dairy sector? Are they major gainers? Yes, they are. But in more ways than you imagined.",
            "pubDate": "2025-10-01T06:57:02.753290"
        },
        {
            "title": "RBI MPC Outcome: PSU bank stocks slide up to 1.5% after RBI holds rates steady at 5.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-mpc-outcome-psu-bank-stocks-slide-up-to-1-5-after-rbi-holds-rates-steady-at-5-5/articleshow/124249257.cms",
            "description": "PSU bank stocks fell up to 1.4% on Wednesday after RBI kept the repo rate unchanged at 5.5% and maintained a neutral stance. The Nifty PSU Bank index slipped 0.78% to 7,468, with Indian Bank, Canara Bank, and PNB among the top decliners. SBI and Bank of Baroda also dipped, despite RBI raising FY26 GDP growth forecast to 6.8%.",
            "pubDate": "2025-10-01T06:57:02.753414"
        },
        {
            "title": "Netweb Technologies shares surge 13% to record high, rally 170% in 6 months! Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/netweb-technologies-shares-surge-13-to-record-high-rally-170-in-6-months-heres-why/articleshow/124248957.cms",
            "description": "Shares of Netweb Technologies surged to a record Rs 4,108 on the NSE, up 13%, extending a rally of 80% in a month and 170% in six months. The stock’s momentum is driven by India’s digital infrastructure growth, AI adoption, data localisation policies, and major order wins, including Nvidia-powered server contracts and Tyrone GPU-accelerated AI systems.",
            "pubDate": "2025-10-01T06:57:02.753520"
        },
        {
            "title": "Anand Rathi Share and Stock Brokers shares rally 13% from IPO price in 2 days as investor demand stays strong",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/anand-rathi-share-and-stock-brokers-shares-rally-13-from-ipo-price-in-2-days-as-investor-demand-stays-strong/articleshow/124248898.cms",
            "description": "Anand Rathi shares surged up to 12.7% driven by strong retail participation and positive market sentiment. Intraday gains of 4.7% reflect investor optimism and confidence in the company’s growth outlook and fundamentals.",
            "pubDate": "2025-10-01T06:57:02.753623"
        },
        {
            "title": "Is the share market closed for Maha Navami holiday today?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/is-the-share-market-closed-for-maha-navami-holiday-today/articleshow/124248794.cms",
            "description": "On October 1, 2025, Indian stock and commodity markets are open for Maha Navami. Key October trading holidays and Diwali Muhurat session are noted; markets begin October cautiously ahead of RBI MPC meet.",
            "pubDate": "2025-10-01T06:57:02.753719"
        },
        {
            "title": "Tata Investment Corp shares surge over 45% in 7 sessions. Should you book profit or accumulate?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-corp-shares-surge-over-45-in-7-sessions-should-you-book-profit-or-accumulate/articleshow/124248751.cms",
            "description": "Tata Investment Corporation shares have surged over 45% in seven sessions, hitting a record Rs 10,611 on strong technical momentum and expectations of Tata Sons’ listing and Tata Capital IPO. Experts suggest holding or accumulating on dips amid near-term volatility.",
            "pubDate": "2025-10-01T06:57:02.753819"
        },
        {
            "title": "Fed’s Collins signals openness to more rate cuts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-collins-signals-openness-to-more-rate-cuts/slideshow/124248628.cms",
            "description": "Federal Reserve Bank of Boston President Susan Collins said she is open to further interest rate cuts, as price pressures are expected to ease sometime next year. (Source: Reuters)",
            "pubDate": "2025-10-01T06:57:02.753919"
        },
        {
            "title": "BMW Ventures shares list at sharp 21% discount to IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bmw-ventures-shares-list-at-sharp-21-discount-to-ipo-price/articleshow/124248170.cms",
            "description": "BMW Ventures shares debuted on Wednesday. The stock listed at a steep discount on both exchanges. It opened at Rs 78 on NSE and Rs 80 on BSE against the issue price of Rs 99. The Rs 231.66 crore IPO received moderate investor interest. Institutional buyers showed strong demand. Retail investors' participation was lukewarm. The company trades steel products and manufactures PVC pipes.",
            "pubDate": "2025-10-01T06:57:02.754015"
        },
        {
            "title": "Epack Prefab Technologies shares list at 10% discount to IPO price on exchanges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/epack-prefab-technologies-shares-list-at-10-discount-to-ipo-price-on-exchanges/articleshow/124247697.cms",
            "description": "Epack Prefab Technologies debuted at a discount on Wednesday, listing below its IPO price and grey market expectations. Despite healthy financial growth and a strong order book, analysts deemed its 34.5x earnings valuation expensive, leaving limited room for near-term upside. Investors will monitor its expansion plans and margin sustainability.",
            "pubDate": "2025-10-01T06:57:02.754111"
        },
        {
            "title": "Tata Motors demerger takes effect today. From record date to swap ratio, here’s what investors need to know",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-demerger-takes-effect-today-from-record-date-to-swap-ratio-heres-what-investors-need-to-know/articleshow/124247920.cms",
            "description": "Tata Motors’ demerger takes effect on October 1, splitting its commercial vehicle and passenger vehicle businesses into two listed entities. Shareholders will receive one share in the new CV company per existing share, with listings expected by mid-November, enabling independent valuation and trading.",
            "pubDate": "2025-10-01T06:57:02.754208"
        },
        {
            "title": "Jain Resource Recycling shares list at 14% premium over IPO price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jain-resource-recycling-shares-list-at-14-premium-over-ipo-price/articleshow/124247676.cms",
            "description": "Jain Resource Recycling debuted at a 14% premium, opening at Rs 265 against its Rs 232 IPO price. The Rs 1,250 crore IPO saw strong investor demand, subscribed 16.8 times overall. The non-ferrous metal recycler, despite rapid financial growth, faces challenges in sustaining growth and expanding its thin 3% net margin post-listing.",
            "pubDate": "2025-10-01T06:57:02.754321"
        },
        {
            "title": "Marlboro magic: How Godfrey Phillips shares doubled money in 2025 while ITC sulked in a corner",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/marlboro-magic-how-godfrey-phillips-shares-doubled-money-in-2025-while-itc-sulked-in-a-corner/articleshow/124247715.cms",
            "description": "Godfrey Phillips is challenging ITC's dominance in the Indian cigarette market, with Marlboro's aggressive rollout capturing younger, aspirational smokers. While ITC stock has fallen, Godfrey Phillips shares have seen a massive surge, driven by superior volume and revenue growth. This shift highlights rising competitive intensity and market share loss for the incumbent.",
            "pubDate": "2025-10-01T06:57:02.754427"
        },
        {
            "title": "Wall Street braces for US government shutdown",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-braces-for-us-government-shutdown/slideshow/124247738.cms",
            "description": "Wall Street is bracing for disruption if a U.S. government shutdown occurs, which could halt key economic data releases. Investors may have to rely on alternative data sources or take more defensive positions as volatility in asset prices is anticipated. There is growing concern that Friday’s monthly employment report may not be published as scheduled. (Source: Reuters)",
            "pubDate": "2025-10-01T06:57:02.754524"
        },
        {
            "title": "Small-caps for investors with ability to hold for more than 2 years: 8 stocks from different sectors with upside potential of up to 37%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/small-caps-for-investors-with-ability-to-hold-for-more-than-2-years-8-stocks-from-different-sectors-with-upside-potential-of-up-to-37/articleshow/124252261.cms",
            "description": "They say there is never a good time to buy a bad business, and there is never a bad time to buy a good one. But before we get to identifying what a good business is, let’s address a key question in terms of the markets. Why small-caps now? Especially when many large-caps are available at reasonable valuations? Yes, as a set of stocks, small-caps are more risky. So, what you need to do is not only manage risk, but also ensure the risk is being taken at the right time. Remember: The current correction has been taking place for more than a year now.",
            "pubDate": "2025-10-01T08:43:48.387700"
        },
        {
            "title": "Hyundai Motor India shares fall 3% on muted domestic sales in September",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hyundai-motor-india-shares-fall-3-on-muted-domestic-sales-in-september/articleshow/124252759.cms",
            "description": "InCred Equities expects Hyundai Motor India to see limited benefits from the GST rate cut, given its heavy reliance on SUVs, exports, and spares. The brokerage raised FY26F–28F sales estimates by just 3%, versus higher industry upgrades, citing weaker exposure to compact cars. Valuations are now 26% above Maruti Suzuki’s. Hyundai shares have risen 50% in six months.",
            "pubDate": "2025-10-01T08:43:48.387832"
        },
        {
            "title": "Sensex, Nifty snap 8-day losing streak. Here are top factors behind the rally today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-snap-8-day-losing-streak-here-are-top-factors-behind-the-rally-today/articleshow/124251692.cms",
            "description": "Indian markets rebounded on October 1 after eight sessions of losses. The Reserve Bank of India maintained repo rates, revising inflation forecasts lower. This decision supported investor confidence. Bank stocks saw gains as RBI increased loan limits. The Indian rupee strengthened against the US dollar. Falling crude oil prices and positive global cues also contributed to the market surge.",
            "pubDate": "2025-10-01T08:43:48.388054"
        },
        {
            "title": "Charts don’t lie! Inside Dalal Street’s stark underperformance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/charts-dont-lie-inside-dalal-streets-stark-underperformance/articleshow/124251149.cms",
            "description": "India's stock market lags global markets. Valuations are high, and earnings growth is slow. US-India trade issues also affect investor interest. Recent GST cuts and interest rate reductions could provide some support. However, a large earnings improvement is not likely this year. The market may move sideways. Stock picking offers opportunities for investors.",
            "pubDate": "2025-10-01T08:43:48.388160"
        },
        {
            "title": "Deep dive: How reforms & earnings rebound can trigger a market rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/deep-dive-how-reforms-earnings-rebound-can-trigger-a-market-rally/articleshow/124250968.cms",
            "description": "India's Nifty has significantly underperformed global markets over the past year, dropping 3.6% while others soared. This follows a post-Covid boom driven by retail investors and strong earnings, which led to stretched valuations. Corporate earnings growth also slowed to 5%.",
            "pubDate": "2025-10-01T08:43:48.388278"
        },
        {
            "title": "Tata Motors sets October 14 as record date for demerger of CV business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-sets-october-14-as-record-date-for-demerger-of-cv-business/articleshow/124250739.cms",
            "description": "Tata Motors fixed October 14, 2025, as the record date for its commercial vehicles demerger. Shareholders will receive one TMLCV share for each Tata Motors share. This restructuring aims for distinct business operations. The new commercial vehicle entity will list on BSE and NSE. This demerger may bring market rebalancing.",
            "pubDate": "2025-10-01T08:43:48.388380"
        },
        {
            "title": "HUDCO, PFC, and Ireda shares jump up to 5% as RBI eases infrastructure financing norms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hudco-pfc-and-ireda-shares-jump-up-to-5-as-rbi-eases-infrastructure-financing-norms/articleshow/124250494.cms",
            "description": "Infrastructure financing stocks surged over 5% after the RBI reduced risk weights on NBFC lending to infrastructure projects, aiming to lower financing costs. Concurrently, the RBI kept the repo rate unchanged at 5.5%, revised FY26 inflation downward to 2.6%, and raised the FY26 GDP growth forecast to 6.8%.",
            "pubDate": "2025-10-01T08:43:48.388480"
        },
        {
            "title": "Tata Motors shares rally 5% as demerger takes effect; record date announced",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-shares-rally-5-as-demerger-takes-effect-record-date-announced/articleshow/124254058.cms",
            "description": "Tata Motors shares rose sharply after the company’s demerger took effect from October 1, with October 14 set as the record date for shareholders. The restructuring, involving TML Commercial Vehicles and passenger vehicles, aims at a sharper business focus and unlocking long-term value.",
            "pubDate": "2025-10-01T09:44:12.018642"
        },
        {
            "title": "RBI proposes higher lending limits against shares, IPOs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-proposes-higher-lending-limits-against-shares-ipos/articleshow/124253475.cms",
            "description": "The Reserve Bank of India has proposed sweeping changes to expand banks’ role in capital market lending. The central bank has proposed removing the regulatory ceiling on loans against listed securities and raising the individual lending limit from Rs 20 lakh to Rs 1 crore.",
            "pubDate": "2025-10-01T09:44:12.018768"
        },
        {
            "title": "European shares flat as healthcare gains counter broader market weakness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-flat-as-healthcare-gains-counter-broader-market-weakness/articleshow/124253299.cms",
            "description": "European shares were flat on Wednesday, with gains in heavyweight healthcare stocks offsetting the decline in the broader market, as investors fretted over a potential delay in the closely-watched U.S. jobs data.",
            "pubDate": "2025-10-01T09:44:12.018993"
        },
        {
            "title": "Nikkei ends at three-week low on profit-taking as second half of fiscal year begins",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nikkei-ends-at-three-week-low-on-profit-taking-as-second-half-of-fiscal-year-begins/articleshow/124253180.cms",
            "description": "Japan's Nikkei share average ended at a three-week low on Wednesday in a broad sell-off as investors booked profits from the latest rally at the start of the second half of the fiscal year.",
            "pubDate": "2025-10-01T09:44:12.019092"
        },
        {
            "title": "Nithin Kamath weighs in again on Zerodha strategy if weekly options scrapped",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nithin-kamath-weighs-in-again-on-zerodha-strategy-if-weekly-options-scrapped/articleshow/124257304.cms",
            "description": "Zerodha co-founder and CEO Nithin Kamath struck a calm note amid speculation that regulators may curb or even scrap weekly options trading — a move that could hit the brokerage’s revenues hard.",
            "pubDate": "2025-10-01T11:26:35.059289"
        },
        {
            "title": "​How to calculate the sales to cash flow ratio",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/how-to-calculate-the-sales-to-cash-flow-ratio/slideshow/124257475.cms",
            "description": "The Sales to Cash Flow Ratio compares a company’s sales revenue to its operating cash flow. It helps assess how efficiently a company turns sales into actual cash.Formula: Sales to Cash Flow Ratio = Sales Revenue / Operating Cash Flow",
            "pubDate": "2025-10-01T11:26:35.059426"
        },
        {
            "title": "CAMS board to meet on October 10 to consider stock split",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cams-board-to-meet-on-october-10-to-consider-stock-split/articleshow/124256945.cms",
            "description": "Computer Age Management Services (CAMS) has announced that its board of directors will meet on Friday, October 10, to consider a stock split aimed at altering the company’s share capital. The split ratio will be decided at the meeting.",
            "pubDate": "2025-10-01T11:26:35.059540"
        },
        {
            "title": "Sun TV shares soar 18% as RCB’s potential sale seen leading to re-valuation of its IPL team Sunrisers Hyderabad",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-tv-shares-soar-18-as-rcbs-potential-sale-seen-leading-to-re-valuation-of-its-ipl-team-sunrisers-hyderabad/articleshow/124256710.cms",
            "description": "Sun TV shares surged up to 18% as reports of a $2 billion valuation for RCB sparked optimism about higher valuations for Sunrisers Hyderabad, significantly boosting Sun TV’s balance sheet and market capitalisation outlook.",
            "pubDate": "2025-10-01T11:26:35.059649"
        },
        {
            "title": "Cash-Rich & Growing: 9 Midcap stocks with rising operating cash flow",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cash-rich-growing-9-midcap-stocks-with-rising-operating-cash-flow/slideshow/124256160.cms",
            "description": "Rising cash from operations shows that a company is generating more cash from its core business activities. From the NSE midcap segment pack, we highlight the top 10 companies whose cash from operations has grown consistently each year for the past five fiscal years, based on cash flow scans from StockEdge.com. This trend indicates stronger profitability, improved resource management, and a positive financial outlook. It also suggests these companies rely less on external funding to support their operations.",
            "pubDate": "2025-10-01T11:26:35.059760"
        },
        {
            "title": "US markets regulators start shuttering as government shutdown cuts federal funding",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-markets-regulators-start-shuttering-as-government-shutdown-cuts-federal-funding/articleshow/124262307.cms",
            "description": "U.S. market regulators began the process of furloughing workers on Wednesday as the federal government shut down after Congress failed to extend funding, curtailing key oversight functions, stymieing initial public offerings, and limiting some market and economic data.",
            "pubDate": "2025-10-01T15:52:23.837268"
        },
        {
            "title": "US Pfizer deal powers European health stocks as Trump policy haze clears",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-pfizer-deal-powers-european-health-stocks-as-trump-policy-haze-clears/articleshow/124261882.cms",
            "description": "European healthcare stocks jumped on Wednesday, mirroring moves in the United States, propelled by a deal between Pfizer and President Donald Trump to lower prescription drug prices in the Medicaid programme in exchange for tariff relief.",
            "pubDate": "2025-10-01T15:52:23.837397"
        },
        {
            "title": "Tata Investment, RBL Bank and 4 other stocks hit 52-week high; rally up to 55% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-investment-rbl-bank-and-4-other-stocks-hit-52-week-high-rally-up-to-55-in-a-month/slideshow/124258669.cms",
            "description": "On Wednesday, the benchmark Sensex jumped 716 points to close at 80,983. Amid the broader market rally, six stocks from the BSE 500 index soared to their 52-week highs — the highest levels they’ve reached in the past year. Such breakouts are generally seen by traders and investors as bullish indicators, suggesting strong upward momentum and the potential for continued gains.",
            "pubDate": "2025-10-01T15:52:23.837511"
        },
        {
            "title": "US stocks trade lower as government shutdown risks economic data delays",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-lower-after-weak-private-payrolls-data-government-shutdown/articleshow/124260555.cms",
            "description": "US stock indexes declined Wednesday as soft private payrolls data intensified bets on a Federal Reserve rate cut. A looming federal government shutdown further heightened market uncertainty, risking delays in crucial economic reports like nonfarm payrolls. While healthcare stocks gained, communication services and tech sectors saw declines, reflecting investor caution amidst a fragile economic mood.",
            "pubDate": "2025-10-01T15:52:23.837612"
        },
        {
            "title": "Shankar Sharma says India, US at lowest exposure in 30 years, remains bearish on indices",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shankar-sharma-india-us-at-lowest-exposure-in-30-years-remain-bearish-on-indices/articleshow/124259877.cms",
            "description": "Ace investor Shankar Sharma reports his lowest India and US equity exposure in 30 years, citing strong global and China performance. Despite successes, the US remains a narrow, challenging market with underperformance versus benchmarks.",
            "pubDate": "2025-10-01T15:52:23.837711"
        },
        {
            "title": "BSE NSE Holiday: Is the stock market shut or open on October 2 for Gandhi Jayanti, Dussehra?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-nse-holiday-is-the-stock-market-shut-or-open-on-october-2-for-gandhi-jayanti-dussehra/articleshow/124259180.cms",
            "description": "Indian equity markets will remain closed on October 2 for Dussehra and Gandhi Jayanti. October sees three additional trading holidays, including Diwali, with a special Muhurat session on October 21 for festive trading.",
            "pubDate": "2025-10-01T15:52:23.837810"
        },
        {
            "title": "As gold, silver soar, Gurmeet Chadha warns investors: ‘Don’t get carried away’. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-gold-silver-soar-gurmeet-chadha-warns-investors-dont-get-carried-away-heres-why/articleshow/124258746.cms",
            "description": "Amid rising global uncertainty, gold and silver have surged to multi‑year highs, driven by geopolitical tensions, potential U.S. rate cuts, and a weakening rupee. Experts advise cautious exposure of 5–10% in portfolios, noting precious metals’ long, cyclical trends. While momentum remains, profit‑booking and corrections are possible.",
            "pubDate": "2025-10-01T15:52:23.837909"
        },
        {
            "title": "Stock Radar: Anant Raj stock showing signs of bottoming out after falling 26% from highs; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-anant-raj-stock-showing-signs-of-bottoming-out-after-falling-26-from-highs-what-should-investors-do/articleshow/124255091.cms",
            "description": "Anant Raj Ltd is exhibiting strong bullish momentum, prompting experts to recommend buying the stock for a target of Rs 920 within 3-4 weeks. The realty stock rallied over 34% last month, supported by bullish technical indicators like MACD and moving averages. While the RSI is overbought, a stop loss at Rs 620 is suggested for this uptrend.",
            "pubDate": "2025-10-01T15:52:23.838027"
        }
    ]
}