{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-01T03:12:18.545558",
    "items": [
        {
            "title": "Brace for a cold and windy 2026, follow the dharma of asset allocation: Nilesh Shah",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/brace-for-a-cold-and-windy-2026-follow-the-dharma-of-asset-allocation/articleshow/126280845.cms",
            "description": "CY25 saw precious metals surge while equities showed resilience and fixed income lagged. CY26 anticipates a volatile Test match for equities with moderate gains expected, driven by earnings growth and domestic buying. Gold and silver retain their positive outlook, while fixed income requires agile duration management. Investors should prioritize asset allocation, patience, and quality for long-term rewards.",
            "pubDate": "2026-01-01T01:03:12.098231"
        },
        {
            "title": "Why did Indian equities underperform global markets in 2025?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-did-indian-equities-underperform-global-markets-in-2025/articleshow/126280795.cms",
            "description": "Indian stock markets ended 2025 with modest single-digit gains, significantly trailing global peers like Korea and Brazil. While public sector banks and metals shone with impressive returns, consumer and technology stocks faced considerable selling pressure. This performance highlights a divergence in market trends, with specific sectors outperforming others.",
            "pubDate": "2026-01-01T01:03:12.098347"
        },
        {
            "title": "Stock Market Outlook 2026: Why blue-chip stocks are preferred equity bet for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-market-outlook-2026-why-blue-chip-stocks-are-preferred-equity-bet-for-investors/articleshow/126280737.cms",
            "description": "Money managers favor blue-chip stocks for 2026, anticipating foreign investor interest and better valuation comfort. While Nifty gained 10.5% in 2025, mid and small caps lagged. Experts predict Nifty and Sensex gains of 8-14% in 2026, with large caps expected to lead initially.",
            "pubDate": "2026-01-01T01:03:12.098541"
        },
        {
            "title": "Vodafone Idea shares in focus as Vodafone Group commits Rs 5,836 crore support",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-as-vodafone-group-commits-rs-5836-crore-support/articleshow/126281476.cms",
            "description": "Vodafone Idea shares will be in focus on January 1, 2026. The company will receive Rs 5,836 crore from its promoter group, Vodafone Group. This follows an amendment to an agreement concerning contingent liabilities. Vodafone Group Promoters will release Rs 2,307 crore over the next year. The remaining amount will be secured through a share-based mechanism.",
            "pubDate": "2026-01-01T03:12:08.826967"
        },
        {
            "title": "Positive Breakout: These 11 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-11-stocks-cross-above-their-200-dmas/slideshow/126281188.cms",
            "description": "As of December 31, 2025, 16 stocks in the Nifty 500 segment closed above their 200-day moving average (DMA). Of these, we have highlighted the top 11 stocks that posted gains of more than 1.5%, based on StockEdge’s technical scan data. The 200-day daily moving average (DMA) is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2026-01-01T03:12:08.827074"
        },
        {
            "title": "Stocks to buy for 2026: Shriram Finance, Engineers India among 5 stocks that could give 20-40% return in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-for-2026-shriram-finance-engineers-india-among-5-stocks-that-could-give-20-40-return-in-1-year/slideshow/126281063.cms",
            "description": "Brokerage houses continue to flag stock-specific opportunities across financials, engineering, infrastructure, and retail, backed by improving earnings visibility and strong execution trends.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-01T03:12:08.827192"
        },
        {
            "title": "MCX shares approach record date for first-ever 5:1 stock split tomorrow. What it means for the shareholders?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcx-shares-approach-record-date-for-first-ever-51-stock-split-tomorrow-what-it-means-for-the-shareholders/articleshow/126281031.cms",
            "description": "Investors looking to benefit from Multi Commodity Exchange's (MCX) first-ever 5:1 stock split must purchase shares by January 1, 2026. The split, effective January 2, 2026, will increase the number of shares held by shareholders fivefold while maintaining their total investment value. This corporate action aims to enhance stock liquidity and accessibility.",
            "pubDate": "2026-01-01T03:12:08.827284"
        },
        {
            "title": "New Year Stock Market Holiday for 2026: Are NSE, BSE closed today on 1 January; Check here",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/new-year-stock-market-holiday-for-2026-are-nse-bse-closed-today-on-1-january-check-here/articleshow/126280988.cms",
            "description": "NSE Holidays for New Year 2026: Domestic bourses NSE and BSE will remain open for trading on January 1, even as most of its major global peers will remain closed. Commodity exchanges MCX and NCDEX will be open during the day session but will remain closed in the evening session.",
            "pubDate": "2026-01-01T03:12:08.827374"
        },
        {
            "title": "GIFT Nifty up 60 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126280973.cms",
            "description": "Indian equity markets concluded 2025 with a 10% gain in the Nifty, signaling a year of gradual recovery. Analysts anticipate steady growth in 2026, driven by improving corporate earnings, a revival in private investment, and supportive government policies. The Nifty remains in a sideways trend, with key support and resistance levels identified.",
            "pubDate": "2026-01-01T03:12:08.827466"
        },
        {
            "title": "Stocks in news: Vodafone Idea, Hyundai India, RBL Bank, Adani Green, IndiGo",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-vodafone-idea-hyundai-india-rbl-bank-adani-green-indigo/articleshow/126280957.cms",
            "description": "Markets closed the year positively, with analysts favoring banking, auto, and metal stocks. Vodafone Idea will receive Rs 5,836 crore from its promoter. IndiGo anticipates carrying 10 million more passengers this year, while Hyundai India announced price hikes from January 1, 2026. Adani Green operationalized 307.4 MW power projects, and RBL Bank applied to cap foreign shareholding.",
            "pubDate": "2026-01-01T03:12:08.827560"
        },
        {
            "title": "Fund managers urge diversification amid AI and valuation concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fund-managers-urge-diversification-amid-ai-and-valuation-concerns/articleshow/126280922.cms",
            "description": "Indian equity investors look forward to a calmer 2026. The Nifty is expected to gain between 8-14 percent. This optimism stems from anticipated corporate earnings growth in the second half of the year. Foreign fund flows are also expected to revive. A trade deal with the US is also a key factor.",
            "pubDate": "2026-01-01T03:12:08.827648"
        },
        {
            "title": "High-conviction bets for 2026 with potential gains of 11–39%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/high-conviction-bets-for-2026-with-potential-gains-of-1139/articleshow/126280906.cms",
            "description": "Indian equities face an uncertain start to 2026 after a volatile 2025. While a recovery is expected, lingering trade deal doubts and a lack of new catalysts suggest a stock picker's market. Leading brokerages highlight high-conviction ideas with potential upside between 11.3% and 39%.",
            "pubDate": "2026-01-01T03:12:08.827735"
        }
    ]
}