{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-21T03:31:02.958298",
    "items": [
        {
            "title": "At multi-year highs: These 3 stocks witnessed 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-these-3-stocks-witnessed-5-year-swing-high-breakouts/slideshow/114410843.cms",
            "description": "In the NSE list of stocks with a market cap of over Rs 10,000 crore, we have collated a list of three stocks that witnessed a 5-year swing high at the close on October 21, suggesting bullishness in counters, according to stockedge.com's technical scan data. Take a look.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2024-10-21T03:30:42.379216"
        },
        {
            "title": "JM Financial shares in spotlight after RBI lifts restrictions on co’s non-banking unit",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jm-financial-shares-in-spotlight-after-rbi-lifts-restrictions-on-cos-non-banking-unit/articleshow/114410541.cms",
            "description": "Shares of JM Financial will be closely watched after the RBI lifted a ten-month ban on its subsidiary, JM Financial Products Ltd, allowing it to resume business activities tied to funding for shares and bonds following rectification of previous regulatory violations and governance issues.",
            "pubDate": "2024-10-21T03:30:42.379344"
        },
        {
            "title": "Kotak Bank shares in focus after Q2 profit rises 5% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kotak-bank-shares-in-focus-after-q2-profit-rises-5-yoy/articleshow/114410057.cms",
            "description": "Kotak Mahindra Bank Share Price: The bank's net interest income (NII) for Q2FY25 increased 11% YoY to Rs 7,020 crore, from Rs 6,297 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-21T03:30:42.379449"
        },
        {
            "title": "Bajaj Housing Finance shares in focus ahead of Q2 results today",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-housing-finance-shares-in-focus-ahead-of-q2-results-today/articleshow/114410021.cms",
            "description": "Continuing a trend seen in the previous two quarters, the AUM grew by Rs 5,480 crore during the September quarter. The company’s loan assets stood at nearly Rs 89,860 crore at the end of the September quarter, up from Rs 70,954 crore the previous year.",
            "pubDate": "2024-10-21T03:30:42.379549"
        },
        {
            "title": "Reliance Infra shares in spotlight as Rs 6,000 crore fundraising plan gets shareholders' nod",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infra-shares-in-spotlight-as-rs-6000-crore-fundraising-plan-gets-shareholders-nod/articleshow/114409987.cms",
            "description": "Reliance Infrastructure's plan to raise Rs 6,000 crore by preferential share issue and QIP receives 98% shareholder approval. The fundraising includes Rs 3,014 crore from preferential allotment and Rs 3,000 crore via QIP, aiming to expand operations, invest in subsidiaries, and reduce debt.",
            "pubDate": "2024-10-21T03:30:42.379646"
        },
        {
            "title": "Tech Mahindra shares likely in focus after reporting 153% YoY jump in Q2 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-tech-mahindra-shares-likely-in-focus-after-reporting-153-yoy-jump-in-q2-pat/articleshow/114391565.cms",
            "description": "While announcing the quarterly numbers, the Mahindra Group company also declared an interim dividend of Rs 15 per equity share and fixed November 1 as the record date for determining eligibility of shareholders.",
            "pubDate": "2024-10-21T03:30:42.379747"
        },
        {
            "title": "Stock to watch: Kotak Bank shares likely to remain in focus after reporting Q2 results",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-kotak-bank-shares-likely-to-remain-in-focus-after-reporting-q2-results/articleshow/114391651.cms",
            "description": "On a consolidated level, Kotak's PAT rose 13% YoY to Rs 5,044 crore. The total assets under management as of September-end were Rs 680,838 crore up 37% YoY over Rs 498,342 crore in Q2 of FY24.",
            "pubDate": "2024-10-21T03:30:42.379845"
        },
        {
            "title": "Jio Financial shares in focus on 3% YoY Q2 net profit jump",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jio-financial-shares-in-focus-on-3-yoy-q2-net-profit-jump/articleshow/114399910.cms",
            "description": "Jio Financial Share Price: Revenue from operations in the reported quarter stood at Rs 693.50 crore, up 14% over Rs 608.04 crore posted by the company in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-21T03:30:42.379939"
        },
        {
            "title": "Tata Consumer shares in focus after company's Q2 net profit beats Street's estimates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-consumer-shares-in-focus-after-companys-q2-net-profit-beats-streets-estimates/articleshow/114400040.cms",
            "description": "Tata Consumer Share Price: The revenue from operations in the reported quarter stood at Rs 4,214 crore, up 13% over Rs 3,734 crore posted by the company in the corresponding quarter of the previous financial year.",
            "pubDate": "2024-10-21T03:30:42.380034"
        },
        {
            "title": "RBL Bank shares likely to remain in focus as Q2 PAT declines 24% YoY",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-rbl-bank-shares-likely-to-remain-in-focus-as-q2-pat-declines-24-yoy/articleshow/114391489.cms",
            "description": "On a half-yearly basis, RBL Bank’s net profit also witnessed an increase of 2% YoY to Rs 594 crore and the NIMs were reported at 5.35%.",
            "pubDate": "2024-10-21T03:30:42.380129"
        },
        {
            "title": "PG Electroplast shares in focus on Rs 1,500 crore fundraise plans via QIP",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-to-watch-pg-electroplast-shares-in-focus-on-rs-1500-crore-fundraise-plans-via-qip/articleshow/114391431.cms",
            "description": "PG Electroplast Share Price: The company has further informed that the board also approved the draft notice for an extra-ordinary general meeting (EGM) to seek shareholder approval for issuing the securities through a special resolution.",
            "pubDate": "2024-10-21T03:30:42.380218"
        },
        {
            "title": "Stock Radar | Orient Cement rallies 16% rally in a week; time to buy?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-orient-cement-rallies-16-rally-in-a-week-time-to-buy/videoshow/114409659.cms",
            "description": "“Orient Cement stock has formed a Cup & Handle pattern on broader charts and once again caught up a renewed bullish momentum with a fresh breakout. Traders can buy for a target of Rs 390 in the next 5-6 weeks,” Shitij Gandhi, Senior Technical Analyst, SMC Global Securities, said.",
            "pubDate": "2024-10-21T03:30:42.380308"
        },
        {
            "title": "Big movers on D-Street: What should investors do with Jio Financial, Tata Consumer and ZEE?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-street-what-should-investors-do-with-jio-financial-tata-consumer-and-zee/articleshow/114409526.cms",
            "description": "Stocks that were in focus include names like Jio Financial, which rose 0.14%, Tata Consumer, which gained 0.6%, and ZEE, whose shares jumped 3.8% on Friday.",
            "pubDate": "2024-10-21T03:30:42.380393"
        },
        {
            "title": "GIFT Nifty up 20 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/114409208.cms",
            "description": "In the absence of any major triggers, market participants will focus on upcoming earnings for direction. In today's trade, shares of banking heavyweights HDFC Bank and Kotak Bank will be in focus following Q2 results.",
            "pubDate": "2024-10-21T03:30:42.380482"
        },
        {
            "title": "Stocks in news: Bajaj Housing, HDFC Bank, Kotak Bank, Jio Financial, Tata Consumer",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-bajaj-housing-hdfc-bank-kotak-bank-jio-financial-tata-consumer/articleshow/114409166.cms",
            "description": "The private sector lender reported Q2 profit growth of 5% year-on-year (YoY) to Rs 16,821 crore, which was above Street estimates.",
            "pubDate": "2024-10-21T03:30:42.380566"
        },
        {
            "title": "Asian shares in tight range, gold at record high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-in-tight-range-gold-at-record-high/articleshow/114409136.cms",
            "description": "Australian stocks gained, while Japanese equities slipped and Hong Kong equity futures signaled declines. US futures rose after the S&P 500 notched up a sixth straight weekly increase, its longest winning streak this year following a slew of corporate results and signs the world’s largest economy remains robust.",
            "pubDate": "2024-10-21T03:30:42.380691"
        }
    ]
}