{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-02T07:58:32.542347",
    "items": [
        {
            "title": "Swiggy to launch Rs 10,000 crore share sale next week: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/swiggy-plans-rs-10000-crore-share-sale-next-week/articleshow/125712970.cms",
            "description": "Indian food delivery giant Swiggy Ltd. is reportedly preparing to raise up to 100 billion rupees ($1.1 billion) from institutional investors as early as next week. The company has shortlisted Citigroup, JPMorgan Chase, and Kotak Mahindra to manage the potential share sale, which was approved by its board on November 7th.",
            "pubDate": "2025-12-02T07:58:11.041662"
        },
        {
            "title": "Ashok Leyland shares hit 52-week high, jump 4% in 2 days. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ashok-leyland-shares-hit-52-week-high-jump-4-in-2-days-heres-why/articleshow/125712927.cms",
            "description": "Ashok Leyland shares hit a new 52-week high on Tuesday, rising 2.7% to ₹164.50 and extending a two-day rally of nearly 4%. The stock is gaining on strong November sales and improving financial performance, which have boosted investor sentiment.",
            "pubDate": "2025-12-02T07:58:11.041782"
        },
        {
            "title": "China stocks attract fund managers amid economic uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/china-stocks-attract-fund-managers-amid-economic-uncertainty/slideshow/125710142.cms",
            "description": "China's CSI300 blue-chip index has matched the S&P 500 with roughly a 16% gain, while Hong Kong's Hang Seng Index is up about 30% year-to-date, on track for its best annual rise since 2017. Despite a less euphoric mood compared to last year's stimulus-driven rally, investors see room for continued growth. (Source: Reuters)",
            "pubDate": "2025-12-02T07:58:11.041898"
        },
        {
            "title": "RBI likely to cut repo rate by 25 bps in Dec amid low inflation, strong growth: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-likely-to-cut-repo-rate-by-25-bps-in-dec-amid-low-inflation-strong-growth-report/articleshow/125711479.cms",
            "description": "A report by CareEdge suggests the RBI may cut the repo rate by 25 basis points in December, citing a decadal low in inflation and strong growth momentum. With inflation projected to remain subdued and real policy rates above neutral, the central bank has room for a rate cut. Despite external challenges, India's external sector shows resilience.",
            "pubDate": "2025-12-02T07:58:11.041997"
        },
        {
            "title": "Wockhardt shares jump over 4%, extend two-day rally following FDA nod for Zaynich",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wockhardt-shares-jump-over-4-extend-two-day-rally-following-fda-nod-for-zaynich/articleshow/125711011.cms",
            "description": "Wockhardt Ltd shares jumped over 4% to ₹1,533, extending a two-day rally after surging nearly 20% on Tuesday. The rise follows the US FDA’s acceptance of its New Drug Application for Zaynich, a first-in-class antibiotic, marking the first NDA approval for a New Chemical Entity by an Indian pharma company.",
            "pubDate": "2025-12-02T07:58:11.042098"
        },
        {
            "title": "Aequs IPO opens tomorrow: Strong GMP signals robust investor interest. Should you subscribe?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aequs-ipo-opens-tomorrow-strong-gmp-signals-robust-investor-interest-should-you-subscribe/articleshow/125710964.cms",
            "description": "Belagavi-based Aequs Limited is launching its Rs 921.81 crore IPO on December 3, 2025, with strong grey market premium indicating investor enthusiasm. The precision engineering firm, serving aerospace and other sectors, aims to use IPO proceeds for debt repayment. Analysts recommend subscribing despite current losses, citing its integrated model and attractive valuation.",
            "pubDate": "2025-12-02T07:58:11.042195"
        },
        {
            "title": "Smallcaps hit pause after a 4-year rally. Is the turnaround finally here?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcaps-hit-pause-after-a-4-year-rally-is-the-turnaround-finally-here/articleshow/125710821.cms",
            "description": "Indian small-cap stocks have consolidated after a strong rally, facing headwinds like stretched valuations and tighter liquidity. However, easing macro pressures, improving earnings, and attractive valuations now present opportunities. Selective stock-picking in the small-cap space is poised to deliver strong long-term returns as the tide turns.",
            "pubDate": "2025-12-02T07:58:11.042288"
        },
        {
            "title": "Nifty to reach 29,300 by 2026 as D-St regains momentum, says Nomura; ICICI Bank, Infosys among top picks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nomura-projects-indias-nifty-rising-to-29300-by-2026-as-growth-recovers/articleshow/125710591.cms",
            "description": "Nomura forecasts Indian equities to climb 12% by end-2026, targeting the Nifty 50 at 29,300. This optimistic outlook is driven by calmer geopolitics, stable macros, and a recovering earnings cycle. The brokerage advises selective stock picking, favoring segments with muted expectations likely to improve.",
            "pubDate": "2025-12-02T07:58:11.042381"
        },
        {
            "title": "Tariff uncertainty clouds outlook as key US industries slip into contraction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tariff-uncertainty-clouds-outlook-as-key-us-industries-slip-into-contraction/slideshow/125709732.cms",
            "description": "US manufacturing contracted for the ninth consecutive month in November, reflecting a broad slowdown driven by slumping orders and rising input costs. Import tariffs continue to weigh heavily on producers, reinforcing a difficult environment for factories. (Source: Reuters)",
            "pubDate": "2025-12-02T07:58:11.042471"
        },
        {
            "title": "Why India's famous multibagger hunter Vijay Kedia is now chasing tortoise stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-indias-famous-multibagger-hunter-vijay-kedia-is-now-chasing-tortoise-stocks/articleshow/125709275.cms",
            "description": "Renowned investor Vijay Kedia is adopting a cautious approach, favoring 'tortoise stocks' like PSU banks and even Chinese ETFs over his usual 'cheetah stocks'. He believes the current market, despite record highs, lacks genuine excitement and offers limited opportunities for quick gains.",
            "pubDate": "2025-12-02T07:58:11.042564"
        },
        {
            "title": "BofA predicts 25bps Fed rate cut in December amid weak labor market",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bofa-predicts-25bps-fed-rate-cut-in-december-amid-weak-labor-market/slideshow/125709213.cms",
            "description": "BofA Global Research now anticipates a 25‑basis‑point rate cut at the Federal Reserve’s December meeting, reversing its earlier view that borrowing costs would remain unchanged. This revision is driven by signs of weakening labor market conditions and increasingly dovish signals from policymakers. (Source: Reuters)",
            "pubDate": "2025-12-02T07:58:11.042658"
        },
        {
            "title": "Sensex drops over 300 pts, Nifty below 26,100 as D-Street pauses record run",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-drops-over-150-pts-nifty-below-26200-as-d-street-pauses-record-run/articleshow/125708928.cms",
            "description": "Indian equities opened lower on Tuesday, with the Sensex and Nifty retreating from recent record highs. Investors engaged in profit-taking, while foreign funds continued to reduce their holdings, leading to a softer market sentiment. Both benchmarks had reached 14-month highs in the previous session before momentum faded.",
            "pubDate": "2025-12-02T07:58:11.042753"
        },
        {
            "title": "Vodafone Idea shares jump 4% on anticipation of AGR relief by year-end",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vodafone-idea-shares-in-focus-as-government-reviews-agr-relief-proposal/articleshow/125708878.cms",
            "description": "Vodafone Idea shares rose as the government nears a decision on its relief proposal for Adjusted Gross Revenue (AGR) dues. Union Telecom Minister Jyotiraditya Scindia indicated that recommendations could be announced in the coming weeks, following a careful evaluation of the Supreme Court's judgment and legal boundaries.",
            "pubDate": "2025-12-02T07:58:11.042854"
        },
        {
            "title": "Bharat Dynamics shares jump 2% on securing Rs 2,4612 crore order from the Indian Army",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bdl-shares-in-focus-on-securing-rs-24612-crore-order-from-the-indian-army/articleshow/125708848.cms",
            "description": "Bharat Dynamics shares: The company has secured additional defence orders worth ₹2,461.62 crore from the Indian Army since November 13, 2025, mainly for Anti-Tank Guided Missiles and Surface-to-Air Missiles under emergency procurement. The development is expected to keep the stock in focus on Tuesday.",
            "pubDate": "2025-12-02T07:58:11.042966"
        },
        {
            "title": "Indian Energy Exchange among 6 stocks showing bullish signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-energy-exchange-among-6-stocks-showing-bullish-signals/slideshow/125708828.cms",
            "description": "On December 1, among NSE-listed stocks with a market capitalization of over Rs 1,000 crore, nine stocks appeared on the bullish “White Marubozu” scanner, according to technical scan data from StockEdge.com. Of these, six stocks gained over 4%.A White Marubozu is a bullish candlestick pattern in technical analysis. It occurs when the opening price is the lowest for a given period, and the closing price is the highest. Represented by a long white (or green) candlestick with no upper shadow and a small or nonexistent lower shadow, it indicates strong buying pressure throughout the session. Traders interpret it as a signal that buyers were in control from the opening to the closing, often using such patterns to make informed decisions about future price movements.",
            "pubDate": "2025-12-02T07:58:11.043058"
        },
        {
            "title": "Aditya Birla Capital shares likely in focus after co plans Rs 300-cr rights issue for housing finance arm",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/aditya-birla-capital-shares-likely-in-focus-after-co-plans-rs-300-cr-rights-issue-for-housing-finance-arm/articleshow/125708745.cms",
            "description": "Aditya Birla Capital shares: The company has launched a ₹300-crore rights issue to strengthen its housing finance subsidiary and support growth. The stock recently hit a 52-week high and has surged 83% over the past year, valuing the company at ₹93,031 crore. It currently trades at a P/E of 28.67, reflecting investor confidence in its earnings potential.",
            "pubDate": "2025-12-02T07:58:11.043156"
        }
    ]
}