{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-06T20:23:56.866012",
    "items": [
        {
            "title": "BEL, Ideaforge shares jump up to 3% as DAC approves projects worth Rs 67,000 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bel-ideaforge-shares-jump-up-to-3-as-dac-approves-projects-worth-rs-67000-crore/articleshow/123133681.cms",
            "description": "The Defence Acquisition Council (DAC), chaired by Defence Minister Rajnath Singh, has approved proposals for the procurement of indigenous Medium Altitude Long Endurance (MALE) drones, autonomous surface vessels, mountain radars, and upgrades to infantry combat vehicles and air defence systems.",
            "pubDate": "2025-08-06T05:27:15.026228"
        },
        {
            "title": "NCC shares jump nearly 5% despite YoY decline in Q1 PAT, revenue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncc-shares-jump-nearly-5-despite-yoy-decline-in-q1-pat-revenue/articleshow/123132955.cms",
            "description": "Despite reporting a decline in both profit and revenue for Q1 FY26, NCC Ltd's shares surged due to a robust order book, which grew 33% YoY to Rs 70,087 crore. The company's strong order inflow of Rs 3,658 crore, a significant jump from the previous year, further fueled investor optimism.",
            "pubDate": "2025-08-06T05:27:15.026359"
        },
        {
            "title": "Negative Breakout: 9 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-9-stocks-cross-below-their-200-dmas/slideshow/123133280.cms",
            "description": "In the Nifty500 pack, nine stocks closed below their 200-day moving average (200 DMA) on August 5, according to technical scan data from stockedge.com. Trading below the 200 DMA is generally considered a bearish signal, as it suggests that a stock’s price has fallen below its long-term trend line. The 200 DMA is widely used by traders and analysts to assess the overall trend and momentum of a stock. Here's a look at the stocks:",
            "pubDate": "2025-08-06T05:27:15.026470"
        },
        {
            "title": "NCDEX gets in-principle Sebi nod to launch equities, derivatives; plans Rs 750 crore fundraise: Source",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ncdex-gets-in-principle-sebi-nod-to-launch-equities-derivatives-plans-rs-750-crore-fundraise-source/articleshow/123133087.cms",
            "description": "NCDEX has received in-principle approval from Sebi to launch its equity and equity derivatives segment, subject to certain conditions including maintaining robust commodity volumes and IT timelines. The exchange plans to invest ₹750 crore to develop the segment, starting with cash offerings. This move diversifies NCDEX's offerings and positions it against competitors like MSE, leveraging its rural penetration.",
            "pubDate": "2025-08-06T05:27:15.026571"
        },
        {
            "title": "Reliance Power shares down 31% in 1 month. Should you buy the dip or steer clear?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-power-shares-down-31-in-1-month-should-you-buy-the-dip-or-steer-clear/articleshow/123133023.cms",
            "description": "Reliance Power shares have plummeted 31% in a month amid regulatory scrutiny and Anil Ambani's ED questioning over alleged loan fraud. Technical indicators signal a bearish trend, with the stock trading below key moving averages. Analysts advise caution, suggesting investors avoid new entries and consider exiting existing positions until stability is confirmed, given the ongoing investigations and reputational risks.",
            "pubDate": "2025-08-06T05:27:15.026672"
        },
        {
            "title": "Oil India, Sundaram Finance among 8 stocks that closed above VWAP on Aug 5, 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/oil-india-sundaram-finance-among-8-stocks-that-closed-above-vwap-on-aug-5-2025/slideshow/123132714.cms",
            "description": "On August 4, the closing prices of eight stocks in the Nifty500 pack rallied over 1% relative to their VWAP (Volume Weighted Average Price), indicating a potential bullish trend, according to technical scan data from stockedge.com.When the closing price moves above the VWAP, it signifies that the stock closed higher than the average price at which it was traded throughout the day – an average weighted by trading volume. This is often interpreted as a bullish signal by traders and investors, potentially indicating strengthening market sentiment.Nifty500 Stocks Closing Above VWAP (Aug 4):",
            "pubDate": "2025-08-06T05:27:15.026777"
        },
        {
            "title": "Rich investors follow sell-on-rise mantra in Swiggy, 10 other stocks. Are you still buying?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rich-investors-follow-sell-on-rise-mantra-in-swiggy-10-other-stocks-are-you-still-buying/articleshow/123132480.cms",
            "description": "Despite market gains, HNIs booked profits in stocks like Swiggy and Waaree Energies, signaling a sell-on-rise strategy. While some analysts remain optimistic, profit booking and portfolio reshuffling may be driving HNI exits. Retail investors should note that even wealthy investors prioritize taking profits when stocks surge.",
            "pubDate": "2025-08-06T05:27:15.026879"
        },
        {
            "title": "NSDL shares list at 10% premium over issue price",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nsdl-shares-list-at-10-premium-over-issue-price/articleshow/123132304.cms",
            "description": "NSDL shares debuted on the stock exchanges on August 6, achieving a premium over the IPO price of Rs 800. The Rs 4,012 crore IPO witnessed substantial oversubscription, particularly from QIBs. NSDL, a key player in India's dematerialized securities market, reported revenue and profit growth in FY25, attracting long-term investors due to its institutional importance and dividend history.",
            "pubDate": "2025-08-06T05:27:15.026981"
        },
        {
            "title": "Pharma stocks in focus as Trump warns tariffs could hit 250%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pharma-stocks-in-focus-as-trump-warns-tariffs-could-hit-250/articleshow/123132409.cms",
            "description": "Pharma stocks such as Sun Pharma, Cipla, Dr Reddy’s Laboratories, Lupin, and others will be in focus on Wednesday after US President Donald Trump said tariffs on imported pharmaceuticals could rise to as high as 250%. The proposed tariffs would start at a lower rate but escalate over time, he said in a CNBC interview.",
            "pubDate": "2025-08-06T05:27:15.027079"
        },
        {
            "title": "UNO Minda, Schaeffler India among 5 stocks showing RSI Trending Up on August 5",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uno-minda-schaeffler-india-among-5-stocks-showing-rsi-trending-up-on-august-5/slideshow/123132383.cms",
            "description": "On August 5, five stocks from the NSE midcap pack appeared in the RSI Trending Up scan, based on data from stockedge.com. This scan indicates an uptrend when the Relative Strength Index (RSI) value crosses above 50 from below.\"RSI trending up\" means that the RSI values are increasing, signaling strengthening momentum in a stock's price. This can be interpreted as a potential bullish indicator and is often used by traders to identify possible buying opportunities.",
            "pubDate": "2025-08-06T05:27:15.027196"
        },
        {
            "title": "Sensex falls over 200 pts, Nifty below 24,600 after RBI keeps rates steady amid tariff uncertainty",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-rises-over-50-pts-nifty-above-24650-amid-investor-caution-ahead-of-rbi-mpc-rate-decision/articleshow/123132089.cms",
            "description": "Indian benchmark indices experienced a flat trade on Wednesday as the RBI maintained the repo rate at 5.5%. Market sentiment was further dampened by concerns over potential US tariffs on Indian goods, particularly pharmaceuticals, following President Trump's statements. Global markets also showed weakness due to concerns about the impact of tariffs on economic activity.",
            "pubDate": "2025-08-06T05:27:15.027291"
        },
        {
            "title": "Positive Breakout: These 10 stocks close cross above their 200 DMA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-10-stocks-close-cross-above-their-200-dma/slideshow/123132285.cms",
            "description": "In the Nifty500 pack, 10 stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on August 05, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-08-06T05:27:15.027386"
        },
        {
            "title": "At multi-year highs! JK Cement and 6 other stocks witness 5-year swing high breakouts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/at-multi-year-highs-jk-cement-and-6-other-stocks-witness-5-year-swing-high-breakouts/slideshow/123132171.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, seven stocks hit a 5-year swing high at the close on August 5, indicating bullish sentiment in these counters, according to technical scan data from stockedge.com.A 5-year swing high represents the highest price a stock has reached within a five-year period. This level often acts as a significant resistance point, where the price has historically struggled to move beyond. Hitting this level may be seen as a bullish signal, suggesting the potential for further upward movement. However, it's important to note that this differs from a 5-year breakout, which occurs when a stock’s price decisively surpasses a resistance level that has held firm for five years or more.",
            "pubDate": "2025-08-06T05:27:15.027480"
        },
        {
            "title": "Gujarat Gas shares in focus on reporting marginal dip in Q1 PAT",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gujarat-gas-shares-in-focus-on-reporting-marginal-dip-in-q1-pat/articleshow/123132032.cms",
            "description": "Gujarat Gas experienced a slight dip in PAT for Q1 FY26, reporting Rs 327 crore against Rs 330 crore YoY. Despite a revenue decrease to Rs 4,065 crore, EBITDA rose to Rs 579 crore. The company achieved record CNG sales, reaching 3.",
            "pubDate": "2025-08-06T05:27:15.027583"
        },
        {
            "title": "Smallcap stock in focus ahead of bonus issue record date. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stock-in-focus-ahead-of-bonus-issue-record-date-do-you-own/articleshow/123131970.cms",
            "description": "Murae Organisor's shares are in focus as today is the last day to qualify for its 1:10 bonus issue, with a record date set for August 7, 2025. Investors must own shares by today's close due to the T+1 settlement cycle to be eligible for the bonus shares. This corporate action aims to reward shareholders and improve stock liquidity.",
            "pubDate": "2025-08-06T05:27:15.027677"
        },
        {
            "title": "Stocks to buy in 2025 for long term: GMR Power, Epigral among 5 stocks that could give 15-50% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-gmr-power-epigral-among-5-stocks-that-could-give-15-50-return/slideshow/123132017.cms",
            "description": "Brokerages remain bullish on a diverse set of stocks across sectors, highlighting strong growth potential and attractive upside opportunities.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-08-06T05:27:15.027770"
        },
        {
            "title": "Auto stocks: Yes, headwinds in the short term, but will structural change become tailwinds and prove analysts wrong?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-stocks-yes-headwinds-in-the-short-term-but-will-structural-change-become-tailwinds-and-prove-analysts-wrong/articleshow/123134506.cms",
            "description": "While the Q1 earnings season has been a mixed bag, the auto sector would fall in the category of those that have not delivered any negative surprises. Now, does that mean you should start looking at them as investors? The answer is in a grey area. There is a transformation which is still underway, and like all other sectoral transformations, there will be some winners and some losers. One reason, however, to keep these stocks on a watchlist is that Indian auto majors hardly export any vehicles to the US, so the negative sentiment impacting other sectors will not hit them. At the same time, there is a headwind which may or may not become big. But the fact is that India's growth story is incomplete without the auto sector. So, eventually, the headwinds will not matter.",
            "pubDate": "2025-08-06T08:13:44.304257"
        },
        {
            "title": "Pidilite Industries board to meet today to consider first bonus issue in 15 years",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pidilite-industries-board-to-meet-today-to-consider-first-bonus-issue-in-15-years/articleshow/123137724.cms",
            "description": "Pidilite Industries’ board is meeting today to consider its first bonus share issue in 15 years and a special interim dividend for FY26. The outcome, including dividend quantum and bonus ratio, will follow post-meeting. The move highlights management’s confidence and aims to boost liquidity. Shares traded flat ahead of announcement.",
            "pubDate": "2025-08-06T08:13:44.304388"
        },
        {
            "title": "Deven Choksey backs PB Balaji as ideal leader for JLR, urges caution on defence stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/deven-choksey-backs-pb-balaji-as-ideal-leader-for-jlr-urges-caution-on-defence-stocks/slideshow/123137024.cms",
            "description": "Deven Choksey, in an interview with ET Now, affirmed that PB Balaji is a fitting choice to lead JLR. At Tata Motors, Balaji inherited a challenging situation but successfully restructured operations. Under his financial leadership, the passenger vehicle (PV) segment witnessed strong growth, and the commercial vehicle (CV) business regained momentum. Importantly, JLR—once seen as the toughest piece—now stands to benefit from Balaji’s turnaround expertise.",
            "pubDate": "2025-08-06T08:13:44.304524"
        },
        {
            "title": "European shares rise as investors buy dips, shrug off US tariff threats",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-rise-as-investors-buy-dips-shrug-off-us-tariff-threats/articleshow/123137573.cms",
            "description": "European shares extended gains on Wednesday as investors bought into recent market weakness, brushing aside fresh U.S. tariff threats and digesting a mixed batch of corporate earnings.",
            "pubDate": "2025-08-06T08:13:44.304636"
        },
        {
            "title": "M&B Engineering shares jump 9% after flat listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mb-engineering-shares-jump-9-after-flat-listing/articleshow/123137499.cms",
            "description": "M&B Engineering shares rose nearly 9% on NSE post a flat listing. Its Rs 650 crore IPO saw strong demand across investor segments. The company, operating in pre-engineered buildings and roofing solutions, plans to use proceeds for expansion, debt repayment, and IT upgrades. FY25 net profit surged 69% YoY.",
            "pubDate": "2025-08-06T08:13:44.304738"
        },
        {
            "title": "Japan's Nikkei rises as US economic worries recede",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-rises-as-us-economic-worries-recede/articleshow/123137323.cms",
            "description": "\"Investors bought stocks because the gains of the Nikkei in the previous session were not enough to recoup declines on Monday,\" said Naoki Fujiwara, a senior fund manager at Shinkin Asset Management.",
            "pubDate": "2025-08-06T08:13:44.304892"
        },
        {
            "title": "Trent in oversold zone after 36% fall from peak: What trade to make ahead of Q1?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-in-oversold-zone-after-36-fall-from-peak-what-trade-to-make-ahead-of-q1/articleshow/123137308.cms",
            "description": "Trent shares are under focus ahead of Q1FY26 results, down 36% from peak but showing early signs of recovery. Analysts expect a technical pullback, though earnings may be mixed. Strong topline growth is likely, driven by Zudio expansion, but profitability could be hit due to higher costs and lower margins.",
            "pubDate": "2025-08-06T08:13:44.305024"
        },
        {
            "title": "Sri Lotus Developers shares surge 4% after a strong market debut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sri-lotus-developers-shares-surge-4-after-a-strong-market-debut/articleshow/123137230.cms",
            "description": "The stock debuted on the BSE at ₹179.10, registering a 19.4% gain over its IPO price of ₹150. On the NSE, it opened at ₹178, indicating an 18.7% premium.",
            "pubDate": "2025-08-06T08:13:44.305124"
        },
        {
            "title": "Cathay Pacific warns of declining airfares and uncertain cargo outlook, shares tumble 10%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cathay-pacific-warns-of-declining-airfares-and-uncertain-cargo-outlook-shares-tumble-10/articleshow/123137050.cms",
            "description": "Cathay Pacific Airways on Wednesday warned of declining airfares, challenges at its budget carrier and uncertain cargo market conditions, sending its shares down more than 10% after it posted a slight rise in first-half profit.",
            "pubDate": "2025-08-06T08:13:44.305217"
        },
        {
            "title": "Trump’s Tariff Strategy: Reshaping the pharma and tech supply chain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trumps-tariff-strategy-reshaping-the-pharma-and-tech-supply-chain/slideshow/123135906.cms",
            "description": "President Donald Trump announced that the U.S. would impose a “small tariff” on pharmaceutical imports initially, which would rise to 150% within 18 months and eventually reach 250%. This move is part of his broader plan to encourage domestic manufacturing in the pharmaceutical sector. (Source: Reuters)",
            "pubDate": "2025-08-06T08:13:44.305321"
        },
        {
            "title": "Reliance Infra, Reliance Power sink up to 19% in 6 sessions amid Rs 17,000 cr loan fraud probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/reliance-infra-reliance-power-sink-up-to-19-in-6-sessions-amid-rs-17000-cr-loan-fraud-probe/articleshow/123135450.cms",
            "description": "Shares of Reliance Infrastructure and Reliance Power have tumbled up to 19% over the past six trading sessions amid an ongoing investigation into an alleged Rs 17,000 crore loan fraud involving the Anil Ambani-led companies.",
            "pubDate": "2025-08-06T08:13:44.305418"
        },
        {
            "title": "Gland Pharma shares rally 6% as brokerages lift ratings, target prices; here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gland-pharma-shares-rally-6-as-brokerages-lift-ratings-target-prices-heres-why/articleshow/123135300.cms",
            "description": "Gland Pharma shares surged after strong Q1 results and positive commentary from brokerages citing a turnaround at its European unit Cenexi. EBITDA margins expanded to 24.4%, and net profit rose 50% YoY. Despite weak U.S. sales, growth in Europe and new launches supported the outlook. Brokerages raised earnings estimates and targets, expecting further gains as Cenexi scales profitability.",
            "pubDate": "2025-08-06T08:13:44.305538"
        },
        {
            "title": "8 stocks go ex-dividend on August 7. Is your portfolio ready?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/8-stocks-go-ex-dividend-on-august-7-is-your-portfolio-ready/articleshow/123134982.cms",
            "description": "Dividend-seeking investors have a busy day as August 6 is the last trading session to buy shares of companies declaring payouts with a record date of August 7. Notable names include Avanti Feeds, PI Industries, and DISA India, offering hefty dividends. Realty, financials, and other dividend-yielding stocks may see heightened activity ahead of the cut-off.",
            "pubDate": "2025-08-06T08:13:44.305638"
        },
        {
            "title": "Wegovy maker Novo Nordisk to reduce costs after $95 billion stock loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wegovy-maker-novo-nordisk-to-reduce-costs-after-95-billion-stock-loss/articleshow/123134798.cms",
            "description": "Wegovy-maker Novo Nordisk said on Wednesday it will sharpen its commercial focus and reduce costs, after a major profit warning and new CEO announcement last week wiped some $95 billion of value from the company's stock.",
            "pubDate": "2025-08-06T08:13:44.305730"
        },
        {
            "title": "Rate-sensitive stocks fall up to 4% after RBI holds rates, maintains neutral policy stance",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rate-sensitive-stocks-fall-up-to-4-after-rbi-holds-rates-maintains-neutral-policy-stance/articleshow/123134643.cms",
            "description": "Rate-sensitive stocks fell on Wednesday after the RBI kept the repo rate unchanged at 5.5% and maintained its neutral stance, signaling stable growth and easing inflation. The Bank Nifty slipped 0.2%, while the Nifty Realty index dropped 2.3%. Broader financials also weakened, with PSU banks, financial services, and NBFC-focused indices all ending lower post-policy announcement.",
            "pubDate": "2025-08-06T08:13:44.305824"
        },
        {
            "title": "BSE, other capital market stocks fall up to 3% for second straight day amid regulatory concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bse-other-capital-market-stocks-fall-up-to-3-for-second-straight-day-amid-regulatory-concerns/articleshow/123134135.cms",
            "description": "BSE shares led the losses, falling 3.2% to an intraday low of ₹2,921.30. Angel One followed with a 2% decline, while CDSL shares slipped 2.7% to ₹1,524.20.",
            "pubDate": "2025-08-06T08:13:44.305918"
        },
        {
            "title": "Godfrey Phillips shares surge 16% in 2 days, hit 52-week high. Here's why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godfrey-phillips-shares-surge-16-in-2-days-hit-52-week-high-heres-why/articleshow/123138481.cms",
            "description": "Shares of Godfrey Phillips India rallied 16.4% over the last two sessions after the company posted strong Q1 earnings and announced a bonus issue. In Wednesday’s trade, the stock jumped nearly 6% to hit a 52-week high of Rs 10,464.1 on the BSE.",
            "pubDate": "2025-08-06T08:46:39.477051"
        },
        {
            "title": "Ideaforge Technology shares crash 26% in a month. What should traders do now?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ideaforge-technology-shares-crash-26-in-a-month-what-should-traders-do-now/articleshow/123138023.cms",
            "description": "Ideaforge shares have plunged 26.4% in a month, entering a weak technical zone. Analysts are divided—some suggest staggered buying near support levels (Rs 420–440), while others warn of continued bearish pressure. Momentum indicators remain weak, and experts advise caution unless a clear reversal emerges.",
            "pubDate": "2025-08-06T08:46:39.477190"
        },
        {
            "title": "Mahindra to give Rs 400-500 cr ESOPs to 23,000 employees",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mahindra-to-give-rs-400-500-cr-esops-to-23000-employees/articleshow/123139070.cms",
            "description": "In an industry-first initiative, Mahindra & Mahindra is launching a one-time Employee Stock Ownership Plan (ESOP) for about 23,000 employees, including factory floor workers, as a reward for their contribution to the company's growth journey, Group CEO & MD Anish Shah said.",
            "pubDate": "2025-08-06T09:37:08.069470"
        },
        {
            "title": "Nazara Technologies board to consider bonus issue, stock split on Aug 12; stock jumps 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nazara-technologies-board-to-consider-bonus-issue-stock-split-on-aug-12-stock-jumps-2/articleshow/123138965.cms",
            "description": "Nazara Technologies shares rose after the company announced a board meeting on August 12 to consider a stock split and bonus share issue. The board will approve the company's financial results for the June '25 quarter during the meeting.",
            "pubDate": "2025-08-06T09:37:08.069596"
        },
        {
            "title": "Shanghai stocks hit highest level since 2021 on Sino-US trade deal hopes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shanghai-stocks-close-at-highest-since-late-2021-on-hopes-for-sino-us-trade-deal/articleshow/123138844.cms",
            "description": "Shanghai's stock market reached a 3.5-year high amid optimism for a US-China trade deal, fueled by Trump's positive comments. Gains were led by defense and coal sectors. Investors await clarity on trade negotiations and upcoming economic data, including trade figures and inflation, for further market direction. Hong Kong's Hang Seng Index saw minimal gains.",
            "pubDate": "2025-08-06T09:37:08.069805"
        },
        {
            "title": "Transrail Lighting shares soar 13% on Q1 profit surge, log best day since listing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/transrail-lighting-shares-soar-13-on-q1-profit-surge-log-best-day-since-listing/articleshow/123138695.cms",
            "description": "Shares of Transrail Lighting surged over 13% after the company reported a 105% YoY jump in Q1 net profit and strong order inflows. Revenue rose 81%, driven by robust execution in its core T&D segment. With a growing order book and bullish management commentary, the stock is now trading 76% above its IPO price after months of underperformance.",
            "pubDate": "2025-08-06T09:37:08.069917"
        },
        {
            "title": "Uber unveils $20 billion stock buyback plan as loyalty program boosts growth",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/uber-unveils-20-billion-stock-buyback-plan-as-loyalty-program-boosts-growth/articleshow/123141750.cms",
            "description": "Uber unveiled a $20 billion stock buyback program and forecast its third-quarter bookings above Wall Street estimates on Wednesday, as the ride-hailing and delivery services company benefits from growing adoption of its paid loyalty program.",
            "pubDate": "2025-08-06T11:19:17.815066"
        },
        {
            "title": "Market Wrap: Sensex drops 166 points, Nifty slips below 24,600 after RBI holds rates",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-drops-166-points-nifty-slips-below-24600-after-rbi-holds-rates/articleshow/123140513.cms",
            "description": "India’s benchmark indices Sensex and Nifty ended lower on Wednesday, dragged down by rate-sensitive stocks, after the Reserve Bank of India held key interest rates and stuck to a ‘neutral’ policy stance.",
            "pubDate": "2025-08-06T11:19:17.815190"
        },
        {
            "title": "10 healthcare stocks post over 10% sales & profit growth in June quarter; rally in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/10-healthcare-stocks-post-over-10-sales-amp-profit-growth-in-june-quarter-rally-in-fy26/slideshow/123140726.cms",
            "description": "In the healthcare sector, around 15 companies have reported over 10% year-on-year growth in both sales and net profit for the June quarter. The analysis includes only those stocks with a market capitalization above Rs 3,000 crore, ensuring focus on larger, more established players.Among these, 10 stocks have delivered double-digit price returns so far in FY26, reflecting strong investor confidence and positive market performance. However, it's worth noting that 3 stocks from the same group have posted negative returns during the same period. (Data Source: ACE Equity)",
            "pubDate": "2025-08-06T11:19:17.815298"
        },
        {
            "title": "F&O Radar | Deploy Bull Call Spread in Nifty to gain from bullish stance amid market volatility",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-bull-call-spread-in-nifty-to-gain-from-bullish-stance-amid-market-volatility/articleshow/123139803.cms",
            "description": "Nifty opened flat and faced early selling pressure, slipping to 24,600. Despite weak momentum, bulls defended key support levels. Technical charts indicate indecision, with a broader trading range between 24,200–25,200 zones in the near term.",
            "pubDate": "2025-08-06T11:19:17.815396"
        },
        {
            "title": "US stocks open higher on Fed rate cut hopes; earnings in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-on-fed-rate-cut-hopes-earnings-in-focus/articleshow/123143626.cms",
            "description": "Wall Street experienced a positive opening on Wednesday, fueled by persistent anticipation of Federal Reserve interest rate reductions. Investors are actively evaluating a new series of corporate earnings reports. The Dow Jones Industrial Average, S&P 500, and Nasdaq Composite all saw gains at the start of trading.",
            "pubDate": "2025-08-06T13:56:19.661977"
        },
        {
            "title": "Godfrey Phillips, Delhivery among 8 stocks hit 52-week high; rally up to 35% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/godfrey-phillips-delhivery-among-8-stocks-hit-52-week-high-rally-up-to-35-in-a-month/slideshow/123143562.cms",
            "description": "On Wednesday, the benchmark Sensex declined by 166 points to close at 80,543. Despite the broader market weakness, eight stocks from the BSE 500 Index touched their 52-week highs, marking their highest levels in the past year. These breakout moves are typically viewed by traders and investors as bullish signals, suggesting strong upward momentum and the potential for further gains.",
            "pubDate": "2025-08-06T13:56:19.662095"
        },
        {
            "title": "Frankenstein Monster: Aswath Damodaran says upcoming NYU bot in his name could out-fake scammers, gives Insta scam 'A-' grade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/frankenstein-monster-aswath-damodaran-says-upcoming-nyu-bot-in-his-name-could-out-fake-scammers-gives-insta-scam-a-grade/articleshow/123143160.cms",
            "description": "Aswath Damodaran warns about AI scams using his image. He highlights an Instagram scam and its flaws. Damodaran discusses an NYU AI project that mimics his work. He advises investors to be cautious and do their research. He emphasizes the importance of investor education. Damodaran believes regulators won't solve the problem. He urges investors to be aware of risks.",
            "pubDate": "2025-08-06T13:56:19.662209"
        },
        {
            "title": "Market volatility ahead? Waterfield’s Vipul Bhowar on sectors, valuations & what to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-volatility-ahead-waterfields-vipul-bhowar-on-sectors-valuations-what-to-buy/articleshow/123142484.cms",
            "description": "Vipul Bhowar of Waterfield Advisors says India’s equity markets remain resilient despite global headwinds. He highlights strong earnings, sectoral rotations, rising interest in alternatives, and selective midcap exposure. Investors should stagger entries, focus on fundamentals, and stay invested for the long term amid ongoing market consolidation.",
            "pubDate": "2025-08-06T13:56:19.662312"
        },
        {
            "title": "Stock Radar: Shyam Metalics breaks out from Cup & Handle formation to hit fresh highs; check target & stop loss for long positions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-shyam-metalics-breaks-out-from-cup-handle-formation-to-hit-fresh-highs-check-target-stop-loss-for-long-positions/articleshow/123117892.cms",
            "description": "Shyam Metalics Ltd, exhibiting a Cup & Handle breakout on weekly charts, reached new highs, signaling further potential upside. Experts suggest short-term traders consider buying with a target of Rs 1,100, supported by strong volume and positive MACD indicators. The stock's robust alignment across multiple timeframes indicates a bullish trend.",
            "pubDate": "2025-08-06T13:56:19.662412"
        },
        {
            "title": "Antfin likely to offload entire Rs 5,368 cr stake in Eternal via block deal: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/antfin-to-likely-offload-entire-rs-5368-cr-stake-in-eternal-via-block-deal-report/articleshow/123141829.cms",
            "description": "Antfin Singapore, an Ant Group affiliate, plans to sell its entire stake in Eternal. The sale involves 18.84 crore shares via a block deal. The floor price is set at Rs 285 per share. The deal is valued at approximately Rs 5,368 crore. This follows Antfin's recent exit from Paytm earlier this week. More details are awaited.",
            "pubDate": "2025-08-06T13:56:19.662507"
        },
        {
            "title": "Top 7 stocks with decreasing promoter pledge ratios",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-7-stocks-with-decreasing-promoter-pledge-ratios/slideshow/123144110.cms",
            "description": "",
            "pubDate": "2025-08-06T14:20:46.246132"
        },
        {
            "title": "Two Trades for Today: A life insurance major for a 4.85% upmove, a mid-cap diesel engine maker for almost 7% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-a-life-insurance-major-for-a-4-85-upmove-a-mid-cap-diesel-engine-maker-for-almost-7-rise/articleshow/123145596.cms",
            "description": "Technical analysis identifies select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-08-06T15:58:30.118210"
        },
        {
            "title": "Abu Dhabi-based IHC sells 1.83% stake in Adani Energy Solutions for Rs 1,737 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/abu-dhabi-based-ihc-sells-1-83-stake-in-adani-energy-solutions-for-rs-1737-crore/articleshow/123145441.cms",
            "description": "Abu Dhabi-based IHC divested a 1.83% stake in Adani Energy Solutions for Rs 1,737 crore through open market transactions, reducing its shareholding to 0.85%. This sale by IHC's affiliate, Envestcom Holding, follows a previous sale of Adani Enterprises shares in March.",
            "pubDate": "2025-08-06T15:58:30.118331"
        },
        {
            "title": "RBI keeps EMIs steady, inflation low | NSDL rallies | Reliance Power sinks- Two Sharp with ET",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-keeps-emis-steady-inflation-low-nsdl-rallies-reliance-power-sinks-two-sharp-with-et/videoshow/123145075.cms",
            "description": "RBI holds repo rate at 5.5%, keeping EMIs steady for now as inflation hits a 77‑month low. Markets close lower with rate‑sensitives, IT, and pharma under pressure. NSDL rallies 17% on debut, while Reliance Power extends its crash amid ED scrutiny.",
            "pubDate": "2025-08-06T15:58:30.118554"
        },
        {
            "title": "NDR InvIT Trust reports strong revenue growth and operational expansion in Q1 FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ndr-invit-trust-reports-strong-revenue-growth-and-operational-expansion-in-q1-fy26/articleshow/123144662.cms",
            "description": "NDR InvIT Trust reported a robust 35% year-on-year revenue increase, reaching ₹1,015.59 million in Q1 FY26, driven by high occupancy and strategic asset additions. The Trust's EBITDA improved significantly, and it declared a distribution of ₹1.825 per unit. Expanding its footprint to 15 cities with 37 logistics parks, NDR InvIT is poised to capitalize on India's growing warehousing sector.",
            "pubDate": "2025-08-06T15:58:30.118658"
        },
        {
            "title": "Multibagger or IBC - Part 18: This auto ancillary started with wheels. It now also powers wind & war",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-part-18-this-auto-ancillary-started-with-wheels-it-now-also-powers-wind-war/articleshow/123148750.cms",
            "description": "This auto ancillary is embedded deep inside the supply chains of global OEMs, yet rarely finds itself in the limelight. With 13 manufacturing units and clients across North America, Europe, and Asia, it plays a critical role in sectors ranging from commercial vehicles and agriculture to construction, defense, and renewable energy. FY25 brought a 4% revenue dip, but profitability surged 56% on cost controls, better product mix, and a subsidiary turnaround. This series on auto ancillary companies works with the assumption that, from the whole set of auto ancillary companies, some multibagger stocks will emerge. And some companies in this space risk going bankrupt.",
            "pubDate": "2025-08-06T20:23:54.746121"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/123146168.cms",
            "description": "The Indian stock market experienced a downturn on Wednesday. The Reserve Bank of India's decision to maintain interest rates impacted rate-sensitive stocks. BSE Sensex declined by 0.21 percent. NSE Nifty also saw a decrease of 0.31 percent. Analysts suggest the market showed resilience despite global trade concerns. Investors are closely watching key support levels. Market sentiments were largely bearish.",
            "pubDate": "2025-08-06T20:23:54.746246"
        },
        {
            "title": "Curb misleading claims, modernise onboarding and reporting: Sebi chief to portfolio managers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/curb-misleading-claims-modernise-onboarding-and-reporting-sebi-chief-to-portfolio-managers/articleshow/123145023.cms",
            "description": "Sebi chief Tuhin Kanta Pandey urged portfolio managers to embrace digital solutions for onboarding, reporting, and client engagement to maintain competitiveness. He cautioned against misleading performance claims, emphasizing the need for transparency and client education regarding risk-return trade-offs. The industry's growth necessitates upholding governance standards to preserve investor trust.",
            "pubDate": "2025-08-06T20:23:54.746761"
        }
    ]
}