{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-16T02:54:26.802234",
    "items": [
        {
            "title": "BluPine raises Rs 5,400 cr loan underwritten by Axis Bank",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/blupine-raises-rs-5400-cr-loan-underwritten-by-axis-bank/articleshow/126555124.cms",
            "description": "BluPine Energy, backed by Actis, has secured a significant ₹5,400 crore loan from Axis Bank. This long-term financing will support its renewable energy portfolio. The loan is secured against operating solar and wind assets. BluPine Energy is developing substantial renewable capacity in India. Proceeds will refinance existing borrowings, strengthening its financial position.",
            "pubDate": "2026-01-16T00:54:11.262158"
        },
        {
            "title": "Banks' credit-to-deposit ratio hits record 81.75% as mobilisation lags",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banks-credit-to-deposit-ratio-hits-record-81-75-as-mobilisation-lags/articleshow/126555068.cms",
            "description": "Indian banks' credit-to-deposit ratio hit an all-time high of 81.75% as of December 31, signaling pressure to attract deposits amid robust loan demand. This elevated ratio reflects challenges in deposit mobilization, with investors seeking higher returns elsewhere, and a lag in deposit growth compared to credit expansion.",
            "pubDate": "2026-01-16T00:54:11.262494"
        },
        {
            "title": "China’s $1.2 trillion windfall quietly seeps into global markets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/chinas-1-2-trillion-windfall-quietly-seeps-into-global-markets/articleshow/126555689.cms",
            "description": "China's record trade surplus is fueling massive private overseas investments, with companies and individuals now holding over $1 trillion in foreign assets. This shift from state control to private capital flows introduces risks of sudden reversals, especially with a strengthening yuan. The global financial system faces increased reliance on this Chinese-sourced liquidity.",
            "pubDate": "2026-01-16T02:54:19.098304"
        },
        {
            "title": "Stocks to Buy in 2026: Angel One, Groww among 5 picks for 15–30% long-term returns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2026-angel-one-groww-among-5-picks-for-1530-long-term-returns/slideshow/126545748.cms",
            "description": "A new round of brokerage recommendations highlights sustained optimism on select financial stocks, fintech platforms, and core infrastructure companies, even as markets remain selective on valuations and earnings visibilityWe have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2026-01-16T02:54:19.098425"
        },
        {
            "title": "GIFT Nifty down 5 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/126555269.cms",
            "description": "Domestic markets experienced a choppy session, ending marginally lower as stock-specific movements dominated amid the ongoing earnings season. Investors are now closely watching corporate results, potential India-US trade deal developments, and cues from the upcoming Budget, with analysts anticipating a sideways market trend.",
            "pubDate": "2026-01-16T02:54:19.098551"
        },
        {
            "title": "Stocks in news: RIL, Wipro, Jio Financial, Infosys, Angel One, Indian Hotels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-ril-wipro-jio-financial-infosys-angel-one-indian-hotels/articleshow/126555256.cms",
            "description": "Markets traded volatile, ending marginally lower amid mixed cues, with bulls defending the 100-day EMA support. Several companies like Reliance Industries, Wipro, and Infosys are in focus due to third-quarter results and other developments. Angel One reported a profit decline but approved an interim dividend and stock split.",
            "pubDate": "2026-01-16T02:54:19.098650"
        },
        {
            "title": "Asia shares near record high on AI optimism, dollar up on receding Fed cut bets",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-head-for-fourth-weekly-gain-on-tech/articleshow/126555221.cms",
            "description": "Asian stocks are on track for their best weekly run since May. Technology shares are reaching new highs, driven by strong investor interest in artificial intelligence. This surge follows positive news from Taiwan Semiconductor Manufacturing Company, boosting confidence in the tech sector. US and European markets also saw gains, with chipmakers performing exceptionally well.",
            "pubDate": "2026-01-16T02:54:19.098747"
        },
        {
            "title": "Moody's upgrades outlook for three key Adani Group firms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/moodys-upgrades-outlook-for-three-key-adani-group-firms/articleshow/126555202.cms",
            "description": "Moody's Ratings has upgraded the outlook for three Adani Group companies to stable. Adani Ports, Adani Transmission Step-One, and Adani Electricity Mumbai now have a stable outlook. This reflects improved liquidity and strong financial profiles. The companies are expected to maintain sufficient liquidity for operations and debt obligations over the next 18 months.",
            "pubDate": "2026-01-16T02:54:19.099034"
        }
    ]
}