{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-08T13:26:11.139907",
    "items": [
        {
            "title": "Tata Steel Q1 updates: India production flat YoY at 5.26 million tons on plant shutdowns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-q1-updates-india-production-flat-yoy-at-5-26-million-tons-on-plant-shutdowns/articleshow/122322357.cms",
            "description": "Tata Steel India’s crude steel output remained flat at 5.26 million tons in Q1FY26, while deliveries fell 4% YoY due to maintenance shutdowns at Jamshedpur and NINL. Overseas units showed mixed performance, with UK volumes down 12%.",
            "pubDate": "2025-07-08T13:25:49.183193"
        },
        {
            "title": "Jane Street aftermath: Sebi denies proposal to link options with cash positions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-aftermath-sebi-denies-proposal-to-link-options-with-cash-positions/articleshow/122321902.cms",
            "description": "Sebi has dismissed media reports suggesting a proposal to link options leverage to cash market positions. The regulator clarified no such change is being considered currently and reaffirmed its commitment to due regulatory process and transparency.",
            "pubDate": "2025-07-08T13:25:49.183324"
        },
        {
            "title": "Breakout Stocks: How to trade Jaiprakash Power Ventures, JM Financial & Divi’s Laboratories that hit 52-week high?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/breakout-stocks-how-to-trade-jaiprakash-power-ventures-jm-financial-amp-divis-laboratories-that-hit-52-week-high/slideshow/122321735.cms",
            "description": "Indian market found momentum in the second half of the trading session which pushed the benchmark indices higher. The BSE Sensex rose nearly 300 points while the Nifty50 closed above 25,500 levels.",
            "pubDate": "2025-07-08T13:25:49.183430"
        },
        {
            "title": "Hang Seng index climb over 24,000 as US tariff action lifts market sentiment",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hang-seng-index-climb-over-24000-as-us-tariff-action-lifts-market-sentiment/articleshow/122320947.cms",
            "description": "Hong Kong stocks rose as U.S. tariffs on 14 countries sparked hopes of trade redirection benefiting Chinese and Hong Kong exporters. The Hang Seng Index gained over 1%, led by tech and industrials. Investors anticipate supply chain shifts may boost regional firms amid easing trade pressures on China.",
            "pubDate": "2025-07-08T13:25:49.183534"
        },
        {
            "title": "Jane Street saga: Nilesh Shah gives 3 reasons why no HFT will do it in China",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jane-street-saga-nilesh-shah-gives-3-reasons-why-no-hft-will-do-it-in-china/articleshow/122320301.cms",
            "description": "Kotak MF’s Nilesh Shah warned that India's capital markets are exposed to HFT manipulation due to regulatory gaps. Comparing India to China, he proposed five urgent reforms—from stronger enforcement to financial literacy—to counter potential threats like Jane Street and protect retail investors from unchecked speculation and systemic manipulation.",
            "pubDate": "2025-07-08T13:25:49.183632"
        },
        {
            "title": "Stock Radar: Torrent Pharma stock gives a breakout from falling trendline resistance; what should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-torrent-pharma-stock-gives-a-breakout-from-falling-trendline-resistance-what-should-investors-do/articleshow/122313330.cms",
            "description": "Torrent Pharma rebounded from its 200-day EMA support in June 2025. The stock broke out from a falling trendline resistance. Experts suggested a buy for a target of Rs 3,600 within 1-2 months. The stock found support above the 200-EMA in June 2025. A breakout occurred on June 27th with high volumes.",
            "pubDate": "2025-07-08T13:25:49.183738"
        },
        {
            "title": "​Earnings, FIIs, and Tariffs: Dilip Bhatt on the trio driving market sentiment​",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/earnings-fiis-and-tariffs-dilip-bhatt-on-the-trio-driving-market-sentiment/slideshow/122319781.cms",
            "description": "\"We are just 2% away from the all-time peak, yet the market seems to be craving a clear direction,\" says Dilip Bhatt in an interview to ET Now. While the market indicators on screen reflect optimism, the underlying fundamentals are not providing strong support at the moment. With tariff uncertainty still unresolved, clarity is lacking in terms of what's driving sustained growth.",
            "pubDate": "2025-07-08T13:25:49.183832"
        },
        {
            "title": "Former Sebi chief Madhabi Buch slams claims of regulatory failure in Jane Street case",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/former-sebi-chief-madhabi-buch-slams-claims-of-regulatory-failure-in-jane-street-case/articleshow/122319568.cms",
            "description": "Madhabi Puri Buch, former SEBI Chairperson, refuted claims of regulatory negligence, asserting that SEBI had detected index manipulation by Jane Street. Between April 2024 and February 2025, SEBI initiated actions, including a cease-and-desist order. An interim order issued in July 2025 documented the sequence of events, demonstrating SEBI's proactive engagement.",
            "pubDate": "2025-07-08T13:25:49.183926"
        },
        {
            "title": "5 stocks with a PE ratio higher than industry average",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-stocks-with-a-pe-ratio-higher-than-industry-average/slideshow/122319053.cms",
            "description": "",
            "pubDate": "2025-07-08T13:25:49.184018"
        },
        {
            "title": "Market Wrap: Sensex gains 270 points, Nifty tops 25,500 as Trump hints at India trade deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-gains-270-points-nifty-tops-25500-as-trump-hints-at-india-trade-deal/articleshow/122318497.cms",
            "description": "Indian benchmark indices Sensex and Nifty ended higher on Tuesday, lifted by advances in financial and IT stocks, after U.S. President Donald Trump delayed the rollout of new tariffs to August 1 and imposed fresh levies on several trading partners but signalled that a trade deal with India was near, saying the two countries were “close to a deal.”",
            "pubDate": "2025-07-08T13:25:49.184128"
        },
        {
            "title": "JP Power shares rally 28% in 3 days. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jp-power-shares-rally-28-in-3-days-should-you-buy-sell-or-hold/articleshow/122318505.cms",
            "description": "Jaiprakash Power Ventures surged to a 52-week high amid strong buying interest after reports of Adani Group’s top bid for JP Associates. Analysts advise caution near resistance levels due to potential profit booking at elevated prices.",
            "pubDate": "2025-07-08T13:25:49.184229"
        },
        {
            "title": "Adani Group on track to complete $5 billion fundraising blitz in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-group-on-track-to-complete-5-billion-fundraising-blitz-in-fy26/articleshow/122318407.cms",
            "description": "The Adani Group is storming back into global capital markets with unstoppable momentum, having already raised over $3.2 billion in just six months and positioning itself to complete a massive $5 billion fundraising blitz by FY26, a stunning validation of its infrastructure-first strategy amid relentless scrutiny.",
            "pubDate": "2025-07-08T13:25:49.184325"
        },
        {
            "title": "Retail traders lost Rs 2.87 lakh crore in F&O over 4 years: Sebi",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-traders-lost-rs-2-87-lakh-crore-in-fampo-over-4-years-sebi/slideshow/122317547.cms",
            "description": "Indian retail traders lost Rs 2.87 lakh crore in derivatives trading between FY22 and FY25, Sebi data shows. Losses peaked in FY25 at Rs 1.05 lakh crore — the highest in the four-year period — as the regulator also revealed how American quant firm Jane Street allegedly manipulated the same markets where individual investors continue to suffer.",
            "pubDate": "2025-07-08T13:25:49.184414"
        },
        {
            "title": "Stocks to Buy | Markets in pause mode: All eyes on August 1 tariff deadline",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-markets-in-pause-mode-all-eyes-on-august-1-tariff-deadline/slideshow/122317126.cms",
            "description": "Nitin Bhasin in an interview to ET Now said that the Indian stock market is currently in a wait-and-watch mode as the tariff deadline has been postponed to August 1st. Although a mini trade deal may have taken place, the larger and more impactful agreement is still pending. This uncertainty, combined with stable capital flows and macroeconomic indicators, has left the market without a clear direction. Bhasin emphasizes that the tariff outcome is now a critical event that investors are closely tracking to determine the next move.",
            "pubDate": "2025-07-08T13:25:49.184506"
        },
        {
            "title": "360 One WAM shares slide over 5% despite Sebi nod for Credit Suisse India Business",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/360-one-wam-shares-slide-over-5-despite-sebi-nod-for-credit-suisse-india-business/articleshow/122316068.cms",
            "description": "Shares of 360 One WAM fell sharply in Tuesday’s session, declining 5.32% to the day's low of Rs 1,174. The drop wiped off a significant chunk of investor wealth, dragging the company's market capitalisation down to Rs 47,821 crore.",
            "pubDate": "2025-07-08T13:25:49.184601"
        },
        {
            "title": "F&O Radar | Deploy Broken Wing in ICICI Prudential to gain from bullish momentum: Hardik Matalia",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fo-radar-deploy-broken-wing-in-icici-prudential-to-gain-from-bullish-momentum-hardik-matalia/articleshow/122315745.cms",
            "description": "ICICI Prudential Life Insurance shares are showing bullish reversal signs, forming a Cup and Handle pattern. A breakout above Rs 680 could trigger a rally towards Rs 725-750, supported by positive RSI and moving average alignment. Analysts suggest a Broken Wing strategy to capitalize on the potential upside, with Rs 650 acting as a crucial support level.",
            "pubDate": "2025-07-08T13:25:49.184691"
        }
    ]
}