{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-12T14:36:42.666710",
    "items": [
        {
            "title": "Oil marketers may gain, producers may drain in Q3",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/oil-marketers-may-gain-producers-may-drain-in-q3/articleshow/126473299.cms",
            "description": "Oil marketing companies are poised for strong earnings growth in the December quarter, driven by robust refining margins and improved fuel price spreads. Upstream producers, however, face pressure from lower crude oil prices, while city gas distributors are expected to report healthy volumes and expanding margins despite some headwinds.",
            "pubDate": "2026-01-12T00:49:51.481939"
        },
        {
            "title": "TCS to log a steady Q3 amid AI pivot, IT spending trend in focus",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-to-log-a-steady-q3-amid-ai-pivot-it-spending-trend-in-focus/articleshow/126473269.cms",
            "description": "Tata Consultancy Services and HCL Technologies will announce their December quarter results. Both companies are expected to show modest revenue increases. Analysts are watching for management insights on IT budgets for 2026 and the impact of artificial intelligence. Client spending and order pipelines will be crucial indicators for future growth.",
            "pubDate": "2026-01-12T00:49:51.482045"
        },
        {
            "title": "TCS, HCL Tech kick off IT earnings today: Why AI matters more than numbers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-hcl-tech-kick-off-it-earnings-today-why-ai-matters-more-than-numbers/articleshow/126474972.cms",
            "description": "As TCS and HCL Tech report Q3 results, investor focus shifts from numbers to AI's impact. While traditional IT services face headwinds, AI adoption is expected to drive significant growth and business-accretive deals, potentially revitalizing the sector's trajectory through 2026 and beyond.",
            "pubDate": "2026-01-12T04:58:38.715890"
        },
        {
            "title": "TCS Q3 Results: Cons PAT falls 14% YoY to Rs 10,657 crore, but revenue rises 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q3-results-cons-pat-falls-14-yoy-to-rs-10657-crore-but-revenue-rises-5/articleshow/126482009.cms",
            "description": "TCS Q3 Results: Revenue from operations in Q3FY26 rose 5% year-on-year to Rs 67,087 crore, up from Rs 63,973 crore in the corresponding quarter of the previous financial year.",
            "pubDate": "2026-01-12T10:53:57.522774"
        },
        {
            "title": "TCS declares Rs 57 dividend, including Rs 46 special payout. Check record date and other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-declares-rs-57-dividend-including-rs-46-special-payout-check-record-date-and-other-details/articleshow/126482873.cms",
            "description": "TCS declared a Rs 57 per share dividend, including a Rs 46 special payout, supported by strong cash flows. Despite modest revenue growth and lower profit, stable margins and rising AI-led services continue to underpin long-term strategy.",
            "pubDate": "2026-01-12T11:32:28.057758"
        },
        {
            "title": "HCL Technologies Q3 Results: Cons PAT falls 11% YoY to Rs 4,076 crore, revenue rises 13%; Rs 12 per share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-technologies-q3-results-cons-pat-falls-11-yoy-to-rs-4076-crore-revenue-rises-13/articleshow/126483708.cms",
            "description": "HCL Tech Q3 Results: HCL Technologies on Monday reported an 11% YoY fall in its December quarter consolidated net profit at Rs 4,076 crore compared to Rs 4,591 crore reported in the year ago period. The profit after tax (PAT) is attributable to the owners of the company.",
            "pubDate": "2026-01-12T12:00:23.171608"
        },
        {
            "title": "HCL Tech declares Rs 12 per share dividend, sets record date on Jan 16",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-tech-declares-rs-12-per-share-dividend-sets-record-date-on-jan-16/articleshow/126484958.cms",
            "description": "HCL Technologies announced a Rs 12 interim dividend for FY26 alongside Q3 results, as profit declined year-on-year despite strong revenue growth, steady sequential topline gains, and healthy constant currency expansion amid a cautious global IT spending environment.",
            "pubDate": "2026-01-12T13:01:04.337878"
        },
        {
            "title": "TCS Q3 results: IT major posts 14% YoY fall in profit to Rs 10,657 cr, revenue rises 5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tcs-q3-results-it-major-posts-14-yoy-fall-in-profit-to-rs-10657-cr-revenue-rises-5/videoshow/126484166.cms",
            "description": "India's biggest information technology (IT) services company, Tata Consultancy Services (TCS), on Monday posted a decline in its profit after tax (PAT) for the third quarter of the financial year, even as revenue rose in the low single digit. TCS posted a 13.9% year-on-year (YoY) decline in its consolidated net profit (attributable to shareholders) to ₹10,657 crore. The figure stood at ₹12,380 crore in the same period last year. On a sequential basis, PAT was lower by 11.7% from ₹12,075 crore posted in the preceding September quarter of FY26.",
            "pubDate": "2026-01-12T13:01:04.338005"
        },
        {
            "title": "HCLTech Q3 FY26 financial results press conference Live",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcltech-q3-fy26-financial-results-press-conference-live/videoshow/126485503.cms",
            "description": "HCLTech addressed the media at a press conference to present its financial performance for the third quarter of FY26. The company outlined revenue growth, profitability, deal wins and its outlook for the coming quarters.",
            "pubDate": "2026-01-12T13:47:47.285590"
        },
        {
            "title": "HCL Technologies Q3 Results: PAT falls 11% YoY to Rs 4,076 cr, Rs 12 per share dividend declared",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hcl-technologies-q3-results-pat-falls-11-yoy-to-rs-4076-cr-rs-12-per-share-dividend-declared/videoshow/126486322.cms",
            "description": "HCL Technologies on Monday reported an 11% YoY fall in its December quarter consolidated net profit at Rs 4,076 crore compared to Rs 4,591 crore reported in the year ago period. The profit after tax (PAT) is attributable to the owners of the company.",
            "pubDate": "2026-01-12T14:36:41.841938"
        }
    ]
}