{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-18T09:54:04.311118",
    "items": [
        {
            "title": "Weak credit growth and rate cuts to squeeze profit at HDFC, ICICI Banks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/weak-credit-growth-and-rate-cuts-to-squeeze-profit-at-hdfc-icici-banks/articleshow/122721349.cms",
            "description": "Indian markets face pressure as the Reserve Bank of India's rate cuts impact margins. Finance Minister Nirmala Sitharaman urges government banks to boost lending amid weakening credit growth. HDFC Bank and ICICI Bank anticipate limited profit growth due to margin compression. Infosys eyes tariff concerns, while Nestle India expects revenue growth.",
            "pubDate": "2025-07-18T05:47:06.756648"
        },
        {
            "title": "JSW Steel Q1 results today: Strong bottomline surge likely despite muted volumes",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/jsw-steel-q1-results-today-strong-bottomline-surge-likely-despite-muted-volumes/articleshow/122712033.cms",
            "description": "JSW Steel is poised to announce strong Q1 FY26 results, with analysts predicting a 130% YoY surge in profit after tax. Revenue is expected to increase modestly by 4% YoY, driven by improved realisations and lower raw material costs. While standalone volumes are slightly up YoY, they are down sequentially due to maintenance.",
            "pubDate": "2025-07-18T05:47:06.756787"
        },
        {
            "title": "Can Wipro sustain its momentum despite global business uncertainties?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/can-wipro-sustain-its-momentum-despite-global-business-uncertainties/articleshow/122702997.cms",
            "description": "Wipro's June quarter exceeded muted expectations, driven by new deal traction and recent acquisitions. The company secured nearly $5 billion in total contract value, including $2.7 billion in large deals. While global uncertainty persists, Wipro anticipates sequential revenue to range from a 1% decline to a 1% increase for the September quarter, reflecting cautious optimism.",
            "pubDate": "2025-07-18T05:47:06.756897"
        },
        {
            "title": "Rising costs, muted demand to weigh on FMCG margins in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/rising-costs-muted-demand-to-weigh-on-fmcg-margins-in-q1/articleshow/122702634.cms",
            "description": "FMCG companies anticipate a slight sales volume increase for the June quarter, with revenue growth varying due to pricing strategies and demand. While some firms may face margin pressure from rising material costs and advertising, Marico and Tata Consumer Products are favored by analysts. The Nifty FMCG index has recently outperformed broader market indices.",
            "pubDate": "2025-07-18T05:47:06.756999"
        },
        {
            "title": "Flat income, heavy loan buffers bring down Axis Bank net profit in Q1",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/flat-income-heavy-loan-buffers-bring-down-axis-bank-net-profit-in-q1/articleshow/122700681.cms",
            "description": "Axis Bank's June quarter net profit declined by 4% to ₹5,806 crore, falling short of estimates due to increased provisions and sluggish business income. Net interest income remained flat, and net interest margin contracted. Asset quality deteriorated, with a rise in gross non-performing assets and slippages, partly attributed to changes in technical recognition criteria.",
            "pubDate": "2025-07-18T05:47:06.757101"
        },
        {
            "title": "Indian Overseas Bank Q1 profit shoots up 76% YoY to Rs 1,111 crore on recoveries, lower provisions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/indian-overseas-bank-q1-profit-shoots-up-76-yoy-to-rs-1111-crore-on-recoveries-lower-provisions/articleshow/122762372.cms",
            "description": "Indian Overseas Bank posted a 76% YoY rise in June quarter profit to Rs 1,111 crore, aided by higher recoveries, improved asset quality, lower provisions, and increased income. Gross NPA fell to 1.97%, while NII rose 12.5%.",
            "pubDate": "2025-07-18T09:54:02.145552"
        },
        {
            "title": "ICICI Bank Q1 Results Preview: PAT seen to grow up to 12% YoY. NII could rise by up to 9% amid margin contraction",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/icici-bank-q1-results-preview-pat-seen-to-grow-up-to-12-yoy-nii-could-rise-by-up-to-9-amid-margin-contraction/articleshow/122761129.cms",
            "description": "ICICI Bank is expected to post steady Q1FY26 results with up to 12% YoY PAT growth and modest NII gains. However, margin compression, higher provisions, and deposit trends are key concerns to monitor ahead of July 19 earnings.",
            "pubDate": "2025-07-18T09:54:02.145681"
        },
        {
            "title": "HDFC Bank Q1 results preview: PAT, NII may grow by up to 6% YoY. 7 key things to watch out for",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/hdfc-bank-q1-results-preview-pat-nii-may-grow-by-up-to-6-yoy-7-key-things-to-watch-out-for/articleshow/122733743.cms",
            "description": "HDFC Bank is set to announce its Q1 earnings, with analysts predicting moderate profit growth but pressure on net interest margins. Net profit is expected to rise by 1.5-6% YoY, while NII may grow by 4.6-6.2%. Loan growth remains sluggish, but deposit growth has improved.",
            "pubDate": "2025-07-18T09:54:02.145806"
        }
    ]
}