{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-08T02:19:06.265933",
    "items": [
        {
            "title": "Trump picks Stephen Miran to fill open spot on Fed Board",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trump-picks-stephen-miran-to-fill-open-spot-on-fed-board/articleshow/123178030.cms",
            "description": "Donald Trump plans to nominate Stephen Miran to the Federal Reserve. Miran will fill a vacant seat temporarily. The White House is searching for a permanent Fed Board member. They are also looking for a new Fed chair to replace Jerome Powell. Miran has advocated for changes in the Fed's governance. His nomination requires Senate approval.",
            "pubDate": "2025-08-08T02:18:52.260901"
        },
        {
            "title": "S&P 500 eases with Eli Lilly; Nasdaq manages record closing high",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-eases-with-eli-lilly-nasdaq-manages-record-closing-high/articleshow/123177920.cms",
            "description": "The Dow and S&P 500 faced a slight dip. However, Nasdaq managed a record high close. Eli Lilly shares fell due to disappointing drug data. Trump plans to nominate Stephen Miran to the Federal Reserve. Christopher Waller is a top candidate for Fed chair. New tariffs from Trump raised import duties. Jobless claims saw a slight increase.",
            "pubDate": "2025-08-08T02:18:52.261018"
        },
        {
            "title": "GIFT Nifty down 45 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/123177361.cms",
            "description": "Indian markets initially declined but recovered to close positively. Analysts anticipate range-bound movement, influenced by US-Russia talks, US tariffs, and domestic earnings. The India VIX decreased. Foreign investors net sold shares, while domestic institutional investors were net buyers. The Rupee strengthened against the US dollar. FII positions in the futures market showed an increase in net shorts.",
            "pubDate": "2025-08-08T02:18:52.261124"
        },
        {
            "title": "Stocks in news: LIC, SBI, Tata Motors, Titan, Airtel, Apollo Tyres",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-lic-sbi-tata-motors-titan-airtel-apollo-tyres/articleshow/123177297.cms",
            "description": "Indian equities experienced volatile trading before closing flat on expiry day. Several companies are in focus due to Q1 results: LIC reported a 5% profit increase, while BSE saw a 103% surge. Titan's profit grew by 34%, and Kalyan Jewellers by 49%. HPCL's profit jumped significantly by 1,128%.",
            "pubDate": "2025-08-08T02:18:52.261220"
        },
        {
            "title": "Asian equities edge up at open, dollar declines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-equities-edge-up-at-open-dollar-declines/articleshow/123177224.cms",
            "description": "Asian stocks are on track for their best week since June, fueled by technology shares and optimism surrounding corporate earnings. The MSCI Asia Pacific Index saw gains, with Japanese equities leading the charge. The dollar weakened, while investors anticipate a potential interest-rate cut by the Federal Reserve, contributing to the positive market sentiment.",
            "pubDate": "2025-08-08T02:18:52.261313"
        },
        {
            "title": "India's general insurance sector reports muted growth in July",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-general-insurance-sector-reports-muted-growth-in-july/articleshow/123176910.cms",
            "description": "India's general insurance sector experienced slow growth in July. Premium growth was only 2.8 percent. Motor insurance sales were weak. Big companies like Bajaj Allianz and ICICI Lombard saw declines. New India Assurance, however, grew by 16 percent. Health insurers performed better, growing over 10 percent. The industry's total premium was ₹29,729 crore.",
            "pubDate": "2025-08-08T02:18:52.261409"
        },
        {
            "title": "Sebi permits joint inspections of stock brokers by Market Infrastructure Institutions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-permits-joint-inspections-of-stock-brokers-by-market-infrastructure-institutions/articleshow/123176844.cms",
            "description": "Sebi has permitted Market Infrastructure Institutions (MIIs) to conduct joint inspections of stock brokers, streamlining the process. This move aims to reduce the burden on intermediaries caused by frequent, separate inspections by stock exchanges, depositories, and clearing corporations. MIIs are also required to establish information-sharing mechanisms for inspection observations.",
            "pubDate": "2025-08-08T02:18:52.261499"
        },
        {
            "title": "Indian Continent Investment to sell 0.8% stake in Bharti Airtel for Rs 9,300 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indian-continent-investment-to-sell-0-8-stake-in-bharti-airtel-for-rs-9300-crore/articleshow/123176645.cms",
            "description": "Indian Continent Investment, led by Sunil Mittal, plans to sell approximately 0.8% of its stake in Bharti Airtel for over ₹9,300 crore through a block deal. The sale involves five crore shares at a floor price of ₹1,862 per share, a 3% discount. This follows a similar stake sale in February, with Bharti Airtel's shares showing significant gains this year.",
            "pubDate": "2025-08-08T02:18:52.261590"
        },
        {
            "title": "Tata & SP Group reignite exit talks after years: Chandrasekaran meets Mistry in first formal contact since relations soured in 2016",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-sp-group-reignite-exit-talks-after-years-chandrasekaran-meets-mistry-in-first-formal-contact-since-relations-soured-in-2016/articleshow/123177086.cms",
            "description": "Tata Sons has initiated early talks with minority shareholder Shapoorji Pallonji (SP) Group to explore potential exit and monetisation options for SP’s 18.37% stake, currently pledged with lenders. This follows a resolution by Tata Trusts to retain Tata Sons’ private status and seek a settlement. Chairman N Chandrasekaran recently met Shapoor Mistry, marking their first formal engagement since 2016.",
            "pubDate": "2025-08-08T02:18:52.261708"
        },
        {
            "title": "Can US-Russia summit alleviate India's concerns over Trump's tariff policies?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/can-us-russia-summit-alleviate-indias-concerns-over-trumps-tariff-policies/articleshow/123176551.cms",
            "description": "Indian equity markets rebounded on Thursday, recovering from earlier losses fueled by tariff concerns. Optimism surrounding a potential Trump-Putin meeting spurred hopes for eased US-India trade relations, particularly regarding Russian oil purchases. The NSE Nifty and BSE Sensex both closed marginally higher, driven by short covering and positive momentum indicators, suggesting a possible continuation of the upward trend.",
            "pubDate": "2025-08-08T02:18:52.261800"
        },
        {
            "title": "Stock Radar: APL Apollo Tubes stock fails to hold momentum after hitting highs in June; what should traders do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-apl-apollo-tubes-stock-fails-to-hold-momentum-after-hitting-highs-in-june-what-should-traders-do/articleshow/123163303.cms",
            "description": "APL Apollo Tubes, after failing to sustain momentum from June highs, is exhibiting bearish signals. Experts suggest short-term traders consider short positions, targeting Rs 1,430 within six weeks. The stock's decline below crucial moving averages and resistance at the 200-DMA indicate continued weakness, making it a potential short-selling opportunity.",
            "pubDate": "2025-08-08T02:18:52.261895"
        },
        {
            "title": "Co-lending norms: Tech integration could prove a hurdle",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/co-lending-norms-tech-integration-could-prove-a-hurdle/articleshow/123176777.cms",
            "description": "Following the RBI's tighter regulations on co-lending, banks and NBFCs may shift towards direct assignment of assets. The new rules demand significant tech integration and credit policy alignment, potentially slowing down operationally intensive loans. While larger NBFCs might find the compliance burdensome, smaller ones could benefit from the default loss guarantee, enhancing their scaling ability.",
            "pubDate": "2025-08-08T02:18:52.262077"
        },
        {
            "title": "Weaver Services to buy Centrum Housing Finance for Rs 600 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weaver-services-to-buy-centrum-housing-finance-for-rs-600-crore/articleshow/123176763.cms",
            "description": "Weaver Services, backed by Gaja Capital, is set to acquire a 75% stake in Centrum Housing Finance for ₹600 crore. This deal values the mortgage lender at ₹800 crore, driven by Centrum's need to focus on its small finance bank as per regulatory requirements. The acquisition reflects continued investor interest in India's affordable housing finance sector, despite recent valuation adjustments.",
            "pubDate": "2025-08-08T02:18:52.262167"
        },
        {
            "title": "RBI plans hefty penalty to make banks settle death claims fast",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-plans-hefty-penalty-to-make-banks-settle-death-claims-fast/articleshow/123176746.cms",
            "description": "The Reserve Bank of India (RBI) mandates banks to settle deceased customers' deposit accounts, safe deposit lockers, and safe custody articles within 15 days, effective January 1, 2026. Non-compliance will incur penalties, including interest on deposit delays and a daily charge for locker settlement delays. The move aims to standardize claim processes and compensate customers for inconveniences.",
            "pubDate": "2025-08-08T02:18:52.262253"
        }
    ]
}