{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-19T00:47:27.335724",
    "items": [
        {
            "title": "Sebi promotes broadened investor participation in infrastructure sector for enhanced liquidity",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-promotes-broadened-investor-participation-in-infrastructure-sector-for-enhanced-liquidity/articleshow/123987431.cms",
            "description": "SEBI is looking to attract a wider range of investors, including mutual funds, pension funds, and retail participants, to the infrastructure sector to boost liquidity in infrastructure securities. Chairman Tuhin Kanta Pandey highlighted the need for expedited asset monetisation by state governments and cautioned against over-reliance on banks and government funding, advocating for market-based instruments to diversify risk.",
            "pubDate": "2025-09-19T00:47:19.408941"
        },
        {
            "title": "Stocks in news: Adani Enterprises, Adani Power, Vedanta, Texmaco Rail, Oil India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-adani-enterprises-adani-power-vedanta-texmaco-rail-oil-india/articleshow/123980753.cms",
            "description": "Markets showed volatility but maintained a positive trend. Adani Group stocks are in focus as Sebi dismissed allegations in the Hindenburg case. Indian Hotels clarified its leasehold rights for The Pierre hotel. Bombay Dyeing appointed Rohit Santhosh as CEO of Bombay Realty, while Oil India anticipates the restart of a Mozambique LNG project by year-end.",
            "pubDate": "2025-09-19T00:47:19.409062"
        },
        {
            "title": "NaBFID needs to make ambitious projects bankable: DFS secretary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nabfid-needs-to-make-ambitious-projects-bankable-dfs-secretary/articleshow/123987404.cms",
            "description": "NaBFID, having sanctioned ₹2 lakh crore in projects, is urged to enhance expertise and systems for long-term infrastructure viability, according to M Nagaraju. He suggested NaBFID act as a transaction advisor, mitigating early-stage risks to attract commercial investment. Focus should be on urban infrastructure and water, developing standards and engaging with states to improve project bankability.",
            "pubDate": "2025-09-19T00:47:19.409292"
        },
        {
            "title": "Motilal Oswal settles case with Sebi,  pays Rs 34.85 lakh as settlement charges",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswal-settles-case-with-sebi-pays-rs-34-85-lakh-as-settlement-charges/articleshow/123987376.cms",
            "description": "Sebi has settled proceedings with Motilal Oswal Financial Services regarding a case of suspected front-running by the Chaturvedi Group, linked to a large client's trades. The brokerage paid ₹34.85 lakh as settlement charges. The regulator alleged the firm failed to maintain proper order records and attempted to create supporting documents post-execution, leading to a show-cause notice earlier this year.",
            "pubDate": "2025-09-19T00:47:19.409397"
        },
        {
            "title": "Will US Fed rate cut lead to revival of foreign investment in Indian stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/will-us-fed-rate-cut-lead-to-revival-of-foreign-investment-in-indian-stocks/articleshow/123987336.cms",
            "description": "Following the US Federal Reserve's rate cut, anticipation surrounds the potential return of foreign capital to Indian equities. However, high valuations in India and attractive opportunities in markets like China may temper inflows. While foreign selling has slowed, a significant turnaround hinges on domestic institutional investor activity and improved earnings momentum to shift FPI sentiment.",
            "pubDate": "2025-09-19T00:47:19.409493"
        },
        {
            "title": "Nifty, Sensex rise for a 3rd day after US Fed rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-sensex-rise-for-a-3rd-day-after-us-fed-rate-cut/articleshow/123987249.cms",
            "description": "Indian stock indices climbed for the third consecutive session on Thursday, buoyed by the US Federal Reserve's expected interest rate cut. The NSE Nifty and BSE Sensex both closed 0.4% higher, while the India Volatility Index hit a record low. Foreign and domestic portfolio investors were net buyers, contributing to the positive market sentiment.",
            "pubDate": "2025-09-19T00:47:19.409588"
        },
        {
            "title": "Stock Radar: Defense major HAL gains momentum; upside seen till Rs 5,130, Shivangi Sarda recommends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-defense-major-hal-gains-momentum-upside-seen-till-rs-5130-shivangi-sarda-recommends/articleshow/123972607.cms",
            "description": "Hindustan Aeronautics Limited stock broke out after consolidating for two months. Experts suggest short-term traders consider buying. The stock previously hit a high in May. It faced resistance around Rs 4,600. Support was found near Rs 4,300. The stock rallied over ten percent in a week. Analysts recommend a target of Rs 5,130 in the coming weeks.",
            "pubDate": "2025-09-19T00:47:19.409684"
        },
        {
            "title": "Step up infrastructure credit flow, India requires $4.5 trillion growth capital: PFRDA",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/step-up-infrastructure-credit-flow-india-requires-4-5-trillion-growth-capital-pfrda/articleshow/123987356.cms",
            "description": "India requires a substantial $4.5 trillion infrastructure investment by 2030 to maintain its desired growth. Sivasubramanian Ramann highlighted the shift in financing from banks to pension and insurance funds, better suited for long-term projects. Regulatory reforms and wider use of credit enhancement schemes are expected to boost credit flow and bond issuance for infrastructure companies.",
            "pubDate": "2025-09-19T00:47:19.409773"
        },
        {
            "title": "NCLT approves Gayatri Projects' settlement plan from promoters",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nclt-approves-gayatri-projects-settlement-plan-from-promoters/articleshow/123987349.cms",
            "description": "The Hyderabad NCLT has approved a ₹2,400 crore OTS plan by Gayatri Projects' promoters, resolving ₹8,100 crore in dues to lenders led by Canara Bank. With 97% lender approval, the promoters have 90 days to pay ₹750 crore, cover bank guarantee invocations, and allocate ₹450 crore from arbitration claims.",
            "pubDate": "2025-09-19T00:47:19.409870"
        }
    ]
}