{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-09T17:32:20.480174",
    "items": [
        {
            "title": "Shriram Finance, SBI Life among 5 stocks with significant long buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/shriram-finance-sbi-life-among-5-stocks-with-significant-long-buildup/slideshow/113188858.cms",
            "description": "A long buildup occurs when open interest and trading volumes increase alongside a rise in the underlying stock price in the Futures and Options segment, signalling a bullish market trend. In Monday's trading session, five stocks saw fresh long positions. Here’s the list:",
            "pubDate": "2024-09-09T08:51:52.731384"
        },
        {
            "title": "Conservative BofA joins peers with forecast of three US rate cuts this year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/conservative-bofa-joins-peers-with-forecast-of-three-us-rate-cuts-this-year/articleshow/113188222.cms",
            "description": "Bank of America, the most conservative among Wall Street's brokerages on the size of the Federal Reserve's expected interest rate cuts this year, has raised its forecast to match most of its peers after the recent nonfarm payrolls data.",
            "pubDate": "2024-09-09T08:51:52.731501"
        },
        {
            "title": "ONGC, Birlasoft among 5 stocks with short buildup",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ongc-birlasoft-among-5-stocks-with-short-buildup/slideshow/113188204.cms",
            "description": "A short buildup occurs when there is a rise in open interest and trading volumes, coupled with a decrease in the price of an underlying stock in the Futures and Options segment. This indicates that more traders are expecting the prices to decline and are creating short positions. In Monday's trading session, five stocks saw fresh short positions being built. Here's the list:",
            "pubDate": "2024-09-09T08:51:52.731601"
        },
        {
            "title": "17 large & mid caps stocks where FPI and DII are at loggerheads. FPI are increasing stake, DII are reducing stake. Who will be proven right ?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/17-large-mid-caps-stocks-where-fpi-and-dii-are-at-loggerheads-fpi-are-increasing-stake-dii-are-reducing-stake-who-will-be-proven-right-/articleshow/113187962.cms",
            "description": "There has been a lot of  talk about foreign institutional investors ( FII ) or foreign portfolio investors ( FPI) as they officially called being net sellers in India markets. The numbers tell a different story, if one looks at overall numbers except for calendar year 2022, where they have been net sellers, FPIs have been investing in India. In 2023 and in 2024 as on date, they have been net buyers. So, there is a difference in perception and reality. Now the question is where is the FPI money going and is the DII money which surely has seen a rise thanks to SIP flows into mutual funds is also going in the same direction where the FII money is going. We looked at a set of stocks and change in shareholding for the last three years and there are X stocks where FPI have been buyers, increasing their stake and DII have been reducing their stake. Now this could be for many reasons, but who will be proven right, FII or DII.",
            "pubDate": "2024-09-09T08:51:52.731694"
        },
        {
            "title": "Few FPIs seek legal route to dodge Sebi norms; deadline to disclose BO expires on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/few-fpis-seek-legal-route-to-dodge-sebi-norms-deadline-to-disclose-bo-expires-on-monday/articleshow/113187630.cms",
            "description": "Two Mauritius-based foreign portfolio investors have approached the Securities Appellate Tribunal to seek more time to comply with Sebi's new disclosure norms. The deadline for revealing ultimate beneficial ownership ends on Monday. Sebi's regulations aim to enhance transparency and prevent potential misuse of the FPI route.",
            "pubDate": "2024-09-09T08:51:52.731793"
        },
        {
            "title": "European stock markets rise at open",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stock-markets-rise-at-open/articleshow/113186763.cms",
            "description": "European stock markets climbed at the open Monday, recovering slightly from heavy pre-weekend falls on US economic strains, as investors await an expected interest-rate cut from the European Central Bank. The European Central Bank is set to cut eurozone borrowing costs further on Thursday as inflation in the single-currency bloc drifts back to the ECB's two-percent target. bcp/lth",
            "pubDate": "2024-09-09T08:51:52.731885"
        },
        {
            "title": "Tech leads Japan's Nikkei lower; yen retreat caps losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-leads-japans-nikkei-lower-yen-retreat-caps-losses/articleshow/113186706.cms",
            "description": "Japan's Nikkei share average fell on Monday, with technology stocks among the biggest decliners, although the benchmark index escaped steeper losses as the yen retreated from a one-month high.",
            "pubDate": "2024-09-09T08:51:52.731978"
        },
        {
            "title": "Tata Technologies shares dip over 3% after Citi reaffirms 'Sell' rating",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-technologies-shares-dip-over-3-after-citi-reaffirms-sell-rating/articleshow/113186434.cms",
            "description": "Shares of Tata Technologies dropped 3.4% to a day's low of Rs 1,074.2 in Monday's trade on the BSE after global brokerage firm Citi maintained its 'Sell' rating on the stock. Citi, however, raised the target price to Rs 945 from the earlier Rs 935, indicating a downside of 15% from the previous day's closing price of Rs 1,112.5 apiece.",
            "pubDate": "2024-09-09T08:51:52.732075"
        },
        {
            "title": "Tolins Tyres IPO fully subscribed on Day 1. Check GMP, other details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tolins-tyres-ipo-subscribed-70-so-far-on-day-1-check-gmp-other-details/articleshow/113185056.cms",
            "description": "Tolins Tyres' IPO, which opened for subscription on Monday and closes on September 11, has been fully subscribed on its first day. Retail investors led the demand, with a subscription rate of 1.90 times. The IPO includes a fresh issue worth Rs 200 crore and an offer-for-sale of Rs 30 crore by promoters.",
            "pubDate": "2024-09-09T08:51:52.732164"
        },
        {
            "title": "Suzlon Energy shares jump 3% on winning India’s largest wind energy order from NTPC",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/suzlon-energy-shares-jump-3-on-winning-indias-largest-wind-energy-order-from-ntpc/articleshow/113183848.cms",
            "description": "Suzlon Energy Share Price: Suzlon Energy’s shares rose 3% after securing a 1,166 MW wind energy order from NTPC Green Energy. The project in Gujarat will power 3 million households and boost Suzlon’s PSU presence.",
            "pubDate": "2024-09-09T08:51:52.732279"
        },
        {
            "title": "Axis MF front running case: ED registers FEMA case against ex-fund manager Viresh Joshi; conducts raids",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/axis-mutual-fund-front-running-ed-registers-case-under-fema-conduct-raids/articleshow/113183702.cms",
            "description": "The Enforcement Directorate is conducting searches at premises linked to Viresh Joshi, former chief trader of Axis Mutual Fund, in a forex violation case. Joshi was dismissed in May 2022 after allegations of front-running and broker payments. The Income Tax department had previously attached Rs 57 crore of his fixed deposits.",
            "pubDate": "2024-09-09T08:51:52.732375"
        },
        {
            "title": "Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 41%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-picks-of-the-week-5-stocks-with-consistent-score-improvement-and-upside-potential-of-up-to-41/articleshow/113183506.cms",
            "description": "Once again in the last few trading sessions the street is witnessing volatility and that reminds us again that volatility never gives notice before coming. The only thing which an investor needs to do is to stay prepared for volatility and there are many ways of doing so. Right from staying with stocks which have seen some fundamental changes on the positive side to being mentally prepared that money invested might under performed due to global. Don't make decisions in a hurry, either to buy or sell. These selected stocks depict a strong upward trajectory in their overall average score which is based on five key pillars i.e. earnings, fundamentals, relative valuation, risk and price momentum. This implies that there has been a significant improvement in their market outlook in the given time frame.",
            "pubDate": "2024-09-09T08:51:52.732465"
        },
        {
            "title": "Premier Energies shares rally 41% in 3 days on Rs 200 crore order win from UP Government",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/premier-energies-shares-rally-41-in-3-days-on-rs-200-crore-order-win-from-up-government/articleshow/113182918.cms",
            "description": "Premier Energies Share Price: Premier Energies' shares surged 41% in three days after securing a Rs 215 crore order from Uttar Pradesh for solar water pumping systems. The project, under the PM-KUSUM scheme, aims to be completed by March 2025. The company's IPO saw strong investor interest, with shares debuting at a significant premium.",
            "pubDate": "2024-09-09T08:51:52.732557"
        },
        {
            "title": "Ola Electric shares fall 4% as lock-in ends for 18 crore shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ola-electric-shares-fall-4-as-lock-in-ends-for-18-crore-shares/articleshow/113182766.cms",
            "description": "Ola Electric Share Price: The expiry of the anchor lock-in period has released 18.18 lakh shares for trading. This marks the end of a regulatory restriction designed to prevent large-scale selling and stabilize stock prices after an IPO. Typically, anchor investors are required to hold 50% of their shares for 30 days and the remaining 50% for 90 days. With these shares now freely tradable, there could be an increase in market activity and potential price volatility for the stock in the short term.",
            "pubDate": "2024-09-09T08:51:52.732650"
        },
        {
            "title": "Jeyyam Global Foods stock lists flat at Rs 61 on NSE SME platform",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jeyyam-global-foods-stock-lists-flat-at-rs-61-on-nse-sme-platform/articleshow/113182336.cms",
            "description": "Jeyyam Global Foods Share Price: Jeyyam Global Foods made a flat debut on the NSE SME platform with a listing price of Rs 61, matching its issue price. The IPO received strong investor interest, being subscribed over 100 times. The company plans to use the proceeds for working capital, capital expenditure, and general corporate purposes.",
            "pubDate": "2024-09-09T08:51:52.732785"
        },
        {
            "title": "Deep industries shares skyrocket over 19% to hit all-time high on Rs 1402 crore order win",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/deep-industries-shares-skyrocket-over-19-to-hit-all-time-high-on-rs-1402-crore-order-win/articleshow/113182161.cms",
            "description": "In an exchange filing, the company stated, \"Deep Industries Ltd (DIL), a leading integrated solutions provider for oil and gas field operations, has secured a significant order valued at Rs 1,402 crore from ONGC.\"",
            "pubDate": "2024-09-09T08:51:52.732877"
        },
        {
            "title": "Ahead of IPO, PN Gadgil Jewellers collects Rs 330 crore from anchor investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-ipo-pn-gadgil-jewellers-collects-rs-330-crore-from-anchor-investors/articleshow/113202787.cms",
            "description": "PN Gadgil Jewellers Ltd has raised Rs 330 crore from anchor investors ahead of its IPO opening. The IPO, valued at Rs 1,100 crore, includes a fresh issue of shares worth Rs 850 crore and an offer for sale of Rs 250 crore. The funds will be used for new stores, debt repayment, and corporate purposes.",
            "pubDate": "2024-09-09T17:32:00.874647"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock action on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-action-on-tuesday/articleshow/113201304.cms",
            "description": "Domestic equity indices rose on Monday, with the Nifty 50 up 0.34% to 24,936 and the S&P BSE Sensex gaining 0.46% to 81,559. Analysts suggest resistance at 25,000-25,100 and support at 24,800-24,785, with a potential trend reversal if lower support levels are breached.",
            "pubDate": "2024-09-09T17:32:00.874769"
        },
        {
            "title": "Market Trading Guide: Tata Motors, JSW Energy among 5 stock recommendations for Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-tata-motors-jsw-energy-among-5-stock-recommendations-for-tuesday/slideshow/113200937.cms",
            "description": "Indian benchmark equity indices ended higher in a choppy session on Monday, led by gains in banking and consumer goods stocks. The S&P BSE Sensex closed 0.46% higher at 81,559, while the NSE Nifty50 ended above the 24,900 mark.\"The short-term trend of Nifty remains weak, but the market is showing signs of sustainable upside recovery after a small downward correction. Nifty needs to cross above the hurdle of 25150 levels to consider a possible trend change towards up. Immediate support is at 24750,\" said Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.Here are 5 stock recommendations for Tuesday:",
            "pubDate": "2024-09-09T17:32:00.874871"
        },
        {
            "title": "SC relief for Sebi, NSE, BSE for erroneously freezing accounts of 2 Mumbai residents",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sc-relief-for-sebi-nse-bse-for-erroneously-freezing-accounts-of-2-mumbai-residents/articleshow/113201230.cms",
            "description": "Their demat accounts were erroneously frozen in 2017 as Pradeep Mehta happened to be one of the promoters of Shrenuj & Co at one point of time. Shrenuj could not file its quarterly earnings for April-June, July-September and October-December in 2016.",
            "pubDate": "2024-09-09T17:32:00.874965"
        },
        {
            "title": "Sebi dismisses insider trading charges against Infosys staff & entities, lifts market restrictions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-dismisses-insider-trading-charges-against-infosys-staff-entities-lifts-market-restrictions/articleshow/113200069.cms",
            "description": "Sebi lifted restrictions on Infosys employees and related entities, dismissing insider trading charges. The regulator vacated previous orders from 2021, allowing the affected individuals and entities to access the securities market and releasing any impounded funds.",
            "pubDate": "2024-09-09T17:32:00.875067"
        },
        {
            "title": "US stocks bounce as focus shifts to rates outlook ahead of inflation data",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-on-soft-landing-optimism/articleshow/113198882.cms",
            "description": "Wall Street's main indexes opened higher on Monday following heavy losses last week, as investors remained optimistic about soft landing prospects for the U.S. economy ahead of a crucial inflation report later in the week.",
            "pubDate": "2024-09-09T17:32:00.875162"
        },
        {
            "title": "Tech view: Nifty needs to break out above 25,150 for trend reversal. How to trade on Tuesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-needs-to-break-out-above-25150-for-trend-reversal-how-to-trade-on-tuesday/articleshow/113198063.cms",
            "description": "Although the Nifty's short-term trend is still weak, the market shows promising signs of a sustainable recovery after a minor dip. According to Nagaraj Shetti of HDFC Securities, crossing the 25,150 level is crucial for confirming a potential upward trend reversal. He also notes that immediate support lies at 24,750.",
            "pubDate": "2024-09-09T17:32:00.875256"
        },
        {
            "title": "Technical Breakout Stocks: How to trade Hindustan Unilever, Jubilant Pharmova and Glenmark Life on Tuesday?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/technical-breakout-stocks-how-to-trade-hindustan-unilever-jubilant-pharmova-and-glenmark-life-on-tuesday/slideshow/113197954.cms",
            "description": "Indian market closed in the green on Monday after falling for 4 consecutive days in a row. The S&P BSE Sensex rose more than 370 points while the Nifty50 held on to 24,900 levels.",
            "pubDate": "2024-09-09T17:32:00.875355"
        },
        {
            "title": "GMR Airports to acquire 10% stake in Delhi International Airport at estimated $126 million",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gmr-airports-to-acquire-10-stake-in-delhi-international-airport-at-estimated-126-million/articleshow/113196095.cms",
            "description": "GMR Airports Infrastructure will acquire a 10% stake in Delhi International Airport Limited (DIAL) from Fraport AG for $126 million. GMR, which already holds 64% of DIAL, anticipates completing the transaction within 180 days.",
            "pubDate": "2024-09-09T17:32:00.875447"
        },
        {
            "title": "Sebi tweaks Foreign Venture Capital Investors' registration, eligibility criteria",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-tweaks-foreign-venture-capital-investors-registration-eligibility-criteria/articleshow/113195857.cms",
            "description": "An applicant seeking registration as an FVCI is required to engage a DDP to avail of its services for obtaining a registration certificate as FVCI and at all times the DDP and the custodian of the FVCI shall be the same entity.",
            "pubDate": "2024-09-09T17:32:00.875541"
        },
        {
            "title": "IndiQube Gets ‘CRISIL A+’ Rating, reports Rs 68 crore in PAT for FY24",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indiqube-gets-crisil-a-rating-reports-rs-68-crore-in-pat-for-fy24/articleshow/113195067.cms",
            "description": "The company generated a revenue of Rs 841 crore for FY24 registering a 42% growth over Rs 592 crore reported in FY23. Its reported PAT more than tripled to Rs 67.7 crore in FY24 compared to Rs 20.6 crore in FY23.",
            "pubDate": "2024-09-09T17:32:00.875631"
        },
        {
            "title": "Trent, Zomato help Junior Nifty beat midcap and smallcap peers. Where to invest?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trent-zomato-help-junior-nifty-beat-midcap-and-smallcap-peers-where-to-invest/articleshow/113194832.cms",
            "description": "Tata Group's Trent, poised to join the Nifty 50 on September 30th after the NSE reshuffle, has been a top performer with a remarkable 244% return in the past year. Other standout stocks include Zomato, Power Finance Corporation (PFC), REC, Hindustan Aeronautics (HAL), Indian Railway Catering and Tourism Corporation (IRCTC), and Bharat Electronics (BEL), delivering returns ranging from 105% to 165%.",
            "pubDate": "2024-09-09T17:32:00.875724"
        },
        {
            "title": "Here are key financial ratios to help take better investment decision",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/here-are-key-financial-ratios-to-help-take-better-investment-decision/articleshow/113194717.cms",
            "description": "The financial ratios can be arranged in five broad categories, each focusing on different aspects of a company’s operations. Together, they offer a holistic picture of its health. Here’s a brief introduction of some of the important ratios under each category.",
            "pubDate": "2024-09-09T17:32:00.875811"
        },
        {
            "title": "Market Wrap: D-Street snaps losing streak, Sensex climbs 375 points, Nifty tops 24,900 on banking, consumer stock gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-snap-losing-streak-climb-on-banking-consumer-stock-gains/articleshow/113192339.cms",
            "description": "Indian headline equity indices, Sensex and Nifty50, closed higher on Monday, driven by gains in banking and consumer stocks, despite lingering concerns over the U.S. economy following last week's jobs data, which indicated a continued slowdown in the labor market.",
            "pubDate": "2024-09-09T17:32:00.875905"
        },
        {
            "title": "DMart, Pidilite Industries among 5 largecap stocks that hit fresh 52-week highs on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dmart-pidilite-industries-among-5-largecap-stocks-that-hit-fresh-52-week-highs-on-monday/slideshow/113191872.cms",
            "description": "Indian equity indices traded higher on Monday in a volatile session amid concerns over the US economy lingering following last week’s jobs data, which highlighted a continued slowdown in the labour market. During the session, five largecap Nifty 200 index stocks hit fresh 52-week highs. Here’s the list:",
            "pubDate": "2024-09-09T17:32:00.875998"
        },
        {
            "title": "Gala Precision Engineering shares make a strong debut. Should you book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gala-precision-engineering-shares-make-a-strong-debut-should-you-book-profits/articleshow/113190651.cms",
            "description": "The successful listing, with shares trading 45% above the IPO price at Rs 770, underscores the company's strong fundamentals and the overwhelming investor confidence demonstrated by the IPO's 201.41 times oversubscription. The shares even saw a further 3% increase post-listing, further highlighting the positive market sentiment.",
            "pubDate": "2024-09-09T17:32:00.876092"
        }
    ]
}