{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-19T19:44:10.153321",
    "items": [
        {
            "title": "HUL shares in focus after firm sets December 5 as record date for ice-cream business demerger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hul-shares-in-focus-after-firm-sets-december-5-as-record-date-for-ice-cream-business-demerger/articleshow/125425976.cms",
            "description": "HUL shares: The company's board has fixed record date for the demerger of it's ice-cream division.",
            "pubDate": "2025-11-19T03:36:15.232151"
        },
        {
            "title": "KEC International shares in spotlight as Power Grid Corp bars firm from new tenders for 9 months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/kec-international-shares-in-spotlight-as-power-grid-corp-bars-firm-from-new-tenders-for-9-months/articleshow/125425964.cms",
            "description": "KEC International shares: The company sid that Power Grid has banned it for bidding for the utility tenders.",
            "pubDate": "2025-11-19T03:36:15.232260"
        },
        {
            "title": "Devyani International among 5 stocks that closed above VWAP, signaling a bullish shift",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/devyani-international-among-5-stocks-that-closed-above-vwap-signaling-a-bullish-shift/slideshow/125425832.cms",
            "description": "On November 18, the closing prices of five stocks in the Nifty500 pack rallied more than 1% above their VWAP (Volume-Weighted Average Price). A move above the VWAP indicates a potential bullish trend, according to technical scan data from stockedge.com.When the closing price rises above the VWAP, it signifies that the stock closed higher than the average price at which it traded throughout the day, with the average weighted by trading volume. This is often interpreted by traders and investors as a bullish signal, indicating strengthening market sentiment.",
            "pubDate": "2025-11-19T03:36:15.232370"
        },
        {
            "title": "Bombay Burmah among 7 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bombay-burmah-among-7-stocks-showing-bullish-rsi-upswing/slideshow/125425783.cms",
            "description": "On November 18, seven stocks from the Nifty500 pack were highlighted in the RSI Trending Up scan, based on data from stockedge.com. An uptrend signal occurs when the RSI value crosses above 50 from below. “RSI Trending Up” indicates that the Relative Strength Index (RSI) values are increasing, suggesting strengthening momentum in the stock price. This can signal potential upward movement and may help traders identify buying opportunities.",
            "pubDate": "2025-11-19T03:36:15.232465"
        },
        {
            "title": "Inside the short-selling trap of Groww's near multibagger surge: What happened and what it means for investors?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inside-the-short-selling-trap-of-growws-near-multibagger-surge-what-happened-and-what-it-means-for-investors/articleshow/125425202.cms",
            "description": "Groww shares faced unusual settlement problems after a strong rally. Over 30 lakh shares went into auction due to short sellers unable to deliver. A short squeeze intensified the price rise. While the auction settled deliveries, investors now watch for fundamental trading as extreme pressures ease. Valuations are a key concern for the future.",
            "pubDate": "2025-11-19T03:36:15.232560"
        },
        {
            "title": "Stocks to buy in 2025 for long term: Sun Tv, Glenmark Pharma among 5 stocks that could give 17-33% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-sun-tv-glenmark-pharma-among-5-stocks-that-could-give-17-33-return/slideshow/125425104.cms",
            "description": "Analysts remain broadly bullish across sectors, with multiple brokerages issuing fresh Buy calls and highlighting meaningful upside potential.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-11-19T03:36:15.232655"
        },
        {
            "title": "Negative Breakout: These 12 stocks cross below their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/negative-breakout-these-12-stocks-cross-below-their-200-dmas/slideshow/125425040.cms",
            "description": "In the Nifty500 pack, 12 stocks' close prices crossed below their 200 DMA (Daily Moving Averages) on November 18, according to stockedge.com's technical scan data. Trading below the 200 DMA is considered a negative signal because it indicates that the stock's price is below its long-term trend line. The 200 DMA is used as a key indicator by traders for determining the overall trend in a particular stock. Take a look:",
            "pubDate": "2025-11-19T03:36:15.232749"
        },
        {
            "title": "S&P 500 ends down for a 4th day as valuation worries weigh, Home Depot drops",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-ends-down-for-a-4th-day-as-valuation-worries-weigh-home-depot-drops/articleshow/125424871.cms",
            "description": "Indian markets mirrored global sentiment as US stocks tumbled, driven by tech stock valuations and a weak Home Depot forecast. Investors eagerly await Nvidia's results amid AI exuberance concerns. Job market data also showed a cooling trend, adding to market jitters. Despite strong overall earnings, fears are circulating.",
            "pubDate": "2025-11-19T03:36:15.232840"
        },
        {
            "title": "US market slide frays investors' nerves with AI trade, rate-cut doubts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-slide-frays-investors-nerves-with-ai-trade-rate-cut-doubts/articleshow/125424665.cms",
            "description": "U.S. stocks are experiencing their biggest pullback in months, raising investor nerves ahead of key tests for the AI trade and interest rate cut expectations. Nvidia's earnings report and upcoming employment data will be crucial in determining the market's direction as investors assess economic health and potential Fed policy shifts.",
            "pubDate": "2025-11-19T03:36:15.232944"
        },
        {
            "title": "GIFT Nifty up 35 points; here's the trading setup for today's session",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pre-market-action-heres-the-trade-setup-for-todays-session/articleshow/125424454.cms",
            "description": "Equity markets declined on Tuesday as investors booked profits amid diminished expectations of a US Fed rate cut. Analysts suggest progress on the Indo-US trade deal and a strong domestic earnings outlook could revive confidence and support the Nifty's ascent towards 26,000. The India VIX rose, indicating increased market fear.",
            "pubDate": "2025-11-19T03:36:15.233047"
        },
        {
            "title": "Stocks in news: Groww, HUL, Infosys, Sequent Scientific, TCS, Azad Engineering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-groww-hul-infosys-sequent-scientific-tcs-azad-engineering/articleshow/125424423.cms",
            "description": "Indian markets experienced a volatile trading session on weekly expiry day, declining by nearly half a percent. This extends the current consolidation phase. Analysts suggest a cautiously optimistic undertone supported by firm domestic macro indicators. Several companies like Groww, HUL, Adani Ports, TCS, and Infosys are in focus due to recent developments and upcoming corporate actions.",
            "pubDate": "2025-11-19T03:36:15.233142"
        },
        {
            "title": "Asian shares fluctuate after three-day selloff",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-shares-fluctuate-after-three-day-selloff/articleshow/125424401.cms",
            "description": "Asian equities showed mixed performance as global markets reacted to Wall Street's sharp losses, particularly in tech stocks driven by AI concerns. Investors are closely watching Nvidia's earnings report and the Federal Reserve's potential interest rate decisions amid renewed market volatility and mixed economic data.",
            "pubDate": "2025-11-19T03:36:15.233235"
        },
        {
            "title": "FPIs favour Indian debt inclusion in Bloomberg's Global Aggregate Index",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-favour-indian-debt-inclusion-in-bloombergs-global-aggregate-index/articleshow/125424343.cms",
            "description": "Foreign portfolio investors have offered positive feedback on Bloomberg Aggregate Index services, boosting the likelihood of Indian debt being included in the global index. Participants cited ease of trading, India's sovereign rating, and competitive bond returns as key factors. This follows India's inclusion in the emerging market local currency bond index earlier this year.",
            "pubDate": "2025-11-19T03:36:15.233325"
        },
        {
            "title": "ED widens probe into 50+ entities over penny stock laundering",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ed-widens-probe-into-50-entities-over-penny-stock-laundering/articleshow/125424262.cms",
            "description": "The Enforcement Directorate is investigating over 50 individuals and firms for alleged money laundering through penny stock price rigging. Notices have been issued under the PMLA, requiring disclosure of financial information and associations with manipulated companies. This probe follows a raid on a tech firm, uncovering a syndicate involved in elaborate stock manipulation schemes.",
            "pubDate": "2025-11-19T03:36:15.233417"
        },
        {
            "title": "Why has CreditAccess Grameen fallen nearly 10% since its Q2 results?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/why-has-creditaccess-grameen-fallen-nearly-10-since-its-q2-results/articleshow/125424242.cms",
            "description": "CreditAccess Grameen's stock has declined due to concerns over higher credit costs stemming from delayed improvement in its portfolio at risk. Despite accelerated write-offs in H1 FY26, the company is focusing on customer accretion and enhancing borrower quality. Analysts anticipate improved return ratios in the latter half of the fiscal year.",
            "pubDate": "2025-11-19T03:36:15.233514"
        },
        {
            "title": "Operating in niche areas & having gone through many business cycles: 5 small-cap stocks that fit the bill for long-term investors",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/operating-in-niche-areas-having-gone-through-many-business-cycles-5-small-cap-stocks-that-fit-the-bill-for-long-term-investors/articleshow/125424158.cms",
            "description": "A few more weeks of the Nifty and Sensex moving upward, and investors will again start to look at small-cap stocks with interest. Nothing wrong with that. But when it comes to small-caps, just check if the company has some advantage. It could be a product, a brand, a niche segment, or that it meets certain financial criteria. If it has some of these, then buy it and ride the rally over the long term to create wealth. The key words here are long term.",
            "pubDate": "2025-11-19T03:36:15.233604"
        },
        {
            "title": "Groww shares hit 10% lower circuit after 90% relentless gain; analysts say book profits",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shares-hit-10-lower-circuit-after-90-relentless-gain-analysts-say-book-profits/articleshow/125427250.cms",
            "description": "Groww’s parent, Billionbrains Garage Venture, hit a 10% lower circuit after a steep post-listing rally of over 90%, signalling early selling pressure. Analysts attribute the decline to stretched valuations and rally fatigue, especially as peers like Angel One and Motilal Oswal trade at lower market caps. While the long-term story remains strong, experts caution that cyclical industry trends and potential regulatory changes could impact growth.",
            "pubDate": "2025-11-19T04:52:41.276154"
        },
        {
            "title": "Slowly, but surely! 6 brokers see earnings improving ahead after Q2 results. 50 stocks to buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/slowly-but-surely-6-brokers-see-earnings-improving-ahead-after-q2-results-50-stocks-to-buy/articleshow/125426959.cms",
            "description": "Indian companies are showing signs of earnings improvement following Q2 results, with six brokers anticipating steadier profit growth in upcoming quarters. While large-cap stocks appear safer, margins may have peaked. Analysts are optimistic but cautious, with around 50 buy-rated stocks identified across various sectors, including banking, autos, and IT.",
            "pubDate": "2025-11-19T04:52:41.276303"
        },
        {
            "title": "Big relief coming as India-US trade deal inches closer. 10 stocks with upside of 34%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/big-relief-coming-as-india-us-trade-deal-inches-closer-10-stocks-with-upside-of-34/slideshow/125427036.cms",
            "description": "Investor sentiment could turn positive after the government signaled that an India–US trade pact is nearing completion, with both sides close to resolving tariff-related issues. A smoother trade framework could boost export-oriented and globally linked sectors. These ten stocks, identified using data from Stock Reports Plus, may see tailwinds if the deal unlocks better market access.",
            "pubDate": "2025-11-19T04:52:41.276414"
        },
        {
            "title": "Tenneco Clean Air India shares make a healthy D-St debut, list at 27% premium on NSE",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tenneco-clean-air-india-shares-make-a-healthy-d-st-debut-list-at-27-premium-on-nse/articleshow/125426901.cms",
            "description": "Tenneco Clean Air India shares: Tenneco Clean Air India made a strong market debut, listing at a 27% premium on the NSE and 25.4% on the BSE. The Rs 3,600-crore IPO, an entirely offer-for-sale issue, saw heavy institutional interest, with overall subscription at 61.79 times, led by QIBs at 174.78 times. The robust response highlights investor confidence in the company’s business model and global pedigree.",
            "pubDate": "2025-11-19T04:52:41.276519"
        },
        {
            "title": "Waaree Energies shares tumble 6% as Income Tax Department visits offices across India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/waaree-energies-shares-tumble-6-as-income-tax-department-visits-offices-across-india/articleshow/125426823.cms",
            "description": "Shares of Waaree Energies fell up to 6% after Income Tax officials visited its facilities for an investigation. The company, which reported strong Q2 net profit growth of 133% to Rs 842 crore, confirmed full cooperation with authorities. An interim dividend of Rs 2/share was recently paid.",
            "pubDate": "2025-11-19T04:52:41.276618"
        },
        {
            "title": "Foreign holdings of US treasuries slip for first time in six months",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/foreign-holdings-of-us-treasuries-slip-for-first-time-in-six-months/slideshow/125426916.cms",
            "description": "Foreign holdings of U.S. Treasuries declined in September for the first time in six months, according to data released after the Treasury Department’s 43-day shutdown. The slight pullback comes ahead of the next update, with October data scheduled for release on December 18. (Source: Reuters)",
            "pubDate": "2025-11-19T04:52:41.276717"
        },
        {
            "title": "Buy, Sell or Hold: Nuvama on Titagarh Rail System; Motilal Oswal initiates coverage on PB Fintech",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/buy-sell-or-hold-nuvama-on-titagarh-rail-system-motilal-oswal-initiates-coverage-on-pb-fintech/articleshow/125426399.cms",
            "description": "The crypto market experienced a sharp downturn, wiping out nearly Rs 1 trillion in just six weeks as Bitcoin fell below USD 90,000. The sudden decline has triggered widespread investor concern and renewed fears of a major market crash in digital assets.",
            "pubDate": "2025-11-19T04:52:41.276819"
        },
        {
            "title": "2026 IPOs bigger & better: Focus on Reliance Jio, NSE, Flipkart, SBI MF, Zepto, PhonePe, more",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/2026-ipos-bigger-better-focus-on-reliance-jio-nse-flipkart-sbi-mf-zepto-phonepe-more/slideshow/125426649.cms",
            "description": "India’s primary market is preparing for one of its biggest years, with Equirus Capital projecting IPO fundraising of nearly Rs 1.77 lakh crore in 2026. The pipeline includes some of the country’s most anticipated listings across technology, finance and telecom. Here are 10 biggest issues",
            "pubDate": "2025-11-19T04:52:41.276914"
        },
        {
            "title": "Sensex slips over 50 pts, Nifty drops below 25,900 as D-St awaits cues on India–US trade talks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-slips-over-50-pts-nifty-drops-below-25900-as-d-st-awaits-cues-on-indiaus-trade-talks/articleshow/125426441.cms",
            "description": "On a lackluster Wednesday, Indian stock markets registered a downturn, with the Sensex and Nifty both halting their upward momentum. Global sentiments echoed this caution, as traders awaited clearer signals regarding a prospective trade agreement between India and the US. The Sensex fell 82 points while the Nifty 50 experienced a 31-point decline right at the open.",
            "pubDate": "2025-11-19T04:52:41.277010"
        },
        {
            "title": "Worried about an AI stock bubble? That might be good news for Nifty bulls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/worried-about-an-ai-stock-bubble-that-might-be-good-news-for-nifty-bulls/articleshow/125426521.cms",
            "description": "Global investors are eyeing India as the AI stock frenzy shows signs of a bubble, potentially shifting capital from tech giants to Indian equities.  Experts suggest this rotation could boost India's Nifty50, which has lagged due to AI-driven flows into Taiwan and South Korea. India's market, less reliant on AI, offers a potential haven.",
            "pubDate": "2025-11-19T04:52:41.277106"
        },
        {
            "title": "KP Energy shares soar 8% on MoU with Inox Wind to develop 2.5 GW renewable projects across India",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inox-wind-kp-energy-shares-in-focus-on-mou-to-develop-2-5-gw-renewable-projects-across-india/articleshow/125426280.cms",
            "description": "Inox Wind and KP Energy have signed an exclusive MoU to jointly develop 2.5 GW of wind and wind-solar hybrid projects across multiple states. Inox Wind will supply turbines, engineering support, and handle turbine commissioning and O&M, while KP Energy will manage land, approvals, connectivity, and balance-of-plant EPC and O&M. The collaboration aims to streamline project execution and boost efficiency.",
            "pubDate": "2025-11-19T04:52:41.277219"
        },
        {
            "title": "Bharti Airtel among 5 stocks that witnessed 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-among-5-stocks-that-witnessed-5-year-swing-high-breakout/slideshow/125426160.cms",
            "description": "In the NSE list of stocks with a market cap over Rs 1,000 crore, five stocks witnessed a 5-year swing high at the close on November 18, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-11-19T04:52:41.277315"
        },
        {
            "title": "Infosys shares gain 3% as firm launches Rs 18,000 crore buyback on November 20",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-shares-gain-3-as-firm-launches-rs-18000-crore-buyback-on-november-20/articleshow/125427734.cms",
            "description": "Infosys shares jumped 3% to Rs 1,531 on 19 November as the company announced its Rs 18,000 crore buyback opening on 20 November. The tender offer allows repurchase at Rs 1,800 per share, with entitlements set for small and other shareholders. The process closes on 26 November, marking Infosys’ first tender buyback since 2017.",
            "pubDate": "2025-11-19T05:26:04.875331"
        },
        {
            "title": "Record surge in reverse stock splits signals stress for smallcap companies",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/record-surge-in-reverse-stock-splits-signals-stress-for-smallcap-companies/slideshow/125427771.cms",
            "description": "Reverse stock splits globally have surged to a record this year, highlighting the pressure on small-cap companies. This comes as AI-driven rallies push technology giants to fresh highs. Through October, companies executed 288 reverse splits, compared with just 53 traditional splits. (Source: Reuters)",
            "pubDate": "2025-11-19T05:26:04.875456"
        },
        {
            "title": "US unemployment data points to weak October jobs report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-unemployment-data-points-to-weak-october-jobs-report/slideshow/125427476.cms",
            "description": "The number of Americans receiving jobless benefits surged between mid-September and mid-October, indicating an elevated unemployment rate in October. Continuing claims, which track individuals receiving benefits after an initial week of aid, rose to 1.957 million in the week ended October 18, up from 1.916 million in mid-September. Despite this increase, first-time claims remained unchanged, suggesting some stability in the labour market. (Source: Reuters)",
            "pubDate": "2025-11-19T05:26:04.875989"
        },
        {
            "title": "Groww shorts a Rs 100 crore lesson on greed. Abhijit Chokshi explains how",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-shorts-a-rs-100-crore-lesson-on-greed-abhijit-chokshi-explains-how/articleshow/125430091.cms",
            "description": "Groww’s first major post-listing setback has triggered a massive settlement crunch, with more than 30 lakh shares pushed into NSE’s auction window after traders shorted the stock and failed to deliver. Abhijit Chokshi says misplaced bets against Groww’s rally have now snowballed into a Rs 100-crore lesson on T+1 deadlines, delivery shortages, and market discipline.",
            "pubDate": "2025-11-19T07:59:36.350978"
        },
        {
            "title": "Japan's Nikkei retreats for 4th day on tech valuation concerns",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/japans-nikkei-retreats-for-4th-day-on-tech-valuation-concerns/articleshow/125429899.cms",
            "description": "Japan's Nikkei index fell for the fourth consecutive day. Investors are cautious ahead of key earnings from artificial intelligence giant Nvidia. The Nikkei 225 closed lower, extending its longest losing streak in seven weeks. Concerns over technology stock valuations and rising bond yields are impacting the market. All eyes are on Nvidia's performance to gauge future market direction.",
            "pubDate": "2025-11-19T07:59:36.351081"
        },
        {
            "title": "Motilal Oswal’s top 10 small, midcap picks that can deliver strong EPS by FY28. How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/motilal-oswals-top-10-small-midcap-picks-that-can-deliver-strong-eps-by-fy28-how-many-do-you-own/slideshow/125428331.cms",
            "description": "Motilal Oswal has released its latest list of preferred midcap and smallcap stocks following the Q2 earnings season, highlighting companies with strong growth potential and improving earnings visibility. The selection spans internet, manufacturing, consumer, IT and specialty sectors, offering a closer look at each company’s market size, current share price, and projected earnings per share for FY26 through FY28. This slideshow breaks down all eleven stocks individually, presenting a crisp earnings outlook",
            "pubDate": "2025-11-19T07:59:36.351176"
        },
        {
            "title": "YES Bank share price dips 0.4% amid Sensex decline in afternoon trade",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/yes-bank-share-price-dip-0-4-amid-sensex-decline-in-afternoon-trading/articleshow/125429656.cms",
            "description": "YES Bank stock price today (19-11-2025): The shares opened at Rs 22.99, reaching an intraday high of Rs 22.99 and a low of Rs 22.76 during the session. The stock has a 52-week high of Rs 24.3 and a low of Rs 16.02. The previous day's closing price was Rs 22.99, with 30,139,454 shares traded by 12:16 PM (IST).",
            "pubDate": "2025-11-19T07:59:36.351276"
        },
        {
            "title": "IPO GMP hunters missed Groww’s 94% rally. Are you also chasing the wrong cues?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ipo-gmp-hunters-missed-growws-94-rally-are-you-also-chasing-the-wrong-cues/articleshow/125429489.cms",
            "description": "Retail investors who ignored Groww's IPO due to a low grey market premium are now regretting their decision. The stock experienced a significant rally post-listing, driven by fear of missing out. This surge pushed Groww's market capitalization past Rs 1 lakh crore. While valuations have climbed, the company's strong business fundamentals and dominant platform support long-term demand.",
            "pubDate": "2025-11-19T07:59:36.351390"
        },
        {
            "title": "Pakistan’s mom-and-pop investors drive 40% rally in stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/pakistans-mom-and-pop-investors-drive-40-rally-in-stocks/articleshow/125429076.cms",
            "description": "Pakistan's stock market is experiencing a significant surge, driven by retail investors seeking alternatives to stagnant property and low-yield deposits. The KSE-100 Index has climbed approximately 40% in 2025, fueled by improved government stability and economic reforms. This rally marks a rare moment of confidence, with new trading accounts and increased daily turnover indicating growing domestic participation.",
            "pubDate": "2025-11-19T07:59:36.351489"
        },
        {
            "title": "Azad Engineering shares jump 5% after signing long-term agreement with Pratt & Whitney Canada",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/azad-engineering-shares-jump-5-after-signing-long-term-agreement-with-pratt-whitney-canada/articleshow/125428990.cms",
            "description": "Azad Engineering shares jumped after the company announced a major pact with Pratt & Whitney Canada. It has signed a Master Terms Agreement and Purchase Agreement to develop and manufacture aircraft engine components. The long-term partnership aims to boost Azad’s aerospace manufacturing capabilities and support advanced component production for global programs, in line with India’s strategic priorities.",
            "pubDate": "2025-11-19T07:59:36.351582"
        },
        {
            "title": "Infosys, TCS, HCL Tech and other IT stocks jump up to 4%. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-tcs-hcl-tech-and-other-it-stocks-jump-up-to-4-heres-why/articleshow/125428800.cms",
            "description": "Indian IT stocks witnessed a sharp rise on Wednesday as a global anti-AI trade drove investors toward safer technology names. Analysts say fading enthusiasm for AI stocks could boost FPI flows into India, while Infosys also drew attention ahead of its Rs 18,000-crore share buyback opening Thursday.",
            "pubDate": "2025-11-19T07:59:36.351672"
        },
        {
            "title": "Tenneco Clean Air shares slide 5% in debut trade after solid listing pop. Should you buy, sell or hold?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tenneco-clean-air-shares-slide-5-in-debut-trade-after-solid-listing-pop-should-you-buy-sell-or-hold/articleshow/125428746.cms",
            "description": "Tenneco Clean Air India made a strong market debut with a 27% listing premium before slipping nearly 5% as early profit-taking set in. Analysts cite strong parentage, technological capability, and margin strength, but advise caution given sector cyclicality. Experts suggest partial profit-booking while holding the remainder with a stop-loss near Rs 480.",
            "pubDate": "2025-11-19T07:59:36.351762"
        },
        {
            "title": "Morgan Stanley sees multi-year growth runway for LG Electronics as it initiates coverage; stock jumps 3%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/morgan-stanley-sees-multi-year-growth-runway-for-lg-electronics-as-it-initiates-coverage-stock-jumps-3/articleshow/125428401.cms",
            "description": "LG Electronics India shares saw an uptick on Wednesday after Morgan Stanley initiated coverage on the stock with an overweight rating, highlighting strong margins, capital efficiency, and growth potential from new manufacturing, exports, and B2B operations. While near-term FY26 earnings may dip, medium-term expansion and localisation efforts are expected to drive revenue, margins, and steady earnings growth through FY28, the brokerage said.",
            "pubDate": "2025-11-19T07:59:36.351854"
        },
        {
            "title": "Tata Steel shares see volume spike after strong Q2 results; Analyst sees nearly 20% upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tata-steel-shares-see-volume-spike-after-strong-q2-results-analyst-sees-nearly-20-upside/articleshow/125428084.cms",
            "description": "Tata Steel shares saw a slight increase after strong September quarter results. The company reported significant profit growth year-on-year and quarter-on-quarter. Revenue also climbed, indicating improved operations. Analysts maintain a positive long-term view, reiterating a 'BUY' rating with a target price suggesting potential upside. Technical indicators show neutral momentum with some short-term weakness.",
            "pubDate": "2025-11-19T07:59:36.351950"
        },
        {
            "title": "Wild ride with Billionbrains! 3 reasons why Groww shares are seeing such sharp price swings",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wild-ride-with-billionbrains-3-reasons-why-groww-shares-are-seeing-such-sharp-price-swings/articleshow/125428171.cms",
            "description": "Groww shares have seen wild swings post-listing due to strong initial demand, extremely low free float of just 7%, and rich valuations. Heavy early buying and short-covering have amplified volatility, while tech-style multiples for a cyclical, competitive broking business are putting pressure. Price swings in Groww shares may continue as sentiment, fundamentals, and technical factors interact.",
            "pubDate": "2025-11-19T07:59:36.352042"
        },
        {
            "title": "Infosys’ Rs 18,000-crore share buyback from tomorrow: What you need to know before tendering your shares",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/infosys-rs-18000-crore-share-buyback-from-tomorrow-what-you-need-to-know-before-tendering-your-shares/articleshow/125432748.cms",
            "description": "Infosys is set to launch its Rs 18,000-crore share buyback on November 20, closing on November 26. The buyback allows the IT giant to repurchase up to 10 crore shares at Rs 1,800 each via the tender offer route. Shareholders as of the record date, November 14, are eligible. Kotak Mahindra Capital manages the issue, with KFin Technologies as registrar.",
            "pubDate": "2025-11-19T09:27:44.247337"
        },
        {
            "title": "Not just Groww, Dalal Street debutants PhysicsWallah, Lenskart slide up to 8%. What should investors do?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/not-just-groww-dalal-street-debutants-physicswallah-lenskart-slide-up-to-8-what-should-investors-do/articleshow/125431601.cms",
            "description": "Three of India’s newest stock market entrants hit their first real stretch of turbulence on Wednesday, as volatile swings, brisk profit-taking and an unusual auction-triggering short squeeze tested investor conviction. Analysts say the corrective moves reflect a shift from debut euphoria to fundamentals, as investors recalibrate near-term risks and reassess positioning after steep post-listing rallies.",
            "pubDate": "2025-11-19T09:27:44.247467"
        },
        {
            "title": "'The market is not unlimited as many think': Ambit says sell Swiggy in a scathing report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/the-market-is-not-unlimited-as-many-think-ambit-says-sell-swiggy-in-a-scathing-report/articleshow/125431274.cms",
            "description": "Ambit has issued a scathing SELL call on Swiggy, warning its Rs 10,000-crore fundraising plan could worsen losses in the fiercely competitive quick-commerce market. The brokerage says Instamart is lagging Blinkit in scale and efficiency, the market’s growth potential is capped, and Swiggy may need aggressive spending just to hold its ground, limiting long-term profitability.",
            "pubDate": "2025-11-19T09:27:44.247688"
        },
        {
            "title": "Stock Radar: FACT stock makes multiple bottoms around 200-DMA since October; time to buy or book profits?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-fact-stock-makes-multiple-bottoms-around-200-dma-since-october-time-to-buy-or-book-profits/articleshow/125408723.cms",
            "description": "Fertilisers and Chemicals Travancore Ltd stock is showing signs of recovery. Experts suggest buying the stock for potential gains in the coming weeks. The stock has found strong support near its 200-day moving average. This indicates a positive outlook for the fertiliser company. Traders can consider this opportunity for short-term investment.",
            "pubDate": "2025-11-19T11:51:08.401163"
        },
        {
            "title": "Rupee ends nearly flat, wedged between competing merchant flows",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-rupee-rupee-ends-nearly-flat-wedged-between-competing-merchant-flows/articleshow/125434821.cms",
            "description": "The dollar swung between gains and losses against major peers as investors awaited key U.S. economic data and commentary from Federal Reserve officials to gauge the U.S. monetary policy path",
            "pubDate": "2025-11-19T11:51:08.401291"
        },
        {
            "title": "MF Favourites: 13 microcap stocks soar 70-150% so far in FY26; 5 turn multibaggers",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mf-favourites-13-microcap-stocks-soar-70-150-in-fy26-so-far-5-turn-multibaggers/slideshow/125434047.cms",
            "description": "India’s smallest listed companies are off to a powerful start in FY26. The Nifty Microcap 250 Index is up about 14%, outpacing the Nifty 50’s 10% rise, but the real story lies deeper—where several microcaps have delivered eye-popping gains, with some turning multibaggers in under eight months.To add credibility to this high-risk space, we filtered for microcap stocks owned by over 10 mutual fund schemes—188 names met the criteria. From these, 13 standout stocks have surged 70% to 150% so far in FY26, with five already doubling investor wealth. (Data Source: ACE Equity, ACE MF)",
            "pubDate": "2025-11-19T11:51:08.401401"
        },
        {
            "title": "Sammaan Capital shares tank 14% as Supreme Court directs CBI to file FIR in probe",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sammaan-capital-shares-tank-14-as-supreme-court-directs-cbi-to-file-fir-in-probe/articleshow/125434078.cms",
            "description": "Sammaan Capital shares dropped sharply after the Supreme Court ordered the CBI to file an FIR. The court criticized the CBI and Ministry of Corporate Affairs for a 'friendly approach'. SEBI's reluctance to probe was also questioned. The ED will hold a joint meeting with other agencies. Sammaan Capital stated regulators found no wrongdoing in past examinations.",
            "pubDate": "2025-11-19T11:51:08.401504"
        },
        {
            "title": "Market Wrap: Sensex climbs 513 points, Nifty reclaims 26,000 as D-St shakes off early weakness on IT strength",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-wrap-sensex-climbs-513-points-nifty-reclaims-26000-as-d-st-shakes-off-early-weakness-on-it-strength/articleshow/125433933.cms",
            "description": "Indian stock markets rallied strongly on Wednesday, with both Sensex and Nifty recovering from early dips. A surge in foreign investment and a comeback by key IT companies bolstered investor confidence. Infosys spearheaded the gains, anticipating its substantial share buyback program commencing Thursday. This positive momentum signals a strengthening market sentiment.",
            "pubDate": "2025-11-19T11:51:08.401605"
        },
        {
            "title": "Adani Enterprises arm completes 13% stake sale worth Rs 4,646 cr in AWL to Wilmar subsidiary",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/adani-enterprises-arm-completes-13-stake-sale-worth-rs-4646-cr-in-awl-to-wilmar-subsidiary/articleshow/125437520.cms",
            "description": "Adani Enterprises completed a Rs 4,646 crore off-market sale of a 13% stake in AWL Agri Business to Wilmar’s subsidiary Lence, revising shareholdings and terminating the earlier shareholders’ agreement while AWL shares gained and Adani Enterprises ended marginally lower",
            "pubDate": "2025-11-19T12:45:14.412363"
        },
        {
            "title": "Bharti Airtel, Hero MotoCorp among 8 stocks that hit 52-week highs; gains up to 20% in a month",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bharti-airtel-hero-motocorp-among-8-stocks-that-hit-52-week-highs-gains-up-to-20-in-a-month/slideshow/125436902.cms",
            "description": "On Wednesday, the benchmark Sensex rose 513 points to close at 85,186. During this rally, eight stocks in the BSE 100 Index hit their 52-week highs, reaching their strongest levels in a year. Such breakouts are typically seen by traders and investors as bullish indicators, suggesting solid upward momentum and the potential for additional short-term gains",
            "pubDate": "2025-11-19T12:45:14.412469"
        },
        {
            "title": "Nvidia shares rise up to 2% in pre-market trade ahead of Q3 earnings. Here's what to expect",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nvidia-shares-rise-up-to-2-in-pre-market-trade-ahead-of-q3-earnings-heres-what-to-expect/articleshow/125439671.cms",
            "description": "Nvidia’s quarterly earnings will dominate Wall Street as analysts expect strong revenue and EPS growth. While AI optimism is high, experts warn that much of the good news may already be priced in, increasing downside risk if guidance disappoints.Nvidia’s quarterly earnings will dominate Wall Street as analysts expect strong revenue and EPS growth. While AI optimism is high, experts warn that much of the good news may already be priced in, increasing downside risk if guidance disappoints",
            "pubDate": "2025-11-19T14:38:00.560158"
        },
        {
            "title": "Portfolio Rejig: LIC trims stake in state-owned refiner BPCL to 6.75%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/portfolio-rejig-lic-trims-stake-in-state-owned-refiner-bpcl/articleshow/125438490.cms",
            "description": "LIC has pared its stake in BPCL from 8.75% to 6.75% even as the state-run refiner delivered a strong Q2FY26 performance. BPCL’s net profit surged 169% to Rs 6,442 crore, supported by higher refining margins and steady fuel demand. Revenue rose 3%, while refineries operated at 111% capacity with modest sales growth",
            "pubDate": "2025-11-19T14:38:00.560290"
        },
        {
            "title": "Gainers & Losers: Infosys, Jaiprakash Power, Groww among top movers on Wednesday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gainers-losers-infosys-jaiprakash-power-groww-among-top-movers-on-wednesday/slideshow/125438039.cms",
            "description": "",
            "pubDate": "2025-11-19T14:38:00.560631"
        },
        {
            "title": "SC pulls up CBI, slams Sebi's 'double standards' over 'reluctance' to probe allegations against Indiabulls",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sc-pulls-up-cbi-slams-sebis-double-standards-over-reluctance-to-probe-allegations-against-indiabulls/articleshow/125437633.cms",
            "description": "The judge further said, \"Every day we are seeing double standards of SEBI. In one of the matters where I constituted a high-powered committee, your stand was that only SEBI has the right to auction the properties. And what you have been auctioning, we know that! A property worth Rs 30 crore was sold for just Rs 2 lakh.\"",
            "pubDate": "2025-11-19T14:38:00.560737"
        },
        {
            "title": "Market Trading Guide: Buy HCL Tech and this smallcap multibagger on Thursday for up to 9% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-hcl-tech-and-this-smallcap-multibagger-on-thursday-for-up-to-9-gains/articleshow/125440017.cms",
            "description": "IT stocks lifted benchmarks as Nifty held firm above its 50EMA and staged a strong rebound. A falling channel breakout and bullish RSI signalled improving sentiment, with analysts eyeing higher levels while recommending HCL Tech and Arvind for near-term upside.IT stocks lifted benchmarks as Nifty held firm above its 50EMA and staged a strong rebound. A falling channel breakout and bullish RSI signalled improving sentiment, with analysts eyeing higher levels while recommending HCL Tech and Arvind for near-term upside",
            "pubDate": "2025-11-19T14:51:06.612896"
        },
        {
            "title": "US stocks open higher as Nvidia test looms",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-open-higher-as-nvidia-test-looms/articleshow/125440091.cms",
            "description": "Wall Street's main indexes opened slightly higher on Wednesday following sharp losses earlier in the week, as investors set their eyes on Nvidia's earnings which could prove to be a make-or-break moment for the AI trade.",
            "pubDate": "2025-11-19T14:51:06.613025"
        },
        {
            "title": "Market Trading Guide: BuyHCL Tech and this smallcap multibaggeron Thursday for up to 9% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buyhcl-tech-and-this-smallcap-multibaggeron-thursday-for-up-to-9-gains/slideshow/125441526.cms",
            "description": "",
            "pubDate": "2025-11-19T16:13:36.151027"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Thursday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-thursday/articleshow/125441246.cms",
            "description": "Indian markets recovered from early losses as renewed foreign inflows and strong IT stocks, led by Infosys, boosted the Sensex and Nifty. Optimism over an India–U.S. trade deal, supportive global cues and technical strength improved sentiment, though broader market breadth remained weak.",
            "pubDate": "2025-11-19T16:13:36.151151"
        },
        {
            "title": "Two Trades for Today: An automotive components major for a 7.1% upmove, a large-cap IT stock for an almost 7% gain",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-automotive-components-major-for-a-7-1-upmove-a-large-cap-it-stock-for-an-almost-7-gain/articleshow/125440822.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-19T16:13:36.151265"
        },
        {
            "title": "Multibagger or IBC - Part 33: An auto ancillary caught between ICE engine & EV battery, will management be able to sail through?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/multibagger-or-ibc-part-33-an-auto-ancillary-caught-between-ice-engine-ev-battery-will-management-be-able-to-sail-through/articleshow/125441689.cms",
            "description": "The auto sector’s transition is testing companies whose revenue depends heavily on ICE vehicles. This story tracks an auto ancillary shaped by its long presence in combustion technology. Much of its revenue still comes from engine-oriented assemblies, leaving it exposed as OEMs transition to EVs. Although it has launched new electronic modules for the EV ecosystem, the revenue picture is unclear. Its financials show a strong earlier phase followed by declining earnings, and two years of losses. Debt is high and reserves low. The question now: Can this legacy-oriented business align itself with a changing auto sector? This series on auto ancillary companies works with the assumption that, from the whole set of auto ancillary companies, some multibagger stocks will emerge. And some companies in this space risk going bankrupt.",
            "pubDate": "2025-11-19T16:56:44.303175"
        },
        {
            "title": "Block deals today: Goldman Sachs, BofA sell Rs 119 crore worth shares in RIL, HDFC Bank and Apollo Hospitals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/block-deals-today-goldman-sachs-bofa-sell-rs-119-crore-worth-shares-in-ril-hdfc-bank-and-apollo-hospitals/articleshow/125442099.cms",
            "description": "Major block deals took place on D-Street involving Reliance Industries, HDFC Bank, and Apollo Hospitals. Goldman Sachs sold shares in RIL and HDFC Bank. BofA offloaded Apollo Hospitals shares. Blue Pearl Map I LP and Kadensa Master Fund were buyers. IT and financial stocks boosted the Nifty and Sensex.",
            "pubDate": "2025-11-19T16:56:44.303295"
        },
        {
            "title": "Market Trading Guide: Buy HCL Tech and this smallcap multibagger on Thursday for up to 9% gains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buyhcl-tech-and-this-smallcap-multibaggeron-thursday-for-up-to-9-gains/slideshow/125441516.cms",
            "description": "IT stocks hogged the limelight, helping heartbeat indices Nifty and the BSE Sensex close in the green. The Nifty remained strong throughout the day as it found support at the 50EMA on the hourly chart and staged a smart recovery. Commenting on the day's action, Rupak De, Senior Technical Analyst at LKP Securities said that a falling channel breakout is visible in Nifty on the hourly chart, suggesting rising optimism. \"The daily RSI (14) is in a bullish crossover and remains above 60. Overall, sentiment looks positive, with a potential move towards 26,200/26,350 in the near term. On the lower end, support is placed at 25,850,\" De said.Here are 2 stock recommendations for Thursday:",
            "pubDate": "2025-11-19T16:56:44.303400"
        },
        {
            "title": "These mid-cap stocks with ‘Strong Buy’ & ‘Buy’ recos can rally over 25%, according to analysts",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/these-mid-cap-stocks-with-strong-buy-buy-recos-can-rally-over-25-according-to-analysts/articleshow/125444085.cms",
            "description": "Can we say valuations are currently fairly priced in the mid-cap segment? The answer is no. Does it mean that you should avoid the segment altogether? The answer is again no. Over the next few quarters, stock price trends and the absolute value of stock prices will be impacted by the fundamentals of the sector as well as valuations. And the fundamentals are currently improving for some industries.",
            "pubDate": "2025-11-19T19:44:08.952376"
        }
    ]
}