{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-02T18:20:15.305140",
    "items": [
        {
            "title": "Federal Bank Q1 Results: Standalone net profit falls 15% YoY to Rs 862 crore; NII up 2%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/federal-bank-q1-results-standalone-net-profit-falls-15-yoy-to-rs-862-crore-nii-up-2/articleshow/123060823.cms",
            "description": "Federal Bank reported a net profit of Rs 861.75 crore, a 14.6% YoY decrease, despite a 2% rise in net interest income to Rs 2,336.83 crore. The bank achieved its highest-ever other income of Rs 1,113 crore, up 21.6%. Total deposits grew by 8.03%, and net advances increased by 9.24%, driven by strong growth in retail and commercial banking loans.",
            "pubDate": "2025-08-02T18:20:13.018388"
        },
        {
            "title": "Delhivery Q1 Results: Net Profit surges 68% YoY to Rs 91 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/delhivery-q1-results-net-profit-surges-68-yoy-to-rs-91-crore/articleshow/123055662.cms",
            "description": "Delhivery reported a significant 68.5% year-on-year increase in net profit for the first quarter, reaching ₹91 crore, driven by efficient operations and consistent revenue. The company's express parcel shipments experienced a 14% volume growth, reaching 208 million. The recent acquisition of Ecom Express is expected to further boost Delhivery's market share in the 3PL segment.",
            "pubDate": "2025-08-02T18:20:13.018517"
        },
        {
            "title": "Tata Power Q1 profit rises 6% to Rs 1,262 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/tata-power-q1-profit-rises-6-to-rs-1262-crore/articleshow/123055617.cms",
            "description": "Tata Power's consolidated net profit increased by over 6% year-on-year, reaching ₹1,262 crore in the June quarter, driven by strong revenue growth in its renewable energy and transmission & distribution sectors. CEO Praveer Sinha highlighted the company's renewable energy portfolio's exceeding expectations and the reliable electricity provided to 13 million customers. Tata Power's utility-scale operational renewable energy capacity is 5.",
            "pubDate": "2025-08-02T18:20:13.018632"
        },
        {
            "title": "Adani Power goes for a 1:5 stock split, Q1 net profit dips 15%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/earnings/adani-power-goes-for-a-15-stock-split-q1-net-profit-dips-15/articleshow/123055569.cms",
            "description": "Adani Power's board has approved a stock split, dividing each share of ₹10 into five shares of ₹2, aiming to broaden retail investor participation. The company reported a 15.5% drop in its Q1 consolidated net profit to ₹3,305 crore, with revenue declining 5.9% to ₹14,167 crore. Despite this, EBITDA from continuing operations stood at ₹5,744 crore.",
            "pubDate": "2025-08-02T18:20:13.018736"
        }
    ]
}