{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-30T23:44:02.388605",
    "items": [
        {
            "title": "FPIs resume selling in Nov; withdraw Rs 3,765 cr from equities",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fpis-resume-selling-in-nov-withdraw-rs-3765-cr-from-equities/articleshow/125670214.cms",
            "description": "On the global front, uncertainty around the US Federal Reserve's rate-cut trajectory, a firm US dollar, and weak risk appetite across emerging markets kept foreign investors cautious. Persistent geopolitical tensions and volatile crude prices further reinforced the risk-off tone, said Himanshu Srivastava, Principal, Manager Research, Morningstar Investment Research India.",
            "pubDate": "2025-11-30T08:47:54.743270"
        },
        {
            "title": "9 smallcaps crash up to 61% in a week even as Nifty hit record highs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/9-smallcaps-crash-up-to-61-in-a-week-even-as-nifty-hit-record-highs/slideshow/125669440.cms",
            "description": "The benchmark Nifty scaled fresh lifetime highs in the past week, but the undercurrent in the broader market remained sharply negative. Several smallcaps corrected violently as investors rotated back into largecaps, locked in profits, and reacted to stretched valuations and thin liquidity in the wider market. The divergence between headline indices and the smallcap universe widened further, with some stocks losing over half their value in just five sessions",
            "pubDate": "2025-11-30T08:47:54.743373"
        },
        {
            "title": "Market Trading Guide: Buy Laurus Labs, Bajaj Finance and 3 more stocks on Monday for up to 8% near-term gains. Here’s why",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-buy-laurus-labs-bajaj-finance-and-3-more-stocks-on-monday-for-up-to-8-near-term-gains-heres-why/slideshow/125669319.cms",
            "description": "India’s benchmark Nifty traded within a narrow range on Friday and closed with a slight decline. Financials and IT stocks weighed on the index, while auto and FMCG names helped cushion the downside and prevented a deeper fall. The 50-stock index closed the week forming a small candlestick on the weekly chart, indicating hesitation at higher levels.Commenting on the current trends, Vatsal Bhuva, Technical Analyst at LKP Securities, said that Nifty’s RSI has drifted into a bearish crossover with lower tops on the hourly chart, suggesting bulls may take a breather at these levels. “However, support remains visible at 26,100 and 26,000, while resistance is placed at 26,300. The technical setup suggests the index may trade in a range, with immediate support at 26,100 and resistance around 26,300–26,350 levels. Closing above 26,300 levels will open the door for 26,600 levels,” Bhuva said.Here are 5 stock recommendations for Monday:",
            "pubDate": "2025-11-30T08:47:54.743487"
        },
        {
            "title": "India's Q2 GDP surprise: How markets may trade on Monday and what investors should do next?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indias-q2-gdp-surprise-how-markets-may-trade-on-monday-and-what-investors-should-do-next/articleshow/125669172.cms",
            "description": "Market momentum continued as indices strengthened within a two-month channel supported by steady sector performance and stable global cues. Short-term consolidation persisted, though sentiment stayed constructive. Technical indicators pointed to resilience despite volatility, with traders watching breakout levels as institutional flows and macro trends guided expectations for the upcoming sessions",
            "pubDate": "2025-11-30T08:47:54.743583"
        },
        {
            "title": "Mcap of 7 of top-10 most valued firms climbs by Rs 96,201 cr; Reliance, Bajaj Finance biggest winners",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mcap-of-7-of-top-10-most-valued-firms-climbs-by-rs-96201-cr-reliance-bajaj-finance-biggest-winners/articleshow/125669123.cms",
            "description": "The market capitalisation (mcap) of Hindustan Unilever edged higher by Rs 7,671.41 crore to Rs 5,79,644.16 crore, and that of State Bank of India went up by Rs 6,415.28 crore to Rs 9,04,185.15 crore",
            "pubDate": "2025-11-30T08:47:54.743682"
        },
        {
            "title": "Bajaj Finance, Tata Steel, among top 10 high conviction ideas from InCred Equities with up to 188% potential upside",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bajaj-finance-tata-steel-among-top-10-high-conviction-ideas-from-incred-equities-with-up-to-188-potential-upside/slideshow/125669056.cms",
            "description": "Indian markets witnessed a volatile week. The Nifty slipped below 25,850 in the first half, reflecting early weakness. However, a sharp recovery on Wednesday, driven by fresh buying, took the index past 26,300. While the momentum cooled in the last two sessions, the Nifty still closed slightly higher, ending just above 26,200 with modest gains of around half a per cent.After nearly 14 months, the Nifty hit its new all-time high. Yet, the broader market remained in consolidation mode around the 26,300 level. Amid this backdrop, InCred Equities has rolled out its latest high conviction stock picks. We've compiled the top 10 names from the list, each offering meaningful upside with the top pick projecting up to a significant 188% potential gain",
            "pubDate": "2025-11-30T08:47:54.743775"
        },
        {
            "title": "11 Midcap stocks with explosive upside potential; up to 40% returns in 1 year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/11-midcap-stocks-with-explosive-upside-potential-up-to-40-returns-in-1-year/slideshow/125668840.cms",
            "description": "Analyst forecasts are more than just numbers, they provide a forward-looking perspective on market potential. For investors seeking the next breakout opportunities, a fresh review of BSE MidCap stocks uncovers several promising contenders.",
            "pubDate": "2025-11-30T08:47:54.743867"
        },
        {
            "title": "RBI MPC outcome, FII flows among 8 factors to impact stock markets this week",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbi-mpc-outcome-fii-flows-among-8-factors-to-impact-stock-markets-this-week/articleshow/125668601.cms",
            "description": "The rally was underpinned largely by growing expectations of a 25 basis point rate cut by the U.S. Federal Reserve in December, which lifted global market sentiment. Hopes of progress in the Russia–Ukraine talks also lent support, raising expectations of softer crude oil prices. On the domestic front, robust growth projections and resilience in select sectors bolstered investor confidence, although persistent concerns around weak exports continued to weigh on the upside.",
            "pubDate": "2025-11-30T08:47:54.743961"
        },
        {
            "title": "Meesho sets aside Rs 480 crore from IPO for salaries. Worrying signal or smart talent investment?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/meesho-sets-aside-rs-480-crore-from-ipo-for-salaries-worrying-signal-or-smart-talent-investment/articleshow/125668535.cms",
            "description": "Meesho is witnessing strong investor interest ahead of its Rs 5,421-crore IPO, with grey market signals suggesting a ~30% listing premium over the issue price of Rs 111. The offering includes a fresh issue of Rs 4,250 crore and an OFS of 10.55 crore shares by existing investors. The IPO opens on December 3, with expectations of a robust market debut driven by upbeat demand cues.",
            "pubDate": "2025-11-30T08:47:54.744052"
        },
        {
            "title": "Wall Street predicts rebound in Indian markets after tough year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-predicts-rebound-in-indian-markets-after-tough-year/articleshow/125668199.cms",
            "description": "Wall Street giants anticipate a rebound for India's underperforming markets in 2026, citing stabilizing earnings and policy support. Despite recent headwinds from US tariffs and a weaker rupee, early signs of recovery are emerging, with potential shifts in global investment flows favoring India.",
            "pubDate": "2025-11-30T08:47:54.744140"
        },
        {
            "title": "​12 Penny stocks surged up to 318% in 3 months; 3 turned multibaggers. Do you own any?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/12-penny-stocks-surged-up-to-318-in-3-months-3-turned-multibaggers-do-you-own-any/slideshow/125668494.cms",
            "description": "In the last three months, 12 penny stocks delivered impressive gains ranging from 20% to 318%, with three turning into multibaggers. We identified these outperformers using specific filters: a market capitalisation below Rs 1,000 crore, a share price under Rs 20, and a minimum trading volume of 5 lakh shares. This approach helped spotlight low-priced, actively traded micro-cap stocks showing strong upward momentum.",
            "pubDate": "2025-11-30T08:47:54.744236"
        },
        {
            "title": "Ahead of Market: 10 things that will decide stock market action on Monday",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-stock-market-action-on-monday/articleshow/125671944.cms",
            "description": "Indian markets ended flat with a mild negative bias as investors booked profits near record highs and weighed prospects of rate cuts in the U.S. and India. Global cues, selective profit booking, resilient large caps and shifting sentiment across U.S. and European markets shaped overall direction, while technical indicators signalled consolidation ahead",
            "pubDate": "2025-11-30T11:53:06.869800"
        },
        {
            "title": "Two Trades for Today: An automotive major for a gain of 6.6%, a  mid-cap textile manufacturing stock for an almost 6% rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/two-trades-for-today-an-automotive-major-for-a-gain-of-6-6-a-mid-cap-textile-manufacturing-stock-for-an-almost-6-rise/articleshow/125674807.cms",
            "description": "Our technical analysts identify select stocks that may gain momentum even in volatile markets. Here are the technical calls for today.",
            "pubDate": "2025-11-30T15:41:42.983741"
        },
        {
            "title": "Stock Radar: Coromandel International stock showing signs of rebound; check target & stop loss",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stock-radar-coromandel-international-stock-showing-signs-of-rebound-check-target-stop-loss/articleshow/125640216.cms",
            "description": "Coromandel International stock has broken out of a month-long consolidation, signaling bulls are taking control. Experts suggest short-term traders can buy the stock for a target of Rs 2,580-2,600 in the next 1-2 months, with a stop loss below Rs 2,200.",
            "pubDate": "2025-11-30T23:44:01.434352"
        }
    ]
}