{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-18T07:44:53.236786",
    "items": [
        {
            "title": "Strides Founder raises Rs 1000 crore to refinance debt",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/strides-founder-raises-rs-1000-crore-to-refinance-debt/articleshow/124652167.cms",
            "description": "Arun Kumar, founder of Strides Group and OneSource, has secured ₹1,000 crore by pledging shares. This move refinances existing loans, extending maturities and simplifying repayments. The transaction aims to consolidate smaller borrowings into larger, long-term facilities. It reflects a broader effort to clean up the promoter's balance sheet and shows a decline in pledged shares, indicating deleveraging.",
            "pubDate": "2025-10-18T02:33:40.041368"
        },
        {
            "title": "PSBs reap gains from rising interest income",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bank-of-india-central-bank-and-uco-bank-post-q2-profit-gains-despite-margin-pressure/articleshow/124652381.cms",
            "description": "Public sector banks Uco Bank, Central Bank of India, and Bank of India reported increased net profits in the September quarter, driven by higher interest income and reduced provisions. Despite a dip in net interest margins, all three banks saw loan growth outpace deposit growth, indicating a positive operational trend.",
            "pubDate": "2025-10-18T02:33:40.041524"
        },
        {
            "title": "After a tough quarter, SFBs hope for credit quality, growth uptick",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/au-small-finance-bank-jana-ujjivan-report-lower-q2-net-profit-on-higher-expenses-credit-cost/articleshow/124652260.cms",
            "description": "Small finance banks faced profitability pressures in the second quarter due to higher credit costs and expenses. AU Small Finance Bank saw a dip in net profit, while Ujjivan and Jana reported significant drops. Lenders expressed confidence in improving credit quality from unsecured business in the coming quarter.",
            "pubDate": "2025-10-18T02:33:40.041959"
        },
        {
            "title": "Banking stocks lead markets to four-month high ahead of Diwali",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/banking-stocks-lead-markets-to-four-month-high-ahead-of-diwali/articleshow/124652984.cms",
            "description": "Indian stock markets saw their best weekly performance in four months. Banking stocks led the rally, fueled by positive business updates and loan growth. Investors are optimistic ahead of the Diwali trading session. While short-term gains are expected, analysts suggest caution post-Diwali as loan growth may not sustain. Foreign investors showed buying interest.",
            "pubDate": "2025-10-18T03:08:52.423461"
        },
        {
            "title": "JSW Infra plans Rs 5,500 crore capex push; Q2 PAT down 3.5%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jsw-infra-plans-rs-5500-crore-capex-push-q2-pat-down-3-5/articleshow/124652742.cms",
            "description": "JSW Infrastructure will invest ₹4,000 crore in its port operations and ₹1,500 crore in its logistics arm in FY26. This spending will support both organic and inorganic growth. The company reported a profit after tax decline of 3.5% for the June quarter. Total revenue increased by 26% year-on-year.",
            "pubDate": "2025-10-18T03:08:52.423594"
        },
        {
            "title": "Wall Street ends higher as investors digest Trump trade comments",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-ends-higher-as-investors-digest-trump-trade-comments/articleshow/124653434.cms",
            "description": "Wall Street closed higher Friday as investors weighed President Trump's remarks on China tariffs and regional bank earnings eased credit risk concerns. Trump's comments on tariffs were seen as mixed, while regional banks rebounded, with Truist Financial and Zions Bancorporation showing gains.",
            "pubDate": "2025-10-18T03:36:11.919866"
        },
        {
            "title": "Fed's Musalem leans toward supporting October interest rate cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/feds-musalem-leans-toward-supporting-october-interest-rate-cut/articleshow/124654524.cms",
            "description": "St. Louis Federal Reserve President Alberto Musalem indicated a potential interest rate cut is on his mind. He stated he could support a reduction if job market risks appear and inflation stays under control. However, Musalem stressed the Federal Reserve should not follow a predetermined plan. His comments were made before a financial meeting.",
            "pubDate": "2025-10-18T04:33:41.578838"
        },
        {
            "title": "5 world market themes for the week ahead",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/5-world-market-themes-for-the-week-ahead/articleshow/124654388.cms",
            "description": "Investors gear up for a whirlwind week. As US corporations unveil their earnings, inflation stats will also take center stage. In Japan, the possibility of a new prime minister could catalyze stock surges. Bolivia approaches a watershed election that marks the end of socialism.",
            "pubDate": "2025-10-18T04:33:41.578969"
        },
        {
            "title": "Rapid growth of ETF market triggers fears of bubble",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rapid-growth-of-etf-market-triggers-fears-of-bubble/articleshow/124654276.cms",
            "description": "The U.S. ETF landscape is booming with an influx of innovative products, sparking concerns of a potential bubble. Investors and brokerage firms are becoming increasingly discerning about their choices, with analysts predicting that numerous newcomers may struggle to stand the test of time.",
            "pubDate": "2025-10-18T04:33:41.579181"
        },
        {
            "title": "Concurrent Gainers: 9 Nifty500 stocks gain for 5 days in a row",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-gainers-9-nifty500-stocks-gain-for-5-days-in-a-row/slideshow/124658269.cms",
            "description": "Over the last five trading sessions ending on October 17, the Nifty gained 1.7%, rising by 425 points to close at 25,710. The benchmark index ended in positive territory on three of the five days. Notably, during this rally, nine stocks from the Nifty500 index recorded gains in each of the five sessions. (Data Source: ACE Equity)",
            "pubDate": "2025-10-18T07:18:55.792877"
        },
        {
            "title": "Stocks to buy this Diwali: Dixon, Nykaa and 8 more scrips offer up to 31% gains in Samvat 2082",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-this-diwali-dixon-nykaa-and-8-more-scrips-offer-up-to-31-gains-in-samvat-2082/slideshow/124657942.cms",
            "description": "Brokerages Centrum Broking has come out with a list of 10 stock to buy this Diwali. The scrips come for varied sectors like manufacturing, banking, and automobile sectors, offering up to 31% over Samvat 2082. Here's what it recommends and why-",
            "pubDate": "2025-10-18T07:18:55.793000"
        },
        {
            "title": "Capital goods recovery underway — focus on Cummins India and Kirloskar Oil Engines",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/capital-goods-recovery-underway-focus-on-cummins-india-and-kirloskar-oil-engines/articleshow/124657778.cms",
            "description": "India's capital goods sector is experiencing a strong recovery, fueled by rising demand and stable pricing post-regulatory changes. The genset segment, a key indicator, saw significant volume growth driven by data centers, manufacturing, and infrastructure. Companies like Cummins India and Kirloskar Oil Engines are poised for sustained expansion through new products and robust aftermarket services.",
            "pubDate": "2025-10-18T07:18:55.793134"
        },
        {
            "title": "Over 20 mutual funds cut holdings in 10 stocks — down up to 70%. Are you affected?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/over-20-mutual-funds-cut-holdings-in-10-stocks-down-up-to-70-are-you-affected/slideshow/124657420.cms",
            "description": "In September 2025, over 20 mutual fund (MF) schemes trimmed their holdings in 18 different stocks compared to their positions in August 2025. This trend indicates a broad-based reduction in exposure to these companies. Notably, with the exception of Hero MotoCorp, all 17 other stocks have delivered negative returns so far in the calendar year 2025. Among these, 10 stocks have seen particularly sharp declines, plunging between 25% and 70%, signaling a significant loss of investor confidence. (Data Source: ACE MF, ACE Equity).",
            "pubDate": "2025-10-18T07:18:55.793248"
        },
        {
            "title": "LIVE: Impact of GST 2.0 amid Deepawali festivities | FM Sitharaman, Ashwini Vaishnaw, Piyush Goyal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/live-impact-of-gst-2-0-amid-deepawali-festivities-fm-sitharaman-ashwini-vaishnaw-piyush-goyal/videoshow/124659117.cms",
            "description": "The government's big press conference on the occasion of Dhanteras. Finance Minister Nirmala Sitharaman addresses the press conference.",
            "pubDate": "2025-10-18T07:44:51.727287"
        },
        {
            "title": "ET Prime Series: Q2 earnings estimate special Part 2 – Will banks deliver a surprise?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/et-prime-series-q2-earnings-estimate-special-part-2-will-banks-deliver-a-surprise/articleshow/124658695.cms",
            "description": "The earnings season is an important time in the yearly market calendar. If you are a trader, it is an opportunity to exploit the up/down movement of stock prices. As an investor, it helps you figure out whether managements are delivering on promises. It is also a volatile period – and with a good reason. There is something which causes the volatility. What is that something? Which stocks are going to be up or down earnings announcement day? The answers depend on many factors. While many of them cannot be tracked, some can be. Prices are not reacting to the absolute numbers delivered; they are reacting to the surprise relative to what was priced in.",
            "pubDate": "2025-10-18T07:44:51.727450"
        }
    ]
}