{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-25T03:20:52.185453",
    "items": [
        {
            "title": "SBI Life Insurance shares in focus after Rs 352.50 crore Income Tax order",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sbi-life-insurance-shares-in-focus-after-rs-352-50-crore-income-tax-order/articleshow/119453583.cms",
            "description": "SBI Life Insurance shares: The company stated that the demand resulted from an incorrect increase in policyholder and shareholder income, caused by the inclusion of allowable expenses and exemptions.",
            "pubDate": "2025-03-25T03:20:35.458882"
        },
        {
            "title": "GRSE shares in focus after co signs deal with German firm for 2 multi-purpose vessels",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grse-shares-in-focus-after-co-signs-deal-with-german-firm-for-2-multi-purpose-vessels/articleshow/119453041.cms",
            "description": "Garden Reach Shipbuilders & Engineers (GRSE) signed a contract with Carsten Rehder of Germany for the construction and delivery of the 7th and 8th Multi-purpose vessels (MPVs), worth approximately 108 million USD. Each vessel, designed to transport cargo including large windmill blades, will have a capacity of 7,500 metric tonnes.",
            "pubDate": "2025-03-25T03:20:35.459008"
        },
        {
            "title": "Positive Breakout: These 7 stocks cross above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-these-7-stocks-cross-above-their-200-dmas/slideshow/119452946.cms",
            "description": "In the Nifty200 pack, seven stocks' close prices crossed above their 200 DMA (Daily Moving Averages) on March 24, according to stockedge.com's technical scan data. The 200-day DMA is used as a key indicator by traders for determining the overall trend in a particular stock. As long as the stock is priced above the 200-day SMA on the daily time frame, it is generally considered to be an overall uptrend. Take a look:",
            "pubDate": "2025-03-25T03:20:35.459117"
        },
        {
            "title": "RVNL shares in focus after winning Rs 116-crore Central Railway contract in Nagpur",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rvnl-shares-in-focus-after-winning-rs-116-crore-central-railway-contract-in-nagpur/articleshow/119452795.cms",
            "description": "RVNL has emerged as the lowest bidder for a Rs 115.79 crore contract from Central Railway’s Nagpur division for OHE modification work. The project aims to upgrade the existing electric traction system and will be executed over 24 months. Additionally, RVNL previously secured a contract worth Rs 156.36 crore from South Western Railway.",
            "pubDate": "2025-03-25T03:20:35.459217"
        },
        {
            "title": "IndusInd Bank shares in focus after GST penalty; lender plans to appeal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indusind-bank-shares-in-focus-after-gst-penalty-lender-plans-to-appeal/articleshow/119452696.cms",
            "description": "IndusInd Bank faces a Rs 30.15 crore penalty for GST-related issues and is considering an appeal. Recently, the bank reported accounting discrepancies and has appointed Grant Thornton for a forensic review. IndusInd Bank's Q3 earnings declined significantly, with a 39% drop in net profit. The shares fell 2.42%, reflecting ongoing financial turmoil.",
            "pubDate": "2025-03-25T03:20:35.459318"
        },
        {
            "title": "Stocks to buy in 2025: BEL, Astra Microwave among top 5 stocks that could give 10-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-bel-astra-microwave-among-top-5-stocks-that-could-give-10-30-return/slideshow/119452612.cms",
            "description": "Leading brokerage firms have shared their latest stock recommendations, highlighting investment opportunities across key sectors in the next 12 months.We have collated a list of recommendations from top brokerage firms from ETNow and other sources:",
            "pubDate": "2025-03-25T03:20:35.459435"
        },
        {
            "title": "With IPL, Asia Cup lifting hotel demand, analysts recommend these 3 stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/with-ipl-asia-cup-lifting-hotel-demand-analysts-recommend-these-3-stocks/articleshow/119452364.cms",
            "description": "The hotel industry is experiencing a robust recovery with increased occupancy due to major events, a weaker rupee attracting international tourists, and rising leisure travel. Analysts predict continued growth supported by rising average room rates, improved margins, and strong Q4FY25 expectations, despite recent stock corrections.",
            "pubDate": "2025-03-25T03:20:35.459530"
        },
        {
            "title": "TRADING DAY-Tariff fears cool, tech sizzles",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/trading-day-tariff-fears-cool-tech-sizzles/articleshow/119451447.cms",
            "description": "Nasdaq records its third-biggest gain this year as investors respond positively to potential easing of Trump's tariff plans and rising U.S. business activity. The S&P 500 saw all sectors rise, with consumer cyclicals leading. Despite some trade war concerns, optimism drives the market, led by a significant surge in Tesla shares.",
            "pubDate": "2025-03-25T03:20:35.459719"
        },
        {
            "title": "BOJ discussed chance of more rate hikes at January meeting, minutes show",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/boj-discussed-chance-of-more-rate-hikes-at-january-meeting-minutes-show/articleshow/119451352.cms",
            "description": "The Bank of Japan raised short-term interest rates to 0.5%, the highest in 17 years, citing rising wages and stable inflation around its 2% target. Policymakers discussed continuing monetary tightening if economic conditions warrant it. However, concerns remain about global economic uncertainty, particularly due to U.S. tariffs, affecting the timing of further rate hikes.",
            "pubDate": "2025-03-25T03:20:35.459816"
        },
        {
            "title": "S&P 500 ends sharply higher, Nvidia and Tesla rally",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sp-500-ends-sharply-higher-nvidia-and-tesla-rally/articleshow/119451154.cms",
            "description": "The S&P 500 hit a two-week high boosted by gains in Nvidia and Tesla as hopes grew for a more measured U.S. tariff approach. Technology shares rallied, with Tesla soaring nearly 12% and Nvidia up over 3%. Investors remained cautious about the impact of tariffs on economic growth. Trading volumes were light, with significant gains in consumer discretionary sectors.",
            "pubDate": "2025-03-25T03:20:35.459913"
        },
        {
            "title": "Asian stocks advance on Trump’s tariff signals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/asian-stocks-advance-on-trumps-tariff-signals/articleshow/119450015.cms",
            "description": "Markets gripped by anxiety about the economic impact of an all-out trade war got relief from signs the coming wave of US tariffs is shaping up as more focused than the barrage Trump has occasionally threatened. The president twice on Monday signaled trading partners would receive possible exemptions or reductions.",
            "pubDate": "2025-03-25T03:20:35.460005"
        },
        {
            "title": "Stocks in news: Power Grid, Indian Overseas Bank, IndusInd Bank and BLS International",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-power-grid-indian-overseas-bank-indusind-bank-and-bls-international/articleshow/119449884.cms",
            "description": "When markets resume trading today, Power Grid, Indian Overseas Bank, IndusInd Bank, BLS International will be in focus due to various related developments.",
            "pubDate": "2025-03-25T03:20:35.460096"
        },
        {
            "title": "Sebi panel to vet conflict of interest rules",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sebi-panel-to-vet-conflict-of-interest-rules/articleshow/119449510.cms",
            "description": "The Sebi board meeting on Monday also approved proposals to ease the compliance burden on foreign portfolio investors (FPIs) and rules on the appointment of key personnel at stock exchanges, clearing firms and depositories.",
            "pubDate": "2025-03-25T03:20:35.460184"
        },
        {
            "title": "Bulls in beast mode, clean up D-Street losses",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/bulls-in-beast-mode-clean-up-d-street-losses/articleshow/119449425.cms",
            "description": "The NSE Nifty rose 307.95 points or 1.32% to close at 23,658.35. The BSE Sensex rose 1,078.87 points or 1.4% to end at 77,984.38. Both indices are up 5.1% in the six trading sessions. \"Monday's upside was due to a combination of short covering, and expectations of some relaxation or less punitive tariffs which were supposed to be implemented on April 2,\" said Pankaj Pandey, head of retail research at ICICI Direct.",
            "pubDate": "2025-03-25T03:20:35.460275"
        },
        {
            "title": "As Nifty & Sensex recover, these large-caps have ‘strong buy’, ‘buy’ recos, with an upside potential of more than 30%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/as-nifty-sensex-recover-these-large-caps-have-strong-buy-buy-recos-with-an-upside-potential-of-more-than-30/articleshow/119449042.cms",
            "description": "It might be a bit early to say with certainty, but the way things panned out in the last two weeks, the worst may be over for the bulls. When we say bulls, we include retail investors. That’s because all retail investors are by nature bullish. And rightly so, as it pays to be bullish about the India story. Now, the long phase of correction has brought us to a place where a large number of blue chips are at levels where the chances are that being bullish on them will deliver returns. But while being bullish, be selective and cautious as well.",
            "pubDate": "2025-03-25T03:20:35.460384"
        }
    ]
}