{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-12-06T04:40:36.008411",
    "items": [
        {
            "title": "Wall Street Week Ahead: US Fed's internal split puts spotlight on Jerome Powell's rate guidance, dissents",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-week-ahead-us-feds-internal-split-puts-spotlight-on-jerome-powells-rate-guidance-dissents/articleshow/125799319.cms",
            "description": "The Federal Reserve's upcoming meeting is set to be highly debated. Policymakers are divided on an expected interest rate cut. Investors are watching closely for signals on the Fed's future policy direction and internal dynamics. Economic data has eased fears of labor market deterioration, fueling rate cut expectations. The market anticipates a quarter-point cut.",
            "pubDate": "2025-12-06T03:58:32.638835"
        },
        {
            "title": "Mint St doves let it fly even as India can’t catch a flight",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mint-st-doves-let-it-fly-even-as-india-cant-catch-a-flight/articleshow/125799378.cms",
            "description": "Friday saw a remarkable uptick in Indian stock markets as the Reserve Bank of India decided to lower interest rates by 25 basis points. This strategic decision, along with signals of continued easing, infused confidence into investors. The Nifty and Sensex indices experienced a solid recovery, pushing past previous weekly dips.",
            "pubDate": "2025-12-06T04:24:00.399487"
        },
        {
            "title": "European stock clock weekly gains on ongoing Fed cut optimism",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-stock-clock-weekly-gains-on-ongoing-fed-cut-optimism/articleshow/125799727.cms",
            "description": "European shares closed the week with modest gains as investors digested a U.S. inflation report reinforcing expectations for a Federal Reserve rate cut next week. Autos, retail, and technology stocks led the gains, while Swiss Re and oil and gas lagged. Citigroup set a positive 2026 target for the STOXX 600.",
            "pubDate": "2025-12-06T04:40:34.280152"
        },
        {
            "title": "Stocks end higher, dollar set for second straight weekly loss as investors eye Fed cut",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-end-higher-dollar-set-for-second-straight-weekly-loss-as-investors-eye-fed-cut/articleshow/125799696.cms",
            "description": "Global shares advanced Friday as U.S. economic data reinforced expectations of a Federal Reserve rate cut next week, weakening the dollar and boosting gold. Wall Street indices closed higher, marking a second consecutive week of gains, with technology and communication services sectors leading. European markets remained largely unchanged, securing a modest weekly increase.",
            "pubDate": "2025-12-06T04:40:34.280261"
        },
        {
            "title": "US stocks close with slight gains as data keeps Fed cut expectations on track",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/us-stocks-close-with-slight-gains-as-data-keeps-fed-cut-expectations-on-track/articleshow/125799676.cms",
            "description": "Indian markets saw a positive close on Friday. Investors are keenly watching for a Federal Reserve interest rate cut next week. Economic data released showed consumer spending rose and consumer sentiment improved. This has boosted hopes for a rate reduction. All eyes are now on the Fed meeting for policy hints.",
            "pubDate": "2025-12-06T04:40:34.280454"
        }
    ]
}