{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-11-06T05:44:53.168872",
    "items": [
        {
            "title": "Nykaa, Paytm among six additions in MSCI India index; Tata Elxsi, CONCOR out",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nykaa-paytm-among-six-additions-in-msci-india-index-tata-elxsi-concor-out/articleshow/125122057.cms",
            "description": "MSCI’s November 2025 semi-annual review has triggered major reshuffles across its India indices, with Nykaa and Paytm entering the MSCI India Standard Index alongside Fortis Healthcare, GE Vernova T&D India, Indian Bank and Siemens Energy India. Three stocks—Astral, CONCOR and Tata Elxsi—have been removed. The smallcap index saw a deeper churn with 7 additions and 33 deletions.",
            "pubDate": "2025-11-06T03:52:02.372046"
        },
        {
            "title": "IndiGo shares in focus as airline returns to loss in Q2. Should investors hit sell?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/indigo-shares-in-focus-as-airline-returns-to-loss-in-q2-should-investors-hit-sell/articleshow/125121945.cms",
            "description": "InterGlobe Aviation, parent of IndiGo, reported a Q2FY26 net loss of Rs 2,582 crore, reversing from a profit of Rs 2,176 crore in Q1. Revenue rose 9% YoY to Rs 18,555 crore, but rising costs and forex losses pressured margins. Brokerage Nuvama maintains a ‘Hold’ rating with a target of Rs 5,330, citing cautious outlook despite strong passenger growth.",
            "pubDate": "2025-11-06T03:52:02.372196"
        },
        {
            "title": "TBO Tek, Dabur India among 6 stocks showing bullish RSI upswing",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/tbo-tek-dabur-india-among-6-stocks-showing-bullish-rsi-upswing/slideshow/125121867.cms",
            "description": "On November 4, six Nifty500 stocks that gained over 2% appeared in the RSI Trending Up scan, according to data from StockEdge.com. An uptrend signal is generated when the RSI value crosses above 50 from below. “RSI trending up” indicates that the Relative Strength Index is rising, suggesting strengthening price momentum. This may point to potential upward movement and help traders identify buying opportunities.",
            "pubDate": "2025-11-06T03:52:02.372305"
        },
        {
            "title": "Paytm shares under spotlight after 98% YoY fall in Q2 profit; Citi sets Rs 1,500 target",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/paytm-shares-under-spotlight-after-98-yoy-fall-in-q2-profit-citi-sets-rs-1500-target/articleshow/125121923.cms",
            "description": "Paytm (One 97 Communications) reported a steep 98% YoY drop in Q2FY26 net profit to Rs 21 crore, mainly due to a one-time Rs 190 crore impairment charge. Excluding this, PAT was Rs 211 crore. Revenue rose 24% YoY to Rs 2,061 crore, with strong growth in payments and financial services. Citi maintains a ‘Buy’ rating with a Rs 1,500 target.",
            "pubDate": "2025-11-06T03:52:02.372410"
        },
        {
            "title": "Last day to buy HUL, Dabur, and 16 other stocks to be eligible for dividends",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-hul-dabur-and-16-other-stocks-to-be-eligible-for-dividends/articleshow/125121898.cms",
            "description": "November 6 is the last day to buy shares of Hindustan Unilever Ltd (HUL), Dabur India, Shriram Finance, and 16 other companies to qualify for their interim dividends. The ex-date for all these stocks is November 7, 2025. Dividend payouts range from Rs 0.1 to Rs 75 per share, offering investors an opportunity to earn returns ahead of the ex-date.",
            "pubDate": "2025-11-06T03:52:02.372514"
        },
        {
            "title": "Positive Breakout: 10 stocks close above their 200 DMAs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/positive-breakout-10-stocks-close-above-their-200-dmas/slideshow/125121624.cms",
            "description": "In the Nifty500 pack, 10 stocks saw their closing prices cross above their 200-day moving average (DMA) on November 4, 2025, according to technical scan data from stockedge.com. The 200-day DMA is widely used by traders as a key indicator to determine the broader trend of a stock. As long as a stock trades above its 200-day DMA on the daily timeframe, it is generally considered to be in an overall uptrend. Take a look:",
            "pubDate": "2025-11-06T03:52:02.372615"
        },
        {
            "title": "Wall Street girds for life under Mamdani, worries about New York City's competitiveness",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/wall-street-girds-for-life-under-mamdani-worries-about-new-york-citys-competitiveness/articleshow/125121093.cms",
            "description": "New York City's financial sector braces for a new era with Mayor Zohran Mamdani's election. Business leaders express apprehension about potential impacts on the city's competitiveness and appeal. While some hope for moderation, others worry about proposed tax hikes and rent controls.  The city's economic future under Mamdani's leadership is now a key focus.",
            "pubDate": "2025-11-06T03:52:02.372708"
        },
        {
            "title": "Fewer karats brighten up Tanishq, give Titan lustre",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fewer-karats-brighten-up-tanishq-give-titan-lustre/articleshow/125121023.cms",
            "description": "Titan Company is poised for continued strong performance throughout the fiscal year, fueled by robust festive and wedding demand. Initiatives like offering lower karat jewelry and strategic international expansion, including the Damas Jewellery acquisition, are driving growth. Analysts are revising estimates upwards, reflecting confidence in Titan's sustained momentum.",
            "pubDate": "2025-11-06T03:52:02.372804"
        },
        {
            "title": "Top brokerages see up to 20% upside for SBI stock in a year",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/top-brokerages-see-up-to-20-upside-for-sbi-stock-in-a-year/articleshow/125120853.cms",
            "description": "State Bank of India shares surged following strong September-quarter results, with analysts upgrading price targets and projecting a 7-20% upside. The bank's profit after tax rose 10% year-on-year, beating estimates, and asset quality improved. This performance has attracted renewed investor interest in public sector banks.",
            "pubDate": "2025-11-06T03:52:02.372899"
        },
        {
            "title": "Gift Nifty rises over 50 pts; here's the trading setup for the day",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/gift-nifty-hints-rise-over-50-pts-heres-the-trading-setup-for-the-day/articleshow/125120552.cms",
            "description": "Indian equities closed lower amid persistent FII outflows, with market direction hinging on Q2 earnings and global macro signals. Positive US-India trade talks could boost sentiment and export-linked sectors. The rupee recovered, gaining 7 paise against the dollar, supported by a correction in global crude oil prices.",
            "pubDate": "2025-11-06T03:52:02.372990"
        },
        {
            "title": "HUL’s unusual promise read our contract with our new CEO",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/huls-unusual-promise-read-our-contract-with-our-new-ceo/articleshow/125120716.cms",
            "description": "Hindustan Unilever Limited's notice for Priya Nair's appointment as CEO included an unusual offer: shareholders could obtain a copy of her CEO agreement via email. While not legally mandated, this move goes beyond typical inspection procedures, sparking debate on transparency versus competitive risks in executive contracts.",
            "pubDate": "2025-11-06T03:52:02.373106"
        },
        {
            "title": "M&M set to exit RBL via $78-million block deal",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mm-set-to-exit-rbl-via-78-million-block-deal/articleshow/125120688.cms",
            "description": "Mahindra & Mahindra is set to exit RBL Bank by selling its entire 3.5% stake. The deal is valued at approximately $78 million. Kotak Securities is managing the transaction. The sale is scheduled for Thursday. This move represents a profitable exit for Mahindra, which had invested in the bank in July 2023.",
            "pubDate": "2025-11-06T03:52:02.373207"
        },
        {
            "title": "Weddings, festivals bring joie de vivre to jewellery stocks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/weddings-festivals-bring-joie-de-vivre-to-jewellery-stocks/articleshow/125120651.cms",
            "description": "Jewellery stocks are experiencing a rally driven by robust festive demand and the upcoming wedding season, despite higher gold and silver prices. Analysts anticipate continued momentum, with strong quarterly results and shifting consumer preferences towards modern designs supporting sales and margins. While near-term outlook remains positive, potential moderation in gains is expected after the recent surge.",
            "pubDate": "2025-11-06T03:52:02.373300"
        },
        {
            "title": "Emirates NBD proposes open offer to acquire 26% in RBL",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/emirates-nbd-proposes-open-offer-to-acquire-26-in-rbl/articleshow/125120622.cms",
            "description": "Emirates NBD Bank plans to acquire a 26% stake in RBL Bank via an open offer at ₹280 per share, totaling ₹11,636 crore. This move, part of a larger $3 billion investment to gain a majority stake, marks a significant FDI in India's banking sector. RBL Bank is seeking an increased FDI limit to facilitate the transaction.",
            "pubDate": "2025-11-06T03:52:02.373392"
        },
        {
            "title": "Desi Money Dominates: DII holdings hit record as foreign ownership sinks to 13-year low",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/desi-money-dominates-dii-holdings-hit-record-as-foreign-ownership-sinks-to-13-year-low/articleshow/125120578.cms",
            "description": "Domestic institutional investors' holdings in Indian stocks reached an all-time high in the September quarter, widening the gap with overseas investors to a 25-year peak. While local funds, fueled by retail inflows, continued to invest, foreign investors sold shares amid growth and valuation concerns, preferring other markets.",
            "pubDate": "2025-11-06T03:52:02.373483"
        },
        {
            "title": "Stocks in news: Paytm, IndiGo, M&M, RIL, LIC, TCS, Apollo Hospitals",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-paytm-indigo-mm-ril-lic-tcs-apollo-hospitals/articleshow/125120422.cms",
            "description": "Markets closed lower on the weekly expiry day, with the Nifty 50 slipping 0.7% to 25,600, retesting its 20-day EMA. Several companies like Paytm, IndiGo, and M&M are in focus due to Q2 results and news developments, impacting trading sentiment.",
            "pubDate": "2025-11-06T03:52:02.373575"
        },
        {
            "title": "Groww IPO Day 2: Check what top 10 brokerages said before investing in this Rs 6,632 crore issue",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/groww-ipo-day-2-check-what-top-10-brokerages-said-before-investing-in-this-rs-6632-crore-issue/slideshow/125123880.cms",
            "description": "Groww’s Rs 6,632 crore IPO, which saw 57% subscription on Day 1, has received a wave of positive recommendations from leading brokerages. Most analysts rated the issue as \"Subscribe,\" citing Groww’s leadership in India’s retail investing market, robust tech stack, and long-term potential despite steep valuations.",
            "pubDate": "2025-11-06T05:44:36.849956"
        },
        {
            "title": "Hindalco shares drop 6% after Novelis flags $550–650 million cash flow hit from New York plant fire",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hindalco-shares-drop-6-after-novelis-flags-550650-million-cash-flow-hit-from-new-york-plant-fire/articleshow/125123543.cms",
            "description": "Hindalco Industries shares fell over 6% after its US subsidiary Novelis said a fire at its New York plant will dent FY26 free cash flow by up to $650 million and EBITDA by $150 million.",
            "pubDate": "2025-11-06T05:44:36.850107"
        },
        {
            "title": "Last day to buy BPCL, NTPC shares to qualify for interim dividends. Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/last-day-to-buy-bpcl-ntpc-shares-to-qualify-for-interim-dividends-do-you-own/articleshow/125123304.cms",
            "description": "Investors must buy BPCL and NTPC shares today, 6 November, to be eligible for their interim dividends of Rs 7.5 and Rs 2.75 per share, respectively.",
            "pubDate": "2025-11-06T05:44:36.850218"
        },
        {
            "title": "Booming market! 10 data center stocks that could catch the tailwind and jump up to 58%",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/booming-market-10-data-center-stocks-that-could-catch-the-tailwind-and-jump-up-to-58/slideshow/125123343.cms",
            "description": "India’s data centre story could turn into one of the biggest structural investment themes. Rising internet traffic, AI adoption, and the government’s push for data localisation are driving capacity expansion, with brokerages spotting big upside in select stocks. Here are five names linked to the theme that analysts believe could deliver meaningful gains.",
            "pubDate": "2025-11-06T05:44:36.850323"
        },
        {
            "title": "Stocks to buy in 2025 for long term: GAIL, Gland Pharma among 5 stocks that could give 12-30% return",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-in-2025-for-long-term-gail-gland-pharma-among-5-stocks-that-could-give-12-30-return/slideshow/125123165.cms",
            "description": "Brokerages remain upbeat on select banking, infrastructure, and pharmaceutical names, highlighting earnings recovery, margin improvement, and growth visibility across sectors.We have collated a list of recommendations from top brokerage firms from ETNow and other source",
            "pubDate": "2025-11-06T05:44:36.850431"
        },
        {
            "title": "Britannia Industries shares jump 5% as Q2 net profit rises 23% to Rs 655 crore; Nuvama maintains Buy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/britannia-industries-shares-jump-5-as-q2-net-profit-rises-23-to-rs-655-crore-nuvama-maintains-buy/articleshow/125122834.cms",
            "description": "Britannia Industries’ Q2 profit rose 23% YoY to Rs 655 crore, driven by cost control and stable commodity prices. The company also appointed Rakshit Hargave as its new CEO.",
            "pubDate": "2025-11-06T05:44:36.850542"
        },
        {
            "title": "Delhivery shares plunge over 8% after reporting Q2 loss, leadership shake-up",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/delhivery-shares-tumble-6-after-announcing-q2-loss-and-cfo-change/articleshow/125122675.cms",
            "description": "Delhivery shares: Delhivery's shares dropped 8.5% after the logistics firm reported a Rs 50.38 crore net loss in Q2 FY26, despite record shipment volumes and revenue growth. The company also announced a CFO transition, with Vivek Pabari set to take over from Amit Agarwal in January 2026.",
            "pubDate": "2025-11-06T05:44:36.850638"
        },
        {
            "title": "Sensex climbs over 300 points, Nifty tops 25,600 as earnings boost investor mood",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-climbs-over-300-points-nifty-tops-25600-as-earnings-boost-investor-mood/articleshow/125122461.cms",
            "description": "Indian stocks surged on Thursday, led by strong quarterly results from Sun Pharma and Britannia. The inclusion of four Indian firms in the MSCI index further boosted sentiment, with major indices seeing gains. While broader markets remained flat, specific stocks like Paytm also experienced significant upward movement, attracting foreign investment interest.",
            "pubDate": "2025-11-06T05:44:36.850740"
        },
        {
            "title": "Grasim Industries shares fall 4% after reporting Q2 results. Should you buy the dip?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/grasim-industries-shares-in-focus-as-q2-pat-surges-76-yoy-should-you-invest/articleshow/125122573.cms",
            "description": "Grasim Industries shares: The company reported a 76% year-on-year rise in consolidated net profit for Q2 FY26 to ₹553.48 crore, up from ₹314.63 crore a year earlier.",
            "pubDate": "2025-11-06T05:44:36.850834"
        },
        {
            "title": "Hitachi Energy among 5 F&O stocks saw a high increase in futures open interest",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/hitachi-energy-among-5-fo-stocks-saw-a-high-increase-in-futures-open-interest/slideshow/125122617.cms",
            "description": "As of 4 November, there was a notable surge in futures open interest for nine stocks in the NSE F&O pack, contributing to a total increase in open interest of over 5% as compared to the previous trade. A significant uptick in futures open interest signifies substantial growth in the number of active, unexpired futures contracts in a specific security. This uptrend reflects an increasing number of participants either initiating new positions or expanding the size of their existing positions within the futures market.",
            "pubDate": "2025-11-06T05:44:36.850929"
        },
        {
            "title": "Sun Pharma shares in focus after muted Q2 earnings. Nuvama maintains hold with Rs 1,800 target",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sun-pharma-shares-in-focus-after-muted-q2-earnings-nuvama-maintains-hold-with-rs-1800-target/articleshow/125122361.cms",
            "description": "Sun Pharma will be in focus after reporting a Q2 FY26 net profit of Rs 3,117.95 crore, up 2.6% YoY, with revenue rising 8.6% to Rs 14,405 crore. Innovative Medicines drove growth, surpassing U.S. generics for the first time. EBITDA rose 14.9% with strong margins. Nuvama maintained a ‘Hold’ rating, citing competition risks and potential U.S. policy headwinds.",
            "pubDate": "2025-11-06T05:44:36.851038"
        },
        {
            "title": "RBL Bank shares in focus as M&M sells entire 3.45% stake via Rs 678 crore block deal: Report",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rbl-bank-shares-in-focus-as-mm-sells-entire-3-45-stake-via-rs-678-crore-block-deal-report/articleshow/125122324.cms",
            "description": "RBL Bank shares will be in focus on Thursday after a large block deal saw Mahindra & Mahindra likely sell its entire 3.45% stake for about Rs 678 crore at Rs 321 per share, according to reports. M&M had invested at Rs 197 in 2023, making this a 63% return. The company had earlier indicated no plans to raise its stake above 9.9%.",
            "pubDate": "2025-11-06T05:44:36.851136"
        },
        {
            "title": "City Union Bank among 5 stocks that witnessed 5-year swing high breakout",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/city-union-bank-among-5-stocks-that-witnessed-5-year-swing-high-breakout/slideshow/125122301.cms",
            "description": "In the Nifty500 pack, five stocks witnessed a 5-year swing high at the close on November 4, suggesting bullishness in counters, according to stockedge.com's technical scan data.A 5-year swing high represents the highest price a stock has reached within a five-year timeframe. This level acts as a significant resistance point where the price has historically struggled to go beyond. This occurrence may be seen as a bullish sign, indicating the potential for further upward movement in the stock. However, it's worth noting that this is different from a 5-year breakout, which occurs when a stock's price surpasses a key resistance level that has held for five years or longer.",
            "pubDate": "2025-11-06T05:44:36.851231"
        }
    ]
}