{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-17T11:57:05.146118",
    "items": [
        {
            "title": "SAT overturns ban on Nusli Wadia, sons, others",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sat-overturns-ban-on-nusli-wadia-sons-others/articleshow/126602533.cms",
            "description": "In a surprising turn of events, the Securities Appellate Tribunal has lifted the ban imposed on Bombay Dyeing and its executives, alongside nullifying the associated penalties and restrictions on their directorship roles. This decision comes after Sebi's extended delay of nearly nine years in addressing allegations related to fraudulent activities tied to manipulated financial statements.",
            "pubDate": "2026-01-17T04:55:57.269026"
        },
        {
            "title": "IT resilience gives D-St a silver lining amid geopolitical clouds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/it-resilience-gives-d-st-a-silver-lining-amid-geopolitical-clouds/articleshow/126602424.cms",
            "description": "In a vibrant trading session on Friday, Indian stock markets rallied, with Nifty and Sensex recording notable gains. The upbeat revenue outlook from tech giant Infosys provided a much-needed boost to IT stocks, igniting early optimism in the market. However, nervousness regarding geopolitical issues led some investors to cash in on profits, resulting in a moderation of the earlier gains.",
            "pubDate": "2026-01-17T04:55:57.269144"
        },
        {
            "title": "European shares subdued as luxury stocks, miners weigh",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/european-shares-subdued-as-luxury-stocks-miners-weigh/articleshow/126603820.cms",
            "description": "European stock markets ended the week flat. Luxury and mining stocks saw declines. Geopolitical tensions eased, impacting commodity-linked shares. Defence stocks provided some support. Novo Nordisk shares surged on positive news about its weight-loss pill. Investors are navigating a busy earnings season amidst global uncertainties.",
            "pubDate": "2026-01-17T05:49:11.110744"
        },
        {
            "title": "Auto upcycle gains depth; M&M and TVS Motors stand out, Siddhartha Khemka explains",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/auto-upcycle-gains-depth-mm-and-tvs-motors-stand-out-siddhartha-khemka-explains/articleshow/126604687.cms",
            "description": "India’s auto sector shows sustained post-festive momentum, with Q3 volumes up 17% year-on-year across segments. Strong demand, lean inventories and easing discounts are lifting revenues, profits and margins, supporting a positive medium-term outlook for automakers and ancillaries.",
            "pubDate": "2026-01-17T06:52:07.616154"
        },
        {
            "title": "Dolly Khanna adds smallcap stock that has delivered 105% return in last 6 months! Do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/dolly-khanna-adds-smallcap-stock-that-has-delivered-105-return-in-last-6-months-do-you-own/articleshow/126608282.cms",
            "description": "Dolly Khanna acquired a 1.13% stake in IFB Agro Industries following strong Q2 results and a 105% stock rally. She trimmed holdings in GHCL, Emkay, Prakash Industries, Som Distilleries, and Coffee Day Enterprises.",
            "pubDate": "2026-01-17T09:32:09.205013"
        },
        {
            "title": "Vijay Kedia adds smallcap power stock to portfolio in December quarter. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/vijay-kedia-adds-smallcap-power-stock-to-portfolio-in-december-quarter-check-details/articleshow/126608237.cms",
            "description": "Vijay Kedia acquired a 1.14% stake in Advait Energy Transitions, a renewable-focused Ahmedabad firm, diversifying his smallcap portfolio. Shares have fallen sharply, but Kedia also invested in Patel Engineering and increased Om Infra holdings.",
            "pubDate": "2026-01-17T09:32:09.205145"
        },
        {
            "title": "Retail investors trim stakes in 12 small-cap stocks for 3 straight quarters; 3 surge over 100% in FY26",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/retail-investors-trim-stakes-in-12-small-cap-stocks-for-3-straight-quarters-3-surge-over-100-in-fy26/slideshow/126606958.cms",
            "description": "As December-quarter shareholding data for nearly 505 small-cap companies begins to roll out, early disclosures are already revealing an interesting market contradiction. A deeper analysis shows that retail investors have steadily reduced their stakes for three consecutive quarters in FY26 across 68 small-cap stocks. (Note: Retail investors are resident individuals holding nominal share capital up to Rs 2 lakhs)What makes this trend intriguing is the price action. More than half of these stocks—35 out of 68—have delivered double-digit returns in FY26 so far, even as retail participation continued to decline. Is this retail profit-booking after a strong rally, or are investors prematurely stepping aside and missing the next leg of upside? The answer, as always, lies somewhere between caution and conviction—and only time will tell. In this analysis, we spotlight 12 small-cap stocks that surged between 40% and 130% during FY26, including three multibaggers, highlighting a growing disconnect between ownership trends and market performance. (Data Source: ACE Equity)",
            "pubDate": "2026-01-17T09:32:09.205249"
        },
        {
            "title": "Concurrent Losers: 10 stocks decline for 5 consecutive sessions",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/concurrent-losers-10-stocks-decline-for-5-consecutive-sessions/slideshow/126606612.cms",
            "description": "Over the five trading sessions ending January 16, the Sensex slipped 0.73%, or 661 points, to settle at 83,570, declining in three of the five sessions between January 9 and 16. Against this backdrop of broader market weakness, about 47 stocks from the BSE 500 index fell in all five consecutive sessions. Among them, we identified 10 stocks that declined on each of the five days, posting cumulative losses of 10% to 22%. (Data Source: ACE Equity)",
            "pubDate": "2026-01-17T09:32:09.205351"
        },
        {
            "title": "Smallcap stocks jump up to 62% this week! How many do you own?",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/smallcap-stocks-jump-up-to-62-this-week-how-many-do-you-own/slideshow/126606077.cms",
            "description": "After a bruising 2025, when the Nifty Smallcap 100 index fell nearly 6%, 2026 is shaping up to be another difficult year—at least judging by January’s early trend. While the index is already down about 2%, several pockets across sectors such as metal, financials among others have stood out as clear outliers, delivering sharp gains of up to 62% in just a week. Here’s the full list of the best-performing smallcap stocks in the week gone by.",
            "pubDate": "2026-01-17T09:32:09.205452"
        },
        {
            "title": "Nifty consolidates below 25,900 as markets await decisive trigger",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/nifty-consolidates-below-25900-as-markets-await-decisive-trigger/articleshow/126611826.cms",
            "description": "Indian markets consolidated in a narrow range during the truncated week, with Nifty ending marginally positive.  The index remains below its recent high, awaiting a decisive catalyst.  Traders are advised to be cautious and focus on stock-specific opportunities with risk management.",
            "pubDate": "2026-01-17T10:59:18.054868"
        },
        {
            "title": "Rs 2.5 lakh crore IPO boom in 2026 could create ‘liquidity drain’, says HDFC Securities; pegs Nifty at 28,720",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/rs-2-5-lakh-crore-ipo-boom-in-2026-could-create-liquidity-drain-says-hdfc-securities-pegs-nifty-at-28720/articleshow/126613059.cms",
            "description": "Indian markets enter 2026 balancing growth optimism with risks from a massive IPO pipeline and weak FII flows. HDFC Securities sees policy support, domestic liquidity, easing global risks and valuation corrections driving a potential Goldilocks recovery, with 16% earnings growth.",
            "pubDate": "2026-01-17T11:41:49.836477"
        },
        {
            "title": "FIIs dump Rs 22,530 crore worth of domestic shares in first fortnight of January",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fiis-dump-rs-22530-crore-worth-of-domestic-shares-in-first-fortnight-of-january/articleshow/126612976.cms",
            "description": "Foreign institutional investors sold Rs 22,530 crore of Indian equities in early January, accelerating outflows despite selective Q3 earnings optimism. Analysts cite tariff uncertainties, geopolitical risks, high valuations and AI-led global shifts, urging cautious positioning and focus on quality large-cap and select midcap stocks.",
            "pubDate": "2026-01-17T11:41:49.836583"
        },
        {
            "title": "SIP stocks! HDFC Securities names 10 companies to accumulate in 2026. Check details",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sip-stocks-hdfc-securities-names-10-companies-to-accumulate-in-2026-check-details/slideshow/126613282.cms",
            "description": "Amid heightened volatility in early 2026, HDFC Securities has identified 10 stocks to accumulate through 2026, spanning small-, mid- and large-cap companies across sectors. The picks are anchored in strong fundamentals, healthy balance sheets and long-term earnings visibility, offering investors a disciplined way to navigate market swings and build wealth over the year.",
            "pubDate": "2026-01-17T11:57:04.309300"
        }
    ]
}