{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-20T06:57:11.793763",
    "items": [
        {
            "title": "India Playbook 2025: Global Cheer, Local Resilience Amid Geopolitical Risks",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/india-playbook-2025-global-cheer-local-resilience-amid-geopolitical-risks/articleshow/121285095.cms",
            "description": "Global equity markets have surged, fueled by eased trade tensions and a shift towards bilateral agreements. India's markets reflect improving macro fundamentals, including rebounding forex reserves and increased banking liquidity. Government capex revival and renewed FII inflows further bolster resilience. While consumption slowdown and geopolitical tensions pose challenges, sectors like auto and capital goods outperform.",
            "pubDate": "2025-05-20T06:56:54.885252"
        },
        {
            "title": "FII flows poised for momentum as US rate cut expectations rise",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/fii-flows-poised-for-momentum-as-us-rate-cut-expectations-rise/articleshow/121285016.cms",
            "description": "Foreign institutional investors have resumed investing in Indian equities, driven by easing US inflation, a weakening dollar, and India’s structural growth story. Attractive risk premiums, improving macro stability, and liquidity-rich markets support inflows. However, global uncertainties and weak earnings remain key risks to sustained momentum in FII participation.",
            "pubDate": "2025-05-20T06:56:54.885379"
        },
        {
            "title": "Massive $3.1 bn flows in 2024! Why REITs & fractional ownership are gaining popularity among NRIs",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/massive-3-1-bn-flows-in-2024-why-reits-fractional-ownership-are-gaining-popularity-among-nris/slideshow/121283384.cms",
            "description": "NRIs invested around USD 3.1 billion (INR 26,000 crore) in Indian real estate during the first half of 2024, following a total of about USD 13 billion in 2023, Sreepriya NS, Co-founder and Director of Entrust Family Office said in an interview with ETMarkets.",
            "pubDate": "2025-05-20T06:56:54.885485"
        },
        {
            "title": "Railway stocks crack up to 6% amid broader market sell-off",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/railway-stocks-crack-up-to-6-amid-broader-market-sell-off/articleshow/121284225.cms",
            "description": "Railway stocks fell sharply on Tuesday amid broad market weakness and profit booking, following a sharp rally in recent sessions. Shares of RITES, Titagarh Rail Systems, and Jupiter Wagons led the decline. The fall comes after strong gains driven by optimism over resumed railway orders and sector-specific ETFs delivering over 16% returns last week.",
            "pubDate": "2025-05-20T06:56:54.885608"
        },
        {
            "title": "Cochin Shipyard, ideaForge, GRSE and other defence stocks fall up to 7% as post-Sindoor rally unwinds",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/cochin-shipyard-ideaforge-grse-and-other-defence-stocks-fall-up-to-7-as-post-sindoor-rally-unwinds/articleshow/121283746.cms",
            "description": "Tuesday’s decline followed a broad sell-off in defence stocks on Monday, during which Cochin Shipyard, Mazagon Dock, GRSE, and Hindustan Aeronautics Ltd (HAL) fell by up to 4%.",
            "pubDate": "2025-05-20T06:56:54.885712"
        },
        {
            "title": "MobiKwik shares fall 6% as Q4 net loss widens to Rs 56 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/mobikwik-shares-fall-6-as-q4-net-loss-widens-to-rs-56-crore/articleshow/121283659.cms",
            "description": "MobiKwik shares fell 6.3% after the company reported a sharp Q4FY25 net loss of Rs 56.03 crore, up from just Rs 67 lakh a year ago. Revenue rose 2.6% to Rs 278 crore, and payments GMV grew 2.3x YoY. Despite doubling payments revenue, the company posted an EBITDA loss of Rs 45.8 crore due to lower contribution margins.",
            "pubDate": "2025-05-20T06:56:54.885813"
        },
        {
            "title": "UBS downgrades HAL shares to neutral, stock down 3% on muted near-term outlook",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ubs-downgrades-hal-shares-to-neutral-stock-down-3-on-muted-near-term-outlook/articleshow/121283045.cms",
            "description": "HAL shares: UBS has set a new 12-month price target of Rs 5,600 per share for HAL, indicating a potential upside of 14.5% from its Monday closing price of Rs 5,016. The brokerage had previously set the target at Rs 5,440.",
            "pubDate": "2025-05-20T06:56:54.886015"
        },
        {
            "title": "Inside the NRI money mindset: What drives their financial strategy",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/inside-the-nri-money-mindset-what-drives-their-financial-strategy/slideshow/121282976.cms",
            "description": "Sreepriya NS, Co-founder and Director at Entrust Family Office, offers valuable insights into the financial thinking of Non-Resident Indians (NRIs). She explains how their mindset is shaped by multiple factors, making it diverse yet strategic.",
            "pubDate": "2025-05-20T06:56:54.886123"
        },
        {
            "title": "Valuations stretched? Brokerages advise reducing exposure in these 5 stocks post Q4 result",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/valuations-stretched-brokerages-advise-reducing-exposure-in-these-5-stocks-post-q4-result/slideshow/121282289.cms",
            "description": "",
            "pubDate": "2025-05-20T06:56:54.886219"
        },
        {
            "title": "Ramesh Damani portfolio stock Protean falls another 13%, now down 30% in 2 days",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/ramesh-damani-portfolio-stock-protean-falls-another-13-now-down-30-in-2-days/articleshow/121281915.cms",
            "description": "Protean share price: Over the past two days, Protean shares have declined by more than 30% in value. If the downward trend persists, the stock could potentially reach its 52-week low of Rs 930. In the opening session, it was trading around Rs 995.",
            "pubDate": "2025-05-20T06:56:54.886315"
        },
        {
            "title": "Sensex drops 200 points lower,  Nifty tests 24,900; RIL, bank stocks drag",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-jumps-over-150-points-higher-nifty-above-24950-it-stocks-rise/articleshow/121281545.cms",
            "description": "Indian benchmark indices Sensex and Nifty50 declined after opening higher on Tuesday due to losses in HDFC Bank, ICICI Bank, and Reliance Industries, influenced by weak global cues. While Asian stocks showed gains, US bond yields rose following a US credit rating downgrade, impacting emerging markets. Experts suggest a cautious market approach with potential consolidation and institutional selling.",
            "pubDate": "2025-05-20T06:56:54.886415"
        },
        {
            "title": "Stocks to buy today: GAIL, Dixon Technologies among top 4 trading ideas for 20 May 2025",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-to-buy-today-gail-dixon-technologies-among-top-4-trading-ideas-for-20-may-2025/articleshow/121281712.cms",
            "description": "Indian market anticipates a positive trading session on Tuesday. This is due to encouraging global signals. Nifty futures saw a dip on Monday. Volatility increased as India VIX rose. Option data suggests a trading range. Experts recommend buying Divi’s Laboratories, Dixon Technologies, GAIL India, and ICICI Prudential Life. Foreign and domestic institutional investors showed caution on Monday with net selling.",
            "pubDate": "2025-05-20T06:56:54.886510"
        },
        {
            "title": "Redington shares zoom 9% after Q4 profit jumps 183% YoY on broad-based demand",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/redington-shares-in-focus-after-q4-profit-jumps-183-yoy-on-broad-based-demand/articleshow/121281671.cms",
            "description": "Redington shares: The company reported a consolidated net profit of Rs 917.7 crore for Q4 FY25, a significant increase from Rs 323.9 crore in the same quarter last year. Revenue grew 17.9% year-on-year, reaching Rs 26,439.7 crore compared to Rs 22,433.4 crore in Q4 FY24.",
            "pubDate": "2025-05-20T06:56:54.886627"
        },
        {
            "title": "JK Paper shares fall over 5% after PAT drops 72% YoY to Rs 77 cr in Q4",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/jk-paper-shares-in-focus-after-pat-drops-72-yoy-to-rs-77-cr-in-q4/articleshow/121281581.cms",
            "description": "JK Paper's shares plummeted following a Q4FY25 earnings report revealing a 72.3% drop in net profit to Rs 77.05 crore. Revenue saw a slight dip, and EBITDA margins contracted significantly due to surging imports and high wood costs. Despite profit pressures, the company achieved record sales and recommended a dividend of Rs 5 per share.",
            "pubDate": "2025-05-20T06:56:54.886722"
        },
        {
            "title": "Power Grid shares drop 2% after Q4 PAT dips marginally to Rs 4,143 crore",
            "link": "https://economictimes.indiatimes.com/markets/stocks/news/power-grid-shares-in-focus-after-q4-pat-dips-marginally-to-rs-4143-cr/articleshow/121281266.cms",
            "description": "Power Grid Corporation of India reported a slight dip in net profit for Q4FY25 and the full fiscal year, despite a marginal increase in revenue. While transmission revenue remained the primary contributor, consultancy and telecom segments showed notable growth. The board recommended a final dividend of Rs 1.25 per share, adding to the interim dividends already paid.",
            "pubDate": "2025-05-20T06:56:54.886818"
        }
    ]
}