{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-02T08:20:56.596563",
    "items": [
        {
            "title": "Why will water infra stocks be in focus in 2025?",
            "link": "https://www.moneycontrol.com/news/business/stocks/why-will-water-infra-stocks-be-in-focus-in-2025-12901871.html",
            "description": "Spatial shortage makes it crucial for India to manage its water resources judiciously",
            "pubDate": "2025-01-02T04:44:05.299449"
        },
        {
            "title": "Petronet LNG shares down 5% as Citi note mentions critical view by PNGRB on tariffs",
            "link": "https://www.moneycontrol.com/news/business/markets/petronet-lng-shares-down-5-as-citi-note-mentions-critical-view-by-pngrb-on-tariffs-12901893.html",
            "description": "Natural gas regulator PNGRB has said that the company seems to have made profit at the cost of gas consumers, and is seeking a framework to bring the regassification activities under its purview.",
            "pubDate": "2025-01-02T04:44:05.299539"
        },
        {
            "title": "Sky Gold: Shining growth prospects",
            "link": "https://www.moneycontrol.com/news/business/stocks/sky-gold-shining-growth-prospects-12901885.html",
            "description": "Increasing market share of key clients, growing exports, and foray into new segments like lab-grown diamonds are among the factors working in favour of the company",
            "pubDate": "2025-01-02T04:51:33.879616"
        },
        {
            "title": "CSB Bank shares 3% higher on strong deposit growth, healthy gold loan book",
            "link": "https://www.moneycontrol.com/news/business/markets/csb-bank-shares-3-higher-on-strong-deposit-growth-healthy-gold-loan-book-12901911.html",
            "description": "The business update shared by CSB Bank on January 1 showed that the total deposits grew by 22.17% on year to Rs 33,406 crore, and advances against gold and gold jewellery rose by 36.28% YoY to Rs 13,018 crore.",
            "pubDate": "2025-01-02T05:32:59.303695"
        },
        {
            "title": "Agri Picks Report January 02 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-january-02-2025-geojit-financial-services-12901949.html",
            "description": "According to Geojit Financial Services, The Union Cabinet Wednesday approved the continuation of the Pradhan Mantri Fasal Bima Yojana and Restructured Weather Based Crop Insurance Scheme till 2025-26 (Apr-Mar), with an overall outlay of INR 695.15 billion from FY22 to FY26, the government said in a release.",
            "pubDate": "2025-01-02T05:57:06.774565"
        },
        {
            "title": "MFIN defers capping lenders to each borrower by three months, other covenants come into effect",
            "link": "https://www.moneycontrol.com/news/business/markets/mfin-defers-capping-lenders-to-each-borrower-by-three-months-other-covenants-come-into-effect-12901945.html",
            "description": "MFIN had in November introduced the measure to reduce number of lenders to a borrower to three, from previously four. MFIN also recommended to cap the indebtedness of a MFI borrower to Rs 2 lakh.",
            "pubDate": "2025-01-02T06:21:19.736533"
        },
        {
            "title": "IT hiring growth rate near double digit, says Info Edge, demand for entry-level talent picking up",
            "link": "https://www.moneycontrol.com/news/business/companies/it-hiring-growth-rate-near-double-digit-says-info-edge-demand-for-entry-level-talent-picking-up-12902061.html",
            "description": "IT companies had in recent years over-hired, which had led to a large bench, thus bringing down the utilisation rate. Now, the utilisation rate is back to pre-Covid levels, observed Info Edge, adding that replacement hirings are commenced, even in  big IT services companies, which will create demand.",
            "pubDate": "2025-01-02T08:20:55.842062"
        }
    ]
}