{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-01T06:38:15.818039",
    "items": [
        {
            "title": "Sun Pharma shares in focus as company to sell 100% stake in Japanese arm",
            "link": "https://www.moneycontrol.com/news/business/stocks/sun-pharma-shares-in-focus-as-company-to-sell-100-stake-in-japanese-arm-12901299.html",
            "description": "Sun Pharmaceutical Industries Share Price | The share touched a 52-week high of Rs 1,960.20 and a 52-week low of Rs 1,258.10 on 30 September, 2024 and 02 January, 2024, respectively. Currently, the stock is trading 3.86 percent below its 52-week high and 49.79 percent above its 52-week low.",
            "pubDate": "2025-01-01T02:37:27.726779"
        },
        {
            "title": "Kalpataru Projects shares in focus on orders win worth Rs 1011 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/kalpataru-projects-shares-in-focus-on-orders-win-worth-rs-1011-crore-12901298.html",
            "description": "Kalpataru Projects International Share Price | The share touched a 52-week high of Rs 1,449.15 and a 52-week low of Rs 696.00 on 06 September, 2024 and 02 January, 2024, respectively. Currently, the stock is trading 10.5 percent below its 52-week high and 86.36 percent above its 52-week low.",
            "pubDate": "2025-01-01T02:37:27.726866"
        },
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-5-12901241.html",
            "description": "The GIFT Nifty is indicating a flat to negative start for the day. Wall Street lost ground on Tuesday as investors closed the book on a remarkable year for equities, during which the U.S. stock market was powered to record highs by the twin engines of the artificial-intelligence boom and the U.S. Federal Reserve's first interest rate cuts in three-and-a-half years.",
            "pubDate": "2025-01-01T02:37:27.726941"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat to negative start; US markets fall",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-01-01-2025-liveblog-12901403.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street lost ground on Tuesday as investors closed the book on a remarkable year for equities, during which the U.S. stock market was powered to record highs by the twin engines of the artificial-intelligence boom and the U.S. Federal Reserve's first interest rate cuts in three-and-a-half years. The Dow Jones Industrial Average on Tuesday fell 29.51 points, or 0.07%, to 42,544.22, the S&P 500 lost 25.31 points, or 0.43%, to 5,881.63 and the Nasdaq Composite lost 175.99 points, or 0.90%, to 19,310.79.",
            "pubDate": "2025-01-01T02:37:27.727014"
        },
        {
            "title": "Trade Spotlight: How should you trade Muthoot Finance, Escorts, Jubilant Foodworks, Sun Pharma, United Breweries, and others on January 1?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-muthoot-finance-escorts-jubilant-foodworks-sun-pharma-united-breweries-and-others-on-january-1-12901389.html",
            "description": "The market is expected to remain rangebound until it decisively rebounds and sustains above the 200-day SMA. Below are some trading ideas for the near term.",
            "pubDate": "2025-01-01T02:37:27.727105"
        },
        {
            "title": "Stocks to Watch Today: Kalpataru Projects, ITC, SJVN, Newgen Software, Utkarsh SFB, TVS Holdings in focus on 1 January",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-kalpataru-projects-itc-sjvn-newgen-software-utkarsh-sfb-tvs-holdings-in-focus-on-1-january-12901387.html",
            "description": "Stocks To Watch Today, Jan 1: Stocks like Sun Pharmaceutical Industries, Piramal Enterprises, LT Foods, IndoStar Capital Finance, Hazoor Multi Projects, Persistent Systems, Vishnu Prakash R Punglia, Kirloskar Industries, Easy Trip Planners, AGS Transact Technologies, and Unimech Aerospace will be in focus on January 1.",
            "pubDate": "2025-01-01T02:37:27.727179"
        },
        {
            "title": "Discovery Series | Pearl Global Industries: Well placed to gain from shift in global supply chains",
            "link": "https://www.moneycontrol.com/news/business/stocks/discovery-series-pearl-global-industries-well-placed-to-gain-from-shift-in-global-supply-chains-12901441.html",
            "description": "Comprehensive business model offering multi-country, multi-product solutions to global retailers",
            "pubDate": "2025-01-01T03:41:47.915467"
        },
        {
            "title": "Live: How will Nifty begin the first day of 2025? | Auto stocks in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-how-will-nifty-begin-the-first-day-of-2025-auto-stocks-in-focus-opening-bell-12901440.html",
            "description": "Benchmark indices staged a smart comeback from day's lows and ended flat in the red in the last session. Since it was the final trading day of 2024, Nifty and Sensex posted 8 percent gain last  in the overall year. January month is typically a seasonally weak one and market participants will watch out macro data, auto sales figures, Q3 results from India Inc, among others. Experts now eye Nifty resistance at 23,900 and support placed around 23,500. This morning, majority of markets are closed on account of New Year's holiday. Overnight, the US markets closed on a negative note. Among stocks in focus, watch out for Auto stocks, Thomas Cook, and Kalpataru Projects. Catch Lovisha Darad in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives). Axis Securities and Kranthi Bathini - Equity Strategist at WealthMills Securities.",
            "pubDate": "2025-01-01T03:41:47.915552"
        },
        {
            "title": "Short Call | Will January’s seasonality bring dark clouds over the market? Jindal Steel, Vodafone Idea in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/short-call-will-january-s-seasonality-bring-dark-clouds-over-the-market-jindal-steel-vodafone-idea-in-focus-12901438.html",
            "description": "\"Far more money has been lost by investors preparing for corrections or trying to anticipate corrections than has been lost in corrections themselves.\" - Peter Lynch",
            "pubDate": "2025-01-01T03:41:47.915633"
        },
        {
            "title": "How renewable energy bets transformed JSW Energy",
            "link": "https://www.moneycontrol.com/news/opinion/how-renewable-energy-bets-transformed-jsw-energy-12900933.html",
            "description": "Acquisitions in wind and hydro power will give JSW Energy an edge in FDRE competitive bids",
            "pubDate": "2025-01-01T03:41:47.915703"
        },
        {
            "title": "Brokerage Radar: Tata Chem gets 'reduce' call, caution for NBFCs, banks and real estate",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-tata-chem-gets-reduce-call-caution-for-nbfcs-banks-and-real-estate-12901409.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes stocks like Tata Chemicals and Transport Corp along with sectors like NBFCs, real estate, banks and more.",
            "pubDate": "2025-01-01T03:41:47.915771"
        },
        {
            "title": "Bajaj Auto stock slips 2% on weak December sales data",
            "link": "https://www.moneycontrol.com/news/business/markets/bajaj-auto-stock-slips-2-on-weak-december-sales-data-12901471.html",
            "description": "Bajaj Auto's total sales not just fell marginally on year in December, but also missed the Street's expectations by a decent margin.",
            "pubDate": "2025-01-01T04:22:18.229564"
        },
        {
            "title": "SJVN stock soars 8% after MoU with Bihar govt for Rs 5,663 crore project",
            "link": "https://www.moneycontrol.com/news/business/markets/sjvn-stock-soars-6-5-after-mou-with-bihar-govt-for-rs-5-663-crore-project-12901480.html",
            "description": "In August 2022, SJVN was appointed by the Ministry of Power as the nodal agency to develop Pumped Storage Projects in Bihar, including Telharkund, Sinafdar, Panchgotia, and Hathidah Durgawati.",
            "pubDate": "2025-01-01T04:53:24.922925"
        },
        {
            "title": "Agri Picks Report January 01 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-january-01-2025-geojit-financial-services-12901486.html",
            "description": "According to Geojit Financial Services, Farmers in Maharashtra have sown rabi crops over 5.8 million hectares as of Monday, up 21.6% on year from 4.7 million hectares in the same period last year, according to a report released by the state agriculture department.",
            "pubDate": "2025-01-01T04:53:24.923004"
        },
        {
            "title": "Easy Trip Planners' CEO Nishant Pitti resigns citing 'personal reasons'",
            "link": "https://www.moneycontrol.com/news/business/markets/easy-trip-planners-ceo-nishant-pitti-resigns-citing-personal-reasons-12901485.html",
            "description": "EaseMyTrip is the brand operated by the listed Easy Trip Planner. Shares worth Rs 53 crore of Easy Trip were sold in a block deal on December 31, with co-founder Nishant Pitti being the seller.",
            "pubDate": "2025-01-01T05:39:17.152911"
        },
        {
            "title": "Muthoot Finance – How long will it shine?",
            "link": "https://www.moneycontrol.com/news/business/muthoot-finance-how-long-will-it-shine-12901496.html",
            "description": "Gold loan demand remains robust aided by RBI diktat on unsecured lending",
            "pubDate": "2025-01-01T05:46:46.141114"
        },
        {
            "title": "Accumulate Larsen and Toubro Ltd; target of Rs 4565: Asit C Mehta",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-larsen-and-toubro-ltd-target-of-rs-4565-asit-c-mehta-12901524.html",
            "description": "Asit C Mehta recommended Accumulate rating on Larsen and Toubro Ltd with a target price of Rs 4565 in its research report dated December 24 2024.",
            "pubDate": "2025-01-01T06:13:49.858343"
        },
        {
            "title": "Power Mech stock surges 5% after Rs 294 crore order from Adani Power",
            "link": "https://www.moneycontrol.com/news/business/markets/power-mech-stock-surges-5-after-rs-294-crore-order-from-adani-power-12901535.html",
            "description": "Power Mech Projects saw strong trading volumes, surpassing its one-month daily average, which helped fuel the stock's upward movement during the session.",
            "pubDate": "2025-01-01T06:38:14.231037"
        },
        {
            "title": "Top 25 stocks to bet on in 2025",
            "link": "https://www.moneycontrol.com/news/business/markets/top-25-stocks-to-bet-on-in-2025-12901545.html",
            "description": "From DLF to Bharti Airtel, Moneycontrol brings you a list of top stocks to bet in 2025",
            "pubDate": "2025-01-01T06:38:14.231126"
        }
    ]
}