{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-05T02:21:50.810047",
    "items": [
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a weak start; US, Asian markets fall",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-05-11-2024-liveblog-12858135.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed slightly lower after a choppy session on Monday, as investors prepared for a crucial week in which Americans will elect a new president and the Federal Reserve will announce its policy statement. The Dow Jones Industrial Average fell 257.59 points, or 0.61%, to 41,794.60, the S&P 500 lost 16.11 points, or 0.28%, to 5,712.69 and the Nasdaq Composite lost 59.93 points, or 0.33%, to 18,179.98.",
            "pubDate": "2024-11-05T02:21:47.988725"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-71-12857990.html",
            "description": "The GIFT Nifty is indicating a negative start for the day.",
            "pubDate": "2024-11-05T02:21:47.988819"
        },
        {
            "title": "Stock Radar: ABB India, Raymond, JK Paper, Gland Pharma, Tilaknagar, Amara Raja Energy in focus on Tuesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-abb-india-raymond-jk-paper-gland-pharma-tilaknagar-amara-raja-energy-in-focus-on-tuesday-12858122.html",
            "description": "Stocks  like Indian Railway Catering and Tourism Corporation, Dhampur Bio Organics, KEC International, Bata India, Sundaram Finance, Embassy Office Parks REIT, and Afcons Infrastructure will also be in focus on October 5.",
            "pubDate": "2024-11-05T02:21:47.988900"
        },
        {
            "title": "Trade Spotlight: How should you trade Abbott India, NALCO, ITC, Vishnu Chemicals, Power Grid, and others on Tuesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-abbott-india-nalco-itc-vishnu-chemicals-power-grid-and-others-on-tuesday-12858103.html",
            "description": "The bearish sentiment is expected to continue, as the market traded well below all key moving averages (10-20-50-100 EMAs). Below are some trading ideas for the near term.",
            "pubDate": "2024-11-05T02:21:47.988971"
        }
    ]
}