{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-26T15:44:19.718896",
    "items": [
        {
            "title": "What next for Waaree after withdrawal of US tax incentives for solar?",
            "link": "https://www.moneycontrol.com/news/opinion/what-next-for-waaree-after-withdrawal-of-us-tax-incentives-for-solar-13045411.html",
            "description": "A large part of Waaree’s Rs 47,000 crore order book is from the US",
            "pubDate": "2025-05-26T04:03:28.166049"
        },
        {
            "title": "Glenmark Pharma shares drop 3% on lower-than-expected Q4 results: Should you buy, sell, hold?",
            "link": "https://www.moneycontrol.com/news/business/markets/glenmark-pharma-shares-drop-3-on-lower-than-expected-q4-results-should-you-buy-sell-hold-13045366.html",
            "description": "Glenmark Pharma: Despite strong growth in Europe and domestic formulations, muted demand in India and pressure in diabetes products weighed on overall performance",
            "pubDate": "2025-05-26T04:03:28.166145"
        },
        {
            "title": "Nifty Eyes 25,000 As Bulls Return| India Pips Japan As Fourth Largest Economy| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-eyes-25-000-as-bulls-return-india-pips-japan-as-fourth-largest-economy-opening-bell-live-13045069.html",
            "description": "Nifty 50 rebounded sharply on May 23, breaking its five-day streak of lower highs with a 1% gain, closing near a key resistance level at 24,850. On the weekly chart, the index remains firmly above all major moving averages, reinforcing a positive long-term trend. However, analysts expect near-term consolidation, with the market likely to trade in a range. A sustained hold above 24,700 could pave the way for a move toward 25,000–25,200. Key support is seen at 24,460, close to last week’s low. Stocks to watch include NTPC, JSW Steel, Glenmark, and Eternal. Meanwhile, two IPOs are set to debut on the primary market today: Brookfield-backed Schloss Bangalore (Leela Hotels) and Aegis Vopak Terminals, a unit of Aegis Logistics. Catch Nandita Khemka in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Siddarth Bhamre, Institutional Research Head - ACMIIL (Asit C Mehta Investment Interrmediates Ltd)",
            "pubDate": "2025-05-26T04:03:28.166246"
        },
        {
            "title": "Ashok Leyland shares in focus post Q4 earnings; should you buy, sell or hold?",
            "link": "https://www.moneycontrol.com/news/business/earnings/ashok-leyland-shares-in-focus-post-q4-earnings-should-you-buy-sell-or-hold-13044973.html",
            "description": "Ashok Leyland share price: The company said it is in a very strong cash position, ending the year with a cash surplus of Rs 4,242 crore.",
            "pubDate": "2025-05-26T04:03:28.166322"
        },
        {
            "title": "Can Sensex, Nifty extend gains for a second session? Key levels to watch on May 26",
            "link": "https://www.moneycontrol.com/news/business/markets/can-sensex-nifty-extend-gains-for-a-second-session-check-key-levels-for-may-26-13044906.html",
            "description": "In the previous session, bulls staged a strong comeback with benchmark indices Nifty and Sensex rebounding sharply, led by a rally in banking, IT, and metal stocks.",
            "pubDate": "2025-05-26T04:03:28.166390"
        },
        {
            "title": "Stocks to Watch Today: NTPC, JSW Steel, JK Cement, Ashoka Buildcon, GNFC, Paytm, Eternal, Zydus Life, Nibe, Havells India in focus on 26 May",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-ntpc-jsw-steel-jk-cement-ashoka-buildcon-gnfc-paytm-eternal-zydus-life-nibe-havells-india-in-focus-on-26-may-13044910.html",
            "description": "Stocks to Watch, 26 May: Stocks like Finolex Industries, HBL Engineering, Lux Industries, One 97 Communications Paytm, Eternal, Zydus Lifesciences, NIBE, Havells India, Cartrade Tech, Gravita India, Interarch Building Solutions, Lloyds Engineering Works, Ramco Cements, Pondy Oxides & Chemicals, and Gujarat Narmada Valley Fertilizers & Chemicals will be in focus on May 26.",
            "pubDate": "2025-05-26T04:03:28.166458"
        },
        {
            "title": "Asian shares, US futures rise on EU tariff delay",
            "link": "https://www.moneycontrol.com/news/business/asian-shares-us-futures-rise-on-eu-tariff-delay-13044897.html",
            "description": "Contracts for the S&P 500, Nasdaq 100 and Euro Stoxx 50 rose about 1% after Trump said he had agreed to delay the date for a 50% tariff on goods from the European Union to July 9 from June 1.",
            "pubDate": "2025-05-26T04:03:28.166524"
        },
        {
            "title": "Sensex up 600 pts, Nifty reclaims 25,000 as banks support rally, midcaps outperform",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-up-600-pts-nifty-reclaims-25-000-as-banks-support-rally-midcaps-outperform-13045134.html",
            "description": "The broader market represented by the midcap 100 and smallcap 100 indices gained 0.5 and 0.4 percent, respectively. The two have managed to pare most of their losses and trade just 1 and 6 percent lower YTD.",
            "pubDate": "2025-05-26T04:34:42.215865"
        },
        {
            "title": "Smallcap, midcap stocks rise up to 15%, broader market indices extend gains for second day; check top gainers",
            "link": "https://www.moneycontrol.com/news/business/markets/smallcap-midcap-stocks-rise-up-to-15-broader-market-indices-extend-gains-for-second-day-check-top-gainers-13047057.html",
            "description": "BEML shares were the top gainer on the smallcap index, rallying over 15 percent to close at Rs 4,294.60 apiece.",
            "pubDate": "2025-05-26T11:48:22.925427"
        },
        {
            "title": "Nifty Reclaims 25,000 As Early Monsoons, RBI Dividend Spread Cheer| Eternal In Focus| Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-reclaims-25-000-as-early-monsoons-rbi-dividend-spread-cheer-eternal-in-focus-closing-bell-13046727.html",
            "description": "Nifty reclaims 25,000, logging triple-digit gains. Trump's EU tariff delay, RBI dividend, early monsoon spread cheer. Broader markets upbeat; adv-dec ratio at 2:1. Auto, IT & metals among top sectoral movers. Catch Nandita Khemka and Yatin Mota as they discuss stocks on their radar.",
            "pubDate": "2025-05-26T11:48:22.925513"
        },
        {
            "title": "Gillette India shares rally 11% after firm's Q3 net profit soars 60% to Rs 159 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/gillette-india-shares-rally-11-after-firm-s-q4-net-profit-soars-60-to-rs-159-crore-13046681.html",
            "description": "Gillette India Q3 Results: The company announced a dividend of Rs 47 per share for the financial year 2025.",
            "pubDate": "2025-05-26T11:48:22.925591"
        },
        {
            "title": "Markets extend rally on auto, IT boost; Sensex gains over 450 pts, Nifty reclaims 25,000",
            "link": "https://www.moneycontrol.com/news/business/markets/markets-extend-rally-on-auto-it-boost-sensex-gains-over-400-pts-nifty-eyes-25-000-13046576.html",
            "description": "India VIX, the barometer to assess nervousness in the market, surged 4.28 percent to 18.02, indicating heightened market volatility.",
            "pubDate": "2025-05-26T11:48:22.925660"
        },
        {
            "title": "M&M, Bajaj Auto, other shares surge up to 2% as Auto index emerges as the top gainer: What's driving the rally?",
            "link": "https://www.moneycontrol.com/news/business/markets/m-m-bajaj-auto-other-shares-surge-up-to-2-as-auto-index-emerges-as-the-top-gainer-what-s-driving-the-rally-13046591.html",
            "description": "Nifty Auto index is up over a percent to emerge as the top sectoral gainer, hopeful of export relief after Trump delays EU tariff deadline, and monsoon trend suggests a robust domestic rural demand ahead.",
            "pubDate": "2025-05-26T11:48:22.925736"
        },
        {
            "title": "Buy Zydus Lifesciences; target of Rs 1069: Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-zydus-lifesciences-target-of-rs-1069-deven-choksey-13046557.html",
            "description": "Devan Choksey is bullish on Zydus Lifesciences has recommended buy rating on the stock with a target price of Rs 1069 in its research report dated May 26, 2025.",
            "pubDate": "2025-05-26T11:48:22.925805"
        },
        {
            "title": "Accumulate Colgate Palmolive India; target of Rs 2742: Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-colgate-palmolive-india-target-of-rs-2742-deven-choksey-13046372.html",
            "description": "Deven Choksey recommended accumulate rating on Colgate Palmolive India with a target price of Rs 2742 in its research report dated May 26, 2025.",
            "pubDate": "2025-05-26T11:48:22.926008"
        },
        {
            "title": "Sluggish demand drags passenger vehicle sales down 25% YTD; industry braces for muted FY26 growth",
            "link": "https://www.moneycontrol.com/news/business/markets/sluggish-demand-drags-passenger-vehicle-sales-down-25-ytd-industry-braces-for-muted-fy26-growth-13046507.html",
            "description": "According to the Society of Indian Automobile Manufacturers (SIAM), domestic PV sales are expected to remain largely unchanged, with just a marginal improvement next year.",
            "pubDate": "2025-05-26T11:48:22.926074"
        },
        {
            "title": "Accumulate Navin Fluorine International; target of Rs 4895: Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-navin-fluorine-international-target-of-rs-4895-deven-choksey-13046371.html",
            "description": "Deven Choksey recommended accumulate rating on Navin Fluorine International with a target price of Rs 4895 in its research report dated May 26, 2025.",
            "pubDate": "2025-05-26T11:48:22.926142"
        },
        {
            "title": "Avoid for Aegis Vopak Terminals Ltd IPO; Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/avoid-for-aegis-vopak-terminals-ltd-ipo-deven-choksey-13046376.html",
            "description": "Deven Choksey, has come out with its report on Aegis Vopak Terminals Ltd. The research firm has recommended to “ Avoid” the ipo in its research report as on May 26, 2025.",
            "pubDate": "2025-05-26T11:48:22.926271"
        },
        {
            "title": "Subscribe for Schloss Bangalore Ltd IPO; Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-schloss-bangalore-ltd-ipo-deven-choksey-13046373.html",
            "description": "Deven Choksey, has come out with its report on Schloss Bangalore Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on May 26, 2025.",
            "pubDate": "2025-05-26T11:48:22.926355"
        },
        {
            "title": "Telecom is the new petrol: Why Bharti Airtel could be a money machine",
            "link": "https://www.moneycontrol.com/news/business/markets/telecom-is-the-new-petrol-why-bharti-airtel-could-be-a-money-machine-13046410.html",
            "description": "Sector consolidation, tariff power and fading capex make Airtel a compounding story",
            "pubDate": "2025-05-26T11:48:22.926428"
        },
        {
            "title": "Defence stocks extend gains for a third session on orderbook hopes after PM Modi applauds 'Make in India' push",
            "link": "https://www.moneycontrol.com/news/business/markets/defence-stocks-extend-gains-for-a-third-session-on-orderbook-hopes-after-pm-modi-applauds-make-in-india-push-13046341.html",
            "description": "The Nifty India Defence index has extended gains for a third consecutive session, supported by hopes of stronger orderbooks for defence manufacturers and hopes of sustained demand for the longer term.",
            "pubDate": "2025-05-26T11:48:22.926494"
        },
        {
            "title": "Sensex higher by 0.5 percent, Nifty tests 25,000 in early trade, helped by Auto and IT, early onset of monsoon",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-higher-by-0-5-percent-nifty-tests-25-000-in-early-trade-helped-by-auto-and-it-early-onset-of-monsoon-13046210.html",
            "description": "Analysts said Nifty’s move last week to test 25,000 has turned it into an immediate support, with further resistance seen at 25,150–25,350. A sustained move above these levels could open the door for further gains.",
            "pubDate": "2025-05-26T11:48:22.926557"
        },
        {
            "title": "IndusInd Bank: Buy or sell? Valuation at historic low, but analysts still wary of fresh buys",
            "link": "https://www.moneycontrol.com/news/business/markets/indusind-bank-buy-or-sell-valuation-at-historic-low-but-analysts-still-wary-of-fresh-buys-13046150.html",
            "description": "Downgrades pile up, yet most brokerages remain cautious despite deep-value appeal",
            "pubDate": "2025-05-26T11:48:22.926619"
        },
        {
            "title": "Buy Ashok Leyland; target of Rs 268: LKP Research",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-ashok-leyland-target-of-rs-268-lkp-research-13046025.html",
            "description": "LKP Research is bullish on Ashok Leyland has recommended buy rating on the stock with a target price of Rs 268 in its research report dated May 26, 2025.",
            "pubDate": "2025-05-26T11:48:22.926681"
        },
        {
            "title": "GE Vernova T&D shares hit 10% upper circuit as Q4 profit nearly triples, Nomura issues a Buy call",
            "link": "https://www.moneycontrol.com/news/business/markets/ge-vernova-t-d-shares-hit-10-upper-circuit-as-q4-profit-nearly-triples-nomura-issues-a-buy-call-13045898.html",
            "description": "GE Vernova T&D India share price: Nomura maintained its 'Buy' rating on the stock, with a target price of Rs 2,600 apiece. This implies an upside potential of nearly 38 percent from the stock's previous closing price.",
            "pubDate": "2025-05-26T11:48:22.926743"
        },
        {
            "title": "Leela Hotels IPO: Should you check into this public issue?",
            "link": "https://www.moneycontrol.com/news/business/stocks/leela-hotels-ipo-should-you-check-into-this-public-issue-13045730.html",
            "description": "The Indian hospitality industry, particularly the luxury segment in which Schloss Bangalore (operator of Leela Hotels) operates, is poised for a sustained upcycle over the medium term",
            "pubDate": "2025-05-26T11:48:22.926869"
        },
        {
            "title": "Balkrishna Industries plunges 10% on weak Q4; Nomura downgrades to 'neutral'",
            "link": "https://www.moneycontrol.com/news/business/markets/balkrishna-industries-plunges-10-on-weak-q4-nomura-downgrades-to-neutral-13045755.html",
            "description": "Balkrishna Industries share price: The Q4FY25 net profit stood at Rs 362 crore, weighed down by higher input, employee, and finance costs, even as revenue grew 5 percent year-on-year to Rs 2,838 crore.",
            "pubDate": "2025-05-26T11:48:22.926932"
        },
        {
            "title": "Paytm shares rise 2% after Supreme Court stays Rs 5,700 crore GST notice against subsidiary First Games",
            "link": "https://www.moneycontrol.com/news/business/markets/paytm-shares-rise-2-after-supreme-court-stays-rs-5-700-crore-gst-notice-against-subsidiary-first-games-13045621.html",
            "description": "The show cause notice was sent to First Games after DGGI had taken the view that GST liability should be calculated at 28% on the total entry amount, higher than the 18% GST paid on the platform fee generated by the gaming companies.",
            "pubDate": "2025-05-26T11:48:22.926994"
        },
        {
            "title": "Aurobindo Pharma Q4 net dips marginally to Rs 903 cr; revenue at Rs 8,382 cr",
            "link": "https://www.moneycontrol.com/news/business/earnings/aurobindo-pharma-q4-net-dips-marginally-to-rs-903-cr-revenue-at-rs-8-382-cr-13047474.html",
            "description": "For the full year ended March 31, 2025, the company said its PAT rose 10 per cent to Rs 3,484 crore against Rs 3,169 crore in FY24",
            "pubDate": "2025-05-26T15:44:19.202130"
        }
    ]
}