{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-28T11:55:47.371094",
    "items": [
        {
            "title": "Shriram Finance: Can it gain from its rural focus?",
            "link": "https://www.moneycontrol.com/news/business/earnings/shriram-finance-can-it-gain-from-its-rural-focus-13006276.html",
            "description": "The company’s growth met guidance, but higher credit cost weighed down on profitability in the March quarter",
            "pubDate": "2025-04-28T04:52:32.363923"
        },
        {
            "title": "Buy Dalmia Bharat Ltd; target of Rs 2328: Asit C Mehta",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-dalmia-bharat-ltd-target-of-rs-2328-asit-c-mehta-13006335.html",
            "description": "Asit C Mehta is bullish on Dalmia Bharat Ltd has recommended buy rating on the stock with a target price of Rs 2328 in its research report dated April 28 2025.",
            "pubDate": "2025-04-28T04:52:32.364008"
        },
        {
            "title": "Subscribe for Ather Energy Ltd IPO; Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-ather-energy-ltd-ipo-geojit-financial-services-13006291.html",
            "description": "Geojit Financial Services, has come out with its report on Ather Energy Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on April 25, 2025.",
            "pubDate": "2025-04-28T04:52:32.364080"
        },
        {
            "title": "Agri Picks Report April 28, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-april-28-2025-geojit-financial-services-13006277.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.94 million acres (1 acre = 0.4 hectares) as of Wednesday, up 17.2% from 6.77 million acres a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-04-28T04:52:32.364149"
        },
        {
            "title": "Live: Can Q4 results support market rally this week? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-q4-results-support-market-rally-this-week-opening-bell-13006218.html",
            "description": "Markets ended lower in the last session, with the Nifty slipping 207 points to close below 24,050, even though the market had posted gains of nearly 1% last week, with 30 out of 50 Nifty stocks ending positively. The IT index bucked the broader trend, rising nearly 1% over the week. Looking ahead, Q4 results from TVS Motor and Ultratech Cement are due this week. Meanwhile, Ather Energy’s Rs 2,981 crore IPO, the first mainboard IPO in two months, opens today with a price band set at Rs 304-321 per share. This morning, global cues were xxx. Catch Lovisha Darad in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives) at Axis Securities and Anshul Saigal—Market Expert.",
            "pubDate": "2025-04-28T04:52:32.364217"
        },
        {
            "title": "Bajaj Housing’s growth trend, asset quality remain steady",
            "link": "https://www.moneycontrol.com/news/business/earnings/bajaj-housing-s-growth-trend-asset-quality-remain-steady-13006241.html",
            "description": "Strong profit growth, fuelled by robust AUM growth",
            "pubDate": "2025-04-28T04:52:32.364302"
        },
        {
            "title": "RailTel Corporation shares gain on winning order worth Rs 90 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/railtel-corporation-shares-in-focus-on-winning-order-worth-rs-90-crore-13006089.html",
            "description": "RailTel Corporation of India Share Price | The contract is for design, development, supply, implementation, operations and maintenance of the enterprise resource planning system(ERP) for MTC Chennai, TNSTC-Coimbatore and TNSTCMadurai and to be executed by October 18, 2026.",
            "pubDate": "2025-04-28T04:52:32.364369"
        },
        {
            "title": "Biocon shares up 2% on positive opinions for biosimilar Denosumab in Europe",
            "link": "https://www.moneycontrol.com/news/business/stocks/biocon-shares-in-focus-on-positive-opinions-for-biosimilar-denosumab-in-europe-13006090.html",
            "description": "Biocon Share Price | On April 23, Biocon board approved the raising of funds up to Rs 4,500 crore via the issuance of equity shares, non-convertible debt instruments along with warrants, by way of qualified institutions placement(s), rights issue, preferential allotment, or private placement(s), in one or more tranches.",
            "pubDate": "2025-04-28T04:52:32.364436"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex up 760 pts, Nifty at 24250; RIL, BEL, Bajaj Finserv top gainers",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-28-04-2025-liveblog-13006169.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Reliance Industries, M&M, Bharat Electronics, ICICI Bank, Jio Financial are  among major gainers on the Nifty, while losers are Shriram Finance, HCL Tech, TCS, Infosys, Tech Mahindra. BSE Midcap index up 0.4 percent, while smallcap index is trading in the red. Among sectors, except IT, FMCG, media, all other indices are trading in the green.",
            "pubDate": "2025-04-28T04:52:32.364504"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-90-13004542.html",
            "description": "The Foreign institutional investors (FIIs) extended their buying on eight consecutive sessions on April 25 as they bought equities worth Rs 2952 crore. However, after remaining net sellers for the previous three session Domestic institutional investors (DIIs) turned net buyers as the bought equities of Rs 3539 crore on the same day.",
            "pubDate": "2025-04-28T04:52:32.364568"
        },
        {
            "title": "Trade Spotlight: How should you trade Grasim, UltraTech Cement, Dalmia Bharat, MCX India, Navin Fluorine, Havells and others on April 28?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-grasim-ultratech-cement-dalmia-bharat-mcx-india-navin-fluorine-havells-and-others-on-april-28-13006150.html",
            "description": "Following a significant run-up and subsequent profit booking, the index is expected to remain range-bound in the near term. Below are some trading ideas to consider for short term.",
            "pubDate": "2025-04-28T04:52:32.364631"
        },
        {
            "title": "Stocks to Watch Today: Reliance Industries, IDFC First Bank, Tata Tech, Tejas Networks, India Cements, IGL, Biocon, Zydus Life in focus on 28 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-reliance-industries-idfc-first-bank-tata-tech-tejas-networks-india-cements-igl-biocon-zydus-life-in-focus-on-28-april-13006146.html",
            "description": "Stocks to Watch, 28 Apr: Stocks like Sasken Technologies, SBFC Finance, Mangalore Refinery and Petrochemicals, Bhansali Engineering Polymers, Rossari Biotech, Zensar Technologies, L&T Finance, Force Motors, Lloyds Metals and Energy, Poonawalla Fincorp, Mahindra Holidays & Resorts India, Tata Technologies, and DCB Bank will be in focus on April 28.",
            "pubDate": "2025-04-28T04:52:32.364695"
        },
        {
            "title": "Kotak Institutional's Pratik Gupta conservative on earnings growth, sees recovery by September",
            "link": "https://www.moneycontrol.com/news/business/markets/kotak-institutional-s-pratik-gupta-conservative-on-earnings-growth-sees-recovery-by-september-13007100.html",
            "description": "Prartik Gupta said he is weary of a poor June quarter and sees September or December to bring in QoQ and YoY earnings improvements. This is likely to be supported by better liquidity, a stable rupee, lower oil and a normal monsoon.",
            "pubDate": "2025-04-28T11:55:41.669053"
        },
        {
            "title": "Taking Stock: Markets bounce back, Nifty above 24,300 as RIL surges; Buying in defence-related stocks",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-markets-bounce-back-nifty-above-24-300-as-ril-surges-buying-in-defence-related-stocks-13006862.html",
            "description": "Reliance Industries, SBI Life, Bharat Electronics, Sun Pharma, JSW Steel were among biggest gainers on the Nifty, while losers were Shriram Finance, HCL Technologies, Eternal, UltraTech Cement, HUL.",
            "pubDate": "2025-04-28T11:55:41.670152"
        },
        {
            "title": "Live: Sensex at 4-month high, Nifty above 24,300 | RIL, M&M in focus |Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-sensex-at-4-month-high-nifty-above-24-300-ril-m-m-in-focus-closing-bell-13006990.html",
            "description": "Marvelous monday! Sensex, nifty surge over 1%. sensex at 4-month high, nifty above 24,300. barring it, all sectors in positive lane. advance decline ratio at 1:1. Midcap index outperforms smallcaps. Nifty 50 gainers: RIL, Sun Pharma, BEL. Nifty 50 losers: Shriram finance, HCL tech, Ultratech Cement. Catch Lovisha Darad and Yatin Motas as they break down the market action and share the stocks on their radar.",
            "pubDate": "2025-04-28T11:55:41.670216"
        },
        {
            "title": "Nifty Bank snaps three-day losing streak: PNB, SBI, Axis shares rise over 2%",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-bank-snaps-three-day-losing-streak-pnb-sbi-axis-shares-rise-over-2-13006942.html",
            "description": "Axis Bank shares surged 2 percent after lender’s Q4 results beat estimates. It had reported a net profit of Rs 7,118 crore in Q4FY25, marginally lower than Rs 7,130 crore in the corresponding quarter last year.",
            "pubDate": "2025-04-28T11:55:41.670281"
        },
        {
            "title": "Sensex reclaims 80,000, Nifty snaps 2-day losing streak as RIL, PSU bank stocks rally",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-reclaims-80-000-nifty-snaps-2-day-losing-streak-as-ril-psu-bank-stocks-rally-13006902.html",
            "description": "In the broader market, the Midcap 100 and Smallcap 100 indices gained 0.8 percent and 1.6 percent, respectively.",
            "pubDate": "2025-04-28T11:55:41.670540"
        }
    ]
}