{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-18T05:43:01.346947",
    "items": [
        {
            "title": "LTIMindtree shares surge 2.36% amid high volume",
            "link": "https://www.moneycontrol.com/news/business/stocks/ltimindtree-shares-surge-2-36-amid-high-volume-13556449.html",
            "description": "With high volume and positive price movement, LTIMindtree demonstrates strong market activity and consistent financial growth.",
            "pubDate": "2025-09-18T05:41:50.025094"
        },
        {
            "title": "Juniper Hotels: Why you should check into this hotel stock",
            "link": "https://www.moneycontrol.com/news/business/stocks/juniper-hotels-why-you-should-check-into-this-hotel-stock-13556224.html",
            "description": "The company has aggressive inventory addition plans and aims to almost double the inventory over the next 4-5 years",
            "pubDate": "2025-09-18T05:41:50.025174"
        },
        {
            "title": "Cohance Life shares tumble 6% as 3.4 crore shares exchange hands via block deal",
            "link": "https://www.moneycontrol.com/news/business/markets/cohance-life-shares-tumble-6-as-3-4-crore-shares-exchange-hands-via-block-deal-13556246.html",
            "description": "While Jusmiral Holdings is reported to be the seller, Jefferies remains bullish on the CRDMO story, assigning a Buy rating and Rs 1,150 target price",
            "pubDate": "2025-09-18T05:41:50.025241"
        },
        {
            "title": "Infosys, LTIMindtree, Wipro, other IT stocks rise up to 3% after 25 bps Fed rate cut",
            "link": "https://www.moneycontrol.com/news/business/markets/infosys-ltimindtree-wipro-other-it-stocks-rise-up-to-3-after-25-bps-fed-rate-cut-13556193.html",
            "description": "IT stocks: The Nifty IT index rose 1.5 percent in the morning to 37,006, extending gains for the third consecutive session.",
            "pubDate": "2025-09-18T05:41:50.025310"
        },
        {
            "title": "Buy Abbott India; target of Rs 34,470: Mirae Asset Sharekhan",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-abbott-india-target-of-rs-34-470-mirae-asset-sharekhan-13556214.html",
            "description": "Mirae Asset Sharekhan is bullish on Abbott India has recommended buy rating on the stock with a target price of Rs 34,470 in its research report dated September 17, 2025.",
            "pubDate": "2025-09-18T05:41:50.025382"
        },
        {
            "title": "Nifty Bulls Gear Up For 25,500 As Fed Resumes Easing Cycle With 25 Bps Rate Cut | Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-bulls-gear-up-for-25-500-as-fed-resumes-easing-cycle-with-25-bps-rate-cut-opening-bell-live-13555983.html",
            "description": "Nifty is set for a strong start, with the GIFT Nifty indicating a gap-up open after the U.S. Federal Reserve cut rates by 25 bps and signaled two more cuts this year. On Wednesday, the index gained 0.4%, closing above 25,250 and extending its higher-high, higher-low pattern, backed by bullish momentum indicators. Experts see room for the Nifty to reclaim 25,550 and possibly retest the year’s high of 25,669, as long as it holds the key support zone of 25,150–25,000. A break below that range could trigger profit-taking. Cohance Lifesciences, Bajaj Finserv and Indolasr are among the stocks to watch out for today. Catch Nandita Khemka in conversation with Mark Matthews, Head of Research – Asia at Julius Baer, Chandan Taparia, Senior VP & Head of Derivatives & Technical Research at Motilal Oswal, and Vinit Sambre, Head of Equities at DSP Mutual Fund.",
            "pubDate": "2025-09-18T05:41:50.025450"
        },
        {
            "title": "How to unpack Groww's IPO",
            "link": "https://www.moneycontrol.com/news/opinion/how-to-unpack-groww-s-ipo-13555428.html",
            "description": "Groww's Rs 7,000 crore IPO at $9 billion valuation presents a classic case study of high client growth versus revenue efficiency",
            "pubDate": "2025-09-18T05:41:50.025514"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-3-13553347.html",
            "description": "Oil prices were little changed on Thursday after the US central bank lowered its key interest rate as widely expected",
            "pubDate": "2025-09-18T05:41:50.025579"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty at 25,430, Sensex rises 340 pts; IT, realty, financial rally",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-18-09-2025-liveblog-13555177.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Infosys, Wipro, Sun Pharma, HCL Technologies, HDFC Life are among major gainers on the Nifty, while losers are Bajaj Finance, Hindalco, Apollo Hospitals, UltraTech Cement, Bharat Electronics. Except metal all other sectoral indices are trading in the green with IT index up 1.4%. BSE Midcap and smallcap indices are trading with marginal gains.",
            "pubDate": "2025-09-18T05:41:50.025641"
        },
        {
            "title": "Trade Spotlight: How should you trade Tata Consumer Products, KPIT Technologies, MCX India, CAMS, IREDA, M&M Financial, and others on September 18?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-tata-consumer-products-kpit-technologies-mcx-india-cams-ireda-m-m-financial-and-others-on-september-18-13555140.html",
            "description": "The trend is likely to remain favourable for the bulls, but some consolidation can't be ruled out. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-09-18T05:41:50.025702"
        },
        {
            "title": "Stocks to Watch Today: Cohance Lifesciences, Indosolar, Biocon, Cochin Shipyard, Dixon Technologies, Gujarat Fluorochem, Airfloa in focus on 18 September",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-cohance-lifesciences-indosolar-biocon-cochin-shipyard-dixon-technologies-gujarat-fluorochem-airfloa-in-focus-on-18-september-13555127.html",
            "description": "Stocks to Watch, 18 September: Stocks like Cochin Shipyard, Dixon Technologies, Cohance Lifesciences, Indosolar, Biocon Gujarat Fluorochemicals, Airfloa Rail Technology, BR Goyal Infrastructure, Aavas Financiers, Federal Bank, Yes Bank, and Bandhan Bank will be in focus on September 18.",
            "pubDate": "2025-09-18T05:41:50.025776"
        },
        {
            "title": "Promoter sells 1.18% stake in Gujarat Fluorochem for Rs 460 crore; Pitti Engineering sees share exchange worth Rs 102 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/promoter-sells-1-18-stake-in-gujarat-fluorochem-for-rs-460-crore-pitti-engineering-sees-share-exchange-worth-rs-102-crore-13554991.html",
            "description": "SBI Mutual Fund acquired 10.73 lakh shares in Pitti Engineering for Rs 101.99 crore.",
            "pubDate": "2025-09-18T05:41:50.025845"
        }
    ]
}