{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-11T13:34:43.467470",
    "items": [
        {
            "title": "Pharma stocks rally on Trump's tariff pause, led by up to 5% surge in Granules, Laurus Labs, Cipla",
            "link": "https://www.moneycontrol.com/news/business/markets/pharma-stocks-rally-on-trump-s-tariff-pause-led-by-up-to-5-surge-in-granules-laurus-labs-cipla-12991516.html",
            "description": "The recent global tariff changes have added uncertainty to markets, but India is being seen as better-positioned, with money managers pointing at sectors like banking, pharma, and energy as attractive bets.",
            "pubDate": "2025-04-11T04:50:29.375531"
        },
        {
            "title": "Coforge, Wipro, Infosys lead Nifty IT rebound as Trump's tariff pause eases business jitters",
            "link": "https://www.moneycontrol.com/news/business/markets/coforge-wipro-infosys-lead-nifty-it-rebound-as-trump-s-tariff-pause-eases-business-jitters-12991493.html",
            "description": "The IT sector has been one of the worst-hit in this global market rout as these companies derive major portions of their revenue from the American market. The Nifty IT index crashed over 10 percent between April 2 and April 9.",
            "pubDate": "2025-04-11T04:50:29.375632"
        },
        {
            "title": "Agri Picks Report April 11, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-april-11-2025-geojit-financial-services-12991481.html",
            "description": "According to Geojit Financial Services, Private weather forecaster Skymet has predicted a 'normal' southwest monsoon for India at 103% of the longperiod average, with an error margin of +/-5%. The season is likely to begin with relatively less rains, as the forecaster predicts rainfall in June at 96% of the long-period average.",
            "pubDate": "2025-04-11T04:50:29.375706"
        },
        {
            "title": "Live: Will Trump’s Tariff Pause Propel Nifty To 23,000? Street Verdict On TCS Q4| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-trump-s-tariff-pause-propel-nifty-to-23-000-street-verdict-on-tcs-q4-opening-bell-12991444.html",
            "description": "The Nifty 50 had a rangebound session again amid tariff-led uncertainty, possibly waiting for a trigger related to tariffs to gain firm direction. The index closed 0.6 percent lower on April 9 after the RBI policy. The VIX remained above the 20 mark. However, Trump’s decision later in the day on Wednesday to pause reciprocal tariffs for 90 days for all trade partners, barring China (which attracts a 125% tariff rate), raised hopes for an upward change in market trend, according to experts. Technically, on the higher side, the index may face a hurdle at 22,850, followed by the 23,200-23,400 area; above this, the bulls may gain strength. However, support is placed at the 22,250-22,000 zone. TCS reported weak set of numbers for Q4. We decode the numbers with Omkar Tanksale, Senior Research Analyst - IT, Axis Securities. Also catch Nandita Khemka in conversation with Raja Venkatraman, Co-Founder, NeoTrader and market expert Ajay Bagga.",
            "pubDate": "2025-04-11T04:50:29.375773"
        },
        {
            "title": "TCS Q4 FY25 – Is it worth a look post the U-turn on US tariff?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/tcs-q4-fy25-is-it-worth-a-look-post-the-u-turn-on-us-tariff-12991446.html",
            "description": "Upside triggers are missing, but downside looks limited despite volatility",
            "pubDate": "2025-04-11T04:50:29.375841"
        },
        {
            "title": "Biocon share price rises 4% on US FDA approval for cancer drug",
            "link": "https://www.moneycontrol.com/news/business/stocks/biocon-share-price-in-focus-on-us-fda-approval-for-cancer-drug-12991138.html",
            "description": "Biocon Share Price | The approval of JOBEVNE expands Biocon Biologics’ biosimilar oncology portfolio in the United States, which also includes OGIVRI (Trastuzumab-dkst) and FULPHILA (Pegfilgrastim-jmdb).",
            "pubDate": "2025-04-11T04:50:29.375907"
        },
        {
            "title": "BHEL share price up 2% on signing MoU with Nuovo Pignone International",
            "link": "https://www.moneycontrol.com/news/business/stocks/bhel-share-price-in-focus-on-signing-mou-with-nuovo-pignone-international-12991139.html",
            "description": "Bharat Heavy Electricals Share Price | BHEL shall be the main (lead) bidder to the identified customers for addressing the compressors train revamp business opportunities in fertiliser sector in India and Nuovo Pignone International will be nominated vendor to BHEL through the subject MoU with definite scope of work.",
            "pubDate": "2025-04-11T04:50:29.375971"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex up 1,300 pts, Nifty above 22,800; Muthoot Finance down 5%",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-11-04-2025-liveblog-12991403.html",
            "description": "Sensex Today | Stock Market LIVE Updates: All the sectoral indices are trading in the green. BSE Midcap and Smallcap indices up 2 percent each. Tata Steel, Hindalco, JSW Steel, Tata Motors, Sun Pharma are among major gainers on the Nifty, while losers are Asian Paints, Apollo Hospitals and HDFC Life.",
            "pubDate": "2025-04-11T04:50:29.376036"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-82-12990614.html",
            "description": "The Foreign institutional investors (FIIs) continued their selling on eighth day on April 9, as they sold equities worth Rs 4358 crore, however, Domestic institutional investors (DIIs) extended their buying on third day as they bought equities of Rs 2976 crore.",
            "pubDate": "2025-04-11T04:50:29.376101"
        },
        {
            "title": "Trade Spotlight: How should you trade Ambuja Cements, HUDCO, Colgate Palmolive, Apollo Tyres, Bajaj Finserv, United Spirits, and others on April 11?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-ambuja-cements-hudco-colgate-palmolive-apollo-tyres-bajaj-finserv-united-spirits-and-others-on-april-11-12991388.html",
            "description": "The market is expected to witness a healthy rally in the upcoming session after Trump announced a 90-day pause on tariffs for all countries except China (which remains subject to a 145% tariff rate), though uncertainties persist. Below are some trading ideas for the near term.",
            "pubDate": "2025-04-11T04:50:29.376166"
        },
        {
            "title": "Stocks to Watch Today: TCS, Biocon, GAIL, Greaves Cotton, Sun Pharma, Dishman Carbogen Amcis, Coromandel International in focus on 11 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-biocon-gail-greaves-cotton-sun-pharma-dishman-carbogen-amcis-coromandel-international-in-focus-on-11-april-12991380.html",
            "description": "Stocks to Watch, 11 Apr: Stocks like TARC, Bharti Hexacom, Infosys, Aurobindo Pharma, Bharat Heavy Electricals, Bank of India, Tata Steel, Sanofi India, Punjab National Bank, Axiscades Technologies, JSW Energy, Eternal, Federal Bank, Bajaj Healthcare, SRF, Samvardhana Motherson International, IIFL Finance, and Northern Arc Capital will be in focus on April 11.",
            "pubDate": "2025-04-11T04:50:29.376230"
        },
        {
            "title": "Muthoot Finance tumbles 6% as RBI’s draft gold loan norms spark volatility; Kotak downgrades stock",
            "link": "https://www.moneycontrol.com/news/business/stocks/muthoot-finance-tumbles-6-as-rbi-s-draft-gold-loan-norms-spark-volatility-kotak-downgrades-stock-12991584.html",
            "description": "Kotak Institutional Equities downgraded Muthoot Finance to ‘Add’ from ‘Buy’ and reduced its price target to Rs 2,250 from Rs 2,400, citing concerns over the draft gold loan guidelines issued by the RBI.",
            "pubDate": "2025-04-11T05:56:00.944486"
        },
        {
            "title": "Investors cheer Trump's tariff pause: These are the top gaining spaces",
            "link": "https://www.moneycontrol.com/news/business/markets/investors-cheer-trump-s-tariff-pause-these-are-the-top-gaining-spaces-12991559.html",
            "description": "Sensex surged over 1,300 points to hover around 75,176, while Nifty was up nearly 2 percent to stand at nearly 22,843.",
            "pubDate": "2025-04-11T05:56:00.944654"
        },
        {
            "title": "Buy Tata Consultancy Services; target of Rs 3950: Choice Equity Broking",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-tata-consultancy-services-target-of-rs-3950-choice-equity-broking-12991597.html",
            "description": "Choice Equity Broking is bullish on Tata Consultancy Services has recommended buy rating on the stock with a target price of Rs 3950 in its research report dated April 11, 2025.",
            "pubDate": "2025-04-11T05:56:00.944856"
        },
        {
            "title": "TCS shares in mild green post-Q4 results; brokerages weigh near-term risks, reiterate long-term optimism",
            "link": "https://www.moneycontrol.com/news/business/stocks/tcs-shares-in-mild-green-post-q4-results-brokerages-weigh-near-term-risks-reiterate-long-term-optimism-12991549.html",
            "description": "While brokerages remain watchful of short-term revenue risks, several have reiterated their Buy calls on expectations of a recovery in FY26, improved deal execution, and favourable valuations.",
            "pubDate": "2025-04-11T05:56:00.944986"
        },
        {
            "title": "March SIP inflows steady amid tariff tremors, sending HDFC and ABSL AMC shares higher by up to 5%",
            "link": "https://www.moneycontrol.com/news/business/markets/march-sip-inflows-steady-amid-tariff-tremors-sending-hdfc-and-absl-amc-shares-higher-by-up-to-5-12991714.html",
            "description": "Monthly inflows through the Systematic Investment Plan route into mutual funds only saw a marginal decrease from February despite global uncertainties.",
            "pubDate": "2025-04-11T07:36:51.867576"
        },
        {
            "title": "Small, midcap indices jump 2% on US tariff reprieve: Here are the top gainers",
            "link": "https://www.moneycontrol.com/news/business/markets/small-midcap-indices-jump-2-on-us-tariff-reprieve-here-are-the-top-gainers-12991689.html",
            "description": "On April 11, Sensex gained over 1,300 points, while Nifty jumped nearly 2 percent. The sharp recovery in the benchmark indices also spilled over to the broader markets.",
            "pubDate": "2025-04-11T07:36:51.867665"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on April 11",
            "link": "https://www.moneycontrol.com/news/business/markets/top-gainers-and-losers-today-stocks-that-moved-the-most-on-april-11-12992105.html",
            "description": "Markets wrapped up the week nearly 2% higher, buoyed by the US decision to defer tariffs for all countries except China — a move that eased recession fears and improved risk appetite.",
            "pubDate": "2025-04-11T13:34:31.944971"
        },
        {
            "title": "US stock futures rise as markets try to end turbulent week on a high; US-China trade war escalates",
            "link": "https://www.moneycontrol.com/news/business/markets/us-stock-futures-rise-as-markets-try-to-end-turbulent-week-on-a-high-us-china-trade-war-escalates-12992107.html",
            "description": "Trade tensions flare up as imports from China will now face a steep 145 percent duty. Beijing didn’t hold back. On Friday, China retaliated by hiking tariffs on U.S. goods to 125 percent from 84 percent.",
            "pubDate": "2025-04-11T13:34:31.945055"
        },
        {
            "title": "NBCC shares surge 2% after firm's Rs 2,650-crore sales in Greater Noida",
            "link": "https://www.moneycontrol.com/news/business/markets/nbcc-shares-surge-2-after-firm-s-rs-2-650-crore-sales-in-greater-noida-12991951.html",
            "description": "The Navratna company on April 11 announced that it has successfully sold 560 residential units at Aspire Leisure Park in Greater Noida. The units were sold through an e-auction and have a total sale value of over Rs 1,153 crore.",
            "pubDate": "2025-04-11T13:34:31.945126"
        },
        {
            "title": "Taking Stock: Nifty above 22,800, Sensex jumps 1,310 pts on Trump's tariff pause",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-above-22-800-sensex-jumps-1-310-pts-on-trump-s-tariff-pause-12991899.html",
            "description": "Biggest Nifty gainers included Hindalco Industries, Tata Steel, JSW Steel, Coal India, Jio Financial, while losers were TCS, Asian Paints and Apollo Hospitals. All the sectoral indices ended in the green with Metal index rose 4 percent, while Auto, Oil & Gas, Power, PSU, Telecom, Pharma up 2 percent each.",
            "pubDate": "2025-04-11T13:34:31.945194"
        },
        {
            "title": "DIIs go headlong in index futures, build historic high long positions, suggesting market bottom",
            "link": "https://www.moneycontrol.com/news/business/markets/diis-go-headlong-in-index-futures-build-historic-high-long-positions-suggesting-market-bottom-12992039.html",
            "description": "As of April 8, 2025, DIIs held a net long position of 79,153 contracts in index futures, marking an all-time high. This surge surpasses previous highs observed during significant market events",
            "pubDate": "2025-04-11T13:34:31.945261"
        },
        {
            "title": "VIP Clothing shares rally on partnership with Zepto for quick commerce delivery",
            "link": "https://www.moneycontrol.com/news/business/stocks/vip-clothing-shares-rally-on-partnership-with-zepto-for-quick-commerce-delivery-12991881.html",
            "description": "Shares of VIP Clothing gained traction after the company announced a tie-up with Zepto, enabling swift doorstep delivery of its premium innerwear range like Frenchie, Feelings, and VIP.",
            "pubDate": "2025-04-11T13:34:31.945353"
        },
        {
            "title": "Live: Street Cheers Trump's Tariff Pause As Nifty Re-tests 22,900| Metals, Pharma Lead| Closing Bell",
            "link": "https://www.moneycontrol.com/news/business/markets/live-street-cheers-trump-s-tariff-pause-as-nifty-re-tests-22-900-metals-pharma-lead-closing-bell-12992008.html",
            "description": "China slaps 125(%) tariff on us goods effective april 12. trump's tariff u-turn sparks friday rally. nifty tests 22,900 in intra-day trade. sensex sees over 1300 point surge. broader markets recover in tandem with benchmarks. mid & smallcap indices gain 2-3(%) apiece. all sectoral indices in green led by metals & pharma. sip flows steady at (r)25,926 crore. equity mutual fund inflows hit 11-month low. nifty gainers: hindalco, tata steel, coal india, jsw steel. nifty losers: apollo hospitals, asian paints, tcs. nifty 500 gainers: jub pharmova, syrma sgs, pi inds, atul. nifty 500 losers: muthoot finance, icici lombard, jyothy labs, max health. Catch Nandita Khemka and Yatin Mota as they discuss stocks on their radar.",
            "pubDate": "2025-04-11T13:34:31.945423"
        },
        {
            "title": "It's a painful period but not a risk for long-term survival of India: Madhu Kela on market correction",
            "link": "https://www.moneycontrol.com/news/business/markets/it-s-a-painful-period-but-not-a-risk-for-long-term-survival-of-india-madhu-kela-on-market-correction-12991992.html",
            "description": "'Indian markets are superbly resilient as there is a growth story... We have more than 1,500 companies with more than Rs 1,000 crore market cap. In no other emerging market, you can see this kind of variety. I'm very bullish on the India story, says Madhusudan Kela.",
            "pubDate": "2025-04-11T13:34:31.945492"
        },
        {
            "title": "Trump tariff flip-flop: How Indian markets fared in April as compared to global peers",
            "link": "https://www.moneycontrol.com/news/business/markets/trump-tariff-flip-flop-how-indian-markets-fared-in-april-as-compared-to-global-peers-12991942.html",
            "description": "India has emerged as one of the five most resilient major markets globally, falling less than 3.5 percent since US President Donald Trump announced reciprocal tariffs, marking a sign of investor confidence despite trade tensions.",
            "pubDate": "2025-04-11T13:34:31.945690"
        },
        {
            "title": "Aurionpro Solutions shares jump over 15% on acquiring complete stake in Fintra Software",
            "link": "https://www.moneycontrol.com/news/business/markets/aurionpro-solutions-shares-jump-over-15-on-acquiring-complete-stake-in-fintra-software-12991852.html",
            "description": "The company specialises in software platforms for Wholesale Banking, with a focus on Trade Finance, Supply Chain Finance",
            "pubDate": "2025-04-11T13:34:31.945890"
        }
    ]
}