{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-01T17:28:56.337641",
    "items": [
        {
            "title": "Indegene acquires BioPharm to boost AI-powered pharma marketing",
            "link": "https://www.moneycontrol.com/news/business/stocks/indegene-acquires-biopharm-to-boost-ai-powered-pharma-marketing-13593306.html",
            "description": "The deal, executed through Indegene’s US subsidiary ILSL Inc., aims to strengthen the company’s omnichannel and media offerings by integrating BioPharm’s precision marketing expertise with Indegene’s data and analytics platforms.",
            "pubDate": "2025-10-01T15:52:02.084615"
        },
        {
            "title": "Tata Motors demerger creates two distinct bets: EVs and global luxury vs India’s infra backbone",
            "link": "https://www.moneycontrol.com/news/business/stocks/tata-motors-demerger-creates-two-distinct-bets-evs-and-global-luxury-vs-india-s-infra-backbone-13593606.html",
            "description": "By splitting into two listed entities, Tata Motors aims to let one business raise the capital needed for global EV and luxury ambitions -- despite falling EV volumes -- while the other leans on stronger balance sheets to ride India’s freight and infrastructure upswing.",
            "pubDate": "2025-10-01T15:52:02.084708"
        },
        {
            "title": "Taking Stock: Nifty above 24,800, Sensex up 716 pts post-RBI measures",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-above-24-800-sensex-up-716-pts-post-rbi-measures-13592990.html",
            "description": "Nearly 140 stocks touched their 52-week high on the BSE, including L&T Finance, Fortis Healthcare, Muthoot Finance, Jindal Steel, Canara Bank, Tata Investment Corp, RBL Bank, among others.",
            "pubDate": "2025-10-01T15:52:02.084786"
        },
        {
            "title": "Nifty Zooms Past 24,800 As RBI Policy Revives Festive Cheer| Banks Top Gainers| Closing Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-zooms-past-24-800-as-rbi-policy-revives-festive-cheer-banks-top-gainers-closing-bell-live-13593007.html",
            "description": "Catch Nandita Khemka and Yatin Mota in conversation with Kuunal Shah, Associate Fund Manager, Carnelian Capital and Rajesh Bhosale, Senior Technical and Derivative Analyst, Angel One",
            "pubDate": "2025-10-01T15:52:02.084859"
        },
        {
            "title": "Is this the unexpected Navratri gift of RBI to banks?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/is-this-the-unexpected-navratri-gift-of-the-rbi-to-banks-13593002.html",
            "description": "Further easing of the regulatory environment to boost the performance of lenders",
            "pubDate": "2025-10-01T15:52:02.084939"
        },
        {
            "title": "KPIT Tech higher by 3 percent after big fall, management assures on margin guidance",
            "link": "https://www.moneycontrol.com/news/business/markets/kpit-tech-higher-by-3-percent-after-big-fall-management-assures-on-margin-guidance-13592567.html",
            "description": "KPIT said the management has already shared a detailed view of its stance and there is no change in its financial projections. KPIT continues to maintain the previously issued guidance and said it will not comment on any individual deal but assured that there is no risk to client deal renewals.",
            "pubDate": "2025-10-01T15:52:02.085044"
        },
        {
            "title": "Experts pick 10 rate-sensitive stocks after RBI keeps rates unchanged",
            "link": "https://www.moneycontrol.com/news/business/markets/experts-pick-10-rate-sensitive-stocks-after-rbi-mpc-keeps-rates-unchanged-13592553.html",
            "description": "Moneycontrol collated a list of the top 10 rate-sensitive stocks, curated by experts with a 3–4-week perspective on the basis of the closing price of September 30, following the Reserve Bank of India's decision to maintain the status quo on rates.",
            "pubDate": "2025-10-01T15:52:02.085171"
        },
        {
            "title": "UPI to remain free of any charges, says RBI guv Malhotra; Paytm stock jumps",
            "link": "https://www.moneycontrol.com/news/business/stocks/upi-to-remain-free-of-any-charges-says-rbi-guv-malhotra-paytm-stock-jumps-13592629.html",
            "description": "RBI Governor Sanjay Malhotra's statement reinforces the government and RBI’s stance of keeping UPI a zero-cost platform to encourage wider adoption of digital payments across the country.",
            "pubDate": "2025-10-01T15:52:02.085243"
        },
        {
            "title": "Buy ACME Solar Holdings; target of Rs 370: Motilal Oswal",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-acme-solar-holdings-target-of-rs-370-motilal-oswal-13592545.html",
            "description": "Motilal Oswal is bullish on ACME Solar Holdings recommended buy rating on the stock with a target price of Rs 370 in its research report dated September 30, 2025.",
            "pubDate": "2025-10-01T15:52:02.085315"
        },
        {
            "title": "Shriram Finance stock jumps over 5% after report of stake sale to Mitsubishi UFJ; company clarifies on speculation",
            "link": "https://www.moneycontrol.com/news/business/stocks/shriram-finance-stock-gains-over-3-after-report-of-stake-sale-to-mitsubishi-ufj-company-clarifies-on-speculation-13592506.html",
            "description": "Shriram Finance shares jumped over 5%, after a news report said that Japan's Mitsubishi UFJ is looking to acquire 20% equity stake in the Indian NBFCs for as much as Rs 23,200 crore.",
            "pubDate": "2025-10-01T15:52:02.085382"
        },
        {
            "title": "Tata Motors sets October 14 as record date to issue shares for demerged CV company",
            "link": "https://www.moneycontrol.com/news/business/markets/tata-motors-sets-october-14-as-record-date-to-issue-shares-for-demerged-cv-company-13592518.html",
            "description": "TML Commercial Vehicles shares are proposed to be listed on both BSE and NSE.",
            "pubDate": "2025-10-01T15:52:02.085449"
        },
        {
            "title": "Bank Nifty jumps 700 pts, Fin Nifty up 1.2% on RBI's lending, capital rules proposals",
            "link": "https://www.moneycontrol.com/news/business/markets/bank-nifty-jumps-600-pts-fin-nifty-up-1-2-on-rbi-s-lending-capital-rules-proposals-13592315.html",
            "description": "RBI has proposed to expand scope of capital market lending by banks to provide enabling framework to finance acquisitions",
            "pubDate": "2025-10-01T15:52:02.085517"
        },
        {
            "title": "Martin Wolf: A world with two predatory superpowers",
            "link": "https://www.moneycontrol.com/news/opinion/martin-wolf-a-world-with-two-predatory-superpowers-13592277.html",
            "description": "Nations must work out how to contend with Trump’s America and China",
            "pubDate": "2025-10-01T15:52:02.085584"
        },
        {
            "title": "eMudhra Q1 FY26: Opportunity has three faces",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/emudhra-q1-fy26-opportunity-has-three-faces-13591960.html",
            "description": "Stable growth, steady profitability, and recent correction offer promise",
            "pubDate": "2025-10-01T15:52:02.085657"
        },
        {
            "title": "Nifty Eyes Rebound After 8-Day Slide; RBI Policy & Auto Sales in Focus | Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-eyes-rebound-after-8-day-slide-rbi-policy-auto-sales-in-focus-opening-bell-live-13591916.html",
            "description": "The market extended its losing streak to eight sessions on September 30, slipping 0.1% on monthly F&O expiry day. While selling pressure has eased over the past two days, technicals still point to a negative bias. Experts warn that a break below 24,500 could open the door to 24,400–24,300, while resistance remains at 24,700–24,900.\n\nThe big cues today: the RBI’s monetary policy decision, likely to be a close call between a rate cut and a pause, and September auto sales data. Join Nandita Khemka in conversation with Ruchit Jain, VP–Technical Research at Motilal Oswal Financial Services, and Harish Krishnan, Co-CIO & Head Equity at ABSL AMC, for expert insights on the markets, RBI policy, and sector trends.",
            "pubDate": "2025-10-01T15:52:02.085726"
        },
        {
            "title": "SBFC Finance: How justified is the valuation of this stock?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/sbfc-finance-how-justified-is-the-valuation-of-this-stock-2-13591844.html",
            "description": "It is well-positioned to seize the big market opportunity in the SME space",
            "pubDate": "2025-10-01T15:52:02.085796"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-12-13591473.html",
            "description": "The Foreign institutional investors (FIIs) remained net sellers on 7th consecutive session on September 30 as they offloaded equities Rs 2327 crore, while Domestic institutional investors (DIIs) bought equities of Rs 5761 crore on the same day.",
            "pubDate": "2025-10-01T15:52:02.085862"
        },
        {
            "title": "Closing Bell: Sensex rises 716 pts, Nifty above 24,800 post RBI policy; realty, banks shine",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-01-10-2025-liveblog-13591775.html",
            "description": "Except PSU Bank, all other sectors ended in the green with private bank, realty, pharma, IT, media up 1-4 percent. Tata Motors, Shriram Finance, Kotak Mahindra Bank, Trent, Sun Pharma were among biggest gainers on the Nifty, while losers were Bajaj Finance, Tata Steel, SBI, UltraTech Cement and Bajaj Auto. BSE Midcap index rose 0.9 percent and smallcap indices added 1%.",
            "pubDate": "2025-10-01T15:52:02.085930"
        },
        {
            "title": "Stocks to Watch Today: Atlantaa, Lupin, Oil India, RITES, Man Industries, Swan Defence, Newgen Software, RateGain, Jain Resource in focus on 01 October",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-atlantaa-lupin-oil-india-rites-man-industries-swan-defence-newgen-software-rategain-jain-resource-in-focus-on-01-october-13591731.html",
            "description": "Stocks to Watch, 01 October: Stocks like Indian Renewable Energy Development Agency, Atlantaa, Lupin, Oil India, Adani Total Gas, RITES, Man Industries, Swan Defence, SKF India, Adani Enterprises, Newgen Software Technologies, and RateGain Travel Technologies will be in focus on October 01.",
            "pubDate": "2025-10-01T15:52:02.085997"
        },
        {
            "title": "Trade Spotlight: How should you trade SAIL, Bank of Baroda, Jindal Steel, Hindustan Zinc, Hero MotoCorp, and others on October 01?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-sail-bank-of-baroda-jindal-steel-hindustan-zinc-hero-motocorp-and-others-on-october-01-13591706.html",
            "description": "The consolidation may continue until the market moves back above the short-term moving averages. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-10-01T15:52:02.086082"
        },
        {
            "title": "BofA Securities Europe acquires Eternal shares worth Rs 267 crore from Goldman Sachs",
            "link": "https://www.moneycontrol.com/news/business/markets/bofa-securities-europe-acquires-eternal-shares-worth-rs-267-crore-from-goldman-sachs-13593779.html",
            "description": "Eternal shares gained 2.5 percent to close at Rs 329 on the National Stock Exchange. The stock has been in uptrend despite intermittent correction, especially after surpassing previous record high of Rs 305 in July.",
            "pubDate": "2025-10-01T17:28:55.367899"
        }
    ]
}