{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-03T04:33:28.590705",
    "items": [
        {
            "title": "Can V2 Retail sustain its growth in value fashion?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/can-v2-retail-sustain-its-growth-in-value-fashion-13514932.html",
            "description": "Aggressive store additions, expanding margins, and improving return ratios underpin growth visibility",
            "pubDate": "2025-09-03T04:33:20.951059"
        },
        {
            "title": "Will Bulls Regain Confidence as GST Council Meet Kicks Off?| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/will-bulls-regain-confidence-as-gst-council-meet-kicks-off-opening-bell-live-13514780.html",
            "description": "The Nifty 50 failed to hold on to follow-up buying on September 2, slipping 176 points from the day’s high to close 0.2 percent lower. The index was unable to sustain above the midline of the Bollinger Bands, tempering sentiment after Monday’s rebound. Analysts expect rangebound trade to persist until the benchmark climbs back above all key moving averages. On the downside, 24,400 is seen as immediate support, with 24,300–24,250 forming a crucial base. On the upside, resistance is pegged at 24,700–24,800, with 25,000 remaining a major hurdle. Meanwhile, the two-day GST Council meeting begins today, where the Centre’s proposal for a two-rate structure will be discussed. FMCG, Autos will continue to be in focus.\n\nStocks in news include TCS, Waaree Energies, and Eternal. Tune in as Nandita Khemka speaks with Vishnu Kant Upadhyay, Assistant Vice President – Research & Advisory at Master Capital Services, and Puneet Sharma, CEO and Fund Manager at Whitespace Alpha.",
            "pubDate": "2025-09-03T04:33:20.951151"
        },
        {
            "title": "Indus Towers sinks 4% on foray into African markets, brokerages remain bullish",
            "link": "https://www.moneycontrol.com/news/business/markets/indus-towers-shares-in-focus-on-foray-into-african-markets-brokerages-remain-bullish-13514718.html",
            "description": "Citi and CLSA remained bullish on Indus Towers, citing strong cash flow prospects, attractive valuations, and dividend potential.",
            "pubDate": "2025-09-03T04:33:20.951246"
        },
        {
            "title": "Asian stocks poised to track Wall Street declines",
            "link": "https://www.moneycontrol.com/news/business/asian-stocks-poised-to-track-wall-street-declines-13514178.html",
            "description": "Equity-index futures pointed to a weaker open in Japan and Australia and a tepid open for Hong Kong. Earlier, the S&P 500 pared losses to close 0.7% lower.",
            "pubDate": "2025-09-03T04:33:20.951323"
        },
        {
            "title": "BSE SME IPO Index loses steam in 2025 after four-year surge",
            "link": "https://www.moneycontrol.com/news/business/ipo/bse-sme-ipo-index-loses-steam-in-2025-after-four-year-surge-13513855.html",
            "description": "After a four-year dream run, the BSE SME IPO Index faces a reality check in 2025 as volatility, weak fundamentals, and muted listings test investor appetite",
            "pubDate": "2025-09-03T04:33:20.951391"
        },
        {
            "title": "Trade Spotlight: How should you trade Godrej Consumer Products, Sobha, Jindal Steel, Britannia Industries, Manappuram Finance, and others on September 03?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-godrej-consumer-products-sobha-jindal-steel-britannia-industries-manappuram-finance-and-others-on-september-03-13514163.html",
            "description": "The consolidation is expected to continue as long as the frontline indices trade below short-term moving averages. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-09-03T04:33:20.951459"
        },
        {
            "title": "Stocks to Watch Today: TCS, JSW Cement, Waaree Energies, PNC Infra, Adani Power, Yes Bank, E2E Networks, Vikran Engineering, TBO Tek in focus on 03 September",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-jsw-cement-waaree-energies-pnc-infra-adani-power-yes-bank-e2e-networks-vikran-engineering-tbo-tek-in-focus-on-03-september-13514149.html",
            "description": "Stocks to Watch, 03 September: Tata Consultancy Services, JSW Cement, Waaree Energies, PNC Infra, Adani Power, Yes Bank, E2E Networks, Vikran Engineering, TBO Tek, and Anlon Healthcare will be in focus on September 03.",
            "pubDate": "2025-09-03T04:33:20.951522"
        },
        {
            "title": "KKR, Ontario sell 16.67% stake in Vertis Infrastructure Trust for Rs 2,468 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/kkr-ontario-sell-16-67-stake-in-vertis-infrastructure-trust-for-rs-2-468-crore-13513982.html",
            "description": "Galaxy Investments II held 27.85 percent stake and Ontario had 25 percent shareholding in Vertis Infrastructure Trust as per the recent unitholding pattern.",
            "pubDate": "2025-09-03T04:33:20.951591"
        }
    ]
}