{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-03T04:44:56.214296",
    "items": [
        {
            "title": "Buy Supriya Lifescience; target of Rs 843: Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-supriya-lifescience-target-of-rs-843-deven-choksey-13089231.html",
            "description": "Deven Choksey is bullish on Supriya Lifescience has recommended buy rating on the stock with a target price of Rs 843 in its research report dated May 02, 2025.",
            "pubDate": "2025-06-03T04:44:43.218852"
        },
        {
            "title": "Eternal shares rise 2% as Morgan Stanley reaffirms top pick, sees 32% upside on strong growth potential",
            "link": "https://www.moneycontrol.com/news/business/markets/eternal-shares-rise-2-as-morgan-stanley-reaffirms-top-pick-sees-32-upside-on-strong-growth-potential-13088920.html",
            "description": "Eternal share price: The financials are forecast to improve sharply, with adjusted EBITDA expected to climb to Rs 6,548 crore in FY28.",
            "pubDate": "2025-06-03T04:44:43.218943"
        },
        {
            "title": "Swiggy shares rise 3% as Morgan Stanley initiates coverage with 'overweight' rating; sees 22% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/swiggy-shares-rise-3-as-morgan-stanley-initiates-coverage-with-overweight-rating-sees-22-upside-13088812.html",
            "description": "Swiggy share price: Any lapse in Swiggy’s execution could erode its market share across both food delivery and quick commerce segments, Morgan Stanley said in a note.",
            "pubDate": "2025-06-03T04:44:43.219018"
        },
        {
            "title": "Sensex down 400 pts, Nifty below 24,650 as bank, IT stocks fall; mid, smallcaps shine",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-down-400-pts-nifty-below-24-650-as-bank-it-stocks-fall-mid-smallcaps-shine-13088678.html",
            "description": "India VIX, the barometer to assess market anxiety, jumped 1.5 percent to 17.42, reflecting increased market volatility.",
            "pubDate": "2025-06-03T04:44:43.219093"
        },
        {
            "title": "Mrs Bectors Food Specialities: Will it resume industry leading earnings growth?",
            "link": "https://www.moneycontrol.com/news/business/stocks/mrs-bectors-food-specialities-will-it-resume-industry-leading-earnings-growth-13089023.html",
            "description": "MBFSL is accelerating new product launches (with a focus on premiumisation) which would remain the key growth driver",
            "pubDate": "2025-06-03T04:44:43.219164"
        },
        {
            "title": "IRCTC – Should you board a slow train?",
            "link": "https://www.moneycontrol.com/news/business/earnings/irctc-should-you-board-a-slow-train-13088797.html",
            "description": "Though uninspiring, the earnings trajectory is likely to be more predictable than many domestic companies",
            "pubDate": "2025-06-03T04:44:43.219234"
        },
        {
            "title": "Nifty Consolidates But Dip-Buying Keeps Sentiment Intact; Biocon, Aptus In Focus| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-consolidates-but-dip-buying-keeps-sentiment-intact-biocon-aptus-in-focus-opening-bell-live-13088684.html",
            "description": "The Nifty 50 showed a smart recovery of nearly 200 points from the day's low and closed with a moderate loss of 34 points on June 2, while defending the 24,700 levels on a closing basis, which is a positive sign. The index remains within the range of 24,500–25,000. According to experts, it is expected to remain choppy in the upcoming sessions. If the index decisively breaks below the lower range, the 24,380 level is one to watch. However, in case of a rebound, 24,900 is expected to act as a hurdle for the index. Global cues are positive this morning despite renewed trade tensions between US and China. The GIFT Nifty is hinting at a strong start for the Indian market. Aptus Value, Grasim, Adani Group stocks will be in focus today. Catch Nandita Khemka in conversation with Nirav Chheda - Assistant Vice President, Equity Derivatives & Technical Research- Retail, Nirmal Bang and Sandeep Bagla, CEO, TRUST Mutual Fund.",
            "pubDate": "2025-06-03T04:44:43.219306"
        },
        {
            "title": "Chart of the Day: The transformation at dairy companies",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-the-transformation-at-dairy-companies-13088654.html",
            "description": "Revenues from value-added products are rising faster than liquid milk sales",
            "pubDate": "2025-06-03T04:44:43.219375"
        },
        {
            "title": "Sensex, Nifty eye strong open after two-day slide; Key levels to track on June 3",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-eye-strong-open-after-two-day-slide-key-levels-to-track-on-june-3-13088513.html",
            "description": "Indian equities ended slightly lower in the previous session, giving up earlier gains as selling pressure returned in the final hour of trade.",
            "pubDate": "2025-06-03T04:44:43.219441"
        },
        {
            "title": "Stocks to Watch Today: HCL Technologies, Zinka Logistics, Biocon, Torrent Power, Jindal Stainless, Frontier Springs, Prostarm Info Systems in focus on 3 June",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hcl-technologies-zinka-logistics-biocon-torrent-power-jindal-stainless-frontier-springs-prostarm-info-systems-in-focus-on-3-june-13088464.html",
            "description": "Stocks to Watch Today, 3 Jun: Stocks like Zinka Logistics Solutions, HCL Technologies, Biocon, Torrent Power, Jindal Stainless, Frontier Springs, Apeejay Surrendra Park Hotels, Transrail Lighting, Kerala Ayurveda, Emcure Pharmaceuticals, UCO Bank, AU Small Finance Bank, and Prostarm Info Systems will be in focus on June 3.",
            "pubDate": "2025-06-03T04:44:43.219509"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex dips 230 pts, Nifty at 24,650; FMCG, IT, banks under pressure",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-03-06-2025-liveblog-13088454.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Shriram Finance, Hindalco, Eternal, HCL Tech, Titan Company were among major gainers on the Nifty, while losers were Adani Enterpris es, Adani Ports, L&T, HDFC Life, ICICI Bank. BSE Midcap index up 0.2 percent and smalllcap index up 0.5 percent. Among sectors, metal index up 0.5 percent, while private bank index down 0.5 percent.",
            "pubDate": "2025-06-03T04:44:43.219575"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-105-13085751.html",
            "description": "The Foreign institutional investors (FIIs) extended their selling on second consecutive session on June 2 as they sold equities worth Rs 2,589 crore, while Domestic institutional investors (DIIs) extended their buying on tenth day as they bought equities of Rs 5,313 crore on the same day.",
            "pubDate": "2025-06-03T04:44:43.219642"
        },
        {
            "title": "Trade Spotlight: How should you trade PNB, Swiggy, Bank of India, Adani Ports, CDSL, Canara Bank, NBCC, Bharti Airtel and others on June 3?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-pnb-swiggy-bank-of-india-adani-ports-cdsl-canara-bank-nbcc-bharti-airtel-and-others-on-june-3-13088313.html",
            "description": "The market may turn positive amid rangebound trading. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-06-03T04:44:43.219711"
        }
    ]
}