{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2026-01-14T03:56:29.190742",
    "items": [
        {
            "title": "Smallcaps, midcaps, IPOs stumbled in 2025, yet retail investors keep the faith",
            "link": "https://www.moneycontrol.com/news/opinion/smallcaps-midcaps-ipos-stumbled-in-2025-yet-retail-investors-keep-the-faith-13771676.html",
            "description": "Even as midcaps, smallcaps, and IPOs lost their way through 2025, Indian retail investors poured record amounts into these segments—a paradox revealing extraordinary conviction amid widespread losses",
            "pubDate": "2026-01-14T03:54:06.230976"
        },
        {
            "title": "Markets On Edge Amid Back-to-Back Expiry Sessions | Infosys Q3 Earnings Today | Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/markets-on-edge-amid-back-to-back-expiry-sessions-infosys-q3-earnings-today-opening-bell-live-13771861.html",
            "description": "The Nifty 50 slipped 0.2% on January 13, giving up a part of the previous session’s gains. While the index negated the lower high–lower low pattern seen over the past five sessions, it continues to trade below its short- and medium-term moving averages, with momentum indicators still signalling caution. Experts believe the market is likely to remain in a consolidation phase unless the Nifty decisively breaks above the 25,900–26,000 resistance zone. A sustained move above this level could open the door for a rally toward 26,200–26,300, while on the downside, immediate support is seen at 25,600, followed by a key level at 25,450. Globally, Wall Street retreated from record highs, with the S&P 500 drifting lower, weighed down by banking stocks. Asian markets opened mixed, though Japan’s Nikkei scaled a fresh record, crossing the 54,000 mark for the first time. Back home, GIFT Nifty signals a sluggish start for Dalal Street. In commodities, crude oil surged to a 12-week high amid escalating geopolitical risks and supply disruption concerns. Gold and silver touched fresh record highs, as U.S. inflation data strengthened expectations of future Federal Reserve rate cuts. On the earnings front, IT major Infosys is set to report its Q3 results today. All eyes will be on guidance. Also watch out for Groww as it reports earnings today. Catch Nandita Khemka in conversation with Ruchit Jain, Vice President – Technical Research at Motilal Oswal Financial Services, and Ajay Srivastava, CEO, Dimensions Corporate Finance Services, as they decode the key market cues on Opening Bell Live.",
            "pubDate": "2026-01-14T03:54:06.231053"
        },
        {
            "title": "Just Dial shares in focus on mixed Q3 earnings",
            "link": "https://www.moneycontrol.com/news/business/stocks/just-dial-shares-in-focus-mixed-q3-earnings-13771553.html",
            "description": "Just Dial Share Price | The company has posted 10% fall in its Q3 profit at Rs 117.9 crore, while revenue jumped 6.4% to Rs 305.6 crore.",
            "pubDate": "2026-01-14T03:54:06.231124"
        },
        {
            "title": "NLC India share price gains 2% on renewable energy projects win",
            "link": "https://www.moneycontrol.com/news/business/stocks/nlc-india-to-develop-energy-renewable-projects-in-gujarat-share-price-in-focus-13771541.html",
            "description": "NLC India Share Price | The company is going to develop solar, wind, hybrid and battery energy storage projects in Gujarat.",
            "pubDate": "2026-01-14T03:54:06.231187"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-79-13770449.html",
            "description": "On January 13, the Foreign Institutional Investors (FIIs) sold equities worth around Rs 1499 crore, while Domestic Institutional Investors (DIIs) purchased equities worth Rs 1181 crore.",
            "pubDate": "2026-01-14T03:54:06.231250"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty around 25,650, Sensex down 250 pts; NLC India, Infosys, ICICI Lombard, Just Dial in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-gift-nifty-indicates-a-flat-start-us-asian-markets-rise-liveblog-13771718.html",
            "description": "Sensex Today | Stock Market LIVE Updates: ONGC, Coal India, Infosys, Hindalco, NTPC are among major gainers on the Nifty, while losers are Kotak Mahindra Bank, Dr Reddy's Labs, Asian Paints, Max Healthcare, Tech Mahindra.",
            "pubDate": "2026-01-14T03:54:06.231315"
        },
        {
            "title": "Asian shares post small gain, Yen weakens past 159",
            "link": "https://www.moneycontrol.com/news/business/asian-shares-post-small-gain-yen-weakens-past-159-13771713.html",
            "description": "The Nikkei 225 Stock Average advanced 0.9%, with the Japanese currency slipping past the 159-per-dollar level to the weakest since July 2024. Shares in South Korea edged up, having posted a gain on every trading day of 2026.",
            "pubDate": "2026-01-14T03:54:06.231374"
        },
        {
            "title": "Trade Spotlight: How should you trade TVS Motor, Union Bank of India, Dredging Corporation, Tech Mahindra, ICICI Bank, and others on January 14?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-tvs-motor-union-bank-of-india-dredging-corporation-tech-mahindra-icici-bank-and-others-on-january-14-13771690.html",
            "description": "The market may see consolidation as long as it trades below the midline of the Bollinger Bands. Below are some short-term trading ideas to consider.",
            "pubDate": "2026-01-14T03:54:06.231436"
        },
        {
            "title": "Stocks to Watch Today: Kotak Mahindra Bank, ICICI Lombard, Tata Elxsi, Interarch Building, NLC India, 5paisa Capital in focus on 14 January",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-kotak-mahindra-bank-icici-lombard-tata-elxsi-interarch-building-nlc-india-5paisa-capital-in-focus-on-14-january-13771669.html",
            "description": "Stocks to Watch, 14 January: Stocks like ICICI Lombard General Insurance Company, Tata Elxsi, Just Dial, Interarch Building Solutions, NLC India, Responsive Industries, Gabion Technologies India, Victory Electric Vehicles International and Kotak Mahindra Bank will be in focus on January 14.",
            "pubDate": "2026-01-14T03:54:06.231496"
        },
        {
            "title": "Royal Alpha Growth, Vorton Capital among 4 investors acquire over 6% stake in Gabion Technologies on its market debut",
            "link": "https://www.moneycontrol.com/news/business/markets/royal-alpha-growth-vorton-capital-among-4-investors-acquire-over-6-stake-in-gabion-technologies-on-its-market-debut-13771504.html",
            "description": "Gabion Technologies shares rallied 5 percent on its first trading day, closing at Rs 93.41 on the BSE after hitting an intraday high of Rs 93.45 and low of Rs 84.55.",
            "pubDate": "2026-01-14T03:54:06.231556"
        },
        {
            "title": "Zydus Lifesciences' unit Sentynl wins USFDA nod for rare pediatric disease therapy",
            "link": "https://www.moneycontrol.com/news/business/stocks/zydus-lifesciences-unit-sentynl-wins-usfda-nod-for-rare-pediatric-menkes-disease-therapy-13771070.html",
            "description": "Clinical trials showed early treatment reduced the risk of death by nearly 80 percent compared to untreated controls, with median overall survival reaching 177 months versus 17.6 months for untreated patients.",
            "pubDate": "2026-01-14T03:54:06.231621"
        },
        {
            "title": "'President Trump doesn’t impact my investing cycle': Raamdeo Agrawal explains why",
            "link": "https://www.moneycontrol.com/news/business/markets/president-trump-doesn-t-impact-my-investing-cycle-raamdeo-agrawal-explains-why-13771306.html",
            "description": "One side Trump is happening, and on the other side, AI is happening. I don’t know how to figure out which one will impact how much. So, I am very happy that I am in India, says Agrawal",
            "pubDate": "2026-01-14T03:54:06.231682"
        },
        {
            "title": "Budget 2026: Will markets see a pre-Budget rally? Don't expect broad-based buying, say analysts",
            "link": "https://www.moneycontrol.com/news/business/markets/budget-2026-will-markets-see-pre-budget-rally-don-t-expect-broad-based-buying-say-analysts-13771172.html",
            "description": "Historical trends indicate that the Indian market typically underperforms in January preceding a budget, with the Nifty falling in four of the last five years due to profit-booking and policy uncertainty, an analyst said.",
            "pubDate": "2026-01-14T03:54:06.231757"
        },
        {
            "title": "Taking Stock: Nifty below 25,750, Sensex down 250 pts; pharma, realty down, PSU Banks gain",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-below-25-750-sensex-down-250-pts-pharma-realty-down-psu-banks-gain-13770713.html",
            "description": "Mixed performance was seen among the broader indices, with the BSE Midcap index declining 0.2 percent, while the Smallcap index rose 0.5 percent.",
            "pubDate": "2026-01-14T03:54:06.231819"
        },
        {
            "title": "Cipla shares fall up to 2% as Citi says US FDA nod for generic Advair could help Aurobindo Pharma",
            "link": "https://www.moneycontrol.com/news/business/markets/cipla-shares-fall-up-to-2-as-citi-says-us-fda-nod-for-generic-advair-could-help-aurobindo-pharma-13771001.html",
            "description": "Cipla share price: Cipla has been awaiting FDA's approval for its own generic version of Advair.",
            "pubDate": "2026-01-14T03:54:06.231878"
        },
        {
            "title": "Footwear firm RedTape shares settle 10% higher as report says founders eye stake sale, tap Blackstone, KKR",
            "link": "https://www.moneycontrol.com/news/business/markets/footwear-firm-redtape-shares-rise-5-as-report-says-founders-eye-stake-sale-tap-blackstone-kkr-13770897.html",
            "description": "RedTape is seeking proposals from private equity firms Blackstone and KKR, as its founding family looks to sell a majority stake.",
            "pubDate": "2026-01-14T03:54:06.231937"
        },
        {
            "title": "Nifty Reclaims 25,700 Amid Expiry Day Volatility| Banks Back In Green| Closing Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/nifty-reclaims-25-700-amid-expiry-day-volatility-banks-back-in-green-closing-bell-live-13770796.html",
            "description": "Catch Nandita Khemka in conversation with Sandip Agarwal, Fund Manager, Sowilo Investment Managers and Osho Krishan, Sr. Analyst, Technical & Derivative Research, Angel One Ltd",
            "pubDate": "2026-01-14T03:54:06.231996"
        },
        {
            "title": "L&T clarifies as stock falls 4% on report of Kuwait cancelling $8.7-bn tenders, says 'not part of company's order book'",
            "link": "https://www.moneycontrol.com/news/business/markets/l-t-clarifies-as-stock-falls-4-on-report-of-kuwait-cancelling-8-7-bn-orders-says-not-part-of-company-s-order-book-13770841.html",
            "description": "L&T share price: The company clarified that the projects referred to in the media reports were not part of the company’s order book, and it cannot comment on the status of tenders or commercial decisions of its clients.",
            "pubDate": "2026-01-14T03:54:06.232062"
        },
        {
            "title": "Blinkit drops 10-minute delivery deadline; here's how Swiggy, Eternal shares reacted",
            "link": "https://www.moneycontrol.com/news/business/markets/swiggy-eternal-shares-off-day-s-highs-as-reports-say-blinkit-removes-10-minute-delivery-deadline-13770749.html",
            "description": "Shares of Swiggy, Eternal trimmed intraday gains on reports that Union Labour Minister urged quick commerce firms to discontinue 10-minute delivery services.",
            "pubDate": "2026-01-14T03:54:06.232125"
        },
        {
            "title": "Ixigo shares jump 9% on JM Financial's double upgrade, says correction is 'overdone'",
            "link": "https://www.moneycontrol.com/news/business/markets/ixigo-shares-jump-9-on-jm-financial-s-double-upgrade-says-correction-is-overdone-13770625.html",
            "description": "Ixigo share price: Ixigo shares have fallen more than 3% in the past five days, and over 8% in the past one month. This came after the stock jumped around 61% in the past one year.",
            "pubDate": "2026-01-14T03:54:06.232182"
        },
        {
            "title": "HDFC Bank shares rise today after CLSA reiterates ‘outperform’ call, erases gains later; check upside",
            "link": "https://www.moneycontrol.com/news/business/stocks/hdfc-bank-shares-rise-today-after-clsa-reiterates-outperform-call-erases-gains-later-check-upside-13770602.html",
            "description": "Shares of HDFC Bank traded flat by afternoon on Tuesday after paring early gains, even as CLSA reiterated its ‘Outperform’ call with a Rs 1,200 target, dismissing concerns around deposit growth and the elevated loan-to-deposit ratio as largely temporary.",
            "pubDate": "2026-01-14T03:54:06.232239"
        },
        {
            "title": "Subscribe for Amagi Media Labs Ltd IPO; Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-amagi-media-labs-ltd-ipo-deven-choksey-13770461.html",
            "description": "Deven Choksey, has come out with its report on Amagi Media Labs Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on January 13, 2026.",
            "pubDate": "2026-01-14T03:54:06.232297"
        },
        {
            "title": "Will Trump's 25% tariff on countries doing business with Iran be a negative for Indian markets? Here's what analysts say",
            "link": "https://www.moneycontrol.com/news/business/markets/will-trump-s-25-tariff-on-countries-doing-business-with-iran-be-a-negative-for-indian-markets-here-s-what-analysts-say-13770512.html",
            "description": "The renewed 25% tariff threat has resurfaced as a key macro overhang for Indian markets, but its actual economic impact needs to be viewed with perspective rather than panic, an analyst said.",
            "pubDate": "2026-01-14T03:54:06.232357"
        },
        {
            "title": "Jefferies says new labour codes may add to margin pressures for IT companies, sees lower wage hikes at senior level",
            "link": "https://www.moneycontrol.com/news/business/markets/jefferies-says-new-labour-codes-may-add-to-margin-pressures-for-it-companies-sees-lower-wage-hikes-at-senior-level-13770233.html",
            "description": "The new labour codes mandate that employee wages must be at least 50% of CTC, with benefits such as PF and gratuity to be calculated on wages.",
            "pubDate": "2026-01-14T03:54:06.232417"
        },
        {
            "title": "Auto stocks decline for fifth straight session: Analysts say overall outlook is positive, cite multiple tailwinds",
            "link": "https://www.moneycontrol.com/news/business/markets/auto-stocks-decline-for-fifth-straight-session-analysts-say-overall-outlook-is-positive-cite-multiple-tailwinds-13770407.html",
            "description": "Auto stocks: The recent fall in the auto stocks reflects near-term profit booking and demand concerns, rather than a structural breakdown of the sector, an analyst said.",
            "pubDate": "2026-01-14T03:54:06.232478"
        }
    ]
}