{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-19T03:55:43.876355",
    "items": [
        {
            "title": "ITI share price in focus on contract win worth Rs 95 crore in Uttarakhand",
            "link": "https://www.moneycontrol.com/news/business/stocks/iti-share-price-in-focus-on-contract-win-worth-rs-95-crore-in-uttarakhand-12869687.html",
            "description": "ITI Share Price | The Uttarakhand Government envisaged this project for effective prevention of illegal mining and mineral transportation and to increase its revenue in the state.",
            "pubDate": "2024-11-19T02:33:10.044091"
        },
        {
            "title": "PG Electroplast shares in focus as arm signs agreement with Spiro Mobility to manufacture EVs in India",
            "link": "https://www.moneycontrol.com/news/business/stocks/pg-electroplast-shares-in-focus-as-arm-signs-agreement-with-spiro-mobility-to-manufacture-evs-in-india-12869686.html",
            "description": "PG Electroplast Share Price | Spiro shall be responsible for research and development, marketing, sale, and distribution of the EV products manufactured by PG Technoplast",
            "pubDate": "2024-11-19T02:33:10.044180"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a flat start; US markets mixed, Asia gains",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-19-11-2024-liveblog-12870021.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The Nasdaq and S&P 500 closed higher on Monday, recovering some losses as investors anticipate quarterly earnings from AI leader Nvidia and Tesla jumped on the prospect of favorable policy changes from the incoming Trump administration.",
            "pubDate": "2024-11-19T02:33:10.044255"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-80-12869657.html",
            "description": "The GIFT Nifty is indicating a flat to positive start for the day.",
            "pubDate": "2024-11-19T02:33:10.044332"
        },
        {
            "title": "Stock Radar: Medplus Health, PG Electroplast, Shilpa Medicare, Themis Medicare, Waaree Energies in focus on Tuesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-medplus-health-pg-electroplast-shilpa-medicare-themis-medicare-waaree-energies-in-focus-on-tuesday-12870014.html",
            "description": "Stocks like Godavari Biorefineries, Gujarat Themis Biosyn, AstraZeneca Pharma, GVK Power and Infrastructure, GMR Airports Infrastructure, and Tilaknagar Industries will also be in focus on November 19.",
            "pubDate": "2024-11-19T02:33:10.044402"
        },
        {
            "title": "Trade Spotlight: How should you trade SBI, Cholamandalam Investment, Avalon, SRM Contractors, Axis Bank, and others on Tuesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-sbi-cholamandalam-investment-avalon-srm-contractors-axis-bank-and-others-on-tuesday-12870004.html",
            "description": "The bearish sentiment may persist, but there could be a potential rebound as the indices are in the oversold zone. Below are some trading ideas for the near term.",
            "pubDate": "2024-11-19T02:33:10.044472"
        },
        {
            "title": "Agri Picks Report November 19, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-november-19-2024-geojit-financial-services-12870072.html",
            "description": "According to Geojit, The government is considering lifting the suspension on futures trading of oil, oilseeds, and pulses, according to two senior government officials.",
            "pubDate": "2024-11-19T03:41:51.247177"
        },
        {
            "title": "Brokerage Radar: HSBC trims Glenmark Pharma's target, Morgan Stanley upgrades Suzlon Energy",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-hsbc-trims-glenmark-pharmas-target-morgan-stanley-upgrades-suzlon-energy-12870061.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Glenmark Pharma, financial stocks, and more.",
            "pubDate": "2024-11-19T03:41:51.247261"
        },
        {
            "title": "Live: Can Nifty rebound after slipping below 200-DMA? | Britannia, GMR Airports in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-rebound-after-slipping-below-200-dma-britannia-gmr-airports-in-focus-opening-bell-12870064.html",
            "description": "Indian benchmark indices Nifty and Sensex ended another session lower yesterday, with Nifty clocking its longest losing streak since February 2023. IT stocks were the top underperformers, while metal stocks bucked the trend. Experts now eye Nifty's resistance at 23,600, with support placed around 23,200. This morning global cues are mixed. Wall Street closed mixed overnight with Tesla shares gaining on reports that President-elect Donald Trump easing regulations on self-driving vehicles. Asia-Pacific markets, meanwhile, opened this morning largely higher. Among stocks in focus, watch out for Britannia, Waaree Energies, and GMR Airports. Catch Lovisha Darad in conversation with Nilesh Jain, Head AVP- Derivative and Technical Research, Centrum Broking and Sandeep Bagla, CEO, TRUST Mutual Fund.",
            "pubDate": "2024-11-19T03:41:51.247332"
        },
        {
            "title": "V-Guard Q2 FY25: Growth on track despite Sunflame's below-par show",
            "link": "https://www.moneycontrol.com/news/business/earnings/v-guard-q2-fy25-growth-on-track-despite-sunflames-below-par-show-12870066.html",
            "description": "The company is strategically making investments to enhance its manufacturing capabilities through backward integration across product categories, ensuring greater efficiency and cost optimisation",
            "pubDate": "2024-11-19T03:55:43.368783"
        }
    ]
}