{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-28T15:41:14.089351",
    "items": [
        {
            "title": "Singapore Airlines quarterly profit falls 59% on Air India losses, other factors",
            "link": "https://www.moneycontrol.com/news/business/companies/singapore-airlines-quarterly-profit-falls-59-on-air-india-losses-other-factors-13339336.html",
            "description": "Singapore Airlines, which holds a 25.1 per cent stake in loss-making Air India, saw its total revenue rise 1.5 per cent to SGD 4.79 billion, whereas net profit dropped 58.8 per cent to SGD 186 million in the June quarter compared to the year-ago period",
            "pubDate": "2025-07-28T15:41:01.629920"
        },
        {
            "title": "EU-sanctioned refiner Nayara takes Microsoft to court over outage",
            "link": "https://www.moneycontrol.com/news/business/markets/eu-sanctioned-refiner-nayara-takes-microsoft-to-court-over-outage-13338224.html",
            "description": "Nayara, a major buyer of Russian oil, was recently sanctioned by the European Union as the refinery is majority-owned by Russian entities, including oil major Rosneft",
            "pubDate": "2025-07-28T15:41:01.630008"
        },
        {
            "title": "Sona BLW defends board's independence, says company not family-run, Rani Kapur has had no role",
            "link": "https://www.moneycontrol.com/news/business/markets/sona-blw-defends-board-s-independence-says-company-not-family-run-rani-kapur-has-had-no-role-13338172.html",
            "description": "The company has clarified that Rani Kapur has had no role in the Sona Comstar 'since at least 2019', and denied that later Sunjay Kapur's mother was coerced into signing any documents. The company added that recent appointments on the board were 'ratified by an overwhelming majority' of shareholders.",
            "pubDate": "2025-07-28T15:41:01.630085"
        },
        {
            "title": "India crossed coal production target of 1 billion tonnes in a year for the first time ever",
            "link": "https://www.moneycontrol.com/news/business/economy/india-crossed-coal-production-target-of-1-billion-tonnes-in-a-year-for-the-first-time-ever-13337748.html",
            "description": "India's domestic coal production target will be raised to 1.13 BT by FY30. For Coal India, a target of 1 BT production by FY27 has also been outlined, Coal and Mines Minister G Kishan Reddy said.",
            "pubDate": "2025-07-28T15:41:01.630160"
        },
        {
            "title": "ACME Solar shares up 8 percent to top NSE 500 index on multi-fold profit surge, capacity addition",
            "link": "https://www.moneycontrol.com/news/business/markets/acme-solar-shares-up-8-percent-to-top-nse-500-index-on-multi-fold-profit-surge-capacity-addition-13336379.html",
            "description": "The company also disclosed that it has signed PPAs for around 55% of its under-construction capacity, and commissioned projects worth 350 MW capacity during Q1FY26. Out of this 350MW, the solar capacity at Sikar, Rajasthan, worth 300 MW, has been contracted by SECI.",
            "pubDate": "2025-07-28T15:41:01.630231"
        },
        {
            "title": "TCS cost rationalization strategy addresses challenges but growth recovery remains uncertain",
            "link": "https://www.moneycontrol.com/news/opinion/tcs-cost-rationalization-strategy-addresses-challenges-but-growth-recovery-remains-uncertain-13336148.html",
            "description": "Constant currency revenues at TCS are estimated to decline or grow only marginally in FY26",
            "pubDate": "2025-07-28T15:41:01.630308"
        },
        {
            "title": "Aadhar Housing hits record high after strong results, open offer by promoter Blackstone in internal transfer",
            "link": "https://www.moneycontrol.com/news/business/markets/aadhar-housing-hits-record-high-after-strong-results-open-offer-by-promoter-blackstone-in-internal-transfer-13336073.html",
            "description": "The open offer price reflects a premium to the Rs 425 per share internal transfer price, and offers liquidity to public holders. The transaction will be considered complete after the approval from RBI, National Housing Bank and CCI.",
            "pubDate": "2025-07-28T15:41:01.630376"
        },
        {
            "title": "Sky Gold & Diamonds: Correction adds shine to the valuation of the stock",
            "link": "https://www.moneycontrol.com/news/business/stocks/sky-gold-diamonds-correction-adds-shine-to-the-valuation-of-the-stock-13335611.html",
            "description": "SGDL is continuing new client addition and has on-boarded Reliance Retail, Hyderabad based PMJ Jewellers, and Kalamandir in the quarter gone by.",
            "pubDate": "2025-07-28T15:41:01.630447"
        },
        {
            "title": "Kotak Mahindra Bank Q1 FY26: a blip not a blow",
            "link": "https://www.moneycontrol.com/news/business/banks/kotak-mahindra-bank-q1-fy26-a-blip-not-a-blow-13335198.html",
            "description": "The bank had an unpleasant start to FY26",
            "pubDate": "2025-07-28T15:41:01.630516"
        },
        {
            "title": "Shriram Finance: Can it gain from its rural focus?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/shriram-finance-can-it-gain-from-its-rural-focus-2-13335266.html",
            "description": "The company’s strategic moves and rural focus augur well for growth and profitability.",
            "pubDate": "2025-07-28T15:41:01.630581"
        },
        {
            "title": "Samsung’s Rs 1,000 cr fresh investment shows confidence in Tamil Nadu despite strike incident: Minister Rajaa",
            "link": "https://www.moneycontrol.com/news/business/companies/samsung-s-rs-1-000-cr-fresh-investment-shows-confidence-in-tamil-nadu-despite-strike-incident-minister-rajaa-13335146.html",
            "description": "In an exclusive interview with Moneycontrol, Rajaa downplayed the strike incident earlier this year, calling it a one-off situation that was resolved through dialogue among the government, industry, and workers.",
            "pubDate": "2025-07-28T15:41:01.630645"
        }
    ]
}