{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-17T03:47:46.713981",
    "items": [
        {
            "title": "Nifty Eyes 25,400 As US, India Hold Positive Trade Talks & Fed Readies Rate Cut|Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-eyes-25-400-as-us-india-hold-positive-trade-talks-fed-readies-rate-cut-opening-bell-live-13552420.html",
            "description": "The Nifty 50 rallied 170 points, breaking its lower-high, lower-low pattern after Monday’s pause. Bulls drew strength from supportive technical and momentum signals. Experts say a decisive close above 25,250, tested intraday on Tuesday, could pave the way for 25,400–25,550 in the coming sessions. Dips are likely to attract buyers, with immediate support at 25,150 and a key zone at 25,000–24,850.\n\nGlobal cues are mixed this morning, but GIFT Nifty signals a positive start as markets await the US Fed’s rate decision. Jindal Steel will be in focus after submitting a non-binding offer to acquire Thyssenkrupp’s German steel unit. Meanwhile, trade talks between India and the US have resumed, and US President Donald Trump became the first world leader to wish Prime Minister Narendra Modi on his 75th birthday.",
            "pubDate": "2025-09-17T03:47:39.583298"
        },
        {
            "title": "RailTel Corporation shares in focus on contract win worth Rs 57.48 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/railtel-corporation-shares-in-focus-on-contract-win-worth-rs-57-48-crore-13551602.html",
            "description": "RailTel Corporation of India Share Price | The company received a contract worth Rs 57.48 crore from Bihar State Educational Infrastructure Development Corporation.",
            "pubDate": "2025-09-17T03:47:39.583383"
        },
        {
            "title": "Premier Explosives shares in focus on withdrawal of factory closure order by TGPCB",
            "link": "https://www.moneycontrol.com/news/business/stocks/premier-explosives-shares-in-focus-on-withdrawal-of-factory-closure-order-by-tgpcb-13551601.html",
            "description": "Premier Explosives Share Price | Telangana Pollution Control Board (TGPCB) revoked the closure order for factory situated at  Telangana.",
            "pubDate": "2025-09-17T03:47:39.583456"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-2-13550202.html",
            "description": "The Foreign institutional investors (FIIs) purchased equities worth Rs 308 crore on September 16, while Domestic institutional investors (DIIs) extended their buying in this month as they  bought equities worth Rs 1518 crore on the same day.",
            "pubDate": "2025-09-17T03:47:39.583529"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty gain at pre-open; Jindal Steel, PNC Infratech, Akzo Nobel in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-17-09-2025-liveblog-13551911.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Urban Company, Jindal Steel, PNC Infratech, Akzo Nobel India, RailTel Corporation of India, Coal India, Tech Mahindra, Bharat Electronics, Dev Accelerator, Amber Enterprises, NLC India, and Premier Explosives will be in focus on September 17.",
            "pubDate": "2025-09-17T03:47:39.583598"
        },
        {
            "title": "Trade Spotlight: How should you trade Bandhan Bank, Ashok Leyland, KEI Industries, Amber Enterprises, Aadhar Housing, Phoenix Mills, and others on September 17?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bandhan-bank-ashok-leyland-kei-industries-amber-enterprises-aadhar-housing-phoenix-mills-and-others-on-september-17-13551843.html",
            "description": "The market is expected to maintain bullish momentum after surpassing the August swing high. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-09-17T03:47:39.583671"
        },
        {
            "title": "Stocks to Watch Today: Urban Company, Jindal Steel, PNC Infratech, Akzo Nobel, RailTel, Coal India, Tech Mahindra, BEL, DevX, NLC India in focus on 17 September",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-urban-company-jindal-steel-pnc-infratech-akzo-nobel-railtel-coal-india-tech-mahindra-bel-devx-nlc-india-in-focus-on-17-september-13551812.html",
            "description": "Stocks to Watch, 17 September: Stocks like Urban Company, Jindal Steel, PNC Infratech, Akzo Nobel India, RailTel Corporation of India, Coal India, Tech Mahindra, Bharat Electronics, Dev Accelerator, Amber Enterprises, NLC India, and Premier Explosives will be in focus on September 17.",
            "pubDate": "2025-09-17T03:47:39.583736"
        }
    ]
}