{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-31T03:36:03.037324",
    "items": [
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-4-12900497.html",
            "description": "Wall Street ended in the negative territory overnight while most Asian markets remained closed today. Trends from the GIFT Nifty suggest a gap-down start for the domestic market on the last trading day of 2024.",
            "pubDate": "2024-12-31T02:21:59.785522"
        },
        {
            "title": "Trade Spotlight: How should you trade Lupin, United Spirits, Blue Star, Hindustan Unilever, Escorts, IREDA, and others on December 31?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-lupin-united-spirits-blue-star-hindustan-unilever-escorts-ireda-and-others-on-december-31-12900545.html",
            "description": "Benchmark indices are expected to remain under bearish control as long as they trade below all key moving averages. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-31T02:21:59.785611"
        },
        {
            "title": "Stocks to Watch Today: ITC, Lupin, Easy Trip, Unimech Aerospace, Mazagon Dock, Shriram Properties, Tanvi Foods, Hindalco in focus on 31 December",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-itc-lupin-easy-trip-unimech-aerospace-mazagon-dock-shriram-properties-tanvi-foods-hindalco-in-focus-on-31-december-12900533.html",
            "description": "Stocks To Watch Today, Dec 31: Stocks like Rail Vikas Nigam, CESC, Dhanlaxmi Bank, Jubilant Ingrevia, Adani Green Energy, Archean Chemical Industries, Century Enka, Bank of India, Prataap Snacks, Power Grid Corporation of India, SBI Life Insurance Company, and GMR Airports Infrastructure will also be in focus on December 31.",
            "pubDate": "2024-12-31T02:21:59.785711"
        },
        {
            "title": "Live: Will Nifty move positively on final day of 2024? | ITC, RVNL in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-move-positively-on-final-day-of-2024-itc-rvnl-in-focus-opening-bell-12900586.html",
            "description": "Benchmark indices Sensex and Nifty fell over 1 percent from day's highs and settled lower in the last session. On this final day of 2024, Nifty has already gained over 8 percent and is poised to end this year on a positive note, marking ninth consecutive year of good returns. Broader indices, on the other hand, have outperformed benchmarks this year. Today, the Street is eyeing Nifty's resistance at 23,900, with support placed around 23,500. This morning, global cues were mixed. US markets ended lower overnight, with headline indices down 1 percent each. Asia-Pacific markets also traded mixed this morning as investors digested China's manufacturing data. Among stocks in focus, watch out for ITC, Hindalco, and RVNL. Catch Lovisha Darad in conversation with Aamar Deo Singh, Senior Vice President, Angel One and Kunal Valia, Founder, StatLane.",
            "pubDate": "2024-12-31T03:36:02.479105"
        }
    ]
}