{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-11T04:50:41.179186",
    "items": [
        {
            "title": "Pharma stocks rally on Trump's tariff pause, led by up to 5% surge in Granules, Laurus Labs, Cipla",
            "link": "https://www.moneycontrol.com/news/business/markets/pharma-stocks-rally-on-trump-s-tariff-pause-led-by-up-to-5-surge-in-granules-laurus-labs-cipla-12991516.html",
            "description": "The recent global tariff changes have added uncertainty to markets, but India is being seen as better-positioned, with money managers pointing at sectors like banking, pharma, and energy as attractive bets.",
            "pubDate": "2025-04-11T04:50:29.375531"
        },
        {
            "title": "Coforge, Wipro, Infosys lead Nifty IT rebound as Trump's tariff pause eases business jitters",
            "link": "https://www.moneycontrol.com/news/business/markets/coforge-wipro-infosys-lead-nifty-it-rebound-as-trump-s-tariff-pause-eases-business-jitters-12991493.html",
            "description": "The IT sector has been one of the worst-hit in this global market rout as these companies derive major portions of their revenue from the American market. The Nifty IT index crashed over 10 percent between April 2 and April 9.",
            "pubDate": "2025-04-11T04:50:29.375632"
        },
        {
            "title": "Agri Picks Report April 11, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-april-11-2025-geojit-financial-services-12991481.html",
            "description": "According to Geojit Financial Services, Private weather forecaster Skymet has predicted a 'normal' southwest monsoon for India at 103% of the longperiod average, with an error margin of +/-5%. The season is likely to begin with relatively less rains, as the forecaster predicts rainfall in June at 96% of the long-period average.",
            "pubDate": "2025-04-11T04:50:29.375706"
        },
        {
            "title": "Live: Will Trump’s Tariff Pause Propel Nifty To 23,000? Street Verdict On TCS Q4| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-trump-s-tariff-pause-propel-nifty-to-23-000-street-verdict-on-tcs-q4-opening-bell-12991444.html",
            "description": "The Nifty 50 had a rangebound session again amid tariff-led uncertainty, possibly waiting for a trigger related to tariffs to gain firm direction. The index closed 0.6 percent lower on April 9 after the RBI policy. The VIX remained above the 20 mark. However, Trump’s decision later in the day on Wednesday to pause reciprocal tariffs for 90 days for all trade partners, barring China (which attracts a 125% tariff rate), raised hopes for an upward change in market trend, according to experts. Technically, on the higher side, the index may face a hurdle at 22,850, followed by the 23,200-23,400 area; above this, the bulls may gain strength. However, support is placed at the 22,250-22,000 zone. TCS reported weak set of numbers for Q4. We decode the numbers with Omkar Tanksale, Senior Research Analyst - IT, Axis Securities. Also catch Nandita Khemka in conversation with Raja Venkatraman, Co-Founder, NeoTrader and market expert Ajay Bagga.",
            "pubDate": "2025-04-11T04:50:29.375773"
        },
        {
            "title": "TCS Q4 FY25 – Is it worth a look post the U-turn on US tariff?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/tcs-q4-fy25-is-it-worth-a-look-post-the-u-turn-on-us-tariff-12991446.html",
            "description": "Upside triggers are missing, but downside looks limited despite volatility",
            "pubDate": "2025-04-11T04:50:29.375841"
        },
        {
            "title": "Biocon share price rises 4% on US FDA approval for cancer drug",
            "link": "https://www.moneycontrol.com/news/business/stocks/biocon-share-price-in-focus-on-us-fda-approval-for-cancer-drug-12991138.html",
            "description": "Biocon Share Price | The approval of JOBEVNE expands Biocon Biologics’ biosimilar oncology portfolio in the United States, which also includes OGIVRI (Trastuzumab-dkst) and FULPHILA (Pegfilgrastim-jmdb).",
            "pubDate": "2025-04-11T04:50:29.375907"
        },
        {
            "title": "BHEL share price up 2% on signing MoU with Nuovo Pignone International",
            "link": "https://www.moneycontrol.com/news/business/stocks/bhel-share-price-in-focus-on-signing-mou-with-nuovo-pignone-international-12991139.html",
            "description": "Bharat Heavy Electricals Share Price | BHEL shall be the main (lead) bidder to the identified customers for addressing the compressors train revamp business opportunities in fertiliser sector in India and Nuovo Pignone International will be nominated vendor to BHEL through the subject MoU with definite scope of work.",
            "pubDate": "2025-04-11T04:50:29.375971"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex up 1,300 pts, Nifty above 22,800; Muthoot Finance down 5%",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-11-04-2025-liveblog-12991403.html",
            "description": "Sensex Today | Stock Market LIVE Updates: All the sectoral indices are trading in the green. BSE Midcap and Smallcap indices up 2 percent each. Tata Steel, Hindalco, JSW Steel, Tata Motors, Sun Pharma are among major gainers on the Nifty, while losers are Asian Paints, Apollo Hospitals and HDFC Life.",
            "pubDate": "2025-04-11T04:50:29.376036"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-82-12990614.html",
            "description": "The Foreign institutional investors (FIIs) continued their selling on eighth day on April 9, as they sold equities worth Rs 4358 crore, however, Domestic institutional investors (DIIs) extended their buying on third day as they bought equities of Rs 2976 crore.",
            "pubDate": "2025-04-11T04:50:29.376101"
        },
        {
            "title": "Trade Spotlight: How should you trade Ambuja Cements, HUDCO, Colgate Palmolive, Apollo Tyres, Bajaj Finserv, United Spirits, and others on April 11?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-ambuja-cements-hudco-colgate-palmolive-apollo-tyres-bajaj-finserv-united-spirits-and-others-on-april-11-12991388.html",
            "description": "The market is expected to witness a healthy rally in the upcoming session after Trump announced a 90-day pause on tariffs for all countries except China (which remains subject to a 145% tariff rate), though uncertainties persist. Below are some trading ideas for the near term.",
            "pubDate": "2025-04-11T04:50:29.376166"
        },
        {
            "title": "Stocks to Watch Today: TCS, Biocon, GAIL, Greaves Cotton, Sun Pharma, Dishman Carbogen Amcis, Coromandel International in focus on 11 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-biocon-gail-greaves-cotton-sun-pharma-dishman-carbogen-amcis-coromandel-international-in-focus-on-11-april-12991380.html",
            "description": "Stocks to Watch, 11 Apr: Stocks like TARC, Bharti Hexacom, Infosys, Aurobindo Pharma, Bharat Heavy Electricals, Bank of India, Tata Steel, Sanofi India, Punjab National Bank, Axiscades Technologies, JSW Energy, Eternal, Federal Bank, Bajaj Healthcare, SRF, Samvardhana Motherson International, IIFL Finance, and Northern Arc Capital will be in focus on April 11.",
            "pubDate": "2025-04-11T04:50:29.376230"
        }
    ]
}