{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-06T03:32:14.968766",
    "items": [
        {
            "title": "Live: Will Nifty be able to hold its gains to the second day? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-be-able-to-hold-its-gains-to-the-second-day-opening-bell-12957700.html",
            "description": "Nifty snapped its 10-day losing streak yesterday, closing over 1% higher as most index constituents participated in the rally. The market witnessed strong breadth, with eight stocks advancing for every one that declined in the last session. The 22,000 level remains a critical support for Nifty, adding to the significance of this rebound. All sectors ended in positive territory, with metal, IT, and auto stocks leading the recovery. Going ahead, experts now watch out Nifty's resistance around 22,500 and support around 21m960. This morning, global cues were positive. All major averages in the Wall Street ended over a percent higher. Asia-Pacfific markets also started the day good as US President Donald Trump granted one-month tariff exemption on automakers. Among stocks, watch out for Zydus Life, Wipro, and LIC Housing in today's trading session. Catch Lovisha Darad in conversation with Nirav Chheda, Assistant Vice President, Equity Derivatives & Technical Research- Retail, Nirmal Bang and Anshul Saigal, Market Expert.",
            "pubDate": "2025-03-06T03:32:08.764041"
        },
        {
            "title": "RPP Infra Projects shares in focus on orders win worth Rs 80.98 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/rpp-infra-projects-shares-in-focus-on-orders-worth-rs-80-98-crore-12957538.html",
            "description": "RPP Infra Projects Share Price | The company had reported a 17 percent jump in its consolidated December quarter net profit at Rs 18.87 crore, YoY.",
            "pubDate": "2025-03-06T03:32:08.764121"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a firm opening; Angel One, Zydus Life, Galaxy Surfactants",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-06-03-2025-liveblog-12957654.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Wipro, Walchandnagar Industries, Hindustan Zinc, R Systems International, Kirloskar Industries, Zaggle Prepaid Ocean Services, Dalmia Bharat, Sterlite Technologies, Banswara Syntex, Lorenzini Apparels, Adani Enterprises, and Manappuram Finance will be in focus on March 6.",
            "pubDate": "2025-03-06T03:32:08.764189"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-59-12956893.html",
            "description": "The Foreign institutional investors (FIIs) extended their selling on tenth day on March 5 as they sold equities worth Rs 2895 crore. However, domestic institutional investors (DIIs) also extended their buying on 20th day as they bought equities worth Rs 3370 crore, on the same day.",
            "pubDate": "2025-03-06T03:32:08.764256"
        },
        {
            "title": "Stocks to Watch Today: TCS, Zydus Lifesciences, RPP Infra Projects, LIC Housing, Galaxy Surfactants, Route Mobile in focus on 6 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-zydus-lifesciences-rpp-infra-projects-lic-housing-galaxy-surfactants-route-mobile-in-focus-on-6-march-12957647.html",
            "description": "Stocks to Watch, Mar 6: Stocks like Wipro, Walchandnagar Industries, Hindustan Zinc, R Systems International, Kirloskar Industries, Zaggle Prepaid Ocean Services, Dalmia Bharat, Sterlite Technologies, Banswara Syntex, Lorenzini Apparels, Adani Enterprises, and Manappuram Finance will be in focus on March 6.",
            "pubDate": "2025-03-06T03:32:08.764324"
        },
        {
            "title": "Wall Street rebounds as investors weigh tariff uncertainty, mixed economic data",
            "link": "https://www.moneycontrol.com/news/business/markets/wall-street-rebounds-as-investors-weigh-tariff-uncertainty-mixed-economic-data-12957628.html",
            "description": "Investor sentiment got a boost after Commerce Secretary Howard Lutnick indicated late Tuesday that progress was being made toward a tariff agreement with Canada and Mexico.",
            "pubDate": "2025-03-06T03:32:08.764391"
        }
    ]
}