{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-14T15:40:06.226475",
    "items": [
        {
            "title": "Centre finalises Companies Act changes to boost capital access for bankrupt firms, tighten audit rules: Report",
            "link": "https://www.moneycontrol.com/news/business/companies/centre-finalises-companies-act-changes-to-boost-capital-access-for-bankrupt-firms-tighten-audit-rules-report-12821785.html",
            "description": "In addition to the Companies Act amendments, the Ministry of Corporate Affairs is also working on changes to the Insolvency and Bankruptcy Code (IBC). The proposed amendments will further clarify the priority of repayments owed by distressed companies to statutory agencies.",
            "pubDate": "2024-09-14T06:44:55.304972"
        },
        {
            "title": "CCI accuses Samsung, Xiaomi of colluding with Amazon, Flipkart",
            "link": "https://www.moneycontrol.com/news/business/companies/cci-accuses-samsung-xiaomi-of-colluding-with-amazon-flipkart-12821877.html",
            "description": "Indian retailers have repeatedly accused Amazon and Flipkart, and smartphone companies, of exclusive phone launches online, saying shopkeepers suffered as they didn't get the latest models and customers looked for them on the shopping websites",
            "pubDate": "2024-09-14T10:24:22.217582"
        },
        {
            "title": "Adani Green Energy names Saurabh Shah new CFO as Phuntsok Wangyal steps down",
            "link": "https://www.moneycontrol.com/news/business/companies/adani-green-energy-names-saurabh-shah-new-cfo-as-phuntsok-wangyal-steps-down-12821915.html",
            "description": "Saurabh Shah, who currently serves as Deputy Chief Financial Officer at Adani Enterprises Limited, will bring over 22 years of extensive experience in financial management to his new role.",
            "pubDate": "2024-09-14T12:48:28.294847"
        },
        {
            "title": "NCLT recalls order on Zee-Sony merger, allows withdrawal of scheme",
            "link": "https://www.moneycontrol.com/news/business/companies/nclt-recalls-order-on-zee-sony-merger-allows-withdrawal-of-scheme-12821972.html",
            "description": "The Mumbai bench of the NCLT had last week recalled its order passed on August 10, 2023, in which it had approved the merger of Zee Entertainment with Sony Pictures Networks India",
            "pubDate": "2024-09-14T15:40:05.336644"
        }
    ]
}