{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-16T11:56:54.042806",
    "items": [
        {
            "title": "Earnings Impact: Crompton Greaves shares up 6% on Q4 profit growth, Kaynes and IKS shares higher by 2%",
            "link": "https://www.moneycontrol.com/news/business/markets/earnings-impact-crompton-greaves-shares-up-6-on-q4-profit-growth-kaynes-and-iks-shares-higher-by-2-13028874.html",
            "description": "The Rekha Jhunjhunwala-backed IKS reported a whopping 132 percent jump in net profit to Rs 148 crore for the fourth quarter of the financial year 2025.",
            "pubDate": "2025-05-16T05:56:36.445528"
        },
        {
            "title": "India Shelter Finance: Strong traction in disbursement to help",
            "link": "https://www.moneycontrol.com/news/business/earnings/india-shelter-finance-strong-traction-in-disbursement-to-help-13028647.html",
            "description": "Focus on affordable housing finance to continue; multiple strategic levers to lift valuations",
            "pubDate": "2025-05-16T05:56:36.445740"
        },
        {
            "title": "For Medi Assist, FY25 stands out as a year of consolidation",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/for-medi-assist-fy25-stands-out-as-a-year-of-consolidation-13028628.html",
            "description": "Healthy growth in premium and margin was strong",
            "pubDate": "2025-05-16T05:56:36.445805"
        },
        {
            "title": "PB Fintech shares rise 3% on a near three-fold rise in net profit: Should you buy, sell or hold?",
            "link": "https://www.moneycontrol.com/news/business/markets/pb-fintech-shares-gain-3-after-net-profit-zooms-182-should-you-buy-sell-or-hold-13028460.html",
            "description": "Morgan Stanley kept an 'Underweight' call PB Fintech shares, with a target price of Rs 1,130 apiece. This implies a downside potential of over 36 percent from the stock's previous closing price.",
            "pubDate": "2025-05-16T05:56:36.445868"
        },
        {
            "title": "Crompton Greaves Consumer Q4: Lower input prices, cost optimisation support margins",
            "link": "https://www.moneycontrol.com/news/business/earnings/crompton-greaves-consumer-q4-lower-input-prices-cost-optimisation-support-margins-13028436.html",
            "description": "Focus on the premium product portfolio and the revival in the lighting business will be key growth drivers",
            "pubDate": "2025-05-16T05:56:36.445937"
        },
        {
            "title": "Baazar Style Retail: Can this value retail player lead fashion growth?",
            "link": "https://www.moneycontrol.com/news/business/earnings/baazar-style-retail-can-this-value-retail-player-lead-fashion-growth-13028435.html",
            "description": "With record revenues, store additions, and strong private label momentum, Baazar Style Retail ended FY25 with strong growth.",
            "pubDate": "2025-05-16T05:56:36.446001"
        },
        {
            "title": "Agri Picks Report May 16, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-may-16-2025-geojit-financial-services-13028430.html",
            "description": "According to Geojit Financial Services, Sowing of summer crops in Maharashtra rose more than 21% to 510,538 hectares as of Tuesday from 421,706 hectares a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-05-16T05:56:36.446069"
        },
        {
            "title": "Weekly Tactical Pick: Why you should buy this hotel stock",
            "link": "https://www.moneycontrol.com/news/business/stocks/weekly-tactical-pick-why-you-should-buy-this-hotel-stock-13028402.html",
            "description": "With a strong balance sheet and healthy cash flows, ROHL can undertake rapid expansion and press the growth pedal.",
            "pubDate": "2025-05-16T05:56:36.446134"
        },
        {
            "title": "IndusInd Bank shares fall 4% as brokerages slash earnings forecast on fresh accounting issues",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerages-slash-indusind-bank-earnings-forecasts-as-fresh-accounting-issues-surface-13028286.html",
            "description": "IndusInd Bank share price: Analysts suggest that adjusting for the Rs 674 crore additional interest income implies that the bank's core Net Interest Margin (NIM) was 17 basis points lower than the reported NIM.",
            "pubDate": "2025-05-16T05:56:36.446262"
        },
        {
            "title": "Stocks to Watch Today: PB Fintech, Allied Blenders, LIC Housing, Bharti Airtel, Abbott India, Rail Vikas Nigam, Infosys, JSW Energy in focus on 16 May",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-pb-fintech-allied-blenders-lic-housing-bharti-airtel-abbott-india-rail-vikas-nigam-infosys-jsw-energy-in-focus-on-16-may-13028219.html",
            "description": "Stocks to watch, 16 May: Stocks like Onesource Specialty Pharma,One 97 Communications Paytm,Industrial Investment Trust, Alkem Laboratories, Bajaj Auto, Godfrey Phillips India, Endurance Technologies, Bikaji Foods International,Godrej Industries, Bharti Airtel, Infosys, JSW Energy, LIC Housing Finance, and Allied Blenders and Distillers will be in focus on May 16.",
            "pubDate": "2025-05-16T05:56:36.446340"
        },
        {
            "title": "Rail Vikas Nigam shares gain 2% on order win worth Rs 115.79 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/rail-vikas-nigam-shares-in-focus-on-order-win-worth-rs-115-79-crore-13028047.html",
            "description": "Rail Vikas Nigam Share Price | The meeting of the board of directors of the company is scheduled on May 21, 2025 to consider and approve the audited financial results (standalone & consolidated) of the company for the quarter and year ended 31st March, 2025.",
            "pubDate": "2025-05-16T05:56:36.446403"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex down 230 pts, Nifty around 25,000; IT, pharma down, realty up",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-16-05-2025-liveblog-13028214.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Among sectors, power, PSU, realty, capital goods up 1 percent each, while pharma, IT down 0.5 percent each. BSE Midcap and smallcap indices up 0.5 percent each. Bharti Airtel, Cochin Shipyard, Mazagon Dock, JSW Infra, Garden Reach are among top gainers on the Nifty.",
            "pubDate": "2025-05-16T05:56:36.446465"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-103-13027106.html",
            "description": "The Foreign institutional investors (FIIs) extended buying on the second day as they bought equities worth Rs 5392 crore on May 15, while Domestic institutional investors (DIIs) sold equities of Rs 1,668 crore on the same day, as they turned net sellers after four days of buying.",
            "pubDate": "2025-05-16T05:56:36.446527"
        },
        {
            "title": "Trade Spotlight: How should you trade Ashok Leyland, HDFC AMC, Grasim, UltraTech Cement, ONGC, Macrotech Developers and others on May 16?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-ashok-leyland-hdfc-amc-grasim-ultratech-cement-ongc-macrotech-developers-and-others-on-may-16-13028176.html",
            "description": "Bulls appear to be in healthy momentum and may continue driving the market rally further. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-05-16T05:56:36.446596"
        },
        {
            "title": "Titagarh, RVNL, other railway shares rally on value buying, easing border tensions",
            "link": "https://www.moneycontrol.com/news/business/markets/titagarh-rvnl-other-railway-shares-rally-on-value-buying-easing-border-tensions-13029471.html",
            "description": "Recent border tensions had weighed on infrastructure projects, especially in states along the western border, including railway's expansion and upgradation plans.",
            "pubDate": "2025-05-16T10:00:57.930864"
        },
        {
            "title": "Q4 sees significant selling by promoters of mid- and small-cap companies",
            "link": "https://www.moneycontrol.com/news/business/markets/q4-sees-significant-selling-by-promoters-of-mid-and-small-cap-companies-13028835.html",
            "description": "Analysis of 614 companies reveals that about 130 companies saw a decrease in their promoter shareholdings, while 57 companies saw an increase - with the bulk of decrease being small-caps, followed by mid-caps.",
            "pubDate": "2025-05-16T10:00:57.931693"
        },
        {
            "title": "Business in the Week Ahead (May 19- May 23, 2025)",
            "link": "https://www.moneycontrol.com/news/business/business-in-the-week-ahead-may-19-may-23-2025-13029566.html",
            "description": "A slew of economic data from India, the US and the UK is set to be announced next week. Here are some important indicators that market participants should keep an eye out for",
            "pubDate": "2025-05-16T11:41:42.460198"
        },
        {
            "title": "Angel One, CDSL, other capital market stocks gain up to 9% as Nifty sustains above 25,000-mark",
            "link": "https://www.moneycontrol.com/news/business/markets/angel-one-cdsl-other-capital-market-stocks-gain-up-to-9-as-nifty-sustains-above-25-000-mark-13029598.html",
            "description": "Angel One shares were the top gainer in the pack of capital market stocks, rising over 8.5 percent to close at a six-month high level of Rs 2,788 apiece",
            "pubDate": "2025-05-16T11:41:42.460262"
        },
        {
            "title": "Taking Stock: Nifty at 25,000, Sensex falls 200 pts; broader indices outperform",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-at-25-000-sensex-falls-200-pts-broader-indices-outperform-13029514.html",
            "description": "Broader indices outperformed the main indices with BSE Midcap index rising 0.8 percent and smallcap index added 1 percent. Among sectors, media, power, PSU, realty, capital goods indices were up 1-1.7 percent, while IT index was down nearly 1 percent.",
            "pubDate": "2025-05-16T11:41:42.460345"
        },
        {
            "title": "Live: Sensex, Nifty jump up to 4% this week, broader markets outperform | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-sensex-nifty-jump-up-to-4-this-week-broader-markets-outperform-closing-bell-13029593.html",
            "description": "Sensex, Nifty Break 2-day Rally. Markets Enter Consolidation Mode. Midcap, Smallcap Advances For 5th Day. Nifty It, Metal Indices Worst Performers. Nifty Realty Top Sectoral Performer. India Vix Continues To Cool Off, Down 2(%). Nifty 50 Gainers: Bel, Tcpl, Bajaj Auto. Nifty 50 Losers: Airtel, Hcl Tech, Sbi. Sensex, Nifty See Up To 4(%) Weekly Gains. Nifty Defence Best Performer This Week. Midcap, Smalllcap Indices Surge Up To 9(%). All Sectoral Indices Advance This Week. Bank Nifty, Nifty Pharma Underperform. Catch Lovisha Darad and Yatin Mota as they discuss stocks on their radar.\n#stockmarket #sharemarket #bse #nse #sensex #nifty #closingbell",
            "pubDate": "2025-05-16T11:41:42.460728"
        },
        {
            "title": "SJS Enterprises: Riding High on Premiumization and Auto Sector Growth Momentum",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/sjs-enterprises-riding-high-on-premiumization-and-auto-sector-growth-momentum-13029803.html",
            "description": "SJS Enterprises is one of the leading design-to-delivery aesthetics solutions provider, serving the automotive and the consumer appliance industries. With the increasing premiumisation of automotive and consumer durable products, the company is poised to grow significantly.",
            "pubDate": "2025-05-16T11:56:53.471367"
        }
    ]
}