{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-30T03:31:05.812582",
    "items": [
        {
            "title": "Mahindra sets sight on renewable power, forms Ultrogen Hybren to focus on green energy and storage systems",
            "link": "https://www.moneycontrol.com/news/business/markets/mahindra-sets-sight-on-renewable-power-forms-ultrogen-hybren-to-focus-on-green-energy-and-storage-systems-12899828.html",
            "description": "Ultrogen Hybren will be a subsidiary of Mahindra Susten, a subsidiary of Mahindra Holdings (MHL), the company informed through an exchange filing on December 29. The company will aspire to be an Independent Power Producer (IPP).",
            "pubDate": "2024-12-30T02:31:44.173091"
        },
        {
            "title": "Sectors and stocks for January based on seasonality analysis",
            "link": "https://www.moneycontrol.com/news/business/markets/sectors-and-stocks-for-january-based-on-seasonality-analysis-12899812.html",
            "description": "Seasonality analysis is a powerful tool that helps traders and investors identify recurring patterns in stock, sector, and index performances.",
            "pubDate": "2024-12-30T02:31:44.173184"
        },
        {
            "title": "Trade Spotlight: How should you trade Jubilant Foodworks, Ipca Labs, Paytm, Welspun Corp, Campus Activewear, and others on December 30?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-jubilant-foodworks-ipca-labs-paytm-welspun-corp-campus-activewear-and-others-on-december-30-12899798.html",
            "description": "The market is expected to remain rangebound with a positive bias in the upcoming sessions. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-30T02:31:44.173260"
        },
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-3-12899783.html",
            "description": "Wall Street closed on a weak note last week, however, most Asian markets bucked the trend and moved higher on the penultimate trading day of 2024. Trends from the GIFT Nifty suggest a muted start for the domestic market.",
            "pubDate": "2024-12-30T03:04:12.545369"
        },
        {
            "title": "Live: Will Nifty scale to 24,000 in last 2 days of 2024? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-scale-to-24-000-in-last-2-days-of-2024-opening-bell-12899851.html",
            "description": "Frontline indices Sensex and Nifty managed to gain 1 percent each last week despite a thinly volume trade. A total of 32 Nifty stocks recorded gains last week, while Midcap index stayed flat. This week, macro-economic data, global cues, and FII flows will shape market movements. Majority of experts expect rangebound trade to continue this week as well, seeing Nifty's resistance at 24,000-24,200, with support placed around 23,650. This morning, global cues were mixed. US markets ended lower on Friday, while Asia Pacific markets started this morning on a mixed note. Among stocks in focus, watch out for JSW Energy, Utkarsh SFB, IOL Chemicals. Catch Lovisha Darad in conversation with Osho Krishan, Sr. Analyst - Technical & Derivative Research, Angel One and Sandip Agarwal - Fund Manager, Sowilo Investment Managers.",
            "pubDate": "2024-12-30T03:31:05.323942"
        }
    ]
}