{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-11T05:43:23.605800",
    "items": [
        {
            "title": "Brokerage Radar: JPMorgan downgrades Asian Paints to 'underweight', Kotak upgrades Ashok Leyland to 'add'",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-jpmorgan-downgrades-asian-paints-to-underweight-kotak-upgrades-ashok-leyland-to-add-12862441.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Asian Paints, SBI, Tata Motors and more.",
            "pubDate": "2024-11-11T02:20:09.527273"
        },
        {
            "title": "ITI shares in focus on emerging lowest bidder for BharatNet project",
            "link": "https://www.moneycontrol.com/news/business/stocks/iti-shares-in-focus-on-emerging-lowest-bidder-for-bharatnet-project-12862347.html",
            "description": "ITI Share Price | A meeting of the board of directors will be held on November 14, 2024.",
            "pubDate": "2024-11-11T02:20:09.527413"
        },
        {
            "title": "DCX Systems shares in focus on export order win worth Rs 460.3 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/dcx-systems-shares-in-focus-on-export-order-win-worth-rs-460-3-crore-12862346.html",
            "description": "DCX Systems Share Price | The meeting of the board of directors of the company is scheduled on November 12, 2024.",
            "pubDate": "2024-11-11T02:20:09.527488"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a negative start; US markets gain, Asia falls",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-11-11-2024-liveblog-12862444.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The US S&P 500 zoomed past 6,000 points on Friday to a new record while Treasury yields retreated, as investors again cheered Donald Trump's decisive victory, although disappointment about China's latest fiscal support dampened the mood elsewhere.",
            "pubDate": "2024-11-11T02:20:09.527561"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-75-12861922.html",
            "description": "The GIFT Nifty is indicating a negative start for the day.",
            "pubDate": "2024-11-11T02:20:09.527632"
        },
        {
            "title": "Live: Can Nifty Defend 24,000 As Technical Bounce Reverses? Tata Motors In Focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/business/markets/live-can-nifty-defend-24000-as-technical-bounce-reverses-tata-motors-in-focus-opening-bell-12862464.html",
            "description": "Indian equity market continued its consolidation for another week, slipping over half a percent, indicating an ongoing corrective phase. The week started cautiously, with investor sentiment dampened by concerns around the upcoming US Presidential elections. A brief mid-week rally followed the election results, but gains were short-lived, as volatility persisted amid various global events. As we move into the second week of November, investors will keep a close eye on several critical factors, including the final set of Q2FY25 earnings, geopolitical tensions in the Middle East, FII flows, crude oil prices, global market trends, and key domestic and international macroeconomic data. On Wall Street, Trump-fuelled rally continued unabated with Dow toppling 44,000 for the first time and the S&P 500 ending at record high to cap election week rally. Among stocks to watch out for today will be SBI, as brokerages spell out their verdict on the stock post quarterly earnings, M&M, Asian Paints, LIC. Catch Nandita Khemka in conversation with Ajit Mishra - SVP, Research, Religare Broking and market expert Prakash Diwan",
            "pubDate": "2024-11-11T03:23:34.882726"
        },
        {
            "title": "Brokerages sound the alarm over Asian Paints’ underwhelming Q2FY25 results",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerages-sound-the-alarm-over-asian-paints-underwhelming-q2fy25-results-12862450.html",
            "description": "Morgan Stanley cited weather-related impacts and demand challenges, while Jefferies expressed concerns about Asian Paints' broad-based underperformance and competitive pressures.",
            "pubDate": "2024-11-11T03:39:24.909078"
        },
        {
            "title": "Agri Picks Report November 11, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-november-11-2024-geojit-financial-services-12862485.html",
            "description": "According to Geojit, Farmers in Rajasthan have sown rabi crops over 4.22 million hectares as of Wednesday, down 14.7% on year from 4.94 million hectares sown in the corresponding period last year, according to a report by the state's agriculture department.",
            "pubDate": "2024-11-11T03:47:19.920195"
        },
        {
            "title": "Short Call: The curious case for India after Donald Trump's election; Power Grid, Apollo Hospitals in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/short-call-the-curious-case-for-india-after-donald-trumps-election-power-grid-apollo-hospitals-in-focus-12862487.html",
            "description": "\"It's not whether you're right or wrong that's important, but how much money you make when you're right and how much you lose when you're wrong\"— George Soros",
            "pubDate": "2024-11-11T03:55:00.144022"
        },
        {
            "title": "Biocon shares surge 5% after USFDA clears Bengaluru unit as VAI",
            "link": "https://www.moneycontrol.com/news/business/markets/biocon-shares-surge-5-after-usfda-clears-bengaluru-unit-as-vai-12862484.html",
            "description": "With the Bengaluru unit's clearance from the USFDA out of the window, investors are now eagerly waiting for regulatory clearance for Biocon's Malaysia unit.",
            "pubDate": "2024-11-11T04:13:44.075357"
        },
        {
            "title": "Nifty, Sensex extend losses for third day on mixed cues; Nifty Auto shines",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-extend-losses-for-third-day-on-mixed-cues-nifty-auto-shines-12862459.html",
            "description": "Nifty Auto and IT were the leaders, led by the likes of Tata Motors, Maruti Suzuki, M&M and Hyundai Motors.",
            "pubDate": "2024-11-11T04:13:44.075444"
        },
        {
            "title": "PFC stock jumps as brokerages reaffirm bullish stance following strong Q2 results",
            "link": "https://www.moneycontrol.com/news/business/markets/pfc-stock-jumps-as-brokerages-reaffirm-bullish-stance-following-strong-q2-results-12862507.html",
            "description": "PFC shares rose as brokerages retained a bullish view after Q2 results highlighted growth in disbursements, improved asset quality, and favorable loan sanctions.",
            "pubDate": "2024-11-11T04:13:44.075522"
        },
        {
            "title": "Emami: Focus on balancing urban and rural growth, comfortable valuation",
            "link": "https://www.moneycontrol.com/news/business/earnings/emami-focus-on-balancing-urban-and-rural-growth-comfortable-valuation-12862468.html",
            "description": "The company’s rural stronghold and distribution mix will aid sustained growth",
            "pubDate": "2024-11-11T04:13:44.075710"
        },
        {
            "title": "Asian Paints shares plunge 9% as brokerages sound the alarm over Asian Paints' underwhelming Q2FY25 results",
            "link": "https://www.moneycontrol.com/news/business/markets/asian-paints-shares-plunge-9-as-brokerages-sound-the-alarm-over-asian-paints-underwhelming-q2fy25-results-12862450.html",
            "description": "Morgan Stanley cited weather-related impacts and demand challenges, while Jefferies expressed concerns about Asian Paints' broad-based underperformance and competitive pressures.",
            "pubDate": "2024-11-11T04:13:44.075922"
        },
        {
            "title": "Aarti Industries stock nosedives 9% after dismal Q2 earnings show",
            "link": "https://www.moneycontrol.com/news/business/markets/aarti-industries-stock-nosedives-9-after-dismal-q2-earnings-show-12862525.html",
            "description": "Aarti Industries reported a sharp drop in Q2 net profit, with weak margin performance dragging earnings, however, brokerages adjust earnings estimates and maintain optimistic long-term views.",
            "pubDate": "2024-11-11T04:43:48.345810"
        },
        {
            "title": "Naukri parent Info Edge's stock gets positive brokerage nod as Q2 results impress",
            "link": "https://www.moneycontrol.com/news/business/markets/naukri-parent-info-edges-stock-gets-positive-brokerage-nod-as-q2-results-impress-12862530.html",
            "description": "Naukri parent Info Edge reported a robust Q2FY25, with revenue in line and EBITDA margin surpassing expectations, while analysts forecast growth as IT hiring strengthens.",
            "pubDate": "2024-11-11T04:43:48.345897"
        },
        {
            "title": "Profit booking continues for Jupiter Wagons despite decent Q2 earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/profit-booking-continues-for-jupiter-wagons-despite-decent-q2-earnings-12862545.html",
            "description": "Sharp profit booking has taken over railway names over the last few months after two years of bull run, triggering a 14 percent correction in Jupiter Wagons in the past three months.",
            "pubDate": "2024-11-11T05:19:09.451068"
        },
        {
            "title": "KEC International|  Debt Reduction, strong execution, and robust Order Book to drive Growth Outlook",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/kec-international-debt-reduction-strong-execution-and-robust-order-book-to-drive-growth-outlook-12862554.html",
            "description": "KEC International has achieved notable growth, cementing its leadership in the T&D sector and expanding into railways, solar, and civil engineering. In Q2FY25, the company saw strong revenue growth with a 6.26% EBITDA margin. The company is expecting closer to Rs 25000 crore inflows this year. Now with an order book of Rs 34,088 crore, KEC's growth outlook is solid. Strategic moves like cable business monetization and debt reduction would only boost its investment appeal.",
            "pubDate": "2024-11-11T05:19:09.451160"
        },
        {
            "title": "Data Patterns shares tumble 7% after Q2 revenue, profit decline on year",
            "link": "https://www.moneycontrol.com/news/business/markets/data-patterns-shares-tumble-7-after-q2-revenue-profit-decline-on-year-12862510.html",
            "description": "For Q2FY25, Data Patterns' net profit dropped over 10 percent year-on-year to Rs 30.3 crore, with revenue from operations slipping 16 percent to Rs 91 crore.",
            "pubDate": "2024-11-11T05:43:22.495891"
        },
        {
            "title": "Tata Motors, Asian Paints , Divis Laboratories,  LIC & ITI | Stocks On Radar",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/tata-motors-asian-paints-divis-laboratories-lic-iti-stocks-on-radar-12862604.html",
            "description": "Tata Motors Q2 consolidated net profit declines 11% to ₹3,343 cr. Asian Paints Q2 Result: Net profit declines 43% on weak demand, revenue dips 5%. Divi's Labs Q2 Results: Net profit rises 46% to Rs 510 crore, revenue at Rs 2,338 crore. Watch here for more details",
            "pubDate": "2024-11-11T05:43:22.495989"
        }
    ]
}