{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-29T03:00:47.604476",
    "items": [
        {
            "title": "Sensex, Nifty set to rebound after 2-day slide; key levels to watch on August 29",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-set-to-rebound-after-2-day-slide-key-levels-to-watch-on-august-29-13498369.html",
            "description": "Dalal Street ended at the day's low, extending its losing streak to the second session as investors continued to sell off after U.S. President Donald Trump's 50 percent tariff came into effect.",
            "pubDate": "2025-08-29T03:00:40.893356"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-166-13495500.html",
            "description": "The Foreign institutional investors (FIIs) continued their selling on fourth day as they sold equities worth Rs 3856 crore on August 28, while Domestic institutional investors (DIIs) bought equities worth Rs 6920 crore on the same day.",
            "pubDate": "2025-08-29T03:00:40.893441"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty hints a positive start; US market gain, Asia falls",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-29-08-2025-liveblog-13498068.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The S&P 500 and Dow Jones Industrial Average notched record high closes on Thursday after Nvidia's quarterly report fell short of investors' high expectations but confirmed that spending related to artificial intelligence infrastructure remains strong.",
            "pubDate": "2025-08-29T03:00:40.893513"
        },
        {
            "title": "Stocks to Watch Today: Reliance Industries, Hexaware, Lemon Tree Hotels, Afcons, Shukra Pharma, Paytm, Muthoot Finance, CG Power in focus on 29 August",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-reliance-industries-hexaware-lemon-tree-hotels-afcons-shukra-pharma-paytm-muthoot-finance-cg-power-in-focus-on-29-august-13498041.html",
            "description": "Stocks to Watch, 29 August: Stocks like Reliance Industries, Hexaware Technologies, Lemon Tree Hotels, Afcons Infrastructure, Shukra Pharmaceuticals, One 97 Communications Paytm, Muthoot Finance, and CG Power and Industrial Solutions will be in focus on August 29.",
            "pubDate": "2025-08-29T03:00:40.893587"
        },
        {
            "title": "Trade Spotlight: How should you trade Caplin Point, Jindal Stainless, Engineers India, Advanced Enzyme, Nykaa, Endurance Tech, and others on August 29?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-caplin-point-jindal-stainless-engineers-india-advanced-enzyme-nykaa-endurance-tech-and-others-on-august-29-13497964.html",
            "description": "A rebound may be possible after the severe sell-off, but sustainability is the level to watch given the bearish sentiment. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-08-29T03:00:40.893657"
        },
        {
            "title": "Chinkerpoo Family Trust sells 1.3% stake in IndiGo for Rs 2,933 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/chinkerpoo-family-trust-sells-1-3-stake-in-indigo-for-rs-2-933-crore-13497549.html",
            "description": "As of June 2025, Rakesh Gangwal, and The Chinkerpoo Family Trust had held 7.81 percent stake in the IndiGo operator.",
            "pubDate": "2025-08-29T03:00:40.893728"
        }
    ]
}