{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-17T07:24:12.083570",
    "items": [
        {
            "title": "LTI Mindtree shares fall 5% as Citigroup plans to slash external IT contractors to 20% from 50%",
            "link": "https://www.moneycontrol.com/news/business/stocks/lti-mindtree-shares-fall-5-as-citigroup-plans-to-slash-external-it-contractors-to-20-from-50-12966316.html",
            "description": "The New York-headquartered Citi Group planning to reduce external dependence and increase its internal resources comes as US President Donald Trump continues to promote the 'America First' policy and impose harsh tariffs on imports.",
            "pubDate": "2025-03-17T07:23:53.557580"
        },
        {
            "title": "UNO Minda, Amara Raja, Kaynes shares rise as PM Modi mentions need to 'restore' ties with China",
            "link": "https://www.moneycontrol.com/news/business/stocks/uno-minda-amara-raja-kaynes-shares-rise-as-pm-modi-mentions-need-to-restore-ties-with-china-12966240.html",
            "description": "\"Our relationship should remain just as strong in the future. It should continue to grow. Of course, differences are natural,\" PM Modi said about India-China tensions during the Lex Fridman podcast.",
            "pubDate": "2025-03-17T07:23:53.557733"
        },
        {
            "title": "Chart of the Day: The luxury housing boom",
            "link": "https://www.moneycontrol.com/news/business/markets/chart-of-the-day-the-luxury-housing-boom-12966267.html",
            "description": "High and Ultra High Net Worth Individuals are seeking to diversify their investments by parking their money in luxury real estate.",
            "pubDate": "2025-03-17T07:23:53.557868"
        },
        {
            "title": "SpiceJet shares jump 6% after airline announces fresh infusion of Rs 294 crore by promoter group",
            "link": "https://www.moneycontrol.com/news/business/spicejet-shares-jump-6-after-airline-announces-fresh-infusion-of-rs-294-crore-by-promoter-group-12966207.html",
            "description": "SpiceJet CEO Ajay Singh will dispose up to 3.15 crore equity shares of the company to help Spice Healthcare partially fund the allotment of equity shares through the conversion of warrants.",
            "pubDate": "2025-03-17T07:23:53.557934"
        },
        {
            "title": "SAMHI Hotels: Why is this hotel stock poised for re-rating?",
            "link": "https://www.moneycontrol.com/news/business/stocks/samhi-hotels-why-is-this-hotel-stock-poised-for-re-rating-12966176.html",
            "description": "After the strengthening of the balance sheet as well as the turnaround in operations post the Initial Public offer (IPO) in September 2023, SAMHI is now set to add/renovate inventory to boost growth.",
            "pubDate": "2025-03-17T07:23:53.557999"
        },
        {
            "title": "Rites: Consistency of new orders is a key factor to watch",
            "link": "https://www.moneycontrol.com/news/business/earnings/rites-consistency-of-new-orders-is-a-key-factor-to-watch-12966037.html",
            "description": "Margins on a declining trend due to a slowdown in execution and project delays",
            "pubDate": "2025-03-17T07:23:53.558066"
        },
        {
            "title": "HSBC upgrades Tata Motors to 'Buy', reduces target price to Rs 840/share",
            "link": "https://www.moneycontrol.com/news/business/stocks/hsbc-upgrades-tata-motors-to-buy-reduces-target-price-to-rs-840-share-12966036.html",
            "description": "Reduction in discounts and warranty costs at JLR is expected to drive margin expansion, supporting a potential re-rating of Tata Motors.",
            "pubDate": "2025-03-17T07:23:53.558133"
        },
        {
            "title": "Goldman Sachs sees rising competition amid cable and wire sector's growing attractiveness",
            "link": "https://www.moneycontrol.com/news/business/stocks/goldman-sachs-sees-rising-competition-amid-cable-and-wire-sector-s-growing-attractiveness-12966015.html",
            "description": "The brokerage has downgraded Polycab to 'Neutral', with a revised target price of Rs 5,005 from Rs 6,510 per share, while KEI Industries' is still on 'Neutral' but the target price has been slashed down to Rs 3,130 from Rs 3,780 per share.",
            "pubDate": "2025-03-17T07:23:53.558241"
        },
        {
            "title": "Live: US Fed rate decision, Trump's tariff measures to guide markets this week | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-us-fed-rate-decision-trump-s-tariff-measures-to-guide-markets-this-week-opening-bell-12966027.html",
            "description": "Nifty ended the last session below 22,400, breaking the 22,450 level, it had defended for five sessions, and slipped nearly 1% over the past week, with 35 of its 50 stocks closing in the red. However, Bank Nifty managed to stay above 48,000. This week, market movements will be influenced by the US Fed, FII activity, and tariff uncertainties. Meanwhile, the Aris Infra IPO is set to launch from March 20-25, though its price band has yet to be announced. This morning, global cues were mixed. US markets ended Friday overnight on a good note, but futures slipped overnight. Asian markets, meanwhile, started the day with good set of gains. Among stocks, watch out for IndusInd Bank, TCS, and Tata Motors in today's trading session. Catch Lovisha Darad in conversation with Kunal Rambhia—Fund Manager, The Streets (Technical) and Raj Vyas, VP - Research, Teji Mandi.",
            "pubDate": "2025-03-17T07:23:53.558308"
        },
        {
            "title": "Jefferies bites into Patanjali Foods, initiates coverage with 'buy' tag amid diversification",
            "link": "https://www.moneycontrol.com/news/business/stocks/jefferies-bites-into-patanjali-foods-initiates-coverage-with-buy-tag-amid-diversification-12966005.html",
            "description": "Jefferies expects Patanjali Foods to deliver high single-digit topline growth, coupled with margin expansion going ahead.",
            "pubDate": "2025-03-17T07:23:53.558374"
        },
        {
            "title": "IndusInd Bank shares jump 3% as RBI says bank is 'well-capitalized'",
            "link": "https://www.moneycontrol.com/news/business/stocks/indusind-bank-shares-in-focus-as-rbi-says-bank-well-capitalized-12965982.html",
            "description": "The RBI's statement follows concerns arising from recent developments related to the discrepancies found in IndusInd Bank's derivatives portfolio.",
            "pubDate": "2025-03-17T07:23:53.558438"
        },
        {
            "title": "KEC International shares gain more than 6% on orders win of Rs 1,267 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/kec-international-shares-in-focus-on-orders-win-of-rs-1-267-crore-12965885.html",
            "description": "KEC International Share Price | The Transmission & Distribution (T&D) business has secured NOAs/ Comfort letter for T&D projects in India and Americas including 800 kV HVDC & 765 kV Transmission line orders, from Power Grid Corporation of India.",
            "pubDate": "2025-03-17T07:23:53.558503"
        },
        {
            "title": "G R Infraprojects shares gain 2.4% on winning NHAI project worth Rs 4,262.78 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/g-r-infraprojects-shares-in-focus-on-winning-nhai-project-worth-rs-4-262-78-crore-12965886.html",
            "description": "G R Infraprojects Share Price | The company board of directors at its meeting held on March 7, 2025 declared the interim dividend of Rs 12.50 per equity share of face value of Rs 5 per equity share for the financial year 2024-25.",
            "pubDate": "2025-03-17T07:23:53.558566"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty off day's high; February WPI Inflation at 2.38%",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-17-03-2025-liveblog-12965964.html",
            "description": "Sensex Today | Stock Market LIVE Updates: BSE Midcap and smallcap indices up 0.5 percent each. Among sectors, except FMCG IT, all other sectoral indices are trading in the green with auto, metal, pharma up 0.5-1 percent. IndusInd Bank, HDFC Bank, BSE Limited, Bajaj Finserv, ICICI Bank are among most active shares on the NSE.",
            "pubDate": "2025-03-17T07:23:53.558644"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-65-12963931.html",
            "description": "Gold edged higher after rising through USD 3,000 an ounce on Friday, with investors weighing news the US government managed to avert a shutdown against persistent economic growth concerns. Oil prices rose for a second day thanks to the the stimulus pledge by the the world’s biggest importer.",
            "pubDate": "2025-03-17T07:23:53.558721"
        },
        {
            "title": "Trade Spotlight: How should you trade Gujarat Fluorochemicals, Bank of Baroda, United Spirits. EIH, Coromandel International, and others on March 17?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-gujarat-fluorochemicals-bank-of-baroda-united-spirits-eih-coromandel-international-and-others-on-march-17-12965947.html",
            "description": "The market might rebound in the upcoming sessions after a correction in the previous week, but there are doubts over the sustainability of the upmove. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-17T07:23:53.558787"
        },
        {
            "title": "Stocks to Watch Today: IndusInd Bank, Brigade, Maharashtra Seamless, GR Infraprojects, Shilpa Medicare, Alkem Labs, KEC International in focus on 17 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-indusind-bank-brigade-maharashtra-seamless-gr-infraprojects-shilpa-medicare-alkem-labs-kec-international-in-focus-on-17-march-12965943.html",
            "description": "Stocks to Watch on Mar 17: Stocks like Quality Power Electrical Equipments, Dr Reddy’s Laboratories, Tata Motors, Voltas, Tejas Networks, KPIT Technologies, Galaxy Surfactants, NTC Industries, 3M India, International Conveyors, Ksolves India, Zydus Lifesciences, and SpiceJet will be in focus on March 17.",
            "pubDate": "2025-03-17T07:23:53.558851"
        }
    ]
}