{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-30T13:48:19.848084",
    "items": [
        {
            "title": "Mahindra sets sight on renewable power, forms Ultrogen Hybren to focus on green energy and storage systems",
            "link": "https://www.moneycontrol.com/news/business/markets/mahindra-sets-sight-on-renewable-power-forms-ultrogen-hybren-to-focus-on-green-energy-and-storage-systems-12899828.html",
            "description": "Ultrogen Hybren will be a subsidiary of Mahindra Susten, a subsidiary of Mahindra Holdings (MHL), the company informed through an exchange filing on December 29. The company will aspire to be an Independent Power Producer (IPP).",
            "pubDate": "2024-12-30T02:31:44.173091"
        },
        {
            "title": "Sectors and stocks for January based on seasonality analysis",
            "link": "https://www.moneycontrol.com/news/business/markets/sectors-and-stocks-for-january-based-on-seasonality-analysis-12899812.html",
            "description": "Seasonality analysis is a powerful tool that helps traders and investors identify recurring patterns in stock, sector, and index performances.",
            "pubDate": "2024-12-30T02:31:44.173184"
        },
        {
            "title": "Trade Spotlight: How should you trade Jubilant Foodworks, Ipca Labs, Paytm, Welspun Corp, Campus Activewear, and others on December 30?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-jubilant-foodworks-ipca-labs-paytm-welspun-corp-campus-activewear-and-others-on-december-30-12899798.html",
            "description": "The market is expected to remain rangebound with a positive bias in the upcoming sessions. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-30T02:31:44.173260"
        },
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-3-12899783.html",
            "description": "Wall Street closed on a weak note last week, however, most Asian markets bucked the trend and moved higher on the penultimate trading day of 2024. Trends from the GIFT Nifty suggest a muted start for the domestic market.",
            "pubDate": "2024-12-30T03:04:12.545369"
        },
        {
            "title": "Live: Will Nifty scale to 24,000 in last 2 days of 2024? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-scale-to-24-000-in-last-2-days-of-2024-opening-bell-12899851.html",
            "description": "Frontline indices Sensex and Nifty managed to gain 1 percent each last week despite a thinly volume trade. A total of 32 Nifty stocks recorded gains last week, while Midcap index stayed flat. This week, macro-economic data, global cues, and FII flows will shape market movements. Majority of experts expect rangebound trade to continue this week as well, seeing Nifty's resistance at 24,000-24,200, with support placed around 23,650. This morning, global cues were mixed. US markets ended lower on Friday, while Asia Pacific markets started this morning on a mixed note. Among stocks in focus, watch out for JSW Energy, Utkarsh SFB, IOL Chemicals. Catch Lovisha Darad in conversation with Osho Krishan, Sr. Analyst - Technical & Derivative Research, Angel One and Sandip Agarwal - Fund Manager, Sowilo Investment Managers.",
            "pubDate": "2024-12-30T03:31:05.323942"
        },
        {
            "title": "Sensex, Nifty slip as auto, IT stocks drag in penultimate session of 2024; India VIX up 3%",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-slip-as-auto-it-stocks-drag-in-penultimate-session-of-2024-india-vix-up-3-12899843.html",
            "description": "The broader market displayed heightened volatility. While the midcap index ended 0.3 percent lower, the smallcap index slipped almost 0.5 percent.",
            "pubDate": "2024-12-30T04:24:06.964591"
        },
        {
            "title": "Ola Electric shares skid 3% after slew of high level exits continue; CMO, CTO resign",
            "link": "https://www.moneycontrol.com/news/business/markets/ola-electric-shares-skid-3-after-slew-of-high-level-exits-continue-cmo-cto-resign-12899866.html",
            "description": "Ola Electric has been making the headlines for a series of high-profile exits in recent months across its various business verticals. Several top executives of the company have rendered their resignations in 2024.",
            "pubDate": "2024-12-30T04:24:06.964683"
        },
        {
            "title": "Agri Picks Report December 30, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-30-2024-geojit-financial-services-12899880.html",
            "description": "According to Geojit Financial Services, The water level in 155 key reservoirs in the country fell to 135.404 billion cubic metres as of Thursday from 139.392 billion cubic metres on Dec.",
            "pubDate": "2024-12-30T04:24:06.964754"
        },
        {
            "title": "Welspun Living – Where comfort meets style",
            "link": "https://www.moneycontrol.com/news/business/stocks/welspun-living-where-comfort-meets-style-12899868.html",
            "description": "Rising contribution from emerging categories is expected to drive margins",
            "pubDate": "2024-12-30T05:09:23.796334"
        },
        {
            "title": "Star Cement, Ola Electric Mobility, Prestige Estates Projects | Stocks on Radar",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/star-cement-ola-electric-mobility-prestige-estates-projects-stocks-on-radar-12899930.html",
            "description": "UltraTech Cement acquires 8.3% stake in Star Cement for Rs 765.68 crore, from promoters.  \nOla Electric Mobility says Anshul Khandelwal resigns as Chief Marketing Officer, Suvonil Chatterjee quits as Chief Technology & Product Officer. Prestige Estates Projects to transfer 3 of its hospitality undertakings to subsidiary Prestige Hospitality Ventures for Rs 313 crore. Watch here for more details",
            "pubDate": "2024-12-30T05:29:34.562596"
        },
        {
            "title": "ICICI Prudential Life: Poised to deliver strong growth",
            "link": "https://www.moneycontrol.com/news/business/stocks/icici-prudential-life-poised-to-deliver-strong-growth-12899917.html",
            "description": "After 4-5 years of no growth and only margin expansion, ICICI Pru has delivered robust growth in the past four quarters",
            "pubDate": "2024-12-30T05:29:34.562688"
        },
        {
            "title": "IOL Chemicals surges 5% after board approves stock split",
            "link": "https://www.moneycontrol.com/news/business/markets/iol-chemicals-surges-5-after-board-approves-stock-split-12899932.html",
            "description": "Following the stock split, shareholders of IOL Chemicals will get five shares for each share they currently own. The stock split will also be the first ever for the company.",
            "pubDate": "2024-12-30T05:47:48.392224"
        },
        {
            "title": "Vakrangee rallies on partnership with Shriram Group for life insurance products",
            "link": "https://www.moneycontrol.com/news/business/markets/vakrangee-rallies-on-partnership-with-shriram-group-for-life-insurance-products-12900004.html",
            "description": "Shriram Life has over Rs 12,310 crore of AUM as on September 2024 and over 4.4 lakh individual policies sold in FY24. It is amongst the top 10 insurance players in terms of individual policies sold and amongst the top 5 in rural India.",
            "pubDate": "2024-12-30T06:58:14.834621"
        },
        {
            "title": "Greaves Cotton shares surge up to 12% after equity worth Rs 131 crore changes hands",
            "link": "https://www.moneycontrol.com/news/business/markets/greaves-cotton-shares-surge-up-to-12-after-equity-worth-rs-131-crore-changes-hands-12900198.html",
            "description": "Greaves Cotton has a market capitalisation of over Rs 7,200 crore, and the shares have doubled in 2024.",
            "pubDate": "2024-12-30T08:35:43.977888"
        },
        {
            "title": "Throwback 2024: How FPI flows and ownership changed in the year gone by",
            "link": "https://www.moneycontrol.com/news/business/markets/throwback-2024-how-fpi-flows-and-ownership-changed-in-the-year-gone-by-12899857.html",
            "description": "From the ups and downs of foreign investments through 2024, FPIs still ended the year as net buyers of Indian equities. The quantum of buying though, significantly less than the preceding year.",
            "pubDate": "2024-12-30T08:35:43.978066"
        },
        {
            "title": "Adani Enterprises stock zooms nearly 7% as brokerage gives Rs 3,801 target price",
            "link": "https://www.moneycontrol.com/news/business/markets/adani-enterprises-stock-emerges-top-nifty-50-gainer-zooms-nearly-7-on-brokerage-upgrade-12900197.html",
            "description": "Ventura Securities has set a two-year price target of Rs 3,801 for Adani Enterprises stock, translating into an upside potential of around 58 percent from Friday's closing price.",
            "pubDate": "2024-12-30T09:10:37.808921"
        },
        {
            "title": "Suzlon Energy stocks recovering from lows following overturning of tax penalty",
            "link": "https://www.moneycontrol.com/news/business/stocks/suzlon-energy-stocks-recovering-from-lows-following-overturning-of-tax-penalty-12900216.html",
            "description": "Shares have gained over 60 percent in 2024, despite a recent correction from its peak of Rs 86",
            "pubDate": "2024-12-30T09:45:41.711857"
        },
        {
            "title": "Adani Enterprises to sell up to 13% the Adani Wilmar, fully exit the platform",
            "link": "https://www.moneycontrol.com/news/business/markets/adani-enterprises-to-sell-up-to-13-the-adani-wilmar-fully-exit-the-platform-12900278.html",
            "description": "Adani Enterprises, Adani Commodities LLP and Wilmar International subsidiary Lence have entered into an agreement, as per which Lence will acquire equity shares of Adani Wilmar held by ACL, said a company statement.",
            "pubDate": "2024-12-30T10:08:25.691700"
        },
        {
            "title": "Live: Sensex, Nifty fall 1% from day's high in a choppy session | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-sensex-nifty-fall-1-from-day-s-high-in-a-choppy-session-closing-bell-12900269.html",
            "description": "Sensex, Nifty fall over  1% in a choppy session. Bank Nifty falls over 2% from day's high. Midcaps outperform, smallcaps bleed. Auto, metal, realty stocks top underperformers. Nifty IT, pharma indices buck trend. India VIX jumps over 6% to 14 level. Join Lovisha Darad and Yatin Mota as they discuss stocks on their radar.",
            "pubDate": "2024-12-30T10:08:25.691807"
        },
        {
            "title": "Adani Enterprises to exit Wilmar JV, invest proceeds in 'core infrastructure'",
            "link": "https://www.moneycontrol.com/news/business/markets/adani-enterprises-to-sell-up-to-13-percent-in-adani-wilmar-exit-the-platform-12900278.html",
            "description": "Adani Enterprises, Adani Commodities LLP and Wilmar International subsidiary Lence have entered into an agreement, as per which Lence will acquire equity shares of Adani Wilmar held by ACL, said a company statement.",
            "pubDate": "2024-12-30T10:31:29.499742"
        },
        {
            "title": "Mazagon Dock bags Rs 1,990 crore Defence Ministry contract to enhance submarines' endurance",
            "link": "https://www.moneycontrol.com/news/business/markets/mazagon-dock-bags-defence-ministry-contract-for-submarines-12900362.html",
            "description": "The project involves construction of AIP-Plug and its integration, and will enhance the endurance of conventional submarines, contributing towards 'Aatmanirbhar Bharat'.",
            "pubDate": "2024-12-30T12:23:07.357377"
        },
        {
            "title": "Lupin acquires Huminsulin from Eli Lilly to enhance diabetes care portfolio",
            "link": "https://www.moneycontrol.com/news/business/markets/lupin-acquires-huminsulin-from-eli-lilly-to-enhance-diabetes-care-portfolio-12900424.html",
            "description": "Lupin had been marketing Huminsulin through an existing agreement with Lilly India before proceeding to acquire the brand. Huminsulin is used in the treatment of Type 1 and Type 2 diabetes mellitus.",
            "pubDate": "2024-12-30T13:48:19.309659"
        }
    ]
}