{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-27T03:42:05.948049",
    "items": [
        {
            "title": "Nazara acquires another 10.26% in subsidiary Absolute Sports for Rs 72.73 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/nazara-acquires-another-10-26-in-subsidiary-absolute-sports-for-rs-72-73-crore-12898553.html",
            "description": "Nazara has a share purchase agreement (SPA), dated September 18, 2024 with subsidiary Absolute Sports and founding shareholders Porush Jain and Srinivas Cuddapah for the acquisition of 19.35% stake.",
            "pubDate": "2024-12-27T02:29:56.977834"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a gap-up start; US markets flat, Asia trades higher",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-27-12-2024-liveblog-12898541.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street closed mixed on Thursday and the U.S. benchmark Treasury yield eased after scaling the highest level since May in light, directionless post-Christmas trading. The Dow Jones Industrial Average edged up 0.07% to 43,325.80, the S&P 500 fell 0.04% to 6,037.59 and the Nasdaq Composite fell 0.05% to 20,020.357.",
            "pubDate": "2024-12-27T02:29:56.977950"
        },
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-2-12898003.html",
            "description": "Wall Street closed mixed on Thursday and the U.S. benchmark Treasury yield eased after scaling the highest level since May in light, directionless post-Christmas trading. The GIFT Nifty is trading higher, indicating a strong start for the day.",
            "pubDate": "2024-12-27T02:29:56.978077"
        },
        {
            "title": "Trade Spotlight: How should you trade InterGlobe Aviation, Sun Pharma, Himadri Speciality Chemical, Devyani International, and others on December 27?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-interglobe-aviation-sun-pharma-himadri-speciality-chemical-devyani-international-and-others-on-december-27-12898526.html",
            "description": "The benchmark Nifty 50 needs to break the rangebound trade to establish a firm direction for the January series starting on December 27. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-27T02:29:56.978174"
        },
        {
            "title": "Stocks to Watch Today: DAM Capital, Transrail Lighting, Mamata Machinery, Gensol, Power Mech, SKF India, Aarti Pharmalabs in focus on 27 December",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-dam-capital-transrail-lighting-mamata-machinery-gensol-power-mech-skf-india-aarti-pharmalabs-in-focus-on-27-december-12898493.html",
            "description": "Stocks To Watch Today, Dec 27: Stocks like IndusInd Bank, Gensol Engineering, NHPC, Gujarat Fluorochemicals, HMA Agro Industries, Dixon Technologies, RBL Bank, Dhani Services, Lemon Tree Hotels, EPACK Durable, One Mobikwik Systems, SG Mart, Sanathan Textiles, and Concord Enviro Systems will also be in focus on December 27.",
            "pubDate": "2024-12-27T02:29:56.978264"
        },
        {
            "title": "A defence stock with reasonable valuation",
            "link": "https://www.moneycontrol.com/news/business/earnings/a-defence-stock-with-reasonable-valuation-12898596.html",
            "description": "BEL could get rerated on the back of robust order book and earnings visibility",
            "pubDate": "2024-12-27T03:42:04.807847"
        },
        {
            "title": "Live: Is Nifty set to begin Jan series on a muted note? | IndusInd Bank, NHPC in focus |Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-is-nifty-set-to-begin-jan-series-on-a-muted-note-indusind-bank-nhpc-in-focus-opening-bell-12898601.html",
            "description": "Frontline indices Sensex and Nifty were largely unchanged in a volatile session on the day of December monthly expiry. India VIX, the volatility gauge jumped over 6 percent in the last session. Auto and pharma stocks lent support to overall market breadth, while metals and banks tanked. Experts now eye Nifty to see a resistance of 23,850 and support placed around 23,650. This morning, global cues were mixed. US markets ended flat overnight in a thin trade. Meanwhile, Asia-Pacific markets were also mixed this morning as investors assessed Japanese inflation print and China's industrial profit data. Among stocks in focus, watch out for IndusInd Bank, NHPC, Jubilant Foodworks. Catch Lovisha Darad in conversation with Raja Venkatraman, Co-Founder, NeoTrader & Trading Influencer and Nikhil Oswal, Founder and CIO, Finterest Capital.",
            "pubDate": "2024-12-27T03:42:04.807935"
        }
    ]
}