{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-20T02:33:16.290384",
    "items": [
        {
            "title": "Zodiac Energy shares in focus on winning first international rooftop order",
            "link": "https://www.moneycontrol.com/news/business/stocks/zodiac-energy-shares-in-focus-on-winning-first-international-rooftop-order-12894186.html",
            "description": "Zodiac Energy Share Price | The order included design, engineering, supplying, installing, testing, and commissioning of grid tied 2 MWprRooftop solar system turnkey with battery energy storage system (BESS) basis for M/s Strongpak Limited (Zambia-Africa) at the aggregate cost of USD 720,626.00.",
            "pubDate": "2024-12-20T02:33:09.526657"
        },
        {
            "title": "KPI Green Energy shares in focus on signing MoU with Rajasthan govt",
            "link": "https://www.moneycontrol.com/news/business/markets/kpi-green-energy-shares-in-focus-on-signing-mou-with-rajasthan-govt-12894184.html",
            "description": "KPI Green Energy Share Price | Earlier in this month, the company received the largest-ever order for setting up of 300 MWAC (405 MWDC) Ground mounted Solar PV plant including Operation & Maintenance (O&M) services on comprehensive basis for period of 05 years from Coal India worth Rs 13.11 billion.",
            "pubDate": "2024-12-20T02:33:09.526740"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a negative start; US, Asian markets mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-20-12-2024-liveblog-12894340.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks ended little changed on Thursday, giving up an initial rebound from a sharp drop in the prior session after the Federal Reserve forecast fewer-than-expected interest rate cuts and higher inflation next year. The Dow Jones Industrial Average rose 15.37 points, or 0.04%, to 42,342.24, the S&P 500 lost 5.08 points, or 0.09%, to 5,867.08 and the Nasdaq Composite lost 19.92 points, or 0.10%, to 19,372.77.",
            "pubDate": "2024-12-20T02:33:09.526813"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-14-12894163.html",
            "description": "The GIFT Nifty is indicating a negative start for the day.",
            "pubDate": "2024-12-20T02:33:09.526888"
        },
        {
            "title": "Trade Spotlight: How should you trade Lupin, Muthoot Finance, Trent, HEG, Tube Investments, and others on Friday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-lupin-muthoot-finance-trent-heg-tube-investments-and-others-on-friday-12894328.html",
            "description": "After the significant weakness over the last four days, the market may see consolidative and rangebound trading with a slightly negative bias. Below are some trading ideas for the near term:",
            "pubDate": "2024-12-20T02:33:09.526972"
        },
        {
            "title": "Stock Radar: IGI India, Exide, Amara Raja, BASF, Zodiac Energy, KPI Green Energy, GE Vernova in focus on Friday",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-igi-india-exide-amara-raja-basf-zodiac-energy-kpi-green-energy-ge-vernova-in-focus-on-friday-12894325.html",
            "description": "Stocks To Watch, Dec 20: Stocks like Hindustan Construction Company, Dhanlaxmi Bank, Tolins Tyres, InterGlobe Aviation, Zodiac Energy, AU Small Finance Bank, HG Infra Engineering, Hyundai Motor India, Bharti Airtel, New India Assurance Company, and AGS Transact Technologies willl also be in focus on December 20.",
            "pubDate": "2024-12-20T02:33:09.527044"
        }
    ]
}