{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-10T05:39:00.459519",
    "items": [
        {
            "title": "Stocks to Watch Today: Premier Energies, Capri Global, Protean eGov Tech, ITD Cementation, Jana Small Finance Bank, IRB Infra, Nibe in focus on 10 June",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-premier-energies-capri-global-protean-egov-tech-itd-cementation-jana-small-finance-bank-irb-infra-nibe-in-focus-on-10-june-13106766.html",
            "description": "Stocks to watch, 10 June: Stocks like Veedol Corporation, AstraZeneca Pharma India, Force Motors, Geojit Financial Services, Tech Mahindra, ITD Cementation India, Protean eGov Technologies, Nibe, IRB Infrastructure Developers, Jana Small Finance Bank, Capri Global Capital, and Premier Energies will be in focus on June 10.",
            "pubDate": "2025-06-10T03:11:20.511210"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a firm start; Premier Energies, RITES, Capri Global in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-10-06-2025-liveblog-13106760.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Veedol Corporation, AstraZeneca Pharma India, Force Motors, Geojit Financial Services, Tech Mahindra, ITD Cementation India, Protean eGov Technologies, Nibe, IRB Infrastructure Developers, Jana Small Finance Bank, Capri Global Capital, and Premier Energies will be in focus on June 10.",
            "pubDate": "2025-06-10T03:11:20.511293"
        },
        {
            "title": "Market participants raise concerns over BSE's liquidity-based fee structure; exchange says compliant with SEBI norms",
            "link": "https://www.moneycontrol.com/news/business/markets/market-participants-raise-concerns-over-bse-s-liquidity-based-fee-structure-exchange-says-compliant-with-sebi-norms-13106422.html",
            "description": "Some participants have raised concerns about BSEs fee structure based on liquidity of the stocks, calling it discriminatory against X, XT category of stocks and adding high cost of transactions for investors of such category of shares. BSE denied the allegations and said this practice is there since 2016, to discourage investors from investing in such low liquid stocks.",
            "pubDate": "2025-06-10T03:11:20.511362"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-110-13105359.html",
            "description": "The Foreign institutional investors (FIIs) continued their buying on second day as they purchased equities worth Rs 1,992 crore on June 9, while Domestic institutional investors (DIIs) also extended their buying on the 15th day as they bought equities of Rs 3,503 crore on the same day.",
            "pubDate": "2025-06-10T03:11:20.511434"
        },
        {
            "title": "Asian stocks rise on US-China talks, yen declines",
            "link": "https://www.moneycontrol.com/news/business/asian-stocks-to-advance-as-us-china-talks-continue-13106755.html",
            "description": "Shares in Hong Kong and China traded within a tight range, while US equity-index futures advanced.",
            "pubDate": "2025-06-10T03:11:20.511501"
        },
        {
            "title": "Trade Spotlight: How should you trade Oracle Financial, Praj Industries, Bank of India, Trent, NMDC, Zensar Technologies and others on June 10?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-oracle-financial-praj-industries-bank-of-india-trent-nmdc-zensar-technologies-and-others-on-june-10-13106733.html",
            "description": "The trend is expected to remain in favour of the bulls, despite intermittent profit booking in the upcoming sessions. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-06-10T03:11:20.511567"
        },
        {
            "title": "Grasim Industries Shares Surge 4.55% Amid High Volume Trading",
            "link": "https://www.moneycontrol.com/news/business/stocks/grasim-industries-shares-surge-4-55-amid-high-volume-trading-alpha-article-13107181.html",
            "description": "With Grasim Industries' shares currently trading at Rs 2727.30, the company's stock performance today reflects a notable increase driven by high volume, amid existing bearish sentiments.",
            "pubDate": "2025-06-10T05:18:13.003042"
        },
        {
            "title": "Interglobe Aviation-Indigo Shares Decline by 2.05% in Today's Session",
            "link": "https://www.moneycontrol.com/news/business/stocks/interglobe-aviation-indigo-shares-decline-by-2-05-in-today-s-session-alpha-article-13107207.html",
            "description": "With the stock's current price at Rs 5578.00, Interglobe Aviation is navigating a dynamic market environment, influenced by both its financial performance and broader investor sentiment.",
            "pubDate": "2025-06-10T05:18:13.003123"
        },
        {
            "title": "Oracle Financial Services Software Shares Rise by 2.33% in Today's Trading",
            "link": "https://www.moneycontrol.com/news/business/stocks/oracle-financial-services-software-shares-rise-by-2-33-in-today-s-trading-alpha-article-13107036.html",
            "description": "With the shares of Oracle Financial Services Software currently trading at Rs 9375.00, the company has exhibited a positive trend, supported by strong financial metrics and optimistic investor sentiment.",
            "pubDate": "2025-06-10T05:18:13.003262"
        },
        {
            "title": "Phoenix Mills Shares Gain Amid High Trading Volumes",
            "link": "https://www.moneycontrol.com/news/business/stocks/phoenix-mills-shares-gain-amid-high-trading-volumes-alpha-article-13107042.html",
            "description": "With the stock's price reacting to high trading volumes and a positive shift, Phoenix Mills remains an interesting stock to watch, influenced by its financial health and market sentiment.",
            "pubDate": "2025-06-10T05:18:13.003327"
        },
        {
            "title": "Hindustan Aeronautics Shares Rise by 2.22% in Today's Trading",
            "link": "https://www.moneycontrol.com/news/business/stocks/hindustan-aeronautics-shares-rise-by-2-22-in-today-s-trading-alpha-article-13107051.html",
            "description": "With the current price at Rs 5,119.70, Hindustan Aeronautics' stock performance reflects positive market movement, supported by its inclusion in key indices and strong financial metrics.",
            "pubDate": "2025-06-10T05:18:13.003411"
        },
        {
            "title": "Accumulate Balaji Amines; target of Rs 1612: Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-balaji-amines-target-of-rs-1612-deven-choksey-13107158.html",
            "description": "Deven Choksey recommended accumulate rating on Balaji Amines with a target price of Rs 1612 in its research report dated June 10, 2025.",
            "pubDate": "2025-06-10T05:18:13.003492"
        },
        {
            "title": "GE Vernova TD India Shares Surge 2.22% in Today's Trading",
            "link": "https://www.moneycontrol.com/news/business/stocks/ge-vernova-td-india-shares-surge-2-22-in-today-s-trading-alpha-article-13107094.html",
            "description": "GE Vernova TD India's stock performance reflects its position within the NIFTY MIDCAP 150, with today's surge indicating positive market sentiment.",
            "pubDate": "2025-06-10T05:18:13.003556"
        },
        {
            "title": "Hindustan Unilever Stock Among Top 10 Losers on Nifty 50 in Today's Trading Session",
            "link": "https://www.moneycontrol.com/news/business/stocks/hindustan-unilever-stock-among-top-10-losers-on-nifty-50-in-today-s-trading-session-alpha-article-13107109.html",
            "description": "Hindustan Unilever's consistent financial performance, coupled with its position in the Nifty 50, underscores its significance in the Indian market.",
            "pubDate": "2025-06-10T05:18:13.003621"
        },
        {
            "title": "KPIT Technologies Shares Rise 2.32% During Today's Trading Session",
            "link": "https://www.moneycontrol.com/news/business/stocks/kpit-technologies-shares-rise-2-32-during-today-s-trading-session-alpha-article-13107111.html",
            "description": "With the stock currently priced at Rs 1,384.80, KPIT Technologies' recent performance and financial health provide a detailed snapshot for investors tracking its trajectory within the NIFTY MIDCAP 150 index.",
            "pubDate": "2025-06-10T05:18:13.003685"
        },
        {
            "title": "Jana Small Finance Bank shares up 5% on seeking RBI nod for universal bank",
            "link": "https://www.moneycontrol.com/news/business/markets/jana-small-finance-bank-shares-up-5-on-seeking-rbi-nod-for-universal-bank-13107004.html",
            "description": "Jana Small Finance Bank share price: The shares of the lender opened at Rs 549 apiece, the highest level seen by the stock in nearly 8 months.",
            "pubDate": "2025-06-10T05:18:13.003812"
        },
        {
            "title": "DII investments cross Rs 3 lakh crore in 2025 so far",
            "link": "https://www.moneycontrol.com/news/business/mutual-funds/dii-investments-cross-rs-3-lakh-crore-in-2025-so-far-powered-by-mfs-banks-13106898.html",
            "description": "DIIs pour over Rs3 lakh crore into equities in 2025 so far, with momentum gaining pace. Buoyed by retail and mutual fund inflows, market sentiment sees a strong revival.",
            "pubDate": "2025-06-10T05:18:13.003878"
        },
        {
            "title": "Should investors consider CDSL after a sharp rally?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/should-investors-consider-cdsl-after-a-sharp-rally-13106894.html",
            "description": "The duopolistic market structure with entry barriers and an asset-light business model will continue to aid growth of free cash flows",
            "pubDate": "2025-06-10T05:18:13.003945"
        },
        {
            "title": "Defence stocks call for optimism -- with a bit of caution",
            "link": "https://www.moneycontrol.com/news/business/earnings/defence-stocks-call-for-optimism-with-a-bit-of-caution-13106880.html",
            "description": "Valuations continue to be strong, but the sector remains vulnerable to poor project execution and delays",
            "pubDate": "2025-06-10T05:18:13.004014"
        },
        {
            "title": "Coforge, Mphasis, other IT shares rise up to 4% on optimism over US-China trade talks",
            "link": "https://www.moneycontrol.com/news/business/markets/coforge-mphasis-other-it-shares-rise-up-to-4-on-optimism-over-us-china-trade-talks-13107069.html",
            "description": "IT stocks: Coforge shares jumped nearly 4% after JP Morgan maintained an 'overweight' rating on the stock, with a target price of Rs 2,080 per share.",
            "pubDate": "2025-06-10T05:38:59.319029"
        },
        {
            "title": "Tata Investment Corporation shares rise by 2.08% in today's trading session",
            "link": "https://www.moneycontrol.com/news/business/stocks/tata-investment-corporation-shares-rise-by-2-08-in-today-s-trading-session-alpha-article-13107228.html",
            "description": "With today's price increase, Tata Investment Corporation reflects a noteworthy market presence and positive investor activity as part of the NIFTY MIDCAP 150.",
            "pubDate": "2025-06-10T05:38:59.319124"
        }
    ]
}