{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-23T03:17:59.093932",
    "items": [
        {
            "title": "Market Braces For Knee-Jerk Reaction As U.S. Strikes Iran Nuclear Sites| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/market-braces-for-knee-jerk-reaction-as-u-s-strikes-iran-nuclear-sites-opening-bell-live-13162042.html",
            "description": "Indian market is poised for a weak open as US bombs three nuclear sites at Iran. Dow Futures are lower, Asian markets are trading with cuts while the GIFT Nifty is hinting at a weak start for the Indian market. Meanwhile, On Friday the Nifty 50 gained solid strength after a three-day consolidation and rallied 1.29 percent, reviving weak sentiment alongside a falling VIX. Despite the recovery, the index remains within the broad range of 24,450–25,200 for several weeks now. As long as the index trades below 25,200, and geopolitical tensions in the Middle East—which influence oil prices—persist, consolidation and mild correction within a range-bound setup may continue. Key support levels remain at 24,700, followed by the 24,500–24,450 zone. A fall below this crucial support zone may trigger a forceful attack from bears, while a decisive and sustainable close above 25,200 can open the door for strong bullish action. Catch Nandita Khemka in conversation with market expert Ajay Bagga, Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Siddarth Bhamre, Institutional Research Head - ACMIIL (Asit C Mehta Investment Interrmediates Ltd). Catch Nandita Khemka in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Siddarth Bhamre, Institutional Research Head - ACMIIL (Asit C Mehta Investment Interrmediates Ltd)",
            "pubDate": "2025-06-23T03:17:51.380198"
        },
        {
            "title": "Sensex, Nifty set for weak start as rising US-Israel-Iran tensions jolt sentiment; crude oil at 5-month high",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-set-for-weak-start-as-rising-us-israel-iran-tensions-jolt-sentiment-crude-oil-at-5-month-high-13161937.html",
            "description": "In the previous session, the frontline indices ended a three-day losing streak, rising over one percent amid broad-based buying across sectors.",
            "pubDate": "2025-06-23T03:17:51.380287"
        },
        {
            "title": "Granules India shares in focus after USFDA issues one observation to Hyderabad units",
            "link": "https://www.moneycontrol.com/news/business/markets/granules-india-shares-in-focus-after-usfda-issues-one-observation-to-hyderabad-units-13159916.html",
            "description": "Granules India Share Price | The share touched a 52-week high of Rs 724.55 and a 52-week low of Rs 412.05 on 02 September, 2024 and 07 April, 2025, respectively.",
            "pubDate": "2025-06-23T03:17:51.380364"
        },
        {
            "title": "Bharat Electronics shares in focus on orders win worth Rs 585 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/bharat-electronics-shares-in-focus-on-orders-win-worth-rs-585-crore-13159917.html",
            "description": "Bharat Electronics Share Price | The share price will remain in focus today after winning additional orders worth Rs 585 crore for fire control and sighting system for missiles, communication equipment, jammers, spares, services etc.",
            "pubDate": "2025-06-23T03:17:51.380456"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty hints a weak start; US, Asian markets fall amid rising Middle-East conflict",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-23-06-2025stock-market-live-updates-gift-nifty-hints-a-weak-start-us-asian-markets-fall-amid-rising-middle-east-conflict-liveblog-13161906.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  The Dow Jones Industrial Average rose 35.16 points, or 0.08%, to 42,206.82, the S&P 500 lost 13.03 points, or 0.22%, to 5,967.84 and the Nasdaq Composite lost 98.86 points, or 0.51%, to 19,447.41. For the week, the Dow was little changed, the S&P 500 was down 0.2% and the Nasdaq was up 0.2%.",
            "pubDate": "2025-06-23T03:17:51.380530"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-119-13151928.html",
            "description": "The Foreign institutional investors (FIIs) extended their buying on fourth consecutive day on June 20 as they bought equities worth Rs 7,940 crore. On the other hand, Domestic institutional investors (DIIs) turned net sellers as they sold equities of Rs 3,049 crore on the same day.",
            "pubDate": "2025-06-23T03:17:51.380604"
        },
        {
            "title": "Stocks to Watch Today: Zen Technologies, NLC India, Bajel Projects, Bharat Electronics, Granules India, Waaree Renewable in focus on 23 June",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-zen-technologies-nlc-india-bajel-projects-bharat-electronics-granules-india-waaree-renewable-in-focus-on-23-june-13161560.html",
            "description": "Stocks to watch, 23 June: Stocks like Granules India, Waaree Renewable Technologies,Signature Global (India), Zen Technologies, NLC India, Bajel Projects, Bharat Electronics, Bank of India, Bandhan Bank, CEAT, and LT Foods will be in focus on June 23.",
            "pubDate": "2025-06-23T03:17:51.380675"
        },
        {
            "title": "Trade Spotlight: How should you trade Indus Towers, Kotak Mahindra Bank, NRB Bearings, ICICI Lombard, KFin Technologies, M&M, and others on June 23?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-indus-towers-kotak-mahindra-bank-nrb-bearings-icici-lombard-kfin-technologies-m-m-and-others-on-june-23-13161465.html",
            "description": "The sustainability of Friday's gains is the key factor to watch in the upcoming sessions, as the Iran-Israel conflict and global cues could lead to volatility and consolidation in near term. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-06-23T03:17:51.380742"
        }
    ]
}