{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-20T05:29:06.458979",
    "items": [
        {
            "title": "Zodiac Energy shares in focus on winning first international rooftop order",
            "link": "https://www.moneycontrol.com/news/business/stocks/zodiac-energy-shares-in-focus-on-winning-first-international-rooftop-order-12894186.html",
            "description": "Zodiac Energy Share Price | The order included design, engineering, supplying, installing, testing, and commissioning of grid tied 2 MWprRooftop solar system turnkey with battery energy storage system (BESS) basis for M/s Strongpak Limited (Zambia-Africa) at the aggregate cost of USD 720,626.00.",
            "pubDate": "2024-12-20T02:33:09.526657"
        },
        {
            "title": "KPI Green Energy shares in focus on signing MoU with Rajasthan govt",
            "link": "https://www.moneycontrol.com/news/business/markets/kpi-green-energy-shares-in-focus-on-signing-mou-with-rajasthan-govt-12894184.html",
            "description": "KPI Green Energy Share Price | Earlier in this month, the company received the largest-ever order for setting up of 300 MWAC (405 MWDC) Ground mounted Solar PV plant including Operation & Maintenance (O&M) services on comprehensive basis for period of 05 years from Coal India worth Rs 13.11 billion.",
            "pubDate": "2024-12-20T02:33:09.526740"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a negative start; US, Asian markets mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-20-12-2024-liveblog-12894340.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks ended little changed on Thursday, giving up an initial rebound from a sharp drop in the prior session after the Federal Reserve forecast fewer-than-expected interest rate cuts and higher inflation next year. The Dow Jones Industrial Average rose 15.37 points, or 0.04%, to 42,342.24, the S&P 500 lost 5.08 points, or 0.09%, to 5,867.08 and the Nasdaq Composite lost 19.92 points, or 0.10%, to 19,372.77.",
            "pubDate": "2024-12-20T02:33:09.526813"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-14-12894163.html",
            "description": "The GIFT Nifty is indicating a negative start for the day.",
            "pubDate": "2024-12-20T02:33:09.526888"
        },
        {
            "title": "Trade Spotlight: How should you trade Lupin, Muthoot Finance, Trent, HEG, Tube Investments, and others on Friday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-lupin-muthoot-finance-trent-heg-tube-investments-and-others-on-friday-12894328.html",
            "description": "After the significant weakness over the last four days, the market may see consolidative and rangebound trading with a slightly negative bias. Below are some trading ideas for the near term:",
            "pubDate": "2024-12-20T02:33:09.526972"
        },
        {
            "title": "Stock Radar: IGI India, Exide, Amara Raja, BASF, Zodiac Energy, KPI Green Energy, GE Vernova in focus on Friday",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-igi-india-exide-amara-raja-basf-zodiac-energy-kpi-green-energy-ge-vernova-in-focus-on-friday-12894325.html",
            "description": "Stocks To Watch, Dec 20: Stocks like Hindustan Construction Company, Dhanlaxmi Bank, Tolins Tyres, InterGlobe Aviation, Zodiac Energy, AU Small Finance Bank, HG Infra Engineering, Hyundai Motor India, Bharti Airtel, New India Assurance Company, and AGS Transact Technologies willl also be in focus on December 20.",
            "pubDate": "2024-12-20T02:33:09.527044"
        },
        {
            "title": "Can Accenture's better than expected earnings usher optimism for IT stocks?",
            "link": "https://www.moneycontrol.com/news/business/markets/can-accenture-s-better-than-expected-earnings-usher-optimism-for-it-stocks-12894348.html",
            "description": "Following Accenture's quarterly revenue beat, ADRs of Indian players Infosys and Wipro, listed on the NYSE jumped 2-3 percent overnight, suggesting a potential upside for Indian IT stocks in today's trade.",
            "pubDate": "2024-12-20T03:02:43.809441"
        },
        {
            "title": "Has the Fed’s hawkish turn changed the Indian stock market outlook?",
            "link": "https://www.moneycontrol.com/news/opinion/has-the-fed-s-hawkish-turn-changed-the-indian-stock-market-outlook-12894393.html",
            "description": "Despite retail investor support through mutual funds as well as directly in equities, fundamentals will need to show signs of improvement",
            "pubDate": "2024-12-20T03:42:24.267146"
        },
        {
            "title": "Live: Nifty Set For Worst Weekly Performance In 3 Months| IT Stocks In Focus| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-set-for-worst-weekly-performance-in-3-months-it-stocks-in-focus-opening-bell-12894380.html",
            "description": "Indian benchmark indices, Sensex and Nifty, tumbled over 1% on December 19, marking their fourth consecutive session of decline, as global market weakness weighed heavily on investor sentiment. The downturn followed the US Federal Reserve’s cautious outlook on rate cuts, which dampened optimism. The Fed now forecasts only two rate cuts in 2025, down from its previous projection of four, a revision that unsettled markets worldwide. At the close of trading, the Sensex dropped 1.2%, shedding 964 points to settle at 79,218, while the Nifty fell 1.02%, losing 247.6 points to end at 23,951.25. In the broader market, the BSE MidCap and SmallCap indices saw modest declines of 0.3% each. This morning global cues are mixed with Dow snapping its 10-day losing streak and the GIFT Nifty indicating another weak open for our markets. IT stocks will be in focus post Accenture’s results. Catch Nandita Khemka in conversation with Raja Venkatraman, Co-Founder NeoTrader and Mihir Vora, Chief Investment Officer, Trust Mutual Fund",
            "pubDate": "2024-12-20T03:42:24.267231"
        },
        {
            "title": "Agri Picks Report December 20, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-20-2024-geojit-financial-services-12894411.html",
            "description": "According to Geojit Financial Services, The Securities and Exchange Board of India has extended the suspension of derivatives trade in wheat, chana, moong,paddy (non-basmati), mustard seeds and its derivatives, soya bean and crude palm oil till Jan 1, the regulator said in a release on Wednesday.",
            "pubDate": "2024-12-20T03:57:23.038403"
        },
        {
            "title": "Amber Enterprises stock rises 2% after Rs 210 crore block deal",
            "link": "https://www.moneycontrol.com/news/business/markets/amber-enterprises-stock-rises-2-after-rs-210-crore-block-deal-12894436.html",
            "description": "Around  3.45 lakh shares of Amber Enterprises, making up a one percent stake changed hands in the block deal window.",
            "pubDate": "2024-12-20T04:18:45.948208"
        },
        {
            "title": "Ventive Hospitality: Should you check into this hotel IPO?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/ventive-hospitality-should-you-check-into-this-hotel-ipo-12894351.html",
            "description": "Ventive Hospitality IPO comes at a time when the hotel industry is sustaining the up-cycle witnessed post the COVID-19 pandemic. With a valuation discount to comparable players, it is a good bet on the booming hotel space.",
            "pubDate": "2024-12-20T04:36:04.122319"
        },
        {
            "title": "Nifty, Sensex extend fall to 5th session amid volatility; IT stocks see profit booking",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-extend-fall-to-5th-session-amid-volatility-it-stocks-see-profit-booking-12894385.html",
            "description": "India VIX, a barometer to asses market anxiety, flared up almost 7 percent to cross the 15 levels",
            "pubDate": "2024-12-20T04:45:39.938339"
        },
        {
            "title": "MTAR Tech share soars 6% after Rs 226 crore order wins",
            "link": "https://www.moneycontrol.com/news/business/markets/mtar-tech-share-soars-6-after-rs-226-crore-order-wins-12894456.html",
            "description": "MTAR Tech remains optimistic about growth in its clean energy and aerospace verticals, anticipating significant orders in both the segments going forward.",
            "pubDate": "2024-12-20T04:53:25.079513"
        },
        {
            "title": "This week’s tactical pick is a unique play on health insurance industry",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/this-week-s-tactical-pick-is-a-unique-play-on-health-insurance-industry-12894430.html",
            "description": "Medi Assist has demonstrated the ability to acquire companies in related businesses, successfully integrate them, and scale them up.",
            "pubDate": "2024-12-20T04:53:25.079604"
        },
        {
            "title": "Stock Market Alert: Exide, IndiGo, and Amara Raja | Stocks to Watch NOW | December 20",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/stock-market-alert-exide-indigo-and-amara-raja-stocks-to-watch-now-december-20-12894499.html",
            "description": "In today's market highlights, Hindustan Construction Company successfully raised ₹600 crore through a Qualified Institutional Placement (QIP), attracting prominent investors like Citigroup and Societe Generale. Amara Raja Energy & Mobility will supply AMARON AGM batteries to Hyundai Motor India for its domestic product lineup under an existing procurement agreement. Exide Industries' subsidiary, Exide Energy Solutions, has partnered with Hyundai Motor India for the production and supply of EV battery cells. Meanwhile, InterGlobe Aviation's board has approved a $43 million loan to its subsidiary, InterGlobe Aviation Financial Services IFSC. Zodiac Energy secured its first international rooftop solar order worth $720,626 for a 2 MWp system in Zambia. Additionally, Bharti Airtel prepaid ₹3,626 crore to clear its 2016 spectrum liabilities, contributing to a total prepayment of ₹28,320 crore in spectrum dues for 2024. Stay tuned for all the top updates impacting these stocks today!",
            "pubDate": "2024-12-20T05:29:05.789572"
        }
    ]
}