{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-01-03T06:40:38.579603",
    "items": [
        {
            "title": "Short Call: Passenger vehicles in driving seat as two-wheelers hit the brakes; Signature Global, Eicher Motors in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/passenger-vehicles-in-driving-seat-as-two-wheelers-hit-the-brakes-signature-global-eicher-motors-in-focus-12902499.html",
            "description": "“The stock market is a device to transfer money from the impatient to the patient,\" - Warren Buffett",
            "pubDate": "2025-01-03T03:42:19.876930"
        },
        {
            "title": "Live: Can Nifty extend gains to 24,800? | DMart, Bank of Maharashtra in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-extend-gains-to-24-800-dmart-bank-of-maharashtra-in-focus-opening-bell-12902510.html",
            "description": "Bulls were back roaring last session, sending benchmark indices Sensex up by 1,400 points while Nifty surged nearly 500 points, breaking well past its 200-DMA. Majority of the support came in from auto, IT, and financial stocks, whereas broader indices underperformed. Over the next few days, investors will closely track Q3 business updates from companies as we step into the earnings season. Experts are eyeing Nifty's resistance at 24,200, with support placed around 24,900. This morning, global cues were mixed. US markets ended lower on the first day of 2025. Meanwhile, Asia-Pacific markets traded higher. Among stocks in focus, watch out for Avenue Supermarts, Bank of Maharashtra, and NHPC. Catch Lovisha Darad in conversation with Raja Venkatraman, Co-Founder, NeoTrader & Trading Influencer and Vinit Bolinjka, Head of Research, Ventura Securities",
            "pubDate": "2025-01-03T03:42:19.877022"
        },
        {
            "title": "Pricol shares in focus on divestment of wiping business division",
            "link": "https://www.moneycontrol.com/news/business/stocks/pricol-shares-in-focus-on-divestment-of-wiping-business-division-12902384.html",
            "description": "Pricol Share Price | The company board at their meeting held on January 2 approved divestment of wiping business division to Auto Ignition on a slump sale basis through execution of business transfer agreement. The consideration for the proposed transaction is Rs 20 crores, subject to adjustments set out in the business transfer agreement.",
            "pubDate": "2025-01-03T03:42:19.877098"
        },
        {
            "title": "RITES shares in focus on order win worth Rs 69.78 crore from SAIL",
            "link": "https://www.moneycontrol.com/news/business/stocks/rites-shares-in-focus-on-order-win-worth-rs-69-78-crore-from-sail-12902383.html",
            "description": "RITES Share Price | The company's subsidiary REMC signed a Memorandum of Understanding (MoU) with Indian Railway Finance Corporation (IRFC) to explore options for financing power projects for supply to the railways.",
            "pubDate": "2025-01-03T03:42:19.877170"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty gain at pre-open; Bharti Airtel, Hero Moto, RITES, Biocon in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-03-01-2025-liveblog-12902490.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Capital Small Finance Bank, Avenue Supermarts, Hindustan Zinc, MOIL, Varun Beverages, Indian Railway Finance Corporation, NHPC, Axiscades Technologies,Honasa Consumer, Pricol, Allcargo Logistics, PB Fintech, Swan Energy, Gujarat Toolroom, and Citichem India will be in focus on January 3",
            "pubDate": "2025-01-03T03:42:19.877247"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-17-12902049.html",
            "description": "The GIFT Nifty is indicating a weak start for the day. Wall Street see-sawed to a lower close on Thursday amid choppy trading, as investors embarked on the new year facing the cross-currents of solid labor market data, a rising dollar and tumbling Tesla shares.",
            "pubDate": "2025-01-03T03:42:19.877320"
        },
        {
            "title": "Trade Spotlight: How should you trade Kotak Mahindra Bank, Kalyan Jewellers, HCL Technologies, ITC, PB Fintech, and others on January 3?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-kotak-mahindra-bank-kalyan-jewellers-hcl-technologies-itc-pb-fintech-and-others-on-january-3-12902467.html",
            "description": "The market may see some consolidation after the sharp run-up in the past three days. Below are some trading ideas for the near term.",
            "pubDate": "2025-01-03T03:42:19.877389"
        },
        {
            "title": "Stocks to Watch Today: Bharti Airtel, Hero MotoCorp, Biocon, Wockhardt, RITES, DMart, V2 Retail, Bank of Maharashtra in focus on 3 January",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-bharti-airtel-hero-motocorp-biocon-wockhardt-rites-dmart-v2-retail-bank-of-maharashtra-in-focus-on-3-january-12902457.html",
            "description": "Stocks To Watch Today, Jan 3: Stocks like Capital Small Finance Bank, Avenue Supermarts, Hindustan Zinc, MOIL, Varun Beverages, Indian Railway Finance Corporation, NHPC, Axiscades Technologies,Honasa Consumer, Pricol, Allcargo Logistics, PB Fintech, Swan Energy, Gujarat Toolroom, and Citichem India will be in focus on January 3.",
            "pubDate": "2025-01-03T03:42:19.877457"
        },
        {
            "title": "Shaily Engineering Q2: Operational excellence matches strong fundamentals",
            "link": "https://www.moneycontrol.com/news/business/earnings/shaily-engineering-q2-operational-excellence-matches-strong-fundamentals-12902508.html",
            "description": "Shaily Engineering has delivered an outstanding 147 percent return to investors since its inclusion in our Discovery series",
            "pubDate": "2025-01-03T03:49:49.048659"
        },
        {
            "title": "Weekly Tactical Pick | Cello World: This consumer ware player is set to clock accelerated growth",
            "link": "https://www.moneycontrol.com/news/business/stocks/weekly-tactical-pick-cello-world-this-consumer-ware-player-is-set-to-clock-accelerated-growth-12902507.html",
            "description": "The company is diversifying distribution reach and scaling up launches as demand is expected to improve going forward",
            "pubDate": "2025-01-03T03:49:49.048753"
        },
        {
            "title": "Sensex slips nearly 400 pts, Nifty below 24,200 as IT, bank stocks fall; broader market outperforms",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-slips-nearly-400-pts-nifty-below-24-200-as-it-bank-stocks-fall-broader-market-outperforms-12902526.html",
            "description": "The small and midcap indices continued to showcase robust trends following broad-based buying. While the midcap index traded 0.4 percent higher, the smallcap index traded 0.6 percent in the green.",
            "pubDate": "2025-01-03T04:35:25.010809"
        },
        {
            "title": "Wockhardt shares rally 5% after Indian drug regulator approves Pneumonia antibiotic",
            "link": "https://www.moneycontrol.com/news/business/markets/wockhardt-shares-rally-5-after-antibiotic-for-pneumonia-treatment-approved-by-indian-drug-regulator-12902581.html",
            "description": "Central Drugs Standard Control Organization (CDSCO) approved antibiotic Nafithromycin, sold under Miqnaf brand, as a new treatment for community-acquired bacterial Pneumonia (CABP) in adults.",
            "pubDate": "2025-01-03T04:52:56.331537"
        },
        {
            "title": "Stocks to Watch: Bharti Airtel, Varun Beverages, IRFC, NHPC & Biocon",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/stocks-to-watch-bharti-airtel-varun-beverages-irfc-nhpc-biocon-12902600.html",
            "description": "",
            "pubDate": "2025-01-03T05:21:01.253270"
        },
        {
            "title": "Agri Picks Report January 03 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-january-03-2025-geojit-financial-services-12902585.html",
            "description": "According to Geojit Financial Services, Arrivals of the new kharif tur crop in spot markets across the country rose 78% on year in December, to 84,130.33 tonnes from 47,154.63 tonnes in December 2023, according to the India Pulses and Grains Association.",
            "pubDate": "2025-01-03T05:21:01.253358"
        },
        {
            "title": "ONGC promises upside, says Jefferies; Oil India higher as crude goes past 100-DMA",
            "link": "https://www.moneycontrol.com/news/business/markets/ongc-promises-upside-says-jefferies-oil-india-higher-as-crude-goes-past-100-dma-12902598.html",
            "description": "Jefferies, meanwhile, has issued a fresh note that sees 58% upside in ONGC, and has reiterated its buy call. The recent correction in the shares of ONGC seem to be overdone, said Jefferies.",
            "pubDate": "2025-01-03T05:49:36.828666"
        },
        {
            "title": "ITC Ltd | Resilient performance amidst challenging operating environment",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/itc-ltd-resilient-performance-amidst-challenging-operating-environment-12902459.html",
            "description": "ITC is an Indian conglomerate with diverse business interests, spanning across Cigarettes, Branded Packaged Foods, Personal Care, hotels and Agri. ITC is well diversified players with Cigarette business being a cash cow which enables incubation of new high growth business. The recent quarterly earnings were in line expectations but inflationary pressure weighed on consumption and FMCG business. ITC also offers a decent dividend yield, which can help it outperform in the near term, given the macro headwinds and elevated market volatility. Moreover, post de-merger of the asset-heavy hotel business, the return profile of ITC is expected to improve substantially.",
            "pubDate": "2025-01-03T06:40:37.843347"
        }
    ]
}