{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-04T03:17:42.186030",
    "items": [
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty near 22,100, Asia falls sharply on Trump's tariff plan",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-04-03-2025-liveblog-12955336.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street's main stock indexes closed sharply lower on Monday after President Donald Trump announced the start of 25% tariffs on Canada and Mexico, with the S&P 500 posting its biggest daily percentage decline since December 18. The Dow Jones Industrial Average fell 649.67 points, or 1.48%, to 43,191.24, the S&P 500 lost 104.78 points, or 1.76%, to 5,849.72 and the Nasdaq Composite lost 497.09 points, or 2.64%, to 18,350.19.",
            "pubDate": "2025-03-04T02:46:20.174201"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-57-12955014.html",
            "description": "Wall Street's main stock indexes closed sharply lower on Monday after President Donald Trump announced the start of 25% tariffs on Canada and Mexico, with the S&P 500 posting its biggest daily percentage decline since December 18.",
            "pubDate": "2025-03-04T02:46:20.174280"
        },
        {
            "title": "Stocks to Watch Today: ASK Automotive, RBL Bank, Godrej Properties, IEX, Uno Minda, Intellect Design in focus on 4 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-ask-automotive-rbl-bank-godrej-properties-iex-uno-minda-intellect-design-in-focus-on-4-march-12955316.html",
            "description": "Stocks to Watch, Mar 4: Stocks like CEAT, Xchanging Solutions, UCO Bank, Onix Solar Energy, REC, Newjaisa Technologies, Anlon Technology Solutions, Sunteck Realty, Wendt India, Dr Agarwals Eye Hospital, and Nukleus Office Solutions will be in focus on March 4.",
            "pubDate": "2025-03-04T02:46:20.174348"
        },
        {
            "title": "Trade Spotlight: How should you trade Larsen & Toubro, Narayana Hrudayalaya, JSW Energy, Bajaj Finance, PFC, and others on March 4?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-larsen-toubro-narayana-hrudayalaya-jsw-energy-bajaj-finance-pfc-and-others-on-march-4-12955302.html",
            "description": "The market may attempt a bounce back considering the oversold conditions, but it is unlikely to sustain the same. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-04T02:46:20.174415"
        },
        {
            "title": "IEX shares in focus as traded volumes jump 9% in February",
            "link": "https://www.moneycontrol.com/news/business/stocks/iex-shares-in-focus-as-traded-volumes-jump-9-in-february-12955354.html",
            "description": "IEX Share Price: In February, IEX's electricity traded volume increased by 9 percent on-year to 9,622 million units for the month.",
            "pubDate": "2025-03-04T03:17:41.539932"
        }
    ]
}