{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-29T15:49:16.626492",
    "items": [
        {
            "title": "Money Matters| How to save Rs 1 cr in 10 years,: Check how much you need to invest every month",
            "link": "https://www.moneycontrol.com/news/videos/business/companies/money-matters-how-to-save-rs-1-cr-in-10-years-check-how-much-you-need-to-invest-every-month-12879538.html",
            "description": "Path to becoming a crorepati? Owning Rs 1 crore is an investor's dream. Strategic investments, like SIPs in equity funds, can help reach that goal. Regular investing and a long-term view are crucial. Even a Rs 1,000 SIP can grow substantially over time, thanks to compounding. Disciplined investing is key to turning your crorepati dream into reality. Here is how to accumulate Rs 1 crore from mutual fund SIPs in 10 years, 15 years, 20 years and 25 years.\n#sip #personalfinance #equityfunds #compounding #investment",
            "pubDate": "2024-11-29T06:49:11.378097"
        },
        {
            "title": "IndiGo announces Black Friday sale, fares to start from Rs 1,199 for domestic flights",
            "link": "https://www.moneycontrol.com/news/india/indigo-announces-black-friday-sale-fares-to-start-from-rs-1199-for-domestic-flights-12879736.html",
            "description": "The sale will go live for booking from November 29 to December 2 and the travel dates available are between January 1 to March 31, the airline said.",
            "pubDate": "2024-11-29T09:37:58.908478"
        },
        {
            "title": "Business in the Week Ahead (December 2- 6, 2024)",
            "link": "https://www.moneycontrol.com/news/business/business-in-the-week-ahead-december-2-6-2024-12879767.html",
            "description": "From the Indian central bank's policy meet to the release of PMI Services data for US, UK, and Euro area - a slew of macro data is scheduled for next week. Here are some important macroeconomic indicators that market participants should watch closely",
            "pubDate": "2024-11-29T10:54:56.448359"
        },
        {
            "title": "Explained: Why India needs nuclear power and what is it doing about it",
            "link": "https://www.moneycontrol.com/news/business/companies/explained-why-india-needs-nuclear-power-and-what-is-it-doing-about-it-12879884.html",
            "description": "please suggest a strap",
            "pubDate": "2024-11-29T12:26:34.952532"
        },
        {
            "title": "Green Finance: Addressing misconceptions and urging immediate action",
            "link": "https://www.moneycontrol.com/news/opinion/green-finance-addressing-misconceptions-and-urging-immediate-action-12879871.html",
            "description": "Green finance is an urgent necessity, not a distant goal. Despite misconceptions, it offers substantial economic and environmental benefits. Financial institutions must embrace comprehensive ESG strategies, assess green opportunities, and collaborate to drive sustainability, ensuring long-term growth and impact",
            "pubDate": "2024-11-29T14:37:37.534917"
        },
        {
            "title": "BCAS fines IndiGo Rs 5 lakh for aviation security violations",
            "link": "https://www.moneycontrol.com/news/business/companies/bcas-fines-indigo-rs-5-lakh-for-aviation-security-violations-12879999.html",
            "description": "The airline is reviewing the BCAS order, issued on November 27, and plans to appeal it to the relevant authority, according to a regulatory filing",
            "pubDate": "2024-11-29T15:49:16.113423"
        }
    ]
}