{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-14T07:30:47.299409",
    "items": [
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a flat start; US markets mixed, Asia gains",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-gift-nifty-signals-a-flat-start-us-markets-mixed-asia-gains-liveblog-12866813.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The Dow and the S&P 500 ended slightly higher on Wednesday while the Nasdaq lost ground after October data showed consumer prices rising in line with expectations, adding support to bets that the U.S. Federal Reserve will cut interest rates in December.",
            "pubDate": "2024-11-14T02:08:57.694080"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-78-12866521.html",
            "description": "The GIFT Nifty is indicating a muted start for the day.",
            "pubDate": "2024-11-14T02:08:57.694169"
        },
        {
            "title": "Stock Radar: Eicher Motors, Niva Bupa, Cipla, Zomato, Nykaa, Varun Beverages, Vodafone Idea, NALCO in focus on Thursday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-eicher-motors-niva-bupa-cipla-zomato-nykaa-varun-beverages-vodafone-idea-nalco-in-focus-on-thursday-12866786.html",
            "description": "Stocks like Rashtriya Chemicals and Fertilizers, Torrent Power, PI Industries, Godrej Industries, Thomas Cook India, AstraZeneca Pharma, Sun TV Network, VRL Logistics, Shilpa Medicare, and KSB will also be in focus on November 14.",
            "pubDate": "2024-11-14T02:08:57.694244"
        },
        {
            "title": "Trade Spotlight: How should you trade Bharti Hexacom, HCL Technologies, Granules India, Dr Lal PathLabs, BSE, and others on Thursday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bharti-hexacom-hcl-technologies-granules-india-dr-lal-pathlabs-bse-and-others-on-thursday-12866776.html",
            "description": "The downward pressure may persist in the market, given the strong control exerted by bears over Dalal Street. Below are some trading ideas for the near term.",
            "pubDate": "2024-11-14T02:08:57.694316"
        },
        {
            "title": "Brokerage Radar: Alkem Lab gets target upgrades, Nomura upgrades Eicher Motors to 'Neutral'",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-alkem-lab-gets-target-upgrades-nomura-upgrades-eicher-motors-to-neutral-12866837.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Alkem Laboratories, Eicher Motors, Sunteck Realty and more.",
            "pubDate": "2024-11-14T02:55:35.859950"
        },
        {
            "title": "Grasim Industries stock in focus ahead of Q2 results; double-digit growth seen in profit, revenue",
            "link": "https://www.moneycontrol.com/news/business/markets/grasim-industries-stock-in-focus-ahead-of-q2-results-double-digit-growth-seen-in-profit-revenue-12866824.html",
            "description": "Grasim Industries is expected to report robust growth in Q2FY25 with analysts projecting a 17-20% YoY rise in revenue and an 18% profit increase, driven by gains in the VSF and chemicals segments.",
            "pubDate": "2024-11-14T02:55:35.860041"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a flat start; US markets mixed, Asia gains",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-14-11-2024-liveblog-12866813.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The Dow and the S&P 500 ended slightly higher on Wednesday while the Nasdaq lost ground after October data showed consumer prices rising in line with expectations, adding support to bets that the U.S. Federal Reserve will cut interest rates in December.",
            "pubDate": "2024-11-14T02:55:35.860125"
        },
        {
            "title": "Jefferies hikes Sunteck Realty target post stellar Q2 show, sees over 40% potential upside",
            "link": "https://www.moneycontrol.com/news/business/earnings/jefferies-hikes-sunteck-realty-target-post-stellar-q2-show-sees-over-40-potential-upside-12866835.html",
            "description": "Sunteck Realty’s Q2FY25 net profit jumped 348 percent YoY to Rs 35 crore",
            "pubDate": "2024-11-14T03:17:20.933608"
        },
        {
            "title": "Safari Industries – Why the stock is a good addition in a volatile market",
            "link": "https://www.moneycontrol.com/news/business/earnings/safari-industries-why-the-stock-is-a-good-addition-in-a-volatile-market-12866863.html",
            "description": "Diverse product offerings, channel mix, and frugal approach to cost augur well for the company",
            "pubDate": "2024-11-14T04:12:07.045095"
        },
        {
            "title": "Short Call | Correction Calling: Will DIIs bet big or bow out as FIIs exit? Nykaa, NTPC in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/short-call-correction-calling-will-diis-bet-big-or-bow-out-as-fiis-exit-nykaa-ntpc-in-focus-12866889.html",
            "description": "Corrections are unpredictable. By selling stocks to avoid pain, you can miss the next gain - Peter Lynch",
            "pubDate": "2024-11-14T04:12:07.045185"
        },
        {
            "title": "Live:Nifty In Correction Zone, Should You Catch The Falling Knife? DMart, Zomato In F&O|Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/livenifty-in-correction-zone-should-you-catch-the-falling-knife-dmart-zomato-in-foopening-bell-12866855.html",
            "description": "The significant selling pressure in the market continued, with the Nifty 50 losing more than one percent for the second consecutive session on November 13. This was driven by nervousness in global markets and a spike in CPI inflation. The index formed a long bearish candlestick once again and eventually hit the 200-day EMA support at 23,540. If the index decisively falls below this level, it may reach the second target (around 23,200) of the Head and Shoulders pattern in the upcoming sessions. However, on the upside, the levels to watch are 23,900-24,000, experts said. Also watch out for stocks like DMart, Zomato, Hero Moto among others. Catch Nandita Khemka in conversation with big market experts on how to navigate this selloff. Kunal Rambhia, Fund Manager, The Streets decodes the chart setup while Ajay Srivastav, CEO, Dimensions Corporate Finance Services and Mahesh Patil, CIO, Aditya Birla Sun Life AMC share their market insights.",
            "pubDate": "2024-11-14T04:12:07.045259"
        },
        {
            "title": "Buy Mahindra and Mahindra; target of Rs 3262: LKP Research",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-mahindra-and-mahindra-target-of-rs-3262-lkp-research-12866870.html",
            "description": "LKP Research is bullish on Mahindra and Mahindra has recommended buy rating on the stock with a target price of Rs 3262 in its research report dated November 13, 2024.",
            "pubDate": "2024-11-14T04:12:07.045335"
        },
        {
            "title": "Brokerages optimistic on Eicher Motors’ strategic shift, forecast stronger growth; stock soars 8%",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerages-optimistic-on-eicher-motors-strategic-shift-forecast-stronger-growth-12866825.html",
            "description": "Despite muted sales growth for Royal Enfield, brokerages anticipate a rebound in the second half of FY25, backed by a change in focus towards growth, two-wheeler premiumisation trend and festive sales.",
            "pubDate": "2024-11-14T04:12:07.045405"
        },
        {
            "title": "Garden Reach shares snap five-day losing streak after strong Q2 earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/garden-reach-shares-snap-five-day-losing-streak-after-strong-q2-earnings-12866856.html",
            "description": "For the September quarter, Garden Reach's Profit After Tax (PAT) climbed 21 percent year-on-year to Rs 98 crore, up from Rs 81 crore in Q2FY24.",
            "pubDate": "2024-11-14T04:33:22.717297"
        },
        {
            "title": "PI Industries stock tanks 9% after firm slashes FY25 revenue guidance",
            "link": "https://www.moneycontrol.com/news/business/markets/pi-industries-stock-tanks-9-after-firm-slashes-fy25-revenue-guidance-12866948.html",
            "description": "PI Industries initially projected an 18-20 percent revenue growth for FY25, but has since revised its forecast firstly to 15 percent, and then further lower to high-single digits.",
            "pubDate": "2024-11-14T04:33:22.717405"
        },
        {
            "title": "Allied Blenders surges 2% after Antique initiates \"buy\" coverage, sees 28% upside potential",
            "link": "https://www.moneycontrol.com/news/business/markets/allied-blenders-surges-2-after-antique-initiates-buy-coverage-sees-28-upside-potential-12866960.html",
            "description": "Allied Blenders is accelerating its premiumisation strategy by launching new, high-quality products, say analysts at Antique",
            "pubDate": "2024-11-14T04:46:17.757384"
        },
        {
            "title": "Varun Beverages stock climbs 5% as firm launches Rs 7,500 crore QIP",
            "link": "https://www.moneycontrol.com/news/business/markets/varun-beverages-stock-climbs-5-as-firm-launches-rs-7500-crore-qip-12866959.html",
            "description": "Varun Beverages got an approval for the QIP in October, with funds to be used for investments in subsidiaries, joint ventures, and associates, as well as for expanding its product portfolio, entering new markets, and making strategic acquisitions.",
            "pubDate": "2024-11-14T04:46:17.757453"
        },
        {
            "title": "From ULIPs to FDI, HDFC Life’s Vibha Padalkar shares her views on all",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/from-ulips-to-fdi-hdfc-lifes-vibha-padalkar-shares-her-views-on-all-12866674.html",
            "description": "From growing share of ULIPs, to improving persistency ratio and whether the industry as a whole has settled down after a series of changes in regulations, Vibha Padalkar, MD &amp; CEO, HDFC Life opens up on these topics on more in this Moneycontrol exclusive.",
            "pubDate": "2024-11-14T04:46:17.757523"
        },
        {
            "title": "Cello World set to pen a stronger growth script in H2",
            "link": "https://www.moneycontrol.com/news/business/earnings/cello-world-set-to-pen-a-stronger-growth-script-in-h2-12866973.html",
            "description": "The company experienced demand traction in October, while new products and capacity expansion will act as growth levers",
            "pubDate": "2024-11-14T05:09:11.361413"
        },
        {
            "title": "Protean eGov Technologies| Open digital ecosystems could be the future growth driver",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/protean-egov-technologies-open-digital-ecosystems-could-be-the-future-growth-driver-12867026.html",
            "description": "Protean is a market leader in the provision of e-governance services in taxation-related infrastructure and social security welfare projects such as the National Pension Scheme (NPS) and the Atal Pension Yojana. It also has a subsidiary for the account aggregation business, which is regulated by the RBI.\n\nProtean’s multi-term population-scale projects ensure visibility of revenues. Moreover, the company’s offerings cater to varied customer segments, including businesses and retail consumers apart from the government, leading to low concentration risk. Protean’s business model is asset-light, enjoys high operating leverage, and has a track record of healthy profitability and cash generation.",
            "pubDate": "2024-11-14T05:49:09.223303"
        },
        {
            "title": "Shilpa Medicare share jumps 8% as Q2 earnings impress",
            "link": "https://www.moneycontrol.com/news/business/markets/shilpa-medicare-share-jumps-8-as-q2-earnings-impress-12866962.html",
            "description": "The revenue boost was attributed to robust growth in emerging markets alongside licensing success in the formulation and biologics segments, with the biologics business reporting a positive net profit for the first time.",
            "pubDate": "2024-11-14T06:21:02.807709"
        },
        {
            "title": "CNBC-TV18 Global Leadership Summit: Piyush Goyal Urges RBI to Cut Rates, Predicts Inflation Drop",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/cnbc-tv18-global-leadership-summit-piyush-goyal-urges-rbi-to-cut-rates-predicts-inflation-drop-12867194.html",
            "description": "Union Commerce Minister Piyush Goyal urged the Reserve Bank of India (RBI) to cut interest rates, arguing that food inflation shouldn’t drive this decision. He clarified that this was his personal view, not the government's stance. Goyal expects inflation to drop by December, noting that the Modi government has maintained historically low inflation levels. Addressing recent foreign investor exits, he advised a long-term investment perspective. India’s retail inflation rose to a 14-month high of 6.21% in October, exceeding RBI’s 2%-6% target. The RBI, cautious about inflation risks, recently kept its repo rate at 6.5%, citing potential economic risks.",
            "pubDate": "2024-11-14T06:51:40.146124"
        },
        {
            "title": "Food delivery giants face off: How Swiggy measures up to Zomato?",
            "link": "https://www.moneycontrol.com/news/business/markets/food-delivery-giants-face-off-how-swiggy-measures-up-to-zomato-12865728.html",
            "description": "Zomato may be ahead in the food delivery and quick commerce race, but its high valuation could give Swiggy the perfect chance to steal the spotlight and outshine with its stock performance.",
            "pubDate": "2024-11-14T07:30:45.405743"
        },
        {
            "title": "Apollo Tyres shares halt 4-day losing streak on in-line Q2 results",
            "link": "https://www.moneycontrol.com/news/business/markets/apollo-tyres-shares-halt-4-day-losing-streak-on-in-line-q2-results-12867096.html",
            "description": "In Europe, Apollo Tyres gained market share in the ultra-high performance segment (UHP), which grew to 46 percent of total sales from 39 percent in the previous year.",
            "pubDate": "2024-11-14T07:30:45.405909"
        },
        {
            "title": "Banco Products (India) hits 20% upper circuit on strong Q2 results, 1:1 bonus issue plan",
            "link": "https://www.moneycontrol.com/news/business/markets/banco-products-india-hits-20-upper-circuit-on-strong-q2-results-11-bonus-issue-plan-12867035.html",
            "description": "Banco Products specialises in manufacturing and sale of heat exchangers and cooling systems",
            "pubDate": "2024-11-14T07:30:45.405981"
        }
    ]
}