{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-11T10:51:09.972566",
    "items": [
        {
            "title": "Brokerage Radar: Goldman Sachs cuts Avenue Supermart target; HSBC starts PB Fintech coverage with 'Buy'",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-goldman-sachs-cuts-avenue-supermart-target-hsbc-starts-pb-fintech-coverage-with-buy-12887262.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Avenue Supermart, Bajaj Finance, Zen Tech and more.",
            "pubDate": "2024-12-11T02:42:08.495262"
        },
        {
            "title": "NTPC Green Energy shares in focus on bagging order to set up energy storage system",
            "link": "https://www.moneycontrol.com/news/business/stocks/ntpc-green-energy-shares-in-focus-on-bagging-order-to-set-up-energy-storage-system-12887138.html",
            "description": "NTPC Green Energy Share Price | NTPC REL secured 500 MW of solar power capacity at a tariff of Rs. 3.52 per kWh.",
            "pubDate": "2024-12-11T02:42:08.495352"
        },
        {
            "title": "Saakshi Medtech shares in focus on winning order worth Rs 250 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/saakshi-medtech-shares-in-focus-on-winning-order-worth-rs-250-crore-12887137.html",
            "description": "The share touched a 52-week high of Rs 369.00 and a 52-week low of Rs 176.05 on 04 July, 2024 and 27 November, 2024, respectively.",
            "pubDate": "2024-12-11T02:42:08.495429"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat start; US markets fall, Asia trade mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-11-12-2024-liveblog-12887239.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street's main indexes closed lower on Tuesday as technology sector losses offset gains in communications services while investors waited for key inflation reports that may influence the Federal Reserve's next interest rate decisions. The Dow Jones Industrial Average fell 154.10 points, or 0.35%, to 44,247.83. The S&P 500 lost 17.94 points, or 0.30%, at 6,034.91 and the Nasdaq Composite fell 49.45 points, or 0.25%, to 19,687.24.",
            "pubDate": "2024-12-11T02:42:08.495513"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-7-12886885.html",
            "description": "The GIFT Nifty is indicating a muted start for the day.",
            "pubDate": "2024-12-11T02:42:08.495589"
        },
        {
            "title": "Trade Spotlight: How should you trade Nuvama Wealth, Zen Technologies, Nippon Life, Ujjivan SFB, SRF, Poly Medicure, and others on Wednesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-nuvama-wealth-zen-technologies-nippon-life-ujjivan-sfb-srf-poly-medicure-and-others-on-wednesday-12887214.html",
            "description": "The market is expected to remain rangebound, though the overall trend continues to be positive. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-11T02:42:08.495664"
        },
        {
            "title": "Stock Radar: Awfis Space, IOB, HG Infra, Saakshi Medtech, NTPC Green Energy, Asahi India Glass in focus on Wednesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-awfis-space-iob-hg-infra-saakshi-medtech-ntpc-green-energy-asahi-india-glass-in-focus-on-wednesday-12887204.html",
            "description": "Stocks like LTIMindtree, Asian Granito India, Asian Paints, Morepen Laboratories, Ashiana Housing, Ujjivan Small Finance Bank, Hinduja Global Solutions, JSW Steel, and Syngene International will also be in focus on December 11.",
            "pubDate": "2024-12-11T02:42:08.495736"
        },
        {
            "title": "Agri Picks Report December 11, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-11-2024-geojit-financial-services-12887309.html",
            "description": "According to Geojit Financial Services, Farmers in Gujarat have sown rabi crops over 2.5 million hectares as of Monday, down 29.4% from 3.6 million hectares a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2024-12-11T03:47:14.856601"
        },
        {
            "title": "Awfis Space Solutions Block Deal: 12% equity changes hands; Peak XV, Bisque likely sellers",
            "link": "https://www.moneycontrol.com/news/business/markets/awfis-space-solutions-block-deal-12-equity-changes-hands-peak-xv-bisque-likely-sellers-12887268.html",
            "description": "The transaction, valued at Rs xx crore, will price the shares at Rs xx each, reflecting a xx percent discount to the previous closing price on the National Stock Exchange (NSE).",
            "pubDate": "2024-12-11T03:47:14.856684"
        },
        {
            "title": "Live: Nifty Stuck In A Range; Break Above 24,750 Key To Watch| Cement Firms In Focus| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-stuck-in-a-range-break-above-24-750-key-to-watch-cement-firms-in-focus-opening-bell-12887269.html",
            "description": "Indian benchmark indices ended on a flat note in a highly volatile session on December 10. At close, the Sensex was up 1.59 points at 81,510.05, while the Nifty was down 8.95 points or 0.04 percent at 24,610.05.After a flat to positive start, the market traded in positive territory in the first half. However, profit booking in the second half dragged the Nifty into red. But final-hour buying, especially in the IT, Realty names, erased all the losses to end with little change. This morning global cues are mixed with the GIFT Nifty signalling a muted start. Cement firms will be in focus post price hike. 3 IPOs, Vishal Mega mart, Mobikwik and Sai Life Sciences will open for subscription today. Catch Nandita Khemka in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical &amp; Derivatives ) at Axis Securities and Manoj Bahety, Founder &amp; Fund Manager, Carnelian Asset Management.",
            "pubDate": "2024-12-11T03:47:14.856755"
        },
        {
            "title": "Short Call | Is quick commerce turning into the Street's new darling? Swiggy, Mphasis, Waree Energies in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/short-call-is-quick-commerce-turning-into-the-street-s-new-darling-swiggy-mphasis-waree-energies-in-focus-12887248.html",
            "description": "“The ability to create its own market is the strategic, the dominating, and the single most distinguishing characteristic of a true growth company.”--Peter Bernstein",
            "pubDate": "2024-12-11T03:47:14.856824"
        },
        {
            "title": "Swiggy shares drop 4% amid profit booking after anchor lock-in ends",
            "link": "https://www.moneycontrol.com/news/business/markets/swiggy-shares-drop-4-amid-profit-booking-kicks-as-anchor-lock-in-expires-12887314.html",
            "description": "Analysts on the Street believe Swiggy has the potential to deliver better returns in the short -term thanks to the upbeat growth prospects of Indian quick commerce and the company's cheaper valuations.",
            "pubDate": "2024-12-11T04:19:26.309756"
        },
        {
            "title": "HG Infra shares soar 5% on new order win worth Rs 763 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/hg-infra-shares-soar-5-on-new-order-win-worth-rs-763-crore-12887281.html",
            "description": "HG Infra’s bid for the project is valued at Rs 763.11 crore, against MoRTH's estimated project cost of Rs 898.5 crore. The company aims to complete the construction within two years.",
            "pubDate": "2024-12-11T04:19:26.309843"
        },
        {
            "title": "Ambit retains Zomato as its core holding in Dec, says business model only partly imitable by Swiggy, Zepto",
            "link": "https://www.moneycontrol.com/news/business/markets/ambit-retains-zomato-as-its-core-holding-in-dec-says-business-model-only-partly-imitable-by-swiggy-zepto-12887319.html",
            "description": "Zomato has a high average order value in food delivery as well as quick commerce. Competitors who try to copy the business model of Zomato can only partially imitate this, says the asset manager",
            "pubDate": "2024-12-11T04:39:37.164676"
        },
        {
            "title": "Subscribe for One Mobikwik Systems Ltd IPO; Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-one-mobikwik-systems-ltd-ipo-geojit-financial-services-12887399.html",
            "description": "Geojit Financial Services, has come out with its report on One Mobikwik Systems Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on December 10 2024.",
            "pubDate": "2024-12-11T05:18:51.486226"
        },
        {
            "title": "Asian Granito stock zooms 11% as firm sets up JV with Shudh Investments and UK's Klyn Stone",
            "link": "https://www.moneycontrol.com/news/business/markets/asian-granito-stock-zooms-11-as-firm-sets-up-jv-with-shudh-investments-and-uk-s-klyn-stone-12887385.html",
            "description": "The three companies will establish a joint venture in England and Wales, named Klyn AGL, to trade large porcelain slabs, tiles, and quartz products across the UK.",
            "pubDate": "2024-12-11T05:18:51.486310"
        },
        {
            "title": "Vishal Mega Mart IPO: Can this value focussed retailer create value for investors?",
            "link": "https://www.moneycontrol.com/news/business/ipo/vishal-mega-mart-ipo-can-this-value-focussed-retailer-create-value-for-investors-12887356.html",
            "description": "Targeting the middle and lower middle class, VMML has a wide portfolio with strong positioning and product range in the opening price points",
            "pubDate": "2024-12-11T05:18:51.486386"
        },
        {
            "title": "Subscribe for Vishal Mega Mart Ltd IPO; Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-vishal-mega-mart-ltd-ipo-geojit-financial-services-12887390.html",
            "description": "Geojit Financial Services, has come out with its report on Vishal Mega Mart Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on December 10 2024.",
            "pubDate": "2024-12-11T05:18:51.486458"
        },
        {
            "title": "PNC Infra logs biggest gain in six months, skyrockets 12% on bagging early completion bonus",
            "link": "https://www.moneycontrol.com/news/business/markets/pnc-infra-logs-biggest-gain-in-six-months-skyrockets-12-on-bagging-early-completion-bonus-12887349.html",
            "description": "PNC Infratech completed a Rs 738 crore NHAI project for the four laning of national highway-53, two months before its stipulated time, making it eligible to earn an early completion bonus.",
            "pubDate": "2024-12-11T05:18:51.486531"
        },
        {
            "title": "ITI shares dive 7% as profit booking seeps in from record high",
            "link": "https://www.moneycontrol.com/news/business/markets/iti-shares-dive-7-as-profit-booking-seeps-in-from-record-high-12887436.html",
            "description": "Driven by strong trading volumes, ITI stock clocked in gains of around 34 percent in the past three sessions that took it to a record high of Rs 404 in the previous sesssion.",
            "pubDate": "2024-12-11T06:52:36.187308"
        },
        {
            "title": "Syngene International stock extends gains to second day, surges 4%",
            "link": "https://www.moneycontrol.com/news/business/markets/syngene-international-stock-extends-gains-to-second-day-surges-4-12887527.html",
            "description": "Syngene promoter--Biocon offloaded 80 lakh shares in the CDMO player on December 10, earning Rs 686.14 crore from the stake sale.",
            "pubDate": "2024-12-11T07:50:36.402859"
        },
        {
            "title": "Analyst Call Tracker: IT stocks take lead in upgrades amid green shoots of recovery",
            "link": "https://www.moneycontrol.com/news/business/markets/analyst-call-tracker-it-stocks-take-lead-in-upgrades-amid-green-shoots-of-recovery-12887300.html",
            "description": "The stocks of three IT giants — Infosys, TCS and Tech Mahindra —  report maximum upgrades in FY25, Moneycontrol's Analyst Call Tracker shows.",
            "pubDate": "2024-12-11T08:44:57.553928"
        },
        {
            "title": "Buy AU Small Finance Bank; target of Rs 730: LKP Research",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-au-small-finance-bank-target-of-rs-730-lkp-research-12887653.html",
            "description": "LKP Research is bullish on AU Small Finance Bank has recommended buy rating on the stock with a target price of Rs 730 in its research report dated December 11, 2024.",
            "pubDate": "2024-12-11T09:51:02.148453"
        },
        {
            "title": "Live: Nifty Stuck In A Range; Holds 24,600 For Now| DMart, Cement In Focus| Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-stuck-in-a-range-holds-24-600-for-now-dmart-cement-in-focus-closing-bell-12887666.html",
            "description": "Another day of rangebound trade. Nifty holds 24,600 amid volatility. Broader markets show strength. Banks on the backfoot; FMCG, autos & IT gain. Market breadth in favour of gainers. Catch Nandita Khemka and Yatin Mota as they discuss the stocks on their radar.",
            "pubDate": "2024-12-11T10:21:16.934597"
        },
        {
            "title": "Technical View: Nifty closes above 24,600 in rangebound session; crucial support lies at 24,500",
            "link": "https://www.moneycontrol.com/news/business/markets/technical-view-nifty-closes-above-24-600-in-rangebound-session-crucial-support-lies-at-24-500-12887718.html",
            "description": "On the sectoral front, buying was seen in the auto, FMCG, IT sectors while PSU Bank index shed nearly 1 percent.",
            "pubDate": "2024-12-11T10:51:08.927496"
        },
        {
            "title": "Analyst Call Tracker: Hero MotoCorp, Eicher see most upgrades, but Tata Motors faces heat",
            "link": "https://www.moneycontrol.com/news/business/markets/analyst-call-tracker-hero-motocorp-eicher-see-most-upgrades-but-tata-motors-faces-heat-12887409.html",
            "description": "In November, Hero MotoCorp — the world’s largest two-wheeler manufacturer — received 27 'buy' ratings, 7 'hold' calls, and 8 'sell' recommendations, according to Bloomberg data.",
            "pubDate": "2024-12-11T10:51:08.927590"
        }
    ]
}