{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-08-30T14:11:15.976854",
    "items": [
        {
            "title": "Sebi passes order against Sanjay Dalmia and others in Golden Tobacco case, imposes penalty and bars from market",
            "link": "https://www.moneycontrol.com/news/business/markets/sebi-passes-order-against-sanjay-dalmia-and-others-in-golden-tobacco-case-imposes-penalty-and-bars-from-market-13503040.html",
            "description": "Sebi alleged that the promoters and directors of GTL had entered into agreements relating to the company’s prime land assets without proper disclosures to shareholders.",
            "pubDate": "2025-08-30T06:56:09.866694"
        },
        {
            "title": "Market snaps two-week gains amid tariff concern, FII selling; rupee at record low",
            "link": "https://www.moneycontrol.com/news/photos/business/markets/market-snaps-two-week-gains-amid-tariff-concern-fii-selling-rupee-at-record-low-13503046.html",
            "description": "Indian rupee snapped two-week gaining streak, hitting fresh record low of 88.31 against the US dollar. It ended 68 paise lower at 88.20 per dollar on August 29 against the August 22 closing of 87.52. During the week the Indian rupee traded in the range of 87.34-88.31.",
            "pubDate": "2025-08-30T06:56:09.866775"
        },
        {
            "title": "S&P 500 ends lower as Dell and Nvidia drop",
            "link": "https://www.moneycontrol.com/news/business/markets/s-p-500-ends-lower-as-dell-and-nvidia-drop-13503047.html",
            "description": "The S&P 500 declined 0.64% to end the session at 6,460.26 points a day after notching a record-high close. The Nasdaq declined 1.15% to 21,455.55 points, while the Dow Jones Industrial Average declined 0.20% to 45,544.88 points.",
            "pubDate": "2025-08-30T06:56:09.866845"
        },
        {
            "title": "SEBI directs Katalyst Software to refund NCD investors with 15% interest",
            "link": "https://www.moneycontrol.com/news/business/markets/sebi-directs-katalyst-software-to-refund-ncd-investors-with-15-interest-13503284.html",
            "description": "Sebi  order comes in the wake of a complaint by former promoter Rahul Dilip Shah, who had alleged irregularities in the pledge of his shares and collusion between Karvy and the majority shareholder group.",
            "pubDate": "2025-08-30T10:42:09.294445"
        },
        {
            "title": "NSE revises quantity freeze limits for index derivatives from September 1",
            "link": "https://www.moneycontrol.com/news/business/markets/nse-revises-quantity-freeze-limits-for-index-derivatives-from-september-1-13504080.html",
            "description": "Quantity freeze limits act as a safeguard to prevent erroneous or abnormally large orders that could disrupt market stability.",
            "pubDate": "2025-08-30T14:11:15.217348"
        }
    ]
}