{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-03T03:18:44.744132",
    "items": [
        {
            "title": "Abu Dhabi's IHC invests $1 billion for controlling stake in Sammaan Capital in a bet on India's housing finance space",
            "link": "https://www.moneycontrol.com/news/business/markets/abu-dhabi-s-ihc-invests-1-billion-for-controlling-stake-in-sammaan-capital-in-a-bet-on-india-s-housing-finance-space-13594743.html",
            "description": "The investment has been carried out through IHC's affiliate Avenir Investment RSC, which will be subscribing to 330 million equity shares and 306.7 million convertible warrants at Rs 139 each.",
            "pubDate": "2025-10-03T03:17:41.657851"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-13-13593222.html",
            "description": "Wall Street's three major indexes marked record closing highs with modest gains on Thursday, largely thanks to support from the technology sector, while investors cautiously monitored private labor market data on the second day of a US government shutdown.",
            "pubDate": "2025-10-03T03:17:41.657935"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a muted start; TVS Motor, RITES, Sammaan Capital, Coal India in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-03-10-2025-liveblog-13594602.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  Stocks like V-Mart Retail, Maruti Suzuki India, Hero MotoCorp, TVS Motor Company, Sammaan Capital, TBO Tek, Tata Power Company, Nuvama Wealth Management, KRBL, John Cockerill India, Hyundai Motor India, and RBL Bank will be in focus on October 03.",
            "pubDate": "2025-10-03T03:17:41.658006"
        },
        {
            "title": "September sees IPO rush but listings disappoint investors",
            "link": "https://www.moneycontrol.com/news/business/ipo/september-sees-ipo-rush-but-listings-disappoint-investors-13594419.html",
            "description": "25 IPOs light up September fundraising, yet poor debuts leave investors underwhelmed.",
            "pubDate": "2025-10-03T03:17:41.658080"
        },
        {
            "title": "Stocks to Watch Today: Sammaan Capital, Hero MotoCorp, Trualt Bioenergy, Jinkushal, TBO Tek, Nuvama Wealth, KRBL, John Cockerill in focus on 03 October",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-sammaan-capital-hero-motocorp-trualt-bioenergy-jinkushal-tbo-tek-nuvama-wealth-krbl-john-cockerill-in-focus-on-03-october-13594575.html",
            "description": "Stocks to Watch, 03 October: Stocks like V-Mart Retail, Maruti Suzuki India, Hero MotoCorp, TVS Motor Company, Sammaan Capital, TBO Tek, Tata Power Company, Nuvama Wealth Management, KRBL, John Cockerill India, Hyundai Motor India, and RBL Bank will be in focus on October 03.",
            "pubDate": "2025-10-03T03:17:41.658153"
        },
        {
            "title": "Trade Spotlight: How should you trade L&T Finance, Bank of India, Nykaa, Axis Bank, Laurus Labs, and others on October 03?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-l-t-finance-bank-of-india-nykaa-axis-bank-laurus-labs-and-others-on-october-03-13594561.html",
            "description": "The market needs to surpass short- and medium-term moving averages for a persistent uptrend. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-10-03T03:17:41.658229"
        }
    ]
}