{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-14T03:24:23.094898",
    "items": [
        {
            "title": "Will Nifty End 7-Day Losing Streak As Trump, Modi Meet Amid Reciprocal Tariff Move? Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/will-nifty-end-7-day-losing-streak-as-trump-modi-meet-amid-reciprocal-tariff-move-opening-bell-12940580.html",
            "description": "The Nifty failed to sustain its intraday rally due to a lack of strength at higher levels but the Nifty managed to close above the 23,000 mark. This morning Asian markets are largely higher and the GIFT Nifty is signalling a positive start. Overnight Wall Street saw a rally even as US President Donald Trump inked plans for sweeping \"reciprocal tariffs\" on both allies and competitors in a dramatic escalation of an international trade war.But these tariffs will not come into effect immediately. Meanwhile, in his meeting with PM Modi, Trump said he plans to firm up some wonderful trade deals for India and the US. The two leaders discussed trade relations, immigration, military sales, nuclear technology among other key issues. Among stocks in focus today will be Hindalco and Manappuram Finance. Catch Nandita Khemka in conversation with Dhiraj Reli--MD & CEO, HDFC Securities and Dhiraj Reli, MD & CEO, HDFC Securities.",
            "pubDate": "2025-02-14T03:24:16.134954"
        },
        {
            "title": "Brokerages upbeat on Hindalco's strong Q3, project up to 30% upside from current levels",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerages-upbeat-on-hindalco-s-strong-q3-project-up-to-30-upside-from-current-levels-12940555.html",
            "description": "Hindalco's strong Q3 print impressed brokerages, though they remain cautious about the potential impact of US tariffs in the future",
            "pubDate": "2025-02-14T03:24:16.135050"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-47-12939769.html",
            "description": "The S&P 500 ended down on Wednesday after a hotter-than-expected U.S. inflation reading added to worries that the Federal Reserve would not cut interest rates anytime soon, while CVS Health and Gilead Sciences rallied after upbeat quarterly reports.",
            "pubDate": "2025-02-14T03:24:16.135137"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a positive opening; Hindalco, United Breweries, HCC in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-14-02-2025-liveblog-12940541.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Kalpataru Projects, Hindustan Construction Company, Nirlon, Nazara Technologies, Deepak Nitrite, Allcargo Logistics, R Systems International, Manappuram Finance, Titagarh Rail Systems, Carborundum Universal, Gujarat Pipavav Port, UltraTech Cement, and Mahindra Lifespace will be in focus on February 14.",
            "pubDate": "2025-02-14T03:24:16.135217"
        },
        {
            "title": "Stocks to Watch Today: TCS, Hindalco, RBL Bank, United Breweries, Godfrey Phillips, Kisan Mouldings, KNR Construction in focus on 14 February",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-hindalco-rbl-bank-united-breweries-godfrey-phillips-kisan-mouldings-knr-construction-in-focus-on-14-february-12940495.html",
            "description": "Stocks To Watch, Feb 14: Stocks like Kalpataru Projects, Hindustan Construction Company, Nirlon, Nazara Technologies, Deepak Nitrite, Allcargo Logistics, R Systems International, Manappuram Finance, Titagarh Rail Systems, Carborundum Universal, Gujarat Pipavav Port, UltraTech Cement, and Mahindra Lifespace will be in focus on February 14.",
            "pubDate": "2025-02-14T03:24:16.135292"
        },
        {
            "title": "Bulk deals: Promoter Apollo Pipes buys 6 lakh shares in Kisan Mouldings",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-deals-promoter-apollo-pipes-buys-6-lakh-shares-in-kisan-mouldings-12940433.html",
            "description": "Aartha AIF bought 1.1 crore shares in Solarium Green Energy at Rs 202 per share, while Galaxy Noble Global Opportunities Fund PCC Luna sold 1.3 crore shares at the same price.",
            "pubDate": "2025-02-14T03:24:16.135368"
        },
        {
            "title": "Trade Spotlight: How should you trade Bajaj Finserv, Muthoot Finance, SBI Card, UPL, Cholamandalam Investment, Redington, and others on February 14?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bajaj-finserv-muthoot-finance-sbi-card-upl-cholamandalam-investment-redington-and-others-on-february-14-12940447.html",
            "description": "While the market may rebound amid consolidation, sustaining the expected recovery is key to watch. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-14T03:24:16.135443"
        }
    ]
}