{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-23T06:19:28.837401",
    "items": [
        {
            "title": "Aurobindo Pharma shares in focus post UK's MHRA approval for cancer drug",
            "link": "https://www.moneycontrol.com/news/business/stocks/aurobindo-pharma-shares-in-focus-post-uk-s-mhra-approval-for-cancer-drug-12895535.html",
            "description": "Aurobindo Pharma Share Price | Bevacizumab is used in the treatment of multiple cancers including metastatic colorectal cancer, recurrent or metastatic non-squamous non-small cell lung cancer, advanced and/or metastatic renal cell carcinoma, cervical cancer and epithelial ovarian, fallopian tube and primary peritoneal cancer.",
            "pubDate": "2024-12-23T02:32:50.208414"
        },
        {
            "title": "NTPC Green Energy shares in focus on signing MoU for renewable energy projects",
            "link": "https://www.moneycontrol.com/news/business/stocks/ntpc-green-energy-shares-in-focus-on-signing-mou-for-renewable-energy-projects-12895536.html",
            "description": "NTPC Green Energy Share Price | The Government of Bihar will facilitate the necessary permissions, registrations, approvals, and clearances from concerned departments, agencies, and authorities to support the projects.",
            "pubDate": "2024-12-23T02:32:50.208503"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a strong start; US, Asian markets gain",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-23-12-2024-liveblog-12895605.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks rallied to close out the trading week on Friday after two lackluster sessions as a cooler-than-expected inflation report and comments from Federal Reserve officials eased worries about the path of interest rates. The Dow Jones Industrial Average rose 498.82 points, or 1.18%, to 42,841.06, the S&P 500 gained 63.82 points, or 1.09%, to 5,930.90 and the Nasdaq Composite gained 199.83 points, or 1.03%, to 19,572.60.",
            "pubDate": "2024-12-23T02:32:50.208580"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-15-12895101.html",
            "description": "The GIFT Nifty is indicating a positive start for the day.",
            "pubDate": "2024-12-23T02:32:50.208659"
        },
        {
            "title": "Trade Spotlight: How should you trade Dr Reddy's Labs, Aegis Logistics, Techno Electric, KFin Technologies, Religare Enterprises, and others on Monday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-dr-reddy-s-labs-aegis-logistics-techno-electric-kfin-technologies-religare-enterprises-and-others-on-monday-12895584.html",
            "description": "The sentiment remains bearish, but considering the severe fall last week, consolidation and range-bound trade are possible. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-23T02:32:50.208732"
        },
        {
            "title": "Stock Radar: NTPC Green Energy, TCS, TeamLease, UltraTech Cement, Laurus Labs, Aurobindo Pharma, HCC in focus on Monday",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-ntpc-green-energy-tcs-teamlease-ultratech-cement-laurus-labs-aurobindo-pharma-hcc-in-focus-on-monday-12895583.html",
            "description": "Stocks To Watch for Dec 23: Stocks like Fortis Healthcare, Laurus Labs, India Cements, Tata Consultancy Services, Dalmia Bharat, Vedanta, Piramal Enterprises, Renaissance Global, AGI Greenpac, Indian Oil Corporation, and AGS Transact Technologies will also be in focus on December 23.",
            "pubDate": "2024-12-23T02:32:50.208803"
        },
        {
            "title": "Morgan Stanley initiates 'equal-weight' call on Niva Bupa; sees 15% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/morgan-stanley-initiates-equal-weight-call-on-niva-bupa-sees-15-upside-12895631.html",
            "description": "Morgan Stanley touted Niva Bupa as a \"strong franchise with a secular growth opportunity.\" The brokerage views the health insurer as well positioned to take advantage of the growth in India's health insurance sector.",
            "pubDate": "2024-12-23T03:30:19.168408"
        },
        {
            "title": "Live: How will markets move this week? | Zomato, Ultratech in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-how-will-markets-move-this-week-zomato-ultratech-in-focus-opening-bell-12895622.html",
            "description": "Indian benchmark indices Sensex and Nifty saw the worst weekly selloff in nearly 2.5 years. Barring pharma, all sectors ended in the negative territory last week. This week, experts expect volatility to remain high due to December derivatives contracts expiry. Experts eye Nifty to find a support around 23,300 and resistance placed around 23,900. This morning, global cues were strong. US markets ended higher on Friday amid softer than expected PCE inflation data. Asia-Pacific markets also started this Christmas week on a positive note. Among stocks in focus, watch out for Zomato, Ultratech Cement, and Vedanta. Catch Lovisha Darad in conversation with Milan Vaishnav, Founder and Technical Analyst, ChartWizard FZE and Anand K Rathi, Co-Founder, MIRA Money.",
            "pubDate": "2024-12-23T03:43:50.100787"
        },
        {
            "title": "Agri Picks Report December 23, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-23-2024-geojit-financial-services-12895654.html",
            "description": "According to Geojit Financial Services, The National Commodity and Derivatives Exchange Ltd. will launch options contracts on turmeric, coriander, and jeera futures, according to a circular issued by the exchange Thursday.",
            "pubDate": "2024-12-23T03:59:08.719449"
        },
        {
            "title": "Sterling and Wilson share soars 7% after Rs 1,200 crore order win",
            "link": "https://www.moneycontrol.com/news/business/markets/sterling-and-wilson-share-soars-7-after-rs-1-200-crore-order-win-12895683.html",
            "description": "These order wins will support Sterling and Wilson Renewable's goal of achieving its annual revenue target of Rs 8,000 crore for FY25.",
            "pubDate": "2024-12-23T04:48:05.580408"
        },
        {
            "title": "Bulls fight back! Sensex surges 600 pts, Nifty above 23,750 amid global cues; banks, metals rally",
            "link": "https://www.moneycontrol.com/news/business/markets/bulls-fight-back-sensex-surges-600-pts-nifty-above-23-750-amid-global-cues-banks-metals-rally-12895627.html",
            "description": "All sectors traded in the green, with notable gains in Nifty Bank, Metal, and Realty, rising 0.8 percent, 1.2 percent, and 1.1 percent, respectively.",
            "pubDate": "2024-12-23T04:48:05.580493"
        },
        {
            "title": "Metal stocks climb on hopes of safeguard duty on steel imports; Hindalco, JSW Steel, Tata Steel gain 1-2%",
            "link": "https://www.moneycontrol.com/news/business/markets/metal-stocks-climb-on-hopes-of-safeguard-duty-on-steel-imports-hindalco-jsw-steel-tata-steel-gain-1-2-12895653.html",
            "description": "The Directorate General of Trade and Remedies (DGTR) took note of the steel industry's request for a 25 percent safeguard duty on imports and initiated an investigation into the matter.",
            "pubDate": "2024-12-23T04:48:05.580581"
        },
        {
            "title": "JBM Auto shares rally 5% as subsidiary bags Rs 1,800-crore order from Ahmedabad",
            "link": "https://www.moneycontrol.com/news/business/markets/jbm-auto-shares-rally-5-as-subsidiary-bags-rs-1-800-crore-order-from-ahmedabad-12895684.html",
            "description": "In October, the board of JBM Auto Ltd. approved splitting one of its shares with a face value of Rs 2 into two shares with a face value of Rs 1 each.",
            "pubDate": "2024-12-23T04:55:37.585082"
        },
        {
            "title": "Intellect Design shares up 10% on strong volumes after launching 'Purple Fabric' AI system",
            "link": "https://www.moneycontrol.com/news/business/markets/intellect-design-shares-up-10-on-strong-volumes-after-launching-purple-fabric-ai-system-12895733.html",
            "description": "Last week, the company shared a presentation with analysts and institutional investors on its new Enterprise AI platform called Purple Fabric, which is tailored for the financial and insurance sectors.",
            "pubDate": "2024-12-23T06:19:28.292752"
        }
    ]
}