{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-24T08:38:35.848085",
    "items": [
        {
            "title": "What founders should know before approaching venture capital funds in 2025",
            "link": "https://www.moneycontrol.com/news/opinion/what-founders-should-know-before-approaching-venture-capital-funds-in-2025-12896425.html",
            "description": "While investor confidence and VC funding activity revived in 2024, funds are looking for certain specific qualities in the startups they are willing to fund",
            "pubDate": "2024-12-24T02:29:26.953785"
        },
        {
            "title": "Aurionpro expands in Europe with acquisition of Fenixys SAS for Euro 10 million",
            "link": "https://www.moneycontrol.com/news/business/markets/aurionpro-expands-in-europe-with-acquisition-of-fenixys-sas-for-euro-10-million-12896532.html",
            "description": "Fenixys SAS specializes in Murex, treasury, capital markets and support services for leading banks and financial institutions across Europe and the Middle East, with a revenue of €8 million for FY24 along with with strong margins, Aurionpro Solutions said on December 23.",
            "pubDate": "2024-12-24T02:29:26.953976"
        },
        {
            "title": "Mas Financial – is the significant correction an opportunity?",
            "link": "https://www.moneycontrol.com/news/business/earnings/mas-financial-is-the-significant-correction-an-opportunity-12896585.html",
            "description": "The stock looks reasonably valued for gradual accumulation from a long-term perspective",
            "pubDate": "2024-12-24T04:52:04.873368"
        },
        {
            "title": "Siemens India shares down sixth day in a row, already in correction zone after management commentary",
            "link": "https://www.moneycontrol.com/news/business/markets/siemens-india-shares-down-sixth-day-in-a-row-already-in-correction-zone-after-management-commentary-12896694.html",
            "description": "UBS has a neutral rating on Siemens India, while Elara and Nuvama have Accumulate and Hold rating, respectively. Antique has maintained a buy call citing growth opportunities, and HDFC Securities has a buy rating, with a target price of Rs 8114.",
            "pubDate": "2024-12-24T05:33:04.985046"
        },
        {
            "title": "Akums Drugs signs Rs 1,760 crore CDMO pact with a pharma major for European supply",
            "link": "https://www.moneycontrol.com/news/business/markets/akums-drugs-signs-rs-1-760-crore-cdmo-pact-for-european-supply-12896779.html",
            "description": "Akums Drugs has signed an agreement with a global pharma player to supply formulations to European market, which the company says will help 'opens doors' to further expand in the market.",
            "pubDate": "2024-12-24T07:58:28.909605"
        },
        {
            "title": "HFCL inaugurates manufacturing facility to make defence equipment for armed forces",
            "link": "https://www.moneycontrol.com/news/business/markets/hfcl-inaugurates-manufacturing-facility-to-make-defence-equipment-for-armed-forces-12896832.html",
            "description": "HFCL's defence facility, inaugurated on December 23, will manufacture advanced thermal weapon sights, electronic fuses, High Capacity Radio Relay (HCRR) and surveillance radars for India's armed forces as well as for the global market.",
            "pubDate": "2024-12-24T08:38:35.120684"
        }
    ]
}