{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-09T04:57:28.656014",
    "items": [
        {
            "title": "Senco Gold: Time to shine again, post correction?",
            "link": "https://www.moneycontrol.com/news/business/stocks/senco-gold-time-to-shine-again-post-correction-12989303.html",
            "description": "As per the pre-quarter business update, Senco Gold posted strong revenue growth in Q4FY25, led by wedding and festive sales",
            "pubDate": "2025-04-09T04:57:11.977864"
        },
        {
            "title": "RBI MPC Meet LIVE | RBI Monetary Policy Analysis LIVE I RBI Rate Cut | RBI Governor LIVE | RBI",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/rbi-mpc-meet-live-rbi-monetary-policy-analysis-live-i-rbi-rate-cut-rbi-governor-live-rbi-12989233.html",
            "description": "The Reserve Bank of India (RBI) announced its first bi-monthly monetary policy for the current financial year on Wednesday. The Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, began its three-day deliberations on Monday, weighing critical factors such as the repo rate, liquidity conditions, CPI inflation, and the GDP growth outlook.\n\nAdding to the uncertainty, US President Donald Trump last week triggered global concerns by announcing sweeping ‘reciprocal tariffs’ on nearly all imports from over 180 countries. These hefty 27% tariffs, coming into effect on the same day as the RBI’s policy announcement, have heightened fears of a full-blown trade war and a potential global recession.",
            "pubDate": "2025-04-09T04:57:11.977945"
        },
        {
            "title": "Indian IT stocks – value buy or a value trap?",
            "link": "https://www.moneycontrol.com/news/business/earnings/indian-it-stocks-value-buy-or-a-value-trap-12989241.html",
            "description": "Market volatility is likely to be the order of the day in the near term",
            "pubDate": "2025-04-09T04:57:11.978014"
        },
        {
            "title": "Agri Picks Report April 09, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-april-09-2025-geojit-financial-services-12989230.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.6 million acres (1 acre = 0.4 hectares) as of Wednesday, up 13.2% on year from 6.7 million acres sown in the same period last year, according to a report released by the state agriculture department.",
            "pubDate": "2025-04-09T04:57:11.978082"
        },
        {
            "title": "Tata Steel, JSW Steel, other metal stocks slip up to 3% after 104% tariff escalates US-China trade tensions",
            "link": "https://www.moneycontrol.com/news/business/markets/metal-stocks-likely-to-be-under-pressure-after-104-tariff-escalates-us-china-trade-tensions-12989199.html",
            "description": "Experts warned that the escalating trade conflict could severely impact global growth, further pressuring metal prices",
            "pubDate": "2025-04-09T04:57:11.978147"
        },
        {
            "title": "Craftsman Automation Ltd India, an auto ancillary company, is in a sweet spot | Stock of the Day",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/craftsman-automation-ltd-india-an-auto-ancillary-company-is-in-a-sweet-spot-stock-of-the-day-12989196.html",
            "description": "",
            "pubDate": "2025-04-09T04:57:11.978278"
        },
        {
            "title": "Senco Gold shares hit 5% upper circuit as it posts highest-ever revenue in Q4 update",
            "link": "https://www.moneycontrol.com/news/business/markets/senco-gold-shares-in-focus-as-it-posts-higher-ever-revenue-in-q4-update-12989182.html",
            "description": "Senco Gold posted a strong 19.1 percent year-on-year revenue jump, marking its highest-ever fourth-quarter revenue",
            "pubDate": "2025-04-09T04:57:11.978344"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty at 22,400, Sensex down 300 pts; RBI cuts repo rate by 25 bps",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-09-04-2025-liveblog-12989181.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Except auto and FMCG, all other sectoral indices are trading in the red. BSE Midcap and Smallcap indices down nearly 1 percent. Power Grid Corp, HUL, M&M, Asian Paints, Apollo Hospitals are  among major gainers on the Nifty, while losers are Wipro, Tech Mahindra, Tata Steel, ONGC, Infosys.",
            "pubDate": "2025-04-09T04:57:11.978410"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-81-12988410.html",
            "description": "The Foreign institutional investors (FIIs) extended their selling on seventh day as they sold equities worth Rs 4994 crore, however, Domestic institutional investors (DIIs) continued their buying on second day as they purchased equities of Rs 3097 crore on the same day.",
            "pubDate": "2025-04-09T04:57:11.978477"
        },
        {
            "title": "Wall Street slides again as US forges ahead with 104% tariffs on China",
            "link": "https://www.moneycontrol.com/news/business/wall-street-slides-again-as-us-forges-ahead-with-104-tariffs-on-china-12989137.html",
            "description": "U.S. stocks dropped on Tuesday for a fourth straight trading day since Trump's tariffs announcement last week, with the S&P 500 closing below 5,000 for the first time in almost a year.",
            "pubDate": "2025-04-09T04:57:11.978542"
        },
        {
            "title": "Trade Spotlight: How should you trade Nestle India, Pidilite Industries, Indus Towers, CreditAccess Grameen, Uno Minda, and others on April 9?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-nestle-india-pidilite-industries-indus-towers-creditaccess-grameen-uno-minda-and-others-on-april-9-12989114.html",
            "description": "Volatility is likely to remain high, and consolidation is expected to continue until the index closes the bearish gap of April 7. Below are some trading ideas for the near term.",
            "pubDate": "2025-04-09T04:57:11.978606"
        },
        {
            "title": "Stocks to Watch Today: Senco Gold, Phoenix Mills, Home First Finance, Concord Biotech, Sasken Tech, BPCL, IRB Infrastructure in focus on 9 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-senco-gold-phoenix-mills-home-first-finance-concord-biotech-sasken-tech-bpcl-irb-infrastructure-in-focus-on-9-april-12989108.html",
            "description": "Stocks to Watch, 9 Apr: Stocks like Shyam Metalics and Energy, Swan Defence and Heavy Industries, Vodafone Idea, NTPC, Karnataka Bank, PNB Housing Finance, Hindustan Aeronautics, Stallion India Fluorochemicals, Route Mobile, GAIL India, NTPC Green Energy, and Sonata Software will be in focus on April 9.",
            "pubDate": "2025-04-09T04:57:11.978671"
        },
        {
            "title": "Bulk & Block deals: Tata Mutual Fund offloads 0.53% equity in Sonata Software on April 8",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-block-deals-tata-mutual-fund-offloads-0-53-equity-in-sonata-software-on-april-8-12989065.html",
            "description": "New Berry Advisors Ltd sold 21.85 lakh shares of AGS Transact Technologies at an average price of Rs 6.88, representing a 1.7 percent stake in the company.",
            "pubDate": "2025-04-09T04:57:11.978735"
        },
        {
            "title": "US markets rebound from tariff turmoil, trade strong though below intraday highs",
            "link": "https://www.moneycontrol.com/news/business/markets/us-markets-rebound-from-tariff-turmoil-trade-strong-though-below-intraday-highs-12989061.html",
            "description": "US President Donald Trump, in a post on Truth Social, said he had a \"great call\" with South Korea’s acting president and claimed that China was \"eager\" to strike a trade deal.",
            "pubDate": "2025-04-09T04:57:11.978814"
        }
    ]
}