{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-05T02:56:08.478229",
    "items": [
        {
            "title": "Stocks to Watch Today: NTPC Green, Diamond Power Infra, Newgen Software, Indosolar, Gland Pharma, Hindustan Aeronautics in focus on 5 June",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-ntpc-green-diamond-power-infra-newgen-software-indosolar-gland-pharma-hindustan-aeronautics-in-focus-on-5-june-13097466.html",
            "description": "Stocks to Watch, 5 June: Aditya Birla Fashion and Retail, Manappuram Finance, Jindal Saw, Rallis India, Yes Bank, NTPC Green Energy, Diamond Power Infrastructure, Newgen Software Technologies, Indosolar, Gland Pharma, and Hindustan Aeronautics will be in focus on June 5.",
            "pubDate": "2025-06-05T02:56:05.803976"
        },
        {
            "title": "Sensex, Nifty poised for a muted start ahead of RBI MPC meet; Key levels to track on June 5",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-poised-for-a-muted-start-ahead-of-rbi-mpc-meet-key-levels-to-track-on-june-5-13097268.html",
            "description": "Markets are watching the RBI closely, with rate-sensitive stocks in focus, as the central bank is expected to cut the key lending rate by 25 basis points on Friday.",
            "pubDate": "2025-06-05T02:56:05.804066"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a muted start; Force Motors, Indosolar, Diamond Power in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-05-06-2025-liveblog-13097232.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  US stocks ended mixed on Wednesday, with the benchmark S&P 500 flat, the technology-heavy Nasdaq Composite slightly up and the Dow Jones Industrial Average down as weak data revealed the economic toll taken by President Donald Trump's trade policies.",
            "pubDate": "2025-06-05T02:56:05.804146"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-107-13095151.html",
            "description": "The Foreign institutional investors (FIIs) snapped three-day selling as they purchased equities worth Rs 1,076 crore on June 4, while Domestic institutional investors (DIIs) extended buying on 12th day as they bought equities of Rs 2,566 crore on the same day.",
            "pubDate": "2025-06-05T02:56:05.804366"
        },
        {
            "title": "Trade Spotlight: How should you trade JSW Infrastructure, Dabur, RITES, APL Apollo Tubes, Container Corporation, PB Fintech and others on June 5?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-jsw-infrastructure-dabur-rites-apl-apollo-tubes-container-corporation-pb-fintech-and-others-on-june-5-13097090.html",
            "description": "Market sentiment may improve further with the fall in India VIX and amid hopes of a 25 bps cut in the repo rate in the policy meeting on June 6. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-06-05T02:56:05.804447"
        }
    ]
}