{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-05T05:48:14.505189",
    "items": [
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a weak start; US, Asian markets fall",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-05-11-2024-liveblog-12858135.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed slightly lower after a choppy session on Monday, as investors prepared for a crucial week in which Americans will elect a new president and the Federal Reserve will announce its policy statement. The Dow Jones Industrial Average fell 257.59 points, or 0.61%, to 41,794.60, the S&P 500 lost 16.11 points, or 0.28%, to 5,712.69 and the Nasdaq Composite lost 59.93 points, or 0.33%, to 18,179.98.",
            "pubDate": "2024-11-05T02:21:47.988725"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-71-12857990.html",
            "description": "The GIFT Nifty is indicating a negative start for the day.",
            "pubDate": "2024-11-05T02:21:47.988819"
        },
        {
            "title": "Stock Radar: ABB India, Raymond, JK Paper, Gland Pharma, Tilaknagar, Amara Raja Energy in focus on Tuesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-abb-india-raymond-jk-paper-gland-pharma-tilaknagar-amara-raja-energy-in-focus-on-tuesday-12858122.html",
            "description": "Stocks  like Indian Railway Catering and Tourism Corporation, Dhampur Bio Organics, KEC International, Bata India, Sundaram Finance, Embassy Office Parks REIT, and Afcons Infrastructure will also be in focus on October 5.",
            "pubDate": "2024-11-05T02:21:47.988900"
        },
        {
            "title": "Trade Spotlight: How should you trade Abbott India, NALCO, ITC, Vishnu Chemicals, Power Grid, and others on Tuesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-abbott-india-nalco-itc-vishnu-chemicals-power-grid-and-others-on-tuesday-12858103.html",
            "description": "The bearish sentiment is expected to continue, as the market traded well below all key moving averages (10-20-50-100 EMAs). Below are some trading ideas for the near term.",
            "pubDate": "2024-11-05T02:21:47.988971"
        },
        {
            "title": "Brokerage Radar: Citi lowers Exide's target price, Morgan Stanley stays 'Overweight' on Apollo Hospitals",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-citi-lowers-exides-target-price-morgan-stanley-stays-overweight-on-apollo-hospitals-12858172.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Exide Industries, Bata India, Apollo Hospitals and more.",
            "pubDate": "2024-11-05T02:57:11.130161"
        },
        {
            "title": "Live: How much more fall is in store for Nifty? | Dr Reddy's, Titan in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-how-much-more-fall-is-in-store-for-nifty-dr-reddys-titan-in-focus-opening-bell-12858216.html",
            "description": "Benchmark indices Sensex and Nifty clocked biggest single day losses in a month in the previous session, weighed by index heavyweights. Factors such as tight fight in the US Presidential elections, Fed's interest rate decision, more Chinese stimulus measures on the horizon kept market mood in check. With Nifty nearly 9 percent down from record highs, experts expect the index to face resistance at 24,200, with support placed around 23,500. This morning global cues are mixed, with Wall Street ending overnight on a weak note. Asia-Pacific markets, meanwhile, were mixed this morning. Among stocks in focus, watch out for Dr Reddy's, Titan, and Raymond India. Catch Lovisha Darad in conversation with Osho Krishan, Sr. Analyst - Technical & Derivative Research, Angel One and Kranthi Bathini - Equity strategist at WealthMills Securities.\n#sharemarket #stockmarket #marketopeningbell #ipo #nifty #sensex",
            "pubDate": "2024-11-05T03:18:45.989565"
        },
        {
            "title": "Agri Picks Report November 05, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-november-05-2024-geojit-financial-services-12858230.html",
            "description": "According to Geojit, Farmers in Andhra Pradesh have sown rabi crops over 101,000 hectares as of Wednesday, down 33.1% from 151,000 hectares sown in the same period last year, according to the first rabi sowing report of the season released by the state's government.",
            "pubDate": "2024-11-05T03:35:38.200920"
        },
        {
            "title": "Chart of the Day: Q2 cement demand weakest in two years",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-q2-cement-demand-weakest-in-two-years-12858183.html",
            "description": "After subdued Q1 and Q2, hopes now are pinned on recovery in H2 FY25",
            "pubDate": "2024-11-05T03:35:38.201011"
        },
        {
            "title": "Why investors should back this NBFC amid the asset quality stress",
            "link": "https://www.moneycontrol.com/news/business/earnings/why-back-this-nbfc-amid-the-asset-quality-stress-12858225.html",
            "description": "The conservative approach to lending with focus on asset quality is a big positive",
            "pubDate": "2024-11-05T04:25:53.691565"
        },
        {
            "title": "Nifty, Sensex extend losses as investors brace for US election, Fed meet; FII selling to persist",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-extend-losses-as-investors-brace-for-us-election-fed-meet-fii-selling-to-persist-12858208.html",
            "description": "Stock Market News: Investors are bracing for a pivotal week with two major events on the horizon: the U.S. presidential election and the Federal Reserve’s monetary policy meeting.",
            "pubDate": "2024-11-05T04:25:53.691689"
        },
        {
            "title": "SG Mart| Scalable growth prospects with huge addressable market| Good Time to Buy?",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/sg-mart-scalable-growth-prospects-with-huge-addressable-market-good-time-to-buy-12858332.html",
            "description": "SG Mart operates in a massive total addressable market, which is traditional, fragmented, and unorganized.  The company has carved out three revenue streams related to the steel sector. The first one is pure trading of metals - where it is already doing 50,000-60,000 tons of monthly volumes, which is two times the largest distributor in the country. Secondly, it has set-up service centers to provide processed steel to automobile and consumer durable OEMs. The third is the retail distribution business of non-steel pipe products for which SG Mart will be using the APL Apollo brand free of cost.\n\nDescription:  SG Mart, an APL Apollo group company, is an emerging tech-based B2B (business-to-business) marketplace for construction materials with a huge addressable market. The company is in the midst of a hyper growth phase as the share of online B2B marketplace in the domestic construction materials market is pegged at just 1-2 percent, very minuscule, compared to the US and China, where it is around 15-20 percent.\n\n \n\nFor more details on the stock and the investment rationale, visit our Moneycontrol Research page\n\n #stockmarket #stockoftheday #bse #nse #stockstobuynow #stocksinfocus #stockmarketnews",
            "pubDate": "2024-11-05T05:30:11.521913"
        },
        {
            "title": "Raymond stock jumps 2% on stellar Q2 earnings driven by real estate, engineering gains",
            "link": "https://www.moneycontrol.com/news/business/markets/raymond-stock-jumps-2-on-stellar-q2-earnings-driven-by-real-estate-engineering-gains-12858323.html",
            "description": "Raymond shares surged as the company reported stellar Q2 results, with profit soaring 112 percent YoY to Rs 59 crore and revenue jumping 122 percent YoY to Rs 1,044 crore, driven by strong growth across segments.",
            "pubDate": "2024-11-05T05:30:11.522002"
        },
        {
            "title": "P&G, TilakNagar Industries, Amara Raja Energy & Mobility in Focus| Stocks on Radar",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/pg-tilaknagar-industries-amara-raja-energy-mobility-in-focus-stocks-on-radar-12858363.html",
            "description": "ABB India Q3 profit jumps 22% YoY to Rs 440 crore; operating margin beats estimates, up 280 bps,Amara Raja Energy & Mobility Q2 profit grows 6.3% YoY to Rs 241 crore, operating margin drops 55 bps,Amara Raja Energy & Mobility Q2 profit grows 6.3% YoY to Rs 241 crore, operating margin drops 55 bps,Tilaknagar Industries Q2 profit jumps 57% YoY to Rs 58.2 crore on strong operating margin,Procter & Gamble Health Q1 profit surges 26% YoY to Rs 82 crore, operating margin spikes 730 bps with fall in input cost,Gland Pharma Q2 profit falls 16% YoY to Rs 163.5 crore despite growth in revenue. Operating margin down 250 bps",
            "pubDate": "2024-11-05T05:48:13.965285"
        }
    ]
}