{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-28T15:32:09.484421",
    "items": [
        {
            "title": "UltraTech’s wires and cables foray: A high-voltage hazard for incumbents?",
            "link": "https://www.moneycontrol.com/news/business/stocks/ultratech-s-wires-and-cables-foray-a-high-voltage-hazard-for-incumbents-12952666.html",
            "description": "The W&C industry size is estimated at Rs 80,000 crore, having delivered a CAGR of 12-13% between FY19 and FY24 The shift from the unorganised to the organised market provides an attractive opportunity for a new player",
            "pubDate": "2025-02-28T04:55:21.959356"
        },
        {
            "title": "Stocks to Watch: PB Fintech, HCL Tech, Tata Power, GE Power in focus on 28 Feb",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/stocks-to-watch-pb-fintech-hcl-tech-tata-power-ge-power-in-focus-on-28-feb-12952642.html",
            "description": "Naveen Kukreja is stepping down from his operational role at Paisabazaar and will take on a new role as Group President at PB Fintech, with Santosh Agarwal appointed CEO and Neeraj Tripathi as CFO, effective March 1. HCL Technologies has partnered with Children’s Minnesota to enhance operational efficiency and patient care through AI. Tata Power’s solar arm, TP Solar, secured a Rs 632 crore contract from SECI to supply 292.5 MWp DCR solar modules. Transrail Lighting won new orders worth Rs 2,752 crore, pushing its year-to-date order inflows to over Rs 7,400 crore. Meanwhile, GE Power India has received a Rs 273.5 crore contract from Greenko KA01 IREP for a 320 MW unit at Saundatti PSP, building on their previous deal. These developments are expected to drive focus in today's market.",
            "pubDate": "2025-02-28T04:55:21.959434"
        },
        {
            "title": "Transrail Lighting shares surge 5% after new orders worth Rs 2,752 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/transrail-lighting-shares-surge-5-after-new-orders-worth-rs-2-752-crore-12952661.html",
            "description": "With the fresh order wins, Transrail's year-to-date order inflows have crossed Rs 7,400 crore, a growth of nearly 90 percent compared to last year.",
            "pubDate": "2025-02-28T04:55:21.959503"
        },
        {
            "title": "Schaeffler India shares climb 3% on double-digit profit growth in Q4",
            "link": "https://www.moneycontrol.com/news/business/markets/schaeffler-india-shares-climbs-3-on-double-digit-profit-growth-in-q4-12952627.html",
            "description": "Schaeffler India’s net profit rose 13.2 percent year-on-year (YoY) to Rs 237 crore in Q4",
            "pubDate": "2025-02-28T04:55:21.959570"
        },
        {
            "title": "Agri Picks Report February 28, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-february-28-2025-geojit-financial-services-12952648.html",
            "description": "According to Geojit Financial Services, Farmers in the country have sown summer crops across 2.23 million hectares as of Friday, up 2.2% from a year ago, according to data from the agriculture ministry.",
            "pubDate": "2025-02-28T04:55:21.959637"
        },
        {
            "title": "Live: Will March Bring Some Respite After Five Negative F&O Series? Q3 GDP Data Today| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-march-bring-some-respite-after-five-negative-f-o-series-q3-gdp-data-today-opening-bell-12952615.html",
            "description": "March F&O series is expected to start on a muted note going by what the GIFT Nifty is indicating. Global cues are weak as Trump confirms tariffs on Mexico, Canada to take effect March 4 and the additional 10% levy on China. The Nifty 50 clocked a fifth straight series of negative returns and lost 4% in the Feb series. Q3 GDP data will be announced today. Granules India, PB Fintech and new F&O entrants including Tata Tech, IREDA, IIFL Finance will be in focus. Catch Nandita Khemka in conversation with Siddarth Bhamre, Institutional Research Head - ACMIIL (Asit C Mehta Investment Interrmediates and Raja Venkatraman, Co-Founder, NeoTrader.",
            "pubDate": "2025-02-28T04:55:21.959705"
        },
        {
            "title": "Brokerages trim target prices on Jubilant Foodworks on disappointing margin guidance",
            "link": "https://www.moneycontrol.com/news/business/stocks/brokerages-trim-target-prices-on-jubilant-foodworks-on-disappointing-margin-guidance-12952617.html",
            "description": "Jubilant Foodworks guided 200 bps PAT margin scale-up over the next three years, which left brokerages disappointed.",
            "pubDate": "2025-02-28T04:55:21.959770"
        },
        {
            "title": "Agrochemical exporters face new risk to earnings from Trump’s reciprocal tariffs",
            "link": "https://www.moneycontrol.com/news/opinion/agrochemical-exporters-face-new-risk-to-earnings-from-trumps-reciprocal-tariffs-12952600.html",
            "description": "Inventory destocking and price erosion adversely impacted global agrochemical industry growth in 2024.",
            "pubDate": "2025-02-28T04:55:21.959838"
        },
        {
            "title": "Coal India's Rs 300/tonne levy across Northern Coalfields mines is a positive surprise, say brokerages",
            "link": "https://www.moneycontrol.com/news/business/stocks/coal-india-s-rs-300-tonne-levy-across-northern-coalfields-mines-is-a-positive-surprise-say-brokerages-12952595.html",
            "description": "Coal India Shares: Brokerages are more optimistic that Coal India’s other subsidiaries too can levy charges/take price hikes when costs increase.",
            "pubDate": "2025-02-28T04:55:21.959904"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-55-12951805.html",
            "description": "The Foreign institutional investors (FIIs) sold equities worth Rs 556 crore on February 27. However, domestic institutional investors (DIIs) bought equities worth Rs 1727 crore, on the same day.",
            "pubDate": "2025-02-28T04:55:21.959987"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex plunges 1,000 pts, Nifty below 22,250; mid, smallcap down 2% each",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-28-02-2025-liveblog-12952580.html",
            "description": "Sensex Today | Stock Market LIVE Updates: All the sectoral indices are trading in the red with IT, auto, media, telecom down 2-3 percent. IndusInd Bank, M&M, Wipro, Tech Mahindra, Infosys are among major losers on the Nifty, while gainers are Coal India, Shriram Finance, Reliance Industries, Grasim. BSE Midcap and smallcap indices down 2 percent each.",
            "pubDate": "2025-02-28T04:55:21.960056"
        },
        {
            "title": "Stocks to Watch Today: HCL Tech, Sanofi India, KSB, PB Fintech, Transrail Lighting, Tata Power, Granules India, Kernex in focus on 28 February",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hcl-tech-sanofi-india-ksb-pb-fintech-transrail-lighting-tata-power-granules-india-kernex-in-focus-on-28-february-12952568.html",
            "description": "Stocks to Watch, Feb 28: Stocks like Schaeffler India, GE Power India, Coal India, Servotech Renewable Power System, Chemplast Sanmar, Rail Vikas Nigam, Life Insurance Corporation of India, InterGlobe Aviation, SpiceJet, Orient Technologies, Kisan Mouldings, HP Telecom India, and Swasth Foodtech India will be in focus on February 28.",
            "pubDate": "2025-02-28T04:55:21.960121"
        },
        {
            "title": "Trade Spotlight: How should you trade SRF, Berger Paints, Narayana Hrudayalaya, SBI Card, Bajaj Finance, and others on February 28?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-srf-berger-paints-narayana-hrudayalaya-sbi-card-bajaj-finance-and-others-on-february-28-12952556.html",
            "description": "The consolidation is expected to continue until the indices decisively break the range of the last three days on either side. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-28T04:55:21.960185"
        },
        {
            "title": "Angel One's AWS resources compromised in data leakage, sending shares lower by over 4%",
            "link": "https://www.moneycontrol.com/news/business/stocks/angel-one-s-aws-resources-compromised-in-data-leakage-sending-shares-lower-by-over-4-12953016.html",
            "description": "Angel One discovered that some if its Amazon Web Services (AWS) resources were compromised after its dark-web monitoring partner alerted the company about a data leakage post on unauthorized access of its clients' data.",
            "pubDate": "2025-02-28T07:52:44.659485"
        },
        {
            "title": "Smallcap, midcap indices crash over 3%, Rs 18 lakh crore eroded since correction began",
            "link": "https://www.moneycontrol.com/news/business/stocks/smallcap-midcap-indices-crash-over-2-rs-18-lakh-crore-eroded-since-correction-began-12952750.html",
            "description": "Mid- and small-cap indices are in bear territory by falling 21% and 25% from peaks, respectively. Meanwhile, Nifty 50 declined 15% from its all-time high",
            "pubDate": "2025-02-28T07:52:44.659904"
        },
        {
            "title": "Sanofi India shares rise 4% on strong topline and operational show, net profit sharply lower",
            "link": "https://www.moneycontrol.com/news/business/stocks/sanofi-india-shares-rise-4-on-strong-topline-and-operational-show-net-profit-sharply-lower-12952695.html",
            "description": "Sanofi’s cardiovascular (CV) and central nervous system (CNS) therapies have gained traction, supported by partnerships. Rodolfo Hrosz, Managing Director of Sanofi India said the execution of these partnerships has met expectations, pointing to promising growth potential in coming quarters.",
            "pubDate": "2025-02-28T07:52:44.659968"
        },
        {
            "title": "IRCTC: Why this journey offers value for money",
            "link": "https://www.moneycontrol.com/news/business/irctc-why-this-journey-offers-value-for-money-12952647.html",
            "description": "IRCTC enjoys an envious position in the domestic travel and tourism industry, with its monopoly in railway ticketing, catering and packaged water business, and its affordable tourism packages",
            "pubDate": "2025-02-28T07:52:44.660034"
        },
        {
            "title": "IREDA shares slump over 7% as it enters F&O segment; stock down 50% from peak",
            "link": "https://www.moneycontrol.com/news/business/markets/ireda-shares-slump-over-7-as-it-enters-f-o-segment-stock-down-50-from-peak-12952811.html",
            "description": "IREDA shares have also lost over 20 percent in February alone, marking its steepest monthly decline since its listing in December 2023",
            "pubDate": "2025-02-28T07:52:44.660162"
        },
        {
            "title": "TechM, Wipro, other IT stocks decline up to 5%, extend losses for 7th session on fears of trade war, slowing US economy",
            "link": "https://www.moneycontrol.com/news/business/markets/techm-wipro-other-it-stocks-decline-up-to-5-extend-losses-for-7th-session-on-trade-war-fears-slowing-us-economy-12952748.html",
            "description": "The IT index tumbled 4% as data showed that US weekly jobless claims rose more than expected last week, adding to worries that the world's largest economy may be slowing",
            "pubDate": "2025-02-28T07:52:44.660224"
        },
        {
            "title": "Accumulate Adani Ports and Special Economic Zone; target of Rs 1340: Asit C Mehta",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-adani-ports-and-special-economic-zone-target-of-rs-1340-asit-c-mehta-12952777.html",
            "description": "Asit C Mehta recommended accumulate rating on Adani Ports and Special Economic Zone with a target price of Rs 1340 in its research report dated February 20, 2025.",
            "pubDate": "2025-02-28T07:52:44.660287"
        },
        {
            "title": "Nifty is like Shah Rukh Khan, had bad patches, but delivered most of the times: Edelweiss MF’s Radhika Gupta",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-is-like-shah-rukh-khan-had-bad-patches-but-delivered-most-of-the-times-edelweiss-mf-s-radhika-gupta-12953557.html",
            "description": "In an event held to empower female retail investors and build financial literacy, Gupta suggests to not panic as a result of the current stock market volatility and choose long-term commitment to investments.",
            "pubDate": "2025-02-28T15:31:57.700573"
        },
        {
            "title": "US Markets: S&P500, Dow Jones edge higher; Nasdaq falls as Nvidia shares crack further",
            "link": "https://www.moneycontrol.com/news/business/markets/us-markets-s-p500-dow-jones-edge-higher-nasdaq-falls-as-nvidia-shares-crack-further-12953565.html",
            "description": "Fresh inflation data showed the Federal Reserve’s preferred gauge, the personal consumption expenditures (PCE) price index, rose 0.3 percent in January",
            "pubDate": "2025-02-28T15:31:57.700671"
        },
        {
            "title": "Bears roar: More than 900 stocks hit 52-week low amid market selloff on February 28",
            "link": "https://www.moneycontrol.com/news/business/markets/bears-roar-more-than-900-stocks-hit-52-week-low-amid-market-selloff-on-february-28-12953434.html",
            "description": "The Sensex and Nifty tumbled nearly 2 percent, dragged down by broad-based losses amid escalating fears of a full-scale global trade war and concerns over a slowing U.S. economy.",
            "pubDate": "2025-02-28T15:31:57.700743"
        },
        {
            "title": "FII net sell shares worth Rs 11,639 crore, DIIs net buyers of Rs 12,309 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/fii-net-sell-shares-worth-rs-11-639-crore-diis-net-buyers-of-rs-12-309-crore-12953376.html",
            "description": "The Sensex and Nifty plunged nearly 2 percent on February 28, dragged down by a broad-based sell-off as fears of a full-blown global trade war and a slowing U.S. economy unsettled investors. The rout wiped out Rs 8.8 lakh crore in market capitalization.",
            "pubDate": "2025-02-28T15:31:57.700814"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on February 28",
            "link": "https://www.moneycontrol.com/news/business/markets/top-gainers-and-losers-today-stocks-that-moved-the-most-on-february-28-12953217.html",
            "description": "On February 28, all the 13 sectoral indices ended in red, with Sensex shedding another 1.82 percent and Nifty witnessed 1.79 percent decline.",
            "pubDate": "2025-02-28T15:31:57.700881"
        },
        {
            "title": "Taking Stock: Sensex, Nifty crack nearly 2% amid trade wear fears; broader markets plunge further",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-sensex-nifty-crack-nearly-2-amid-trade-wear-fears-broader-markets-plunge-further-12953251.html",
            "description": "As many as 908 stocks hit a 52-week low in today's session. Tata Motors from the Nifty pack plunged 4 percent to a low of Rs 623.",
            "pubDate": "2025-02-28T15:31:57.700948"
        },
        {
            "title": "Govt's STT collection won't be even 50% of FY26 estimates amid market correction: Zerodha's Nithin Kamath",
            "link": "https://www.moneycontrol.com/news/business/markets/govt-s-stt-collection-won-t-be-even-50-of-fy26-estimates-amid-market-correction-zerodha-s-nithin-kamath-12953215.html",
            "description": "'We are seeing degrowth in the business for the first time since we started 15 years ago,' says Kamath",
            "pubDate": "2025-02-28T15:31:57.701013"
        },
        {
            "title": "Live: Nifty Slumps Over 400 Points; Midcaps Crash As Selloff Deepens| IT, Autos Worst Hit| Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-slumps-over-400-points-midcaps-crash-as-selloff-deepens-it-autos-worst-hit-closing-bell-12953231.html",
            "description": "Nifty slides to 9-month low. Nifty's swing low today - 22,105. Nifty breaks below 22,200; sheds over 2% for the week. Mid & smallcaps drop over 2.5-3% each. All sectors bleed led by IT & autos. IREDA, Tata Tech, Patanjali shares fall up to 10% on day 1 in F&O. Catch Nandita Khemka and Yatin Mota in conversation with Shrikant Chouhan, Head of Equity Research, Kotak Securities.",
            "pubDate": "2025-02-28T15:31:57.701079"
        },
        {
            "title": "Granules shares fall 8% as US FDA issues warning letter after inspection at firm's Gagillapur facility",
            "link": "https://www.moneycontrol.com/news/business/stocks/granules-shares-fall-8-as-us-fda-issues-warning-letter-after-inspection-at-firm-s-gagillapur-facility-12953185.html",
            "description": "Granules added that manufacturing and distribution of its existing products at the facility will continue unaffected.",
            "pubDate": "2025-02-28T15:31:57.701143"
        },
        {
            "title": "Tata Motors shares nosedive 4%, hit 52-week low amid market selloff",
            "link": "https://www.moneycontrol.com/news/business/markets/tata-motors-shares-nosedive-4-hit-52-week-low-amid-market-selloff-12953172.html",
            "description": "Tata Motors share price: This also marks its seventh consecutive month in the red, the longest losing streak since 2015, when the stock slumped for seven straight months before staging a recovery.",
            "pubDate": "2025-02-28T15:31:57.701336"
        }
    ]
}