{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-03T14:34:44.202858",
    "items": [
        {
            "title": "February 2025 auto sales: A mixed bag",
            "link": "https://www.moneycontrol.com/news/business/companies/february-2025-auto-sales-a-mixed-bag-12954473.html",
            "description": "The auto sector reported a year-on year growth. However, subdued consumer sentiment continued to impact volumes.",
            "pubDate": "2025-03-03T04:21:36.350904"
        },
        {
            "title": "Metropolis focuses on North India expansion, acquires Agra-based Scientific Pathology",
            "link": "https://www.moneycontrol.com/news/business/companies/metropolis-focuses-on-north-india-expansion-acquires-agra-based-scientific-pathology-12955160.html",
            "description": "Scientific Pathology was the second acquisition in last three months in North India for Metropolis. The company has  acquired Delhi NCR-based specialty cancer testing chain Core Diagnostics for Rs 247 crore through a combination of cash and stock in December last year.",
            "pubDate": "2025-03-03T14:34:40.976885"
        },
        {
            "title": "Air India to operate Delhi-Tokyo flights from Haneda airport, expands codeshare with ANA",
            "link": "https://www.moneycontrol.com/news/business/companies/air-india-to-operate-delhi-tokyo-flights-from-haneda-airport-expands-codeshare-with-ana-12955082.html",
            "description": "Air India’s Delhi-Tokyo Haneda flights will continue to be operated with Air India’s Boeing 787-8 Dreamliner aircraft, featuring 18 Business Class flatbeds and 238 economy seats.",
            "pubDate": "2025-03-03T14:34:40.976973"
        },
        {
            "title": "Scions of India's old family businesses are just picking up the threads; financing is in their business genes",
            "link": "https://www.moneycontrol.com/news/opinion/scions-of-india-s-old-family-businesses-are-just-picking-up-the-threads-financing-is-in-their-business-genes-12954849.html",
            "description": "Today’s heirs may prefer looking for attractive investment opportunities through family offices. By doing so, they are taking a leaf out the playbook of their forebears, who also financed other businesses. The more important thing is these older family businesses manage their family offices well and not get wiped out as not everyone is a chip off the old block.",
            "pubDate": "2025-03-03T14:34:40.977048"
        },
        {
            "title": "CSB Bank: Could gold’s glitter lead to a valuation re-rating?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/csb-bank-could-gold-s-glitter-lead-to-a-valuation-re-rating-12954707.html",
            "description": "CSB Bank benefits immensely from a gold loan portfolio that has higher yields, low credit costs and lower risk weights, offsetting pressures facing small banks",
            "pubDate": "2025-03-03T14:34:40.977120"
        },
        {
            "title": "International Gemmological Institute of India: A niche play with healthy growth prospects",
            "link": "https://www.moneycontrol.com/news/business/stocks/international-gemmological-institute-of-india-a-niche-play-with-healthy-growth-prospects-12954501.html",
            "description": "IGIL is well-placed to deliver a healthy earnings growth in the medium term, driven by the increasing traction of lab-grown diamonds globally.",
            "pubDate": "2025-03-03T14:34:40.977192"
        }
    ]
}