{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-22T02:44:12.105526",
    "items": [
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat opening; US markets fall, Asia trades mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-22-04-2025-liveblog-13000403.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  US stocks suffered steep losses on Monday as U.S. President Donald Trump ramped up his attacks on Federal Reserve Chair Jerome Powell, prompting investors to worry about the central bank's independence even as they grapple with the effects of Trump's ongoing, erratic trade war.",
            "pubDate": "2025-04-22T02:44:10.369929"
        },
        {
            "title": "Trade Spotlight: How should you trade LIC, CDSL, SBI, Sun Pharma, Hindalco, Adani Green Energy, and others on April 22?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-lic-cdsl-sbi-sun-pharma-hindalco-adani-green-energy-and-others-on-april-22-13000359.html",
            "description": "After a consistent five-day rally, the market may consolidate, though the overall trend remains positive. Below are some trading ideas for the near term.",
            "pubDate": "2025-04-22T02:44:10.370021"
        },
        {
            "title": "Stocks to Watch Today: HUL, Coal India, Gandhar Oil Refinery, Nureca, Paytm, HG Infra, Tata Power, Anant Raj in focus on 22 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hul-coal-india-gandhar-oil-refinery-nureca-paytm-hg-infra-tata-power-anant-raj-in-focus-on-22-april-13000357.html",
            "description": "Stocks to Warch, 22 Apr: Stocks like Rajratan Global Wire, Alok Industries, Tata Investment Corporation, Himadri Speciality Chemical, Pitti Engineering, Mahindra Logistics, Vedanta, Brigade Enterprises, Gujarat Alkalies and Chemicals, and Mazagon Dock Shipbuilders will be in focus on April 22.",
            "pubDate": "2025-04-22T02:44:10.370098"
        }
    ]
}