{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-31T09:50:36.763523",
    "items": [
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-4-12900497.html",
            "description": "Wall Street ended in the negative territory overnight while most Asian markets remained closed today. Trends from the GIFT Nifty suggest a gap-down start for the domestic market on the last trading day of 2024.",
            "pubDate": "2024-12-31T02:21:59.785522"
        },
        {
            "title": "Trade Spotlight: How should you trade Lupin, United Spirits, Blue Star, Hindustan Unilever, Escorts, IREDA, and others on December 31?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-lupin-united-spirits-blue-star-hindustan-unilever-escorts-ireda-and-others-on-december-31-12900545.html",
            "description": "Benchmark indices are expected to remain under bearish control as long as they trade below all key moving averages. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-31T02:21:59.785611"
        },
        {
            "title": "Stocks to Watch Today: ITC, Lupin, Easy Trip, Unimech Aerospace, Mazagon Dock, Shriram Properties, Tanvi Foods, Hindalco in focus on 31 December",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-itc-lupin-easy-trip-unimech-aerospace-mazagon-dock-shriram-properties-tanvi-foods-hindalco-in-focus-on-31-december-12900533.html",
            "description": "Stocks To Watch Today, Dec 31: Stocks like Rail Vikas Nigam, CESC, Dhanlaxmi Bank, Jubilant Ingrevia, Adani Green Energy, Archean Chemical Industries, Century Enka, Bank of India, Prataap Snacks, Power Grid Corporation of India, SBI Life Insurance Company, and GMR Airports Infrastructure will also be in focus on December 31.",
            "pubDate": "2024-12-31T02:21:59.785711"
        },
        {
            "title": "Live: Will Nifty move positively on final day of 2024? | ITC, RVNL in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-move-positively-on-final-day-of-2024-itc-rvnl-in-focus-opening-bell-12900586.html",
            "description": "Benchmark indices Sensex and Nifty fell over 1 percent from day's highs and settled lower in the last session. On this final day of 2024, Nifty has already gained over 8 percent and is poised to end this year on a positive note, marking ninth consecutive year of good returns. Broader indices, on the other hand, have outperformed benchmarks this year. Today, the Street is eyeing Nifty's resistance at 23,900, with support placed around 23,500. This morning, global cues were mixed. US markets ended lower overnight, with headline indices down 1 percent each. Asia-Pacific markets also traded mixed this morning as investors digested China's manufacturing data. Among stocks in focus, watch out for ITC, Hindalco, and RVNL. Catch Lovisha Darad in conversation with Aamar Deo Singh, Senior Vice President, Angel One and Kunal Valia, Founder, StatLane.",
            "pubDate": "2024-12-31T03:36:02.479105"
        },
        {
            "title": "Sensex tanks nearly 500 points, Nifty below 23,550 in final session of 2024; IT, realty stocks tumble",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-tanks-nearly-500-points-nifty-below-23-550-in-final-session-of-2024-it-realty-stocks-tumble-12900565.html",
            "description": "In today's session, the IT index was the worst performer with losses of almost 2 percent. A sharp downturn in Infosys, TCS, and HCL Tech dragged the index lower.",
            "pubDate": "2024-12-31T04:53:36.347878"
        },
        {
            "title": "Jubilant FoodWorks: India business outlook improving, but valuation expensive",
            "link": "https://www.moneycontrol.com/news/business/stocks/jubilant-foodworks-india-business-outlook-improving-but-valuation-expensive-12900635.html",
            "description": "Improvement in Dominos same-store sales growth and scale-up of Popeyes franchise remain key growth triggers",
            "pubDate": "2024-12-31T04:53:36.348046"
        },
        {
            "title": "Indo Farm Equipment IPO: A quality issue at a steep valuation",
            "link": "https://www.moneycontrol.com/news/business/stocks/indo-farm-equipment-ipo-a-quality-issue-at-a-steep-valuation-12900588.html",
            "description": "Strong backward integration helps the company sustain high EBITDA margin",
            "pubDate": "2024-12-31T04:53:36.348193"
        },
        {
            "title": "Easy Trip Planners tanks 10% after co-founder Nishant Pitti likely offloads Rs 53 cr stake",
            "link": "https://www.moneycontrol.com/news/business/markets/easy-trip-planners-tanks-10-after-co-founder-nishant-pitti-offloads-rs-53-cr-stake-12900568.html",
            "description": "Moneycontrol had exclusively reported Pitti’s plan to divest his remaining 14 percent stake in Easy Trip Planners, aiming to raise around Rs 780 crore through the sale.",
            "pubDate": "2024-12-31T04:53:36.348382"
        },
        {
            "title": "Stock Market LIVE Updates | Indices slip further into red; Sensex tanks 500 pts, Nifty breaks below 23,550",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-gift-nifty-signals-weak-opening-amid-global-market-selloff-liveblog-12900557.html",
            "description": "Stock Market LIVE Updates| US stocks ended on a weak note as continued declines in technology shares extended a losing streak triggered by the Federal Reserve tempering hopes for rate cuts. The S&P 500 and Nasdaq 100 marked their third consecutive drop, each falling over 1% in three of the last eight sessions. The Bloomberg Dollar Spot Index is poised for its best year since 2015, while Treasuries rallied, with the 10-year yield stabilizing around 4.54%.",
            "pubDate": "2024-12-31T04:53:36.348910"
        },
        {
            "title": "Agri Picks Report December 31, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-31-2024-geojit-financial-services-12900677.html",
            "description": "According to Geojit Financial Services, The water level in 155 key reservoirs in the country fell to 135.404 billion cubic metres as of Thursday from 139.392 billion cubic metres on Dec.",
            "pubDate": "2024-12-31T05:08:35.562685"
        },
        {
            "title": "Shriram Property stocks gain 5% with announcement of 4 acre land parcel",
            "link": "https://www.moneycontrol.com/news/business/stocks/shriram-property-stocks-gain-5-with-announcement-of-4-acre-land-parcel-12900668.html",
            "description": "The land has been sold to a prominent South Indian healthcare and educational group; strategically located on GST Road that renders high value to the property",
            "pubDate": "2024-12-31T05:08:35.562775"
        },
        {
            "title": "Adani Wilmar shares down 7% a day after Adani's exit from FMCG business",
            "link": "https://www.moneycontrol.com/news/business/markets/adani-wilmar-shares-down-7-a-day-after-adani-s-exit-from-fmcg-business-12900680.html",
            "description": "Adani Wilmar shares are lower by 17% in 2024. JPMorgan's note has ascribed an Underweight with a target of Rs 320 per share, adding that the company has significant sourcing, supply chain and scale advantages.",
            "pubDate": "2024-12-31T05:28:37.529010"
        },
        {
            "title": "Tech majors TCS, Infosys, Tech Mahindra drop 2-3%; IT index worst hit sector, slips 2%",
            "link": "https://www.moneycontrol.com/news/business/markets/tech-majors-tcs-infosys-tech-mahindra-drop-2-3-it-index-worst-hit-sector-slips-2-12900675.html",
            "description": "All six large-cap IT majors fell between 1-3 percent, while mid-cap players like Coforge, L&T Tech, Mphasis, and Persistent Systems saw declines of 1-4 percent.",
            "pubDate": "2024-12-31T06:35:54.634541"
        },
        {
            "title": "Zinka Logistics locked in 5% lower circuit for second day after Morgan Stanley's 'underweight' call",
            "link": "https://www.moneycontrol.com/news/business/markets/zinka-logistics-locked-in-5-lower-circuit-for-second-day-after-morgan-stanley-s-underweight-call-12900747.html",
            "description": "Zinka Logistics stock has already surged over 100 percent since its market debut last month, which, according to Morgan Stanley, makes it less attractive at current levels.",
            "pubDate": "2024-12-31T06:54:38.475929"
        },
        {
            "title": "Sensex recovers 500 pts from day's low, Nifty above 23,600 as pharma, auto stocks gain; IT index bleeds 2%",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-recovers-500-pts-from-day-s-low-nifty-above-23-600-as-pharma-auto-stocks-gain-it-index-bleeds-2-12900709.html",
            "description": "The small and midcap stocks also mirrored weak trends with losses of 0.2 and 0.4 percent, respectively. The two have remained more resilient, falling just 5 percent in the last three months against Nifty's 9 percent decline.",
            "pubDate": "2024-12-31T07:10:07.516313"
        },
        {
            "title": "Shrimp stocks Avanti Feeds and Apex Frozen Foods soar 6% after Incred predicts strong industry comeback in 2025",
            "link": "https://www.moneycontrol.com/news/business/markets/shrimp-stocks-avanti-feeds-and-apex-frozen-foods-soar-6-after-incred-predicts-strong-industry-comeback-in-2025-12900771.html",
            "description": "Incred anticipates a robust recovery for the shrimp industry in CY2025, driven by rebounding global demand and reduced competition from Ecuador, where overproduction has led to industry consolidation.",
            "pubDate": "2024-12-31T07:10:07.516396"
        },
        {
            "title": "Export-focused Unimech Aerospace says Make-in-India a 'massive opportunity' as listing sizzles Street",
            "link": "https://www.moneycontrol.com/news/business/markets/export-focused-unimech-aerospace-says-make-in-india-a-massive-opportunity-as-listing-sizzles-street-12900744.html",
            "description": "Unimech Aerospace said it is exploring opportunities in the nuclear power space as well as in semiconductors, along with plans to participate in domestic defence programmes.",
            "pubDate": "2024-12-31T07:33:57.150833"
        },
        {
            "title": "Venus Remedies shares rise 3% as Moldova GMP nod paves way for East Europe expansion",
            "link": "https://www.moneycontrol.com/news/business/markets/venus-remedies-shares-rise-3-as-moldova-gmp-nod-paves-way-for-east-europe-expansion-12900930.html",
            "description": "The approval from Moldovan Health Ministry is for Venus' antibiotic-carbapenem facility. The nod for the facility will ensure 'access to high-quality, effective, and reliable antibiotics' across the region, said Venus Remedies.",
            "pubDate": "2024-12-31T08:35:28.921263"
        },
        {
            "title": "Sensex recovers 600 pts from day's low, Nifty above 23,650 in last session of 2024; IT stocks drag, pharma gains",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-recovers-600-pts-from-day-s-low-nifty-above-23-650-in-last-session-of-2024-it-stocks-drag-pharma-gains-12900977.html",
            "description": "Going ahead, three key factors will set the tone for the first half of 2025 -- the new president of the US and any implications for global trade, the Union Budget, and the Q3 earnings.",
            "pubDate": "2024-12-31T09:50:36.028142"
        }
    ]
}