{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-19T05:14:17.759493",
    "items": [
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-13-12892839.html",
            "description": "The GIFT Nifty is indicating a gap-down start for the day.",
            "pubDate": "2024-12-19T02:17:58.781821"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a gap-down start; US, Asian markets fall post Fed rate cut",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-gift-nifty-signals-a-gap-down-start-us-asian-markets-fall-liveblog-12893487.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks plunged on Wednesday, with all three major indexes posting their biggest daily decline in months, after the Federal Reserve cut interest rates by a quarter of a percentage point but disappointed some investors with projections that signaled a more cautious path of easing next year. The Fed cut rates by 25 basis points to the 4.25%-4.50% range and its summary of economic projections (SEP) indicated it will make rate cuts totaling a half percentage point by the end of 2025 given the solid labor market and the recent stall in lowering inflation. The Dow Jones Industrial Average fell 1,123.03 points, or 2.58%, to 42,326.87, the S&P 500 lost 178.45 points, or 2.95%, to 5,872.16 and the Nasdaq Composite lost 716.37 points, or 3.56%, to 19,392.69.",
            "pubDate": "2024-12-19T02:17:58.781911"
        },
        {
            "title": "Trade Spotlight: How should you trade Bharti Hexacom, KFIN Technologies, Prestige Estates, Chambal Fertilisers, Ion Exchange, and others on Thursday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bharti-hexacom-kfin-technologies-prestige-estates-chambal-fertilisers-ion-exchange-and-others-on-thursday-12893456.html",
            "description": "Given the weak sentiment, the benchmark indices may extend their southward journey in the upcoming session. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-19T02:17:58.781992"
        },
        {
            "title": "Dow dives 1,100 pts, posts longest losing run since 1974 after Fed's cautious 2025 rate forecast",
            "link": "https://www.moneycontrol.com/news/business/markets/dow-dives-1-100-pts-posts-longest-losing-run-since-1974-after-fed-s-cautious-2025-rate-forecast-12893452.html",
            "description": "The Dow's losing streak began after it hit an all-time high, closing above 45,000 for the first time on December 4. Since then, the Dow has fallen by around 4 percent during the streak.",
            "pubDate": "2024-12-19T02:17:58.782064"
        },
        {
            "title": "Stock Radar: Inventurus Knowledge, ABB, Lupin, DOMS, Gandhar Oil Refinery, Yatharth Hospital, NITCO, Zaggle Prepaid, Yasho in focus on Thursday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-inventurus-knowledge-abb-lupin-doms-gandhar-oil-refinery-yatharth-hospital-nitco-zaggle-prepaid-yasho-in-focus-on-thursday-12893437.html",
            "description": "Stocks like Ipca Laboratories, Gujarat Toolroom, Cummins India, Asian Paints, Vardhman Polytex, ITC, State Bank of India, JSW Infrastructure, Allcargo Gati, IOL Chemicals, Brigade Enterprises, Wipro, Borosil Renewables, and IRCON International will also be in focus on December 19.",
            "pubDate": "2024-12-19T02:17:58.782133"
        },
        {
            "title": "Bulk deals : Morgan Stanley, Kotak Mahindra Bank, Tata Mutual Fund buys stakes in Shoppers Stop",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-deals-morgan-stanley-kotak-mahindra-bank-tata-mutual-fund-buys-stakes-in-shoppers-stop-12893440.html",
            "description": "Amazon.com NV Investment Holdings LLC sold 43.96 lakh shares in Shoppers Stop for an average price of Rs 627.6.",
            "pubDate": "2024-12-19T02:17:58.782222"
        },
        {
            "title": "JP Morgan initiates coverage on Swiggy; sees company emerging as \"an underappreciated winner\"",
            "link": "https://www.moneycontrol.com/news/business/stocks/jp-morgan-initiates-coverage-on-swiggy-sees-company-emerging-as-an-underappreciated-winner-12893516.html",
            "description": "Analysts at the brokerage were positive on the newly-listed food delivery service and see it catching up across both food delivery and quick commerce due to a renewed focus and improved execution.",
            "pubDate": "2024-12-19T03:37:24.712446"
        },
        {
            "title": "Soft raw material prices to support record profit margins of pharma companies",
            "link": "https://www.moneycontrol.com/news/opinion/soft-raw-material-prices-to-support-record-profit-margins-of-pharma-companies-12893495.html",
            "description": "The falling prices can pose headwinds to API producers but can benefit final drug manufacturers",
            "pubDate": "2024-12-19T03:51:20.879119"
        },
        {
            "title": "Milestone year for DIIs as net investments cross Rs 5 lakh crore for first time ever",
            "link": "https://www.moneycontrol.com/news/business/mutual-funds/milestone-year-for-diis-as-net-investments-cross-rs-5-lakh-crore-for-first-time-ever-12893494.html",
            "description": "The net purchases this year is significantly higher than the last few years as DIIs were net buyers at Rs 2.76 lakh crore in 2022 and Rs 1.81 lakh crore in 2023",
            "pubDate": "2024-12-19T04:23:26.853546"
        },
        {
            "title": "Nomura upgrades Dr Reddy's to Buy; sets target at Rs 1500 per share",
            "link": "https://www.moneycontrol.com/news/business/stocks/nomura-upgrades-dr-reddy-s-to-buy-sets-target-at-rs-1500-per-share-12893545.html",
            "description": "In FY2025, the pharma major's capital expenditure (CapEx) has more than doubled in FY25, reflecting the company's commitment to enhancing its operational capabilities, according to analysts at the brokerage.",
            "pubDate": "2024-12-19T04:23:26.853634"
        },
        {
            "title": "Agri Picks Report December 19, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-19-2024-geojit-financial-services-12893553.html",
            "description": "According to Geojit Financial Services, India's oilmeal exports in November fell 8.6% on year to 363,620 tonnes, according to data released by The Solvent Extractors' Association of India.",
            "pubDate": "2024-12-19T04:23:26.853714"
        },
        {
            "title": "Concord Enviro: Can the water treatment IPO make waves for investors?",
            "link": "https://www.moneycontrol.com/news/business/earnings/concord-enviro-can-the-water-treatment-ipo-make-waves-for-investors-12893538.html",
            "description": "Waste water management is a secular opportunity, but the company’s performance has to be consistent for valuation to rerate",
            "pubDate": "2024-12-19T04:39:38.004055"
        },
        {
            "title": "One Mobikwik Systems gains 11% post bumper debut on December 18",
            "link": "https://www.moneycontrol.com/news/business/stocks/one-mobikwik-systems-gains-11-post-bumper-debut-on-december-18-12893570.html",
            "description": "During the day, the stock hit the upper circuit, One Mobikwik Systems closed at Rs 530.70, a 20 percent increase from the listing price.",
            "pubDate": "2024-12-19T04:39:38.004149"
        },
        {
            "title": "DOMS Industries shares down 4% after FILA monetises part stake via block trade",
            "link": "https://www.moneycontrol.com/news/business/markets/doms-industries-shares-down-4-after-fila-monetises-part-stake-via-block-trade-12893610.html",
            "description": "DOMS Industries shareholder and Italian stationery maker FILA is selling up to 4.57% stake in the company via a block trade nearly a year after the IPO of the Indian unit, reducing its stake further to 26%.",
            "pubDate": "2024-12-19T05:14:16.773678"
        },
        {
            "title": "27.7 lakh shares of Godrej Industries traded in block deal; stocks falls 2%",
            "link": "https://www.moneycontrol.com/news/business/stocks/27-7-lakh-shares-of-godrej-industries-traded-in-block-deal-stocks-falls-2-12893594.html",
            "description": "27.7 lakh shares of Godrej Industries (around 0.9 percent of its equity) was traded via a block deal at Rs 1,164 per share",
            "pubDate": "2024-12-19T05:14:16.773750"
        }
    ]
}