{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-18T04:23:52.771331",
    "items": [
        {
            "title": "Shilpa Medicare shares up 2% after arm partners with Swiss-based mAbTree Biologics for cancer drug",
            "link": "https://www.moneycontrol.com/news/business/markets/shilpa-medicare-shares-up-2-after-arm-partners-with-swiss-based-mabtree-biologics-for-cancer-drug-12967260.html",
            "description": "Shilpa Medicare share price: The therapy, a fully human monoclonal antibody, targets a newly identified immune checkpoint protein that could enhance T-cell activation and improve immune response against cancer.",
            "pubDate": "2025-03-18T04:23:35.080104"
        },
        {
            "title": "Sensex gains 600 pts, Nifty nears 22,700 as all sectors rally; smallcap index outperforms",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-gains-600-pts-nifty-nears-22700-as-all-sectors-rally-smallcap-index-outperforms-12967280.html",
            "description": "The market is expected to remain stable with a positive bias in the near term, supported by improving macroeconomic indicators and easing foreign investor outflow, experts say.",
            "pubDate": "2025-03-18T04:23:35.080181"
        },
        {
            "title": "Bajaj Finserv shares fall on deal to buy Allianz's 26% stake in insurance arms for Rs 24,180 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/bajaj-finserv-shares-fall-on-deal-to-buy-allianz-s-26-stake-in-insurance-arms-for-rs-24-180-crore-12967267.html",
            "description": "Bajaj Finserv share price: With this transaction, Bajaj’s ownership in both insurers will rise to 100 percent from 74 percent. The company will spend Rs 13,780 crore on the general insurance business and Rs 10,400 crore on the life insurance arm.",
            "pubDate": "2025-03-18T04:23:35.080249"
        },
        {
            "title": "Paytm Money gets SEBI approval on providing research services; shares rally",
            "link": "https://www.moneycontrol.com/news/business/stocks/paytm-money-gets-sebi-approval-on-providing-research-services-shares-rally-12967364.html",
            "description": "In the exchange filing, the company notified that the services shall be integrated into the Paytm Money app as part of a research and advisory offering.",
            "pubDate": "2025-03-18T04:23:35.080314"
        },
        {
            "title": "International Gemmological Institute shares hit 5% lower circuit as 3-month lock-in ends today",
            "link": "https://www.moneycontrol.com/news/business/markets/international-gemmological-institute-shares-hit-5-lower-circuit-as-3-month-lock-in-ends-today-12967317.html",
            "description": "IGI’s stock, which once soared to a post-listing high of Rs 642, has been on a steady decline, plunging nearly 55 percent to a low of Rs 282 since its debut.",
            "pubDate": "2025-03-18T04:23:35.080380"
        },
        {
            "title": "Why India Shelter stands out in the over-crowded low-cost housing finance space",
            "link": "https://www.moneycontrol.com/news/business/earnings/why-india-shelter-stands-out-in-the-over-crowded-low-cost-housing-finance-space-2-12967300.html",
            "description": "Unique business model and deep distribution reach to drive growth and profitability",
            "pubDate": "2025-03-18T04:23:35.080447"
        },
        {
            "title": "Live: Will Nifty's recovery gain further strength? | Opening Bell | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-s-recovery-gain-further-strength-opening-bell-opening-bell-12967301.html",
            "description": "The Sensex and Nifty kicked off the week on a strong note, with the Nifty maintaining its range of 22,300-22,600 for the sixth consecutive session. The index surged over 100 points to close above 22,500, reflecting positive market sentiment. Sectoral performance was led by Nifty Pharma and Financial Services, which emerged as the top gainers of the day. Meanwhile, broader indices also edged higher, posting gains of nearly 0.5%, adding to the market’s overall momentum. This morning, global cues were positive. US markets ended on a higher note overnight, while Asia Pacific also started the day higher. Among stocks, watch out for Swiggy, IREDA, and Star Cement in today's trading session. Catch Lovisha Darad in conversation with Hemen Kapadia, Technical Associate, DRChoksey Finserv and Kranthi Bathini - Equity strategist at WealthMills Securities..\n#nse  #bse #stockmarket #sharemarket #marketopeningbell",
            "pubDate": "2025-03-18T04:23:35.080532"
        },
        {
            "title": "Agri Picks Report March 18, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-18-2025-geojit-financial-services-12967335.html",
            "description": "According to Geojit Financial Services, The sowing of summer crops in Gujarat fell 14% on year to 567,062 hectares as of Monday from 659,770 hectares sown in the corresponding period last year, according to a report released by the state agriculture department. Paddy acreage rose 40% on year to 123,205 hectares from 87,870 hectares last year.",
            "pubDate": "2025-03-18T04:23:35.080600"
        },
        {
            "title": "IRCON International shares gain 7% after JV wins EPC contract worth Rs 1,096 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/ircon-international-shares-in-focus-after-jv-wins-epc-contract-worth-rs-1-096-crore-12967128.html",
            "description": "IRCON International Share Price | The company's net profit registered a steep decline of 65 percent to Rs 86 crore, down from the Rs 244.70 crore in the corresponding period last year. Revenue also declined 10 percent on year to Rs 2,612.86 crore, as compared to Rs 2,929.54 crore in the year-ago period.",
            "pubDate": "2025-03-18T04:23:35.080667"
        },
        {
            "title": "NBCC share price gain nearly 2% on bagging order worth Rs 44.62 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/nbcc-share-price-in-focus-on-bagging-order-worth-rs-44-62-crore-12967126.html",
            "description": "NBCC Share Price | The company on February 12 received orders from the Government of Mizoram for planning, designing and implementing three hydro projects. These include building a dam on the River Mat, a multipurpose rainwater harnessing dam in Champhai district and a dual mini-dam at Vantawng, Thenzaw.",
            "pubDate": "2025-03-18T04:23:35.080732"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty above 22,650, Sensex up 580 pts; ICICI Bank, Hindalco, Axis Bank top gainers",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-18-03-2025-liveblog-12967254.html",
            "description": "Sensex Today | Stock Market LIVE Updates: All the sectoral indices are trading in the green with media index up 1 percent. BSE Midcap and smallcap indices up 0.5 percent each. ICICI Bank, Hindalco, Axis Bank, Bajaj Finserv, Larsen were among major gainers on the Nifty, while losers were TCS, ONGC, Tech Mahindra, Tata Consumer.",
            "pubDate": "2025-03-18T04:23:35.080798"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-66-12966688.html",
            "description": "The Foreign institutional investors (FIIs) continued remain net sellers in the month of March till now, as they sold equities worth Rs 4,488.45 crore on March 17. However,  domestic institutional investors (DIIs) compensated with buying of equities of Rs 6,000.60 crore, on the same day.",
            "pubDate": "2025-03-18T04:23:35.080866"
        },
        {
            "title": "Trade Spotlight: How should you trade Coal India, Kotak Mahindra Bank, Varun Beverages, Shriram Finance, JSW Steel, and others on March 18?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-coal-india-kotak-mahindra-bank-varun-beverages-shriram-finance-jsw-steel-and-others-on-march-18-12967236.html",
            "description": "The momentum is expected to continue in the upcoming session. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-18T04:23:35.080949"
        },
        {
            "title": "Stocks to Watch Today: IndusInd Bank, HUL, Bank of Maharashtra, IRCON, Star Cement, Raymond Lifestyle, Shilpa Medicare, NBCC in focus on 18 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-indusind-bank-hul-bank-of-maharashtra-ircon-star-cement-raymond-lifestyle-shilpa-medicare-nbcc-in-focus-on-18-march-12967234.html",
            "description": "Stocks to Watch, Mar 18: Stocks like Raymond Lifestyle, Aditya Birla Real Estate, Samvardhana Motherson International, NBCC (India), Coffee Day Enterprises, Triveni Engineering & Industries, Morepen Laboratories, Life Insurance Corporation of India, Suryoday Small Finance Bank, Religare Enterprises, and Gopal Snacks will be in focus on March 18.",
            "pubDate": "2025-03-18T04:23:35.081021"
        },
        {
            "title": "Bulk Deals: Spicejet's Ajay Singh offloads 2 crore shares amid stock's continued decline",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-deals-spicejet-s-ajay-singh-offloads-2-crore-shares-amid-stock-s-continued-decline-12967224.html",
            "description": "SpiceJet shares closed slightly lower, erasing earlier gains after rising as much as 7 percent intraday.",
            "pubDate": "2025-03-18T04:23:35.081084"
        },
        {
            "title": "S&P500, Dow Jones extend gains; Nasdaq Composite slips as Tesla, Nvidia fall",
            "link": "https://www.moneycontrol.com/news/business/markets/s-p500-dow-jones-extend-gains-nasdaq-composite-slips-as-tesla-nvidia-fall-12967218.html",
            "description": "Investor sentiment was steadied by February's retail sales data, which showed a modest 0.2 percent monthly increase—below expectations of 0.6 percent.",
            "pubDate": "2025-03-18T04:23:35.081148"
        }
    ]
}