{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-09-13T16:15:46.561014",
    "items": [
        {
            "title": "Weekly Tactical Pick: Why the time is just right to check in to this hotel",
            "link": "https://www.moneycontrol.com/news/business/stocks/weekly-tactical-pick-why-the-time-is-just-right-to-check-in-to-this-hotel-12820967.html",
            "description": "We expect a pick-up in occupancies for LMNT from H2FY25. A seasonally strong period (more holidays, greater arrival of foreign tourists, and pleasant weather conditions) would drive growth.",
            "pubDate": "2024-09-13T03:53:38.585351"
        },
        {
            "title": "Medanta: Charting a growth path",
            "link": "https://www.moneycontrol.com/news/business/stocks/medanta-charting-a-growth-path-12821015.html",
            "description": "Medanta has strong capabilities to leverage its brand image and win the underserved and growing markets.",
            "pubDate": "2024-09-13T04:56:34.752887"
        },
        {
            "title": "Growth vs Profitability: The key to startup longevity",
            "link": "https://www.moneycontrol.com/news/opinion/growth-vs-profitability-the-key-to-startup-longevity-12821028.html",
            "description": "Startups must navigate the delicate balance between growth and profitability. While rapid expansion can establish market presence, achieving profitability ensures long-term sustainability. The challenge lies in strategically investing in growth while maintaining a clear path to profitability as market conditions evolve",
            "pubDate": "2024-09-13T05:18:13.164467"
        },
        {
            "title": "Japan's Sumitomo Corp enters renewable energy market in India",
            "link": "https://www.moneycontrol.com/news/business/companies/japans-sumitomo-corp-enters-renewable-energy-market-in-india-12821493.html",
            "description": "Sumitomo, which holds 49% in the JV with AMPIN Energy Transition having the rest, said the two planned to supply energy from solar and wind to clients in India and to make 100 billion yen ($710 million) in total investments in the project",
            "pubDate": "2024-09-13T12:00:04.013152"
        },
        {
            "title": "Tiger Global plans to join OpenAI funding round: Report",
            "link": "https://www.moneycontrol.com/news/business/companies/tiger-global-plans-to-join-openai-funding-round-report-12821654.html",
            "description": "OpenAI's meteoric popularity has ignited widespread interest in generative AI, as businesses race to capitalize on the technology to enhance their products.",
            "pubDate": "2024-09-13T16:15:45.904351"
        }
    ]
}