{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-07T04:01:02.437092",
    "items": [
        {
            "title": "Agri Picks Report May 07, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-may-07-2025-geojit-financial-services-13015385.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana reached nearly 8.0 million acres (1 acre = 0.4 hectares) as of Wednesday, up 18% from 6.8 million acres a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-05-07T04:00:55.745059"
        },
        {
            "title": "Midcaps Poised For Nervous Start After India Strikes Terror Camps In Pakistan| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/midcaps-poised-for-nervous-start-after-india-strikes-terror-camps-in-pakistan-opening-bell-live-13015370.html",
            "description": "GIFT Nifty hints at nervous start after 'Operation Sindoor'. In the pre-dawn hours of wednesday, india’s army, navy, and air force launched operation sindoor, an unprecedented tri‑services strike on nine terror camps across pakistan and pakistan‑occupied kashmir. This coordinated assault, the first of its kind against pakistan since the 1971 war, was ordered in retaliation for the april  22 terror attack in pahalgam that claimed 26 civilian lives, most of them tourists. What will be the impact on markets? Catch Nandita Khemka in conversation with Kunal Rambhia, Fund Manager, The Streets (Technical) and A Balasubramanian \nManaging Director and CEO,  Aditya Birla Sun Life AMC Limited.",
            "pubDate": "2025-05-07T04:00:55.745152"
        },
        {
            "title": "GP Petroleums shares in focus on signing JV agreement With West Coast Oils LLP",
            "link": "https://www.moneycontrol.com/news/business/stocks/gp-petroleums-shares-in-focus-on-signing-jv-agreement-with-west-coast-oils-llp-13015148.html",
            "description": "GP Petroleums Share Price | The share touched a 52-week high of Rs 93.45 and a 52-week low of Rs 36.00 on 17 September, 2024 and 07 April, 2025, respectively.",
            "pubDate": "2025-05-07T04:00:55.745228"
        },
        {
            "title": "NLC India shares in focus on signing agreement with RVUNL for 810 MW solar power project",
            "link": "https://www.moneycontrol.com/news/business/stocks/nlc-india-shares-in-focus-on-signing-agreement-with-rvunl-for-810-mw-solar-power-project-13015145.html",
            "description": "NLC India Share Price | The company has signed a Memorandum of Understanding (MoU) with IREL (India) to cooperate and collaborate for development (Mining/Excavation/Refining etc.) of mutually agreed assets of critical mineral in general including REE by acquiring assets /sourcing raw materials domestically or internationally.",
            "pubDate": "2025-05-07T04:00:55.745300"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty opens below 24,300, Sensex down 200 pts; airline, defence stocks in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-07-05-2025-liveblog-13015263.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Tata Motors, Shriram Finance, Apollo Hospitals, Bajaj Finance, Hindalco were among major gainers on the Nifty, while losers were Asian Paints, Titan Company, TCS, L&T, Tech Mahindra.",
            "pubDate": "2025-05-07T04:00:55.745373"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-96-13014768.html",
            "description": "The Foreign institutional investors (FIIs) extended their buying on 14th day as they bought equities of Rs 3,784 crore on May 6. However, after six days of buying, Domestic institutional investors (DIIs) turned net buyers as they sold equities of Rs 1,397 crore on same day.",
            "pubDate": "2025-05-07T04:00:55.745464"
        },
        {
            "title": "Stocks to Watch Today: BSE, NLC India, GMDC, GP Petroleums, HPCL, Godrej Consumer, KEI Industries, Paytm, Mahanagar Gas in focus on 7 May",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-bse-nlc-india-gmdc-gp-petroleums-hpcl-godrej-consumer-kei-industries-paytm-mahanagar-gas-in-focus-on-7-may-13015186.html",
            "description": "Stocks to Watch, 07 May: Stocks like eMudhra, KEI Industries, Piramal Enterprises, Aarti Drugs, Aptus Value Housing Finance India, Kansai Nerolac Paints, Shriram Finance, Sun Pharmaceutical Industries, Life Insurance Corporation of India, Prestige Estates Projects, Restaurant Brands Asia, and Gujarat Mineral Development Corporation will be in focus on May 7.",
            "pubDate": "2025-05-07T04:00:55.745534"
        }
    ]
}