{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-24T09:44:40.947668",
    "items": [
        {
            "title": "Indo Farm Equipment sets price band of Rs 204-215 a share for IPO",
            "link": "https://www.moneycontrol.com/news/business/ipo/indo-farm-equipment-sets-price-band-of-rs-204-215-a-share-for-ipo-12896558.html",
            "description": "The proceeds from the fresh issue will be used to establish a dedicated manufacturing unit to expand the production capacity of Pick & Carry Cranes.",
            "pubDate": "2024-12-24T02:29:30.194521"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat start; US markets gain, Asia trades mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-24-12-2024-liveblog-12896528.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street's main indexes all ended higher on Monday, with both the Dow Jones Industrial Average and the Nasdaq Composite making it three straight wins, aided by gains by many of the so-called Magnificent Seven tech stocks on a holiday-thinned trading day. The S&P 500 gained 43.22 points, or 0.73%, to 5,974.07 points, and the Nasdaq Composite rose 192.29 points, or 0.98%, to 19,764.89. The Dow Jones Industrial Average climbed 66.69 points, or 0.16%, to 42,906.95.",
            "pubDate": "2024-12-24T02:29:30.194620"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-16-12896153.html",
            "description": "The GIFT Nifty is indicating a muted start for the day.",
            "pubDate": "2024-12-24T02:29:30.194697"
        },
        {
            "title": "Trade Spotlight: How should you trade Chennai Petroleum, Devyani International, Dabur, Coromandel, Star Cement, and others on Tuesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-chennai-petroleum-devyani-international-dabur-coromandel-star-cement-and-others-on-tuesday-12896512.html",
            "description": "The market may extend its gains amid likely volatility, but it remains within last Friday's range. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-24T02:29:30.194767"
        },
        {
            "title": "Stock Radar: HG Infra Engineering, PG Electroplast, Ramky Infra, MIC Electronics, Bharat Forge, NACDAC Infra in focus on 24 December",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hg-infra-engineering-pg-electroplast-ramky-infra-mic-electronics-bharat-forge-in-focus-on-24-december-12896506.html",
            "description": "Stocks To Watch, Dec 24: Stocks like Whirlpool of India, MMTC, TVS Motor Company, TVS Holdings, Kirloskar Brothers, SPML Infra, Allcargo Gati, Symphony, Nava, and Indian Bank will also be in focus on December 24.",
            "pubDate": "2024-12-24T02:29:30.194838"
        },
        {
            "title": "Bulk deals : Ashish Chugh buys 5 lakh shares in Avonmore Capital",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-deals-rakam-infra-sells-stake-in-avonmore-capital-re-12896504.html",
            "description": "On the selling side, Rakam Infrastructures Private Limited sold 95.27 lakh shares of Avonmore Capital (RE) at an average price of Rs 3.51, while Innovative Money Matters Private Limited offloaded 1.35 crore shares at an average price of Rs 3.5.",
            "pubDate": "2024-12-24T02:29:30.194909"
        },
        {
            "title": "Nifty, Sensex flat as year-end volumes dry up, metals and infra under pressure",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-flat-as-year-end-volumes-dry-up-metals-and-infra-under-pressure-12896587.html",
            "description": "The broader market, represented by the mid-small cap stocks, expressed weak trends. While the midcap 100 index fell 0.3 percent, the smallcap 100 index slipped 0.2 percent to extend the fall for a second trading session in a row.",
            "pubDate": "2024-12-24T04:17:42.503299"
        },
        {
            "title": "Strong indigenisation push spur optimism for defence cos despite valuation concerns",
            "link": "https://www.moneycontrol.com/news/business/stocks/strong-indegenisation-push-spur-optimism-for-defence-cos-despite-valuation-concerns-12896581.html",
            "description": "Nuvama forecasts significant growth for the defence sector, forecasting $130 billion in spending for the sector over the next five years.",
            "pubDate": "2024-12-24T04:17:42.503388"
        },
        {
            "title": "Stock of the Day| Prudent Corporate Advisory| Is it the right time to invest in this stock?",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/stock-of-the-day-prudent-corporate-advisory-is-it-the-right-time-to-invest-in-this-stock-12896638.html",
            "description": "Prudent is the second largest MF distributor after NJ India among the non-banks in terms of commission earned in FY24. If we consider the entire universe of MF distributors including banks, Prudent is the fourth largest. Being a mutual fund distributor, Prudent has benefitted from the robust growth seen in the MF industry.\n\nPrudent draws over 80% of its revenue through distribution of mutual funds. Prudent’s revenues and net profit have grown by CAGR (compounded annual growth rate) of 29% and 46% respectively over the past 5 years (FY19-24).  The net profit growth has been on the back of rise in AUM (asset under management) to Rs 107,000 crore as at end September. Along with healthy inflows, the growth in AUM was led by marked to market (M2M) gains as markets witnessed a strong broad-based rally.",
            "pubDate": "2024-12-24T04:17:42.503463"
        },
        {
            "title": "Aurionpro Solutions stock surges 4% after Europe expansion with Euro 10 mn acquisition",
            "link": "https://www.moneycontrol.com/news/business/markets/aurionpro-solutions-stock-surges-4-after-europe-expansion-with-euro-10-mn-acquisition-12896649.html",
            "description": "Post the acquisition, Aurionpro's management anticipates the revenue contribution from Europe to reach double-digits in the next two years.",
            "pubDate": "2024-12-24T04:52:05.802602"
        },
        {
            "title": "PG Electroplast soars 5% on partnership with Whirlpool for semi-auto washing machines",
            "link": "https://www.moneycontrol.com/news/business/markets/pg-electroplast-soars-5-on-partnership-with-whirlpool-for-semi-auto-washing-machines-12896646.html",
            "description": "This builds on the existing relationship between the two companies, with PGEL already supplying Whirlpool-branded air conditioners.",
            "pubDate": "2024-12-24T04:52:05.802687"
        },
        {
            "title": "Mas Financial – is the significant correction an opportunity?",
            "link": "https://www.moneycontrol.com/news/business/earnings/mas-financial-is-the-significant-correction-an-opportunity-12896585.html",
            "description": "The stock looks reasonably valued for gradual accumulation from a long-term perspective",
            "pubDate": "2024-12-24T04:52:05.802761"
        },
        {
            "title": "MC Pro’s Affluent India Portfolio sees its first change",
            "link": "https://www.moneycontrol.com/news/business/markets/mc-pro-s-affluent-india-portfolio-sees-its-first-change-12896615.html",
            "description": "Two stocks added that are likely to cash in on customers’ growing preference for premium products",
            "pubDate": "2024-12-24T04:52:05.802835"
        },
        {
            "title": "Siemens India shares down sixth day in a row, already in correction zone after management commentary",
            "link": "https://www.moneycontrol.com/news/business/markets/siemens-india-shares-down-sixth-day-in-a-row-already-in-correction-zone-after-management-commentary-12896694.html",
            "description": "UBS has a neutral rating on Siemens India, while Elara and Nuvama have Accumulate and Hold rating, respectively. Antique has maintained a buy call citing growth opportunities, and HDFC Securities has a buy rating, with a target price of Rs 8114.",
            "pubDate": "2024-12-24T05:33:06.248342"
        },
        {
            "title": "HG Infra Engineering subsidiary enters into battery energy storage purchase agreement; Stock gains 2.73%",
            "link": "https://www.moneycontrol.com/news/business/stocks/hg-infra-engineering-subsidiary-enters-into-battery-energy-storage-purchase-agreement-stock-gains-2-73-12896685.html",
            "description": "According to an exchange filing, the purchase agreement with NTPC Vidyut Vyapar Nigam is for a long-term based procurement of 185 MW/370 MWh.",
            "pubDate": "2024-12-24T05:57:03.923047"
        },
        {
            "title": "Vedanta falls 3% as stock trades ex-dividend",
            "link": "https://www.moneycontrol.com/news/business/stocks/vedanta-stock-falls-3-as-stock-trades-ex-dividend-12896714.html",
            "description": "In an exchange filing on December 16, the company said that the board had approved the fourth interim dividend of Rs 8.50 per equity share, at a face value of Rs 1.",
            "pubDate": "2024-12-24T06:40:46.402870"
        },
        {
            "title": "Greaves Cotton spurts 11% after arm GEML files for IPO",
            "link": "https://www.moneycontrol.com/news/business/markets/greaves-cotton-spurts-11-after-arm-geml-files-for-ipo-12896668.html",
            "description": "Greaves Cotton's board approved the initial public offering of its EV arm--GEML, earlier this month, sparking an over 45 percent rally in shares of the company.",
            "pubDate": "2024-12-24T06:40:46.402952"
        },
        {
            "title": "Santa rally? Sensex, Nifty extend gains for second session as auto, oil and gas stocks rise",
            "link": "https://www.moneycontrol.com/news/business/markets/santa-rally-sensex-nifty-extend-gains-for-second-session-as-auto-oil-and-gas-stocks-rise-12896737.html",
            "description": "Metal and Bank stocks fell up to to 0.8 percent after the two witnessed profit booking after they rallied 1 percent in the previous session.",
            "pubDate": "2024-12-24T06:49:52.426571"
        },
        {
            "title": "Gulf Oil Lubricants shares jump 5% on deal with India's largest private fuel retailer",
            "link": "https://www.moneycontrol.com/news/business/markets/gulf-oil-lubricants-shares-jump-5-on-deal-with-india-s-largest-private-fuel-retailer-12896783.html",
            "description": "Under the partnership, Gulf Oil’s AdBlue, a premium diesel exhaust fluid designed to cut harmful emissions, will be the exclusive AdBlue product available across Nayara Energy’s retail network.",
            "pubDate": "2024-12-24T07:27:12.322660"
        },
        {
            "title": "Akums Drugs signs Rs 1,760 crore CDMO pact for European supply",
            "link": "https://www.moneycontrol.com/news/business/markets/akums-drugs-signs-rs-1-760-crore-cdmo-pact-for-european-supply-12896779.html",
            "description": "",
            "pubDate": "2024-12-24T07:50:43.901959"
        },
        {
            "title": "Sensex, Nifty give up day's gains amid volatility; auto, FMCG stocks rise; metals, PSU banks drag",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-give-up-day-s-gains-amid-volatility-auto-fmcg-stocks-rise-metals-psu-banks-drag-12896880.html",
            "description": "The broader market saw mixed outcomes, with mid-cap stocks falling 0.2 percent while small-cap stocks rose 0.1 percent, respectively.",
            "pubDate": "2024-12-24T09:44:40.274035"
        }
    ]
}