{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-25T16:59:19.039010",
    "items": [
        {
            "title": "Shares of Shriram Finance rise on Jefferies’ Buy call over promising growth prospects",
            "link": "https://www.moneycontrol.com/news/business/stocks/shares-of-shriram-finance-rise-on-jefferies-buy-call-over-promising-growth-prospects-12949597.html",
            "description": "Jefferies is optimistic about the company’s growth prospects, particularly in the used passenger vehicle (PV) and non-auto segments, which should help drive a 17 percent compound annual growth rate (CAGR) in assets under management (AUM) over FY25-27. This growth is expected to offset some of the pressures from the weak CV market.",
            "pubDate": "2025-02-25T07:59:45.711436"
        },
        {
            "title": "M&M shares rise 3% to extend gains for a second day after bullish brokerage calls",
            "link": "https://www.moneycontrol.com/news/business/stocks/m-m-shares-rise-3-to-extend-gains-for-a-second-day-after-bullish-brokerage-calls-12949514.html",
            "description": "The rebound in M&M shares comes after a sharp fall the previous week when it clocked its biggest single-day fall in nearly 7 months  on February 21. The sentiment in domestic auto majors took a hit on worries of impact of Elon Musk-led Tesla's entry into India.",
            "pubDate": "2025-02-25T07:59:45.711729"
        },
        {
            "title": "Nestle India shares rise on plans to consider a price hike to offset costlier inputs",
            "link": "https://www.moneycontrol.com/news/business/stocks/nestle-india-shares-rise-on-plans-to-consider-a-price-hike-to-offset-costlier-inputs-12949430.html",
            "description": "\"Wherever (price increase) is absolutely essential, we will have to take some pricing action,\" Nestle India Managing Director Suresh Narayanan said on February 24, adding the price hike will be ‘as low as possible’.",
            "pubDate": "2025-02-25T07:59:45.711797"
        },
        {
            "title": "360 ONE WAM rises 4% on upbeat projection by brokerages after B&K acquisition",
            "link": "https://www.moneycontrol.com/news/business/stocks/360-one-wam-rises-4-on-upbeat-projection-by-brokerages-after-b-k-acquisition-12949424.html",
            "description": "Citi has maintained a Buy with target of Rs 1275 per share, and said that equity broking revenue could grow by as much as 15-20 percent over next three years, with B&K contributing around 75 percent to this growth.",
            "pubDate": "2025-02-25T07:59:45.711929"
        },
        {
            "title": "IREDA shares jump 4% as shareholders approve to raise up to Rs 5,000 crore via QIP",
            "link": "https://www.moneycontrol.com/news/business/markets/ireda-shares-jump-4-as-shareholders-approve-to-raise-up-to-rs-5-000-crore-via-qip-12949403.html",
            "description": "IREDA's Rs 5,000 crore fundraising will take place in one or multiple tranches and includes dilution of the government's stake by up to 7 percent post-issue",
            "pubDate": "2025-02-25T07:59:45.711997"
        },
        {
            "title": "Stocks to Watch: UPL, SBI, ONGC, NTPC in focus on 25 February",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/stocks-to-watch-upl-sbi-ongc-ntpc-in-focus-on-25-february-12949397.html",
            "description": "Today, several major stocks are in focus, including UPL, SBI Life Insurance, ONGC, NTPC, and Shree Cement. UPL announced a significant investment of $53.85 million by its subsidiary, UPL Holdings Brazil, increasing its stake in Sinova Inovações Agrícolas S.A. to 49.97%. SBI Life Insurance appointed Dorababu Daparti as its new Deputy CEO to strengthen its leadership. Meanwhile, ONGC will invest Rs 1,200 crore in ONGC Green (OGL) through a rights issue to acquire a 100% stake in PTC Energy, marking a move towards green energy. NTPC and its subsidiary NTPC Green Energy signed MoUs with the Madhya Pradesh government for over Rs 2 lakh crore in renewable energy projects. Finally, Shree Cement faces a GST demand order of Rs 41.1 crore related to valuation and excess ITC claimed, which could affect its financials.",
            "pubDate": "2025-02-25T07:59:45.712096"
        },
        {
            "title": "UCO Bank, IoB, Central Bank, Punjab & Sind Bank shares surge up to 4% on stake sale reports",
            "link": "https://www.moneycontrol.com/news/business/markets/uco-bank-iob-central-bank-punjab-sind-bank-shares-surge-up-to-4-on-stake-sale-reports-12949350.html",
            "description": "According to reports, the Department of Investment and Public Asset Management has invited bids from merchant bankers to facilitate the government’s proposed stake sale in public sector banks",
            "pubDate": "2025-02-25T07:59:45.712164"
        },
        {
            "title": "Bernstein bullish on Zomato despite rising quick-commerce competition, says shares can rally to Rs 310",
            "link": "https://www.moneycontrol.com/news/business/stocks/bernstein-bullish-on-zomato-despite-rising-quick-commerce-competition-says-shares-can-rally-to-rs-310-12949375.html",
            "description": "Bernstein noted that competition in quick commerce is a key debate, driven by aggressive expansion and marketing spends across Zomato, Swiggy, and Zepto.",
            "pubDate": "2025-02-25T07:59:45.712228"
        },
        {
            "title": "Agri Picks Report February 25, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-february-25-2025-geojit-financial-services-12949381.html",
            "description": "According to Geojit Financial Services, The International Grains Council has scaled down its estimate for global production in 2024-25 by 3 million tonnes to 2,301 million tonnes, compared to its projections in January, according to a grain market report released Thursday.",
            "pubDate": "2025-02-25T07:59:45.712292"
        },
        {
            "title": "Repco Home Finance: Focused on affordable housing loans, undervalued",
            "link": "https://www.moneycontrol.com/news/business/stocks/repco-home-finance-focused-on-affordable-housing-loans-undervalued-12949348.html",
            "description": "Core portfolio growth, geographical diversification will drive scale",
            "pubDate": "2025-02-25T07:59:45.712363"
        },
        {
            "title": "Akzo Nobel India shares in focus on selling powder coatings business and R&D centre to parent entity",
            "link": "https://www.moneycontrol.com/news/business/stocks/akzo-nobel-india-shares-in-focus-on-selling-powder-coatings-business-and-r-d-centre-to-parent-entity-12949347.html",
            "description": "Akzo Nobel India received a binding offer from parent Akzo Nobel N.V. for the sale of its powder coatings business and R&D Centre.",
            "pubDate": "2025-02-25T07:59:45.712428"
        },
        {
            "title": "JPMorgan sees value in defence stocks after sharp fall, remains bullish on growth",
            "link": "https://www.moneycontrol.com/news/business/markets/jpmorgan-sees-value-in-defence-stocks-after-sharp-fall-remains-bullish-on-growth-12949339.html",
            "description": "JPMorgan analysts remain confident in the structural growth story of defence stocks, emphasising that India's defence capex and domestic manufacturing push are long-term trends",
            "pubDate": "2025-02-25T07:59:45.712560"
        },
        {
            "title": "SBI Card shares slip as it trades ex-divided; Morgan Stanley reiterates \"equal-weight\" rating",
            "link": "https://www.moneycontrol.com/news/business/markets/sbi-card-shares-in-focus-as-morgan-stanley-reiterates-equal-weight-rating-12949319.html",
            "description": "SBI Card's market presence strengthened in January, with its market share climbing to 15.7 percent",
            "pubDate": "2025-02-25T07:59:45.712626"
        },
        {
            "title": "Hong Kong, Asian stocks drop as US pressures China",
            "link": "https://www.moneycontrol.com/news/business/markets/hong-kong-asian-stocks-drop-as-us-pressures-china-12949315.html",
            "description": "Equity indexes in Hong Kong and mainland China dropped at the open and a regional gauge of shares fell for a second consecutive day.",
            "pubDate": "2025-02-25T07:59:45.712692"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty above 22,550, Sensex up 200 pts; M&M, TCS, Zomato most active",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-25-02-2025-liveblog-12949304.html",
            "description": "Sensex Today | Stock Market LIVE Updates: On the sectoral front, buying is seen in the auto, Consumer Durables, FMCG, telecom, while selling is seen in the IT, metal, oil & gas, metal, energy, capital goods,  pharma. BSE Midcap and Smallcap indices down 0.5 percent each. M&M, HDFC Bank, TCS, BSE Limited, Tata Investment among most active shares on the NSE.",
            "pubDate": "2025-02-25T07:59:45.712888"
        },
        {
            "title": "Stocks to Watch Today: Biocon, Texmaco Rail, NTPC Green Energy, UPL, SpiceJet in focus on 25 February",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-biocon-texmaco-rail-ntpc-green-energy-upl-spicejet-in-focus-on-25-february-12949288.html",
            "description": "Stocks to Watch, Feb 25: Stocks like Welspun Corp, SBI Life Insurance Company, Oil and Natural Gas Corporation, NTPC, Waterbase, Shree Cement, Refex Industries, Nazara Technologies, Life Insurance Corporation of India, KEI Industries, Dipna Pharmachem, and Kisan Mouldings will be in focus on February 25.",
            "pubDate": "2025-02-25T07:59:45.712963"
        },
        {
            "title": "US Markets Edge Higher; S&P 500 up 0.13%, Dow Gains 0.53%",
            "link": "https://www.moneycontrol.com/news/business/markets/us-markets-edge-higher-s-p-500-up-0-13-dow-gains-0-53-12949286.html",
            "description": "Warren Buffett’s, Berkshire Hathaway's Class A shares jump nearly 4 percent after posting strong earnings.",
            "pubDate": "2025-02-25T07:59:45.713045"
        },
        {
            "title": "Trade Spotlight: How should you trade Cummins India, NTPC, Kotak Mahindra Bank, Avanti Feeds, Berger Paints, and others on February 25?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-cummins-india-ntpc-kotak-mahindra-bank-avanti-feeds-berger-paints-and-others-on-february-25-12949264.html",
            "description": "The index is expected to extend its southward move in the upcoming sessions, given the negative sentiment. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-25T07:59:45.713114"
        },
        {
            "title": "Bharat Electronics to consider interim dividend on March 5",
            "link": "https://www.moneycontrol.com/news/business/markets/bharat-electronics-to-consider-interim-dividend-on-march-5-12950102.html",
            "description": "BEL share price: If the defence major is to announce an interim dividend exceeding Rs 3 per share, it would mark the highest payout since February 2017, the highest in 8  years",
            "pubDate": "2025-02-25T13:44:40.084179"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on February 25",
            "link": "https://www.moneycontrol.com/news/business/stocks/top-gainers-and-losers-today-stocks-that-moved-the-most-on-february-25-12949704.html",
            "description": "The Nifty 50 dipped a marginal 0.03% lower to end at 22,547.55 while the BSE Sensex edged 0.2% higher to close at 74,602.12",
            "pubDate": "2025-02-25T13:44:40.084263"
        },
        {
            "title": "Goldman Sachs bullish on Bharti Airtel, stays bearish on Vodafone Idea and Indus Towers",
            "link": "https://www.moneycontrol.com/news/business/markets/goldman-sachs-bullish-on-bharti-airtel-stays-bearish-on-vodafone-idea-and-indus-towers-12949987.html",
            "description": "Despite Vodafone Idea's recent uptick to Rs 8.04, the brokerage trimmed its FY25-28 revenue and EBITDA estimates by up to 3 percent and 11 percent, respectively,",
            "pubDate": "2025-02-25T13:44:40.084330"
        },
        {
            "title": "Taking Stock: Late selloff deepens cut but Nifty, Sensex end flat; metal and IT drag",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-late-selloff-deepens-cut-but-nifty-sensex-end-flat-metal-and-it-drag-12949734.html",
            "description": "M&M, Bharti Airtel, Bajaj Finance, Maruti Suzuki and Nestle were among major gainers on the Nifty, while losers included Hindalco, Dr Reddy's Labs, Sun Pharma, Hero MotoCorp, Trent",
            "pubDate": "2025-02-25T13:44:40.084395"
        },
        {
            "title": "Live: Nifty Ekes Out Slim Gains Ahead Of Monthly Expiry| 360 One Wam, IEX In Focus| Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-ekes-out-slim-gains-ahead-of-monthly-expiry-360-one-wam-iex-in-focus-closing-bell-12949991.html",
            "description": "Nifty sees sideways move ahead of market holiday. Midcaps continue to see weakness. NSE advance-decline ratio at 2:3. India VIX drops over 5%. Autos and FMCG among gainers. IT continues to see selling pressure. Metals among top sectoral losers today. Catch Nandita Khemka and Yatin Mota as they discuss stocks on their radar.",
            "pubDate": "2025-02-25T13:44:40.084459"
        },
        {
            "title": "Gland Pharma shares rise most in 16 weeks, with US FDA's pre-approval inspection at its JNPC facility",
            "link": "https://www.moneycontrol.com/news/business/stocks/gland-pharma-shares-rise-most-in-16-weeks-ahead-of-investor-meetings-this-week-12949702.html",
            "description": "Business daily Livemint had reported earlier this in February citing sources that Blackstone, Brookfield, and Warburg Pincus were in talks to acquire a majority stake in Gland Pharma, a maker of generic injectables.",
            "pubDate": "2025-02-25T13:44:40.084522"
        },
        {
            "title": "HSBC flags concerns over likely EV policy changes, sees disadvantage for Indian automakers",
            "link": "https://www.moneycontrol.com/news/business/markets/hsbc-flags-concerns-over-ev-policy-changes-sees-disadvantage-for-indian-automakers-12949892.html",
            "description": "While India currently imports only around 8,000 EVs annually, HSBC warns that such a policy shift could create long-term investment concerns for ICE automakers, potentially impacting the broader domestic auto industry.",
            "pubDate": "2025-02-25T13:44:40.084606"
        },
        {
            "title": "ITC, HUL, other FMCG stocks rise as defensives gain traction; here's what brokerages say",
            "link": "https://www.moneycontrol.com/news/business/stocks/itc-hul-other-fmcg-stocks-rise-as-defensives-gain-traction-here-s-what-brokerages-say-12949788.html",
            "description": "There's renewed interest in FMCG stocks in recent past after income tax cuts in Budget 2025 are anticipated to boost consumption",
            "pubDate": "2025-02-25T13:44:40.084673"
        },
        {
            "title": "Bulk deals : Goldman Sachs Funds - Goldman Sachs India Equity Portfolio sells 89,000 shares in Teamlease Services",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-deals-goldman-sachs-funds-goldman-sachs-india-equity-portfolio-sells-89-000-shares-in-teamlease-services-12950415.html",
            "description": "Divam Sharma bought 2.9 lakh shares in Generic Engineering Construction and Projects for an average price of Rs 27.86.",
            "pubDate": "2025-02-25T16:40:36.193823"
        },
        {
            "title": "US markets: S&P 500, Nasdaq, Dow Jones open mix ahead of consumer confidence data; all eyes on Nvidia earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/us-markets-s-p-500-nasdaq-dow-jones-open-mix-ahead-of-consumer-confidence-data-all-eyes-on-nvidia-earnings-12950369.html",
            "description": "Wall Street shifted focus to key earnings reports, with Home Depot rallying 2 percent after posting stronger-than-expected fourth-quarter results.",
            "pubDate": "2025-02-25T16:40:36.193905"
        },
        {
            "title": "US' main indices extend losses on weak consumer confidence data; Nvidia falls 3% ahead of earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/us-main-indices-extend-losses-on-weak-consumer-confidence-data-nvidia-falls-3-ahead-of-earnings-12950448.html",
            "description": "Equity markets reflected the nervous mood, with the Nasdaq Composite tumbling 1.5 percent as heavyweight Nvidia fell 3 percent.",
            "pubDate": "2025-02-25T16:59:18.350323"
        }
    ]
}