{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-19T03:54:32.007608",
    "items": [
        {
            "title": "Stocks to Watch Today: Divis Labs, Premier Energies, Delhivery, Dr Reddys, Bharat Electronics, KEC International, Sun Pharma, PNC Infratech in focus on 19 May",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-divis-labs-premier-energies-delhivery-dr-reddys-bharat-electronics-kec-international-sun-pharma-pnc-infratech-in-focus-on-19-may-13030850.html",
            "description": "Stocks to Watch, 19 May: Stocks like Zen Technologies, Arvind Fashions, Galaxy Surfactants, KRBL, Kalpataru Projects International, IOL Chemicals, Repco Home Finance, CreditAccess Grameen, Dhampur Sugar Mills, Gujarat Alkalies, Kaynes Technology India, Texmaco Rail & Engineering, Sterlite Technologies, and Dr Reddy's Laboratories will be in focus on May 19.",
            "pubDate": "2025-05-19T01:42:50.315375"
        },
        {
            "title": "Agri Picks Report May 19, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-may-19-2025-geojit-financial-services-13031172.html",
            "description": "According to Geojit Financial Services, Sowing of summer crops in Maharashtra rose more than 21% to 510,538 hectares as of Tuesday from 421,706 hectares a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-05-19T03:54:29.762389"
        },
        {
            "title": "Live: Can Sensex, Nifty extend its rally this week? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/live-can-sensex-nifty-extend-its-rally-this-week-opening-bell-13031041.html",
            "description": "The Sensex and Nifty ended flat in the previous session, even as buying momentum remained strong in the broader markets. The Nifty notched a 4% weekly gain—its best since October 4, 2024—while the Nifty Midcap 100 and Smallcap 100 indices soared 7% and 9%, respectively. On the earnings front, key Q4 results this week include ITC, Sun Pharma, and IndusInd Bank, with Power Grid and Pfizer among the companies reporting today. This morning, global cues were largely lower. US stock futures slid overnight as investors parsed Moody's credit rating downgrade. Similarly, Asian markets slid in early trade ahead of a slew of economic data. Catch Lovisha Darad in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives) at Axis Securities and Daljit Singh Kohli, Head -Equity, Roha Asset Managers LLP.",
            "pubDate": "2025-05-19T03:54:29.762507"
        },
        {
            "title": "Data Story: Pharma companies ride profitability wave amid Trump jitters",
            "link": "https://www.moneycontrol.com/news/opinion/data-story-pharma-companies-ride-profitability-wave-amid-trump-jitters-13031023.html",
            "description": "Return ratios of Dr Reddy's Laboratories, Cipla and Lupin increased significantly in the last five years",
            "pubDate": "2025-05-19T03:54:29.762586"
        }
    ]
}