{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-26T15:30:02.547603",
    "items": [
        {
            "title": "SpiceJet Q3 results: Airline swings to black with Rs 25 crore net profit",
            "link": "https://www.moneycontrol.com/news/business/earnings/spicejet-q3-results-airline-swings-to-black-with-rs-25-crore-net-profit-12949908.html",
            "description": "The revenue for both Q2FY25 and Q3FY25 came in at Rs 852.8 crore and Rs 1,140.66 crore, respectively, lower from Rs 1,425.29 crore seen in Q2FY24 and Rs 1,756.6 crore in Q3FY24",
            "pubDate": "2025-02-26T03:04:35.136840"
        },
        {
            "title": "Tesla market value slips below $1 trillion as Europe sales sink",
            "link": "https://www.moneycontrol.com/news/business/companies/tesla-market-value-slips-below-1-trillion-as-europe-sales-sink-12950466.html",
            "description": "Tesla shares are now by far the biggest decliner among the mega-cap technology stocks, weighing heavily on the group’s overall performance",
            "pubDate": "2025-02-26T03:04:35.136930"
        },
        {
            "title": "Singapore Tycoon Kwek accuses son of boardroom coup attempt",
            "link": "https://www.moneycontrol.com/news/business/companies/singapore-tycoon-kwek-accuses-son-of-boardroom-coup-attempt-12951006.html",
            "description": "The billionaire Kwek, 84, said in a statement that he had sought to dismiss his son, Sherman Kwek, from the CEO position earlier in February due to what he alleged were “serious lapses of corporate governance.” Leng Beng said Sherman had consolidated control of the company’s board, which prevented the firing.",
            "pubDate": "2025-02-26T15:29:54.052891"
        },
        {
            "title": "Noodle maker Nissin plans big investments, eyes pickup in demand",
            "link": "https://www.moneycontrol.com/news/world/noodle-maker-nissin-plans-big-investments-eyes-pickup-in-demand-12950978.html",
            "description": "Nissin Foods expects continued demand for cheap precooked noodles even as the industry works to shed its image of being an unhealthy staple, President and CEO Koki Ando said in an interview on the sidelines of the World Instant Noodles Association summit in Manila on Wednesday.",
            "pubDate": "2025-02-26T15:29:54.052977"
        },
        {
            "title": "Welspun One launches Rs 1,000 cr co-investment program to expand warehousing portfolio",
            "link": "https://www.moneycontrol.com/news/business/companies/welspun-one-launches-rs-1-000-cr-co-investment-program-to-expand-warehousing-portfolio-12950877.html",
            "description": "This initiative will support its second Alternative Investment Fund (AIF), Fund 2, by providing dry powder to capitalise on a ready pipeline of 5 million sq ft, which is currently in the advanced stages of closure",
            "pubDate": "2025-02-26T15:29:54.053059"
        },
        {
            "title": "UltraTech’s Rs 1,800 crore cable & wires foray may rewire sector, squeeze rivals' margins",
            "link": "https://www.moneycontrol.com/news/business/markets/ultratech-s-rs-1-800-crore-cable-wires-foray-may-rewire-sector-squeeze-rivals-margins-12950855.html",
            "description": "In case UltraTech chooses to be aggressive with pricing in the C&W foray, in order to corner greater market share, the move will negative impact the margins for the business, hurting the existing players.",
            "pubDate": "2025-02-26T15:29:54.053136"
        },
        {
            "title": "Streamlining recovery processes for retail lending to boost financial inclusion",
            "link": "https://www.moneycontrol.com/news/opinion/streamlining-recovery-processes-for-retail-lending-to-boost-financial-inclusion-12950774.html",
            "description": "Retail lending needs a clear, time-bound recovery process like the Corporate Insolvency Act. Streamlining collections would improve transparency, reduce complaints, and lower borrowing costs, promoting credit access, supporting micro-enterprises, and enhancing financial inclusion in India",
            "pubDate": "2025-02-26T15:29:54.053221"
        },
        {
            "title": "Shipbuilder Garden Reach confident of doubling export orders in a year, new shipyard plans on the anvil",
            "link": "https://www.moneycontrol.com/news/business/companies/shipbuilder-garden-reach-confident-of-doubling-export-orders-in-a-year-new-shipyard-plans-on-the-anvil-12950543.html",
            "description": "The current orders with GRSE are spread across 40 naval platforms, and 95% of them are from the shipbuilding segment, a category where the shipyard company has increased its annual capacity to 24 ships this year.",
            "pubDate": "2025-02-26T15:29:54.053296"
        },
        {
            "title": "Centre may allow telcos to surrender spectrum bought before 2022: Report",
            "link": "https://www.moneycontrol.com/news/business/companies/centre-may-allow-telcos-to-surrender-spectrum-bought-before-2022-report-12950529.html",
            "description": "This is likely to provide a major boost to Vodafone Idea, which can save up to Rs 40,000 crore by giving up its excess airwaves, the report said",
            "pubDate": "2025-02-26T15:29:54.053364"
        }
    ]
}