{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-13T11:44:11.422213",
    "items": [
        {
            "title": "Trade Spotlight: How should you trade LTIMindtree, JSW Steel, Cyient, GHCL, Muthoot Finance, TTML, and others on Friday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-ltimindtree-jsw-steel-cyient-ghcl-muthoot-finance-ttml-and-others-on-friday-12889013.html",
            "description": "The market may extend the downtrend if it breaks the 10-day EMA (Exponential Moving Average) amid likely consolidation, while the VIX in the lower zone supports bulls. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-13T01:36:10.994444"
        },
        {
            "title": "Stock Radar: Hindustan Aeronautics, Ashok Leyland, GR Infra, Zomato, Bajel Projects, Yes Bank, BlackBuck in focus on Friday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-hindustan-aeronautics-ashok-leyland-gr-infra-zomato-bajel-projects-yes-bank-blackbuck-in-focus-on-friday-12889009.html",
            "description": "Stocks like Godrej Industries, CRISIL, NACL Industries, NHPC, Greenply Industries, JSW Energy, NESCO, Firstsource Solutions, Tata Motors, JK Tyre and Industries, Adani Green Energy, Tolins Tyres, Pennar Industries, and Dhampur Bio Organics will also be in focus on December 13.",
            "pubDate": "2024-12-13T01:36:10.994530"
        },
        {
            "title": "Brokerage Radar: UBS cuts IndusInd's target price, Jefferies upgrades Indian Oil to 'Buy'",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-ubs-cuts-indusind-s-target-price-jefferries-upgrades-indian-oil-to-buy-12889072.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Infosys, banking stocks, pharma stocks and more.",
            "pubDate": "2024-12-13T02:53:56.536467"
        },
        {
            "title": "Advent’s rush to scale up Suven Pharma leads it to another acquisition",
            "link": "https://www.moneycontrol.com/news/opinion/advent-s-rush-to-scale-up-suven-pharma-leads-it-to-another-acquisition-12889055.html",
            "description": "The NJ Bio acquisition follows Sapala Organics purchase in June",
            "pubDate": "2024-12-13T02:53:56.536549"
        },
        {
            "title": "Ashok Leyland shares in focus on winning order worth Rs 345.58 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/ashok-leyland-shares-in-focus-on-winning-order-worth-rs-345-58-crore-12888965.html",
            "description": "Ashok Leyland Share Price | During December 2024 - May 2025, the company is going to supply 1475 bus chassis at a total consideration of Rs 345.58 crore.",
            "pubDate": "2024-12-13T02:53:56.536620"
        },
        {
            "title": "CRISIL shares likely to extend gain on fourth day on picking minority stake in Online PSB Loans",
            "link": "https://www.moneycontrol.com/news/business/stocks/crisil-shares-likely-to-extend-gain-on-fourth-day-on-picking-minority-stake-in-online-psb-loans-12888939.html",
            "description": "CRISIL Share Price | The board of directors of CRISIL has approved an investment in the equity capital of Online PSB Loans of an amount of Rs 33.25 crore, to acquire a 4.08 percent stake.",
            "pubDate": "2024-12-13T02:53:56.536689"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a weak start; US, Asian markets fall",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-13-12-2024-liveblog-12889034.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street pulled back on Thursday as investors evaluated key economic indicators ahead of the Federal Reserve's meeting next week. The Dow Jones Industrial Average fell 234.44 points, or 0.53%, to 43,914.12, the S&P 500 lost 32.94 points, or 0.54%, to 6,051.25 and the Nasdaq Composite lost 132.05 points, or 0.66%, to 19,902.84.",
            "pubDate": "2024-12-13T02:53:56.536757"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-9-12888724.html",
            "description": "The GIFT Nifty is indicating a weak start for the day.",
            "pubDate": "2024-12-13T02:53:56.536845"
        },
        {
            "title": "Live: Will Nifty Hold 24,500 Support Level As Weakness Continues? HAL, Zomato In Focus| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-hold-24-500-support-level-as-weakness-continues-hal-zomato-in-focus-opening-bell-12889079.html",
            "description": "Asian markets fell as investors assessed China’s stimulus pledges following a high-level economic meeting, where the country reaffirmed its policy shifts and growth-boosting plans. Wall Street ended lower, with the Dow logging its 6th straight decline, marking its longest losing streak since April. European markets also slipped after the ECB cut rates by 25 basis points. GIFT Nifty signals a subdued start, while US 10-year Treasury yields surged above 4.3% following concerning inflation reports. The dollar strengthened as fresh inflation data showed US PPI rising 0.4% in November, above estimates of 0.2%. Oil prices edged lower as the IEA's surplus forecast offset optimism surrounding rate cuts, while gold slid from its 5-week high. Catch Nandita Khemka in conversation with Raja Venkatraman, Co-Founder NeoTrader and A Balasubramanian, MD&CEO, Aditya Birla Sun life AMC Ltd",
            "pubDate": "2024-12-13T03:51:30.196561"
        },
        {
            "title": "Metal stocks under pressure; JSW Steel, Tata Steel, NMDC, SAIL drop 3-5%",
            "link": "https://www.moneycontrol.com/news/business/markets/metal-stocks-under-pressure-jsw-steel-tata-steel-nmdc-sail-drop-3-5-12889090.html",
            "description": "The broader sell-off in metal stocks also pulled the Nifty Metal index down by 2.4 percent, making it the worst-performing sector so far.",
            "pubDate": "2024-12-13T04:24:32.874373"
        },
        {
            "title": "Stocks on Radar: HAL, Ashok Leyland, GR Infra, Zomato in Focus | December 13 Update",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/stocks-on-radar-hal-ashok-leyland-gr-infra-zomato-in-focus-december-13-update-12889127.html",
            "description": "Stocks to watch: Stay ahead of the market with the latest stock updates! From HAL's ₹13,500 Cr Su-30MKI contract to Ashok Leyland's ₹345.58 Cr bus order, and Zomato's ₹803 Cr tax demand, here’s a quick breakdown of today’s top movers.. Don't miss out on these important stock movements!",
            "pubDate": "2024-12-13T04:24:32.874468"
        },
        {
            "title": "Tata Motors shares fall for third straight day after commercial vehicle price hike",
            "link": "https://www.moneycontrol.com/news/business/markets/tata-motors-shares-fall-for-third-straight-day-after-commercial-vehicle-price-hike-12889102.html",
            "description": "This marks Tata Motors' fourth price hike this year, reflecting the broader struggles faced by Indian automakers amid slowing demand after years of growth.",
            "pubDate": "2024-12-13T04:24:32.874545"
        },
        {
            "title": "Home First Finance: Scalability with profitability led by solid execution",
            "link": "https://www.moneycontrol.com/news/business/earnings/home-first-finance-scalability-with-profitability-led-by-solid-execution-12889092.html",
            "description": "Higher valuation could sustain, given risk-adjusted growth",
            "pubDate": "2024-12-13T04:24:32.874622"
        },
        {
            "title": "Weekly Tactical Pick – Why this niche FMCG stock merits attention, post correction",
            "link": "https://www.moneycontrol.com/news/business/stocks/weekly-tactical-pick-why-this-niche-fmcg-stock-merits-attention-post-correction-12889091.html",
            "description": "The growth prospects make Emami a good tactical pick as the valuation is among the cheapest in the sector",
            "pubDate": "2024-12-13T04:24:32.874714"
        },
        {
            "title": "Indian Oil shares rise 3% as Jefferies upgrades to 'buy', sees 31% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/indian-oil-shares-rise-3-as-jefferies-upgrades-to-buy-sees-31-upside-12889085.html",
            "description": "Jefferies suggests a favourable risk-reward balance following the steep correction over the past three months.",
            "pubDate": "2024-12-13T04:24:32.874786"
        },
        {
            "title": "Could cooling November inflation cement RBI’s rate cut decision? Firstcry, CEAT in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/could-cooling-november-inflation-cement-rbi-s-rate-cut-decision-firstcry-ceat-in-focus-12889060.html",
            "description": "“When inflation is low, you feel that you know more about the future, and are much more willing to take risks.”\nPeter Bernstein",
            "pubDate": "2024-12-13T04:24:32.874858"
        },
        {
            "title": "Bajel Projects stock zooms 10% after order win from Solapur Transmission",
            "link": "https://www.moneycontrol.com/news/business/markets/bajel-projects-stock-zooms-10-after-order-win-from-solapur-transmission-12889148.html",
            "description": "The surge in Bajel Projects also made it one of the of best performers on the BSE Smallcap index today.",
            "pubDate": "2024-12-13T04:41:26.770054"
        },
        {
            "title": "International Gemmological Institute (India) IPO: Will bourses certify the gem?",
            "link": "https://www.moneycontrol.com/news/ipo/ipo-ipo/international-gemmological-institute-india-ipo-will-bourses-certify-the-gem-12889138.html",
            "description": "IGI India operates in the niche category of independent diamond certification and has established leadership position in the fast-growing lab-grown diamond market.",
            "pubDate": "2024-12-13T05:19:12.269335"
        },
        {
            "title": "Waaree Energies stock snaps 7-day winning run, drops 4% as profit booking kicks in",
            "link": "https://www.moneycontrol.com/news/business/markets/waaree-energies-stock-snaps-7-day-winning-run-drops-4-as-profit-booking-kicks-in-12889172.html",
            "description": "Waaree Energies stock had run up over 20 percent in the last seven sessions, giving investors plenty of room to book partial profits.",
            "pubDate": "2024-12-13T05:45:25.256903"
        },
        {
            "title": "Jefferies predicts Nifty to hit 26,600 by 2025 end, unveils top stock picks",
            "link": "https://www.moneycontrol.com/news/business/markets/jefferies-predicts-nifty-to-hit-26-600-by-2025-end-unveils-top-stock-picks-12889223.html",
            "description": "Anticipating moderate market returns in 2025, Jefferies favours large-cap stocks over mid and smallcap names.",
            "pubDate": "2024-12-13T06:53:02.701361"
        },
        {
            "title": "Bharti Airtel stock surges 4%, biggest jump in 7 weeks",
            "link": "https://www.moneycontrol.com/news/business/markets/bharti-airtel-stock-surges-4-biggest-jump-in-7-weeks-12889278.html",
            "description": "Data on Bloomberg also showed that a block deal involving 13.2 lakh shares of Bharti Airtel took place on the exchanges.",
            "pubDate": "2024-12-13T07:56:56.748931"
        },
        {
            "title": "Quick commerce heats up: Can Zomato's Blinkit sustain its leadership?",
            "link": "https://www.moneycontrol.com/news/business/markets/quick-commerce-heats-up-can-zomato-s-blinkit-sustain-its-leadership-12889326.html",
            "description": "Despite heating competition in the quick commerce space, Morgan Stanley holds on the idea that Blinkit will manage to still clench at least 40 percent market share by FY27.",
            "pubDate": "2024-12-13T09:25:00.223733"
        },
        {
            "title": "Astra Microwave Products stock gains 6% after JV secures Rs 259-cr defence order",
            "link": "https://www.moneycontrol.com/news/business/markets/astra-microwave-products-stock-gains-6-after-jv-secures-rs-259-cr-defence-order-12889416.html",
            "description": "Geojit Financial Services upgraded Astra Microwave Products to a \"Buy\" rating with a target price of Rs 976, citing robust growth prospects and a healthy order pipeline.",
            "pubDate": "2024-12-13T09:52:54.366402"
        },
        {
            "title": "Taking Stock: Friday blockbuster! Sensex, Nifty recover more than 2% from day’s low",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-friday-blockbuster-sensex-nifty-recover-more-than-2-from-day-s-low-12889373.html",
            "description": "For the week, BSE Sensex added 0.7 percent and Nifty rose 0.4 percent.",
            "pubDate": "2024-12-13T10:25:29.975142"
        },
        {
            "title": "Live: Nifty, Sensex See Solid Recovery From Day's Low|Infosys, IOC In Focus| Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-sensex-see-solid-recovery-from-day-s-low-infosys-ioc-in-focus-closing-bell-12889425.html",
            "description": "Sensex recovered over 2% from the day’s low, while Nifty rebounded more than 500 points. Bank Nifty saw a sharp recovery of over 1,000 points, led by buying in FMCG, auto, and IT stocks. However, broader markets underperformed with weak breadth favoring losers, while metals and realty stocks lagged. Top Nifty gainers included Airtel, Kotak Bank, Ultratech, ITC, Titan, and HUL, while Shriram Fin, IndusInd, Tata Steel, Hindalco, and JSW Steel were among the top losers. Catch Nandita Khemka and Yatin Mota as they discuss the stocks on their radar.",
            "pubDate": "2024-12-13T10:25:29.975232"
        },
        {
            "title": "India’s stock market growth is a testament to investor trust in Indian businesses: Ashishkumar Chauhan",
            "link": "https://www.moneycontrol.com/news/business/markets/india-s-stock-market-growth-is-a-testament-to-investor-trust-in-indian-businesses-ashishkumar-chauhan-12889484.html",
            "description": "Chauhan pointed out that India’s young population and technological advancements will drive the creation of wealth in the coming decades",
            "pubDate": "2024-12-13T10:50:24.270066"
        },
        {
            "title": "Consumption stocks crowd pessimism list in November; Asian Paints, Titan, Britannia among top ten",
            "link": "https://www.moneycontrol.com/news/business/markets/consumption-stocks-crowd-pessimism-list-in-november-asian-paints-titan-britannia-among-top-ten-12889445.html",
            "description": "As of November, Asian Paints had 18 sell calls, Nestle 7 sell calls, while Titan and Britannia Industries had 5 sell calls each.",
            "pubDate": "2024-12-13T11:44:10.573020"
        }
    ]
}