{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-03T05:32:50.413220",
    "items": [
        {
            "title": "Brokerage Radar: Jefferies bullish on Global Health, HSBC says 'Buy' to Bajaj Finance",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-jefferies-bullish-on-global-health-hsbc-says-buy-to-bajaj-finance-12881548.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes M&M, Bajaj Finance, Gujarat Gas and more.",
            "pubDate": "2024-12-03T02:58:16.189917"
        },
        {
            "title": "Solar Industries shares in focus on export order win for supply of defence products",
            "link": "https://www.moneycontrol.com/news/business/stocks/solar-industries-shares-in-focus-on-export-order-win-for-supply-of-defence-products-12881427.html",
            "description": "Solar Industries Share Price | Currently, the stock is trading 20.73 percent below its 52-week high and 78.38 percent above its 52-week low.",
            "pubDate": "2024-12-03T02:58:16.190009"
        },
        {
            "title": "KPI Green shares in focus on winning order worth Rs 1,311cr from Coal India",
            "link": "https://www.moneycontrol.com/news/business/stocks/kpi-green-shares-in-focus-on-winning-order-worth-rs-1-311cr-from-coal-india-12881426.html",
            "description": "KPI Green Energy Share Price | Currently, the stock is trading 30.17 percent below its 52-week high and 107.8 percent above its 52-week low.",
            "pubDate": "2024-12-03T02:58:16.190109"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a muted start; US markets mixed, Asia trades higher",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-03-12-2024-liveblog-12881532.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The Nasdaq and S&P 500 scored record closing highs on Monday, boosted by tech-related shares following the market's strong November gains, as investors awaited this week's economic data including the key monthly jobs report on Friday. Asian equities rose to follow the positive lead from Wall Street where a rally in the world’s largest technology companies drove stocks to fresh all-time highs.",
            "pubDate": "2024-12-03T02:58:16.190188"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-12880947.html",
            "description": "The GIFT Nifty is indicating a muted start for the day.",
            "pubDate": "2024-12-03T02:58:16.190261"
        },
        {
            "title": "Stock Radar: Swiggy, Wipro, Indegene, Protean eGov Tec, Solar Industries, Pricol, Godavari Biorefineries, KPI Green Energy in focus on Tuesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-swiggy-wipro-indegene-protean-egov-tec-solar-industries-pricol-godavari-biorefineries-kpi-green-energy-in-focus-on-tuesday-12881520.html",
            "description": "Stocks like Torrent Power, HCL Technologies, MOIL, LKP Finance, Bharat Petroleum Corporation, TVS Motor Company, Indoco Remedies, Hindustan Unilever, Nazara Technologies, IRFC, and Allcargo Logistics will also be in focus on December 3.",
            "pubDate": "2024-12-03T02:58:16.190332"
        },
        {
            "title": "Trade Spotlight: How should you trade Tata Motors, Affle India, Kaynes Technology, Ashoka Buildcon, ADF Foods, and others on Tuesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-tata-motors-affle-india-kaynes-technology-ashoka-buildcon-adf-foods-and-others-on-tuesday-12881497.html",
            "description": "The trend is likely to remain positive, but consolidation cannot be ruled out until the benchmark indices decisively surpass the 50 percent Fibonacci retracement. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-03T02:58:16.190404"
        },
        {
            "title": "Chart of the Day: Steady capacity additions to help IndiGo maintain leadership in Indian aviation market",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-steady-capacity-additions-to-help-indigo-maintain-leadership-in-indian-aviation-market-12881559.html",
            "description": "Peer Air India group is facing longer delays in aircraft deliveries from Boeing.",
            "pubDate": "2024-12-03T03:53:46.141327"
        },
        {
            "title": "Agri Picks Report December 03, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-03-2024-geojit-financial-services-12881590.html",
            "description": "According to Geojit Financial Services, Farmers in Rajasthan have sown rabi crops over 9.29 million hectares as of Saturday, up 9.8% on year from 8.46 million hectares sown in the corresponding period last year, according to a release by the state agriculture department.",
            "pubDate": "2024-12-03T03:53:46.141415"
        },
        {
            "title": "Can Nifty, Sensex extend bull run to third straight day? | BPCL, Indegene in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/can-nifty-sensex-extend-bull-run-to-third-straight-day-bpcl-indegene-in-focus-opening-bell-12881582.html",
            "description": "Markets saw a smart recovery in the last session helped by strong gains in heavyweight stocks. Sensex and Nifty extended gains to second straight day. Experts now eye Nifty to see an immediate resistance of 24,550 with support placed around 24,000. This morning, global cues were strong. The US markets largely closed higher overnight, with the S&P 500 and NASDAQ Composite at record highs. Asia-Pacific markets, too, traded higher this morning.  Among stocks in focus, watch out for BPCL, Indegene and Nazara Tech. Catch Lovisha Darad in conversation with Ajit Mishra - SVP, Research, Religare Broking and Aditya Khemka, Fund Manager, InCred Asset Management.\n#nse #bse #stockmarket #sharemarket #marketopeningbell",
            "pubDate": "2024-12-03T03:53:46.141487"
        },
        {
            "title": "KPIT Tech to recover after recent underperformance, says JPMorgan",
            "link": "https://www.moneycontrol.com/news/business/markets/kpit-tech-to-recover-after-recent-underperformance-says-jpmorgan-12881557.html",
            "description": "While the current pace of investments in EV and hybrid technologies has slowed, JPMorgan said that such investments will continue, though at a measured pace.",
            "pubDate": "2024-12-03T03:53:46.141557"
        },
        {
            "title": "Swiggy shares extend gains, up nearly 10% ahead of Q2 earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/swiggy-shares-extend-gains-up-nearly-10-ahead-of-q2-earnings-12881651.html",
            "description": "Yesterday, the company said it has expanded its 10-minute food delivery offering, Bolt, to over 400 cities and towns across India.",
            "pubDate": "2024-12-03T05:13:35.280164"
        },
        {
            "title": "Shivalik Bimetal Controls | Sufficient capacity for next leg of growth",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/shivalik-bimetal-controls-sufficient-capacity-for-next-leg-of-growth-12881688.html",
            "description": "Strategic efforts are bearing fruits for Shivalik Bimetal Controls, particularly in the European market. Expansion in other high-growth markets and the rising long-term demand for electric vehicles position the company for significant growth. Both the shunt and bimetal businesses are operating at around 40 percent capacity, highlighting a significant room to expand. As the North American market recovers and demand rebounds, Shivalik is poised to capitalise on emerging opportunities and drive sustained growth. The company has an overall revenue potential of Rs 1500-1600 crore at peak utilisation",
            "pubDate": "2024-12-03T05:32:49.559063"
        }
    ]
}