{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-31T10:16:40.601420",
    "items": [
        {
            "title": "Dabur: A bigger rural footprint, a wider product basket key growth levers",
            "link": "https://www.moneycontrol.com/news/business/earnings/dabur-a-bigger-rural-footprint-a-wider-product-basket-key-growth-levers-12855763.html",
            "description": "Urban demand has bottomed out and expected to pick up once food inflation stabilises",
            "pubDate": "2024-10-31T04:11:16.089003"
        },
        {
            "title": "Can Indian startups grab the AI opportunity to threaten entrenched IT market leaders?",
            "link": "https://www.moneycontrol.com/news/opinion/can-indian-startups-grab-the-ai-opportunity-to-threaten-entrenched-it-market-leaders-12855761.html",
            "description": "Indian startups in the AI space are still struggling to find themselves. In the first half of 2024, the funding for generative artificial intelligence (AI) startups in India was just around $760 million. That number has to go up if the country is to catch this wave. Otherwise, like it happened with the cloud revolution, we will have to be content with collecting the crumbs",
            "pubDate": "2024-10-31T04:11:16.089090"
        },
        {
            "title": "Kaynes Technology Q2: Impressive growth, but cash flow remains anaemic",
            "link": "https://www.moneycontrol.com/news/business/earnings/kaynes-technology-q2-impressive-growth-but-cash-flow-remains-weak-12855769.html",
            "description": "The company continues to execute well; it has been upping the outlook in the last few quarters, beating industry trends",
            "pubDate": "2024-10-31T04:33:15.445058"
        },
        {
            "title": "Larsen & Toubro: Better recovery in H2 likely, aided by higher order inflows",
            "link": "https://www.moneycontrol.com/news/business/stocks/larsen-toubro-better-recovery-in-h2-likely-aided-by-higher-order-inflows-12855896.html",
            "description": "A general slowdown in the construction and engineering segment in H1 hit the company. However, higher capex and likely availability of workers and other resources are expected to make H2 stronger.",
            "pubDate": "2024-10-31T05:30:13.678718"
        },
        {
            "title": "E-commerce and Q-commerce: Revolutionising retail and consumer convenience",
            "link": "https://www.moneycontrol.com/news/opinion/e-commerce-and-q-commerce-revolutionising-retail-and-consumer-convenience-12855980.html",
            "description": "E-commerce and q-commerce are transforming traditional retail by enhancing convenience for consumers and boosting sales for local vendors. Despite concerns about their impact on kirana stores, these innovations create job opportunities and foster entrepreneurship, benefiting the entire value chain",
            "pubDate": "2024-10-31T07:38:30.649650"
        },
        {
            "title": "BPL founder TPG Nambiar no more",
            "link": "https://www.moneycontrol.com/news/business/companies/bpl-founder-tpg-nambiar-no-more-12856200.html",
            "description": "Mourning his demise, former Chief Minister B S Yediyurappa said on ’X’, ”Saddened by the passing of Shri TPG Nambiar, founder of the iconic BPL brand, who has been a close acquaintance for a long time",
            "pubDate": "2024-10-31T10:16:40.069480"
        }
    ]
}