{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-18T02:07:40.457100",
    "items": [
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-49-12942897.html",
            "description": "The Foreign institutional investors (FIIs) offloaded equities worth Rs 3,937 crore on February 17, while domestic institutional investors (DIIs) purchased equities worth Rs 4,759 crore, on the same day.",
            "pubDate": "2025-02-18T02:07:35.392703"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat start; Asian markets mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-gift-nifty-suggests-a-flat-start-asian-markets-mixed-liveblog-12943432.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Indian markets snapped eight-day losing streak on February 17 to end marginally higher in the volatile session on February 17 with Nifty at around 22,950 led by pharma, metal, financial stocks. At close, the Sensex was up 57.65 points or 0.08 percent at 75,996.86, and the Nifty was up 30.25 points or 0.13 percent at 22,959.50.",
            "pubDate": "2025-02-18T02:07:35.392784"
        },
        {
            "title": "Trade Spotlight: How should you trade Tata Motors, BHEL, Bajaj Finserv, Apollo Tyres, Aarti Pharmalabs, and others on February 18?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-tata-motors-bhel-bajaj-finserv-apollo-tyres-aarti-pharmalabs-and-others-on-february-18-12943420.html",
            "description": "The market may extend the upward move amid consolidation, but sustainability will be key to watch. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-18T02:07:35.392852"
        },
        {
            "title": "Stocks to Watch Today: Bharti Airtel, ABB India, Paytm, KIMS, Zomato, Gabriel India, Thomas Cook in focus on 18 February",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-bharti-airtel-abb-india-paytm-kims-zomato-gabriel-india-thomas-cook-in-focus-on-18-february-12943416.html",
            "description": "Stocks To Watch, Feb 18: Stocks like Uno Minda, Deepak Fertilisers and Petrochemicals Corporation, SBI Cards and Payment Services, GMR Airports, Allcargo Terminals, Suraksha Diagnostic, Anant Raj, Karnataka Bank ,Transformers and Rectifiers India, Vikas Lifecare, Ajax Engineering, Nazara Technologies, and TVS Supply Chain Solutions will be in focus on February 18.",
            "pubDate": "2025-02-18T02:07:35.392918"
        }
    ]
}