{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-28T07:09:38.383883",
    "items": [
        {
            "title": "Kesoram Industries shares sharply lower after major block deal involving 3.5% equity",
            "link": "https://www.moneycontrol.com/news/business/stocks/kesoram-industries-shares-sharply-lower-after-major-block-deal-involving-3-5-equity-12978421.html",
            "description": "A large block deal involving 3.5% of its equity where around 10.85 million shares changed hands on the NSE in a single transaction.",
            "pubDate": "2025-03-28T07:08:18.067300"
        },
        {
            "title": "Buy Muthoot Finance; target of Rs 2849: LKP Research",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-muthoot-finance-target-of-rs-2849-lkp-research-12978564.html",
            "description": "LKP Research is bullish on Muthoot Finance has recommended buy rating on the stock with a target price of Rs 2849 in its research report dated March 28, 2025.",
            "pubDate": "2025-03-28T07:08:18.067367"
        },
        {
            "title": "BHEL gets LoI for Rs 11,800-crore order from Chhattisgarh power co, shares rise 3%",
            "link": "https://www.moneycontrol.com/news/business/markets/bhel-gets-loi-for-rs-11-800-crore-order-from-chhattisgarh-power-co-shares-rise-3-12978454.html",
            "description": "BHEL shares have now extended gains for the second consecutive session, rising over 5 percent since markets closed on March 26. The stock has risen nearly 23 percent in the past one month.",
            "pubDate": "2025-03-28T07:08:18.067433"
        },
        {
            "title": "Broader markets gain more than benchmark indices, as foreign flows support monthly gains for March",
            "link": "https://www.moneycontrol.com/news/business/markets/broader-markets-gain-more-than-benchmark-indices-as-foreign-flows-support-monthly-gains-for-march-12978410.html",
            "description": "Nifty ended the March series back above 23,500, with some experts pointing to further upside from here on, even as tariff-related development will be key the sentiment. For the month, key indices are set to snap the string of monthly losses, supported by a revival in foreign inflows.",
            "pubDate": "2025-03-28T07:08:18.067497"
        },
        {
            "title": "Zen Technologies stock surges 4% on Rs 152-crore defence order for air defence simulators",
            "link": "https://www.moneycontrol.com/news/business/stocks/zen-technologies-stock-surges-4-on-rs-152-crore-defence-order-for-air-defence-simulators-12978386.html",
            "description": "Zen Technologies' latest defence contract for its Integrated Air Defence Combat Simulator (IADCS) reinforces India's self-reliance in military training solutions. Developed entirely in-house, the simulator enhances air defence readiness while reducing training costs.",
            "pubDate": "2025-03-28T07:08:18.067562"
        },
        {
            "title": "India Inc, investors brace for Trump's April 2 tariffs: Key stocks to watch",
            "link": "https://www.moneycontrol.com/news/business/markets/india-inc-and-investors-brace-for-trump-s-april-2-tariffs-key-stocks-to-watch-12978367.html",
            "description": "Of the total trade in FY24, Indian exports to the US stood at $77.5 billion, while US exports to India stood at $40.7 billion. America is the third largest investor in India with cumulative FDI inflows of $67.76 billion between April 2000 and September 2024.",
            "pubDate": "2025-03-28T07:08:18.067627"
        },
        {
            "title": "Godrej Properties shares jump 2% after firm sells Rs 1,000-crore luxury flats in Gurugram",
            "link": "https://www.moneycontrol.com/news/business/markets/godrej-properties-shares-jump-2-after-firm-sells-rs-1-000-crore-luxury-flats-in-gurugram-12978318.html",
            "description": "The company announced that 'Godrej Astra' is strategically located in Gurugram's Golf Course Road micro-market and is spread across nearly 2.76 acres of land.",
            "pubDate": "2025-03-28T07:08:18.067693"
        },
        {
            "title": "Mas Financial – Contrasting business performance and stock show",
            "link": "https://www.moneycontrol.com/news/companies-2/mas-financial-contrasting-business-performance-and-stock-show-12978310.html",
            "description": "Should investors add this quality play in their long-term portfolio?",
            "pubDate": "2025-03-28T07:08:18.067758"
        },
        {
            "title": "Bharat Electronics shares gain as it secures orders worth Rs 1,385 crore in 2 weeks",
            "link": "https://www.moneycontrol.com/news/business/markets/bharat-electronics-shares-gain-as-it-secures-orders-worth-rs-1-385-crore-in-2-weeks-12978312.html",
            "description": "BEL's newly received orders encompass a diverse range of defence and electronic systems, including radar spares, radar upgradation, among others",
            "pubDate": "2025-03-28T07:08:18.067821"
        },
        {
            "title": "Agri Picks Report March 28, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-28-2025-geojit-financial-services-12978313.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.5 million acres (1 acre = 0.4 hectares) as of Wednesday, up 12.7% from 6.7 million acres sown in the same period last year, according to a report released by the state agriculture department.",
            "pubDate": "2025-03-28T07:08:18.067884"
        },
        {
            "title": "Live: Will Bulls March Past 24000 In April Series? Countdown To April 2 Tariff Deadline|Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-bulls-march-past-24000-in-april-series-countdown-to-april-2-tariff-deadline-opening-bell-12978176.html",
            "description": "Bulls dominated the market on March 27, the monthly F&O expiry session, propelling the Nifty 50 up by 105 points with above-average volumes. The index successfully held its 200-day EMA and maintained the bullish gap from March 24, signaling strength. As long as it stays above key moving averages, the overall trend is expected to remain positive. A sustained close above 23,400 could drive the index toward the 23,800–24,000 range. However, a decisive drop below 23,400 may shift momentum in favor of the bears, experts suggest. This morning global cues are tepid. BSE, HAL, BEL, Asian Paints, JSPL  will be in focus today. Catch Nandita Khemka in conversation with Sudeep Shah—Head of Technical & Derivative Research, SBI Securities and Mayuresh Joshi, Head of Equity Research, William O’Neil India",
            "pubDate": "2025-03-28T07:08:18.067947"
        },
        {
            "title": "Weekly Tactical Pick: This affordable housing stock has reasons to command higher valuations",
            "link": "https://www.moneycontrol.com/news/business/stocks/weekly-tactical-pick-this-affordable-housing-stock-has-reasons-to-command-higher-valuations-12978275.html",
            "description": "The company has survived stiff competition and negotiated regulatory challenges well",
            "pubDate": "2025-03-28T07:08:18.068025"
        },
        {
            "title": "CLSA maintains 'high-conviction outperform' on NHPC shares, sees 44% upside",
            "link": "https://www.moneycontrol.com/news/business/stocks/clsa-maintains-high-conviction-outperform-on-nhpc-shares-sees-44-upside-12978271.html",
            "description": "The correction in NHPC's stock can give investors an inexpensive opportunity to accumulate, noted brokerage CLSA.",
            "pubDate": "2025-03-28T07:08:18.068089"
        },
        {
            "title": "Ultratech Cement shares rise as it commissions multiple brownfield expansions",
            "link": "https://www.moneycontrol.com/news/business/markets/ultratech-cement-shares-in-focus-as-it-commissions-multiple-brownfield-expansions-12978268.html",
            "description": "UltraTech’s total domestic grey cement production capacity has now reached 183.36 mtpa",
            "pubDate": "2025-03-28T07:08:18.068152"
        },
        {
            "title": "KEC International: Strong Order Wins & Execution – Is a Big Rebound Coming?",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/kec-international-strong-order-wins-execution-is-a-big-rebound-coming-12978175.html",
            "description": "KEC International, a key player in the power transmission and distribution (T&D) sector, has faced execution challenges in Railways and Civil. However, its diversified operations, strong order inflows, and improving T&D business indicate a turnaround. Following a stock correction, the valuations have turned attractive, supported by an anticipated recovery in execution and margin expansion in the coming quarters.",
            "pubDate": "2025-03-28T07:08:18.068215"
        },
        {
            "title": "Force Motors shares rise 4% on defence force order for 2,978 vehicles",
            "link": "https://www.moneycontrol.com/news/business/stocks/force-motors-shares-in-focus-on-defence-force-order-for-2-978-vehicles-12977992.html",
            "description": "Force Motors Share Price | The share price jumped 39 percent in the last one-month. The share touched a 52-week high of Rs 10,272.65 and a 52-week low of Rs 6,128.55 on 29 April, 2024 and 28 January, 2025, respectively.",
            "pubDate": "2025-03-28T07:08:18.068276"
        },
        {
            "title": "Zen Technologies shares up nearly 4% on winning Rs 152 crore order from Defence Ministry",
            "link": "https://www.moneycontrol.com/news/business/stocks/zen-technologies-shares-in-focus-on-winning-rs-152-crore-order-from-defence-ministry-12977993.html",
            "description": "Zen Technologies share price | The share price increased by more than 62 percent in the last one-year. The share touched a 52-week high of Rs 2,627.95 and a 52-week low of Rs 886.20 on 24 December, 2024 and 09 May, 2024, respectively.",
            "pubDate": "2025-03-28T07:08:18.068339"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty trade flat; auto, IT, realty drag, oil & gas, FMCG gain",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-28-03-2025-liveblog-12978201.html",
            "description": "Sensex Today | Stock Market LIVE Updates: BSE Midcap index up 0.2 percent and Smallcap index up 0.5 percent. BSE Limited, HDFC Bank, CDSL, M&M, Hindustan Aeronautics are among most active shares on the NSE. On the sectoral front, IT index down 0.5 percent, while FMCG, oil & gas up 1-2 percent.",
            "pubDate": "2025-03-28T07:08:18.068401"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-74-12977497.html",
            "description": "The foreign institutional investors bought equities worth Rs 11,111 crore on March 27, while domestic institutional investors also bought equities of Rs 2517 crore, on the same day",
            "pubDate": "2025-03-28T07:08:18.068464"
        },
        {
            "title": "Stocks to Watch Today: Infosys, Zaggle Prepaid, Bharat Electronics, Force Motors, Jindal Steel, Zensar Tech, Active Infrastructures, HCLTech in focus on 28 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-infosys-zaggle-prepaid-bharat-electronics-force-motors-jindal-steel-zensar-tech-active-infrastructures-hcltech-in-focus-on-28-march-12978180.html",
            "description": "Stocks to Watch, Mar 28: Stocks like Punjab & Sind Bank, UCO Bank, Adani Green Energy, Piramal Enterprises, Raymond, SBI Life Insurance Company, Jio Financial Services, CESC, DCM Shriram, Aditya Birla Fashion and Retail, Power Finance Corporation, Hilton Metal Forging, Khaitan Chemicals, Uflex, and BEML will be in focus on March 28.",
            "pubDate": "2025-03-28T07:08:18.068525"
        }
    ]
}