{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-26T04:34:42.745257",
    "items": [
        {
            "title": "What next for Waaree after withdrawal of US tax incentives for solar?",
            "link": "https://www.moneycontrol.com/news/opinion/what-next-for-waaree-after-withdrawal-of-us-tax-incentives-for-solar-13045411.html",
            "description": "A large part of Waaree’s Rs 47,000 crore order book is from the US",
            "pubDate": "2025-05-26T04:03:28.166049"
        },
        {
            "title": "Glenmark Pharma shares drop 3% on lower-than-expected Q4 results: Should you buy, sell, hold?",
            "link": "https://www.moneycontrol.com/news/business/markets/glenmark-pharma-shares-drop-3-on-lower-than-expected-q4-results-should-you-buy-sell-hold-13045366.html",
            "description": "Glenmark Pharma: Despite strong growth in Europe and domestic formulations, muted demand in India and pressure in diabetes products weighed on overall performance",
            "pubDate": "2025-05-26T04:03:28.166145"
        },
        {
            "title": "Nifty Eyes 25,000 As Bulls Return| India Pips Japan As Fourth Largest Economy| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-eyes-25-000-as-bulls-return-india-pips-japan-as-fourth-largest-economy-opening-bell-live-13045069.html",
            "description": "Nifty 50 rebounded sharply on May 23, breaking its five-day streak of lower highs with a 1% gain, closing near a key resistance level at 24,850. On the weekly chart, the index remains firmly above all major moving averages, reinforcing a positive long-term trend. However, analysts expect near-term consolidation, with the market likely to trade in a range. A sustained hold above 24,700 could pave the way for a move toward 25,000–25,200. Key support is seen at 24,460, close to last week’s low. Stocks to watch include NTPC, JSW Steel, Glenmark, and Eternal. Meanwhile, two IPOs are set to debut on the primary market today: Brookfield-backed Schloss Bangalore (Leela Hotels) and Aegis Vopak Terminals, a unit of Aegis Logistics. Catch Nandita Khemka in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Siddarth Bhamre, Institutional Research Head - ACMIIL (Asit C Mehta Investment Interrmediates Ltd)",
            "pubDate": "2025-05-26T04:03:28.166246"
        },
        {
            "title": "Ashok Leyland shares in focus post Q4 earnings; should you buy, sell or hold?",
            "link": "https://www.moneycontrol.com/news/business/earnings/ashok-leyland-shares-in-focus-post-q4-earnings-should-you-buy-sell-or-hold-13044973.html",
            "description": "Ashok Leyland share price: The company said it is in a very strong cash position, ending the year with a cash surplus of Rs 4,242 crore.",
            "pubDate": "2025-05-26T04:03:28.166322"
        },
        {
            "title": "Can Sensex, Nifty extend gains for a second session? Key levels to watch on May 26",
            "link": "https://www.moneycontrol.com/news/business/markets/can-sensex-nifty-extend-gains-for-a-second-session-check-key-levels-for-may-26-13044906.html",
            "description": "In the previous session, bulls staged a strong comeback with benchmark indices Nifty and Sensex rebounding sharply, led by a rally in banking, IT, and metal stocks.",
            "pubDate": "2025-05-26T04:03:28.166390"
        },
        {
            "title": "Stocks to Watch Today: NTPC, JSW Steel, JK Cement, Ashoka Buildcon, GNFC, Paytm, Eternal, Zydus Life, Nibe, Havells India in focus on 26 May",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-ntpc-jsw-steel-jk-cement-ashoka-buildcon-gnfc-paytm-eternal-zydus-life-nibe-havells-india-in-focus-on-26-may-13044910.html",
            "description": "Stocks to Watch, 26 May: Stocks like Finolex Industries, HBL Engineering, Lux Industries, One 97 Communications Paytm, Eternal, Zydus Lifesciences, NIBE, Havells India, Cartrade Tech, Gravita India, Interarch Building Solutions, Lloyds Engineering Works, Ramco Cements, Pondy Oxides & Chemicals, and Gujarat Narmada Valley Fertilizers & Chemicals will be in focus on May 26.",
            "pubDate": "2025-05-26T04:03:28.166458"
        },
        {
            "title": "Asian shares, US futures rise on EU tariff delay",
            "link": "https://www.moneycontrol.com/news/business/asian-shares-us-futures-rise-on-eu-tariff-delay-13044897.html",
            "description": "Contracts for the S&P 500, Nasdaq 100 and Euro Stoxx 50 rose about 1% after Trump said he had agreed to delay the date for a 50% tariff on goods from the European Union to July 9 from June 1.",
            "pubDate": "2025-05-26T04:03:28.166524"
        },
        {
            "title": "Sensex up 600 pts, Nifty reclaims 25,000 as banks support rally, midcaps outperform",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-up-600-pts-nifty-reclaims-25-000-as-banks-support-rally-midcaps-outperform-13045134.html",
            "description": "The broader market represented by the midcap 100 and smallcap 100 indices gained 0.5 and 0.4 percent, respectively. The two have managed to pare most of their losses and trade just 1 and 6 percent lower YTD.",
            "pubDate": "2025-05-26T04:34:42.215865"
        }
    ]
}