{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-06T03:24:22.303035",
    "items": [
        {
            "title": "Live: Will Nifty mount to 25,000 amid higher volatility? | RBI policy outcome in focus |Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-mount-to-25-000-amid-higher-volatility-rbi-policy-outcome-in-focus-opening-bell-12884518.html",
            "description": "Indian benchmark indices Sensex and Nifty extended their bull run to fifth straight day supported by gains in financial and technology stocks. Both the benchmarks gained 1 percent each in a highly volatile session, with Nifty ending above 24,700 on its weekly expiry day. Experts now eye Nifty to mount above 25,000 mark, with support placed around 24,350. The Reserve Bank of India (RBI) will deliver its policy outcome, with Street expecting no change in repo rates but some liquidity measures could be on the anvil to support growth. This morning, global cues were mixed. US markets retreated from their record highs, while Asia-Pacific markets were mixed. Among stocks in focus, watch out for Rate sensitive stocks, Dr Reddy's, and Garden Reach. Catch Lovisha Darad in conversation with Raja Venkatraman, Co-Founder, NeoTrader & Trading Influencer.",
            "pubDate": "2024-12-06T03:24:09.994485"
        },
        {
            "title": "Mobikwik sets price band of Rs 265-279 a share; cuts down IPO size for third time",
            "link": "https://www.moneycontrol.com/news/business/ipo/mobikwik-sets-price-band-of-rs-265-279-a-share-cuts-down-ipo-size-for-third-time-12884509.html",
            "description": "Anchor bidding will begin on December 10, and the issue will close on December 13. The basis of allotment is scheduled for December 16, followed by the initiation of refunds and equity credit on December 17",
            "pubDate": "2024-12-06T03:24:09.994568"
        },
        {
            "title": "What next for MapmyIndia after consumer business fiasco?",
            "link": "https://www.moneycontrol.com/news/opinion/what-next-for-mapmyindia-after-consumer-business-fiasco-12884490.html",
            "description": "Transfer of B2C business for a minority stake has upset investors.",
            "pubDate": "2024-12-06T03:24:09.994640"
        },
        {
            "title": "Vishal Mega Mart IPO price band set at Rs 74-78 per share; check listing timeline",
            "link": "https://www.moneycontrol.com/news/business/ipo/vishal-mega-mart-ipo-price-band-set-at-rs-74-78-per-share-check-listing-timeline-12884499.html",
            "description": "Vishal Mega Mart IPO anchor bidding will be on December 10, with the public issue open during December 11-13. The basis of share allotment is scheduled for December 16.",
            "pubDate": "2024-12-06T03:24:09.994709"
        },
        {
            "title": "Near-term risks to investing in Indian equities remain",
            "link": "https://www.moneycontrol.com/news/opinion/near-term-risks-to-investing-in-indian-equities-remain-12884503.html",
            "description": "Any market that assumes that the liquidity will take care of investment mistakes, valuation errors and capital allocation risks will always learn old lessons in new ways.",
            "pubDate": "2024-12-06T03:24:09.994778"
        },
        {
            "title": "Brokerage Radar: HSBC initiates coverage on Swiggy with 'Hold', Nuvama backs Zen Tech with 'Buy'",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-hsbc-initiates-coverage-on-swiggy-with-hold-nuvama-backs-zen-tech-with-buy-12884500.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Westlife, Swiggy, Zen Tech and more.",
            "pubDate": "2024-12-06T03:24:09.994849"
        },
        {
            "title": "Stock Market LIVE Updates: Indices to see flat start ahead or RBI policy; Canara Bank, Waaree Energies in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-06-12-2024-liveblog-12884477.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Mishtann Foods, Cummins India, Dr Reddy’s Laboratories, Waaree Energies, Ola Electric Mobility, Afcons Infrastructure, Garden Reach Shipbuilders & Engineers, and Spandana Sphoorty Financial will also be in focus on December 6.",
            "pubDate": "2024-12-06T03:24:09.994919"
        },
        {
            "title": "Sai Life Sciences fixes price band at Rs 522-549 a share for IPO",
            "link": "https://www.moneycontrol.com/news/business/ipo/sai-life-sciences-fixes-price-band-at-rs-522-549-a-share-for-ipo-12884486.html",
            "description": "Anchor bidding opens on December 10 and closes on December 13. Allotment is set for December 16, with refunds issued on December 17. The stock will list on exchanges on December 18.",
            "pubDate": "2024-12-06T03:24:09.994987"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-4-12884188.html",
            "description": "The GIFT Nifty is indicating a flat to positive start for the day.",
            "pubDate": "2024-12-06T03:24:09.995054"
        },
        {
            "title": "Stock Radar: Suraksha Diagnostic, Canara Bank, Nykaa, India Gelatine, Subex, Ramco Systems, GPT Healthcare in focus on Friday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-suraksha-diagnostic-canara-bank-nykaa-india-gelatine-subex-ramco-systems-gpt-healthcare-in-focus-on-friday-12884466.html",
            "description": "Stocks like Mishtann Foods, Cummins India, Dr Reddy’s Laboratories, Waaree Energies, Ola Electric Mobility, Afcons Infrastructure, Garden Reach Shipbuilders & Engineers, and Spandana Sphoorty Financial will also be in focus on December 6.",
            "pubDate": "2024-12-06T03:24:09.995122"
        },
        {
            "title": "Indus Towers promoters sells Rs 2800 crore worth shares in a block deal",
            "link": "https://www.moneycontrol.com/news/business/markets/indus-towers-promoters-sells-rs-2800-crore-worth-shares-in-a-block-deal-12884461.html",
            "description": "As of September 30, Usha Martin Telematics Limited had a 0.74 percent stake and  Omega Telecom Holdings Private Limited had a 2.26 percent stake in Indus Towers.",
            "pubDate": "2024-12-06T03:24:09.995195"
        }
    ]
}