{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-26T13:00:52.550779",
    "items": [
        {
            "title": "HG Infra Engineering: Why should you bet on this construction player?",
            "link": "https://www.moneycontrol.com/news/business/stocks/hg-infra-engineering-why-should-you-bet-on-this-construction-player-12897707.html",
            "description": "The company has already carved a niche in the road construction space. Its diversification into newer segments is also yielding results and it boasts of a huge order book in the infrastructure segment",
            "pubDate": "2024-12-26T04:52:24.087593"
        },
        {
            "title": "PNC Infra gets relief from High Court in disqualification order by MoRTH, NHAI",
            "link": "https://www.moneycontrol.com/news/business/markets/pnc-infra-gets-relief-from-high-court-in-disqualification-order-by-morth-nhai-12897640.html",
            "description": "PNC Infratech and its two SPVs were disqualified by MoRTH and NHAI from participating in tendering process for a year in October. The decision was challenged by the company before the Division Bench of Delhi High Court in November through a Letters Patent Appeals.",
            "pubDate": "2024-12-26T05:00:06.469910"
        },
        {
            "title": "Newgen Soft extends December rally to 44% after bagging $2.27 million Saudi Arabia order",
            "link": "https://www.moneycontrol.com/news/business/markets/newgen-soft-extends-december-rally-to-44-after-bagging-2-27-million-order-saudi-arabia-12897782.html",
            "description": "Newgen Software is looking to expand its presence in the middle east with acquisition of new clients as well as upselling to existing customers. Shares of the company are higher by 44% in December so far, making it the top gainer among NSE 500.",
            "pubDate": "2024-12-26T05:42:07.499822"
        },
        {
            "title": "Godfrey Phillips India shares snap seven-day fall to rise 7%; board appoints new COO and updates on 24Seven trademark tussle",
            "link": "https://www.moneycontrol.com/news/business/markets/godfrey-phillips-india-shares-snap-seven-day-fall-to-rise-7-board-appoints-new-coo-and-updates-on-24seven-trademark-tussle-12897791.html",
            "description": "24Seven Retail and Samir Modi, son of Managing Director Bina Modi, have sought royalty for trademark and moved a case before Delhi High Court. Godfrey Phillips India has contested the demands and said there is no royalty payable.",
            "pubDate": "2024-12-26T07:36:05.586472"
        },
        {
            "title": "India could be our biggest market in the next two years: Canva co-founder Cameron Adams",
            "link": "https://www.moneycontrol.com/news/business/companies/india-could-be-our-biggest-market-in-the-next-two-years-canva-co-founder-cameron-adams-12898085.html",
            "description": "In an interview with Moneycontrol, Adams spoke about the future of design roles, their plans to build a team in India and the impact that AI will have on workflows going forward",
            "pubDate": "2024-12-26T09:37:16.251330"
        },
        {
            "title": "Gujarat Fluorochem to sell captive power plant to arm IGREL Mahidad, invest in two subsidiaries",
            "link": "https://www.moneycontrol.com/news/business/markets/gujarat-fluorochem-to-sell-captive-power-plant-to-arm-igrel-mahidad-invest-in-two-subsidiaries-12898133.html",
            "description": "A power purchase agreement was also signed between Gujarat Fluorochem and IGREL Mahidad as well as Flurry Wind Energy at the rate of Rs 4 per unit, based on the number of units generated.",
            "pubDate": "2024-12-26T11:43:01.041515"
        },
        {
            "title": "RBL Bank divested entire holding in DAM Capital during recently concluded IPO",
            "link": "https://www.moneycontrol.com/news/business/markets/rbl-bank-divested-entire-holding-in-dam-capital-during-recently-concluded-ipo-12898234.html",
            "description": "DAM Capital's recently concluded IPO saw RBL Bank exit its shareholding entirely, representing 8.16% of the share capital. The bank added that it does not have any shareholding in DAM after the transaction.",
            "pubDate": "2024-12-26T11:50:25.767032"
        },
        {
            "title": "Sumitomo Mitsui Financial Group infuses Rs 3,000 crore into SMFG India Credit via rights issue",
            "link": "https://www.moneycontrol.com/news/business/companies/sumitomo-mitsui-financial-group-infuses-rs-3-000-crore-into-smfg-india-credit-via-rights-issue-12898252.html",
            "description": "Highest-ever fund infusion of Rs 4,300 crore in a financial year for SMFG India Credit, says firm",
            "pubDate": "2024-12-26T12:34:01.215645"
        },
        {
            "title": "Tata Group chairman Chandrasekaran's year-end note promises jobs push, sees AI acceleration ahead",
            "link": "https://www.moneycontrol.com/news/business/companies/tata-group-chairman-chandrasekaran-s-year-end-note-promises-jobs-push-sees-ai-acceleration-ahead-12898254.html",
            "description": "Tata Group's N Chandrasekaran underscored in his year-end note that the Indian economy is strong and one can look ahead at 2025 with a sense of hope and optimism.",
            "pubDate": "2024-12-26T13:00:51.987945"
        }
    ]
}