{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-17T03:51:47.175131",
    "items": [
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-48-12941304.html",
            "description": "The GIFT Nifty is a trading firm, indicating a positive start for the day. Wall Street stocks ended mixed on Friday, with Nvidiaclimbing and Microsoft dipping, while Treasury yields declined a day after U.S. President Donald Trump unveiled reciprocal tariff plans but stopped short of imposing new ones.",
            "pubDate": "2025-02-17T02:41:59.676637"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a firm opening; US markets mixed, Asian markets gain",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-17-02-2025-liveblog-12942130.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street stocks ended mixed on Friday, with Nvidiaclimbing and Microsoft dipping, while Treasury yields declined a day after U.S. President Donald Trump unveiled reciprocal tariff plans but stopped short of imposing new ones.",
            "pubDate": "2025-02-17T02:41:59.676719"
        },
        {
            "title": "Trade Spotlight: How should you trade Bajaj Finance, ICICI Bank, Tata Consumer Products, Redington, Kaveri Seed, and others on February 17?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bajaj-finance-icici-bank-tata-consumer-products-redington-kaveri-seed-and-others-on-february-17-12942098.html",
            "description": "The market is expected to consolidate further, with last week's low acting as support. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-17T02:41:59.676787"
        },
        {
            "title": "Stocks to Watch Today: Alembic Pharma, BHEL, Zydus Life, Zen Technologies, Ajax Engineering, Utkarsh SFB, Glenmark in focus on 17 February",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-alembic-pharma-bhel-zydus-life-zen-technologies-ajax-engineering-utkarsh-sfb-glenmark-in-focus-on-17-february-12942090.html",
            "description": "Stocks To Watch, Feb 17: Stocks like Narayana Hrudayalaya, Dilip Buildcon, NRB Bearings, Rail Vikas Nigam, Borosil Renewables, Aditya Birla Fashion & Retail, La Opala RG, Dish TV India, Gujarat Narmada Valley Fertilizers and Chemicals, Easy Trip Planners, Wipro,Ujjivan Small Finance Bank, and Shriram Finance will be in focus on February 17.",
            "pubDate": "2025-02-17T02:41:59.676853"
        },
        {
            "title": "IT sector’s stable technology budgets may face macro headwinds",
            "link": "https://www.moneycontrol.com/news/opinion/it-sector-s-stable-technology-budgets-may-face-macro-headwinds-12942160.html",
            "description": "Industry consultants and managements of IT companies indicate a stable or relatively better technology spending in 2025",
            "pubDate": "2025-02-17T03:31:33.098882"
        },
        {
            "title": "DOMS Industries: Gaining traction with consistent performance",
            "link": "https://www.moneycontrol.com/news/business/earnings/doms-industries-gaining-traction-with-consistent-performance-12942173.html",
            "description": "The integration of the Uniclan business, continuous capacity addition, and diversified product segment are driving growth",
            "pubDate": "2025-02-17T03:44:18.567237"
        },
        {
            "title": "Agri Picks Report February 17, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-february-17-2025-geojit-financial-services-12942188.html",
            "description": "According to Geojit Financial Services, The Cotton Association of India has lowered its January estimate for the country's cotton production for 2024-25 (OctSept) to 30.18 million bales (1 bale = 170 kg). In December, it had estimated the country's cotton production at 30.43 million bales.",
            "pubDate": "2025-02-17T03:44:18.567315"
        },
        {
            "title": "Live: How much can Nifty fall if it breaks below 22,800? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-how-much-can-nifty-fall-if-it-breaks-below-22-800-opening-bell-12942157.html",
            "description": "Indian markets extended losses for the eighth straight day, marking first such decline in two years. Amidst broad-based selloff, Nifty slipped below 22,950 amid FII outflows and US President Donald Trump's reciprocal tariff jitters. This week, investors will keenly watch out FII flows, Trump's tariff announcements, and rupee-dollar rate. Among stocks, watch out for Aditya Birla Fashion, Utkarsh Small Finance Bank, and RVNL in today's trading session. Catch Lovisha Darad in conversation with Sudeep Shah, Head of Technical &amp; Derivative Research, SBI Securities and Mayuresh Joshi, Head - Equity Research India, William O'Neil and Company.",
            "pubDate": "2025-02-17T03:44:18.567383"
        },
        {
            "title": "MC Pro Budget 2025 Portfolio: 18 stocks to benefit from an eventual market revival",
            "link": "https://www.moneycontrol.com/news/business/stocks/mc-pro-budget-2025-portfolio-18-stocks-to-benefit-from-an-eventual-market-revival-12941982.html",
            "description": "The MC Pro Research team has combined a top-down approach taking inspiration from the budget with bottom-up stock picking, giving due consideration to valuations amid market volatility",
            "pubDate": "2025-02-17T03:51:46.428878"
        }
    ]
}