{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-05T03:39:35.061817",
    "items": [
        {
            "title": "Agri Picks Report March 05, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-05-2025-geojit-financial-services-12956603.html",
            "description": "According to Geojit Financial Services, The National Agricultural Cooperative Marketing Federation of India procured 2.89 million tonnes of oilseeds as of Sunday, slightly more than the 2.85 million tonnes purchased as of Feb. 23, according to data by the central procurement agency released Monday.",
            "pubDate": "2025-03-05T03:39:20.840639"
        },
        {
            "title": "Coforge shares in focus on two acquisitions, signing a $1.6 bn deal, 1:5 stock split",
            "link": "https://www.moneycontrol.com/news/business/stocks/coforge-shares-in-focus-on-two-acquisitions-signing-a-1-6-bn-deal-1-5-stock-split-12956577.html",
            "description": "Amid the flurry of news, global brokerage Jefferies has reiterated its 'buy' rating on Coforge, bumping its target price up to Rs 10,350 apiece.",
            "pubDate": "2025-03-05T03:39:20.840750"
        },
        {
            "title": "Live: Can Nifty be able to defend 22,000 after 10-day loss? |  Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-be-able-to-defend-22-000-after-10-day-loss-opening-bell-12956583.html",
            "description": "Nifty has extended losing streak to tenth straight day, marking longest losing run in the last 29 years. However, broader markets saw decent recovery, with smallcaps faring better than midcaps.  Going ahead, experts now watch out if Nifty can continue to defend 22,000, with resistance around 22,250. This morning, global cues were xxx. Among stocks, watch out for Grasim Industries, Biocon, and Power Grid in today's trading session. Catch Lovisha Darad in conversation with Nilesh Jain, Head AVP- Derivative and Technical Research, Centrum Broking and Amit Jain, Co-Founder, Ashika Global Family Office Services.",
            "pubDate": "2025-03-05T03:39:20.840826"
        },
        {
            "title": "GE Vernova bags 3 orders worth Rs 500 crore from Power Grid Corp",
            "link": "https://www.moneycontrol.com/news/business/stocks/ge-vernova-bags-3-orders-worth-rs-500-crore-from-power-grid-corp-12956410.html",
            "description": "GE Vernova T&D India Share Price | The share touched a 52-week high of Rs 2,215.70 and a 52-week low of Rs 801.00 on 23 December, 2024 and 20 March, 2024, respectively.",
            "pubDate": "2025-03-05T03:39:20.840899"
        },
        {
            "title": "RVNL shares in focus on winning project worth Rs 729.8 crore from HPSEBL",
            "link": "https://www.moneycontrol.com/news/business/stocks/rvnl-shares-in-focus-on-winning-project-worth-rs-729-8-crore-from-hpsebl-12956405.html",
            "description": "Rail Vikas Nigam Share Price | The company had reported a net profit of Rs 311 crore for the third quarter of the current financial year (FY25), marking a fall of nearly 13 percent from the Rs 359 crore net profit reported in Q3 of FY24.",
            "pubDate": "2025-03-05T03:39:20.840969"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty fall at pre-open; Coforge, RVNL, Adani Wilmar, Bicon in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-05-03-2025-liveblog-12956541.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Ola Electric Mobility, Grasim Industries, RHI Magnesita India, Apollo Hospitals Enterprise, Walchandnagar Industries, ABB India, Mindteck India, Ambuja Cements, Oil and Natural Gas Corporation, Force Motors, Avanti Feeds, Banswara Syntex, SpiceJet, and Manappuram Finance will be in focus on March 5.",
            "pubDate": "2025-03-05T03:39:20.841041"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-58-12955826.html",
            "description": "US stocks ended lower on Tuesday, with the tech-heavy Nasdaq veering near correction territory, as trade tensions escalated following U.S. President Donald Trump's new tariffs on Canada, Mexico and China.",
            "pubDate": "2025-03-05T03:39:20.841113"
        },
        {
            "title": "Stocks to Watch Today: Biocon, Coforge, GE Vernova, Power Grid, JSW Energy, Welspun Specialty, Rail Vikas Nigam in focus on 5 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-biocon-coforge-ge-vernova-power-grid-jsw-energy-welspun-specialty-rail-vikas-nigam-in-focus-on-5-march-12956530.html",
            "description": "Stocks To Watch, Mar 5: Stocks like Ola Electric Mobility, Grasim Industries, RHI Magnesita India, Apollo Hospitals Enterprise, Walchandnagar Industries, ABB India, Mindteck India, Ambuja Cements, Oil and Natural Gas Corporation, Force Motors, Avanti Feeds, Banswara Syntex, SpiceJet, and Manappuram Finance will be in focus on March 5.",
            "pubDate": "2025-03-05T03:39:20.841180"
        },
        {
            "title": "Trade Spotlight: How should you trade Voltas, Force Motors, Cummins India, Bharat Dynamics, Blue Star, Fortis Healthcare, and others on March 5?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-voltas-force-motors-cummins-india-bharat-dynamics-blue-star-fortis-healthcare-and-others-on-march-5-12956513.html",
            "description": "The market may remain consolidative, with the continuation of the \"sell on rally\" strategy. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-05T03:39:20.841247"
        },
        {
            "title": "US Markets: Selloff deepens as Trump tariffs stoke trade war fears",
            "link": "https://www.moneycontrol.com/news/business/markets/us-markets-selloff-deepens-as-trump-tariffs-stoke-trade-war-fears-12956491.html",
            "description": "With the latest declines, the S&P 500 has now fallen below its Election Day closing level from November, when voters returned Trump to office.",
            "pubDate": "2025-03-05T03:39:20.841317"
        },
        {
            "title": "Wall Street tumbles as trade war escalates, Nvidia and auto stocks sink",
            "link": "https://www.moneycontrol.com/news/business/markets/wall-street-tumbles-as-trade-war-escalates-nvidia-and-auto-stocks-sink-12956289.html",
            "description": "Investors, who had been holding out hope for a last-minute diplomatic breakthrough, rushed for the exits as it became clear that the tariffs were moving forward.",
            "pubDate": "2025-03-05T03:39:20.841384"
        },
        {
            "title": "Brokerage, exchange stocks see huge erosion as volumes, volatility make investors jittery",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-exchange-stocks-see-huge-erosion-as-volumes-volatility-make-investors-jittery-12956189.html",
            "description": "The average daily turnover (ADTV) in the cash segment fell 10 percent month-on-month to Rs 91,661 crore in February. In derivatives, the most popular trading segment, ADTV slipped 4 percent to Rs 287.6 trillion.",
            "pubDate": "2025-03-05T03:39:20.841451"
        },
        {
            "title": "FII net sell shares worth Rs 3,405 crore, DIIs net buyers of Rs 4,851 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/fii-net-sell-shares-worth-rs-3-405-crore-diis-net-buyers-of-rs-4-851-crore-12956145.html",
            "description": "Sensex and Nifty closed lower on March 4 as fresh U.S. tariffs on China, Canada, and Mexico unsettled global markets, dragging investor sentiment.",
            "pubDate": "2025-03-05T03:39:20.841517"
        }
    ]
}