{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-04T06:58:03.084955",
    "items": [
        {
            "title": "Brokerage Radar: Nomura initiates coverage on Oberoi Realty, CLSA has 'Outperform' rating on Zomato",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-nomura-initiates-coverage-on-oberoi-realty-clsa-has-outperform-rating-on-zomato-12882452.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Oberoi Realty, GAIL, Zomato and more.",
            "pubDate": "2024-12-04T02:43:18.009798"
        },
        {
            "title": "RVNL shares in focus on project win worth Rs 186.76 crore from East Central Railway",
            "link": "https://www.moneycontrol.com/news/business/stocks/rvnl-shares-in-focus-on-project-win-worth-rs-186-76-crore-from-east-central-railway-12882323.html",
            "description": "Rail Vikas Nigam Share Price | Over the past 12 months, the stock jumped more than 150 percent, while Nifty rose 20 percent during the same period",
            "pubDate": "2024-12-04T02:43:18.009887"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat start; US markets mixed, Asia trade lower",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-04-12-2024-liveblog-12882435.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The S&P 500 and Nasdaq eked out record closing highs on Tuesday, with tech-related shares extending recent gains as investors awaited further jobs data. The Dow finished slightly lower on the day.",
            "pubDate": "2024-12-04T02:43:18.009964"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-2-12881977.html",
            "description": "The GIFT Nifty is indicating a flat to negative start for the day.",
            "pubDate": "2024-12-04T02:43:18.010034"
        },
        {
            "title": "Stock Radar: Wipro, Wonderla Holidays, EPACK Durable, RVNL, Reliance Power, Kaynes Technology in focus on Wednesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-wipro-wonderla-holidays-epack-durable-rvnl-reliance-power-kaynes-technology-in-focus-on-wednesday-12882425.html",
            "description": "Stocks like Oil and Natural Gas Corporation, Indian Energy Exchange, Nitiraj Engineers, Kore Digital, Hero MotoCorp, PTC India, HG Infra Engineering, Thyrocare Technologies, Max Healthcare Institute, and Deepak Nitrite will also be in focus on December 4.",
            "pubDate": "2024-12-04T02:43:18.010104"
        },
        {
            "title": "Agri Picks Report December 04, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-04-2024-geojit-financial-services-12882482.html",
            "description": "According to Geojit Financial Services, Farmers in Gujarat have sown rabi crops over 2.1 million hectares as of Monday, down 28.4% on year from nearly 3 million hectares sown in the same period last year, according to a release by the state agriculture department.",
            "pubDate": "2024-12-04T03:48:10.833754"
        },
        {
            "title": "Live: Will Nifty's bull run extend above 25,000? | RVNL, Swiggy in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-s-bull-run-extend-above-25-000-rvnl-swiggy-in-focus-opening-bell-12882472.html",
            "description": "Indian benchmark indices Sensex and Nifty extended their bull run to third straight day supported by gains in financial and metal stocks. Nifty, particularly, breached 24,450, reaching its one-month high in yesterday's trade. Majority of sectors participated in the bull run, except FMCG index. Experts now eye Nifty's resistance at 24,550, with support placed around 24,300. This morning, global cues were mixed. US markets ended mixed overnight, with Dow declining, while S&P 500 and NASDAQ Composite close at record highs. Asia-Pacific markets also traded mixed this morning as investors digested events in South Korea. South Korea benchmarks Kospi and Kosdaq were down 1 percent each after President imposed and withdrew martial law in overnight action, alleging opposition of anti-state activities. Back home, watch out for RVNL, Swiggy, and Godrej Properties. Catch Lovisha Darad in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Amit Jain, Co-Founder, Ashika Global Family Office Services.",
            "pubDate": "2024-12-04T03:48:10.833840"
        },
        {
            "title": "Defence stocks rally upto 5% after DAC clears Rs 21,772 crore acquisition proposals",
            "link": "https://www.moneycontrol.com/news/business/markets/defence-stocks-rally-upto-5-after-dac-clears-rs-21-772-crore-acquisition-proposals-12882459.html",
            "description": "Stocks like Mazagon Dock Shipbuilders and Garden Reach Shipbuilders spearheaded the rally in the defence sector, rising nearly 5 percent, while companies like Bharat Electronics, Hindustan Aeronautics, and Bharat Dynamics gained 2-3 percent.",
            "pubDate": "2024-12-04T04:20:06.223178"
        },
        {
            "title": "Reliance Power hits 5% upper circuit after Solar Energy Corporation withdraws debarment notice",
            "link": "https://www.moneycontrol.com/news/business/markets/reliance-power-hits-5-upper-circuit-after-solar-energy-corporation-withdraws-debarment-notice-12882493.html",
            "description": "SECI had debarred Reliance Power and its subsidiary Reliance NU BESS from participating in any of its tenders for three years over allegations of submitting fake documents.",
            "pubDate": "2024-12-04T04:39:47.116437"
        },
        {
            "title": "Honasa Consumer stock zooms 9% after founder Varun Alagh raises stake in firm",
            "link": "https://www.moneycontrol.com/news/business/markets/honasa-consumer-stock-zooms-9-after-founder-varun-alagh-raises-stake-in-firm-12882525.html",
            "description": "Alagh, who co-founded Honasa Consumer with his wife Ghazal Alagh, now together hold a 35 percent in the company.",
            "pubDate": "2024-12-04T04:39:47.116524"
        },
        {
            "title": "Zomato shares rise 2% as CLSA maintains 'outperform', sees 32% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/zomato-shares-rise-2-as-clsa-maintains-outperform-sees-32-upside-12882550.html",
            "description": "CLSA notes that while the gap between Swiggy and Zomato has stopped widening, Zomato remains 81 percent larger in quick commerce GOV.",
            "pubDate": "2024-12-04T04:51:10.722040"
        },
        {
            "title": "RattanIndia Enterprises surges 8.5% after arm Revolt Motors' strong November sales",
            "link": "https://www.moneycontrol.com/news/business/markets/rattanindia-enterprises-surges-8-5-after-arm-revolt-motors-strong-november-sales-12882551.html",
            "description": "RattanIndia Enterprises completed a 100 percent stake acquisition of electric motorcycles manufacturer Revolt Motors back in June this year.",
            "pubDate": "2024-12-04T05:19:02.174917"
        },
        {
            "title": "Oberoi Realty shares hit record high after Nomura initiates 'buy' call; predicts 21% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/oberoi-realty-shares-hit-record-high-after-nomura-initiates-buy-call-predicts-21-upside-12882651.html",
            "description": "Nomura's bullishness stems from Oeroi Realty 's strong growth visibility, hopes of solid pre-sales, cash generation, and a low debt-to-equity ratio, positioning the company for aggressive business development.",
            "pubDate": "2024-12-04T06:00:30.615964"
        },
        {
            "title": "Wonderla Holidays shares surge 15% on QIP launch",
            "link": "https://www.moneycontrol.com/news/business/markets/wonderla-holidays-shares-surge-15-on-qip-launch-12882683.html",
            "description": "In a board meeting on October 4, Wonderla Holidays approved plans to raise up to Rs 800 crore through various methods, including private placement, QIP, preferential issues, or a combination of these.",
            "pubDate": "2024-12-04T06:33:52.544109"
        },
        {
            "title": "Buy Netweb Technologies India; target of Rs 3380: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-netweb-technologies-india-target-of-rs-3380-geojit-financial-services-12882706.html",
            "description": "Geojit Financial Services is bullish on Netweb Technologies India has recommended buy rating on the stock with a target price of Rs 3380 in its research report dated December 03, 2024.",
            "pubDate": "2024-12-04T06:33:52.544193"
        },
        {
            "title": "Buy Hindustan Aeronautics; target of Rs 5470: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-hindustan-aeronautics-target-of-rs-5470-geojit-financial-services-12882755.html",
            "description": "Geojit Financial Services is bullish on Hindustan Aeronautics has recommended buy rating on the stock with a target price of Rs 5470 in its research report dated December 03, 2024.",
            "pubDate": "2024-12-04T06:58:02.319756"
        }
    ]
}