{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-21T03:57:06.489335",
    "items": [
        {
            "title": "Jefferies sees hospital stocks as pockets of strong earnings visibility in uncertain market",
            "link": "https://www.moneycontrol.com/news/business/markets/jefferies-sees-hospital-stocks-as-pockets-of-strong-earnings-visibility-in-uncertain-market-12946971.html",
            "description": "Jefferies prefers hospital players that have higher brownfield bed expansion plans lined up for the coming years. Max Healthcare remains its top sectoral pick.",
            "pubDate": "2025-02-21T03:49:26.743721"
        },
        {
            "title": "Live: What can drive a rangebound Nifty ahead? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-what-can-drive-a-rangebound-nifty-ahead-opening-bell-12946953.html",
            "description": "The market is set to wrap up a lackluster and uneventful week, with the Nifty stuck within a tight 300-point range. Bulls have battled fiercely to hold the 22,800 level, but any attempts to push beyond 23,000 have lacked conviction, making it clear that momentum remains elusive. Experts now see Nifty’s immediate target at 23,000, with a potential move toward 23,200 if momentum picks up. However, failure to hold above 23,000 could prolong the consolidation phase, with crucial support resting at 22,700. This morning, global cues were largely lower. US markets saw selloff overnight due to weak forecast from Walmart. Asian markets too opened lower as investors digested Japanese hot inflation data for January. Among stocks, watch out for NTPC Green, Tata Steel, and HG Infra in today's trading session. Catch Lovisha Darad in conversation with Osho Krishan, Sr. Analyst - Technical &amp; Derivative Research, Angel One and market veteran Ambareesh Baliga.",
            "pubDate": "2025-02-21T03:49:26.743797"
        },
        {
            "title": "Stock Market LIVE Updates| Market trades marginally lower at pre-opening; Shanghai, Hang Seng lead Asia higher",
            "link": "https://www.moneycontrol.com/news/opinion/stock-market-live-updates-gift-nifty-trades-lower-shanghai-hang-seng-lead-asia-higher-liveblog-12946933.html",
            "description": "Stock Market LIVE Updates| Sensex Today| Indian equity indices ended lower on third consecutive session on February 20 with Nifty around 22,900. At close, the Sensex was down 203.22 points or 0.27 percent at 75,735.96, and the Nifty was down 19.75 points or 0.09 percent at 22,913.15.",
            "pubDate": "2025-02-21T03:49:26.743867"
        },
        {
            "title": "Stocks to Watch Today: Quality Power, Cipla, Delta Corp, Kotak Bank, JM Financial, Berger Paints, Amara Raja Energy in focus on 21 February",
            "link": "https://www.moneycontrol.com/news/business/stocks/stocks-to-watch-today-quality-power-cipla-delta-corp-kotak-bank-jm-financial-berger-paints-amara-raja-energy-in-focus-on-21-february-12946925.html",
            "description": "Stocks To Watch, Feb 21: Stocks like CIE Automotive India, Sanofi Consumer Healthcare, Delta Corp, Mahindra and Mahindra, Grindwell Norton, Keystone Realtors, HG Infra Engineering, Tanla Platforms, Samvardhana Motherson International, ITI, NTPC Green Energy, Tata Steel, and Narayana Hrudayalaya will be in focus on February 21.",
            "pubDate": "2025-02-21T03:49:26.743933"
        },
        {
            "title": "Dow Jones down 1.27% after Wallmart projects a slower sales growth",
            "link": "https://www.moneycontrol.com/news/business/markets/dow-jones-down-1-27-after-wallmart-projects-a-slower-sales-growth-12946911.html",
            "description": "Robinhood Markets Inc, shares fell over 6 percent during the trading session amid a broader sell-off in speculative stocks, including Palantir.",
            "pubDate": "2025-02-21T03:49:26.743998"
        },
        {
            "title": "Trade Spotlight: How should you trade Shriram Finance, MOIL, SRF, Jindal Steel, NTPC, Indraprastha Gas, and others on February 21?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-shriram-finance-moil-srf-jindal-steel-ntpc-indraprastha-gas-and-others-on-february-21-12946897.html",
            "description": "The upward journey may continue if the bulls gain further strength in the upcoming sessions. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-21T03:49:26.744064"
        },
        {
            "title": "Alkem Labs sees Rs 300 crore worth equity change hands in large deal",
            "link": "https://www.moneycontrol.com/news/business/markets/alkem-labs-sees-rs-300-crore-worth-equity-change-hands-in-large-deal-12946997.html",
            "description": "",
            "pubDate": "2025-02-21T03:57:05.801865"
        }
    ]
}