{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-23T04:26:41.399580",
    "items": [
        {
            "title": "Live: Will Nifty extend losses to third day and slip below 25,200? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-extend-losses-to-third-day-and-slip-below-25-200-opening-bell-13568568.html",
            "description": "Indian markets extended their weakness for the second straight day, with the Nifty slipping below the 25,250 mark in the previous session. The broader markets too snapped their 11-day winning streak, while pharma and IT stocks emerged as the top sectoral laggards. On the news front, all eyes are on Commerce Minister Piyush Goyal’s visit to the US, even as the primary market stays abuzz with 10 IPOs opening today across the mainboard and SME segments. This morning, global cues were largely positive. Wall Street ended at record highs overnight as Nvidia's partnership with OpenAI fueled investors optimism. Similarly, Asia-Pacific markets started the day higher tracking positive Wall Street cues. Catch Lovisha Darad in conversation with Jay Thakkar, Head Derivatives and Quant Research, ICICI Securities and Mayuresh Joshi, Head of Equity Research, William O’Neil India.",
            "pubDate": "2025-09-23T03:52:02.523277"
        },
        {
            "title": "Asian stocks primed for best year against US peers since 2017",
            "link": "https://www.moneycontrol.com/news/business/asian-stocks-primed-for-best-year-against-us-peers-since-2017-13568487.html",
            "description": "The MSCI Asia Pacific Index has climbed 22% this year, beating the S&P 500 Index by around eight percentage points and set for the biggest annual outperformance since 2017.",
            "pubDate": "2025-09-23T03:52:02.523356"
        },
        {
            "title": "Indian markets to open weak as Gift Nifty trades marginally lower",
            "link": "https://www.moneycontrol.com/news/business/markets/indian-markets-to-open-weak-as-gift-nifty-trades-marginally-lower-13567978.html",
            "description": "On Wall Street, benchmarks extended their winning streak. The Dow Jones rebounded more than 350 points from intraday lows to end marginally higher.",
            "pubDate": "2025-09-23T03:52:02.523423"
        },
        {
            "title": "KEC International shares in focus on order win worth Rs 3,243 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/kec-international-shares-in-focus-on-order-win-worth-rs-3-243-crore-13567609.html",
            "description": "KEC International Share Price | The company won new orders of Rs 3,243 crores for transmission & distribution projects.",
            "pubDate": "2025-09-23T03:52:02.523487"
        },
        {
            "title": "RVNL shares in focus on project win from Southern Railway",
            "link": "https://www.moneycontrol.com/news/business/markets/rvnl-shares-in-focus-on-project-win-from-southern-railway-13567610.html",
            "description": "Rail Vikas Nigam Share Price | The company bagged a project worth Rs 145.34 crore from Southern Railway.",
            "pubDate": "2025-09-23T03:52:02.523552"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-6-13565805.html",
            "description": "Oil prices were little changed on Tuesday as traders contemplated the impacts of ongoing geopolitical tensions in the Middle East and Russia, while worries over trade tariffs that could dampen fuel demand persisted.",
            "pubDate": "2025-09-23T03:52:02.523617"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty at 25,250, Sensex gains; Alkem Lab, Birla Corp, JBM Auto, RVNL in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-23-09-2025-liveblog-13567943.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Amber Enterprises India, Coforge, JBM Auto, Maruti Suzuki India, Alkem Laboratories, KEC International, Birla Corporation, Emkay Global Financial Services, Rail Vikas Nigam, and Brigade Enterprises will be in focus on September 23.",
            "pubDate": "2025-09-23T03:52:02.523681"
        },
        {
            "title": "Trade Spotlight: How should you trade Bajaj Finance, Tata Motors, United Spirits, BHEL, Cholamandalam Investment, Godawari Power, and others on September 23?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bajaj-finance-tata-motors-united-spirits-bhel-cholamandalam-investment-godawari-power-and-others-on-september-23-13567886.html",
            "description": "Rangebound trading may continue, and Monday's low could be crucial for further direction. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-09-23T03:52:02.523745"
        },
        {
            "title": "Stocks to Watch Today: JBM Auto, Maruti, Alkem Labs, KEC International, Birla Corporation, Emkay Global, Rail Vikas Nigam, Brigade in focus on 23 September",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-jbm-auto-maruti-alkem-labs-kec-international-birla-corporation-emkay-global-rail-vikas-nigam-brigade-in-focus-on-23-september-13567876.html",
            "description": "Stocks to Watch, 23 September: Stocks like Amber Enterprises India, Coforge, JBM Auto, Maruti Suzuki India, Alkem Laboratories, KEC International, Birla Corporation, Emkay Global Financial Services, Rail Vikas Nigam, and Brigade Enterprises will be in focus on September 23.",
            "pubDate": "2025-09-23T03:52:02.523810"
        },
        {
            "title": "Jaro Institute IPO -- Betting on the growth in education?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/jaro-institute-ipo-betting-on-the-growth-in-education-13568817.html",
            "description": "Strong EBITDA margin but scalability remains a challenge for a company with premium programmes",
            "pubDate": "2025-09-23T04:26:40.025575"
        },
        {
            "title": "Solarworld IPO: Can this light up you portfolio?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/solarworld-ipo-can-this-light-up-you-portfolio-13568815.html",
            "description": "Robust order book, strong customer relationship to support growth",
            "pubDate": "2025-09-23T04:26:40.025659"
        }
    ]
}