{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-07-19T14:48:20.786615",
    "items": [
        {
            "title": "Broader indices outperform; these small caps rose 10-22%",
            "link": "https://www.moneycontrol.com/news/business/markets/broader-indices-outperform-these-small-caps-rose-10-22-13297647.html",
            "description": "Nifty on the weekly chart formed a reasonable negative candle this week, which is third consecutive bearish candle formation in the trot. The previous sharp upside breakout of larger range movement of last month has been negated and the market slipped below the crucial support zone of 25000 mark, says Nagaraj Shetti, Senior Technical Research Analyst at HDFC Securities.",
            "pubDate": "2025-07-19T06:46:47.426131"
        },
        {
            "title": "Market falls extend in third week; rupee depreciates",
            "link": "https://www.moneycontrol.com/news/photos/business/markets/market-falls-extend-in-third-week-rupee-depreciates-13297617.html",
            "description": "The Indian rupee extended the fall against the US dollar in the second week as the domestic unit fell 35 paise at 86.15 per dollar on July 18 against the July 11 closing of 85.80.",
            "pubDate": "2025-07-19T06:46:47.426223"
        },
        {
            "title": "HDFC Bank aims to improve loan growth after lowering credit-to-deposit ratio",
            "link": "https://www.moneycontrol.com/news/business/earnings/hdfc-bank-aims-to-improve-loan-growth-after-lowering-credit-to-deposit-ratio-13298334.html",
            "description": "After quickly lowering its credit-to-deposit ratio post-merger by prioritising deposit mobilization, HDFC Bank now plans to gradually improve balance sheet efficiency and reinvigorate CASA growth over the next few quarters",
            "pubDate": "2025-07-19T14:48:17.895331"
        },
        {
            "title": "HDFC Bank sees stable margins ahead as rate cuts flow through gradually",
            "link": "https://www.moneycontrol.com/news/business/markets/hdfc-bank-sees-stable-margins-ahead-as-rate-cuts-flow-through-gradually-13298298.html",
            "description": "HDFC Bank expects its net interest margins to remain steady over the next few quarters, aided by the gradual pass-through of recent repo rate cuts and deposit repricing",
            "pubDate": "2025-07-19T14:48:17.895411"
        },
        {
            "title": "ICICI Bank sees room for loan growth as monetary easing lifts demand sentiment",
            "link": "https://www.moneycontrol.com/news/business/earnings/icici-bank-sees-room-for-loan-growth-as-monetary-easing-lifts-demand-sentiment-13298281.html",
            "description": "ICICI Bank’s loan growth was modest in Q1FY26 as global headwinds and competition weighed on demand. Management remains cautiously optimistic, expecting business banking and retail momentum to sustain as monetary easing supports credit pick-up",
            "pubDate": "2025-07-19T14:48:17.895483"
        },
        {
            "title": "ICICI Bank sees margins to be rangebound as rate cuts impact are yet to play out",
            "link": "https://www.moneycontrol.com/news/business/earnings/icici-bank-aims-to-sustain-margins-at-4-5-as-rate-cuts-impact-are-yet-to-play-out-13298141.html",
            "description": "ICICI Bank reported a steady net interest margin of 4.3% in Q1FY26, with management indicating the impact of recent rate cuts is yet to fully reflect",
            "pubDate": "2025-07-19T14:48:17.895550"
        }
    ]
}