{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-16T06:58:10.367096",
    "items": [
        {
            "title": "Mahanagar Gas, IGL, Adani Total Gas stocks tumble as Centre trims priority gas allocation",
            "link": "https://www.moneycontrol.com/news/business/stocks/mahanagar-gas-igl-adani-total-gas-stocks-tumble-as-centre-trims-priority-gas-allocation-12995564.html",
            "description": "The Centre further trimmed its priority gas allocation to MGL, Indraprastha Gas and Adani Total Gas, sending the stock prices of the firms tumbling.",
            "pubDate": "2025-04-16T06:56:52.669353"
        },
        {
            "title": "Thangamayil Jewellery: Will this stock keep its sparkle intact?",
            "link": "https://www.moneycontrol.com/news/business/stocks/thangamayil-jewellery-will-this-stock-keep-its-sparkle-intact-12995589.html",
            "description": "Thangamayil Jewellery Limited is among the few listed jewellery companies with a strong brand, a loyal customer base, and strong return ratios.",
            "pubDate": "2025-04-16T06:56:52.669483"
        },
        {
            "title": "Agri Picks Report April 16, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-april-16-2025-geojit-financial-services-12995592.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.8 million acres (1 acre = 0.4 hectares) as of Wednesday, up 15.4% on year from 6.8 million acres a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-04-16T06:56:52.669550"
        },
        {
            "title": "ICICI Prudential shares rise 4% on Q4FY25 margin surprise: Top brokerage calls",
            "link": "https://www.moneycontrol.com/news/business/stocks/icici-prudential-shares-rise-4-on-q4fy25-margin-surprise-top-brokerage-calls-12995554.html",
            "description": "ICICI Prudential's Q4FY25 earnings surpass analyst estimates with higher trailing sails. Retail protection saw a sharp 25% jump, and key metrics like persistency, claim settlement, and solvency remained robust",
            "pubDate": "2025-04-16T06:56:52.669613"
        },
        {
            "title": "Has the US market lost its charm?",
            "link": "https://www.moneycontrol.com/news/opinion/has-the-us-market-lost-its-charm-12995574.html",
            "description": "While global markets reel under the weight of President Trump's tariff shocks, India has staged a quiet comeback—emerging as the first to bounce back from the chaos of 'Liberation Day', even as uncertainty clouds Wall Street",
            "pubDate": "2025-04-16T06:56:52.669699"
        },
        {
            "title": "IREDA shares jump 7% on robust Q4 earnings, net profit soars 49%",
            "link": "https://www.moneycontrol.com/news/business/stocks/ireda-shares-jump-7-on-robust-q4-earnings-net-profit-soars-49-12995551.html",
            "description": "The stock rallied over 9% on April 15 and is up more than 20% in the past month. However, it's still down 24% for the year. A robust 28% jump in its loan book to Rs 76,250 crore for FY25 underlines the PSU’s growing traction in renewable energy financing.",
            "pubDate": "2025-04-16T06:56:52.669762"
        },
        {
            "title": "This general insurer’s profitability bucks the industry trend",
            "link": "https://www.moneycontrol.com/news/business/earnings/this-general-insurer-s-profitability-bucks-the-industry-trend-12995523.html",
            "description": "The shift in product mix towards health should augur well for ICICI Lombard",
            "pubDate": "2025-04-16T06:56:52.669825"
        },
        {
            "title": "Live: Will Nifty's rally cool off after back-to-back winning sessions? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-s-rally-cool-off-after-back-to-back-winning-sessions-opening-bell-12995526.html",
            "description": "The Nifty and Sensex rose for the second straight day in the last session, with the Nifty jumping 540 points amid a tariff reprieve and gaining over 1,600 points in the last five sessions. The Nifty Midcap 100 and Smallcap 100 indices gained up to 3%, and all sectoral indices ended in the green for the second day. 49 out of 50 Nifty stocks closed higher, rising up to 7%. India's retail inflation eased to 3.3%, the lowest since August 2019. Q4 results from Wipro, Angel One, and GTPL are due today. This morning, global cues were largely lower. US markets ended lower overnight after back-to-back winning sessions and the sentiment spilled over to Asia Pacific markets too. Catch Lovisha Darad in conversation with Nilesh Jain, Head AVP- Derivative and Technical Research, Centrum Broking and Sandip Agarwal, Fund Manager, Sowilo Investment Managers.",
            "pubDate": "2025-04-16T06:56:52.669886"
        },
        {
            "title": "Gensol Engineering shares tank 5% as promoters barred from accessing equity markets, stock split put on hold",
            "link": "https://www.moneycontrol.com/news/business/markets/gensol-engineering-shares-in-focus-as-promoters-barred-from-accessing-equity-markets-stock-split-put-on-hold-12995528.html",
            "description": "The promoters of Gensol Engineering were running a listed public company as if it were a propriety firm, said markets regulator SEBI.",
            "pubDate": "2025-04-16T06:56:52.669947"
        },
        {
            "title": "IndusInd Bank shares gain 4% as probe finds Rs 1,979 crore impact in derivatives portfolio, lower than estimates",
            "link": "https://www.moneycontrol.com/news/business/stocks/indusind-bank-shares-in-focus-as-probe-finds-rs-1-979-crore-of-negative-impact-in-derivatives-portfolio-12995518.html",
            "description": "IndusInd Bank had appointed an independent firm to carry out a probe into lapses found by the bank related to its derivatives portfolio.",
            "pubDate": "2025-04-16T06:56:52.670007"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty trade flat; midcap, smallcap indices outperform",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-16-04-2025-liveblog-12995492.html",
            "description": "Sensex Today | Stock Market LIVE Updates: BSE Midcap index up 0.4 percent and smallcap index up 0.5 percent. On the sectoral front, metal, IT, auto down 0.5 percent each, while PSU Bank index up 1.5 percent. IREDA, IndusInd Bank, HDFC Bank, JBM Auto, BSE Limited are among the most active shares on the NSE.",
            "pubDate": "2025-04-16T06:56:52.670070"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-84-12994771.html",
            "description": "After remaining net sellers for the last nine days, the Foreign institutional investors (FIIs) turned net buyers on April 15 as they purchased equities worth Rs 6065 crore. However, Domestic institutional investors (DIIs) turned net sellers after three days, as they sold equities of Rs 1951 crore on same day.",
            "pubDate": "2025-04-16T06:56:52.670132"
        },
        {
            "title": "Asian stocks, US futures slide after Nvidia curbs",
            "link": "https://www.moneycontrol.com/news/business/asian-stocks-us-futures-slide-after-nvidia-curbs-12995491.html",
            "description": "Contracts for the Nasdaq 100 fell more than 1.4% in early trading and S&P 500 futures dropped 0.9% after Nvidia slumped in after-hours trading.",
            "pubDate": "2025-04-16T06:56:52.670193"
        },
        {
            "title": "Wall Street ends down slightly; tariff uncertainty keeps investors on edge",
            "link": "https://www.moneycontrol.com/news/business/wall-street-ends-down-slightly-tariff-uncertainty-keeps-investors-on-edge-12995484.html",
            "description": "The Dow Jones Industrial Average fell 155.83 points, or 0.38%, to 40,368.96, the S&P 500 lost 9.34 points, or 0.17%, to 5,396.63 and the Nasdaq Composite lost 8.32 points, or 0.05%, to 16,823.17.",
            "pubDate": "2025-04-16T06:56:52.670253"
        },
        {
            "title": "Trade Spotlight: How should you trade Tata Communications, Prestige Estates, BHEL, Nykaa, HDFC Life, Paradeep Phosphates, and others on April 16?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-tata-communications-prestige-estates-bhel-nykaa-hdfc-life-paradeep-phosphates-and-others-on-april-16-12995461.html",
            "description": "Bulls are expected to maintain tight control over Dalal Street, despite the possibility of intermittent consolidation. Below are some trading ideas for the near term.",
            "pubDate": "2025-04-16T06:56:52.670313"
        },
        {
            "title": "Stocks to Watch Today: IndusInd Bank , Adani Total Gas, MGL, Oil India, Vedanta, Aster DM Healthcare, IREDA, ICICI Prudential Life in focus on 16 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-indusind-bank-adani-total-gas-mgl-oil-india-vedanta-aster-dm-healthcare-ireda-icici-prudential-life-in-focus-on-16-april-12995458.html",
            "description": "Stocks to Watch, 16 Apr: Stocks like ICICI Lombard General Insurance Company, Swiggy, Tata Consultancy Services, Gensol Engineering, Max India, NHPC, Dabur India, Lemon Tree Hotels, and AGS Transact Technologies will be in focus on April 16.",
            "pubDate": "2025-04-16T06:56:52.670373"
        }
    ]
}