{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-27T04:31:28.902345",
    "items": [
        {
            "title": "IndiGo Block Deal: Co-founder Rakesh Gangwal sells 5.8% stake worth Rs 11,928 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/indigo-block-deal-co-founder-rakesh-gangwal-sells-5-8-stake-worth-rs-11-928-crore-13047652.html",
            "description": "IndiGo share price: The floor price for the transaction has been pegged at Rs 5,260 per share, representing a discount of around 3 percent to the last closing price.",
            "pubDate": "2025-05-27T04:00:15.254795"
        },
        {
            "title": "Nifty May Aim For 25,200 As Rally Gathers Pace|IndiGo, PG Electroplast Block Deals|Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-may-aim-for-25-200-as-rally-gathers-pace-indigo-pg-electroplast-block-deals-opening-bell-live-13047774.html",
            "description": "The Nifty 50 decisively broke above 24,850 supported by higher trading volume compared to the previous day, following a positive start on May 26. The index closed 0.6% higher, marking its second consecutive session of gains. Going forward, the index may enter a consolidation phase with strong support in the 24,850–24,900 range. A breakdown below this level could lead to increased selling pressure. However, as long as this support holds, the index is likely to continue its upward move toward the 25,200–25,300 zone. A decisive break above this resistance could spark a sharp rally, experts suggest. Watch out for IndiGo, PG Electroplast, Aurobindo Pharma and Nazara Tech in trade. Catch Nandita Khemka in conversation with Ajit Mishra, SVP-Technical Research, Religare Broking and , market expert Anshul Saigal.",
            "pubDate": "2025-05-27T04:00:15.254886"
        },
        {
            "title": "Chart of the Day: Rising fuel inventories at power plants should worry Coal India’s investors",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-rising-fuel-inventories-at-power-plants-should-worry-coal-india-s-investors-13047928.html",
            "description": "Dispatches by Coal India slowed in FY25 and in April FY26",
            "pubDate": "2025-05-27T04:00:15.254970"
        },
        {
            "title": "Sensex, Nifty poised for a flat start; Check key levels to watch on May 27",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-poised-for-a-flat-start-check-key-levels-to-watch-on-may-27-13047602.html",
            "description": "In the previous session, the frontline indices surged as much as 400 points buoyed by gains in auto, IT, and metal stocks. However, profit-booking emerged at higher levels after the Sensex surged nearly 600 points intraday.",
            "pubDate": "2025-05-27T04:00:15.255043"
        },
        {
            "title": "Stocks to Watch Today: Bayer Cropscience, PG Electroplast, Aurobindo Pharma, IndiGo, Sagility India, Borana Weaves, Lumax Industries in focus on 27 May",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-bayer-cropscience-pg-electroplast-aurobindo-pharma-indigo-sagility-india-borana-weaves-lumax-industries-in-focus-on-27-may-13047598.html",
            "description": "Stocks to Watch, 27 May: Stocks like InterGlobe Aviation IndiGo, KEC International, PG Electroplast, India Pesticides, Sagility India, 360 ONE WAM, Aurobindo Pharma, Bayer Cropscience, Blue Dart Express, Shilpa Medicare, General Insurance Corporation of India, Maharashtra Seamless, Lumax Industries, Amber Enterprises India, KFin Technologies, Dabur India, and Borana Weaves will be in focus on May 27.",
            "pubDate": "2025-05-27T04:00:15.255113"
        },
        {
            "title": "Asian shares start cautiously, dollar edges down",
            "link": "https://www.moneycontrol.com/news/business/asian-us-stock-futures-rise-on-eu-trade-deal-hope-13047590.html",
            "description": "The MSCI Asia Pacific Index fluctuated between small gains and losses.",
            "pubDate": "2025-05-27T04:00:15.255182"
        },
        {
            "title": "Trade Spotlight: How should you trade HDFC Bank, ITC, Godrej Properties, Rail Vikas Nigam, Pennar Industries, BHEL, Inox Wind and others on May 27?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-hdfc-bank-itc-godrej-properties-rail-vikas-nigam-pennar-industries-bhel-inox-wind-and-others-on-may-27-13047548.html",
            "description": "The market is expected to consolidate after the two-day rally and may attempt another session of upward movement. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-05-27T04:00:15.255250"
        },
        {
            "title": "This oral care major suffers from demand headwinds, competitive pressures",
            "link": "https://www.moneycontrol.com/news/business/earnings/this-oral-care-major-suffers-from-demand-headwinds-competitive-pressures-13048247.html",
            "description": "Urban demand recovery, strategic initiatives to aid growth in the second half",
            "pubDate": "2025-05-27T04:31:26.927483"
        },
        {
            "title": "Sensex tumbles 600 pts, Nifty below 24,850, dragged by IT, financials; India VIX rises 4%",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-tumbles-600-pts-nifty-below-24-850-dragged-by-it-financials-india-vix-rises-4-13047750.html",
            "description": "The broader market showed relative resilience, as the Nifty Midcap 100 slipped only 0.17 percent while the Nifty Smallcap 100 managed a modest gain of 0.06 percent.",
            "pubDate": "2025-05-27T04:31:26.927562"
        },
        {
            "title": "Cello World: Q4 beats estimates, but will growth sustain in FY26?",
            "link": "https://www.moneycontrol.com/news/business/stocks/cello-world-q4-beats-estimates-but-will-growth-sustain-in-fy26-13048122.html",
            "description": "CWL intends to continue launching new products along with a focus on premiumization. It is also deepening its network presence and augmenting sales via the online route",
            "pubDate": "2025-05-27T04:31:26.927630"
        },
        {
            "title": "Olectra Greentech tanks 14% as Maharashtra govt cancels Rs 10,000-crore e-bus order",
            "link": "https://www.moneycontrol.com/news/business/markets/olectra-greentech-tanks-14-as-maharashtra-govt-cancels-rs-10-000-crore-e-bus-order-13047841.html",
            "description": "The contract, spanning 12 years, was initially awarded in July 2023 to a consortium comprising Olectra and Evey Trans Pvt Ltd.",
            "pubDate": "2025-05-27T04:31:26.927697"
        }
    ]
}