{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-23T17:22:20.156802",
    "items": [
        {
            "title": "Market Braces For Knee-Jerk Reaction As U.S. Strikes Iran Nuclear Sites| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/market-braces-for-knee-jerk-reaction-as-u-s-strikes-iran-nuclear-sites-opening-bell-live-13162042.html",
            "description": "Indian market is poised for a weak open as US bombs three nuclear sites at Iran. Dow Futures are lower, Asian markets are trading with cuts while the GIFT Nifty is hinting at a weak start for the Indian market. Meanwhile, On Friday the Nifty 50 gained solid strength after a three-day consolidation and rallied 1.29 percent, reviving weak sentiment alongside a falling VIX. Despite the recovery, the index remains within the broad range of 24,450–25,200 for several weeks now. As long as the index trades below 25,200, and geopolitical tensions in the Middle East—which influence oil prices—persist, consolidation and mild correction within a range-bound setup may continue. Key support levels remain at 24,700, followed by the 24,500–24,450 zone. A fall below this crucial support zone may trigger a forceful attack from bears, while a decisive and sustainable close above 25,200 can open the door for strong bullish action. Catch Nandita Khemka in conversation with market expert Ajay Bagga, Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Siddarth Bhamre, Institutional Research Head - ACMIIL (Asit C Mehta Investment Interrmediates Ltd). Catch Nandita Khemka in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Siddarth Bhamre, Institutional Research Head - ACMIIL (Asit C Mehta Investment Interrmediates Ltd)",
            "pubDate": "2025-06-23T03:17:51.380198"
        },
        {
            "title": "Sensex, Nifty set for weak start as rising US-Israel-Iran tensions jolt sentiment; crude oil at 5-month high",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-set-for-weak-start-as-rising-us-israel-iran-tensions-jolt-sentiment-crude-oil-at-5-month-high-13161937.html",
            "description": "In the previous session, the frontline indices ended a three-day losing streak, rising over one percent amid broad-based buying across sectors.",
            "pubDate": "2025-06-23T03:17:51.380287"
        },
        {
            "title": "Granules India shares in focus after USFDA issues one observation to Hyderabad units",
            "link": "https://www.moneycontrol.com/news/business/markets/granules-india-shares-in-focus-after-usfda-issues-one-observation-to-hyderabad-units-13159916.html",
            "description": "Granules India Share Price | The share touched a 52-week high of Rs 724.55 and a 52-week low of Rs 412.05 on 02 September, 2024 and 07 April, 2025, respectively.",
            "pubDate": "2025-06-23T03:17:51.380364"
        },
        {
            "title": "Bharat Electronics shares in focus on orders win worth Rs 585 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/bharat-electronics-shares-in-focus-on-orders-win-worth-rs-585-crore-13159917.html",
            "description": "Bharat Electronics Share Price | The share price will remain in focus today after winning additional orders worth Rs 585 crore for fire control and sighting system for missiles, communication equipment, jammers, spares, services etc.",
            "pubDate": "2025-06-23T03:17:51.380456"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty hints a weak start; US, Asian markets fall amid rising Middle-East conflict",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-23-06-2025stock-market-live-updates-gift-nifty-hints-a-weak-start-us-asian-markets-fall-amid-rising-middle-east-conflict-liveblog-13161906.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  The Dow Jones Industrial Average rose 35.16 points, or 0.08%, to 42,206.82, the S&P 500 lost 13.03 points, or 0.22%, to 5,967.84 and the Nasdaq Composite lost 98.86 points, or 0.51%, to 19,447.41. For the week, the Dow was little changed, the S&P 500 was down 0.2% and the Nasdaq was up 0.2%.",
            "pubDate": "2025-06-23T03:17:51.380530"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-119-13151928.html",
            "description": "The Foreign institutional investors (FIIs) extended their buying on fourth consecutive day on June 20 as they bought equities worth Rs 7,940 crore. On the other hand, Domestic institutional investors (DIIs) turned net sellers as they sold equities of Rs 3,049 crore on the same day.",
            "pubDate": "2025-06-23T03:17:51.380604"
        },
        {
            "title": "Stocks to Watch Today: Zen Technologies, NLC India, Bajel Projects, Bharat Electronics, Granules India, Waaree Renewable in focus on 23 June",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-zen-technologies-nlc-india-bajel-projects-bharat-electronics-granules-india-waaree-renewable-in-focus-on-23-june-13161560.html",
            "description": "Stocks to watch, 23 June: Stocks like Granules India, Waaree Renewable Technologies,Signature Global (India), Zen Technologies, NLC India, Bajel Projects, Bharat Electronics, Bank of India, Bandhan Bank, CEAT, and LT Foods will be in focus on June 23.",
            "pubDate": "2025-06-23T03:17:51.380675"
        },
        {
            "title": "Trade Spotlight: How should you trade Indus Towers, Kotak Mahindra Bank, NRB Bearings, ICICI Lombard, KFin Technologies, M&M, and others on June 23?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-indus-towers-kotak-mahindra-bank-nrb-bearings-icici-lombard-kfin-technologies-m-m-and-others-on-june-23-13161465.html",
            "description": "The sustainability of Friday's gains is the key factor to watch in the upcoming sessions, as the Iran-Israel conflict and global cues could lead to volatility and consolidation in near term. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-06-23T03:17:51.380742"
        },
        {
            "title": "Next market cycle to be a 'barbell' rally, says Canara Robeco AMC's Shridatta Bhandwaldar",
            "link": "https://www.moneycontrol.com/news/business/markets/next-market-cycle-to-be-a-barbell-rally-says-canara-robeco-amc-s-shridatta-bhandwaldar-13166198.html",
            "description": "'In renewables and power, investors must be selective along the value chain, but the opportunity remains intact,' said Bhandwaldar.",
            "pubDate": "2025-06-23T17:20:57.503910"
        },
        {
            "title": "Wall Street modestly higher as oil erases gains, investor weigh Fed official's rate cut view",
            "link": "https://www.moneycontrol.com/news/business/markets/wall-street-modestly-higher-as-oil-erases-gains-investor-weigh-fed-official-s-rate-cut-view-13165931.html",
            "description": "Investors also took positive cues from comments by Federal Reserve Governor Michelle Bowman, who said that she would favour a cut in interest rates at the next policy meeting in July, echoing peer Governor Christopher Waller.",
            "pubDate": "2025-06-23T17:20:57.503986"
        },
        {
            "title": "Polycab shares rise 5% on Jefferies' bullish note that sees 19% upside potential",
            "link": "https://www.moneycontrol.com/news/business/markets/polycab-shares-rise-5-on-jefferies-bullish-note-that-sees-19-upside-potential-13164819.html",
            "description": "Polycab share price: Jefferies maintained its 'Buy' call on the stock, with a target price of Rs 7,150 apiece.",
            "pubDate": "2025-06-23T17:20:57.504056"
        },
        {
            "title": "Hero Moto, M&M, others tumble up to 2%, dragging Nifty Auto after a three-day rise",
            "link": "https://www.moneycontrol.com/news/business/markets/hero-moto-m-m-others-tumble-up-to-2-dragging-nifty-auto-after-a-three-day-rise-13164236.html",
            "description": "Auto stocks: The sharp fall in the share prices pushed the Nifty Auto index down nearly 1 percent to hover around 23,466 in the afternoon.",
            "pubDate": "2025-06-23T17:20:57.504129"
        },
        {
            "title": "Taking Stock: Nifty below 25,000 despite recovery from lows as crude oil simmers after strike on Iran",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-below-25-000-despite-recovery-from-lows-as-crude-oil-simmers-after-strike-on-iran-13163696.html",
            "description": "On the sectoral front, IT, FMCG, Auto, Bank, telecom down 0.3-1.5 percent, while Consumer Durables, media, metal, capital goods up 0.3-4 percent.",
            "pubDate": "2025-06-23T17:20:57.504197"
        },
        {
            "title": "Gainers & Losers: 10 stocks that moved the most on June 23",
            "link": "https://www.moneycontrol.com/news/photos/business/markets/gainers-losers-10-stocks-that-moved-the-most-on-june-23-13164030.html",
            "description": "About 1,794 shares advanced, 2,113 shares declined, and 175 shares were unchanged.",
            "pubDate": "2025-06-23T17:20:57.504266"
        },
        {
            "title": "Nifty below 25,000, Sensex down 450 pts; IT, telecom, auto, banks fall| Closing bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-below-25-000-sensex-down-450-pts-it-telecom-auto-banks-fall-closing-bell-13164198.html",
            "description": "Sensex down 450 points, Nifty below 25000. The Sensex was down 453.69 points or 0.55 percent at 81,954.48, and the Nifty was down 126.10 points or 0.50 percent at 24,986.30. About 1622 shares advanced, 1950 shares declined, and 151 shares remained unchanged. Catch Yatin Mota in Conversation with Aamar Deo Singh-Sr Vice President, Angelone as they discuss stocks on their radar.",
            "pubDate": "2025-06-23T17:20:57.504334"
        },
        {
            "title": "Zen Tech stock hits 5% upper circuit as it steps into UAV space with TISA Aerospace buy",
            "link": "https://www.moneycontrol.com/news/business/markets/zen-tech-stock-hits-5-upper-circuit-as-it-steps-into-uav-space-with-tisa-aerospace-buy-13163738.html",
            "description": "Zen Tech share price: The deal, worth Rs 6.56 crore, signifies Zen’s move to broaden its scope beyond its primary focus on defence training systems and anti-drone solutions.",
            "pubDate": "2025-06-23T17:20:57.504467"
        },
        {
            "title": "BSE, IndiGo shares jump up to 3% on likely inclusion into Nifty 50",
            "link": "https://www.moneycontrol.com/news/business/markets/bse-indigo-shares-jump-up-to-3-on-likely-inclusion-into-nifty-50-13163620.html",
            "description": "BSE share price: The shares of Asia's oldest stock exchange have rallied over 50 percent in the past six months, and over 13 percent in the past one month.",
            "pubDate": "2025-06-23T17:20:57.504548"
        },
        {
            "title": "Biocon’s Rs 4,500 crore QIP to help retire debt, fuel new launches, says CEO Sidharth Mittal",
            "link": "https://www.moneycontrol.com/news/business/companies/biocon-s-rs-4-500-crore-qip-to-help-retire-debt-fuel-new-launches-says-ceo-sidharth-mittal-13163184.html",
            "description": "Biocon’s debt profile has been under investor scrutiny after a strategic acquisition of Viatris Inc's biosimilars business for roughly $3.3 billion in 2022. This deal, while transformative for Biocon Biologics, had significantly increased the company's leverage.",
            "pubDate": "2025-06-23T17:20:57.504619"
        },
        {
            "title": "Top Midcap Losers: Godrej Ind, Astral Ltd, Tube Investments among stocks dragging Midcap 150 index today",
            "link": "https://www.moneycontrol.com/news/business/stocks/top-midcap-losers-godrej-ind-astral-ltd-tube-investments-among-stocks-dragging-midcap-150-index-today-alpha-article-13163614.html",
            "description": "In summary, several stocks within the NIFTY MIDCAP 150 faced downturns during today's session, reflecting individual financial metrics and broader market trends.",
            "pubDate": "2025-06-23T17:20:57.504685"
        },
        {
            "title": "Top Midcap Gainers: MRPL stock jumps 8%; KEI Ind, Polycab, Dixon Tech among other leading Midcap 150 index today",
            "link": "https://www.moneycontrol.com/news/business/stocks/top-midcap-gainers-mrpl-stock-jumps-8-kei-ind-polycab-dixon-tech-among-other-leading-midcap-150-index-today-alpha-article-13163618.html",
            "description": "These gains reflect overall positive market sentiment and strong individual stock performance within the NIFTY MIDCAP 150 index.",
            "pubDate": "2025-06-23T17:20:57.504749"
        },
        {
            "title": "Nifty 50 Top Gainers: Trent, Bharat Electronics, Hindalco stocks show significant rise in today's trading session",
            "link": "https://www.moneycontrol.com/news/business/stocks/nifty-50-top-gainers-trent-bharat-electronics-hindalco-stocks-show-significant-rise-in-today-s-trading-session-alpha-article-13163627.html",
            "description": "With the last traded prices, Trent, Bharat Electronics and Hindalco were among the top gainers in the NIFTY 50, with percentage gains of 4.07%, 2.71%, and 2.27% respectively.",
            "pubDate": "2025-06-23T17:20:57.504813"
        },
        {
            "title": "Nifty 50 top losers: Infosys, Larsen & Toubro, Hero Motocorp stocks drag the most in today's trading",
            "link": "https://www.moneycontrol.com/news/business/stocks/nifty-50-top-losers-infosys-larsen-toubro-hero-motocorp-stocks-drag-the-most-in-today-s-trading-alpha-article-13163630.html",
            "description": "The observed declines in Infosys, Larsen &amp; Toubro, Hero Motocorp, M&amp;M, and HCL Tech reflect the overall market dynamics and specific factors influencing these companies during today's trading session.",
            "pubDate": "2025-06-23T17:20:57.504883"
        },
        {
            "title": "Adani Enterprises unit commissions India's first off-grid green hydrogen pilot plant; shares rise 1.5%",
            "link": "https://www.moneycontrol.com/news/business/markets/adani-enterprises-unit-commissions-india-s-first-off-grid-green-hydrogen-pilot-plant-shares-rise-1-5-13163444.html",
            "description": "Adani Enterprises share price: The shares of Adani Group's flagship company have gained over 6% in the past six months. However, the stock has fallen more than 2% in the past five days.",
            "pubDate": "2025-06-23T17:20:57.504951"
        },
        {
            "title": "Bharat Forge bags L1 status in Army's tender to supply CQB carbines designed by DRDO",
            "link": "https://www.moneycontrol.com/news/business/markets/bharat-forge-emerges-as-l1-bidder-in-army-s-tender-with-cqb-carbine-designed-by-drdo-13163413.html",
            "description": "The size of the order is not officially known, however, some news reports have pegged it at close to Rs 2,000 crore, potentially making it the biggest single order for carbines since the induction of the INSAS files more than decades ago.",
            "pubDate": "2025-06-23T17:20:57.505016"
        },
        {
            "title": "Trent shares rise for second day, up 3% as brokerages issue bullish calls",
            "link": "https://www.moneycontrol.com/news/business/markets/trent-shares-rise-for-second-day-up-3-as-brokerages-issue-bullish-calls-13163178.html",
            "description": "Trent share price: The stock is trading at a price-to-earnings ratio of 2.4x, lower than peers like Vishal and Page Industries, despite delivering stronger growth and profitability.",
            "pubDate": "2025-06-23T17:20:57.505080"
        },
        {
            "title": "Shipping Corporation stock surges 4% amid fears of disruption in Strait of Hormuz",
            "link": "https://www.moneycontrol.com/news/business/markets/shipping-corporation-stock-surges-4-amid-fears-of-disruption-in-strait-of-hormuz-13162712.html",
            "description": "SCI shares rose after US' strikes on Iran as the company’s exposure to crude oil transportation may lead to higher freight charges and improve earnings for shipping companies.",
            "pubDate": "2025-06-23T17:20:57.505146"
        },
        {
            "title": "Midcap, smallcap indices rise over 1% from day's low despite weakness in benchmarks: Zen Tech, Polycab among top gainers",
            "link": "https://www.moneycontrol.com/news/business/markets/midcap-smallcap-indices-rise-over-1-from-day-s-low-despite-weakness-in-benchmarks-zen-tech-polycab-among-top-gainers-13163085.html",
            "description": "The broader market indices have now extended gains for the second consecutive session, after a multi-session losing streak.",
            "pubDate": "2025-06-23T17:20:57.505209"
        },
        {
            "title": "Tata Consultancy Services Among Top Losers on Nifty 50, Share Price Declines by 1.36%",
            "link": "https://www.moneycontrol.com/news/business/stocks/tata-consultancy-services-among-top-losers-on-nifty-50-share-price-declines-by-1-36-alpha-article-13163118.html",
            "description": "Tata Consultancy Services is currently trading among the top losers in the Nifty 50, with its price at Rs 3389.10, reflecting a decrease of 1.36%.",
            "pubDate": "2025-06-23T17:20:57.505274"
        },
        {
            "title": "Larsen & Toubro shares among top losers on Nifty 50 during today's session",
            "link": "https://www.moneycontrol.com/news/business/stocks/larsen-toubro-shares-among-top-losers-on-nifty-50-during-today-s-session-alpha-article-13163147.html",
            "description": "In conclusion, despite being among the top losers in Nifty 50 during today's session, Larsen &amp; Toubro exhibits a robust financial profile characterized by increasing revenues and profits, along with stable financial ratios.",
            "pubDate": "2025-06-23T17:20:57.505337"
        },
        {
            "title": "Sensex rises 600 pts from day's low, Nifty reclaims 25,000; Trent, BEL, metal stocks lead recovery",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-down-650-pts-nifty-tests-24-950-amid-geopolitical-tensions-it-auto-lead-losses-broader-mkts-outshine-13162830.html",
            "description": "India VIX stood at 3 percent higher at 14.10 after rising as much as 5 percent in morning trade, signalling a mild increase in market volatility.",
            "pubDate": "2025-06-23T17:20:57.505400"
        }
    ]
}