{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-14T06:35:47.668245",
    "items": [
        {
            "title": "Will Nifty End 7-Day Losing Streak As Trump, Modi Meet Amid Reciprocal Tariff Move? Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/will-nifty-end-7-day-losing-streak-as-trump-modi-meet-amid-reciprocal-tariff-move-opening-bell-12940580.html",
            "description": "The Nifty failed to sustain its intraday rally due to a lack of strength at higher levels but the Nifty managed to close above the 23,000 mark. This morning Asian markets are largely higher and the GIFT Nifty is signalling a positive start. Overnight Wall Street saw a rally even as US President Donald Trump inked plans for sweeping \"reciprocal tariffs\" on both allies and competitors in a dramatic escalation of an international trade war.But these tariffs will not come into effect immediately. Meanwhile, in his meeting with PM Modi, Trump said he plans to firm up some wonderful trade deals for India and the US. The two leaders discussed trade relations, immigration, military sales, nuclear technology among other key issues. Among stocks in focus today will be Hindalco and Manappuram Finance. Catch Nandita Khemka in conversation with Dhiraj Reli--MD & CEO, HDFC Securities and Dhiraj Reli, MD & CEO, HDFC Securities.",
            "pubDate": "2025-02-14T03:24:16.134954"
        },
        {
            "title": "Brokerages upbeat on Hindalco's strong Q3, project up to 30% upside from current levels",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerages-upbeat-on-hindalco-s-strong-q3-project-up-to-30-upside-from-current-levels-12940555.html",
            "description": "Hindalco's strong Q3 print impressed brokerages, though they remain cautious about the potential impact of US tariffs in the future",
            "pubDate": "2025-02-14T03:24:16.135050"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-47-12939769.html",
            "description": "The S&P 500 ended down on Wednesday after a hotter-than-expected U.S. inflation reading added to worries that the Federal Reserve would not cut interest rates anytime soon, while CVS Health and Gilead Sciences rallied after upbeat quarterly reports.",
            "pubDate": "2025-02-14T03:24:16.135137"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a positive opening; Hindalco, United Breweries, HCC in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-14-02-2025-liveblog-12940541.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Kalpataru Projects, Hindustan Construction Company, Nirlon, Nazara Technologies, Deepak Nitrite, Allcargo Logistics, R Systems International, Manappuram Finance, Titagarh Rail Systems, Carborundum Universal, Gujarat Pipavav Port, UltraTech Cement, and Mahindra Lifespace will be in focus on February 14.",
            "pubDate": "2025-02-14T03:24:16.135217"
        },
        {
            "title": "Stocks to Watch Today: TCS, Hindalco, RBL Bank, United Breweries, Godfrey Phillips, Kisan Mouldings, KNR Construction in focus on 14 February",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-hindalco-rbl-bank-united-breweries-godfrey-phillips-kisan-mouldings-knr-construction-in-focus-on-14-february-12940495.html",
            "description": "Stocks To Watch, Feb 14: Stocks like Kalpataru Projects, Hindustan Construction Company, Nirlon, Nazara Technologies, Deepak Nitrite, Allcargo Logistics, R Systems International, Manappuram Finance, Titagarh Rail Systems, Carborundum Universal, Gujarat Pipavav Port, UltraTech Cement, and Mahindra Lifespace will be in focus on February 14.",
            "pubDate": "2025-02-14T03:24:16.135292"
        },
        {
            "title": "Bulk deals: Promoter Apollo Pipes buys 6 lakh shares in Kisan Mouldings",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-deals-promoter-apollo-pipes-buys-6-lakh-shares-in-kisan-mouldings-12940433.html",
            "description": "Aartha AIF bought 1.1 crore shares in Solarium Green Energy at Rs 202 per share, while Galaxy Noble Global Opportunities Fund PCC Luna sold 1.3 crore shares at the same price.",
            "pubDate": "2025-02-14T03:24:16.135368"
        },
        {
            "title": "Trade Spotlight: How should you trade Bajaj Finserv, Muthoot Finance, SBI Card, UPL, Cholamandalam Investment, Redington, and others on February 14?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bajaj-finserv-muthoot-finance-sbi-card-upl-cholamandalam-investment-redington-and-others-on-february-14-12940447.html",
            "description": "While the market may rebound amid consolidation, sustaining the expected recovery is key to watch. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-14T03:24:16.135443"
        },
        {
            "title": "Deepak Nitrite shares slump over 8% as weak Q3 earnings dampen sentiment",
            "link": "https://www.moneycontrol.com/news/business/markets/deepak-nitrite-shares-slump-over-8-as-weak-q3-earnings-dampen-sentiment-12940582.html",
            "description": "Deepak Nitrite share price: EBITDA tumbled 44.7 percent to Rs 168.5 crore from Rs 304.6 crore, impacted by higher input costs and lower realizations.",
            "pubDate": "2025-02-14T04:00:25.424605"
        },
        {
            "title": "Agri Picks Report February 14, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-february-14-2025-geojit-financial-services-12940617.html",
            "description": "According to Geojit Financial Services, Rabi sowing in Andhra Pradesh progressed to 1.8 million hectares as of Wednesday, up 11.2% from 1.6 million hectares a year ago, according to a report released by the agriculture department.",
            "pubDate": "2025-02-14T04:00:25.424695"
        },
        {
            "title": "Apparel, home textile exporters see healthy uptick in sales amid trade tensions",
            "link": "https://www.moneycontrol.com/news/opinion/apparel-home-textile-exporters-see-healthy-uptick-in-sales-amid-trade-tensions-12940558.html",
            "description": "Vendor consolidation and shift in global sourcing away from China, Bangladesh is expected to benefit India",
            "pubDate": "2025-02-14T04:00:25.424771"
        },
        {
            "title": "Samir Arora on markets: Close to bottoming out; FII selling should end soon, caused by disappointing Q3, rupee weakness",
            "link": "https://www.moneycontrol.com/news/business/markets/samir-arora-on-markets-close-to-bottoming-out-fii-selling-should-end-soon-caused-by-disappointing-q3-rupee-weakness-12940732.html",
            "description": "India saw the highest FII outflows in the Asia-Pacific region at $8.2 billion year-to-date, far higher than the $0.1–1.3 billion outflows in South Korea, Taiwan, Indonesia, Thailand, Malaysia, and other ASEAN nations.",
            "pubDate": "2025-02-14T06:35:35.035868"
        },
        {
            "title": "Cello World: Weak Q3FY25 results; growth to pick up from FY26",
            "link": "https://www.moneycontrol.com/news/business/stocks/cello-world-weak-q3fy25-results-growth-to-pick-up-from-fy26-12940719.html",
            "description": "The company is well-placed to gain market share in the consumer space on the back of sustained focus on new products and the enhancement of network",
            "pubDate": "2025-02-14T06:35:35.035953"
        },
        {
            "title": "Does the sharp fall in stock price of CAMS present an opportunity?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/does-the-sharp-fall-in-stock-price-of-cams-present-an-opportunity-12940691.html",
            "description": "Given the tailwinds in the MF industry and the vantage positioning of CAMS, the stock is a long-term compounder",
            "pubDate": "2025-02-14T06:35:35.036023"
        },
        {
            "title": "Titagarh Rail shares tank 5% after subdued Q3 earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/titagarh-rail-shares-tank-5-after-subdued-q3-earnings-12940693.html",
            "description": "Titagarh Rail's Q3 numbers disappointed the Street on all key parameters. Weakness was felt across revenue, profit and profitability.",
            "pubDate": "2025-02-14T06:35:35.036089"
        },
        {
            "title": "Weekly Tactical Pick: SBI's current valuation makes the stock a compelling choice",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/weekly-tactical-pick-sbis-current-valuation-makes-the-stock-a-compelling-choice-12940677.html",
            "description": "The irony is that SBI’s stock is languishing despite strong returns ratios aided by superior asset quality",
            "pubDate": "2025-02-14T06:35:35.036154"
        },
        {
            "title": "TBO TEK Q3: Solid execution in hotels business",
            "link": "https://www.moneycontrol.com/news/business/earnings/tbo-tek-q3-solid-execution-in-hotels-business-12940666.html",
            "description": "Strong growth in top line but margin remains under pressure",
            "pubDate": "2025-02-14T06:35:35.036235"
        },
        {
            "title": "Manappuram Finance shares crack 5% on weaker-than-expected Q3 results",
            "link": "https://www.moneycontrol.com/news/business/markets/manappuram-finance-shares-crack-5-on-weaker-than-expected-q3-results-12940651.html",
            "description": "Manappuram Finance's consolidated net profit halved to Rs 282 crore in Q3FY25, while bad loans and provisions from its microfinance arm surged fourfold to Rs 473 crore",
            "pubDate": "2025-02-14T06:35:35.036305"
        },
        {
            "title": "Senco Gold shares slide 18% on sharp margin fall, weak Q3 earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/senco-gold-shares-slide-18-on-sharp-margin-fall-weak-q3-earnings-12940552.html",
            "description": "Higher costs for setting up new subsidiaries, volatility in gold prices and a spike in custom duties weighed heavily on Senco Gold's Q3 margins.",
            "pubDate": "2025-02-14T06:35:35.036371"
        },
        {
            "title": "United Breweries stock jumps over 6% despite sharp decline in Q3 net profit",
            "link": "https://www.moneycontrol.com/news/business/markets/united-breweries-stock-falls-as-sharp-decline-in-q3-net-profit-disappoints-investors-12940557.html",
            "description": "United Breweries share price: Operating margins narrowed to 7.1 percent from 8 percent a year ago, signalling margin pressures despite revenue growth.",
            "pubDate": "2025-02-14T06:35:35.036435"
        },
        {
            "title": "Godfrey Phillips shares soar 10% after firm's Q3 net profit zooms 49% to Rs 316 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/godfrey-phillips-shares-jump-6-after-firm-s-q3-net-profit-zooms-49-to-rs-316-crore-12940612.html",
            "description": "The company's revenue from operations rose over 27 percent year-on-year to Rs 1,896 crore in Q3 FY25. Its revenue from operations stood at Rs 1,488 crore in Q3 of FY24.",
            "pubDate": "2025-02-14T06:35:35.036500"
        },
        {
            "title": "Maruti Suzuki shares extend gains as HSBC maintains 'buy'; analysts bullish on E-Vitara prospects",
            "link": "https://www.moneycontrol.com/news/business/markets/maruti-suzuki-shares-extend-gains-as-hsbc-maintains-buy-analysts-bullish-on-e-vitara-prospects-12940602.html",
            "description": "Maruti Suzuki share price: The company plans to export the model to over 100 countries, including Japan and Europe, reinforcing India’s role as a key player in EV manufacturing.",
            "pubDate": "2025-02-14T06:35:35.036569"
        }
    ]
}