{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-24T04:10:58.437457",
    "items": [
        {
            "title": "Live: Can Nifty sustain above 25,000 amid trade volatility? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-sustain-above-25-000-amid-trade-volatility-opening-bell-13572750.html",
            "description": "Indian markets extended their losing streak with the Nifty closing in the red for a third straight session, while broader indices also saw profit-booking for the second day in a row. Sectorally, PSU banks, metals and auto stocks emerged as top gainers, even as FMCG, realty and IT names came under selling pressure. On the macro front, India’s composite PMI eased to 61.9 in September, though core sector growth hit a 13-month high in August, offering some comfort on the economic front. This morning, global cues were largely lower. US markets ended lower overnight while Asian markets also slipped this morning. Catch Lovisha Darad in conversation with Sudeep Shah—Head of Technical & Derivative Research, SBI Securities and Vikas Gupta, CEO & Chief investment Strategist at OmniScience Capital.",
            "pubDate": "2025-09-24T03:44:04.611241"
        },
        {
            "title": "Dilip Buildcon shares in focus on project win worth Rs 1,115 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/dilip-buildcon-shares-in-focus-on-project-win-worth-rs-1-115-crore-13571830.html",
            "description": "Dilip Buildcon Share Price | Dilip Buildcon JV has won a project from Kerala Industrial Corridor Development Corporation.",
            "pubDate": "2025-09-24T03:44:04.611320"
        },
        {
            "title": "Indian equities seen opening on a weak note; rupee hits record low",
            "link": "https://www.moneycontrol.com/news/business/indian-equities-seen-opening-on-a-weak-note-rupee-hits-record-low-13572190.html",
            "description": "Across Asia, equities slipped on Wednesday, echoing Wall Street losses after US Federal Reserve Chair Jerome Powell cautioned that “equity prices are fairly highly valued.”",
            "pubDate": "2025-09-24T03:44:04.611515"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-7-13571808.html",
            "description": "FIIs extended the selling on second day on September 23 as sold equities worth Rs 3,551 crore, while DIIs continued their buying in this month, as they purchased equities worth Rs 2,670 crore on the same day.",
            "pubDate": "2025-09-24T03:44:04.611582"
        },
        {
            "title": "Asian stocks edge lower after mixed Fed signals",
            "link": "https://www.moneycontrol.com/news/business/asian-stocks-edge-lower-after-mixed-fed-signals-13572158.html",
            "description": "The MSCI Asia Pacific Index fell 0.2% at the open with declines in Japan, which returned after a holiday, Australia and South Korea.",
            "pubDate": "2025-09-24T03:44:04.611651"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty down at pre-open; Swiggy, Akzo Nobel, Dilip Buildcon, Ceinsys in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-24-09-2025-liveblog-13572159.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Swiggy, Akzo Nobel India, Dilip Buildcon, HCL Technologies, Torrent Power, Bajaj Electricals, VMS TMT, Ceinsys Tech, Sudarshan Chemical Industries, and VIP Industries will be in focus on September 24.",
            "pubDate": "2025-09-24T03:44:04.611718"
        },
        {
            "title": "Trade Spotlight: How should you trade Union Bank, Jindal Steel, Samvardhana Motherson, Canara Bank, HPCL, NTPC, and others on September 24?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-union-bank-jindal-steel-samvardhana-motherson-canara-bank-hpcl-ntpc-and-others-on-september-24-13572117.html",
            "description": "The market may see some more consolidation amid rangebound trading in the upcoming sessions. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-09-24T03:44:04.611802"
        },
        {
            "title": "Stocks to Watch Today: Swiggy, Akzo Nobel, Dilip Buildcon, HCL Tech, Torrent Power, Bajaj Electricals, VMS TMT, Ceinsys Tech in focus on 24 September",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-swiggy-akzo-nobel-dilip-buildcon-hcl-tech-torrent-power-bajaj-electricals-vms-tmt-ceinsys-tech-in-focus-on-24-september-13572089.html",
            "description": "Stocks to Watch, 24 September: Stocks like Swiggy, Akzo Nobel India, Dilip Buildcon, HCL Technologies, Torrent Power, Bajaj Electricals, VMS TMT, Ceinsys Tech, Sudarshan Chemical Industries, and VIP Industries will be in focus on September 24.",
            "pubDate": "2025-09-24T03:44:04.611871"
        },
        {
            "title": "Brookfield sells 5.4% stake in Energy Infrastructure Trust for Rs 296.4 crore, Plutus Wealth offloads 1.4% shares in Sammaan Capital",
            "link": "https://www.moneycontrol.com/news/business/markets/brookfield-sells-5-4-stake-in-energy-infrastructure-trust-for-rs-296-4-crore-plutus-wealth-offloads-1-4-shares-in-sammaan-capital-13571726.html",
            "description": "The 5.4 percent units of Energy Infrastructure Trust were bought by Neo Infra Income Opportunities Fund, B Arunkumar Capital & Credit Services, Pico Capital, and Neo Wealth Partners.",
            "pubDate": "2025-09-24T03:44:04.611934"
        },
        {
            "title": "Maruti Suzuki India shares rise 0.7% in early trade",
            "link": "https://www.moneycontrol.com/news/business/stocks/maruti-suzuki-india-shares-rise-0-7-in-early-trade-13573001.html",
            "description": "Moneycontrol's sentiment analysis indicates a very bullish outlook for the stock as of September 24, 2025.",
            "pubDate": "2025-09-24T04:10:56.786897"
        },
        {
            "title": "JSW Infrastructure share hits all-time high at Rs 347.50, up 1.53%",
            "link": "https://www.moneycontrol.com/news/business/stocks/jsw-infrastructure-share-hits-all-time-high-at-rs-347-50-up-1-53-alpha-article-13572983.html",
            "description": "With the stock currently trading at Rs 347.30, JSW Infrastructure has demonstrated strong financial performance and positive investor sentiment, reaching an all-time high.",
            "pubDate": "2025-09-24T04:10:56.786984"
        },
        {
            "title": "Auto part maker Minda Corp soars on plans to target 3.5x revenue growth, over 12.5 percent margin in five years",
            "link": "https://www.moneycontrol.com/news/business/markets/auto-part-maker-minda-corp-soars-on-plans-to-target-3-5x-revenue-growth-over-12-5-percent-margin-in-five-years-13571473.html",
            "description": "Minda said in the investor presentation that it will aim for 3.5x growth in revenue at over Rs 17,500 crore by FY30 with an EBITDA margin of over 12.5 percent. The company has lined up a planned capex of of approximately Rs 2,000 crore over the next five years.",
            "pubDate": "2025-09-24T04:10:56.787098"
        }
    ]
}