{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-10T03:11:26.633647",
    "items": [
        {
            "title": "Stocks to Watch Today: Premier Energies, Capri Global, Protean eGov Tech, ITD Cementation, Jana Small Finance Bank, IRB Infra, Nibe in focus on 10 June",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-premier-energies-capri-global-protean-egov-tech-itd-cementation-jana-small-finance-bank-irb-infra-nibe-in-focus-on-10-june-13106766.html",
            "description": "Stocks to watch, 10 June: Stocks like Veedol Corporation, AstraZeneca Pharma India, Force Motors, Geojit Financial Services, Tech Mahindra, ITD Cementation India, Protean eGov Technologies, Nibe, IRB Infrastructure Developers, Jana Small Finance Bank, Capri Global Capital, and Premier Energies will be in focus on June 10.",
            "pubDate": "2025-06-10T03:11:20.511210"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a firm start; Premier Energies, RITES, Capri Global in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-10-06-2025-liveblog-13106760.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Veedol Corporation, AstraZeneca Pharma India, Force Motors, Geojit Financial Services, Tech Mahindra, ITD Cementation India, Protean eGov Technologies, Nibe, IRB Infrastructure Developers, Jana Small Finance Bank, Capri Global Capital, and Premier Energies will be in focus on June 10.",
            "pubDate": "2025-06-10T03:11:20.511293"
        },
        {
            "title": "Market participants raise concerns over BSE's liquidity-based fee structure; exchange says compliant with SEBI norms",
            "link": "https://www.moneycontrol.com/news/business/markets/market-participants-raise-concerns-over-bse-s-liquidity-based-fee-structure-exchange-says-compliant-with-sebi-norms-13106422.html",
            "description": "Some participants have raised concerns about BSEs fee structure based on liquidity of the stocks, calling it discriminatory against X, XT category of stocks and adding high cost of transactions for investors of such category of shares. BSE denied the allegations and said this practice is there since 2016, to discourage investors from investing in such low liquid stocks.",
            "pubDate": "2025-06-10T03:11:20.511362"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-110-13105359.html",
            "description": "The Foreign institutional investors (FIIs) continued their buying on second day as they purchased equities worth Rs 1,992 crore on June 9, while Domestic institutional investors (DIIs) also extended their buying on the 15th day as they bought equities of Rs 3,503 crore on the same day.",
            "pubDate": "2025-06-10T03:11:20.511434"
        },
        {
            "title": "Asian stocks rise on US-China talks, yen declines",
            "link": "https://www.moneycontrol.com/news/business/asian-stocks-to-advance-as-us-china-talks-continue-13106755.html",
            "description": "Shares in Hong Kong and China traded within a tight range, while US equity-index futures advanced.",
            "pubDate": "2025-06-10T03:11:20.511501"
        },
        {
            "title": "Trade Spotlight: How should you trade Oracle Financial, Praj Industries, Bank of India, Trent, NMDC, Zensar Technologies and others on June 10?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-oracle-financial-praj-industries-bank-of-india-trent-nmdc-zensar-technologies-and-others-on-june-10-13106733.html",
            "description": "The trend is expected to remain in favour of the bulls, despite intermittent profit booking in the upcoming sessions. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-06-10T03:11:20.511567"
        }
    ]
}