{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-18T03:04:21.108721",
    "items": [
        {
            "title": "Brokerage Radar: CLSA raises DLF's target, Jefferies rates Piramal Enterprises as 'Underperform'",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-clsa-raises-dlf-s-target-jefferies-rates-piramal-enterprises-as-underperform-12892330.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes LIC Housing, DLF, Piramal Enterprises and more.",
            "pubDate": "2024-12-18T03:04:13.279540"
        },
        {
            "title": "Short Call | The Fed's balancing game on the radar; Piramal Pharma, HDFC Bank in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/short-call-the-fed-s-balancing-game-on-the-radar-piramal-pharma-hdfc-bank-in-focus-12892322.html",
            "description": "“At all times, in all markets, in all parts of the world, the tiniest change in rates changes the value of every financial asset.”--Warren Buffett",
            "pubDate": "2024-12-18T03:04:13.279627"
        },
        {
            "title": "Vishal Mega Mart, MobiKwik, Sai Life set to list today: Check GMP and subscription details",
            "link": "https://www.moneycontrol.com/news/business/ipo/vishal-mega-mart-mobikwik-sai-life-set-to-list-today-check-gmp-and-subscription-details-12892312.html",
            "description": "In 2024, 75 Indian companies raised over Rs 1.5 lakh crore through mainboard IPOs, marking a new record, according to data from Prime Database.",
            "pubDate": "2024-12-18T03:04:13.279710"
        },
        {
            "title": "Exide Industries shares in focus on further investment in subsidiary",
            "link": "https://www.moneycontrol.com/news/business/stocks/exide-industries-shares-in-focus-on-further-investment-in-subsidiary-12892203.html",
            "description": "Exide Industries Share Price | The company has invested Rs 99, 99,99,972 by way of subscription in the equity share capital of its wholly owned subsidiary Exide Energy Solutions, on rights basis. With this investment, the total investment made by the company in EESL stands to Rs 3152.24 crore.",
            "pubDate": "2024-12-18T03:04:13.279783"
        },
        {
            "title": "Aurobindo Pharma shares in focus on two observations from USFDA",
            "link": "https://www.moneycontrol.com/news/business/stocks/aurobindo-pharma-shares-in-focus-on-two-observations-from-usfda-12892201.html",
            "description": "Aurobindo Pharma Share Price | These observations came after an inspection of the Unit-V API manufacturing facility at Apitoria Pharma, a wholly owned subsidiary, located in Pashamylaram Village, Telangana.",
            "pubDate": "2024-12-18T03:04:13.279856"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a weak start; US, Asian markets fall",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-18-12-2024-liveblog-12892305.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed down on Tuesday and crude prices fell as investors parsed economic data and girded themselves for a series of central bank decisions, including an expected rate cut from the Federal Reserve. The Dow Jones Industrial Average fell 266.93 points, or 0.61%, to 43,450.55, the S&P 500 fell 23.45 points, or 0.39%, to 6,050.63 and the Nasdaq Composite fell 64.83 points, or 0.32%, to 20,109.06.",
            "pubDate": "2024-12-18T03:04:13.279934"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-12-12891832.html",
            "description": "The GIFT Nifty is indicating a weak start for the day. US stocks closed down on Tuesday and crude prices fell as investors parsed economic data and girded themselves for a series of central bank decisions, including an expected rate cut from the Federal Reserve.",
            "pubDate": "2024-12-18T03:04:13.280003"
        },
        {
            "title": "Trade Spotlight: How should you trade Infosys, Mahindra Holidays, DOMS Industries, Prestige Estates, Nykaa, and others on Wednesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-infosys-mahindra-holidays-doms-industries-prestige-estates-nykaa-and-others-on-wednesday-12892283.html",
            "description": "The benchmark indices may sustain the negative trend, with focus on the outcome of the two-day Federal Reserve policy meeting, which is due on December 18. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-18T03:04:13.280073"
        },
        {
            "title": "Stock Radar: Vishal Mega Mart, Mobikwik, JSW Energy, Va Tech Wabag, Pondy Oxides, Aurobindo Pharma in focus on Wednesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-vishal-mega-mart-mobikwik-jsw-energy-va-tech-wabag-pondy-oxides-aurobindo-pharma-in-focus-on-wednesday-12892276.html",
            "description": "Stocks like Aurobindo Pharma, Jindal Saw, Route Mobile, Gujarat Industries Power Co, Aditya Birla Real Estate, Exide Industries, Sonata Software, Sun TV Network, LTIMindtree, Hampton Sky Realty, Aditya Birla Sun Life AMC, and Restaurant Brands Asia will also be in focus on December 18.",
            "pubDate": "2024-12-18T03:04:13.280142"
        }
    ]
}