{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-08T03:27:02.749911",
    "items": [
        {
            "title": "Stock Radar: Lupin, Cummins, NHPC, SAIL, ITD Cementation, Astral, Emami, RVNL, Indian Hotels, Emcure Pharma in focus on Friday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-lupin-cummins-nhpc-sail-itd-cementation-astral-emami-rvnl-indian-hotels-emcure-pharma-in-focus-on-friday-12860881.html",
            "description": "Stocks like VA Tech Wabag, Ircon International, Indian Metals & Ferro Alloys, Gujarat State Petronet, Nelcast, Cochin Shipyard, Aditya Birla Fashion & Retail, GR Infraprojects, and Teamlease Services will also be in focus on November 8.",
            "pubDate": "2024-11-08T01:40:47.563462"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a flat start; US, Asian markets gain post Fed rate cut",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-08-11-2024-liveblog-12860890.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed higher on Thursday, after the Federal Reserve announced a cut of 25 basis points (bps) in interest rates, extending a sharp rally sparked by Donald Trump's return as U.S. president. The Fed cut interest rates by a quarter of a percentage point as policymakers took note of a job market that has \"generally eased\" while inflation continues to move toward the U.S. central bank's 2% target.",
            "pubDate": "2024-11-08T02:39:32.746031"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-74-12860416.html",
            "description": "The GIFT Nifty is indicating a flat to positive start for the day.",
            "pubDate": "2024-11-08T02:39:32.746122"
        },
        {
            "title": "Gland Pharma's outlook brightens, but will it shine is the key question",
            "link": "https://www.moneycontrol.com/news/opinion/gland-pharmas-outlook-brightens-but-will-it-shine-is-the-key-question-12860910.html",
            "description": "The company's performance is recovering, with an improved guidance lending confidence. Still, it's not business as usual, a crucial acquisition must deliver results soon and a new CEO is waiting in the wings",
            "pubDate": "2024-11-08T03:01:48.071249"
        },
        {
            "title": "Agri Picks Report November 08, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-november-08-2024-geojit-financial-services-12860937.html",
            "description": "According to Geojit, Farmers in Maharashtra have sown rabi crops over 621,315 hectares as of Tuesday, down 40.3% on year from 1.04 million hectares a year ago, according to a report released by the state's agriculture department.",
            "pubDate": "2024-11-08T03:27:02.150866"
        }
    ]
}