{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-07T09:38:53.057384",
    "items": [
        {
            "title": "Stock Radar: Tata Steel, Apollo Hospitals, Power Grid, Polycab India, Wockhardt, Avalon Tech, Delta Corp in focus on Thursday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-tata-steel-apollo-hospitals-power-grid-polycab-india-wockhardt-avalon-tech-delta-corp-in-focus-on-thursday-12859870.html",
            "description": "Stocks like Chambal Fertilisers and Chemicals, Gujarat Gas, Hindalco Industries,India Pesticides, Kirloskar Ferrous Industries, Kansai Nerolac Paints, Sonata Software, Blue Star, Usha Martin, and Endurance Technologies will also be in focus on November 7.",
            "pubDate": "2024-11-07T01:38:25.032857"
        },
        {
            "title": "Trade Spotlight: How should you trade HDFC Bank, Indian Hotels, Bank of Baroda, Skipper, Kellton Tech Solutions, and others on Thursday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-hdfc-bank-indian-hotels-bank-of-baroda-skipper-kellton-tech-solutions-and-others-on-thursday-12859861.html",
            "description": "While there may be some consolidation after the sharp run-up over the last two days, the overall trend seems to have turned in favour of the bulls. Below are some trading ideas for the near term.",
            "pubDate": "2024-11-07T01:38:25.033046"
        },
        {
            "title": "MSCI November Rejig: Voltas, BSE, Alkem Labs among five inclusions, HDFC Bank's weightage set to go up",
            "link": "https://www.moneycontrol.com/news/business/markets/msci-november-rejig-voltas-bse-alkem-labs-among-five-inclusions-hdfc-banks-weightage-set-to-go-up-12859883.html",
            "description": "Among the five new additions to the MSCI Global Standard index, Voltas is expected to draw the largest inflow, exceeding $300 million, while BSE shares could attract close to $260 million.",
            "pubDate": "2024-11-07T02:38:55.423619"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-73-12859390.html",
            "description": "The GIFT Nifty is indicating a negative start for the day.",
            "pubDate": "2024-11-07T02:38:55.423710"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a negative start; US markets gain, Asia mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-updates-gift-nifty-suggests-a-negative-start-us-markets-gain-asia-mixed-liveblog-12859882.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks rallied sharply to close at record highs on Wednesday after Republican Donald Trump won the 2024 U.S. presidential election in a stunning comeback four years after being voted out of the White House",
            "pubDate": "2024-11-07T02:38:55.423792"
        },
        {
            "title": "CAMS | This stock is the best proxy play for rising inflows into equity funds",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/cams-this-stock-is-the-best-proxy-play-for-rising-inflows-into-equity-funds-12859932.html",
            "description": "CAMS is technology-driven financial infrastructure and services provider to mutual funds and other financial institutions. MFs is the key segment for the company and accounts for around 87% of its revenues. CAMS market share as RTA (registrar and transfer agent) has increased from 61% in FY15 to 68% as at end September 24 in terms of average monthly AUM serviced by it. There are very less risks to its existing market share as it is challenging for its clients or new competition to replicate the physical network or the technology platforms. Moreover, switch to competition is rare as CAMS enjoys long-standing relationships with MFs. CAMS has entered into other business lines to diversify its revenue. Other businesses includes accounts aggregator, payments aggregator (CAMSPAY), servicing AIFs/PMS, loans against MF, central record keeping agency (CRA) for National Pension Scheme (NPS), insurance repository and e-KYC business.",
            "pubDate": "2024-11-07T03:29:34.367340"
        },
        {
            "title": "IT, pharma can gain from Trump presidency despite higher trade barriers",
            "link": "https://www.moneycontrol.com/news/opinion/it-and-pharma-can-gain-from-trump-presidency-despite-higher-trade-barriers-12859908.html",
            "description": "Vendor diversification and higher duties on China can benefit CDMO and chemical companies. Though renewable energy adoption can see lesser policy support",
            "pubDate": "2024-11-07T03:29:34.367426"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a negative start; Tata Steel, Power Grid, Hindalco in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-07-11-2024-liveblog-12859882.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Mahindra & Mahindra, Lupin, Alembic Pharmaceuticals, Escorts Kubota, Indian Hotels, NHPC, Aavas Financiers, Abbott India, Aditya Birla Fashion and Retail, Astral, Bajaj Electricals, Cochin Shipyard, Cummins India, Emami, Emcure Pharmaceuticals, Innova Captab, IRCON International, ITD Cementation, NCC, Page Industries, Rail Vikas Nigam, SAIL, Baazar Style Retail, Trent, Vijaya Diagnostic Centre, and Va Tech Wabag will announce September quarter earnings on November 7.",
            "pubDate": "2024-11-07T03:29:34.367639"
        },
        {
            "title": "Agri Picks Report November 07, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-november-07-2024-geojit-financial-services-12859965.html",
            "description": "According to Geojit, The Indian Sugar Mills & Bio-Energy Manufacturers Association has retained its estimate for gross sugar production in 2024-25 (Oct-Sep)at 33.3 million tonnes, 2.3% lower than 34.1 million tonnes last year, according to ISMA's first advance estimates for sugar output.",
            "pubDate": "2024-11-07T03:43:00.686867"
        },
        {
            "title": "Berger Paints Q2: Sluggish consumer demand a challenge",
            "link": "https://www.moneycontrol.com/news/business/earnings/berger-paints-q2-sluggish-consumer-demand-a-challenge-12859957.html",
            "description": "Though gaining market share consistently, potential competition takes shine off the stock",
            "pubDate": "2024-11-07T03:58:15.541163"
        },
        {
            "title": "Niva Bupa Health Insurance IPO: Should investors subscribe to it?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/niva-bupa-health-insurance-ipo-should-investors-subscribe-12859967.html",
            "description": "Low penetration of health insurance, high out-of-pocket expenses, consistently higher healthcare inflation, and increased awareness are some of the structural factors that will drive the demand for retail healthcare insurance",
            "pubDate": "2024-11-07T04:20:12.691087"
        },
        {
            "title": "Apollo Hospitals soars to record high after stellar Q2 earnings show",
            "link": "https://www.moneycontrol.com/news/business/markets/apollo-hospitals-soars-to-record-high-after-stellar-q2-earnings-show-12859968.html",
            "description": "Apollo Hospitals topped estimates in Q2, delivering better-than-expected results across key parameters of profit, revenue, and profitability, driven by mid-teens growth across all segments.",
            "pubDate": "2024-11-07T04:20:12.691179"
        },
        {
            "title": "Nifty, Sensex fall, snap two-day streak ahead of US Fed's FOMC meet; Apollo Hospital in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-fall-snap-two-day-streak-ahead-of-us-feds-fomc-meet-apollo-hospital-in-focus-12859954.html",
            "description": "Among sectors, Nifty Metal and Energy were the top losers with the two falling 0.5 percent and 1 percent, each.",
            "pubDate": "2024-11-07T04:20:12.691254"
        },
        {
            "title": "Wockhardt stock tanks 4.5% as firm launches QIP at sharp discount",
            "link": "https://www.moneycontrol.com/news/business/markets/wockhardt-stock-tanks-4-5-as-firm-launches-qip-at-sharp-discount-12860038.html",
            "description": "The QIP is expected to dilute 5.57 percent of Wockhardt’s post-issue equity capital. The raised funds will strengthen the company’s capital structure, supporting growth or reducing liabilities.",
            "pubDate": "2024-11-07T04:46:22.788530"
        },
        {
            "title": "Endurance Technologies' shares gain following a strong Q2 performance",
            "link": "https://www.moneycontrol.com/news/business/markets/endurance-technologies-shares-gain-following-a-strong-q2-performance-12859978.html",
            "description": "The company's aftermarket sales in India reached Rs 229.8 crore, up from Rs 217.7 crore in the same quarter last year.",
            "pubDate": "2024-11-07T04:46:22.788614"
        },
        {
            "title": "Metals, OMCs, manufacturing could gain with Trump win; IT could face headwinds",
            "link": "https://www.moneycontrol.com/news/business/markets/metals-omcs-manufacturing-could-gain-with-trump-win-it-could-face-headwinds-12859982.html",
            "description": "Market experts in India believe that a Republican majority in the US could cast a strong spotlight on specific sectors in Indi",
            "pubDate": "2024-11-07T04:46:22.788686"
        },
        {
            "title": "Waaree Energies stock beaks stellar streak, tanks 8% on profit booking",
            "link": "https://www.moneycontrol.com/news/business/markets/waaree-energies-stock-beaks-stellar-streak-tanks-8-on-profit-booking-12860042.html",
            "description": "This comes just a day after the solar power stock rallied 8 percent, propelling its market capitalization to Rs 1,03,779.62 crore.",
            "pubDate": "2024-11-07T05:39:21.485049"
        },
        {
            "title": "Subscribe for Niva Bupa Health Insurance Company Ltd IPO; Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-niva-bupa-health-insurance-company-ltd-ipo-geojit-financial-services-12860111.html",
            "description": "Geojit Financial Services, has come out with its report on Niva Bupa Health Insurance Company Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on November 06 2024.",
            "pubDate": "2024-11-07T05:54:46.490401"
        },
        {
            "title": "Buy InterGlobe Aviation; target of Rs 4675: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-interglobe-aviation-target-of-rs-4675-geojit-financial-services-12860374.html",
            "description": "Geojit Financial Services is bullish on InterGlobe Aviation has recommended buy rating on the stock with a target price of Rs 4675 in its research report dated November 07, 2024.",
            "pubDate": "2024-11-07T06:54:59.479560"
        },
        {
            "title": "Mid-day Mood | Sensex down 900 points, Nifty slips over 1% as all sectors bleed",
            "link": "https://www.moneycontrol.com/news/business/markets/mid-day-mood-sensex-down-900-points-nifty-slips-over-1-as-all-sectors-bleed-12860145.html",
            "description": "Stocks like Hindalco Vedanta and Adani Enterprises dragged the Metal index almost 2 percent lower.",
            "pubDate": "2024-11-07T06:54:59.479645"
        },
        {
            "title": "Chambal Fertilisers stock surges 5.5% after sharp jump in Q2 net profit",
            "link": "https://www.moneycontrol.com/news/business/markets/chambal-fertilisers-stock-surges-5-5-after-sharp-jump-in-q2-net-profit-12860396.html",
            "description": "The sharp surge Chambal Fertiliser's the bottomline in Q2 was aided by a significant improvement in operational performance.",
            "pubDate": "2024-11-07T07:35:10.071165"
        },
        {
            "title": "JK Lakshmi Cement shares tumble 4% after reporting net loss in Q2",
            "link": "https://www.moneycontrol.com/news/business/markets/jk-lakshmi-cement-shares-tumble-4-after-reporting-net-loss-in-q2-12860375.html",
            "description": "Looking ahead, JK Lakshmi Cement highlighted the positive impact of increased government spending on infrastructure, especially in housing and road development, which could benefit the cement sector.",
            "pubDate": "2024-11-07T07:35:10.071249"
        },
        {
            "title": "Market volatility: The sectors that experts are advising investors to look at",
            "link": "https://www.moneycontrol.com/news/business/markets/market-volatility-the-sectors-that-experts-are-advising-investors-to-look-at-12860383.html",
            "description": "Experts believe that investors would be better off focusing on domestic-oriented sectors, larger private and public sector banks",
            "pubDate": "2024-11-07T07:35:10.071320"
        },
        {
            "title": "Shakti Pumps shares locked in 5% upper circuit on Rs 116 crore order win",
            "link": "https://www.moneycontrol.com/news/business/markets/shakti-pumps-shares-locked-in-5-upper-circuit-on-rs-116-crore-order-win-12860487.html",
            "description": "The stock has delivered a remarkable performance in 2024, up 368 percent year-to-date, significantly outpacing the Nifty 50's 11 percent gain.",
            "pubDate": "2024-11-07T09:38:52.514440"
        }
    ]
}