{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-21T13:41:45.713106",
    "items": [
        {
            "title": "Unicommerce eSolutions fully acquires Shipway Tech to ramp up e-commerce and logistics play",
            "link": "https://www.moneycontrol.com/news/business/stocks/unicommerce-esolutions-fully-acquires-shipway-tech-to-ramp-up-e-commerce-and-logistics-play-12971453.html",
            "description": "Unicommerce eSolutions' board on March 20 approved the full acquisition of Shipway Technology, a move that is expected to expand its presence in e-commerce technology and enhance logistical capabilities.",
            "pubDate": "2025-03-21T07:43:40.756922"
        },
        {
            "title": "Va Tech Wabag stock jumps 8% as firm signs non-binding term sheet with Norfund-led consortium for $100-mn investment",
            "link": "https://www.moneycontrol.com/news/business/stocks/va-tech-wabag-stock-jumps-8-as-firm-signs-non-binding-term-sheet-with-norfund-led-consortium-for-100-mn-investment-12971350.html",
            "description": "Va Tech Wabag to establish a municipal platform, committing up to $100 million in capital projects over 3-5 years.",
            "pubDate": "2025-03-21T07:43:40.757014"
        },
        {
            "title": "BHEL shares jump 3% after firm wins Rs 7,500-crore order from Gujarat State Electricity Corporation",
            "link": "https://www.moneycontrol.com/news/business/markets/bhel-shares-jump-3-after-firm-wins-rs-7-500-crore-order-from-gujarat-state-electricity-corporation-12971414.html",
            "description": "BHEL shares have now extended gains for the fifth consecutive session. The stock has now strongly recovered after hitting a 52-week low of Rs 176 per share on March 3.",
            "pubDate": "2025-03-21T07:43:40.757093"
        },
        {
            "title": "RVNL shares jump 3% after bagging Rs 554 crore NHAI order in Andhra Pradesh",
            "link": "https://www.moneycontrol.com/news/business/markets/rvnl-shares-jump-3-after-bagging-rs-554-crore-nhai-order-in-andhra-pradesh-12971241.html",
            "description": "RVNL shares have extended gains for a fourth consecutive session, jumping nearly 13 percent since March 17.",
            "pubDate": "2025-03-21T07:43:40.757368"
        },
        {
            "title": "HCC shares rally 13% after JV with Tatas bags Rs 2,500 crore order, second in a week",
            "link": "https://www.moneycontrol.com/news/business/stocks/hcc-shares-rally-13-after-jv-with-tatas-bags-rs-2-500-crore-order-second-in-a-week-12971318.html",
            "description": "Hindustan Construction Company (HCC) JV secured its second major order this week, following a Rs 2,191 crore metro contract win. The latest project involves extensive civil and hydro-mechanical works, including tunnels, reservoirs, and powerhouse construction.",
            "pubDate": "2025-03-21T07:43:40.757514"
        },
        {
            "title": "BDL, HAL, other defence stocks surge up to 6% on DAC's nod for Rs 54,000 crore acquisition plans",
            "link": "https://www.moneycontrol.com/news/business/markets/bdl-hal-other-defence-stocks-surge-up-to-6-on-dac-s-nod-for-rs-54-000-crore-acquisition-plans-12971300.html",
            "description": "The rally in the share prices pushed the Nifty India Defence index up over a percent, extending gains for a seventh consecutive session.",
            "pubDate": "2025-03-21T07:43:40.757652"
        },
        {
            "title": "IndusInd Bank orders investigation into accounting lapses in derivatives portfolio; shares slip to day's low",
            "link": "https://www.moneycontrol.com/news/business/stocks/indusind-bank-orders-investigation-into-accounting-lapses-in-derivatives-portfolio-12971344.html",
            "description": "IndusInd Bank has appointed an independent firm to investigate discrepancies in its derivatives portfolio, assessing potential accounting lapses and accountability.",
            "pubDate": "2025-03-21T07:43:40.757781"
        },
        {
            "title": "Nuvama initiates coverage on Waaree Energies with a Buy, target of Rs 2,805",
            "link": "https://www.moneycontrol.com/news/business/stocks/nuvama-initiates-coverage-on-waaree-energies-with-a-buy-target-of-rs-2-805-12971258.html",
            "description": "Nuvama expects Waaree Energies' EBITDA to grow at a 54% CAGR over FY24–27, driven by capacity expansion in modules, cells, and wafers. The firm sees margins peaking at 24% by FY28 before moderating amid rising competition.",
            "pubDate": "2025-03-21T07:43:40.758037"
        },
        {
            "title": "Bajaj Finance shares soar to record high on Rajeev Jain's elevation; brokerages eye target of Rs 11,000",
            "link": "https://www.moneycontrol.com/news/business/stocks/bajaj-finance-shares-soar-to-record-high-on-rajeev-jain-s-elevation-brokerages-eye-target-of-rs-11-000-12971289.html",
            "description": "Brokerages raised their target price on Bajaj Finance shares as recent developments have addressed a key overhang, and the succession plan is \"well executed\".",
            "pubDate": "2025-03-21T07:43:40.758101"
        },
        {
            "title": "Manappuram Finance shares jump 10% as Bain Capital set to buy 18% stake for Rs 4,385 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/manappuram-finance-shares-jump-3-as-bain-capital-set-to-buy-18-stake-for-rs-4-385-crore-12971259.html",
            "description": "The deal will be executed through a preferential allotment of equity shares (9.29 crore equity shares at Rs 236 per share) and warrants, after completion of which, Bain Capital will be classified as a joint promoter of the company.",
            "pubDate": "2025-03-21T07:43:40.758164"
        },
        {
            "title": "How to deal with Indian IT stocks after Accenture’s cautious commentary?",
            "link": "https://www.moneycontrol.com/news/business/earnings/how-to-deal-with-indian-it-stocks-following-accenture-s-cautious-commentary-12971199.html",
            "description": "Though the company’s business performance was steady in Q2FY25, it called out specific areas of uncertainty",
            "pubDate": "2025-03-21T07:43:40.758294"
        },
        {
            "title": "Agri Picks Report March 21, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-21-2025-geojit-financial-services-12971232.html",
            "description": "According to Geojit Financial Services, The sowing of summer crops in Maharashtra has reached 359,482 hectares as of Monday, up 29% on year from 278,687 hectares sown in the same period last year, according to a report released by the state agriculture department.",
            "pubDate": "2025-03-21T07:43:40.758359"
        },
        {
            "title": "Weekly Tactical Pick: Will this jeweller regain its shine?",
            "link": "https://www.moneycontrol.com/news/business/stocks/weekly-tactical-pick-will-this-jeweller-regain-its-shine-12971203.html",
            "description": "Senco Gold is continuing a healthy network expansion and plans to open about 20 stores in the next fiscal. Geographical expansion and entry into new markets are expected to drive growth.",
            "pubDate": "2025-03-21T07:43:40.758502"
        },
        {
            "title": "Hindalco shares in focus as KM Birla announces Rs 45,000 crore expansion for copper, aluminum segments",
            "link": "https://www.moneycontrol.com/news/business/stocks/hindalco-shares-in-focus-as-km-birla-announces-rs-45-000-crore-expansion-for-copper-aluminum-segments-12971173.html",
            "description": "The Aditya Birla Group is committing Rs 45,000 crore across the aluminium, copper and specialty alumina businesses for Hindalco Industries.",
            "pubDate": "2025-03-21T07:43:40.758568"
        },
        {
            "title": "Nifty Midcap extends rally for a fifth session to gain 8% this week, strength likely to continue",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-midcap-extends-rally-for-a-fifth-session-to-gain-8-this-week-strength-likely-to-continue-12971549.html",
            "description": "Strong investor interest has meant the midcap index has outperformed the benchmark Nifty 50 index, which is up nearly 4 percent for the week at above 23,300.",
            "pubDate": "2025-03-21T08:51:55.741525"
        },
        {
            "title": "Brokerages give thumbs up as Bain Capital plans stake buy in Manappuram Finance",
            "link": "https://www.moneycontrol.com/news/business/stocks/brokerages-give-thumbs-up-as-bain-capital-plans-stake-buy-in-manappuram-finance-12971520.html",
            "description": "With an open offer triggered for an additional 26% stake, Bain Capital’s total shareholding in Manappuram could rise as high as 41.7%, depending on how many shares public investors tender. Post-investment, the existing promoter stake will drop to 28.9%.",
            "pubDate": "2025-03-21T09:21:58.326645"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on March 21",
            "link": "https://www.moneycontrol.com/news/business/markets/top-gainers-and-losers-today-stocks-that-moved-the-most-on-march-21-12971869.html",
            "description": "At close, Sensex climbed 557 points, or 0.73 percent, to settle at 76,905, while the Nifty 50 advanced 159 points, or 0.69 percent to close at 23,350. The Nifty 50 decisively crossed the 23,300 resistance with banking, oil & gas, and pharma stocks supporting the rally.",
            "pubDate": "2025-03-21T11:32:52.808227"
        },
        {
            "title": "IDBI Bank shares rise nearly 8% to highest level in nine weeks on privatisation hope",
            "link": "https://www.moneycontrol.com/news/business/stocks/idbi-bank-shares-rise-nearly-8-to-highest-level-in-nine-weeks-on-privatisation-hope-12971794.html",
            "description": "IDBI Bank shares have marked their highest level since February 6 on strong trading volumes, amid ongoing divestment efforts by the Centre and LIC, who are jointly offloading 61% stake.",
            "pubDate": "2025-03-21T11:32:52.808312"
        },
        {
            "title": "Delhivery jumps 3% after Macquarie sees 48% upside for stock",
            "link": "https://www.moneycontrol.com/news/business/markets/delhivery-jumps-3-after-macquarie-sees-48-upside-for-stock-12971464.html",
            "description": "This comes despite the recent downfall in the stock, falling nearly 40 percent from its September levels as against the 17 percent fall in the Nifty smallcap index.",
            "pubDate": "2025-03-21T11:32:52.808385"
        },
        {
            "title": "Taking Stock: Market logs best weekly gain in last 4 years; Nifty crosses 23,400",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-market-logs-best-weekly-gain-in-last-4-years-nifty-crosses-23-400-12971664.html",
            "description": "For the week, Sensex and Nifty rose more than 4 percent each, logging the best weekly gain in last four years.",
            "pubDate": "2025-03-21T11:32:52.808481"
        },
        {
            "title": "L&T shares surge 3% as Brigade deal brings largest private residential project win",
            "link": "https://www.moneycontrol.com/news/business/markets/l-t-shares-surge-3-as-brigade-deal-brings-largest-private-residential-project-win-12971805.html",
            "description": "L&T share price: In Hyderabad’s Kokapet area, L&T will build Brigade Gateway Residences, featuring two luxury towers, including one of the city’s tallest buildings, standing at 57 floors above ground.",
            "pubDate": "2025-03-21T11:32:52.808568"
        },
        {
            "title": "Live: Nifty shines every day this week, rises 4.2% | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-shines-every-day-this-week-rises-4-2-closing-bell-12971814.html",
            "description": "Markets gain for fifth straight day. Nifty fares best this week in 4 yrs. Nifty, sensex rise 4% this week. Nifty above 23,350; sensex rises 550 pts\nNifty realty best performer this week. All sectors happy in green this week. Midcap, smallcap indices outperform. Nifty midcap, smallcap up 8% this week\nNifty 50 gainers: bpcl, ongc, coal india. Nifty 50 losers: hindalco, trent, indusind bankCatch Lovisha Darad in conversation with Yatin Mota as they discuss stocks on their radar. \n#stockmarket #sharemarket #bse #nse",
            "pubDate": "2025-03-21T11:32:52.808654"
        },
        {
            "title": "TVS, Bajaj, others two-wheeler shares rise up to 4% on CLSA's bullish note showing demand for premium bikes",
            "link": "https://www.moneycontrol.com/news/business/markets/tvs-bajaj-others-two-wheeler-shares-rise-up-to-4-on-clsa-s-bullish-note-showing-demand-for-premium-bikes-12971673.html",
            "description": "CLSA said that overall motorcycle volumes increased 5 percent on-year so far in FY25, but the entry-level segment saw a decline of nearly 11 percent, and premium segment rose 8 percent on-year.",
            "pubDate": "2025-03-21T11:32:52.808740"
        },
        {
            "title": "YES Research maintains 'neutral' rating on Tata Steel, raises target price",
            "link": "https://www.moneycontrol.com/news/business/stocks/yes-research-maintains-neutral-rating-on-tata-steel-raises-target-price-12971752.html",
            "description": "YES Research has raised its target price for Tata Steel to ₹168 from ₹145, citing robust domestic demand, ongoing capacity expansion, and a more favorable pricing environment as key drivers supporting the stock’s outlook.",
            "pubDate": "2025-03-21T11:32:52.808824"
        },
        {
            "title": "Ajanta Pharma shares gain 10%, hit six-week high on surging volumes",
            "link": "https://www.moneycontrol.com/news/business/markets/ajanta-pharma-shares-gain-10-hit-six-week-high-on-surging-volumes-12971702.html",
            "description": "Ajanta Pharma share price: The company reported an 11 percent rise in net profit for the December 2024 quarter, reaching Rs 233 crore, up from Rs 210 crore a year ago.",
            "pubDate": "2025-03-21T11:32:52.808906"
        },
        {
            "title": "Nirmal Bang's Rahul Arora bets HAL, BEML, Solar Industries are long-term defence plays",
            "link": "https://www.moneycontrol.com/news/business/markets/nirmal-bang-s-rahul-arora-bets-hal-beml-solar-industries-are-long-term-defence-plays-12972047.html",
            "description": "Strong order books, geopolitical shifts, and solid financial performance underpin Nirmal Bang Equities' conviction in these stocks.",
            "pubDate": "2025-03-21T13:41:43.944582"
        },
        {
            "title": "Best week in four years may be a setup for a possible fall on tariff deadline: Nirmal Bang's Rahul Arora",
            "link": "https://www.moneycontrol.com/news/business/markets/best-week-in-four-years-may-be-a-setup-for-a-possible-fall-on-tariff-deadline-nirmal-bang-s-rahul-arora-12972019.html",
            "description": "Nifty’s recent dip below 22,000 aligned with the widely-held expectation of the correction bottoming out. However, quarter-end NAV management, insurance flows and year-end portfolio adjustment could influence the trend, Rahul Arora said.",
            "pubDate": "2025-03-21T13:41:43.944674"
        },
        {
            "title": "Bulls Unstoppable: Nifty hits best weekly run in four years, Sensex logs strongest week since 2022",
            "link": "https://www.moneycontrol.com/news/business/markets/bulls-unstoppable-nifty-hits-best-weekly-run-in-four-years-sensex-logs-strongest-week-since-2022-12971927.html",
            "description": "Fueling the rally was a shift in foreign investor sentiment. After months of relentless selling, FIIs turned net buyers, encouraged by dovish signals from the U.S. Fed that hint at possible rate cuts this year.",
            "pubDate": "2025-03-21T13:41:43.944751"
        }
    ]
}