{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-30T05:47:50.626258",
    "items": [
        {
            "title": "Mahindra sets sight on renewable power, forms Ultrogen Hybren to focus on green energy and storage systems",
            "link": "https://www.moneycontrol.com/news/business/markets/mahindra-sets-sight-on-renewable-power-forms-ultrogen-hybren-to-focus-on-green-energy-and-storage-systems-12899828.html",
            "description": "Ultrogen Hybren will be a subsidiary of Mahindra Susten, a subsidiary of Mahindra Holdings (MHL), the company informed through an exchange filing on December 29. The company will aspire to be an Independent Power Producer (IPP).",
            "pubDate": "2024-12-30T02:31:46.203075"
        },
        {
            "title": "Uday Kotak says India Inc must 'go for growth' to fire up animal spirits, in year-end musing",
            "link": "https://www.moneycontrol.com/news/business/uday-kotak-wants-india-inc-to-go-for-growth-to-fire-up-animal-spirits-in-year-end-musing-12899848.html",
            "description": "Kotak Mahindra Bank founder shared a set of ten forward-looking priorities to guide for sustainable growth, and to seek global competitiveness. Uday Kotak's blueprint mentions the need for urgent focus on growth, by reigniting enterprise and the entrepreneurial 'animal spirits' to drive innovation and wealth creation.",
            "pubDate": "2024-12-30T03:31:04.456357"
        },
        {
            "title": "Jefferies' Greed & Fear note by Chris Wood tweaks long-only portfolio, brings back HDFC Bank, adds Siemens India",
            "link": "https://www.moneycontrol.com/news/business/markets/jefferies-greed-fear-note-by-chris-wood-tweaks-long-only-portfolio-brings-back-hdfc-bank-adds-siemens-india-12899933.html",
            "description": "In the India long-only portfolio, Siemens will be introduced with a 4% weight by removing AU SFB, and investment in HDFC Bank will be raised by one percentage point by trimming Axis Bank, said the Jefferies note.",
            "pubDate": "2024-12-30T05:47:50.108107"
        }
    ]
}