{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-03T17:48:06.971944",
    "items": [
        {
            "title": "Buy Supriya Lifescience; target of Rs 843: Deven Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-supriya-lifescience-target-of-rs-843-deven-choksey-13089231.html",
            "description": "Deven Choksey is bullish on Supriya Lifescience has recommended buy rating on the stock with a target price of Rs 843 in its research report dated May 02, 2025.",
            "pubDate": "2025-06-03T04:44:43.218852"
        },
        {
            "title": "Eternal shares rise 2% as Morgan Stanley reaffirms top pick, sees 32% upside on strong growth potential",
            "link": "https://www.moneycontrol.com/news/business/markets/eternal-shares-rise-2-as-morgan-stanley-reaffirms-top-pick-sees-32-upside-on-strong-growth-potential-13088920.html",
            "description": "Eternal share price: The financials are forecast to improve sharply, with adjusted EBITDA expected to climb to Rs 6,548 crore in FY28.",
            "pubDate": "2025-06-03T04:44:43.218943"
        },
        {
            "title": "Swiggy shares rise 3% as Morgan Stanley initiates coverage with 'overweight' rating; sees 22% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/swiggy-shares-rise-3-as-morgan-stanley-initiates-coverage-with-overweight-rating-sees-22-upside-13088812.html",
            "description": "Swiggy share price: Any lapse in Swiggy’s execution could erode its market share across both food delivery and quick commerce segments, Morgan Stanley said in a note.",
            "pubDate": "2025-06-03T04:44:43.219018"
        },
        {
            "title": "Sensex down 400 pts, Nifty below 24,650 as bank, IT stocks fall; mid, smallcaps shine",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-down-400-pts-nifty-below-24-650-as-bank-it-stocks-fall-mid-smallcaps-shine-13088678.html",
            "description": "India VIX, the barometer to assess market anxiety, jumped 1.5 percent to 17.42, reflecting increased market volatility.",
            "pubDate": "2025-06-03T04:44:43.219093"
        },
        {
            "title": "Mrs Bectors Food Specialities: Will it resume industry leading earnings growth?",
            "link": "https://www.moneycontrol.com/news/business/stocks/mrs-bectors-food-specialities-will-it-resume-industry-leading-earnings-growth-13089023.html",
            "description": "MBFSL is accelerating new product launches (with a focus on premiumisation) which would remain the key growth driver",
            "pubDate": "2025-06-03T04:44:43.219164"
        },
        {
            "title": "IRCTC – Should you board a slow train?",
            "link": "https://www.moneycontrol.com/news/business/earnings/irctc-should-you-board-a-slow-train-13088797.html",
            "description": "Though uninspiring, the earnings trajectory is likely to be more predictable than many domestic companies",
            "pubDate": "2025-06-03T04:44:43.219234"
        },
        {
            "title": "Nifty Consolidates But Dip-Buying Keeps Sentiment Intact; Biocon, Aptus In Focus| Opening Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-consolidates-but-dip-buying-keeps-sentiment-intact-biocon-aptus-in-focus-opening-bell-live-13088684.html",
            "description": "The Nifty 50 showed a smart recovery of nearly 200 points from the day's low and closed with a moderate loss of 34 points on June 2, while defending the 24,700 levels on a closing basis, which is a positive sign. The index remains within the range of 24,500–25,000. According to experts, it is expected to remain choppy in the upcoming sessions. If the index decisively breaks below the lower range, the 24,380 level is one to watch. However, in case of a rebound, 24,900 is expected to act as a hurdle for the index. Global cues are positive this morning despite renewed trade tensions between US and China. The GIFT Nifty is hinting at a strong start for the Indian market. Aptus Value, Grasim, Adani Group stocks will be in focus today. Catch Nandita Khemka in conversation with Nirav Chheda - Assistant Vice President, Equity Derivatives & Technical Research- Retail, Nirmal Bang and Sandeep Bagla, CEO, TRUST Mutual Fund.",
            "pubDate": "2025-06-03T04:44:43.219306"
        },
        {
            "title": "Chart of the Day: The transformation at dairy companies",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-the-transformation-at-dairy-companies-13088654.html",
            "description": "Revenues from value-added products are rising faster than liquid milk sales",
            "pubDate": "2025-06-03T04:44:43.219375"
        },
        {
            "title": "Sensex, Nifty eye strong open after two-day slide; Key levels to track on June 3",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-eye-strong-open-after-two-day-slide-key-levels-to-track-on-june-3-13088513.html",
            "description": "Indian equities ended slightly lower in the previous session, giving up earlier gains as selling pressure returned in the final hour of trade.",
            "pubDate": "2025-06-03T04:44:43.219441"
        },
        {
            "title": "Stocks to Watch Today: HCL Technologies, Zinka Logistics, Biocon, Torrent Power, Jindal Stainless, Frontier Springs, Prostarm Info Systems in focus on 3 June",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hcl-technologies-zinka-logistics-biocon-torrent-power-jindal-stainless-frontier-springs-prostarm-info-systems-in-focus-on-3-june-13088464.html",
            "description": "Stocks to Watch Today, 3 Jun: Stocks like Zinka Logistics Solutions, HCL Technologies, Biocon, Torrent Power, Jindal Stainless, Frontier Springs, Apeejay Surrendra Park Hotels, Transrail Lighting, Kerala Ayurveda, Emcure Pharmaceuticals, UCO Bank, AU Small Finance Bank, and Prostarm Info Systems will be in focus on June 3.",
            "pubDate": "2025-06-03T04:44:43.219509"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex dips 230 pts, Nifty at 24,650; FMCG, IT, banks under pressure",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-03-06-2025-liveblog-13088454.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Shriram Finance, Hindalco, Eternal, HCL Tech, Titan Company were among major gainers on the Nifty, while losers were Adani Enterpris es, Adani Ports, L&T, HDFC Life, ICICI Bank. BSE Midcap index up 0.2 percent and smalllcap index up 0.5 percent. Among sectors, metal index up 0.5 percent, while private bank index down 0.5 percent.",
            "pubDate": "2025-06-03T04:44:43.219575"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-105-13085751.html",
            "description": "The Foreign institutional investors (FIIs) extended their selling on second consecutive session on June 2 as they sold equities worth Rs 2,589 crore, while Domestic institutional investors (DIIs) extended their buying on tenth day as they bought equities of Rs 5,313 crore on the same day.",
            "pubDate": "2025-06-03T04:44:43.219642"
        },
        {
            "title": "Trade Spotlight: How should you trade PNB, Swiggy, Bank of India, Adani Ports, CDSL, Canara Bank, NBCC, Bharti Airtel and others on June 3?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-pnb-swiggy-bank-of-india-adani-ports-cdsl-canara-bank-nbcc-bharti-airtel-and-others-on-june-3-13088313.html",
            "description": "The market may turn positive amid rangebound trading. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-06-03T04:44:43.219711"
        },
        {
            "title": "Block deal worth Rs 825 crore in Alkem Labs may see 1.42 percent equity change hands",
            "link": "https://www.moneycontrol.com/news/business/markets/block-deal-worth-rs-825-crore-in-alkem-labs-may-see-1-42-percent-equity-change-hands-13092532.html",
            "description": "The transaction, valued at approximately Rs 825 crore, is likely to take place on June 4 at a floor price of Rs 4,850 per share, which is at a 3 percent discount to the last traded price.",
            "pubDate": "2025-06-03T17:47:52.929817"
        },
        {
            "title": "United Spirits shares jump 2% after JPMorgan upgrades stock to 'Overweight', raises target price",
            "link": "https://www.moneycontrol.com/news/business/markets/united-spirits-shares-jump-2-after-jpmorgan-upgrades-stock-to-overweight-raises-target-price-13092318.html",
            "description": "United Spirits share price: The brokerage also hiked its target price for the stock to Rs 1,760 per share, implying an upside potential of over 11.5% from the stock's current market price of Rs 1,578 per share.",
            "pubDate": "2025-06-03T17:47:52.929902"
        },
        {
            "title": "SEBI streamlines and automates invocation and sale of pledged shares of defaulter clients",
            "link": "https://www.moneycontrol.com/news/business/markets/sebi-streamlines-and-automates-invocation-and-sale-of-pledged-shares-of-defaulter-clients-13092308.html",
            "description": "SEBI as part of Ease of Doing Business for brokers, had eased the process for sale of shares of defaulted clients and recover the money.",
            "pubDate": "2025-06-03T17:47:52.929970"
        },
        {
            "title": "BPCL, Indigo Paints, Apollo Tyres, other crude-sensitive stocks fall up to 2% as oil prices climb",
            "link": "https://www.moneycontrol.com/news/business/markets/bpcl-indigo-paints-apollo-tyres-other-crude-sensitive-stocks-fall-up-to-2-as-oil-prices-climb-13091758.html",
            "description": "Brent crude was inching towards $65 a barrel after OPEC+ agreed to increase production by 411,000 barrels per day, lower than expectations. Fresh escalations in Russia-Ukraine's war and rising tensions between US and Iran further boosted oil prices.",
            "pubDate": "2025-06-03T17:47:52.930037"
        },
        {
            "title": "Taking Stock: Nifty below 24,550, Sensex sheds over 600 pts as market extends losses for a third day",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-below-24-550-sensex-sheds-over-600-pts-as-market-extends-losses-for-a-third-day-13091204.html",
            "description": "Among broader indices, BSE Midcap shed 0.5 percent, while the smallcap index ended flat, while Nifty Bank slipped after hitting a record high of 56,161.",
            "pubDate": "2025-06-03T17:47:52.930103"
        },
        {
            "title": "Gainers & Losers: Top 10 stocks that moved the most on June 3",
            "link": "https://www.moneycontrol.com/news/photos/business/markets/gainers-losers-top-10-stocks-that-moved-the-most-on-june-3-13091328.html",
            "description": "At close, the Sensex was down 636.24 points or 0.78 percent at 80,737.51, and the Nifty was down 174.10 points or 0.70 percent at 24,542.50. About 1,701 shares advanced, 2,148 shares declined, and 134 shares remained unchanged.",
            "pubDate": "2025-06-03T17:47:52.930186"
        },
        {
            "title": "Nifty Drops Below 24,600 Marking Third Day of Losses| Nifty Bank Slips From Record|Closing Bell Live",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/nifty-drops-below-24-600-marking-third-day-of-losses-nifty-bank-slips-from-record-closing-bell-live-13091337.html",
            "description": "Markets fall for the third day in a row as Nifty slips below 24,600. Bank Nifty retreats after hitting a record high, while India VIX cools 4%. Midcap momentum fades, realty shines, but IT, FMCG, and autos lag. Nandita Khemka discusses the market mood with Angel One’s Aamar Deo Singh.",
            "pubDate": "2025-06-03T17:47:52.930258"
        },
        {
            "title": "Servotech Renewable shares surge 16% as Elon Musk's father Errol Musk visits India: Here's why",
            "link": "https://www.moneycontrol.com/news/business/markets/servotech-renewable-shares-surge-16-as-elon-musk-s-father-errol-musk-visits-india-here-s-why-13091343.html",
            "description": "Servotech Renewable share price: Errol Musk was appointed to the Global Advisory board of the NSE-listed smallcap company in May this year",
            "pubDate": "2025-06-03T17:47:52.930324"
        },
        {
            "title": "Sebi to soon decide on lenient delisting norms for PSUs with high promoter holding",
            "link": "https://www.moneycontrol.com/news/business/markets/sebi-to-soon-decide-on-lenient-delisting-norms-for-psus-with-high-promoter-holding-13090683.html",
            "description": "The Sebi board, scheduled to meet on June 18, is expected to take a final call on a separate voluntary delisting framework for PSUs that have a very high promoter holding – 90 percent or more to be precise.",
            "pubDate": "2025-06-03T17:47:52.931136"
        },
        {
            "title": "Pharma stocks consolidate after volatile May, but fresh triggers to drive next leg of rally",
            "link": "https://www.moneycontrol.com/news/business/stocks/pharma-stocks-consolidate-after-volatile-may-but-fresh-triggers-to-drive-next-leg-of-rally-13089806.html",
            "description": "Pharma stocks appear to be recalibrating, while in their current phase, they are reflecting  'consolidation'. Meanwhile, analysts suggest the sector’s earnings visibility remains clouded.",
            "pubDate": "2025-06-03T17:47:52.931206"
        },
        {
            "title": "Realty index extends gains for 2nd day on rate cut hopes; Sobha, Godrej Properties, others surge up to 6%",
            "link": "https://www.moneycontrol.com/news/business/markets/realty-index-extends-gains-for-2nd-day-on-rate-cut-hopes-sobha-godrej-properties-others-surge-up-to-6-13090387.html",
            "description": "A rate cut effectively reduces home loan EMIs for customers, which in turn boosts housing demand.",
            "pubDate": "2025-06-03T17:47:52.931273"
        },
        {
            "title": "Defence shares extend gains for 2nd day amid rising geopolitical tensions; Cochin Shipyard, BEML, others rally up to 5%",
            "link": "https://www.moneycontrol.com/news/business/markets/defence-shares-extend-gains-for-2nd-day-amid-rising-geopolitical-tensions-cochin-shipyard-beml-others-rally-up-to-5-13089949.html",
            "description": "On June 3, Nifty India Defence index was up 1.6 percent to hover around 8,833, thus bucking the downtrend in the overall market.",
            "pubDate": "2025-06-03T17:47:52.931469"
        }
    ]
}