{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-25T06:56:37.736583",
    "items": [
        {
            "title": "India Pesticides, Alkyl Amines shares drop up to 4% amid govt's anti-dumping measures",
            "link": "https://www.moneycontrol.com/news/business/markets/india-pesticides-alkyl-amines-shares-drop-up-to-4-amid-govt-s-anti-dumping-measures-12974713.html",
            "description": "So far this year, shares of India Pesticides, Insecticides India, and Alkyl Amines have declined by as much as 20 percent",
            "pubDate": "2025-03-25T06:55:16.473226"
        },
        {
            "title": "Zomato, Swiggy shares dive up to 39% in 2025, Macquarie 'cautious' on quick commerce but prefers dineout plays",
            "link": "https://www.moneycontrol.com/news/business/markets/zomato-swiggy-shares-dive-up-to-39-in-2025-macquarie-cautious-on-quick-commerce-but-prefers-dineout-plays-12974715.html",
            "description": "Shares of Zomato and Swiggy were sharply lower amid buzz of quick commerce rival Zepto's $250 million secondary sale ahead of IPO, and a cautious note by Macquarie.",
            "pubDate": "2025-03-25T06:55:16.473310"
        },
        {
            "title": "HCL Tech shares jump 3% after firm becomes Western Union's 'largest preferred partner'",
            "link": "https://www.moneycontrol.com/news/business/markets/hcl-tech-shares-jump-3-after-firm-becomes-western-union-s-largest-preferred-partner-12974572.html",
            "description": "HCL Tech and Western Union will set up a new India-based technology center in Hyderabad.",
            "pubDate": "2025-03-25T06:55:16.473386"
        },
        {
            "title": "Bank Nifty rises for 9th straight day, crosses 52,000-mark as RBI changes PSL norms",
            "link": "https://www.moneycontrol.com/news/business/markets/bank-nifty-rises-for-9th-straight-day-crosses-52-000-mark-as-rbi-changes-psl-norms-12974594.html",
            "description": "To strengthen credit availability across key sectors, the revised PSL norms will introduce higher loan limits, expand eligibility criteria, and set increased lending targets for banks",
            "pubDate": "2025-03-25T06:55:16.473456"
        },
        {
            "title": "Infosys shares rise nearly 3% despite Jefferies' 15% target price cut",
            "link": "https://www.moneycontrol.com/news/business/markets/infosys-shares-rise-nearly-3-despite-jefferies-15-target-price-cut-12974595.html",
            "description": "Infosys share price: However, Jefferies believes the risk of a valuation downgrade is limited, citing strong free cash flow conversion and improved payouts.",
            "pubDate": "2025-03-25T06:55:16.473589"
        },
        {
            "title": "Ace investor Madhu Kela's latest smallcap bet - SG Finserve shares hit 20% upper circuit",
            "link": "https://www.moneycontrol.com/news/business/markets/ace-investor-madhu-kela-s-latest-smallcap-bet-sg-finserve-shares-hit-20-upper-circuit-12974536.html",
            "description": "SG Finserve, a technology-driven NBFC registered with the RBI, specialises in business financing solutions",
            "pubDate": "2025-03-25T06:55:16.473721"
        },
        {
            "title": "Apeejay Surrendra Park Hotels: Does the correction offer an opportunity to check into this hotel stock?",
            "link": "https://www.moneycontrol.com/news/business/stocks/apeejay-surrendra-park-hotels-does-the-correction-offer-an-opportunity-to-check-into-this-hotel-stock-12974563.html",
            "description": "The hotelier is poised for pricing growth as it commands industry-leading occupancy levels while its balance sheet remains strong",
            "pubDate": "2025-03-25T06:55:16.473788"
        },
        {
            "title": "Selloff in leading shares of drugmakers after Trump hints at tariffs on pharma imports",
            "link": "https://www.moneycontrol.com/news/business/markets/selloff-in-leading-pharma-shares-after-trump-hints-at-tariffs-on-pharma-imports-12974499.html",
            "description": "Currently, US charges nearly zero duties on pharmaceutical imports. India on the other hand imposes around 10 percent tax on pharma imports from US.",
            "pubDate": "2025-03-25T06:55:16.473854"
        },
        {
            "title": "Garden Reach Shipbuilders' stock up 5% on deal with German firm for two multi-purpose vessels",
            "link": "https://www.moneycontrol.com/news/business/markets/garden-reach-shipbuilders-stock-up-5-on-deal-with-german-firm-for-two-multi-purpose-vessels-12974458.html",
            "description": "Garden Reach share price: With this latest deal, GRSE's total order for these vessels remains valued at approximately $108 million, with no changes in financial terms.",
            "pubDate": "2025-03-25T06:55:16.473937"
        },
        {
            "title": "Nifty pauses after a six-day rally to slip below 23,700, Sensex off day's high on profit booking",
            "link": "https://www.moneycontrol.com/news/business/markets/markets-rise-for-7th-day-sensex-jumps-500-pts-nifty-near-23-800-as-it-stocks-surge-12974472.html",
            "description": "The broader market traded in the red, with the Nifty Midcap 100 and Smallcap 100 slipping 0.89 and 1.19 percent, respectively.",
            "pubDate": "2025-03-25T06:55:16.474005"
        },
        {
            "title": "What do leading monsoon indicators suggest for this season?",
            "link": "https://www.moneycontrol.com/news/business/markets/what-do-leading-monsoon-indicators-suggest-for-this-season-12974456.html",
            "description": "Most forecasts indicate a low likelihood of an El Niño phase in the next three to five months, which should be good for the rural economy",
            "pubDate": "2025-03-25T06:55:16.474077"
        },
        {
            "title": "Agri Picks Report March 25, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-25-2025-geojit-financial-services-12974484.html",
            "description": "According to Geojit Financial Services, The National Agricultural Cooperative Marketing Federation procured 864.7 tonnes of mustard as of Thursday, or 0.06% of the total 1.5 million tonnes it aims to buy during the 2024-25 (Jul-Jun) rabi season under the price support scheme.",
            "pubDate": "2025-03-25T06:55:16.474144"
        },
        {
            "title": "Live: Nifty At 2-Month High; Will It Re-test 23,800?| Mark Matthews On Tariff Tantrums| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-at-2-month-high-will-it-re-test-23-800-mark-matthews-on-tariff-tantrums-opening-bell-12974417.html",
            "description": "The benchmark Nifty 50 jumped more than 1 percent to hit nearly a seven-week high after a gap-up opening on March 24, continuing its northward journey for the sixth consecutive session as bulls remained in strong form with consistent buying interest from FIIs. The index made a good start to the week and is now just 150 points away from its previous swing high of 23,800, which is a crucial zone for further upward movement. If the index decisively surpasses this zone, it can negate the lower highs-lower lows formation and open doors for the 24,000 and 24,200 levels. This morning GIFT Nifty is hinting at another positive start asnd overnight Wall Street saw a strong rally. Among stocks to watch – RVNL, GRSE, Cement stocks and Suzlon will be in focus. Catch Nandita Khemka in conversation with Ajit Mishra--SVP, Technical Research, Religare Broking and Mark Matthews-- Head of Research, Asia, Julius Baer",
            "pubDate": "2025-03-25T06:55:16.474210"
        },
        {
            "title": "Britannia shares slip as strike in Gujarat plant disrupts operations",
            "link": "https://www.moneycontrol.com/news/business/markets/britannia-shares-in-focus-as-strike-in-gujarat-plant-disrupts-operations-12974462.html",
            "description": "Britannia has stated that it is currently assessing the extent of the strike’s impact while leveraging its available resources to ensure minimal disruption to supply",
            "pubDate": "2025-03-25T06:55:16.474278"
        },
        {
            "title": "Chart of the Day | How Trump’s tariffs are changing IT companies’ demand outlook",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-how-trump-s-tariffs-are-changing-it-companies-demand-outlook-12974436.html",
            "description": "Tariffs are not expected to uniformly affect all business segments of IT companies",
            "pubDate": "2025-03-25T06:55:16.474345"
        },
        {
            "title": "Sensex, Nifty eye seventh straight gain: Key levels to watch today",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-eye-seventh-straight-gain-key-levels-to-watch-today-12974416.html",
            "description": "Global uncertainties, including geopolitical tensions and tariff-related disruptions, remain key risks. Going forward, the market’s trajectory will depend on a sustained recovery in domestic consumption and resilient corporate earnings.",
            "pubDate": "2025-03-25T06:55:16.474410"
        },
        {
            "title": "UBS upgrades UltraTech Cement, Dalmia Bharat, Ambuja Cement to 'buy', shares jump up to 3%",
            "link": "https://www.moneycontrol.com/news/business/stocks/ubs-upgrades-ultratech-cement-dalmia-bharat-ambuja-cement-to-buy-sees-strong-demand-recovery-ahead-12974433.html",
            "description": "UBS sees structural cost savings, price stabilization, and sector consolidation driving a strong rebound for cement players, such as ACC, Ambuja Cement and Dalmia Bharat in FY26.",
            "pubDate": "2025-03-25T06:55:16.474474"
        },
        {
            "title": "RNVL shares gain on emerging lowest bidder for a contract of Rs 115 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/rnvl-shares-in-focus-on-emerging-lowest-bidder-for-a-contract-of-rs-115-crore-12974115.html",
            "description": "Rail Vikas Nigam share price | The share touched a 52-week high of Rs 647.00 and a 52-week low of Rs 220.00 on 15 July, 2024 and 15 April, 2024, respectively. The share price rose more than 42 percent in last one-year.",
            "pubDate": "2025-03-25T06:55:16.474598"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty erase gains, trade flat; UltraTech Cement, Trent, HDFC Bank top gainers",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-25-03-2025-liveblog-12974403.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Among the sectors, except IT and bank all other sectoral indices are trading in the red. UltraTech Cement, Trent, Bajaj Finserv, HDFC Bank, HCL Technologies are among major gainers on the Nifty, while losers are IndusInd Bank, Dr Reddy's Labs, Hindalco Industries, Shriram Finance, Bajaj Auto. BSE Midcap and Smallcap indices down 1 percent each.",
            "pubDate": "2025-03-25T06:55:16.474660"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-71-12973460.html",
            "description": "The Foreign institutional investors (FIIs) extended their buying on third day on March 24 as they purchased equities worth Rs 3,055.76 crore, while Domestic institutional investors (DIIs) bought equities of Rs 98.5 crore, on the same day.",
            "pubDate": "2025-03-25T06:55:16.474723"
        },
        {
            "title": "Trade Spotlight: How should you trade HCL Tech, Shree Cement, Asian Paints, Nykaa, Bharti Airtel, Samvardhana Motherson, and others on March 25?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-hcl-tech-shree-cement-asian-paints-nykaa-bharti-airtel-samvardhana-motherson-and-others-on-march-25-12974382.html",
            "description": "The benchmark indices are likely to surpass their swing high of February in the upcoming sessions. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-25T06:55:16.474786"
        },
        {
            "title": "Stocks to Watch Today: HCL Tech, EaseMyTrip, SG Finserve, GNFC, SEAMEC, Garden Reach Shipbuilders, RVNL, Restaurant Brands Asia in focus on 25 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hcl-tech-easemytrip-sg-finserve-gnfc-seamec-garden-reach-shipbuilders-rvnl-restaurant-brands-asia-in-focus-on-25-march-12974377.html",
            "description": "Stocks to Watch, Mar 25: Stocks like HCL Technologies, Central Bank of India, Punjab & Sind Bank, UCO Bank, Gujarat Narmada Valley Fertilizers & Chemicals, Brigade Enterprises, Wipro, TTK Prestige, Sterling and Wilson Renewable Energy, Hyundai Motor India, Cholamandalam Investment and Finance Company, and Britannia Industries will be in focus on March 25.",
            "pubDate": "2025-03-25T06:55:16.474854"
        }
    ]
}