{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-24T04:17:44.291563",
    "items": [
        {
            "title": "Indo Farm Equipment sets price band of Rs 204-215 a share for IPO",
            "link": "https://www.moneycontrol.com/news/business/ipo/indo-farm-equipment-sets-price-band-of-rs-204-215-a-share-for-ipo-12896558.html",
            "description": "The proceeds from the fresh issue will be used to establish a dedicated manufacturing unit to expand the production capacity of Pick & Carry Cranes.",
            "pubDate": "2024-12-24T02:29:30.194521"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat start; US markets gain, Asia trades mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-24-12-2024-liveblog-12896528.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street's main indexes all ended higher on Monday, with both the Dow Jones Industrial Average and the Nasdaq Composite making it three straight wins, aided by gains by many of the so-called Magnificent Seven tech stocks on a holiday-thinned trading day. The S&P 500 gained 43.22 points, or 0.73%, to 5,974.07 points, and the Nasdaq Composite rose 192.29 points, or 0.98%, to 19,764.89. The Dow Jones Industrial Average climbed 66.69 points, or 0.16%, to 42,906.95.",
            "pubDate": "2024-12-24T02:29:30.194620"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-16-12896153.html",
            "description": "The GIFT Nifty is indicating a muted start for the day.",
            "pubDate": "2024-12-24T02:29:30.194697"
        },
        {
            "title": "Trade Spotlight: How should you trade Chennai Petroleum, Devyani International, Dabur, Coromandel, Star Cement, and others on Tuesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-chennai-petroleum-devyani-international-dabur-coromandel-star-cement-and-others-on-tuesday-12896512.html",
            "description": "The market may extend its gains amid likely volatility, but it remains within last Friday's range. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-24T02:29:30.194767"
        },
        {
            "title": "Stock Radar: HG Infra Engineering, PG Electroplast, Ramky Infra, MIC Electronics, Bharat Forge, NACDAC Infra in focus on 24 December",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hg-infra-engineering-pg-electroplast-ramky-infra-mic-electronics-bharat-forge-in-focus-on-24-december-12896506.html",
            "description": "Stocks To Watch, Dec 24: Stocks like Whirlpool of India, MMTC, TVS Motor Company, TVS Holdings, Kirloskar Brothers, SPML Infra, Allcargo Gati, Symphony, Nava, and Indian Bank will also be in focus on December 24.",
            "pubDate": "2024-12-24T02:29:30.194838"
        },
        {
            "title": "Bulk deals : Ashish Chugh buys 5 lakh shares in Avonmore Capital",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-deals-rakam-infra-sells-stake-in-avonmore-capital-re-12896504.html",
            "description": "On the selling side, Rakam Infrastructures Private Limited sold 95.27 lakh shares of Avonmore Capital (RE) at an average price of Rs 3.51, while Innovative Money Matters Private Limited offloaded 1.35 crore shares at an average price of Rs 3.5.",
            "pubDate": "2024-12-24T02:29:30.194909"
        },
        {
            "title": "Nifty, Sensex flat as year-end volumes dry up, metals and infra under pressure",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-flat-as-year-end-volumes-dry-up-metals-and-infra-under-pressure-12896587.html",
            "description": "The broader market, represented by the mid-small cap stocks, expressed weak trends. While the midcap 100 index fell 0.3 percent, the smallcap 100 index slipped 0.2 percent to extend the fall for a second trading session in a row.",
            "pubDate": "2024-12-24T04:17:42.503299"
        },
        {
            "title": "Strong indigenisation push spur optimism for defence cos despite valuation concerns",
            "link": "https://www.moneycontrol.com/news/business/stocks/strong-indegenisation-push-spur-optimism-for-defence-cos-despite-valuation-concerns-12896581.html",
            "description": "Nuvama forecasts significant growth for the defence sector, forecasting $130 billion in spending for the sector over the next five years.",
            "pubDate": "2024-12-24T04:17:42.503388"
        },
        {
            "title": "Stock of the Day| Prudent Corporate Advisory| Is it the right time to invest in this stock?",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/stock-of-the-day-prudent-corporate-advisory-is-it-the-right-time-to-invest-in-this-stock-12896638.html",
            "description": "Prudent is the second largest MF distributor after NJ India among the non-banks in terms of commission earned in FY24. If we consider the entire universe of MF distributors including banks, Prudent is the fourth largest. Being a mutual fund distributor, Prudent has benefitted from the robust growth seen in the MF industry.\n\nPrudent draws over 80% of its revenue through distribution of mutual funds. Prudent’s revenues and net profit have grown by CAGR (compounded annual growth rate) of 29% and 46% respectively over the past 5 years (FY19-24).  The net profit growth has been on the back of rise in AUM (asset under management) to Rs 107,000 crore as at end September. Along with healthy inflows, the growth in AUM was led by marked to market (M2M) gains as markets witnessed a strong broad-based rally.",
            "pubDate": "2024-12-24T04:17:42.503463"
        }
    ]
}