{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-17T15:53:34.361615",
    "items": [
        {
            "title": "LTI Mindtree shares fall 5% as Citigroup plans to slash external IT contractors to 20% from 50%",
            "link": "https://www.moneycontrol.com/news/business/stocks/lti-mindtree-shares-fall-5-as-citigroup-plans-to-slash-external-it-contractors-to-20-from-50-12966316.html",
            "description": "The New York-headquartered Citi Group planning to reduce external dependence and increase its internal resources comes as US President Donald Trump continues to promote the 'America First' policy and impose harsh tariffs on imports.",
            "pubDate": "2025-03-17T07:23:53.557580"
        },
        {
            "title": "UNO Minda, Amara Raja, Kaynes shares rise as PM Modi mentions need to 'restore' ties with China",
            "link": "https://www.moneycontrol.com/news/business/stocks/uno-minda-amara-raja-kaynes-shares-rise-as-pm-modi-mentions-need-to-restore-ties-with-china-12966240.html",
            "description": "\"Our relationship should remain just as strong in the future. It should continue to grow. Of course, differences are natural,\" PM Modi said about India-China tensions during the Lex Fridman podcast.",
            "pubDate": "2025-03-17T07:23:53.557733"
        },
        {
            "title": "Chart of the Day: The luxury housing boom",
            "link": "https://www.moneycontrol.com/news/business/markets/chart-of-the-day-the-luxury-housing-boom-12966267.html",
            "description": "High and Ultra High Net Worth Individuals are seeking to diversify their investments by parking their money in luxury real estate.",
            "pubDate": "2025-03-17T07:23:53.557868"
        },
        {
            "title": "SpiceJet shares jump 6% after airline announces fresh infusion of Rs 294 crore by promoter group",
            "link": "https://www.moneycontrol.com/news/business/spicejet-shares-jump-6-after-airline-announces-fresh-infusion-of-rs-294-crore-by-promoter-group-12966207.html",
            "description": "SpiceJet CEO Ajay Singh will dispose up to 3.15 crore equity shares of the company to help Spice Healthcare partially fund the allotment of equity shares through the conversion of warrants.",
            "pubDate": "2025-03-17T07:23:53.557934"
        },
        {
            "title": "SAMHI Hotels: Why is this hotel stock poised for re-rating?",
            "link": "https://www.moneycontrol.com/news/business/stocks/samhi-hotels-why-is-this-hotel-stock-poised-for-re-rating-12966176.html",
            "description": "After the strengthening of the balance sheet as well as the turnaround in operations post the Initial Public offer (IPO) in September 2023, SAMHI is now set to add/renovate inventory to boost growth.",
            "pubDate": "2025-03-17T07:23:53.557999"
        },
        {
            "title": "Rites: Consistency of new orders is a key factor to watch",
            "link": "https://www.moneycontrol.com/news/business/earnings/rites-consistency-of-new-orders-is-a-key-factor-to-watch-12966037.html",
            "description": "Margins on a declining trend due to a slowdown in execution and project delays",
            "pubDate": "2025-03-17T07:23:53.558066"
        },
        {
            "title": "HSBC upgrades Tata Motors to 'Buy', reduces target price to Rs 840/share",
            "link": "https://www.moneycontrol.com/news/business/stocks/hsbc-upgrades-tata-motors-to-buy-reduces-target-price-to-rs-840-share-12966036.html",
            "description": "Reduction in discounts and warranty costs at JLR is expected to drive margin expansion, supporting a potential re-rating of Tata Motors.",
            "pubDate": "2025-03-17T07:23:53.558133"
        },
        {
            "title": "Goldman Sachs sees rising competition amid cable and wire sector's growing attractiveness",
            "link": "https://www.moneycontrol.com/news/business/stocks/goldman-sachs-sees-rising-competition-amid-cable-and-wire-sector-s-growing-attractiveness-12966015.html",
            "description": "The brokerage has downgraded Polycab to 'Neutral', with a revised target price of Rs 5,005 from Rs 6,510 per share, while KEI Industries' is still on 'Neutral' but the target price has been slashed down to Rs 3,130 from Rs 3,780 per share.",
            "pubDate": "2025-03-17T07:23:53.558241"
        },
        {
            "title": "Live: US Fed rate decision, Trump's tariff measures to guide markets this week | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-us-fed-rate-decision-trump-s-tariff-measures-to-guide-markets-this-week-opening-bell-12966027.html",
            "description": "Nifty ended the last session below 22,400, breaking the 22,450 level, it had defended for five sessions, and slipped nearly 1% over the past week, with 35 of its 50 stocks closing in the red. However, Bank Nifty managed to stay above 48,000. This week, market movements will be influenced by the US Fed, FII activity, and tariff uncertainties. Meanwhile, the Aris Infra IPO is set to launch from March 20-25, though its price band has yet to be announced. This morning, global cues were mixed. US markets ended Friday overnight on a good note, but futures slipped overnight. Asian markets, meanwhile, started the day with good set of gains. Among stocks, watch out for IndusInd Bank, TCS, and Tata Motors in today's trading session. Catch Lovisha Darad in conversation with Kunal Rambhia—Fund Manager, The Streets (Technical) and Raj Vyas, VP - Research, Teji Mandi.",
            "pubDate": "2025-03-17T07:23:53.558308"
        },
        {
            "title": "Jefferies bites into Patanjali Foods, initiates coverage with 'buy' tag amid diversification",
            "link": "https://www.moneycontrol.com/news/business/stocks/jefferies-bites-into-patanjali-foods-initiates-coverage-with-buy-tag-amid-diversification-12966005.html",
            "description": "Jefferies expects Patanjali Foods to deliver high single-digit topline growth, coupled with margin expansion going ahead.",
            "pubDate": "2025-03-17T07:23:53.558374"
        },
        {
            "title": "IndusInd Bank shares jump 3% as RBI says bank is 'well-capitalized'",
            "link": "https://www.moneycontrol.com/news/business/stocks/indusind-bank-shares-in-focus-as-rbi-says-bank-well-capitalized-12965982.html",
            "description": "The RBI's statement follows concerns arising from recent developments related to the discrepancies found in IndusInd Bank's derivatives portfolio.",
            "pubDate": "2025-03-17T07:23:53.558438"
        },
        {
            "title": "KEC International shares gain more than 6% on orders win of Rs 1,267 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/kec-international-shares-in-focus-on-orders-win-of-rs-1-267-crore-12965885.html",
            "description": "KEC International Share Price | The Transmission & Distribution (T&D) business has secured NOAs/ Comfort letter for T&D projects in India and Americas including 800 kV HVDC & 765 kV Transmission line orders, from Power Grid Corporation of India.",
            "pubDate": "2025-03-17T07:23:53.558503"
        },
        {
            "title": "G R Infraprojects shares gain 2.4% on winning NHAI project worth Rs 4,262.78 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/g-r-infraprojects-shares-in-focus-on-winning-nhai-project-worth-rs-4-262-78-crore-12965886.html",
            "description": "G R Infraprojects Share Price | The company board of directors at its meeting held on March 7, 2025 declared the interim dividend of Rs 12.50 per equity share of face value of Rs 5 per equity share for the financial year 2024-25.",
            "pubDate": "2025-03-17T07:23:53.558566"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty off day's high; February WPI Inflation at 2.38%",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-17-03-2025-liveblog-12965964.html",
            "description": "Sensex Today | Stock Market LIVE Updates: BSE Midcap and smallcap indices up 0.5 percent each. Among sectors, except FMCG IT, all other sectoral indices are trading in the green with auto, metal, pharma up 0.5-1 percent. IndusInd Bank, HDFC Bank, BSE Limited, Bajaj Finserv, ICICI Bank are among most active shares on the NSE.",
            "pubDate": "2025-03-17T07:23:53.558644"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-65-12963931.html",
            "description": "Gold edged higher after rising through USD 3,000 an ounce on Friday, with investors weighing news the US government managed to avert a shutdown against persistent economic growth concerns. Oil prices rose for a second day thanks to the the stimulus pledge by the the world’s biggest importer.",
            "pubDate": "2025-03-17T07:23:53.558721"
        },
        {
            "title": "Trade Spotlight: How should you trade Gujarat Fluorochemicals, Bank of Baroda, United Spirits. EIH, Coromandel International, and others on March 17?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-gujarat-fluorochemicals-bank-of-baroda-united-spirits-eih-coromandel-international-and-others-on-march-17-12965947.html",
            "description": "The market might rebound in the upcoming sessions after a correction in the previous week, but there are doubts over the sustainability of the upmove. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-17T07:23:53.558787"
        },
        {
            "title": "Stocks to Watch Today: IndusInd Bank, Brigade, Maharashtra Seamless, GR Infraprojects, Shilpa Medicare, Alkem Labs, KEC International in focus on 17 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-indusind-bank-brigade-maharashtra-seamless-gr-infraprojects-shilpa-medicare-alkem-labs-kec-international-in-focus-on-17-march-12965943.html",
            "description": "Stocks to Watch on Mar 17: Stocks like Quality Power Electrical Equipments, Dr Reddy’s Laboratories, Tata Motors, Voltas, Tejas Networks, KPIT Technologies, Galaxy Surfactants, NTC Industries, 3M India, International Conveyors, Ksolves India, Zydus Lifesciences, and SpiceJet will be in focus on March 17.",
            "pubDate": "2025-03-17T07:23:53.558851"
        },
        {
            "title": "Nithin Kamath recalls Jerry Parker’s trading wisdom: Cut losses, let winners ride",
            "link": "https://www.moneycontrol.com/news/business/markets/nithin-kamath-recalls-jerry-parker-s-trading-wisdom-cut-losses-let-winners-ride-12967132.html",
            "description": "Markets are brutal, and when fear takes over, logic often takes a backseat. Parker’s rule? Cut your positions twice as fast as your losses.",
            "pubDate": "2025-03-17T14:43:44.308450"
        },
        {
            "title": "FII net sell shares worth Rs 4,488 crore, DIIs net buyers of Rs 6,000 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/fii-net-sell-shares-worth-rs-4-488-crore-diis-net-buyers-of-rs-6-000-crore-12967096.html",
            "description": "Nifty and Sensex held on to solid gains on March 17, setting the stage for a strong start to the week. A surge in pharma, auto, and banking stocks lifted sentiment, though mild weakness in IT and FMCG kept the rally from soaring.",
            "pubDate": "2025-03-17T14:43:44.308541"
        },
        {
            "title": "Shilpa Medicare’s arm partners with Swiss-based mAbTree Biologics for novel cancer therapy",
            "link": "https://www.moneycontrol.com/news/business/markets/shilpa-medicare-s-arm-partners-with-swiss-based-mabtree-biologics-for-novel-cancer-therapy-12967064.html",
            "description": "The therapy, a fully human monoclonal antibody, targets a newly identified immune checkpoint protein that could enhance T-cell activation and improve immune response against cancer.",
            "pubDate": "2025-03-17T14:43:44.308614"
        },
        {
            "title": "Birla Estates debuts in Pune market with luxury housing project, expects Rs 2,700-crore topline potential",
            "link": "https://www.moneycontrol.com/news/business/aditya-birla-real-estate-s-arm-launches-residential-project-in-pune-with-revenue-potential-of-rs-2-700-crore-12967058.html",
            "description": "'Birla Punya' will offer 1,000 apartments ranging from 1 BHK to 4 BHK across four towers in Central Pune (Sangamwadi).",
            "pubDate": "2025-03-17T14:43:44.308684"
        },
        {
            "title": "Ola Electric shares hit record low as subsidiary faces insolvency petition",
            "link": "https://www.moneycontrol.com/news/business/markets/ola-electric-shares-hit-record-low-as-subsidiary-faces-insolvency-petition-12967034.html",
            "description": "Ola Electric's vehicle registration service provider Rosmerta Digital Services Ltd has sought the initiation of insolvency proceedings against its wholly-owned arm Ola Electric Technologies Pvt Ltd.",
            "pubDate": "2025-03-17T14:43:44.308767"
        },
        {
            "title": "Centum Electronics shares surge 5% after firm raises Rs 210 crore via QIP",
            "link": "https://www.moneycontrol.com/news/business/stocks/centum-electronics-shares-surge-5-after-firm-raises-rs-210-crore-via-qip-12966915.html",
            "description": "Prashant Jain’s 3P India Equity Fund acquired 3.52 percent stake (over 5.17 lakh equity shares) in the company by participating in the QIP. This takes the firm’s total shareholding in the company to 5.47 percent.",
            "pubDate": "2025-03-17T14:43:44.308837"
        },
        {
            "title": "Shankar Sharma explains the colossal idiocy in the Nifty PE ratio",
            "link": "https://www.moneycontrol.com/news/opinion/the-colossal-idiocy-in-the-nifty-pe-ratio-12966885.html",
            "description": "'P/E of the Market' concept is absolute baloney. It fails miserably to stand up to any analytical and conceptual rigor. It is simply the dumbing down of what is a very complex science: to figure out what the true intrinsic value of any market, sector or stock is",
            "pubDate": "2025-03-17T14:43:44.308906"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on March 17",
            "link": "https://www.moneycontrol.com/news/business/stocks/top-gainers-and-losers-today-stocks-that-moved-the-most-on-march-17-12966834.html",
            "description": "Among the top performers on the Nifty were Bajaj Finserv, SBI Life Insurance, Dr. Reddy’s Labs, Trent, and Axis Bank, whereas Britannia, Hero MotoCorp, Wipro, BPCL, and Nestlé featured among the biggest losers.",
            "pubDate": "2025-03-17T14:43:44.308978"
        },
        {
            "title": "Infosys, TCS are better shielded from Trump's stricter policies, says Moody's",
            "link": "https://www.moneycontrol.com/news/business/markets/infosys-tcs-are-better-shielded-from-trump-s-stricter-policies-says-moody-s-12966827.html",
            "description": "Moody’s said companies in the automotive, steel, chemicals and business-services sectors in South and Southeast Asia are most exposed to evolving US policies, including the higher tariffs.",
            "pubDate": "2025-03-17T14:43:44.309045"
        },
        {
            "title": "Taking Stock: Nifty gains to end above 22,500 but breadth weak, smallcaps underperform",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-gains-to-end-above-22-500-but-breadth-weak-smallcaps-underperform-12966689.html",
            "description": "On the sectoral front, auto, bank, metal, power, pharma rose 0.5-1.5 percent, while realty, media were down 0.5 percent each. BSE Midcap index up 0.7 percent and smallcap index ended on flat note.",
            "pubDate": "2025-03-17T14:43:44.309116"
        },
        {
            "title": "Live: Nifty rebounds after two days, reclaims 22,500 | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-rebounds-after-two-days-reclaims-22-500-closing-bell-12966831.html",
            "description": "Nifty breaks two day slump, back above 22,500. Sensex recovers after 5 days, above 74,100. Midcap outperforms benchmark, smallcaps rise. Nifty Pharma index top sectoral performer. Bank Nifty extends gain to third day, above 48,350. Nifty FMCG extends loss to second day. Nifty IT index down for the 6th straight day. Catch Lovisha Darad in conversation with Ashish Bahety, Technical and Derivative Research Analyst.",
            "pubDate": "2025-03-17T14:43:44.309182"
        },
        {
            "title": "Metals surge up to 3% to snap two-day fall: What's behind the shine amid looming Trump tariffs?",
            "link": "https://www.moneycontrol.com/news/business/markets/metals-surge-up-to-3-to-snap-two-day-fall-what-s-behind-the-shine-amid-looming-trump-tariffs-12966681.html",
            "description": "APL Apollo Tubes was the top gainer on the index, rising nearly 3 percent to trade at Rs 1,414 per share. The stock has now strongly recovered after hitting a 52-week low of Rs 1,273 per share on February 17.",
            "pubDate": "2025-03-17T14:43:44.309248"
        },
        {
            "title": "Muthoot Finance shares rise nearly 5% as higher gold prices push gold loan assets to Rs 1 lakh crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/muthoot-finance-shares-rise-nearly-5-as-higher-gold-prices-push-gold-loan-assets-to-rs-1-lakh-crore-12966764.html",
            "description": "Options traders pile into Muthoot Finance calls, betting on further upside amid gold price rally.",
            "pubDate": "2025-03-17T14:43:44.309317"
        },
        {
            "title": "Citi revises call on GSPL to 'Buy' from 'Sell', target price implies 19% upside",
            "link": "https://www.moneycontrol.com/news/business/stocks/citi-revises-call-on-gspl-to-buy-from-sell-target-price-implies-19-upside-12966043.html",
            "description": "Citi has set the target price for GSPL at Rs 325, with a 19 percent increase from its previous target price.",
            "pubDate": "2025-03-17T14:43:44.309382"
        },
        {
            "title": "Sensex ends 350 pts higher, Nifty above 22,500; midcap index outperforms",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-slips-200-pts-from-day-s-high-nifty-below-22-500-mid-smallcap-indices-outperform-12966736.html",
            "description": "Among sectoral indices, Nifty Pharma was the top performer with gains of over 1.5 percent. Dr Reddy's and Cipla were the main drivers of the surge in today's session. Nifty Auto, Bank, Metal and Infra traded in a similar range of 0.7 percent each.",
            "pubDate": "2025-03-17T14:43:44.309449"
        },
        {
            "title": "HUDCO shares rise 3.5% as firm extends Rs 11,000-crore loan to build Andhra's Amaravati",
            "link": "https://www.moneycontrol.com/news/business/markets/hudco-shares-rise-3-5-as-firm-extends-rs-11-000-crore-loan-to-build-andhra-s-amaravati-12966647.html",
            "description": "The agreement was signed in the presence of Chief Minister N Chandrababu Naidu at his residence in Undavalli of Guntur district.",
            "pubDate": "2025-03-17T14:43:44.309644"
        },
        {
            "title": "HCC shares surge 4% after firm's JV with Tata Projects wins order worth Rs 2,191 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/hcc-shares-surge-4-after-firm-s-jv-with-tata-projects-wins-order-worth-rs-2-191-crore-12966169.html",
            "description": "The project would entail the construction of an 8.65 km-long corridor, including underground tunnels and stations, for Indore Metro.",
            "pubDate": "2025-03-17T14:43:44.309805"
        },
        {
            "title": "Citi gives 'Buy' rating for HPCL stock, sees up to 47% upside",
            "link": "https://www.moneycontrol.com/news/business/stocks/citi-gives-buy-rating-for-hpcl-stock-sees-up-to-47-upside-12966051.html",
            "description": "Citi notes that HPCL’s annual capital expenditure is unlikely to decline meaningfully from its current Rs 13,000-15,000 crore run rate",
            "pubDate": "2025-03-17T14:43:44.309875"
        },
        {
            "title": "S&P500, Dow Jones gain on better-than-expected February retail sales data; Nasdaq Composite under pressure",
            "link": "https://www.moneycontrol.com/news/business/markets/s-p500-dow-jones-gain-on-better-than-expected-february-retail-sales-data-nasdaq-composite-under-pressure-12967142.html",
            "description": "A key focus for investors was the latest retail sales data, which came in weaker than expected but not as dire as some feared.",
            "pubDate": "2025-03-17T15:53:33.745489"
        }
    ]
}