{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-16T06:46:12.134571",
    "items": [
        {
            "title": "PNC Infra shares in focus on winning projects worth Rs 4,630 crore from MSRDC",
            "link": "https://www.moneycontrol.com/news/business/stocks/pnc-infra-shares-in-focus-on-winning-projects-worth-rs-4630-crore-from-msrdc-12842742.html",
            "description": "PNC Infratech Share Price | Both the contracts are to be executed in 30 months.",
            "pubDate": "2024-10-16T02:22:22.277624"
        },
        {
            "title": "G R Infraprojects shares in focus on project win worth Rs 1,885.6 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/g-r-infraprojects-shares-in-focus-on-project-win-worth-rs-1885-6-crore-12842743.html",
            "description": "G R Infraprojects Share Price | The project is for construction of access-controlled Pune Ring Road in Pune district package PRR W5 from village Kalyan/Rathwade to village Shivare/Kusgaon Phase in the State of Maharashtra on EPC Mode.",
            "pubDate": "2024-10-16T02:22:22.277714"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a weak start; US, Asian markets fall",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-16-10-2024-liveblog-12842881.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed down on Tuesday, following world stocks lower as a weak sales forecast from chipmaker ASML (ASML.AS), opens new tab weighed on tech shares, while crude extended its slide due to easing supply worries and weakening demand. The Dow Jones Industrial Average fell 324.60 points, or 0.75%, to 42,740.62, the S&P 500 fell 44.54 points, or 0.76%, to 5,815.31 and the Nasdaq Composite fell 187.10 points, or 1.01%, to 18,315.59.",
            "pubDate": "2024-10-16T02:22:22.277792"
        },
        {
            "title": "First Tick: Top 10 global cues for todayŌĆÖs trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-58-12842367.html",
            "description": "The GIFT Nifty is indicating a weak start for the day.",
            "pubDate": "2024-10-16T02:22:22.277865"
        },
        {
            "title": "Stock Radar: Cochin Shipyard, PNC Infratech, Tembo Global, GR Infraprojects, Rallis India in focus on Wednesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-cochin-shipyard-pnc-infratech-tembo-global-gr-infraprojects-rallis-india-in-focus-on-wednesday-12842870.html",
            "description": "KEI Industries, Madhya Bharat Agro Products, Alok Industries, Capri Global Capital, Power Finance Corporation, RailTel Corporation of India, HFCL, and Oil and Natural Gas Corporation will also be in action on October 16.",
            "pubDate": "2024-10-16T02:22:22.277935"
        },
        {
            "title": "Hold HCL Technologies; target of Rs 1887: KR Choksey",
            "link": "https://www.moneycontrol.com/news/business/stocks/hold-hcl-technologies-target-of-rs-1887-kr-choksey-12842948.html",
            "description": "KR Choksey recommended hold rating on HCL Technologies with a target price of Rs 1887 in its research report dated October 15, 2024.",
            "pubDate": "2024-10-16T03:53:37.512819"
        },
        {
            "title": "Live: Will 25,000 hold as Nifty struggles for direction? Bajaj Auto Q2 today | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-25000-hold-as-nifty-struggles-for-direction-bajaj-auto-q2-today-opening-bell-12842941.html",
            "description": "Indian market reversed some of its previous day's gains and closed a third of a percent lower on October 15, but defended the 50-day EMA (Exponential Moving Average) with volatility at lower zones and a continuation of the higher highs formation. The Nifty 50 may continue to face hurdles in the 25,200-25,250 zone on the higher side; above this level, a strong rally can't be ruled out. Until then, consolidation is expected to continue, with immediate support at 25,000, followed by 24,900, according to experts. This morning global cues are negative and GIFT Nifty is hinting at lower start for the Nify. Among stocks to watch will be Bajaj Auto, Mphasis, L&T Tech and Cochin Shipyard. Catch Nandita Khemka in conversation with Vaishali Parekh, Vice President - Technical Research, Prabhudas Liladher and Sandeep Bagla, CEO, TRUST Mutual Fund.",
            "pubDate": "2024-10-16T03:53:37.512907"
        },
        {
            "title": "Agri Picks Report October 16, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-october-16-2024-geojit-financial-services-12842946.html",
            "description": "According to Geojit, The National Commodity and Derivatives Exchange Limited has decided to bring forward by one day the expiry of the October futures contract of crude sunflower oil.",
            "pubDate": "2024-10-16T03:53:37.512986"
        },
        {
            "title": "KEI Industries stock tanks 7% as margins contract in Q2",
            "link": "https://www.moneycontrol.com/news/business/markets/kei-industries-stock-tanks-7-as-margins-contract-in-q2-12842965.html",
            "description": "KEI Industries also revealed plans to raise up to Rs 2,000 crore through a Qualified Institutional Placement (QIP). However, the company did not specify how it intends to utilise the funds raised from this initiative.",
            "pubDate": "2024-10-16T04:44:45.203107"
        },
        {
            "title": "Check out these eleven stocks that made their debut in mutual fund portfolios in September",
            "link": "https://www.moneycontrol.com/news/business/mutual-funds/check-out-these-eleven-stocks-that-made-their-debut-in-mutual-fund-portfolios-in-september-12842957.html",
            "description": "Mutual funds added eleven new stocks to their portfolios in September, with Bajaj Housing Finance Ltd taking the lead. Funds acquired 11.29 crore shares of Bajaj Housing Finance, amounting to an investment of Rs 1,740 crore.",
            "pubDate": "2024-10-16T04:44:45.203196"
        },
        {
            "title": "Rallis India zooms 14% as all-round performance in Q2 lifts sentiment",
            "link": "https://www.moneycontrol.com/news/business/markets/rallis-india-zooms-14-as-all-round-performance-in-q2-lifts-sentiment-12842958.html",
            "description": "Rallis India credited its strong Q2 performance to robust domestic demand, supported by above-normal monsoons and improved commodity prices, alongside a volume recovery in international markets, despite continued pricing pressure.",
            "pubDate": "2024-10-16T04:44:45.203269"
        },
        {
            "title": "Capital appreciation and comfort: Millennials revitalise high-end real estate market",
            "link": "https://www.moneycontrol.com/news/opinion/capital-appreciation-and-comfort-millennials-revitalise-high-end-real-estate-market-12842961.html",
            "description": "JLL India reports that in the first nine months of 2024, the premium housing segment (Rs 3-5 crore) saw an impressive 107 percent year-on-year growth, while the luxury segment (priced above Rs 5 crore) grew by 96 percent.",
            "pubDate": "2024-10-16T04:44:45.203347"
        },
        {
            "title": "Brokerages see brighter days ahead for PVR Inox even as firm swings into red with Q2 loss",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerages-see-brighter-days-ahead-for-pvr-inox-even-as-firm-swings-into-red-with-q2-loss-12842937.html",
            "description": "Despite a weak Q2, Nuvama predicts a strong comeback for PVR Inox in Q3, potentially matching its record performance from Q2 of the previous fiscal, driven by a solid lineup of upcoming releases, perfectly times for the festive season.",
            "pubDate": "2024-10-16T04:44:45.203421"
        },
        {
            "title": "Buy HDFC Asset Management Company; target of Rs 5360: Prabhudas Lilladher",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-hdfc-asset-management-company-target-of-rs-5360-prabhudas-lilladher-12843023.html",
            "description": "Prabhudas Lilladher is bullish on HDFC Asset Management Company has recommended buy rating on the stock with a target price of Rs 5360 in its research report dated October 16, 2024.",
            "pubDate": "2024-10-16T05:20:20.011613"
        },
        {
            "title": "Cochin Shipyard slips 4% as OFS opens to sell 5% stake at a discount",
            "link": "https://www.moneycontrol.com/news/business/markets/cochin-shipyard-slips-4-as-ofs-opens-to-sell-5-stake-at-a-discount-12842998.html",
            "description": "Through the OFS, the government intends to pare stake in Cochin Shipyard at a floor price of Rs 1,540 per share, implying a discount of 7 percent from the previous closing level.",
            "pubDate": "2024-10-16T05:20:20.011695"
        },
        {
            "title": "Hold PVR Inox; target of Rs 1598: Prabhudas Lilladher",
            "link": "https://www.moneycontrol.com/news/business/stocks/hold-pvr-inox-target-of-rs-1598-prabhudas-lilladher-12843034.html",
            "description": "Prabhudas Lilladher recommended hold rating on PVR Inox with a target price of Rs 1598 in its research report dated October 15, 2024.",
            "pubDate": "2024-10-16T05:36:03.413758"
        },
        {
            "title": "Buy SJS Enterprises; target of Rs 1300: LKP Research",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-sjs-enterprises-target-of-rs-1300-lkp-research-12843050.html",
            "description": "LKP Research is bullish on SJS Enterprises has recommended buy rating on the stock with a target price of Rs 1300 in its research report dated October 16, 2024.",
            "pubDate": "2024-10-16T05:44:13.213648"
        },
        {
            "title": "Hold PVR Inox; target of Rs 1780: Sharekhan",
            "link": "https://www.moneycontrol.com/news/business/stocks/hold-pvr-inox-target-of-rs-1780-sharekhan-12843077.html",
            "description": "Sharekhan recommended Hold rating on PVR Inox with a target price of Rs 1780 in its research report dated October 15, 2024.",
            "pubDate": "2024-10-16T06:28:54.290917"
        },
        {
            "title": "Buy HDFC Life Insurance Company; target of Rs 870: Sharekhan",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-hdfc-life-insurance-company-target-of-rs-870-sharekhan-2-12843069.html",
            "description": "Sharekhan is bullish on HDFC Life Insurance Company has recommended buy rating on the stock with a target price of Rs 870 in its research report dated October 15, 2024.",
            "pubDate": "2024-10-16T06:28:54.291002"
        },
        {
            "title": "Buy PVR Inox; target of Rs 2250: ICICI Securities",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-pvr-inox-target-of-rs-2250-icici-securities-2-12843095.html",
            "description": "ICICI Securities is bullish on PVR Inox recommended buy rating on the stock with a target price of Rs 2250 in its research report dated October 16, 2024.",
            "pubDate": "2024-10-16T06:46:11.608037"
        }
    ]
}