{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-27T06:47:53.589124",
    "items": [
        {
            "title": "Nazara acquires another 10.26% in subsidiary Absolute Sports for Rs 72.73 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/nazara-acquires-another-10-26-in-subsidiary-absolute-sports-for-rs-72-73-crore-12898553.html",
            "description": "Nazara has a share purchase agreement (SPA), dated September 18, 2024 with subsidiary Absolute Sports and founding shareholders Porush Jain and Srinivas Cuddapah for the acquisition of 19.35% stake.",
            "pubDate": "2024-12-27T02:29:56.977834"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a gap-up start; US markets flat, Asia trades higher",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-27-12-2024-liveblog-12898541.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Wall Street closed mixed on Thursday and the U.S. benchmark Treasury yield eased after scaling the highest level since May in light, directionless post-Christmas trading. The Dow Jones Industrial Average edged up 0.07% to 43,325.80, the S&P 500 fell 0.04% to 6,037.59 and the Nasdaq Composite fell 0.05% to 20,020.357.",
            "pubDate": "2024-12-27T02:29:56.977950"
        },
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-2-12898003.html",
            "description": "Wall Street closed mixed on Thursday and the U.S. benchmark Treasury yield eased after scaling the highest level since May in light, directionless post-Christmas trading. The GIFT Nifty is trading higher, indicating a strong start for the day.",
            "pubDate": "2024-12-27T02:29:56.978077"
        },
        {
            "title": "Trade Spotlight: How should you trade InterGlobe Aviation, Sun Pharma, Himadri Speciality Chemical, Devyani International, and others on December 27?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-interglobe-aviation-sun-pharma-himadri-speciality-chemical-devyani-international-and-others-on-december-27-12898526.html",
            "description": "The benchmark Nifty 50 needs to break the rangebound trade to establish a firm direction for the January series starting on December 27. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-27T02:29:56.978174"
        },
        {
            "title": "Stocks to Watch Today: DAM Capital, Transrail Lighting, Mamata Machinery, Gensol, Power Mech, SKF India, Aarti Pharmalabs in focus on 27 December",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-dam-capital-transrail-lighting-mamata-machinery-gensol-power-mech-skf-india-aarti-pharmalabs-in-focus-on-27-december-12898493.html",
            "description": "Stocks To Watch Today, Dec 27: Stocks like IndusInd Bank, Gensol Engineering, NHPC, Gujarat Fluorochemicals, HMA Agro Industries, Dixon Technologies, RBL Bank, Dhani Services, Lemon Tree Hotels, EPACK Durable, One Mobikwik Systems, SG Mart, Sanathan Textiles, and Concord Enviro Systems will also be in focus on December 27.",
            "pubDate": "2024-12-27T02:29:56.978264"
        },
        {
            "title": "A defence stock with reasonable valuation",
            "link": "https://www.moneycontrol.com/news/business/earnings/a-defence-stock-with-reasonable-valuation-12898596.html",
            "description": "BEL could get rerated on the back of robust order book and earnings visibility",
            "pubDate": "2024-12-27T03:42:04.807847"
        },
        {
            "title": "Live: Is Nifty set to begin Jan series on a muted note? | IndusInd Bank, NHPC in focus |Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-is-nifty-set-to-begin-jan-series-on-a-muted-note-indusind-bank-nhpc-in-focus-opening-bell-12898601.html",
            "description": "Frontline indices Sensex and Nifty were largely unchanged in a volatile session on the day of December monthly expiry. India VIX, the volatility gauge jumped over 6 percent in the last session. Auto and pharma stocks lent support to overall market breadth, while metals and banks tanked. Experts now eye Nifty to see a resistance of 23,850 and support placed around 23,650. This morning, global cues were mixed. US markets ended flat overnight in a thin trade. Meanwhile, Asia-Pacific markets were also mixed this morning as investors assessed Japanese inflation print and China's industrial profit data. Among stocks in focus, watch out for IndusInd Bank, NHPC, Jubilant Foodworks. Catch Lovisha Darad in conversation with Raja Venkatraman, Co-Founder, NeoTrader & Trading Influencer and Nikhil Oswal, Founder and CIO, Finterest Capital.",
            "pubDate": "2024-12-27T03:42:04.807935"
        },
        {
            "title": "Sensex jumps 300 points, Nifty above 23,850 as bank, auto stocks rally",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-jumps-300-points-nifty-above-23-850-as-bank-auto-stocks-rally-12898600.html",
            "description": "The broader market showcased a decent start.  While the midcap index rose 0.2 percent, the smallcap index was up 0.3 percent",
            "pubDate": "2024-12-27T04:18:35.458084"
        },
        {
            "title": "Short call: Will markets stage sharp bounce back in 2025? All eyes on Q3; NTPC Green, Bajaj Auto in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/short-call-will-markets-stage-sharp-bounce-back-in-2025-all-eyes-on-q3-ntpc-green-bajaj-auto-in-focus-12898558.html",
            "description": "The individual investor should act consistently as an investor and not as a speculator.\" — Ben Graham",
            "pubDate": "2024-12-27T04:18:35.458186"
        },
        {
            "title": "Agri Picks Report December 27, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-27-2024-geojit-financial-services-12898649.html",
            "description": "According to Geojit Financial Services, The National Commodity and Derivatives Exchange on Monday said there would be a live trading session on Feb. 1 on account of the presentation of the Union Budget 2025-26 (Apr-Mar).",
            "pubDate": "2024-12-27T04:18:35.458260"
        },
        {
            "title": "Stock of the Day| HG Infra - Large projects in existing segments & entry into new segments",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/stock-of-the-day-hg-infra-large-projects-in-existing-segments-entry-into-new-segments-12898619.html",
            "description": "From being a sub-contractor undertaking road projects, HGIEL has evolved into becoming a leading contractor undertaking works for the national highway development. Not only is the company executing large expressway projects but it has been successful in diversifying into newer areas like railways and solar #HGIEL",
            "pubDate": "2024-12-27T05:08:50.426383"
        },
        {
            "title": "Top 10 PMSes in 2024; Incred Asset Management and Stallion Asset Managers at the top position",
            "link": "https://www.moneycontrol.com/news/photos/business/markets/top-10-pmses-in-2024-incred-asset-management-and-stallion-asset-managers-at-the-top-position-12898694.html",
            "description": "Among the top ones are Incred Asset Management's Healthcare Portfolio which has given returns of 70.58 percent in 2024",
            "pubDate": "2024-12-27T05:39:30.206437"
        },
        {
            "title": "Accumulate Petronet LNG; target of Rs 393: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-petronet-lng-target-of-rs-393-geojit-financial-services-12898718.html",
            "description": "Geojit Financial Services recommended accumulate rating on Petronet LNG with a target price of Rs 393 in its research report dated December 26, 2024.",
            "pubDate": "2024-12-27T05:39:30.206522"
        },
        {
            "title": "VA Tech Wabag enters Zambian market with Rs 700 crore water treatment project, stock surges 4%",
            "link": "https://www.moneycontrol.com/news/business/markets/va-tech-wabag-enters-zambian-market-with-rs-700-crore-water-treatment-project-stock-surges-4-12898672.html",
            "description": "VA Tech's order marks the company's entry into Zambia, and order will be executed over 36 months. VA Tech Wabag said this is one of Zambia’s largest and most advanced sanitation projects in recent decades.",
            "pubDate": "2024-12-27T05:39:30.206593"
        },
        {
            "title": "IndusInd Bank Quick Take: MFI loan auction, more pain in store?",
            "link": "https://www.moneycontrol.com/news/business/stocks/indusind-bank-quick-take-mfi-loan-auction-more-pain-in-store-12898722.html",
            "description": "While, prima facie, it appears a good move to lighten its bad assets’ burden it is not clear if all the pain has been addressed, given the relatively large microfinance loan book",
            "pubDate": "2024-12-27T06:37:08.935333"
        },
        {
            "title": "Mazagon Dock shares trade 2 percent lower following stock split",
            "link": "https://www.moneycontrol.com/news/business/stocks/mazagon-dock-shares-trade-2-percent-lower-following-stock-split-12898733.html",
            "description": "The fall in the stock prices comes following ex-date for 1:2 stock split today",
            "pubDate": "2024-12-27T06:47:52.396895"
        },
        {
            "title": "Defined stop loss, adapting new strategies; here's what F&O experts are advising for 2025",
            "link": "https://www.moneycontrol.com/news/business/markets/defined-stop-loss-adapting-new-strategies-here-s-what-f-o-experts-are-advising-for-2025-12898772.html",
            "description": "Considering index and equity options, defining stop losses, proper risk management for smaller contracts is required while trading in derivatives, say experts.",
            "pubDate": "2024-12-27T06:47:52.396983"
        }
    ]
}