{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-06T05:42:40.201743",
    "items": [
        {
            "title": "Live: Big IPOs, Q2 earnings season: Markets enter action-packed week | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-big-ipos-q2-earnings-season-markets-enter-action-packed-week-opening-bell-13598188.html",
            "description": "Markets enter a crucial week where the recent two-day Nifty upmove will be put to the test amid a flurry of key events. Two of the year’s biggest IPOs — Tata Capital and LG Electronics — are set to open for subscription, alongside the much-awaited WeWork IPO. On the earnings front, TCS will announce its second-quarter results, while HDFC Bank and Kotak Bank have already released their business updates. Meanwhile, the Bank Nifty heads into a four-day trading week after a strong recent run. This morning, global cues were largely higher. US markets ended Friday higher, while Asian markets were mixed this morning on Japan's potential prime minister news. Catch Lovisha Darad in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives) at Axis Securities and Sunil Subramaniam, Market Expert.",
            "pubDate": "2025-10-06T03:40:29.261079"
        },
        {
            "title": "CESC to turbocharge growth with renewable energy, execution is the key",
            "link": "https://www.moneycontrol.com/news/opinion/cesc-to-turbocharge-growth-with-renewable-energy-execution-key-13598161.html",
            "description": "The company aims to double its profits in five years",
            "pubDate": "2025-10-06T03:40:29.261177"
        },
        {
            "title": "Will banking stocks react to a tepid Q2 FY26?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/will-banking-stocks-react-to-a-tepid-q2-fy26-13598140.html",
            "description": "A pick-up in demand, along with fiscal and monetary measures, to support credit growth",
            "pubDate": "2025-10-06T03:40:29.261257"
        },
        {
            "title": "Ceigall India shares in focus on projects win worth Rs 1,309 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/ceigall-india-shares-in-focus-on-projects-win-worth-rs-1-309-crore-13597767.html",
            "description": "Ceigall India Share Price |  The company two LoA from Maharashtra State Electricity Distribution Co worth of Rs 1,309 crore.",
            "pubDate": "2025-10-06T03:40:29.261329"
        },
        {
            "title": "Lupin shares in focus on launching diabetes drug in US, observations from USFDA",
            "link": "https://www.moneycontrol.com/news/business/stocks/lupin-shares-in-focus-on-launching-diabetes-drug-in-us-observations-from-usfda-13597768.html",
            "description": "Lupin Share Price | The company received four observations to its Pithampur Unit-2 manufacturing facility from USFDA.",
            "pubDate": "2025-10-06T03:40:29.261397"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty flat at pre-open; Aditya Birla Life, Lupin, D-mart, banks in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-06-10-2025-liveblog-13598064.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like HDFC Bank, Bajaj Finance, IndusInd Bank, Aditya Birla Lifestyle Brands, Lupin, Infosys, Ceigall India, Sobha, Kotak Mahindra Bank, Pace Digitek, Yes Bank, Ujjivan Small Finance Bank, and Canara Bank will be in focus on October 06.",
            "pubDate": "2025-10-06T03:40:29.261469"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-14-13596827.html",
            "description": "Gold surged past $3,900 an ounce for the first time in early Asian trade on Monday, as safe-haven demand from a US government shutdown added to the momentum from expectations of more Federal Reserve rate cuts.",
            "pubDate": "2025-10-06T03:40:29.261558"
        },
        {
            "title": "Asian shares jump to record on Japan, gold rallies",
            "link": "https://www.moneycontrol.com/news/business/asian-shares-jump-to-record-on-japan-gold-rallies-13598026.html",
            "description": "The Nikkei 225 index jumped more than 4%, heading for the biggest one-day gain since April, after pro-stimulus lawmaker Sanae Takaichi was positioned to become the country’s next prime minister.",
            "pubDate": "2025-10-06T03:40:29.261628"
        },
        {
            "title": "Trade Spotlight: How should you trade Aditya Birla Capital, Hero MotoCorp, JSW Steel, Can Fin Homes, Shyam Metalics, Poonawalla, and others on October 06?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-aditya-birla-capital-hero-motocorp-jsw-steel-can-fin-homes-shyam-metalics-poonawalla-and-others-on-october-06-13598012.html",
            "description": "The market is expected to gain further strength only if it decisively climbs above the midline of the Bollinger Bands. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-10-06T03:40:29.261693"
        },
        {
            "title": "Stocks to Watch Today: HDFC Bank, Bajaj Finance, IndusInd, Aditya Birla Lifestyle, Lupin, Infosys, Ceigall India, Sobha, Kotak Bank in focus on 06 October",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hdfc-bank-bajaj-finance-indusind-aditya-birla-lifestyle-lupin-infosys-ceigall-india-sobha-kotak-bank-in-focus-on-06-october-13598003.html",
            "description": "Stocks to Watch, 06 October: Stocks like HDFC Bank, Bajaj Finance, IndusInd Bank, Aditya Birla Lifestyle Brands, Lupin, Infosys, Ceigall India, Sobha, Kotak Mahindra Bank, Pace Digitek, Yes Bank, Ujjivan Small Finance Bank, and Canara Bank will be in focus on October 06.",
            "pubDate": "2025-10-06T03:40:29.261757"
        },
        {
            "title": "Bank Nifty rises for 5th day to reclaim 56,000-mark on strong Q2 biz updates from HDFC, Kotak Mahindra Bank",
            "link": "https://www.moneycontrol.com/news/business/markets/bank-nifty-rises-for-5th-day-up-0-6-on-strong-q2-business-updates-from-hdfc-kotak-mahindra-bank-13598491.html",
            "description": "Kotak Mahindra Bank and HDFC Bank reported loan disbursal growth of 15% and 10%, respectively, for the September quarter.",
            "pubDate": "2025-10-06T05:42:38.057466"
        },
        {
            "title": "Aditya Birla Lifestyle shares rise 10% as Flipkart likely sells entire 6% stake for Rs 950 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/aditya-birla-lifestyle-shares-rise-10-as-flipkart-likely-sells-entire-6-stake-for-rs-950-crore-13598557.html",
            "description": "Aditya Birla Lifestyle Brands share price: More than 1 crore shares have been involved in active trade today so far. This is more than 7 times that of the stock's 10-day average volume.",
            "pubDate": "2025-10-06T05:42:38.057551"
        },
        {
            "title": "FMCG Q2 FY26 Update: GST cut, urban demand revival to aid growth",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/fmcg-q2-fy26-update-gst-cut-urban-demand-revival-to-aid-growth-13598055.html",
            "description": "Easing inflation, tax impetus to drive consumption growth",
            "pubDate": "2025-10-06T05:42:38.057637"
        },
        {
            "title": "Tata Capital IPO is priced reasonably, but should investors subscribe to it?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/tata-capital-ipo-is-priced-reasonably-but-should-investors-subscribe-to-it-13598183.html",
            "description": "The company is well-positioned to command a valuation premium, given its strong parentage and the market’s bias towards quality names in the financial services space",
            "pubDate": "2025-10-06T05:42:38.057708"
        }
    ]
}