{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-03T14:36:07.667163",
    "items": [
        {
            "title": "RailTel Corporation share price in focus on orders win worth Rs 63.55 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/railtel-corporation-share-price-in-focus-on-orders-win-worth-rs-63-55-crore-12953927.html",
            "description": "RailTel Corporation of India Share Price | The share touched a 52-week high of Rs 618 and a 52-week low of Rs 275.30 on 12 July, 2024 and 28 February, 2025, respectively.",
            "pubDate": "2025-03-03T02:37:04.636701"
        },
        {
            "title": "TVS Motor share price in focus on better sales data",
            "link": "https://www.moneycontrol.com/news/business/stocks/tvs-motor-share-price-in-focus-on-better-sales-data-12953929.html",
            "description": "TVS Motor Company Share Price | In the International Business, the company's total exports grew by 26 percent at 1,24,993 units. The two-wheeler exports registered a growth of 28 percent with 1,15,817 units and three-wheeler registered a growth of 14 percent with sales of 12,087 units in February 2025.",
            "pubDate": "2025-03-03T02:37:04.636780"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a positive start; US markets gain, Asia mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-03-03-2025-liveblog-12954395.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  Wall Street ended higher on Friday after a choppy trading session, with Dell Technologies dipping and other tech stocks climbing after a meeting between the U.S. President Donald Trump and Ukrainian counterpart Volodymyr Zelenskiy ended in disaster. The S&P 500 climbed 1.59% to end the session at 5,954.50 points. The Nasdaq gained 1.63% to 18,847.28 points, while the Dow Jones Industrial Average rose 1.39% to 43,840.91 points.",
            "pubDate": "2025-03-03T02:37:04.636875"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-56-12953593.html",
            "description": "The Foreign institutional investors (FIIs) sold equities worth Rs 11,639 crore on February 28. However, domestic institutional investors (DIIs) bought equities worth Rs 12,308.63 crore, on the same day.",
            "pubDate": "2025-03-03T02:37:04.636943"
        },
        {
            "title": "Chartist Talks: Surely these 2 stocks likely to outperform benchmark index in March, says Rahul Ghose of Hedged",
            "link": "https://www.moneycontrol.com/news/business/markets/chartist-talks-surely-these-2-stocks-likely-to-outperform-benchmark-index-in-march-says-rahul-ghose-of-hedged-12954353.html",
            "description": "Even at this price it is good to start to accumulate names like Larsen & Toubro, Reliance Industries, Tata Motors and some FMCG names like Asian Paints to name a few, says Rahul Ghose.",
            "pubDate": "2025-03-03T02:37:04.637010"
        },
        {
            "title": "Trade Spotlight: How should you trade HDFC Bank, Coal India, Granules, BSE, Ipca Labs, UltraTech Cement, and others on March 3?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-hdfc-bank-coal-india-granules-bse-ipca-labs-ultratech-cement-and-others-on-march-3-12954333.html",
            "description": "The rebound after a severe fall can't be ruled out, but the sustainability is key to watch. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-03T02:37:04.637081"
        },
        {
            "title": "Stocks to Watch Today: Tata Motors, Paytm, TVS Motor, NLC India, Piramal Enterprises, International Gemmological Institute, M&M in focus on 3 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tata-motors-paytm-tvs-motor-nlc-india-piramal-enterprises-international-gemmological-institute-m-m-in-focus-on-3-march-12954332.html",
            "description": "Stocks To Watch, Mar 3: Stocks like Foseco India, Rana Sugars, Maruti Suzuki India, Hyundai Motor India, Eicher Motors, Escorts Kubota, SML Isuzu, Atul Auto, VST Tillers, Dr Agarwals Health Care, Bajaj Auto, Indian Overseas Bank, Voltas, Mankind Pharma, Ujjivan Small Finance Bank, Dalmia Bharat, and Tata Communications will be in focus on March 3.",
            "pubDate": "2025-03-03T02:37:04.637149"
        },
        {
            "title": "Live: Can Nifty hold 22,000 or is there more pain left? | Auto stocks in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-hold-22-000-or-is-there-more-pain-left-auto-stocks-in-focus-opening-bell-12954446.html",
            "description": "The market wrapped up the month of February on a weak note, where we saw that the Nifty shed up to 16 percent from its lifetime high. Even in the last session, investors wealth was wiped out by a whopping Rs 20 lakh crore. This week, markets will react to India's GDP data, which has come in-line with Street estimates and has recovered from seven quarter lows. Auto sales figures, FII flows, US President Donald Trump's tariff announcements, among others will also decide market trends. This morning, global cues were largely strong. US markets ended higher on Friday and US futures also edged up overnight. Meanwhile, Asian markets also started the day on a positive note despite uncertainity on US President Donald Trump's tariff plans. Among stocks, watch out for auto names, Voltas, and Ujjivan Small Finance Bank in today's trading session. Catch Lovisha Darad in conversation with Sudeep Shah, Head of Technical &amp; Derivative Research, SBI Securities and Aishvarya Dadheech, Founder &amp; CIO, Fident Asset Management.",
            "pubDate": "2025-03-03T03:36:41.442071"
        },
        {
            "title": "A long road to normalcy for SpiceJet",
            "link": "https://www.moneycontrol.com/news/opinion/a-long-road-to-normalcy-for-spicejet-12954431.html",
            "description": "The company is attempting a revival after getting a fund infusion from qualified institutional placement",
            "pubDate": "2025-03-03T03:36:41.442161"
        },
        {
            "title": "Paytm shares in focus on show cause notice from ED on FEMA violations",
            "link": "https://www.moneycontrol.com/news/business/stocks/paytm-shares-in-focus-on-show-cause-notice-from-ed-on-fema-violations-12954426.html",
            "description": "The Enforcement Directorate slapped One97 Communicaitions with a FEMA violation notice for its subsidiaries, Little Internet and Nearbuy India.",
            "pubDate": "2025-03-03T03:36:41.442237"
        },
        {
            "title": "TVS Motors, M&M, Ashok Leyland, Eicher Motors shares rev up to 4% on healthy auto sales",
            "link": "https://www.moneycontrol.com/news/business/markets/tvs-motors-m-m-ashok-leyland-eicher-motors-shares-rev-up-to-4-on-healthy-auto-sales-12954464.html",
            "description": "Strong sales growth for TVS Motor, M&M, Ashok Leyland, and Eicher Motors drove investor buying, while weak numbers pressured Tata Motors, Hyundai, Maruti Suzuki, Bajaj Auto, and Hero MotoCorp.",
            "pubDate": "2025-03-03T04:21:33.208320"
        },
        {
            "title": "Agri Picks Report March 03, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-03-2025-geojit-financial-services-12954465.html",
            "description": "According to Geojit Financial Services, India witnessed the highest ever all-India mean and minimum temperatures for February since records began in 1901, the India Meteorological Department said.",
            "pubDate": "2025-03-03T04:21:33.208405"
        },
        {
            "title": "Goldman Sachs cuts target on BSE shares amid SEBI's proposed changes on monitoring risk",
            "link": "https://www.moneycontrol.com/news/business/stocks/goldman-sachs-cuts-target-on-bse-shares-amid-sebi-s-proposed-changes-on-monitoring-risk-12954451.html",
            "description": "SEBI proposed changing from the current method for computing open interest in the equity derivatives segment in a consultation paper, released on February 24, 2025.",
            "pubDate": "2025-03-03T04:21:33.208505"
        },
        {
            "title": "Buy Bikaji Foods International; target of Rs 775: Asit C Mehta",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-bikaji-foods-international-target-of-rs-775-asit-c-mehta-12954607.html",
            "description": "Asit C Mehta is bullish on Bikaji Foods International has recommended buy rating on the stock with a target price of Rs 775 in its research report dated March 03 2025.",
            "pubDate": "2025-03-03T05:57:49.482208"
        },
        {
            "title": "Coffee Day shares rise 20% after NCLAT overturns insolvency plea in a Rs 228 crore default case",
            "link": "https://www.moneycontrol.com/news/business/stocks/coffee-day-shares-rise-20-after-nclat-overturns-insolvency-plea-in-a-rs-228-crore-default-case-12954516.html",
            "description": "Coffee Day shares have been locked at five percent lower circuit for the past four consecutive sessions, but saw a massive surge on March 3, riding on the positive news flow.",
            "pubDate": "2025-03-03T05:57:49.482295"
        },
        {
            "title": "International Gemmological Institute of India: A niche play with healthy growth prospects",
            "link": "https://www.moneycontrol.com/news/business/stocks/international-gemmological-institute-of-india-a-niche-play-with-healthy-growth-prospects-12954501.html",
            "description": "IGIL is well-placed to deliver a healthy earnings growth in the medium term, driven by the increasing traction of lab-grown diamonds globally.",
            "pubDate": "2025-03-03T05:57:49.482372"
        },
        {
            "title": "Coal India shares burn 4% on weak February business update",
            "link": "https://www.moneycontrol.com/news/business/markets/coal-india-shares-burn-4-on-weak-february-business-update-12954513.html",
            "description": "With Coal India achieving only 83 percent of its annual production target by February, investors remain cautious about the company falling short of its FY25 goal by year-end.",
            "pubDate": "2025-03-03T05:57:49.482443"
        },
        {
            "title": "FII net sell shares worth Rs 4,788 crore, DIIs net buyers of Rs 8,790 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/fii-net-sell-shares-worth-rs-4-788-crore-diis-net-buyers-of-rs-8-790-crore-12955144.html",
            "description": "The Sensex and Nifty closed little changed on March 3, recovering from an over half-percent drop earlier in the session. While weakness in oil & gas and financial stocks weighed on the Nifty, IT shares provided some support.",
            "pubDate": "2025-03-03T14:34:45.542263"
        },
        {
            "title": "Zen Technologies secures third patent for T-90 tank simulator, expanding military training capabilities",
            "link": "https://www.moneycontrol.com/news/business/markets/zen-technologies-secures-third-patent-for-t-90-tank-simulator-expanding-military-training-capabilities-12955122.html",
            "description": "Zen Tech share price: Designed as a rapidly deployable, containerised unit, the T-90 DS is a plug-and-play mobile training facility that can be easily transported and set up at military bases.",
            "pubDate": "2025-03-03T14:34:45.542377"
        },
        {
            "title": "DLF, Prestige Estates, other realty stocks gain up to 5%, snap 5-day losing streak",
            "link": "https://www.moneycontrol.com/news/business/markets/dlf-prestige-estates-other-realty-stocks-gain-up-to-5-snap-5-day-losing-streak-12955028.html",
            "description": "The shares of Prestige Estates were the top gainer on the index, rising nearly 5 percent to trade at Rs 1,179 apiece.",
            "pubDate": "2025-03-03T14:34:45.542453"
        },
        {
            "title": "Granules India shares rally nearly 3% as LIC increases holding to 5%",
            "link": "https://www.moneycontrol.com/news/business/markets/granules-india-shares-rally-nearly-3-as-lic-increases-holding-to-5-12954933.html",
            "description": "Granules India share price: The PSU insurer acquired an additional 17.83 lakh shares between January 1 and March 3, raising its holding from 4.26 percent as of December.",
            "pubDate": "2025-03-03T14:34:45.542520"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on March 3",
            "link": "https://www.moneycontrol.com/news/business/stocks/top-gainers-and-losers-today-stocks-that-moved-the-most-on-march-3-12955013.html",
            "description": "With an eighth consecutive session of a lower ending, the market still managed to show some resistance",
            "pubDate": "2025-03-03T14:34:45.542588"
        },
        {
            "title": "Taking Stock: Market ends flat amid volatility; smallcaps underperform",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-market-ends-flat-amid-volatility-smallcaps-underperform-12954865.html",
            "description": "At close, the Sensex was down 112.16 points or 0.15 percent at 73,085.94, and the Nifty was down 5.40 points or 0.02 percent at 22,119.30",
            "pubDate": "2025-03-03T14:34:45.542657"
        },
        {
            "title": "Broken Arrow: How Nifty 50's inverse relation with India VIX looks distorted in this selloff",
            "link": "https://www.moneycontrol.com/news/business/markets/broken-arrow-how-nifty-50-s-inverse-relation-with-india-vix-looks-distorted-in-this-selloff-12955010.html",
            "description": "As India VIX - the volatility gauge - rises, the Nifty 50 index often declines, and vice versa, with higher VIX signalling greater uncertainty, thus leading to a fall in the value of the benchmark.",
            "pubDate": "2025-03-03T14:34:45.542723"
        },
        {
            "title": "Live: Sensex, Nifty continue to see wild swings | Auto stocks in focus | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-sensex-nifty-continue-to-see-wild-swings-auto-stocks-in-focus-closing-bell-12955003.html",
            "description": "Nifty extends losing streak to ninth day. Broader markets mixed; midcaps recover. Nifty Smallcap index falls nearly 1%. IT, auto stocks limit market losses. Nifty 50 gainers: BEL, Grasim, Eicher Motors. Nifty 50 losers: Coal India, Bajaj Auto, RIL. Catch Lovisha Darad and Yatin Mota as they discuss the stocks on their radar.",
            "pubDate": "2025-03-03T14:34:45.542788"
        },
        {
            "title": "Century Ply Independent Director among others named in FIR as complaint alleges 'stock market fraud'",
            "link": "https://www.moneycontrol.com/news/business/stocks/century-ply-independent-director-among-others-named-in-fir-as-complaint-alleges-stock-market-fraud-12954923.html",
            "description": "A Special Court has instructed Mumbai's Anti-Corruption Bureau to register an FIR against some individuals, including Pramod Agrawal, currently the Independent Director on the board of Century Plyboards, following a complaint alleging 'stock market fraud and regulatory violations'.",
            "pubDate": "2025-03-03T14:34:45.542856"
        },
        {
            "title": "L&T shares gain after firm's power transmission, distribution vertical bags 'large' orders",
            "link": "https://www.moneycontrol.com/news/business/stocks/l-t-shares-gain-after-firm-s-power-transmission-distribution-vertical-bags-large-orders-12954919.html",
            "description": "The company has won an order to implement 765 Kv and 400 Kv transmission line segments. This would be related to a renewable energy zone in Uttar Pradesh",
            "pubDate": "2025-03-03T14:34:45.542919"
        },
        {
            "title": "AstraZeneca Pharma shares gain 3% on CDSCO nod for expanded use of cancer drug Imfinzi",
            "link": "https://www.moneycontrol.com/news/business/markets/astrazeneca-pharma-shares-gain-3-on-cdsco-nod-for-expanded-use-of-cancer-drug-imfinzi-12954903.html",
            "description": "AstraZeneca Pharma share price: This approval allows the use of Durvalumab in combination with Tremelimumab, broadening treatment options for patients battling advanced-stage liver cancer.",
            "pubDate": "2025-03-03T14:34:45.542985"
        },
        {
            "title": "Bajaj Auto top loser in BSE Auto index after hitting 52-week low as February sales skid, knocking off Bajaj Finserv shares",
            "link": "https://www.moneycontrol.com/news/business/stocks/bajaj-auto-top-loser-in-bse-auto-index-after-hitting-52-week-low-as-february-sales-skid-knocking-off-bajaj-finserv-shares-12954807.html",
            "description": "Overall, the company's total domestic sales dropped 11 percent to 1.83 lakh units, while exports surged 21 percent to 1.69 lakh units.",
            "pubDate": "2025-03-03T14:34:45.543116"
        },
        {
            "title": "International Gemmological Institute shares hit 10% lower circuit after Q4 results, fall 28% below listing price",
            "link": "https://www.moneycontrol.com/news/business/stocks/international-gemmological-institute-shares-hit-10-lower-circuit-after-q4-results-fall-28-below-listing-price-12954783.html",
            "description": "The stock is currently down nearly 43 percent from its January peak of Rs 642.3 per share.",
            "pubDate": "2025-03-03T14:34:45.543181"
        },
        {
            "title": "Stocks of IREDA, Tata Tech, 4 other F&O entrants extend losses for 2nd day, fall up to 7%",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-of-ireda-tata-tech-4-other-f-o-entrants-extend-losses-for-2nd-day-fall-up-to-7-12954700.html",
            "description": "IREDA shares were the top loser among the pack of six. The renewable energy stock fell over 7 percent to trade at Rs 144.5",
            "pubDate": "2025-03-03T14:34:45.543311"
        },
        {
            "title": "CSB Bank: Could gold’s glitter lead to a valuation re-rating?",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/csb-bank-could-gold-s-glitter-lead-to-a-valuation-re-rating-12954707.html",
            "description": "CSB Bank benefits immensely from a gold loan portfolio that has higher yields, low credit costs and lower risk weights, offsetting pressures facing small banks",
            "pubDate": "2025-03-03T14:34:45.543405"
        },
        {
            "title": "Chart of the Day: Unlocking India's mutual fund potential",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-unlocking-india-s-mutual-fund-potential-12954331.html",
            "description": "Over the past five years, investments in mutual funds have grown at a compound annual growth rate (CAGR) of 17.5 percent, while bank deposits have increased at a CAGR of 11.0 percent",
            "pubDate": "2025-03-03T14:34:45.543666"
        },
        {
            "title": "Summer surge: Blue Star, Voltas, other AC stocks rise up to 7% on higher sales hope after IMD's heatwave warning",
            "link": "https://www.moneycontrol.com/news/business/stocks/summer-surge-blue-star-voltas-other-ac-stocks-rise-on-sales-hope-after-imd-s-heatwave-warning-12954608.html",
            "description": "The meteorological department had on February 28 said that the maximum and minimum temperatures are likely to remain above the normal benchmarks during March, except for certain parts, including northwest India and peninsular India.",
            "pubDate": "2025-03-03T14:34:45.543731"
        },
        {
            "title": "Brokerages maintain Buy on Polycab India, KEI Industries but lower targets after Ultratech's C&W foray",
            "link": "https://www.moneycontrol.com/news/business/stocks/brokerages-maintain-buy-on-polycab-india-kei-industries-but-lower-targets-after-ultratech-s-c-w-foray-12954542.html",
            "description": "Leading investment bank UBS revised its outlook on key C&W players, maintaining a 'Buy' on KEI Industries, but lowered target price to Rs 5,000 per share, down from Rs 5,700 per share. UBS lowered the target price for Polycab India to Rs 7,700 per share from Rs 9,000 per share previously, keeping the 'Buy' call.",
            "pubDate": "2025-03-03T14:34:45.543862"
        }
    ]
}