{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-26T07:36:02.688792",
    "items": [
        {
            "title": "Panacea Biotec shares in focus on contract from UNICEF",
            "link": "https://www.moneycontrol.com/news/business/stocks/panacea-biotec-shares-in-focus-on-contract-from-unicef-12897580.html",
            "description": "Panacea Biotec Share Price | The share touched a 52-week high of Rs 489.00 and a 52-week low of Rs 112.70 on 12 December, 2024 and 04 June, 2024, respectively. Currently, the stock is trading 11.13 percent below its 52-week high and 285.58 percent above its 52-week low.",
            "pubDate": "2024-12-26T02:29:15.979801"
        },
        {
            "title": "BPCL shares in focus on winning 150 MW solar PV power project",
            "link": "https://www.moneycontrol.com/news/business/stocks/bpcl-shares-in-focus-on-winning-150-mw-solar-pv-power-project-12897578.html",
            "description": "Bharat Petroleum Corporation Share Price | The company board at its meeting held on December 24, has accorded its approval to commence pre project activities for setting up of a green field refinery cum petrochemical complex in East Coast at Andhra Pradesh at an estimated cost of Rs 6100 crore.",
            "pubDate": "2024-12-26T02:29:15.979892"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat start; Asian markets trade higher",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-26-12-2024-liveblog-12897637.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  Asia’s benchmark stock index rose as equities gained in Japan and South Korea, while several other regional markets remain shut for holidays. Sentiment was boosted after US shares extended this year’s rally on Tuesday. Wall Street's main indexes all closed higher on Tuesday, with gains in megacap and growth stocks bolstering benchmarks in a truncated Christmas Eve session.",
            "pubDate": "2024-12-26T02:29:15.979973"
        },
        {
            "title": "Here are the top global cues for today’s trade - First Tick",
            "link": "https://www.moneycontrol.com/news/business/markets/here-are-the-top-global-cues-for-today-s-trade-first-tick-12896898.html",
            "description": "The GIFT Nifty is indicating a muted start for the day. Asia’s benchmark stock index rose as equities gained in Japan and South Korea, while several other regional markets remain shut for holidays. Sentiment was boosted after US shares extended this year’s rally on Tuesday.",
            "pubDate": "2024-12-26T02:29:15.980049"
        },
        {
            "title": "Most Asian stocks rise amid thin holiday trading",
            "link": "https://www.moneycontrol.com/news/business/stocks/most-asian-stocks-rise-amid-thin-holiday-trading-12897635.html",
            "description": "Bank of Japan Governor Kazuo Ueda gave a talk on Wednesday and avoided giving a clear signal that he might raise interest rates next month by reiterating the need to keep monitoring risks for the economy in comments that nudged down the yen.",
            "pubDate": "2024-12-26T02:29:15.980121"
        },
        {
            "title": "Stocks to Watch Today: NALCO, BPCL, Gland Pharma, Panacea Biotec, Ramky Infra, Ceigall India, Manorama in focus on 26 December",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-nalco-bpcl-gland-pharma-panacea-biotec-ramky-infra-ceigall-india-manorama-in-focus-on-26-december-12897628.html",
            "description": "Stocks To Watch Today, Dec 26: Stocks like Bharat Forge, EPACK Durable. UltraTech Cement, Goa Carbon, Macrotech Developers, Religare Enterprises, Aditya Birla Capital, Snowman Logistics, Kalyani Cast-Tech, and Manorama Industries will also be in focus on December 26.",
            "pubDate": "2024-12-26T02:29:15.980194"
        },
        {
            "title": "Sensex rises 300 points, Nifty tops 23,800 in thin trade, banks and auto rally on expiry day",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-rises-300-points-nifty-tops-23-800-in-thin-trade-banks-and-auto-rally-on-expiry-day-12897645.html",
            "description": "The broader market also mirrored positive trends in the morning. Both mid-cap and small cap indexes rose  0.2 percent, each.",
            "pubDate": "2024-12-26T04:34:26.278583"
        },
        {
            "title": "GuruSpeak| Puneet Sharma's trading journey: Mastering quantitative trading through data and algos",
            "link": "https://www.moneycontrol.com/news/business/markets/guruspeak-puneet-sharma-s-trading-journey-mastering-quantitative-trading-through-data-and-algos-12897625.html",
            "description": "His trading approach combines quantitative strategies, algorithmic models, and robust risk management protocols and prioritises maintaining a high risk-to-reward ratio to ensure long-term profitability",
            "pubDate": "2024-12-26T04:34:26.278674"
        },
        {
            "title": "RR Kabel: Correction spells long-term opportunity",
            "link": "https://www.moneycontrol.com/news/business/earnings/rr-kabel-correction-spells-long-term-opportunity-12897674.html",
            "description": "A strong brand recall and the shift in produce mix are positives for profitability",
            "pubDate": "2024-12-26T04:34:26.278750"
        },
        {
            "title": "Agri Picks Report December 26, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-26-2024-geojit-financial-services-12897688.html",
            "description": "According to Geojit Financial Services, Farmers in Maharashtra have sown rabi crops over 5.5 million hectares as of Tuesday, up nearly 26% on year from 4.4 million hectares in the corresponding period last year, according to a report by the state agriculture department.",
            "pubDate": "2024-12-26T04:34:26.278827"
        },
        {
            "title": "HG Infra Engineering: Why should you bet on this construction player?",
            "link": "https://www.moneycontrol.com/news/business/stocks/hg-infra-engineering-why-should-you-bet-on-this-construction-player-12897707.html",
            "description": "The company has already carved a niche in the road construction space. Its diversification into newer segments is also yielding results and it boasts of a huge order book in the infrastructure segment",
            "pubDate": "2024-12-26T04:52:20.783858"
        },
        {
            "title": "Ramky Infra stock gains 2.87% on Rs 215 crore contract from HMWSSB",
            "link": "https://www.moneycontrol.com/news/business/stocks/ramky-infra-stock-prices-increase-a-3-83-following-contract-from-hmwssb-12897705.html",
            "description": "The Company has been awarded a contract entailing the management and maintenance of sewage treatment plants and related infrastructure for a period of five years.",
            "pubDate": "2024-12-26T05:20:28.047983"
        },
        {
            "title": "PNC Infra gets relief from High Court in disqualification order by MoRTH, NHAI",
            "link": "https://www.moneycontrol.com/news/business/markets/pnc-infra-gets-relief-from-high-court-in-disqualification-order-by-morth-nhai-12897640.html",
            "description": "PNC Infratech and its two SPVs were disqualified by MoRTH and NHAI from participating in tendering process for a year in October. The decision was challenged by the company before the Division Bench of Delhi High Court in November through a Letters Patent Appeals.",
            "pubDate": "2024-12-26T05:20:28.048080"
        },
        {
            "title": "Newgen Soft extends December rally to 44% after bagging $2.27 million Saudi Arabia order",
            "link": "https://www.moneycontrol.com/news/business/markets/newgen-soft-extends-december-rally-to-44-after-bagging-2-27-million-order-saudi-arabia-12897782.html",
            "description": "Newgen Software is looking to expand its presence in the middle east with acquisition of new clients as well as upselling to existing customers. Shares of the company are higher by 44% in December so far, making it the top gainer among NSE 500.",
            "pubDate": "2024-12-26T05:42:08.462515"
        },
        {
            "title": "Ceigall India shares rise 7% on new Rs 981-crore project from NHAI",
            "link": "https://www.moneycontrol.com/news/business/markets/ceigall-india-shares-rise-7-on-new-rs-981-crore-project-from-nhai-12897787.html",
            "description": "Ceigall India specializes in infrastructure construction, undertaking projects like elevated roads, flyovers, bridges, tunnels, highways, expressways, and runways.",
            "pubDate": "2024-12-26T06:22:54.415320"
        },
        {
            "title": "Godfrey Phillips India shares snap seven-day fall to rise 7%; board appoints new COO and updates on 24Seven trademark tussle",
            "link": "https://www.moneycontrol.com/news/business/markets/godfrey-phillips-india-shares-snap-seven-day-fall-to-rise-7-board-appoints-new-coo-and-updates-on-24seven-trademark-tussle-12897791.html",
            "description": "24Seven Retail and Samir Modi, son of Managing Director Bina Modi, have sought royalty for trademark and moved a case before Delhi High Court. Godfrey Phillips India has contested the demands and said there is no royalty payable.",
            "pubDate": "2024-12-26T07:36:01.095551"
        },
        {
            "title": "EPACK Durable stock prices gain 5% upon potential investment by Chinese TV manufacturer",
            "link": "https://www.moneycontrol.com/news/business/stocks/epack-durable-stock-prices-gain-5-upon-potential-investment-by-chinese-tv-manufacturer-12897877.html",
            "description": "The Company is involved in preliminary discussions with a Chinese television manufacturer to invest in EPACK Durable's wholly owned subsidiary",
            "pubDate": "2024-12-26T07:36:01.095639"
        }
    ]
}