{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-07T03:44:35.256770",
    "items": [
        {
            "title": "Subscribe for LG Electronics India Ltd IPO; Anand Rathi",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-lg-electronics-india-ltd-ipo-anand-rathi-13600488.html",
            "description": "Anand Rathi, has come out with its report on LG Electronics India Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on October 06, 2025.",
            "pubDate": "2025-10-07T03:43:29.521801"
        },
        {
            "title": "Live: Can bulls extend Nifty's rally to the fourth straight day? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-bulls-extend-nifty-s-rally-to-the-fourth-straight-day-opening-bell-13600365.html",
            "description": "The Nifty kicked off the week on a strong note, reclaiming the 25,000 mark led by financial stocks. The surge came even as a busy IPO calendar failed to dampen market sentiment. Among key movers, TCS gained 3 percent ahead of its quarterly results, while the Bank Nifty extended its winning streak, adding 1,800 points over the last five sessions. In the broader market, Trent and Bank of India will be in focus after their latest business updates. On the primary market front, the LG IPO opens for subscription today, while Tata Capital’s issue was subscribed 39 percent on Day 1. This morning, global cues were mixed. US markets ended on a strong note, with S&P 500 and NASDAQ at fresh records following AI-Chip deal between AMD and OpenAI. Meanwhile, Asian markets were mixed, with gains being led by Japanese markets. Catch Lovisha Darad in conversation with Ajit Mishra, SVP, Research, Religare Broking and Sneha Poddar, VP -Research, Wealth Management, Motilal Oswal Financial Services.",
            "pubDate": "2025-10-07T03:43:29.521881"
        },
        {
            "title": "Chart of the Day: Earnings cuts prelude to Q2 FY26 results season",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-earnings-cuts-prelude-to-q2-fy26-results-season-13600312.html",
            "description": "Earnings downgrades continue to outstrip upgrades in Nifty 50 companies",
            "pubDate": "2025-10-07T03:43:29.521949"
        },
        {
            "title": "Coal India shares in focus on MoU with CMDC for critical mineral exploration",
            "link": "https://www.moneycontrol.com/news/business/markets/coal-india-shares-in-focus-on-mou-with-cmdc-for-critical-mineral-exploration-13599973.html",
            "description": "Coal India Share Price | The company signed a MoU with Chhattisgarh Mineral Development Corporation for exploration & exploitation of critical minerals.",
            "pubDate": "2025-10-07T03:43:29.522013"
        },
        {
            "title": "Dilip Buildcon shares in focus on 100 MW solar PV power project win",
            "link": "https://www.moneycontrol.com/news/business/stocks/dilip-buildcon-shares-in-focus-on-100-mw-solar-pv-power-project-win-13599972.html",
            "description": "Dilip Buildcon Share Price | The company JV received LOA for development of a 100 MW grid-connected ground-mounted solar PV power project.",
            "pubDate": "2025-10-07T03:43:29.522077"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-15-13598848.html",
            "description": "Gold raced to log a record high in early Asia hours trading on Tuesday",
            "pubDate": "2025-10-07T03:43:29.522146"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty gain at pre-open; Biocon, Coal India, Bank of India in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-07-10-2025-liveblog-13600204.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Bank of India, Metropolis Healthcare, Dilip Buildcon, LTIMindtree, Brigade Enterprises, Zydus Lifesciences, Coal India, Aster DM Healthcare, Reliance Industries, Bharti Airtel, and Aditya Birla Lifestyle Brands will be in focus on October 7.",
            "pubDate": "2025-10-07T03:43:29.522214"
        },
        {
            "title": "Trade Spotlight: How should you trade Bajaj Auto, SBI, Canara Bank, NALCO, Bank of Baroda, HUL, Bajaj Finance, and others on October 07?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bajaj-auto-sbi-canara-bank-nalco-bank-of-baroda-hul-bajaj-finance-and-others-on-october-07-13600150.html",
            "description": "The improved sentiment may drive the market gradually toward the September high. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-10-07T03:43:29.522280"
        },
        {
            "title": "Stocks to Watch Today: LTIMindtree, Metropolis Healthcare, Dilip Buildcon, Brigade Enterprises, Glottis, Fabtech Technologies in focus on 07 October",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-ltimindtree-metropolis-healthcare-dilip-buildcon-brigade-enterprises-glottis-fabtech-technologies-in-focus-on-07-october-13600135.html",
            "description": "Stocks to Watch, 07 October: Stocks like Bank of India, Metropolis Healthcare, Dilip Buildcon, LTIMindtree, Brigade Enterprises, Zydus Lifesciences, Coal India, Aster DM Healthcare, Reliance Industries, Bharti Airtel, and Aditya Birla Lifestyle Brands will be in focus on October 7.",
            "pubDate": "2025-10-07T03:43:29.522343"
        },
        {
            "title": "Flipkart Investments exits Aditya Birla Lifestyle Brands by selling 6% stake to 12 investors for Rs 998.4 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/flipkart-investments-exit-aditya-birla-lifestyle-brands-by-selling-6-stake-to-12-investors-for-rs-998-4-crore-13599992.html",
            "description": "Aditya Birla Lifestyle Brands shares rallied 7.5 percent to close at Rs 146.72 after strong gap-up opening, though there was profit booking at higher levels.",
            "pubDate": "2025-10-07T03:43:29.522407"
        }
    ]
}