{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-12T11:54:27.557146",
    "items": [
        {
            "title": "Bharti Airtel shares in focus on partnership with Starlink; JPMorgan says stock can rally 66%",
            "link": "https://www.moneycontrol.com/news/business/stocks/bharti-airtel-shares-in-focus-on-partnership-with-starlink-jpmorgan-says-stock-can-rally-66-12962589.html",
            "description": "The SpaceX team said, 'We are excited to work with Airtel and unlock the transformative impact Starlink can bring to the people of India.'",
            "pubDate": "2025-03-12T03:01:27.740153"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a flat start; US stocks fall, Asia gains",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-12-03-2025-liveblog-12962562.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks fell on Tuesday, adding to the biggest selloff in months, as investors worried about the impact of the latest tariff threats on the global economy. The Dow Jones Industrial Average fell 478.23 points, or 1.14%, to 41,433.48, the S&P 500 lost 42.49 points, or 0.76%, to 5,572.07 and the Nasdaq Composite lost 32.23 points, or 0.18%, to 17,436.10.",
            "pubDate": "2025-03-12T03:01:27.740248"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-63-12961975.html",
            "description": "The Foreign institutional investors (FIIs) continued their selling on March 11 as they sold equities worth Rs 2,823 crore. On the other hand, domestic institutional investors (DIIs) continued their buying as they bought equities of more than Rs 2,000 crore, on the same day.",
            "pubDate": "2025-03-12T03:01:27.740323"
        },
        {
            "title": "Stocks to Watch Today: TCS, PB Fintech, Bharti Airtel, Rail Vikas Nigam, Kaynes Technology, Godrej Agrovet in focus on 12 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-pb-fintech-bharti-airtel-rail-vikas-nigam-kaynes-technology-godrej-agrovet-in-focus-on-12-march-12962547.html",
            "description": "Stocks to Watch, Mar 12: Stocks like Sandur Manganese and Iron Ores, Zota Health Care, Indian Renewable Energy Development Agency, TVS Motor Company, Hexaware Technologies, Adani Green Energy, NTPC Green Energy, OnMobile Global, KPI Green Energy, and Tamilnad Mercantile Bank willl be in focus on March 12.",
            "pubDate": "2025-03-12T03:01:27.740393"
        },
        {
            "title": "Trade Spotlight: How should you trade Phoenix Mills, Jubilant Foodworks, Oberoi Realty, Chennai Petroleum Corporation, NCC, and others on March 12?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-phoenix-mills-jubilant-foodworks-oberoi-realty-chennai-petroleum-corporation-ncc-and-others-on-march-12-12962533.html",
            "description": "The benchmark indices are expected to consolidate further until a decisive close above short-term moving averages. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-12T03:01:27.740464"
        },
        {
            "title": "Live: How Will Nifty React To Trump’s New Tariff Shock? Starlink Partners with Airtel |Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-how-will-nifty-react-to-trump-s-new-tariff-shock-starlink-partners-with-airtel-opening-bell-12962590.html",
            "description": "US stocks declined on Tuesday, extending the steepest selloff in months, as investors grappled with concerns over the potential economic fallout from new tariff threats. Market volatility was high, driven by conflicting updates on tariffs, while brief optimism over progress toward a Ukraine-Russia ceasefire provided a temporary boost to equities. The S&amp;P 500 fell to an intraday low of 5,528.41, briefly entering a market correction with a 10% decline from its record close of 6,144.15 on February 19. President Donald Trump announced plans to double tariffs on all imported Canadian steel and aluminum products to 50%, just hours before they were set to take effect, but soon backtracked. Asian markets are trading mixed and the GIFT Nifty is trading marginally in the red. The Nifty made a good recovery from day’s low to edge back near the 22,500 mark. Watch out for IndusInd Bank after the stock crashed 27% yesterday, also in focus will be Bharti Airtel &amp; PB Fintech. Catch Nandita Khemka in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical &amp; Derivatives) at Axis Securities and Sandeep Bagla, CEO, TRUST Mutual Fund.",
            "pubDate": "2025-03-12T03:46:59.210711"
        },
        {
            "title": "Tata Motors shares zoom 3% on positive brokerage notes",
            "link": "https://www.moneycontrol.com/news/business/markets/tata-motors-shares-zoom-3-on-positive-brokerage-notes-12962673.html",
            "description": "The stock of Tata Motors is a 'High Conviction Outperform' for CLSA, which expressed confidence that JLR will be achieving FY25 targets, assigning the stock a price target of Rs 930 per share.",
            "pubDate": "2025-03-12T04:47:49.280701"
        },
        {
            "title": "Kaynes Tech shares crash 8% after Sebi notice over suspected violations of insider trading regulations",
            "link": "https://www.moneycontrol.com/news/business/markets/keynes-tech-shares-crash-8-after-sebi-notice-over-suspected-violations-of-insider-trading-regulations-12962584.html",
            "description": "The company has responded by saying it is currently reviewing the notice and will take 'all appropriate legal and procedural steps', including providing a timely response to the regulator.",
            "pubDate": "2025-03-12T04:47:49.280787"
        },
        {
            "title": "How does oil supply dynamics shape up in the new world order?",
            "link": "https://www.moneycontrol.com/news/business/markets/how-does-oil-supply-dynamics-shape-up-in-the-new-world-order-12962594.html",
            "description": "Weak consumption trend can depress oil prices as supply is poised to increase",
            "pubDate": "2025-03-12T04:47:49.280860"
        },
        {
            "title": "Stocks on Radar: Bharti Airtel, Godrej Agrovet, RVNL, Infosys In Focus | March 12",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/stocks-on-radar-bharti-airtel-godrej-agrovet-rvnl-infosys-in-focus-march-12-12962618.html",
            "description": "Catch up on today’s top stock market updates! Bharti Airtel teams up with SpaceX for Starlink services in India, Infosys faces a downgrade, Godrej Agrovet expands its dairy footprint, and more. Stay ahead of the market—watch now",
            "pubDate": "2025-03-12T04:47:49.280931"
        },
        {
            "title": "Tech shares at eight-month low as Morgan Stanley cites risk to growth",
            "link": "https://www.moneycontrol.com/news/business/markets/tech-shares-at-eight-month-low-as-morgan-stanley-cites-risk-to-growth-12962655.html",
            "description": "The fall in the shares of IT companies has pushed Nifty IT sharply lower, after Morgan Stanley's latest note cited shifting global macro environment and technological changes as risks to valuations and revenue growth.",
            "pubDate": "2025-03-12T04:55:24.609949"
        },
        {
            "title": "Gabriel India: Positioned well to benefit from traditional, new businesses",
            "link": "https://www.moneycontrol.com/news/business/earnings/gabriel-india-positioned-well-to-benefit-from-traditional-new-businesses-12962638.html",
            "description": "Increased preference for premium products augurs well for the company",
            "pubDate": "2025-03-12T04:55:24.610039"
        },
        {
            "title": "Kokuyo Camlin shares surge 4% amid high trading volumes",
            "link": "https://www.moneycontrol.com/news/business/stocks/kokuyo-camlin-shares-surge-4-amid-high-trading-volumes-12962988.html",
            "description": "In the past one week, Kokuyo Camlin shares outperformed the broader BSE FMCG index.",
            "pubDate": "2025-03-12T11:54:18.613931"
        },
        {
            "title": "Live: Nifty Off Day's Low Amid Volatility; IT Index In Bear Market Territory| Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-off-day-s-low-amid-volatility-it-index-in-bear-market-territory-closing-bell-12963021.html",
            "description": "Nifty recovers from day's low. Nifty back near 22,500 after slipping below 22,350. Broader markets fail to hold on to gains \nNSE advance-decline ratio at 1:2 .Banks, Auto, FMCG, Pharma among gainers .Sharp selloff in IT stocks; realty & metals under pressure .Nifty gainers: IndusInd, Tata Motors, Kotak Bank, HDFC Bank, Bajaj Fin. Nifty losers: Infosys, Wipro, Tech Mah, Nestle, TCS, HCL. Catch Nandita Khemka and Yatin Mota as they discuss stocks on their radar.",
            "pubDate": "2025-03-12T11:54:18.614024"
        },
        {
            "title": "IndusInd Bank, HDFC Bank shares gain up to 5%, Bank Nifty trades in green after 2 days",
            "link": "https://www.moneycontrol.com/news/business/markets/indusind-bank-hdfc-bank-shares-gain-up-to-5-bank-nifty-trades-in-green-after-2-days-12962846.html",
            "description": "IndusInd Bank shares were the top gainers on the index, snapping their 5-day losing streak. This comes a day after the stock crashed 27% after the bank reported discrepancies in its derivatives portfolio.",
            "pubDate": "2025-03-12T11:54:18.614099"
        },
        {
            "title": "Accumulate Federal Bank; target of Rs 199: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-federal-bank-target-of-rs-199-geojit-financial-services-12962879.html",
            "description": "Geojit Financial Services recommended accumulate rating on Federal Bank with a target price of Rs 199 in its research report dated March 11, 2025.",
            "pubDate": "2025-03-12T11:54:18.614168"
        },
        {
            "title": "Accumulate Colgate Palmolive India; target of Rs 2730: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-colgate-palmolive-india-target-of-rs-2730-geojit-financial-services-12962816.html",
            "description": "Geojit Financial Services recommended accumulate rating on Colgate Palmolive India with a target price of Rs 2730 in its research report dated March 11, 2025.",
            "pubDate": "2025-03-12T11:54:18.614234"
        },
        {
            "title": "Buy PNC Infratech; target of Rs 305: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-pnc-infratech-target-of-rs-305-geojit-financial-services-12962805.html",
            "description": "Geojit Financial Services is bullish on PNC Infratech has recommended buy rating on the stock with a target price of Rs 305 in its research report dated March 12, 2025.",
            "pubDate": "2025-03-12T11:54:18.614309"
        },
        {
            "title": "Buy Tata Consumer Products; target of Rs 1067: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-tata-consumer-products-target-of-rs-1067-geojit-financial-services-12962798.html",
            "description": "Geojit Financial Services is bullish on Tata Consumer Products has recommended buy rating on the stock with a target price of Rs 1067 in its research report dated March 11, 2025.",
            "pubDate": "2025-03-12T11:54:18.614378"
        },
        {
            "title": "Buy Poly Medicure; target of Rs 2900: LKP Research",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-poly-medicure-target-of-rs-2900-lkp-research-12962771.html",
            "description": "LKP Research is bullish on Poly Medicure has recommended buy rating on the stock with a target price of Rs 2900 in its research report dated March 12, 2025.",
            "pubDate": "2025-03-12T11:54:18.614443"
        },
        {
            "title": "New rules for SME IPOs aim to reduce risks, but may cool investor appetite",
            "link": "https://www.moneycontrol.com/news/opinion/new-rules-for-sme-ipos-aim-to-reduce-risks-but-may-cool-investor-appetite-12962731.html",
            "description": "SEBI’s new rules for SME IPOs aim to improve listing quality and protect investors amid a surge in smaller company offerings. While these measures introduce stricter norms, they may also limit growth opportunities and deter retail participation.",
            "pubDate": "2025-03-12T11:54:18.614703"
        },
        {
            "title": "Royal Orchid Hotels: Why this hotel stock is likely to go up",
            "link": "https://www.moneycontrol.com/news/business/earnings/royal-orchid-hotels-why-this-hotel-stock-is-likely-to-go-up-12962697.html",
            "description": "Given the government’s focus on tourism as a job-creating sector, ROHL is likely to deliver industry-leading growth. The company’s valuations also look attractive",
            "pubDate": "2025-03-12T11:54:18.614846"
        }
    ]
}