{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-10T14:39:10.144474",
    "items": [
        {
            "title": "Nazara Technologies: Strong growth from transformative acquisitions",
            "link": "https://www.moneycontrol.com/news/business/markets/nazara-technologies-strong-growth-from-transformative-acquisitions-12960291.html",
            "description": "The new sources of revenues can potentially double the company’s top line over the next 18-24 months",
            "pubDate": "2025-03-10T04:26:11.852030"
        },
        {
            "title": "Nifty above 22,600, Sensex in green in early trade; IndusInd Bank down 5%; VIX up 4%",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-above-22-600-sensex-in-green-in-early-trade-indusind-bank-down-5-vix-up-4-12960252.html",
            "description": "The upcoming trading week will be a holiday-shortened one, with market participants closely monitoring global developments in the absence of major domestic events.",
            "pubDate": "2025-03-10T04:26:11.852118"
        },
        {
            "title": "Investing in the Cash Economy: Why CMS Info Systems stands out",
            "link": "https://www.moneycontrol.com/news/business/stocks/investing-in-the-cash-economy-why-cms-info-systems-stands-out-12960259.html",
            "description": "The company’s financial profile remains strong, aided by steady revenue growth, solid margins, healthy order book, and earnings visibility",
            "pubDate": "2025-03-10T04:26:11.852197"
        },
        {
            "title": "Agri Picks Report March 10, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-10-2025-geojit-financial-services-12960272.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.3 million acres (1 acre = 0.4 hectares) as of Wednesday, up 10.3% from 6.6 million acres a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-03-10T04:26:11.852287"
        },
        {
            "title": "Live: India Wins The Champions Trophy; Will Market Join The Celebrations?| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-india-wins-the-champions-trophy-will-market-join-the-celebrations-opening-bell-12960253.html",
            "description": "The Nifty 50 finished rangebound trading flat with a positive bias, continuing its uptrend for the third consecutive session on March 7. The index sustained above the bearish gap of February 28 for another session with above-average volumes, indicating positivity, though there was some profit-taking at higher levels. Hence, according to experts, as long as the index holds 22,500 in the upcoming sessions, an upward journey toward the 22,750-22,800 zone is possible. However, if it falls below 22,500, the support is placed at 22,300. This will be an important week for the Nifty as it would determine whether the trend would be on the upside or downside after last week’s upmove. IndusInd Bank, Sun Pharma are among the stocks to watch out for today. Catch Nandita Khemka in conversation with Sudeep Shah—Head of Technical & Derivative Research, SBI Securities and market expert Ajay Bagga.",
            "pubDate": "2025-03-10T04:26:11.852356"
        },
        {
            "title": "Merchant power producers in a sweet spot on rising demand, limited generation capacity",
            "link": "https://www.moneycontrol.com/news/opinion/merchant-power-producers-in-a-sweet-spot-on-rising-demand-limited-generation-capacity-12960230.html",
            "description": "Given the long construction timelines of new projects, companies are finding it lucrative to purchase and turn around financially troubled power plants.",
            "pubDate": "2025-03-10T04:26:11.852427"
        },
        {
            "title": "RailTel Corporation shares up 3% on order win worth Rs 28.29 crore; board meet on March 12",
            "link": "https://www.moneycontrol.com/news/business/stocks/railtel-corporation-shares-in-focus-on-order-win-worth-rs-28-29-crore-board-meet-on-march-12-12960119.html",
            "description": "RailTel Corporation of India Share Price | In the previous week, company received the work order from State Transport Authority Odisha for project business amounting to Rs 2,62,33,85,540 for upgradation of existing Command Control Centre to Unified Command Control Centre & Implementation of Intelligent Enforcement Management System (lEMS) for State Transport Authority.",
            "pubDate": "2025-03-10T04:26:11.852499"
        },
        {
            "title": "HFCL shares gain after arm bags order of Rs 44.36 crore from Indian Army",
            "link": "https://www.moneycontrol.com/news/business/stocks/hfcl-shares-in-focus-after-arm-bags-order-of-rs-44-36-crore-from-indian-army-12960120.html",
            "description": "HFCL share price | The company recorded 10.4 percent fall in its December quarter (Q3FY25) net profit at Rs 73.65 crore from Rs 82.24 crore in December 2023.",
            "pubDate": "2025-03-10T04:26:11.852566"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty at 22,650, Sensex up 310 pts; media, metal, FMCG shine",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-10-03-2025-liveblog-12960215.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Among sectors, except auto and consumer durables, all other sectoral indices are trading in the green with power, metal, media up 1 percent each.  Power Grid Corp, Bajaj Finance, Bajaj Finserv, Bharat Electronics, Shriram Finance are among major gainers on the Nifty, while losers are IndusInd Bank, M&M, Bajaj Auto, Trent, Titan Company. BSE Midcap and Smallcap indices are trading flat.",
            "pubDate": "2025-03-10T04:26:11.852634"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-61-12959542.html",
            "description": "US stocks finished higher on Friday, rebounding from early declines after Federal Reserve Chair Jerome Powell said the economy was \"in a good place,\" but uncertainty about U.S. trade policy led to Wall Street's biggest weekly decline in months.",
            "pubDate": "2025-03-10T04:26:11.852702"
        },
        {
            "title": "Stocks to Watch Today: Lupin, Tata Power, Nazara Tech, Shilpa Medicare, GMR Airports, IRB Infra, Railtel, Shyam Metalics in focus on 10 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-lupin-tata-power-nazara-tech-shilpa-medicare-gmr-airports-irb-infra-railtel-shyam-metalics-in-focus-on-10-march-12960206.html",
            "description": "Stocks to Watch, Mar 10: Stocks like India Pesticides, HFCL, NDR Auto Components, JSW Steel, GR Infraprojects, Biocon, Oil and Natural Gas Corporation, Container Corporation of India, Thangamayil Jewellery, Hinduja Global Solutions, IRB Infrastructure Developers, and AstraZeneca Pharma will be in focus on March 10.",
            "pubDate": "2025-03-10T04:26:11.852767"
        },
        {
            "title": "SPML Infra shares rally 5% on bagging Rs 618 crore irrigation project in Jharkhand",
            "link": "https://www.moneycontrol.com/news/business/stocks/spml-infra-shares-rally-5-on-bagging-rs-618-crore-irrigation-project-in-jharkhand-12960396.html",
            "description": "The project, that will be implemented on a turnkey basis, includes a 10-year post-construction phase for Operation, Maintenance, and Management (O&M), ensuring long-term sustainability and efficiency",
            "pubDate": "2025-03-10T07:50:58.386039"
        },
        {
            "title": "Sensex up 200 pts, Nifty at 22,600 as metal, FMCG stocks gain; oil & gas, realty drag",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-up-200-pts-nifty-at-22-600-as-metal-fmcg-stocks-gain-oil-gas-realty-drag-12960446.html",
            "description": "The declining intensity of FII selling witnessed last week is a positive. However, the market momentum witnessed last week is unlikely to continue beyond a point since the element of uncertainty is high, experts say.",
            "pubDate": "2025-03-10T07:50:58.386119"
        },
        {
            "title": "Metal shares surge to extend gains for a fifth session on Jefferies' bullish call",
            "link": "https://www.moneycontrol.com/news/business/markets/metal-shares-surge-to-extend-gains-for-a-fifth-session-on-jefferies-bullish-call-12960400.html",
            "description": "Steel stocks have been on the rise since past week after China announced it would restructure its steel industry to cut the total output. The latest move by China is expected to reduce the dumping of cheap steel into the Indian market, seen as a major positive for the domestic steel manufacturers.",
            "pubDate": "2025-03-10T07:50:58.386192"
        },
        {
            "title": "Chart of the Day: A historical perspective on market declines and recovery",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-a-historical-perspective-on-market-declines-and-recovery-12960452.html",
            "description": "The Indian stock market has been on a decline since its peak in September 2024, with Foreign Institutional Investor (FII) sell-offs playing a key role. As investors assess whether the downturn is nearing its end, historical data offers insights into potential recovery timelines.",
            "pubDate": "2025-03-10T07:50:58.386354"
        },
        {
            "title": "Trent shares fall over 2% as Kotak Institutional Equities cuts estimate, cites revenue pressure",
            "link": "https://www.moneycontrol.com/news/business/markets/trent-shares-fall-over-2-as-kotak-institutional-equities-cuts-estimate-cites-revenue-pressure-12960422.html",
            "description": "Trent share price: The stock has been volatile amid reports of Reliance Retail relaunching Shein in India, sparking concerns over competition for Zudio and Aditya Birla Fashion.",
            "pubDate": "2025-03-10T07:50:58.386425"
        },
        {
            "title": "Aavas Financiers shares surge 9% amid high trading volumes",
            "link": "https://www.moneycontrol.com/news/business/stocks/aavas-financiers-shares-surge-9-amid-high-trading-volumes-12960330.html",
            "description": "Nearly 1.78 lakh shares of the company were involved in active trade, as seen at 10.40 am. This is over 12 times higher than the stock's 10-day average trading volume.",
            "pubDate": "2025-03-10T07:50:58.386495"
        },
        {
            "title": "Accumulate VA Tech Wabag; target of Rs 1571: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-va-tech-wabag-target-of-rs-1571-geojit-financial-services-12960399.html",
            "description": "Geojit Financial Services recommended accumulate rating on VA Tech Wabag with a target price of Rs 1571 in its research report dated March 07, 2025.",
            "pubDate": "2025-03-10T07:50:58.386560"
        },
        {
            "title": "BSE Smallcap, Midcap are trading flat; Trump tariffs continue to tarnish investor sentiments",
            "link": "https://www.moneycontrol.com/news/business/markets/bse-smallcap-midcap-are-trading-flat-trump-tariffs-continue-to-tarnish-investor-sentiments-12960335.html",
            "description": "BSE Midcap and Smallcap are registering highs and lows close to about a percent, while Sensex and Nifty began today's trade on a positive note of over a percent's gain.",
            "pubDate": "2025-03-10T07:50:58.386625"
        },
        {
            "title": "Buy Oil and Natural Gas Corporation; target of Rs 261: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-oil-and-natural-gas-corporation-target-of-rs-261-geojit-financial-services-12960391.html",
            "description": "Geojit Financial Services is bullish on Oil and Natural Gas Corporation has recommended buy rating on the stock with a target price of Rs 261 in its research report dated March 07, 2025.",
            "pubDate": "2025-03-10T07:50:58.386688"
        },
        {
            "title": "Samvardhana Motherson, Bharat Forge set to benefit from electronics push, says Jefferies",
            "link": "https://www.moneycontrol.com/news/business/markets/samvardhana-motherson-bharat-forge-set-to-benefit-from-electronics-push-says-jefferies-12960236.html",
            "description": "Samvardhana Motherson has also formed a joint venture with Hong Kong-based Crystan, a supplier to tech giant Apple, marking its deepening play in the electronics supply chain.",
            "pubDate": "2025-03-10T07:50:58.386948"
        },
        {
            "title": "IndusInd Bank slips to lowest since July 2022 as investors weigh extension for CEO, target price cuts",
            "link": "https://www.moneycontrol.com/news/business/stocks/indusind-bank-top-sensex-loser-as-investors-weigh-extension-for-ceo-target-price-cuts-12960279.html",
            "description": "The Reserve Bank of India has approved the reappointment of Sumant Kathpalia as the managing director and CEO of the bank for another one year, with effect from March 24, 2025. The bank had sought a three-year term for Kathpalia.",
            "pubDate": "2025-03-10T07:50:58.387010"
        },
        {
            "title": "Analysts Call Tracker: Capacity expansion, reduced Apollo 24/7 losses turns Street bullish on Apollo Hospitals",
            "link": "https://www.moneycontrol.com/news/business/markets/analysts-call-tracker-capacity-expansion-reduced-apollo-24-7-losses-turns-street-bullish-on-apollo-hospitals-12961053.html",
            "description": "According to Moneycontrol's Analyst Call Tracker, 'buy' calls for the stock increased from 22 last month to 25 in February, while 'hold' calls dropped to two from three. Meanwhile, the 'sell' rating declined to just one from the previous three.",
            "pubDate": "2025-03-10T14:38:57.768785"
        },
        {
            "title": "Maharashtra hikes tax on CNG vehicles by 1%, additional 6% tax on select EVs; shares of car makers, MGL fall",
            "link": "https://www.moneycontrol.com/news/business/stocks/maharashtra-hikes-tax-on-cng-vehicles-by-1-additional-6-tax-on-select-evs-shares-of-car-makers-mgl-fall-12960812.html",
            "description": "During his Budget speech, Deputy CM and Finance Minister Ajit Pawar said the tax hike on CNG vehicles is estimated to generate an additional Rs 150 crore in revenue for the state.",
            "pubDate": "2025-03-10T14:38:57.768870"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on March 10",
            "link": "https://www.moneycontrol.com/news/business/markets/top-gainers-and-losers-today-stocks-that-moved-the-most-on-march-10-12960624.html",
            "description": "The market initially saw an upward movement, led by heavyweights pushing the index higher, which failed to sustain. In the second half of the trading session, a sharp decline in the mid and smallcap space weighed heavily on the index.",
            "pubDate": "2025-03-10T14:38:57.768939"
        },
        {
            "title": "Taking Stock: Nifty slips below 22,500 amid last hour selling; Sensex down 217 points",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-slips-below-22-500-amid-last-hour-selling-sensex-down-217-points-12960659.html",
            "description": "IndusInd Bank, Trent, ONGC, Eicher Motors, Bajaj Auto were among major losers on the Nifty, while gainers included Power Grid Corp, HUL, Infosys, SBI Life, Nestle India.",
            "pubDate": "2025-03-10T14:38:57.769005"
        },
        {
            "title": "Live: Nifty Back Below 22,500; Midcaps Crack As Selloff Resumes| IndusInd Bank In Focus|Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-back-below-22-500-midcaps-crack-as-selloff-resumes-indusind-bank-in-focus-closing-bell-12960674.html",
            "description": "Nifty reversed sharply after reclaiming 22,650, dragging broader markets down, with the midcap index falling 1.5%. US futures dropped over 1%, while European markets traded in the red. The NSE advance-decline ratio weakened, with all sectors except FMCG in the red. NIFTY IT reversed gains, and auto, PSU banks, realty, and consumer durables were among the top losers. Catch Nandita Khemka and Yatin Mota as they discuss stocks on their radar.",
            "pubDate": "2025-03-10T14:38:57.769073"
        },
        {
            "title": "JSW Steel shares fire up to 4-month high on spike in Feb steel output",
            "link": "https://www.moneycontrol.com/news/business/markets/jsw-steel-shares-fire-up-to-4-month-high-on-spike-in-feb-steel-output-12960631.html",
            "description": "JSW Steel’s shares have risen 8.1 percent in the past week, supported by a weaker US dollar index, China’s economic stimulus measures, and Beijing’s announced production cuts, which are expected to ease global oversupply and support steel prices.",
            "pubDate": "2025-03-10T14:38:57.769142"
        },
        {
            "title": "Sensex tumbles 620 pts from day's high, Nifty below 22,500; mid, smallcap indices fall up to 2%",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-tumbles-650-pts-from-day-s-high-nifty-below-22-500-mid-smallcap-indices-fall-up-to-2-12960596.html",
            "description": "Nifty Oil and Gas index plunged the most (1.9%) led by a fall in ONGC, Reliance Industries, and BPCL. Public sector banks closely followed (1.8%) driven by a fall in SBI and Bank of Baroda.",
            "pubDate": "2025-03-10T14:38:57.769208"
        },
        {
            "title": "Bodal Chemicals shares surge 18% as govt imposes anti-dumping duty on TCCA imports from China and Japan",
            "link": "https://www.moneycontrol.com/news/business/stocks/bodal-chemicals-shares-surge-18-as-govt-imposes-anti-dumping-duty-on-tcca-imports-from-china-and-japan-12960520.html",
            "description": "Bodal Chemicals is the sole Indian producer of Trichloro Isocyanuric Acid",
            "pubDate": "2025-03-10T14:38:57.769277"
        },
        {
            "title": "BSE shares falls 4% after Nuvama lowers target citing NSE's expiry day change",
            "link": "https://www.moneycontrol.com/news/business/markets/bse-shares-falls-4-after-nuvama-lowers-target-says-change-in-expiry-day-to-squeeze-derivative-volumes-12960482.html",
            "description": "Nuvama has lowered its Price-to-Earnings (P/E) projection for BSE to 40x and slashed target price to Rs 5,160 from Rs 7250 per share.",
            "pubDate": "2025-03-10T14:38:57.769343"
        },
        {
            "title": "Buy Bharti Airtel; target of Rs 1815: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-bharti-airtel-target-of-rs-1815-geojit-financial-services-12960544.html",
            "description": "Geojit Financial Services is bullish on Bharti Airtel has recommended buy rating on the stock with a target price of Rs 1815 in its research report dated March 10, 2025.",
            "pubDate": "2025-03-10T14:38:57.769410"
        }
    ]
}