{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-23T03:30:20.045659",
    "items": [
        {
            "title": "Aurobindo Pharma shares in focus post UK's MHRA approval for cancer drug",
            "link": "https://www.moneycontrol.com/news/business/stocks/aurobindo-pharma-shares-in-focus-post-uk-s-mhra-approval-for-cancer-drug-12895535.html",
            "description": "Aurobindo Pharma Share Price | Bevacizumab is used in the treatment of multiple cancers including metastatic colorectal cancer, recurrent or metastatic non-squamous non-small cell lung cancer, advanced and/or metastatic renal cell carcinoma, cervical cancer and epithelial ovarian, fallopian tube and primary peritoneal cancer.",
            "pubDate": "2024-12-23T02:32:50.208414"
        },
        {
            "title": "NTPC Green Energy shares in focus on signing MoU for renewable energy projects",
            "link": "https://www.moneycontrol.com/news/business/stocks/ntpc-green-energy-shares-in-focus-on-signing-mou-for-renewable-energy-projects-12895536.html",
            "description": "NTPC Green Energy Share Price | The Government of Bihar will facilitate the necessary permissions, registrations, approvals, and clearances from concerned departments, agencies, and authorities to support the projects.",
            "pubDate": "2024-12-23T02:32:50.208503"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a strong start; US, Asian markets gain",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-23-12-2024-liveblog-12895605.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks rallied to close out the trading week on Friday after two lackluster sessions as a cooler-than-expected inflation report and comments from Federal Reserve officials eased worries about the path of interest rates. The Dow Jones Industrial Average rose 498.82 points, or 1.18%, to 42,841.06, the S&P 500 gained 63.82 points, or 1.09%, to 5,930.90 and the Nasdaq Composite gained 199.83 points, or 1.03%, to 19,572.60.",
            "pubDate": "2024-12-23T02:32:50.208580"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-15-12895101.html",
            "description": "The GIFT Nifty is indicating a positive start for the day.",
            "pubDate": "2024-12-23T02:32:50.208659"
        },
        {
            "title": "Trade Spotlight: How should you trade Dr Reddy's Labs, Aegis Logistics, Techno Electric, KFin Technologies, Religare Enterprises, and others on Monday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-dr-reddy-s-labs-aegis-logistics-techno-electric-kfin-technologies-religare-enterprises-and-others-on-monday-12895584.html",
            "description": "The sentiment remains bearish, but considering the severe fall last week, consolidation and range-bound trade are possible. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-23T02:32:50.208732"
        },
        {
            "title": "Stock Radar: NTPC Green Energy, TCS, TeamLease, UltraTech Cement, Laurus Labs, Aurobindo Pharma, HCC in focus on Monday",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-ntpc-green-energy-tcs-teamlease-ultratech-cement-laurus-labs-aurobindo-pharma-hcc-in-focus-on-monday-12895583.html",
            "description": "Stocks To Watch for Dec 23: Stocks like Fortis Healthcare, Laurus Labs, India Cements, Tata Consultancy Services, Dalmia Bharat, Vedanta, Piramal Enterprises, Renaissance Global, AGI Greenpac, Indian Oil Corporation, and AGS Transact Technologies will also be in focus on December 23.",
            "pubDate": "2024-12-23T02:32:50.208803"
        },
        {
            "title": "Morgan Stanley initiates 'equal-weight' call on Niva Bupa; sees 15% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/morgan-stanley-initiates-equal-weight-call-on-niva-bupa-sees-15-upside-12895631.html",
            "description": "Morgan Stanley touted Niva Bupa as a \"strong franchise with a secular growth opportunity.\" The brokerage views the health insurer as well positioned to take advantage of the growth in India's health insurance sector.",
            "pubDate": "2024-12-23T03:30:19.168408"
        }
    ]
}