{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-05-15T05:45:47.867869",
    "items": [
        {
            "title": "Agri Picks Report May 15, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-may-15-2025-geojit-financial-services-13026077.html",
            "description": "According to Geojit Financial Services, The area under summer crops across India was at 7.88 million hectares as of Friday, up nearly 10% from 7.19 million hectares a year ago, according to data released by the agriculture ministry on Wednesday.",
            "pubDate": "2025-05-15T04:45:14.451668"
        },
        {
            "title": "Berger Paints Q4: Gaining market share despite emerging competition",
            "link": "https://www.moneycontrol.com/news/business/earnings/berger-paints-q4-gaining-market-share-despite-emerging-competition-13026033.html",
            "description": "Outperforming industry growth amid challenging market conditions",
            "pubDate": "2025-05-15T04:45:14.451757"
        },
        {
            "title": "GAIL: A better transmission volume remains the biggest bet",
            "link": "https://www.moneycontrol.com/news/business/earnings/gail-a-better-transmission-volume-remains-the-biggest-bet-13025958.html",
            "description": "The company is expected to capitalise on the growing natural gas consumption demand",
            "pubDate": "2025-05-15T04:45:14.451832"
        },
        {
            "title": "Live: Nifty bounces off lows, but is 25,000 the next stop? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-bounces-off-lows-but-is-25-000-the-next-stop-opening-bell-13025979.html",
            "description": "Markets largely ended in the green with continued buying in the broader segments, led by the Nifty Midcap index which outperformed the benchmarks. Defence stocks saw sustained interest, rising up to 15%, while India VIX cooled off further, dropping 5%. However, Bank Nifty slipped 150 points to close at 54,801. On the earnings front, LIC Housing and JSW Energy are set to announce their Q4 results today, while Eicher Motors and Tata Power are expected to react to their recently reported numbers. This morning, global cues were largely lower. US markets ended mixed overnight while Asia-Pacific markets started the day largely lower. Catch Lovisha Darad in conversation with Kunal Rambhia—Fund Manager, The Streets (Technical) and Kush Gupta, Director at SKG Investment & Advisory.",
            "pubDate": "2025-05-15T04:45:14.451903"
        },
        {
            "title": "Growth outlook dims for room AC makers",
            "link": "https://www.moneycontrol.com/news/opinion/growth-outlook-dims-for-room-ac-makers-13025989.html",
            "description": "Pre-monsoon showers and the soft summer season have weighed on sales so far in Q1 FY26",
            "pubDate": "2025-05-15T04:45:14.451973"
        },
        {
            "title": "Stocks to Watch Today: Eicher Motors, Apollo Tyres, Lupin, Wendt India, HUL, Brigade, Genesys, Wipro, Shilpa Medicare, Yes Bank, Vascon Engineers in focus on 15 May",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-eicher-motors-apollo-tyres-wendt-india-hul-brigade-genesys-wipro-shilpa-medicare-yes-bank-vascon-engineers-in-focus-on-15-may-13025891.html",
            "description": "Stocks to Watch, 15 May: Stocks like Wendt India, Infosys, Hindustan Unilever, Brigade Enterprises, Genesys International Corporation, Wipro, Shilpa Medicare, Kirloskar Brothers, State Bank of India, Yes Bank, Gensol Engineering, Allcargo Logistics, Edelweiss Financial Services, Max Healthcare Institute, Navin Fluorine International, and Waaree Energies will be in focus on May 15.",
            "pubDate": "2025-05-15T04:45:14.452048"
        },
        {
            "title": "Brigade Enterprises acquires land in Chennai, announces Q4 results; stock trades lower",
            "link": "https://www.moneycontrol.com/news/business/stocks/brigade-enterprises-shares-in-focus-on-land-acquisition-in-chennai-q4-results-13025653.html",
            "description": "Brigade Enterprises Share Price | The company's Q4FY25 net profit jumped 19.7 percent to Rs 246.82 crore from Rs 206.09 crore in the same quarter of previous year.",
            "pubDate": "2025-05-15T04:45:14.452113"
        },
        {
            "title": "Shilpa Medicare shares rise 3% on EIR from USFDA",
            "link": "https://www.moneycontrol.com/news/business/stocks/shilpa-medicare-shares-in-focus-on-eir-from-usfda-13025766.html",
            "description": "Shilpa Medicare Share Price | The share touched a 52-week high of Rs 959.95 and a 52-week low of Rs 419.10 on 18 September, 2024 and 04 June, 2024, respectively.",
            "pubDate": "2025-05-15T04:45:14.452179"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty around 24,500, Sensex slips 500 pts; Power Grid, NTPC, Kotak Bank top losers",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-15-05-2025-liveblog-13025889.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Among sectors, except auto, media, metal, all other indices are trading in the red. BSE Midcap index up 0.3 percent and smallcap index up 0.6 percent. JSW Steel, Hero MotoCorp, Tata Motors, Shriram Finance, Adani Ports are among major gainers on the Nifty, while losers are ONGC, Dr Reddy's Lab, Power Grid Corp, Kotak Mahindra Banka and NTPC.",
            "pubDate": "2025-05-15T04:45:14.452243"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-102-13024878.html",
            "description": "The Foreign institutional investors (FIIs) bought equities worth Rs 931 crore on May 14, while Domestic institutional investors (DIIs) purchased equities of Rs 316 crore on the same day.",
            "pubDate": "2025-05-15T04:45:14.452323"
        },
        {
            "title": "Bulk & Block deals: CLSA Global Markets Fund sold 1.2% stake in Edelweiss Financial Services",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-block-deals-clsa-global-markets-fund-sold-1-2-stake-in-edelweiss-financial-services-13025846.html",
            "description": "In Info Edge, Citigroup Global Markets Mauritius Pvt Ltd bought 2,12,700 shares at Rs 1,464.5 apiece",
            "pubDate": "2025-05-15T04:45:14.452391"
        },
        {
            "title": "Hero MotoCorp shares rise as strong Q4, rural demand and EV plans boost sentiment",
            "link": "https://www.moneycontrol.com/news/business/stocks/hero-motocorp-shares-rise-as-strong-q4-rural-demand-and-ev-plans-boost-sentiment-13026095.html",
            "description": "India’s largest two-wheeler maker is aiming to outpace the industry’s projected 6–7 percent growth this fiscal, buoyed by robust rural demand, signs of recovery in the entry-level segment, and fresh momentum in the 125cc motorcycle lineup.",
            "pubDate": "2025-05-15T05:45:45.815827"
        },
        {
            "title": "Jubilant Foodworks: India business outlook strong; valuation expensive",
            "link": "https://www.moneycontrol.com/news/business/stocks/jubilant-foodworks-india-business-outlook-strong-valuation-expensive-13026359.html",
            "description": "While India business outlook is robust, DP Eurasia (mainly Turkey business) is currently facing macroeconomic challenges, owing to hyper inflation",
            "pubDate": "2025-05-15T05:45:45.815896"
        },
        {
            "title": "Which bag to pack for your investment journey?",
            "link": "https://www.moneycontrol.com/news/business/earnings/which-bag-to-pack-for-your-investment-journey-13026070.html",
            "description": "Luggage sector saw a difficult going in FY25, can things change for the better?",
            "pubDate": "2025-05-15T05:45:45.815964"
        },
        {
            "title": "Tata Power to bid for UP discoms to expand T&D presence, plans Rs 25,000 crore capex this fiscal",
            "link": "https://www.moneycontrol.com/news/business/stocks/tata-power-to-bid-for-up-discoms-to-expand-t-d-presence-plans-rs-25-000-crore-capex-this-fiscal-13026173.html",
            "description": "Tata Power intends to bid for two discoms in Uttar Pradesh under its broader strategy to grow its transmission and distribution (T&D) business.",
            "pubDate": "2025-05-15T05:45:45.816029"
        }
    ]
}