{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-10-12T13:54:23.898358",
    "items": [
        {
            "title": "Trade Spotlight: How should you trade Tata Communications, IndusInd Bank, CDSL, Kajaria Ceramics, South Indian Bank, JK Paper, and others on October 13?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-tata-communications-indusind-bank-cdsl-kajaria-ceramics-south-indian-bank-jk-paper-and-others-on-october-13-13611228.html",
            "description": "The market may witness some correction following Friday’s turmoil in US counterparts. Still, technically, the trend remains upward as long as the index stays above all EMAs. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-10-12T13:54:14.843673"
        },
        {
            "title": "Two billion-dollar debuts test strength of hot India IPO market",
            "link": "https://www.moneycontrol.com/news/business/two-billion-dollar-debuts-test-strength-of-hot-india-ipo-market-13610856.html",
            "description": "Tata Group’s shadow-lending unit, which raised 155 billion rupees ($1.7 billion) in India’s largest IPO this year, will list on Monday, followed by the Indian unit of South Korea’s LG Electronics Inc. a day later. LG’s sale was the most oversubscribed deal of that size in 17 years.",
            "pubDate": "2025-10-12T13:54:14.843749"
        },
        {
            "title": "Chartist Talk: Nifty’s 24,950 support at risk amid fresh US-China trade tensions, warns SBI Securities' Sudeep Shah",
            "link": "https://www.moneycontrol.com/news/business/markets/chartist-talk-nifty-s-24-950-support-at-risk-amid-fresh-us-china-trade-tensions-warns-sbi-securities-sudeep-shah-13610830.html",
            "description": "While the undertone remains positive, investors should keep an eye on global developments, as renewed tariff tensions between the US and China could inject short-term volatility into the otherwise festive rally, Sudeep Shah advised.",
            "pubDate": "2025-10-12T13:54:14.843816"
        },
        {
            "title": "Small caps rise up to 41% despite muted index return",
            "link": "https://www.moneycontrol.com/news/business/stocks/small-caps-rise-up-to-41-despite-muted-index-return-13610208.html",
            "description": "For the week, the  BSE Sensex index added 1293.65 points or 1.59 percent to finish at 82,500.82, and the Nifty50 rose 391.1 points or 1.57 percent to end at 25,285.35.",
            "pubDate": "2025-10-12T13:54:14.843875"
        },
        {
            "title": "Use Options OI for intraday trading: Shubham Agarwal",
            "link": "https://www.moneycontrol.com/news/trends/expert-columns/use-options-oi-for-intraday-trading-shubham-agarwal-13610035.html",
            "description": "Since Option Sellers are taking unlimited (better put Unknown) risk to get small premium, they are expected to have better grip on the underlying stock or index’s expected movement.",
            "pubDate": "2025-10-12T13:54:14.843934"
        },
        {
            "title": "Market extends gain in second week on FII support; Capital Market, IT stocks shine",
            "link": "https://www.moneycontrol.com/news/photos/business/markets/market-extends-gain-in-second-week-on-fii-support-capital-market-it-stocks-shine-13610203.html",
            "description": "Among sectors, Nifty Capital Market and IT indices remained top performers with 5 percent gain, followed by Nifty Healthcare index (up 3 percent), Nifty Realty index (up 2.3 percent), Nifty Private Bank, Nifty Consumer Durables, Nifty Pharma up 2 percent each. However, Nifty Media index shed nearly 3 percent.",
            "pubDate": "2025-10-12T13:54:14.843992"
        },
        {
            "title": "Wall Street sells off as Trump hits China with more tariffs",
            "link": "https://www.moneycontrol.com/news/business/markets/wall-street-sells-off-as-trump-hits-china-with-more-tariffs-13610202.html",
            "description": "The Dow Jones Industrial Average fell 878.82 points, or 1.90%, to 45,479.60, the S&P 500 lost 182.60 points, or 2.71%, to 6,552.51 and the Nasdaq Composite lost 820.20 points, or 3.56%, to 22,204.43.",
            "pubDate": "2025-10-12T13:54:14.844046"
        },
        {
            "title": "S&P 500 drops most in six months on Trump tariff spat with China",
            "link": "https://www.moneycontrol.com/news/business/s-p-500-drops-most-in-six-months-on-trump-tariff-spat-with-china-13610187.html",
            "description": "The S&P 500 Index wiped out its weekly advance after tumbling 2.7%, its worst day since April 10, when the tariff-induced selloff rattled financial markets.",
            "pubDate": "2025-10-12T13:54:14.844104"
        }
    ]
}