{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-03T04:21:34.896077",
    "items": [
        {
            "title": "RailTel Corporation share price in focus on orders win worth Rs 63.55 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/railtel-corporation-share-price-in-focus-on-orders-win-worth-rs-63-55-crore-12953927.html",
            "description": "RailTel Corporation of India Share Price | The share touched a 52-week high of Rs 618 and a 52-week low of Rs 275.30 on 12 July, 2024 and 28 February, 2025, respectively.",
            "pubDate": "2025-03-03T02:37:04.636701"
        },
        {
            "title": "TVS Motor share price in focus on better sales data",
            "link": "https://www.moneycontrol.com/news/business/stocks/tvs-motor-share-price-in-focus-on-better-sales-data-12953929.html",
            "description": "TVS Motor Company Share Price | In the International Business, the company's total exports grew by 26 percent at 1,24,993 units. The two-wheeler exports registered a growth of 28 percent with 1,15,817 units and three-wheeler registered a growth of 14 percent with sales of 12,087 units in February 2025.",
            "pubDate": "2025-03-03T02:37:04.636780"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a positive start; US markets gain, Asia mixed",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-03-03-2025-liveblog-12954395.html",
            "description": "Sensex Today | Stock Market LIVE Updates:  Wall Street ended higher on Friday after a choppy trading session, with Dell Technologies dipping and other tech stocks climbing after a meeting between the U.S. President Donald Trump and Ukrainian counterpart Volodymyr Zelenskiy ended in disaster. The S&P 500 climbed 1.59% to end the session at 5,954.50 points. The Nasdaq gained 1.63% to 18,847.28 points, while the Dow Jones Industrial Average rose 1.39% to 43,840.91 points.",
            "pubDate": "2025-03-03T02:37:04.636875"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-56-12953593.html",
            "description": "The Foreign institutional investors (FIIs) sold equities worth Rs 11,639 crore on February 28. However, domestic institutional investors (DIIs) bought equities worth Rs 12,308.63 crore, on the same day.",
            "pubDate": "2025-03-03T02:37:04.636943"
        },
        {
            "title": "Chartist Talks: Surely these 2 stocks likely to outperform benchmark index in March, says Rahul Ghose of Hedged",
            "link": "https://www.moneycontrol.com/news/business/markets/chartist-talks-surely-these-2-stocks-likely-to-outperform-benchmark-index-in-march-says-rahul-ghose-of-hedged-12954353.html",
            "description": "Even at this price it is good to start to accumulate names like Larsen & Toubro, Reliance Industries, Tata Motors and some FMCG names like Asian Paints to name a few, says Rahul Ghose.",
            "pubDate": "2025-03-03T02:37:04.637010"
        },
        {
            "title": "Trade Spotlight: How should you trade HDFC Bank, Coal India, Granules, BSE, Ipca Labs, UltraTech Cement, and others on March 3?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-hdfc-bank-coal-india-granules-bse-ipca-labs-ultratech-cement-and-others-on-march-3-12954333.html",
            "description": "The rebound after a severe fall can't be ruled out, but the sustainability is key to watch. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-03T02:37:04.637081"
        },
        {
            "title": "Stocks to Watch Today: Tata Motors, Paytm, TVS Motor, NLC India, Piramal Enterprises, International Gemmological Institute, M&M in focus on 3 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tata-motors-paytm-tvs-motor-nlc-india-piramal-enterprises-international-gemmological-institute-m-m-in-focus-on-3-march-12954332.html",
            "description": "Stocks To Watch, Mar 3: Stocks like Foseco India, Rana Sugars, Maruti Suzuki India, Hyundai Motor India, Eicher Motors, Escorts Kubota, SML Isuzu, Atul Auto, VST Tillers, Dr Agarwals Health Care, Bajaj Auto, Indian Overseas Bank, Voltas, Mankind Pharma, Ujjivan Small Finance Bank, Dalmia Bharat, and Tata Communications will be in focus on March 3.",
            "pubDate": "2025-03-03T02:37:04.637149"
        },
        {
            "title": "Live: Can Nifty hold 22,000 or is there more pain left? | Auto stocks in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-hold-22-000-or-is-there-more-pain-left-auto-stocks-in-focus-opening-bell-12954446.html",
            "description": "The market wrapped up the month of February on a weak note, where we saw that the Nifty shed up to 16 percent from its lifetime high. Even in the last session, investors wealth was wiped out by a whopping Rs 20 lakh crore. This week, markets will react to India's GDP data, which has come in-line with Street estimates and has recovered from seven quarter lows. Auto sales figures, FII flows, US President Donald Trump's tariff announcements, among others will also decide market trends. This morning, global cues were largely strong. US markets ended higher on Friday and US futures also edged up overnight. Meanwhile, Asian markets also started the day on a positive note despite uncertainity on US President Donald Trump's tariff plans. Among stocks, watch out for auto names, Voltas, and Ujjivan Small Finance Bank in today's trading session. Catch Lovisha Darad in conversation with Sudeep Shah, Head of Technical &amp; Derivative Research, SBI Securities and Aishvarya Dadheech, Founder &amp; CIO, Fident Asset Management.",
            "pubDate": "2025-03-03T03:36:41.442071"
        },
        {
            "title": "A long road to normalcy for SpiceJet",
            "link": "https://www.moneycontrol.com/news/opinion/a-long-road-to-normalcy-for-spicejet-12954431.html",
            "description": "The company is attempting a revival after getting a fund infusion from qualified institutional placement",
            "pubDate": "2025-03-03T03:36:41.442161"
        },
        {
            "title": "Paytm shares in focus on show cause notice from ED on FEMA violations",
            "link": "https://www.moneycontrol.com/news/business/stocks/paytm-shares-in-focus-on-show-cause-notice-from-ed-on-fema-violations-12954426.html",
            "description": "The Enforcement Directorate slapped One97 Communicaitions with a FEMA violation notice for its subsidiaries, Little Internet and Nearbuy India.",
            "pubDate": "2025-03-03T03:36:41.442237"
        },
        {
            "title": "TVS Motors, M&M, Ashok Leyland, Eicher Motors shares rev up to 4% on healthy auto sales",
            "link": "https://www.moneycontrol.com/news/business/markets/tvs-motors-m-m-ashok-leyland-eicher-motors-shares-rev-up-to-4-on-healthy-auto-sales-12954464.html",
            "description": "Strong sales growth for TVS Motor, M&M, Ashok Leyland, and Eicher Motors drove investor buying, while weak numbers pressured Tata Motors, Hyundai, Maruti Suzuki, Bajaj Auto, and Hero MotoCorp.",
            "pubDate": "2025-03-03T04:21:33.208320"
        },
        {
            "title": "Agri Picks Report March 03, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-03-2025-geojit-financial-services-12954465.html",
            "description": "According to Geojit Financial Services, India witnessed the highest ever all-India mean and minimum temperatures for February since records began in 1901, the India Meteorological Department said.",
            "pubDate": "2025-03-03T04:21:33.208405"
        },
        {
            "title": "Goldman Sachs cuts target on BSE shares amid SEBI's proposed changes on monitoring risk",
            "link": "https://www.moneycontrol.com/news/business/stocks/goldman-sachs-cuts-target-on-bse-shares-amid-sebi-s-proposed-changes-on-monitoring-risk-12954451.html",
            "description": "SEBI proposed changing from the current method for computing open interest in the equity derivatives segment in a consultation paper, released on February 24, 2025.",
            "pubDate": "2025-03-03T04:21:33.208505"
        }
    ]
}