{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-06-03T14:42:11.770135",
    "items": [
        {
            "title": "Telecom minister Scindia rules out any more govt relief for Voda Idea: Report",
            "link": "https://www.moneycontrol.com/news/business/companies/telecom-minister-scindia-rules-out-any-more-govt-relief-for-voda-idea-report-13088551.html",
            "description": "Jyotiraditya Scindia said that Vodafone Idea won’t be bailed out further through the equity conversion route",
            "pubDate": "2025-06-03T04:44:57.297653"
        },
        {
            "title": "Mrs Bectors Food Specialities: Will it resume industry leading earnings growth?",
            "link": "https://www.moneycontrol.com/news/business/stocks/mrs-bectors-food-specialities-will-it-resume-industry-leading-earnings-growth-13089023.html",
            "description": "MBFSL is accelerating new product launches (with a focus on premiumisation) which would remain the key growth driver",
            "pubDate": "2025-06-03T04:44:57.297735"
        },
        {
            "title": "Chart of the Day: The transformation at dairy companies",
            "link": "https://www.moneycontrol.com/news/opinion/chart-of-the-day-the-transformation-at-dairy-companies-13088654.html",
            "description": "Revenues from value-added products are rising faster than liquid milk sales",
            "pubDate": "2025-06-03T04:44:57.297804"
        },
        {
            "title": "India is using only 20% of its 20 GW annual wind turbine manufacturing capacity: Suzlon Group CEO",
            "link": "https://www.moneycontrol.com/news/interview/india-is-using-only-20-of-its-20-gw-annual-wind-turbine-manufacturing-capacity-suzlon-group-ceo-13092299.html",
            "description": "At the current pace, I believe we will be able to reach 85-90 GW against the 100 GW target by 2030, which would also be a decent achievement, said JP Chalasani, CEO, Suzlon Group.",
            "pubDate": "2025-06-03T12:52:31.805750"
        },
        {
            "title": "Zydus Lifesciences in licensing deal with America's Agenus for cancer therapy",
            "link": "https://www.moneycontrol.com/news/business/companies/zydus-lifesciences-in-licensing-deal-with-america-s-agenus-for-cancer-therapy-13092298.html",
            "description": "The agreement grants Zydus the rights to Agenus' next-generation immunotherapy platform, which is designed to enhance and sustain the immune system's fight against tumor cells.",
            "pubDate": "2025-06-03T12:52:31.805853"
        },
        {
            "title": "Bird Group’s Roseate Hotels plans acquisitions in France, Italy and Dubai; expands India presence",
            "link": "https://www.moneycontrol.com/news/business/real-estate/bird-group-s-roseate-hotels-plans-acquisitions-in-france-italy-and-dubai-expands-india-presence-13090847.html",
            "description": "The move comes close on the heels of its recent acquisition of Beechfield House, Wiltshire, in the UK. Dubai, Mumbai, Goa and Bengaluru among potential destinations.",
            "pubDate": "2025-06-03T12:52:31.805930"
        },
        {
            "title": "Vodafone Idea's Struggle vs BSNL's Resurgence: A tale of two telecoms",
            "link": "https://www.moneycontrol.com/news/opinion/vodafone-idea-s-struggle-vs-bsnl-s-resurgence-a-tale-of-two-telecoms-13090880.html",
            "description": "State-owned BSNL has reported two consecutive quarterly profits, a first in 18 years, while private sector giant Vodafone Idea continues to struggle with losses. Dues not paid to the government is public money, and such funds should not be available to throw around for running loss making private companies",
            "pubDate": "2025-06-03T12:52:31.806001"
        },
        {
            "title": "'Black swans and gray rhinos': Nestle India's Suresh Narayanan recalls Maggi crisis among 'greatest challenges' in last letter to shareholders",
            "link": "https://www.moneycontrol.com/news/business/companies/black-swans-and-gray-rhinos-nestle-india-s-suresh-narayanan-recalls-maggi-crisis-among-greatest-challenges-of-career-in-last-letter-to-shareholders-13090889.html",
            "description": "Over the last decade, Nestle India's revenue saw a CAGR of 10.3% while profit from operations grew by 13.5%, and the market capitalization rose by 3.9 times, said the chairman, adding that the company is no longer seen as an urban only player.",
            "pubDate": "2025-06-03T12:52:31.806070"
        },
        {
            "title": "Adani mulls entering airport ground services after Celebi’s exit",
            "link": "https://www.moneycontrol.com/news/business/companies/adani-mulls-entering-airport-ground-services-after-celebi-s-exit-13092548.html",
            "description": "Indian regulations require that every major airport with annual passenger traffic of at least a million should have three ground handlers.",
            "pubDate": "2025-06-03T14:42:10.055787"
        },
        {
            "title": "PE firm TPG planning exit from Tata Technologies via block deal route",
            "link": "https://www.moneycontrol.com/news/business/companies/pe-firm-tpg-planning-exit-from-tata-technologies-via-block-deal-route-13092526.html",
            "description": "The stake is held by an entity named TPG Rise Climate Sf Pte Ltd and investment bank BofA Securities is acting on the proposed clean out trade which has been launched, these sources added.",
            "pubDate": "2025-06-03T14:42:10.055878"
        },
        {
            "title": "Adani denies DOJ probe over Iranian LPG shipments: How are India’s energy relations with Tehran?",
            "link": "https://www.moneycontrol.com/news/business/economy/adani-denies-doj-probe-over-iranian-lpg-shipments-how-are-india-s-energy-relations-with-tehran-13092336.html",
            "description": "Iran was the third-largest crude oil supplier to India till 2018-19. After the Trump administration slapped fresh sanctions on Iran in 2018, Indian oil refiners curbed oil purchases from Tehran. India currently does not source crude oil from Iran.",
            "pubDate": "2025-06-03T14:42:10.055952"
        }
    ]
}