{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-07T15:57:12.577914",
    "items": [
        {
            "title": "DIIs now drive IPO pricing, bring stability to markets: PeakXV’s GV Ravishankar",
            "link": "https://www.moneycontrol.com/news/business/markets/diis-now-drive-ipo-pricing-bring-stability-to-markets-peakxv-s-gv-ravishankar-12959037.html",
            "description": "Ravishankar sees this as a healthy shift, bringing balance to the IPO process. “It’s not about right or wrong—it’s just a good equilibrium,” he said, adding that DIIs’ presence has introduced much-needed liquidity",
            "pubDate": "2025-03-07T13:30:06.642257"
        },
        {
            "title": "Live: Nifty breaks 3-week losses, rises nearly 2% | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-breaks-3-week-losses-rises-nearly-2-closing-bell-12959064.html",
            "description": "Nifty, Sensex snap 2-day gaining streak. Nifty, Sensex flat in a choppy session. Nifty Realty, Bank Nifty top sectoral laggards. Nifty Midcap slips in red, smallcaps outperform. Catch Lovisha Darad  in conversation with Aamar Deo Singh, Sr Vice President, Angelone as they discuss the stocks on their radar.",
            "pubDate": "2025-03-07T13:30:06.642346"
        },
        {
            "title": "Reliance shares up for a third day, rise over 3% after Macquarie rates 'Outperform' with a Rs 1,500 target",
            "link": "https://www.moneycontrol.com/news/business/markets/reliance-shares-up-for-a-third-day-rise-over-3-after-macquarie-rates-outperform-with-a-rs-1-500-target-12958973.html",
            "description": "Recently, Jefferies reiterated its 'Buy' call on RIL with a target price of Rs 1,600 per share, citing future growth in the retail business and a potential tariff hike in the telecom unit.",
            "pubDate": "2025-03-07T13:30:06.642419"
        },
        {
            "title": "Overpricing IPOs can hurt investor sentiment for years, says Peak XV’s GV Ravishankar",
            "link": "https://www.moneycontrol.com/news/business/markets/overpricing-ipos-can-hurt-investor-sentiment-for-years-says-peakxv-s-gv-ravishankar-12958934.html",
            "description": "Ravishankar recalled moments when investment bankers and advisors pitched a fair price, only for the market to correct sharply. “Six months later, you’re IPOing at half that price, barely making it,\" Ravishankar said.",
            "pubDate": "2025-03-07T13:30:06.642487"
        },
        {
            "title": "Buy CG Power and Industrial Solutions; target of Rs 1440: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-cg-power-and-industrial-solutions-target-of-rs-1440-geojit-financial-services-12958924.html",
            "description": "Geojit Financial Services is bullish on CG Power and Industrial Solutions has recommended buy rating on the stock with a target price of Rs 1440 in its research report dated March 07, 2025.",
            "pubDate": "2025-03-07T13:30:06.642555"
        },
        {
            "title": "Buy HG Infra Engineering; target of Rs 1440: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-hg-infra-engineering-target-of-rs-1440-geojit-financial-services-12958918.html",
            "description": "Geojit Financial Services is bullish on HG Infra Engineering has recommended buy rating on the stock with a target price of Rs 1440 in its research report dated March 07, 2025.",
            "pubDate": "2025-03-07T13:30:06.642630"
        },
        {
            "title": "Buy V-Guard Industries; target of Rs 393: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-v-guard-industries-target-of-rs-393-geojit-financial-services-12958903.html",
            "description": "Geojit Financial Services is bullish on V-Guard Industries has recommended buy rating on the stock with a target price of Rs 393 in its research report dated March 07, 2025.",
            "pubDate": "2025-03-07T13:30:06.642698"
        },
        {
            "title": "Dollar strength, Nasdaq correction weigh on Indian IT as LTI Mindtree, Infosys, others drag Nifty IT a percent lower",
            "link": "https://www.moneycontrol.com/news/business/markets/dollar-strength-nasdaq-correction-weigh-on-indian-it-as-lti-mindtree-infosys-others-drag-nifty-it-a-percent-lower-12958666.html",
            "description": "The concerns over the impact of the tariffs on the American economy pushed Nasdaq down by nearly 3 percent the previous day.",
            "pubDate": "2025-03-07T13:30:06.642896"
        },
        {
            "title": "Mrs Bectors Food Specialities: Healthy earnings growth to resume from FY26",
            "link": "https://www.moneycontrol.com/news/business/stocks/mrs-bectors-food-specialities-healthy-earnings-growth-to-resume-from-fy26-12958682.html",
            "description": "MBFSL is a quality FMCG company with good scope for market share gains and healthy earnings visibility. It is expanding capacity across product segments such as biscuits and bakery",
            "pubDate": "2025-03-07T13:30:06.642984"
        },
        {
            "title": "Stocks On Radar on March 7: RVNL, Brigade Enterprises, RITES and more",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/stocks-on-radar-on-march-7-rvnl-brigade-enterprises-rites-and-more-12958678.html",
            "description": "RVNL has secured a ₹156.36 crore EPC contract from South Western Railway for the design, supply, erection, testing, and commissioning of a 2X25 KV overhead electrification system and associated power supply installations. Brigade Enterprises has launched Brigade Altius, a premium residential project in Chennai’s IT corridor. RITES has received a ₹27.96 crore contract from South Central Railway for conducting a final location survey for high-speed elevated rail corridors between Hyderabad-Bengaluru and Hyderabad-Chennai. This contract involves preparing a detailed project report (DPR), alignment design, traffic survey, and using advanced survey techniques like LiDAR. Bajaj Finserv reported strong premium collections for February 2025 through its subsidiaries, Bajaj Allianz General and Bajaj Allianz Life Insurance. Bajaj Allianz General Insurance recorded ₹1,219 crore in gross direct premium, while Bajaj Allianz Life Insurance reported ₹1,080.33 crore in new business premiums, reflecting robust growth in the insurance sector. Biocon has partnered with Civica Inc, a non-profit pharmaceutical company, to enhance the accessibility and affordability of insulin aspart in the United States.",
            "pubDate": "2025-03-07T13:30:06.643054"
        },
        {
            "title": "Brigade Enterprises shares up 4% after launching premium high-rise project in Chennai’s IT corridor",
            "link": "https://www.moneycontrol.com/news/business/markets/brigade-enterprises-shares-up-4-after-launching-premium-high-rise-project-in-chennai-s-it-corridor-12958646.html",
            "description": "Brigade Enterprises share price: The project's strategic location ensures seamless connectivity to key business districts, catering to professionals working in the bustling IT corridor.",
            "pubDate": "2025-03-07T13:30:06.643122"
        },
        {
            "title": "Inox India shares snap 3-day gaining streak as investors take profits after post-order rally",
            "link": "https://www.moneycontrol.com/news/business/markets/inox-india-shares-snap-3-day-gaining-streak-as-investors-take-profits-after-post-order-rally-12958615.html",
            "description": "The company also received orders for LNG and industrial gas storage tanks, vaporizers, and other cryogenic equipment, with deliveries scheduled across Europe, the US, and India.",
            "pubDate": "2025-03-07T13:30:06.643187"
        },
        {
            "title": "Inox Wind share price rises 13% after securing 153 MW order from Tamil Nadu",
            "link": "https://www.moneycontrol.com/news/business/markets/inox-wind-share-price-rises-2-after-securing-153-mw-order-from-tamil-nadu-12958631.html",
            "description": "Inox Wind share price: The project in Tamil Nadu will see IWL supplying its 3 MW class turbines and handling operations and maintenance post-commissioning.",
            "pubDate": "2025-03-07T13:30:06.643251"
        },
        {
            "title": "Sundaram Finance: Growth steady, but rich valuation could limit stock upside",
            "link": "https://www.moneycontrol.com/news/business/earnings/sundaram-finance-growth-steady-but-rich-valuation-could-limit-stock-upside-12958605.html",
            "description": "Sequential growth improved amid a difficult operating environment",
            "pubDate": "2025-03-07T13:30:06.643316"
        },
        {
            "title": "Weekly Tactical Pick – This beverage stock is grabbing opportunities, nailing execution",
            "link": "https://www.moneycontrol.com/news/business/stocks/weekly-tactical-pick-this-beverage-stock-is-grabbing-opportunities-nailing-execution-12958596.html",
            "description": "Seasonal tailwinds, improved mix, and expanding international presence to drive growth and margins",
            "pubDate": "2025-03-07T13:30:06.643381"
        },
        {
            "title": "Agri Picks Report March 07, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-07-2025-geojit-financial-services-12958620.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.3 million acres (1 acre = 0.4 hectares) as of Wednesday, up 10.3% from 6.6 million acres a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-03-07T13:30:06.643447"
        },
        {
            "title": "Voltas’s leadership in ACs should yield better profit margins",
            "link": "https://www.moneycontrol.com/news/opinion/voltas-s-leadership-in-acs-should-yield-better-profit-margins-12958570.html",
            "description": "Peer Blue Star is seeing better profitability with lower market share",
            "pubDate": "2025-03-07T13:30:06.643516"
        },
        {
            "title": "Bharat Electronics shares gains 2% on winning orders worth Rs 577 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/bharat-electronics-shares-in-focus-on-winning-orders-worth-rs-577-crore-12958367.html",
            "description": "Bharat Electronics Share Price | The company board on March 5, declared interim dividend of Rs 1.50 per share and fixed March 11, 2025 as the record date for the purpose of payment of interim dividend on equity shares for the financial year 2024-25.",
            "pubDate": "2025-03-07T13:30:06.643701"
        },
        {
            "title": "RVNL shares up 2.5% on order win worth Rs 156.35 crore from South Western Railway",
            "link": "https://www.moneycontrol.com/news/business/stocks/rvnl-shares-in-focus-post-order-win-worth-rs-156-35-crore-from-south-western-railway-12958366.html",
            "description": "Rail Vikas Nigam share price | On March 5, the company received letter of acceptance (LoA) from HPSEBL of Rs 729.82 crore for development of distribution infrastructure at Central Zone of Himachal Pradesh under the revamped reforms-based and results-linked, distribution sector scheme (Loss Reduction Work).",
            "pubDate": "2025-03-07T13:30:06.643768"
        },
        {
            "title": "Closing Bell: Sensex, Nifty flat; smallcaps gain, midcaps drag",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-07-03-2025-liveblog-12958552.html",
            "description": "Reliance Industries, Nestle, Bajaj Auto, Bharat Electronics, Hindalco are among major gainers on the Nifty, while losers are IndusInd Bank, NTPC, Shriram Finance, Infosys, HCL Technologies. BSE Midcap index was down 0.3 percent, while Smallcap index was up 0.7 percent. On the sectoral front, Consumer Durables, IT, Power, realty down 0.5-1 percent, while Capital Goods, Energy, Metal, Media up 0.5-2 percent.",
            "pubDate": "2025-03-07T13:30:06.643835"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-60-12957946.html",
            "description": "Wall Street stocks finished lower on Thursday, with the Nasdaq confirming it has been in a correction since December, weighed down by market jitters over the current uncertainty surrounding U.S. trade policy.",
            "pubDate": "2025-03-07T13:30:06.643900"
        },
        {
            "title": "Stocks to Watch Today: TCS, Quess Corp, Power Grid Corporation, Eris Lifesciences, Omaxe, Kalpataru Projects, Biocon in focus on 7 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tcs-quess-corp-power-grid-corporation-eris-lifesciences-omaxe-kalpataru-projects-biocon-in-focus-on-7-march-12958548.html",
            "description": "Stocks to Watch, Mar 7: Stocks like Tamilnad Mercantile Bank, NMDC, Jindal Stainless, Sudarshan Pharma Industries, Brigade Enterprises, Rail Vikas Nigam, RITES, Laurus Labs, Bharat Electronics, InterGlobe Aviation, Firstsource Solutions, TCPL Packaging, Avanti Feeds, Campus Activewear, and Balaji Phosphates will be in focus on March 7.",
            "pubDate": "2025-03-07T13:30:06.643981"
        },
        {
            "title": "Wall Street opens Friday on a muted note as trade jitters keep markets on edge",
            "link": "https://www.moneycontrol.com/news/business/markets/wall-street-opens-friday-on-a-muted-note-as-trade-jitters-keep-markets-on-edge-12959388.html",
            "description": "Adding to the unease, a weaker-than-expected jobs report pointed to a potential cooling in the U.S. economy. Nonfarm payrolls increased by just 151,000 in February, missing the 170,000 estimate.",
            "pubDate": "2025-03-07T15:57:11.360062"
        },
        {
            "title": "FII net sell shares worth Rs 2,035 crore, DIIs net buyers of Rs 2,320 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/fii-net-sell-shares-worth-rs-2-035-crore-diis-net-buyers-of-rs-2-320-crore-12959324.html",
            "description": "Sensex closed slightly lower on Friday after a volatile session, as global trade tensions kept investors on edge. Despite the turbulence, Nifty managed to hold above the 22,500 mark.",
            "pubDate": "2025-03-07T15:57:11.360149"
        }
    ]
}