{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-24T03:59:44.183463",
    "items": [
        {
            "title": "Tata Consumer brewing growth, eyes more inorganic infusion",
            "link": "https://www.moneycontrol.com/news/business/earnings/tata-consumer-brewing-growth-eyes-more-inorganic-infusion-13002698.html",
            "description": "",
            "pubDate": "2025-04-24T03:59:31.429669"
        },
        {
            "title": "LTI Mindtree Q4 FY25 – a trend reversal or temporary loss of momentum?",
            "link": "https://www.moneycontrol.com/news/business/earnings/lti-mindtree-q4-fy25-a-trend-reversal-or-temporary-loss-of-momentum-13002620.html",
            "description": "The management expects future performance to be better, both in terms of order inflows and revenues",
            "pubDate": "2025-04-24T03:59:31.429752"
        },
        {
            "title": "Bajaj Housing Finance shares in focus as profit zooms 54% YoY in Q4FY25",
            "link": "https://www.moneycontrol.com/news/business/markets/bajaj-housing-finance-shares-in-focus-as-profit-zooms-54-yoy-in-q4fy25-13002641.html",
            "description": "HSBC maintained a \"Reduce\" rating on Bajaj Housing Finance with a target price of Rs 100 per share",
            "pubDate": "2025-04-24T03:59:31.429905"
        },
        {
            "title": "Axis Bank Q4 results due today: Dividend, fundraising, more; here's what to expect amid muted earnings",
            "link": "https://www.moneycontrol.com/news/business/earnings/axis-bank-q4-results-due-today-dividend-fundraising-more-here-s-what-to-expect-amid-muted-earnings-13002552.html",
            "description": "Axis Bank shares have risen over 7.4 percent in the past five days, and nearly 10 percent in the past one month. The stock has seen a sharp surge of nearly 13 percent in 2025 so far.",
            "pubDate": "2025-04-24T03:59:31.429981"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty opens below 24300, Sensex down 200 pts; Tata Consumer, LTIMindtree down post Q4 results",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-24-04-2025-liveblog-13002614.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Syngene International, Wendt India, Persistent Systems, Supreme Petrochem, 360 ONE WAM, Can Fin Homes, Rallis India, Tata Teleservices (Maharashtra), Tamilnad Mercantile Bank, Filatex India, Biocon, Niva Bupa Health Insurance Company, Spandana Sphoorty Financial, and Bajaj Finance will be in focus on April 24",
            "pubDate": "2025-04-24T03:59:31.430052"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-88-13001899.html",
            "description": "The Foreign institutional investors (FIIs) extended their buying on the sixth day as they bought equities worth Rs 3332 crore on April 23. However, Domestic institutional investors (DIIs) continued selling on second day as they sold equities of Rs 1234 crore on the same day.",
            "pubDate": "2025-04-24T03:59:31.430120"
        },
        {
            "title": "Trade Spotlight: How should you trade Bharti Airtel, Cummins India, M&M, L&T Finance, Escort Kubota, Emami, Astral and others on April 24?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bharti-airtel-cummins-india-m-m-l-t-finance-escort-kubota-emami-astral-and-others-on-april-24-13002593.html",
            "description": "The market could see some consolidation and profit booking in the upcoming sessions, though the overall trend remains positive. Below are some trading ideas for the near term.",
            "pubDate": "2025-04-24T03:59:31.430187"
        },
        {
            "title": "Stocks to Watch Today: Tata Consumer Products, BPCL, Adani Green Energy, Panacea Biotec, Thyrocare, Bajaj Housing, LTIMindtree in focus on 24 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-tata-consumer-products-bpcl-adani-green-energy-panacea-biotec-thyrocare-bajaj-housing-ltimindtree-in-focus-on-24-april-13002578.html",
            "description": "Stocks to watch, 24 Apr: Stocks like Syngene International, Wendt India, Supreme Petrochem, 360 ONE WAM, Can Fin Homes, Rallis India, Tata Teleservices (Maharashtra), Tamilnad Mercantile Bank, Filatex India, Biocon, Niva Bupa Health Insurance Company, Spandana Sphoorty Financial, and Bajaj Finance will be in focus on April 24.",
            "pubDate": "2025-04-24T03:59:31.430253"
        },
        {
            "title": "Bulk & Block deals: Capri Global picks 1.1% stake in Synergy Green Industries on April 23",
            "link": "https://www.moneycontrol.com/news/business/markets/bulk-block-deals-capri-global-picks-1-1-stake-in-synergy-green-industries-on-april-23-13002488.html",
            "description": "Atal Realtech saw heavy trading activity. Ravi Goyal and his HUF entity bought a total of 12.6 lakh shares at an average price of around Rs 15.9.",
            "pubDate": "2025-04-24T03:59:31.430319"
        },
        {
            "title": "US stocks rise on hopes of US-China trade negotiations; Tech counters lead rally",
            "link": "https://www.moneycontrol.com/news/business/markets/us-stocks-rise-on-hopes-of-us-china-trade-negotiations-tech-counters-lead-rally-13002480.html",
            "description": "The rally followed Trump’s remarks late Tuesday, suggesting a more conciliatory stance toward China. Acknowledging the current 145 percent tariff on Chinese imports as “very high\"",
            "pubDate": "2025-04-24T03:59:31.430385"
        },
        {
            "title": "Wall Street off to a flying start as Trump signals softer tone on Powell and China tariffs",
            "link": "https://www.moneycontrol.com/news/business/markets/wall-street-off-to-a-flying-start-as-trump-signals-softer-tone-on-powell-and-china-tariffs-13002348.html",
            "description": "Markets cheered Trump’s assurance that he has \"no intention\" of removing Fed Chair Jerome Powell, a notable climbdown after days of fiery rhetoric targeting the central bank head.",
            "pubDate": "2025-04-24T03:59:31.430452"
        }
    ]
}