{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-15T17:29:13.667080",
    "items": [
        {
            "title": "OPINION | India’s E-commerce Surge: A market multiplier for startups and investors",
            "link": "https://www.moneycontrol.com/news/opinion/india-s-e-commerce-surge-a-market-multiplier-for-startups-and-investors-13547541.html",
            "description": "The question is no longer whether Indians will shop online, but how deeply digital commerce will reshape the nation’s economy, jobs, and competitiveness. The evidence is clear: e-commerce has moved from convenience to core, from optional to inevitable – the very backbone of India’s growth story this decade",
            "pubDate": "2025-09-15T10:45:52.822035"
        },
        {
            "title": "Trent mirrors Westside’s store model online, says no to flash sales",
            "link": "https://www.moneycontrol.com/news/business/companies/trent-mirrors-westside-s-store-model-online-says-no-to-flash-sales-13547441.html",
            "description": "Around 5–6% of Westside’s sales now come from digital channels, which the company says is significant. The online store matches physical outlets in both pricing and product selection, making e-commerce an extension of the brand",
            "pubDate": "2025-09-15T10:45:52.822122"
        },
        {
            "title": "India's M&A and demerger is still stuck in the old mould",
            "link": "https://www.moneycontrol.com/news/opinion/india-s-m-a-and-demerger-is-still-stuck-in-the-old-mould-13546996.html",
            "description": "M&A and succession planning are not technical footnotes; they are central to India’s corporate growth story. Unless the tax regime adapts to commercial reality, the promise of the new Act will remain only on paper.",
            "pubDate": "2025-09-15T10:45:52.822202"
        },
        {
            "title": "Vodafone Idea's share rise 6 percent as plea against DoT's AGR demand tentatively listed for hearing on September 19",
            "link": "https://www.moneycontrol.com/news/business/markets/vodafone-idea-s-share-rise-6-percent-as-plea-against-dot-s-agr-demand-tentatively-listed-for-hearing-on-september-19-13546301.html",
            "description": "The telecom firm had moved the Supreme Court seeking to quash the additional demand of AGR dues worth Rs 9,450 crore by the DoT, and argued that the demand exceeds the scope of the Court’s earlier ruling on AGR liabilities.",
            "pubDate": "2025-09-15T10:45:52.822271"
        },
        {
            "title": "Apeejay Surrendra Park Hotels: Why this hotel stock merits attention",
            "link": "https://www.moneycontrol.com/news/business/stocks/apeejay-surrendra-park-hotels-why-this-hotel-stock-merits-attention-13546148.html",
            "description": "Apeejay Surrendra Park Hotels is pressing the growth pedal by taking hotels on leases, acquiring some, and scaling up the Flurys bakery and confectionaries business",
            "pubDate": "2025-09-15T10:45:52.822340"
        },
        {
            "title": "SpiceJet delaying salary payments to sizable number of employees: Report",
            "link": "https://www.moneycontrol.com/news/business/companies/spicejet-delaying-salary-payments-to-sizable-number-of-employees-report-13545249.html",
            "description": "SpiceJet employees drawing a salary of up to Rs 55,000 per month have received payment for August, while the rest of the staff has not been paid yet.",
            "pubDate": "2025-09-15T10:45:52.822408"
        },
        {
            "title": "Besides JV route, NTPC looking to set up nuclear projects on standalone basis: CMD Gurdeep Singh",
            "link": "https://www.moneycontrol.com/news/business/companies/besides-jv-route-ntpc-looking-to-set-up-nuclear-projects-on-standalone-basis-cmd-gurdeep-singh-13545190.html",
            "description": "The company is collaborating with technology providers and state governments to explore individual nuclear projects, Singh said",
            "pubDate": "2025-09-15T10:45:52.822472"
        },
        {
            "title": "Excited about India both as market, tech hub: Publicis Sapient Global CEO Nigel Vaz",
            "link": "https://www.moneycontrol.com/news/business/companies/excited-about-india-both-as-market-tech-hub-publicis-sapient-global-ceo-nigel-vaz-13545161.html",
            "description": "Publicis Sapient is the digital business transformation hub of one of world’s largest advertising companies, Publicis Groupe, and has 20,000 people across 72 offices globally.",
            "pubDate": "2025-09-15T10:45:52.822538"
        },
        {
            "title": "The lesser known story of Dixon's 10,000 female employees",
            "link": "https://www.moneycontrol.com/news/business/companies/the-lesser-known-story-of-dixon-s-10-000-female-employees-13547631.html",
            "description": "Of the company’s over 40,000 workforce, nearly 10,000 are women, mostly employed in the company’s factories in Tirupati and Kopparthi in Andhra Pradesh and in Chennai in Tamil Nadu. They are also growing in numbers in Dehradun and Ludhiana",
            "pubDate": "2025-09-15T11:23:14.573560"
        },
        {
            "title": "Hospitals' body AHPI demands restoration of cashless services by Star Health",
            "link": "https://www.moneycontrol.com/news/business/companies/hospitals-body-ahpi-demands-restoration-of-cashless-services-by-star-health-13548416.html",
            "description": "Hospitals and nursing homes, part of the Indian Medical Association Hospital Board, also share the same concerns, AHPI said in the statement",
            "pubDate": "2025-09-15T17:29:08.568336"
        },
        {
            "title": "IndiGo inks codeshare pact with Greece's flag carrier AEGEAN",
            "link": "https://www.moneycontrol.com/news/business/companies/indigo-inks-codeshare-pact-with-greece-s-flag-carrier-aegean-13548412.html",
            "description": "The pact, which is subject to regulatory approvals, will allow AEGEAN to strengthen its connectivity into India and South Asia, while enabling more travel options for IndiGo customers on the former’s extensive domestic and European network",
            "pubDate": "2025-09-15T17:29:08.568416"
        },
        {
            "title": "CVC in talks to buy KKR’s Avendus stake after Mizuho deal falters",
            "link": "https://www.moneycontrol.com/news/business/companies/cvc-in-talks-to-buy-kkr-s-avendus-stake-after-mizuho-deal-falters-13548250.html",
            "description": "New York-based KKR first bought into Avendus in 2015 and injected additional capital two years later",
            "pubDate": "2025-09-15T17:29:08.568484"
        }
    ]
}