{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-16T04:59:16.414303",
    "items": [
        {
            "title": "Afcons Infrastructure shares in focus on project win worth Rs 1,006.74 crore",
            "link": "https://www.moneycontrol.com/news/business/stocks/afcons-infrastructure-shares-in-focus-on-project-win-worth-rs-1-006-74-crore-12890108.html",
            "description": "Afcons Infrastructure Share Price | The project include design and construction of elevated Viaduct, thirteen elevated metro stations which will connect Bhadbhada Chauraha to Ratnagiri Tiraha and access to Depot for Bhopal Metro Rail Project.",
            "pubDate": "2024-12-16T02:38:20.058117"
        },
        {
            "title": "Premier Explosives shares in focus after JV signs MoU to manufacture defence & aerospace products",
            "link": "https://www.moneycontrol.com/news/business/stocks/premier-explosives-shares-in-focus-after-jv-signs-mou-to-manufacture-defence-aerospace-products-12890107.html",
            "description": "Premier Explosives Share Price | In proposed joint venture, Global Munition and Premier Explosives will hold equity in the ratio of 51 :49.",
            "pubDate": "2024-12-16T02:38:20.058197"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a weak start; US markets flat, Asia gains",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-16-12-2024-liveblog-12890503.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed out the trading week near the unchanged mark in a subdued session on Friday, with the S&P 500 and Dow posting weekly declines, while the Nasdaq secured its fourth consecutive week of gains. The Dow Jones Industrial Average fell 86.06 points, or 0.20%, to 43,828.06, the S&P 500 lost 0.16 point, or 0.00%, to 6,051.09 and the Nasdaq Composite gained 23.88 points, or 0.12%, to 19,926.72.",
            "pubDate": "2024-12-16T02:38:20.058268"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-10-12889413.html",
            "description": "The GIFT Nifty is indicating a negative start for the day.",
            "pubDate": "2024-12-16T02:38:20.058338"
        },
        {
            "title": "Trade Spotlight: How should you trade ICICI Bank, Bharti Airtel, Kesoram, CRISL, Protean e-Gov Tech, and others on Monday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-icici-bank-bharti-airtel-kesoram-crisl-protean-e-gov-tech-and-others-on-monday-12890478.html",
            "description": "The market may see some rangebound trade after Friday's rally, though the overall trend remains positive, given the decline in the VIX. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-16T02:38:20.058411"
        },
        {
            "title": "Stock Radar: Lupin, Aurobindo Pharma, JK Paper, Navin Fluorine, Afcons Infrastructure, 63 Moons, Biocon in focus on Monday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-lupin-aurobindo-pharma-jk-paper-navin-fluorine-afcons-infrastructure-63-moons-biocon-in-focus-on-monday-12890465.html",
            "description": "Stocks like Zinka Logistics Solutions, Reliance Industries, GMM Pfaudler, Godrej Agrovet, Aurobindo Pharma, JSW Energy, Bharat Forge, ,Jaiprakash Power Ventures, Premier Explosives, and Navin Fluorine International wll also be in focus on December 16.",
            "pubDate": "2024-12-16T02:38:20.058484"
        },
        {
            "title": "Brokerage Radar: Jefferies trims PI Industries target; Goldman Sachs bullish on Aurobindo Pharma",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-jefferies-trims-pi-industries-target-goldman-sachs-bullish-on-aurobindo-pharma-12890523.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes TCS, PI Industries, Aurobindo Pharma and more.",
            "pubDate": "2024-12-16T03:26:47.904194"
        },
        {
            "title": "Agri Picks Report December 16, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/commodities/agri-picks-report-december-16-2024-geojit-financial-services-12890578.html",
            "description": "According to Geojit Financial Services, India's vegetable oil imports in November, the first month of the oil year 2024-25 (Nov-Oct), were 1.63 million tonnes, up 40% from the corresponding period last year, the Solvent Extractors' Association of India said Thursday.",
            "pubDate": "2024-12-16T03:50:33.349228"
        },
        {
            "title": "Live: Will Nifty Make An Attempt To Reclaim 25,000 This Week? US Fed Decision Awaited| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-will-nifty-make-an-attempt-to-reclaim-25-000-this-week-us-fed-decision-awaited-opening-bell-12890525.html",
            "description": "In a highly volatile session on December 13, the Indian equity indices made a sharp recovery from the day's low and ended strong led by auto, bank, telecom and FMCG names. BSE Sensex and Nifty50 bounced back more than 2 percent from the day's low amid ease in retail inflation and three-month high industrial growth at 3.5 percent in October.\n\nAt close, the Sensex was up 843.16 points or 1.04 percent at 82,133.12, and the Nifty was up 219.60 points or 0.89 percent at 24,768.30. This morning GIFT Nifty is hinting at a negative start. Catch Nandita Khemka in conversation with Osho Krishan, Sr. Analyst - Technical &amp; Derivative Research, Angel One and Prakash Diwan - Market Expert",
            "pubDate": "2024-12-16T03:50:33.349314"
        },
        {
            "title": "Max Financial Services shares gain 2% as Jefferies says 'buy', sees 47% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/max-financial-services-shares-gain-2-as-jefferies-says-buy-sees-47-upside-12890549.html",
            "description": "This refreshed identity of Axis Max Life Insurance is expected to boost brand recall, particularly in Tier II and Tier III markets where Axis Bank's presence is strong.",
            "pubDate": "2024-12-16T03:58:51.577856"
        },
        {
            "title": "Dixon Tech soars to record high on pact to setup new mfg joint venture with Vivo India",
            "link": "https://www.moneycontrol.com/news/business/markets/dixon-tech-soars-to-record-high-on-pact-to-setup-new-mfg-joint-venture-with-vivo-india-12890584.html",
            "description": "Under the agreement, Dixon will hold a majority 51 percent stake in the joint venture, while Vivo India will own the remaining 49 percent. Moneycontrol was the first to report about Vivo’s discussions with Indian contract manufacturers, including Dixon.",
            "pubDate": "2024-12-16T04:24:42.840535"
        },
        {
            "title": "Enviro Infra stock zooms to record high; skyrockets 15% in two days",
            "link": "https://www.moneycontrol.com/news/business/markets/enviro-infra-stock-zooms-to-record-high-skyrockets-15-in-two-days-12890605.html",
            "description": "Shares of Enviro Infra have continued its stellar surge post its market debut as the stock has already gained more than twofold from its IPO price of Rs 148.",
            "pubDate": "2024-12-16T04:51:40.939667"
        },
        {
            "title": "RITES shares gain 4%, snap two-day losing streak after Rs 297-cr order win",
            "link": "https://www.moneycontrol.com/news/business/markets/rites-shares-gain-4-snap-two-day-losing-streak-after-rs-297-cr-order-win-12890611.html",
            "description": "The project, which includes construction and Project Management Consultancy (PMC) fees but excludes GST, is expected to be completed within 59 months, including the defect liability period.",
            "pubDate": "2024-12-16T04:59:15.864987"
        }
    ]
}