{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-04-04T04:34:38.858407",
    "items": [
        {
            "title": "Why pharma stocks aren’t safe: Trump says announcement coming in 'near-future'",
            "link": "https://www.moneycontrol.com/news/business/markets/why-pharma-stocks-aren-t-safe-trump-says-announcement-coming-in-near-future-12984490.html",
            "description": "Pharma stocks are trading in the red during the April 4 session, after a big rally in the previous session, as tariff fears are reignited for the sector.",
            "pubDate": "2025-04-04T04:34:31.085218"
        },
        {
            "title": "BEL: Is the stock a good play on higher defence spending?",
            "link": "https://www.moneycontrol.com/news/business/earnings/bel-is-the-stock-a-good-play-on-higher-defence-spending-12984463.html",
            "description": "The company aims to capitalise on global export opportunities, leveraging its robust product portfolio",
            "pubDate": "2025-04-04T04:34:31.085307"
        },
        {
            "title": "Live: Have markets digested Trump's new tariff measures? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-have-markets-digested-trump-s-new-tariff-measures-opening-bell-12984448.html",
            "description": "Nifty slipped below 23,300 in a rangebound session after US President Donald Trump announced \"discounted\" 27 percent reciprocal tariffs on India, while broader markets outperformed benchmarks. As pharmaceutical products were exempted from any tariffs, Nifty Pharma index emerged as the top sectoral winner in yesterday's trade, followed by PSU Bank index. Conversely, IT, auto, and metal stocks saw significant losses amidst varied tariff measures. This morning, global cues were sharply lower. US markets suffered worst single-day drop overnight in 5 years, while Asian markets also started the day on a negative note. Among stocks, watch out for HDFC Bank, Mazagaon Dock, and Avenue Supermarts in today's trading session. Catch Lovisha Darad in conversation with Raja Venkatraman, Co-Founder NeoTrader & Trading Influencer and Anand K Rathi, Co-Founder, MIRA Money.",
            "pubDate": "2025-04-04T04:34:31.085389"
        },
        {
            "title": "Agri Picks Report April 04, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-april-04-2025-geojit-financial-services-12984476.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.6 million acres (1 acre = 0.4 hectares) as of Wednesday, up 13.2% on year from 6.7 million acres sown in the same period last year, according to a report released by the state agriculture department.",
            "pubDate": "2025-04-04T04:34:31.085462"
        },
        {
            "title": "FMCG preview: Diverse growth trends, margin pressure to persist",
            "link": "https://www.moneycontrol.com/news/business/earnings/fmcg-preview-diverse-growth-trends-margin-pressure-to-persist-12984442.html",
            "description": "Valuation upgrade requires sustained growth recovery, earnings support",
            "pubDate": "2025-04-04T04:34:31.085551"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty at 23,100, Sensex down 300 pts; banks gain, IT, metal drag",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-04-04-2025-liveblog-12984385.html",
            "description": "Sensex Today | Stock Market LIVE Updates: All the sectoral indices are trading in the red. Bajaj Finance , Zomato, Dr Reddy's Labs, Shriram Finance, Bajaj Finserv are among major gainers on the Nifty, while losers are ONGC, Hindalco, Tata Motors, TCS and L&T. BSE Midcap and Smallcap indices down 1.5 percent each.",
            "pubDate": "2025-04-04T04:34:31.085621"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-78-12983736.html",
            "description": "The Foreign institutional investors (FIIs) continued selling on fourth day as they sold equities worth Rs 2806 crore on April 3. On the other hand, Domestic institutional investors (DIIs) remained net buyers on fifth consecutive day as they purchased equities of Rs 221 crore on the same day.",
            "pubDate": "2025-04-04T04:34:31.085722"
        },
        {
            "title": "Trade Spotlight: How should you trade Bandhan Bank, Jubilant Foodworks, Torrent Power, SBI, Kirloskar Oil Engines, and others on April 4?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bandhan-bank-jubilant-foodworks-torrent-power-sbi-kirloskar-oil-engines-and-others-on-april-4-12984372.html",
            "description": "The consolidation and rangebound trading may continue in the near term. Below are some trading ideas for the near term.",
            "pubDate": "2025-04-04T04:34:31.085845"
        },
        {
            "title": "Stocks to Watch Today: HDFC Bank, Mazagon Dock, DMart, Adani Wilmar, Bajaj Finance, Surya Roshni, Alivus Life, Paras Defence in focus on 4 April",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-hdfc-bank-mazagon-dock-dmart-adani-wilmar-bajaj-finance-surya-roshni-alivus-life-paras-defence-in-focus-on-4-april-12984371.html",
            "description": "Stocks to Watch, 4 Apr: Stocks like L&T Finance, Vedanta, RBL Bank, Bandhan Bank, SH Kelkar and Company, Jio Financial Services, GR Infraprojects, UltraTech Cement, Balaji Amines, Sai Life Sciences, Nestle India, Jupiter Wagons, Thermax, and Ami Organics will be in focus on April 4.",
            "pubDate": "2025-04-04T04:34:31.085950"
        }
    ]
}