{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-12-18T11:39:39.601376",
    "items": [
        {
            "title": "Brokerage Radar: CLSA raises DLF's target, Jefferies rates Piramal Enterprises as 'Underperform'",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-clsa-raises-dlf-s-target-jefferies-rates-piramal-enterprises-as-underperform-12892330.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes LIC Housing, DLF, Piramal Enterprises and more.",
            "pubDate": "2024-12-18T03:04:13.279540"
        },
        {
            "title": "Short Call | The Fed's balancing game on the radar; Piramal Pharma, HDFC Bank in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/short-call-the-fed-s-balancing-game-on-the-radar-piramal-pharma-hdfc-bank-in-focus-12892322.html",
            "description": "“At all times, in all markets, in all parts of the world, the tiniest change in rates changes the value of every financial asset.”--Warren Buffett",
            "pubDate": "2024-12-18T03:04:13.279627"
        },
        {
            "title": "Vishal Mega Mart, MobiKwik, Sai Life set to list today: Check GMP and subscription details",
            "link": "https://www.moneycontrol.com/news/business/ipo/vishal-mega-mart-mobikwik-sai-life-set-to-list-today-check-gmp-and-subscription-details-12892312.html",
            "description": "In 2024, 75 Indian companies raised over Rs 1.5 lakh crore through mainboard IPOs, marking a new record, according to data from Prime Database.",
            "pubDate": "2024-12-18T03:04:13.279710"
        },
        {
            "title": "Exide Industries shares in focus on further investment in subsidiary",
            "link": "https://www.moneycontrol.com/news/business/stocks/exide-industries-shares-in-focus-on-further-investment-in-subsidiary-12892203.html",
            "description": "Exide Industries Share Price | The company has invested Rs 99, 99,99,972 by way of subscription in the equity share capital of its wholly owned subsidiary Exide Energy Solutions, on rights basis. With this investment, the total investment made by the company in EESL stands to Rs 3152.24 crore.",
            "pubDate": "2024-12-18T03:04:13.279783"
        },
        {
            "title": "Aurobindo Pharma shares in focus on two observations from USFDA",
            "link": "https://www.moneycontrol.com/news/business/stocks/aurobindo-pharma-shares-in-focus-on-two-observations-from-usfda-12892201.html",
            "description": "Aurobindo Pharma Share Price | These observations came after an inspection of the Unit-V API manufacturing facility at Apitoria Pharma, a wholly owned subsidiary, located in Pashamylaram Village, Telangana.",
            "pubDate": "2024-12-18T03:04:13.279856"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a weak start; US, Asian markets fall",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-18-12-2024-liveblog-12892305.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed down on Tuesday and crude prices fell as investors parsed economic data and girded themselves for a series of central bank decisions, including an expected rate cut from the Federal Reserve. The Dow Jones Industrial Average fell 266.93 points, or 0.61%, to 43,450.55, the S&P 500 fell 23.45 points, or 0.39%, to 6,050.63 and the Nasdaq Composite fell 64.83 points, or 0.32%, to 20,109.06.",
            "pubDate": "2024-12-18T03:04:13.279934"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-12-12891832.html",
            "description": "The GIFT Nifty is indicating a weak start for the day. US stocks closed down on Tuesday and crude prices fell as investors parsed economic data and girded themselves for a series of central bank decisions, including an expected rate cut from the Federal Reserve.",
            "pubDate": "2024-12-18T03:04:13.280003"
        },
        {
            "title": "Trade Spotlight: How should you trade Infosys, Mahindra Holidays, DOMS Industries, Prestige Estates, Nykaa, and others on Wednesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-infosys-mahindra-holidays-doms-industries-prestige-estates-nykaa-and-others-on-wednesday-12892283.html",
            "description": "The benchmark indices may sustain the negative trend, with focus on the outcome of the two-day Federal Reserve policy meeting, which is due on December 18. Below are some trading ideas for the near term.",
            "pubDate": "2024-12-18T03:04:13.280073"
        },
        {
            "title": "Stock Radar: Vishal Mega Mart, Mobikwik, JSW Energy, Va Tech Wabag, Pondy Oxides, Aurobindo Pharma in focus on Wednesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-vishal-mega-mart-mobikwik-jsw-energy-va-tech-wabag-pondy-oxides-aurobindo-pharma-in-focus-on-wednesday-12892276.html",
            "description": "Stocks like Aurobindo Pharma, Jindal Saw, Route Mobile, Gujarat Industries Power Co, Aditya Birla Real Estate, Exide Industries, Sonata Software, Sun TV Network, LTIMindtree, Hampton Sky Realty, Aditya Birla Sun Life AMC, and Restaurant Brands Asia will also be in focus on December 18.",
            "pubDate": "2024-12-18T03:04:13.280142"
        },
        {
            "title": "Why Aadhar Housing Finance is a sound long-term bet",
            "link": "https://www.moneycontrol.com/news/business/earnings/why-aadhar-housing-finance-is-a-sound-long-term-bet-12892346.html",
            "description": "Largest affordable housing finance player, yet undervalued.",
            "pubDate": "2024-12-18T03:35:19.492811"
        },
        {
            "title": "Strong demand foundations propel real estate cos back into the spotlight",
            "link": "https://www.moneycontrol.com/news/business/markets/strong-demand-foundations-propel-real-estate-cos-back-into-the-spotlight-12892336.html",
            "description": "The Nifty Realty index zoomed up more than 17 percent in the past month, leaving the Nifty 50’s modest 4 percent gains far behind to emerge as the new rock star of the market.",
            "pubDate": "2024-12-18T03:35:19.492897"
        },
        {
            "title": "Agri Picks Report December 18, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-december-18-2024-geojit-financial-services-12892377.html",
            "description": "According to Geojit Financial Services, Farmers in Andhra Pradesh have sown rabi crops over 733,000 hectares as of Wednesday, up nearly 19% from 616,000 hectares sown in the corresponding period last year, according to a report released by the state agriculture department.",
            "pubDate": "2024-12-18T04:20:36.769137"
        },
        {
            "title": "DLF shares fall despite CLSA's 'outperform' rating, target price hike",
            "link": "https://www.moneycontrol.com/news/business/markets/dlf-shares-fall-despite-clsa-s-outperform-rating-target-price-hike-12892367.html",
            "description": "CLSA noted strong demand for DLF's uber-luxury project, 'The Dahlias,' with 130-150 units sold so far.",
            "pubDate": "2024-12-18T04:20:36.769233"
        },
        {
            "title": "Shoppers Stop share surges 6% after Rs 236 crore large deal",
            "link": "https://www.moneycontrol.com/news/business/markets/shoppers-stop-share-surges-6-after-rs-236-crore-large-deal-12892372.html",
            "description": "A total of 37.6 lakh shares, or 3.4 percent of Shoppers Stop, were traded at Rs 628 per share in the large deal, matching Tuesday’s closing price.",
            "pubDate": "2024-12-18T04:20:36.769350"
        },
        {
            "title": "Restaurant Brands Asia stock rises 3% on plans to mull over QIP fund raise on December 20",
            "link": "https://www.moneycontrol.com/news/business/markets/restaurant-brands-asia-stock-rises-3-on-plans-to-mull-over-qip-fund-raise-on-december-20-12892385.html",
            "description": "Restaurant Brands Asia, the owner and operator of the Burger King brand, has been facing challenges due to weak discretionary demand in recent times.",
            "pubDate": "2024-12-18T04:38:27.604462"
        },
        {
            "title": "Akzo Nobel India shares higher by 6% on report of $2-2.5 billion deal value for assets; Pidilite, JSW, Indigo in the fray",
            "link": "https://www.moneycontrol.com/news/business/markets/akzo-nobel-india-shares-higher-by-6-on-report-of-2-2-5-billion-deal-value-for-assets-pidilite-jsw-indigo-in-the-fray-12892388.html",
            "description": "Shares of Akzo Nobel India, the maker of Dulux Paints, are witnessing strong buying interest as the race reportedly narrows down to three major players that are in the fray. Parent Akzo Nobel has hired Citigroup to conduct the India asset sale.",
            "pubDate": "2024-12-18T05:42:27.256294"
        },
        {
            "title": "Mamata Machinery IPO: Proxy for emerging export opportunities in machinery",
            "link": "https://www.moneycontrol.com/news/business/ipo/mamata-machinery-ipo-proxy-for-emerging-export-opportunities-in-machinery-12892435.html",
            "description": "The company differentiates itself in the competitive packaging machinery market by offering customised co-extrusion and blow film solutions, allowing for tailored customer service rather than mass production",
            "pubDate": "2024-12-18T06:24:49.247547"
        },
        {
            "title": "Enviro Infra Engineers stock falls 10% ahead of Q2 results, snaps five-day gaining streak",
            "link": "https://www.moneycontrol.com/news/business/markets/enviro-infra-engineers-stock-falls-10-ahead-of-q2-results-snaps-five-day-gaining-streak-12892471.html",
            "description": "Enviro Infra Engineers stock has rallied a staggering 156 percent from the IPO price.",
            "pubDate": "2024-12-18T06:24:49.247648"
        },
        {
            "title": "VA Tech Wabag shares off lows after Saudi authority says 'recalibrated' fresh tender for desalination project in 'couple of weeks'",
            "link": "https://www.moneycontrol.com/news/business/stocks/va-tech-wabag-shares-off-lows-after-saudi-authority-says-recalibrated-fresh-tender-for-desalination-project-in-couple-of-weeks-12892469.html",
            "description": "VA Tech Wabag's orderbook was majorly boosted by the Saudi Water Authority tender, which will now be 'recalibrated', and a fresh tender will be floated in a couple of weeks to invite bids again.",
            "pubDate": "2024-12-18T06:24:49.247721"
        },
        {
            "title": "KFin Technologies shares up 30% in a month, Jefferies says Buy on Asia expansion prospects",
            "link": "https://www.moneycontrol.com/news/business/markets/kfin-technologies-shares-up-30-in-a-month-jefferies-says-buy-on-asia-expansion-prospects-12892639.html",
            "description": "Financial servives platform KFin Tech's ambitious expansion plans in south-east Asia have caught investor's attention, and the company says it has 'strong potential' for global expansion in countries where it is already present.",
            "pubDate": "2024-12-18T07:30:41.409584"
        },
        {
            "title": "Taking Stock: Nifty below 24,200, Sensex falls 502 pts; all eyes on Fed decision",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-below-24-200-sensex-falls-502-pts-all-eyes-on-fed-decision-12892873.html",
            "description": "On the sectoral front, except pharma (up 1 percent), all other indices ended in the red with auto, energy, PSU Bank, metal, media, realty down 0.5-2 percent.",
            "pubDate": "2024-12-18T10:19:19.244280"
        },
        {
            "title": "Ethanol sourcing from sugar mills to be less this season, Centre also mulls lower-than-expected price hike: CNBC Awaaz",
            "link": "https://www.moneycontrol.com/news/business/companies/ethanol-sourcing-from-sugar-mills-to-be-less-this-season-centre-also-mulls-lower-than-expected-price-hike-cnbc-awaaz-12892855.html",
            "description": "Leading sugar mills are staring at a dual setback, as Centre is prioritising ethanol procurement from cooperative mills over private companies, and is considering a less-than-expected price hike.",
            "pubDate": "2024-12-18T10:19:19.244370"
        },
        {
            "title": "Gainers & Losers: 10 stocks that moved the most on December 18",
            "link": "https://www.moneycontrol.com/news/photos/business/markets/gainers-losers-10-stocks-that-moved-the-most-on-december-18-2-12892959.html",
            "description": "At close, the Sensex was down 502 points or 0.6 percent at 80,182, and the Nifty was down 137 points at 24,198. About 1,379 shares advanced, 2,456 shares declined, and 92 shares remained unchanged.",
            "pubDate": "2024-12-18T10:39:09.791727"
        },
        {
            "title": "KFin Tech, Bharti Hexacom, Swiggy among the top gainers and losers in trade on December 18",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/kfin-tech-bharti-hexacom-swiggy-among-the-top-gainers-and-losers-in-trade-on-december-18-12893063.html",
            "description": "Sensex and Nifty slipped for the third consecutive session on December 18 as nervous investors braced for the US Federal Reserve's interest rate decision due later in the day. Over these three sessions, the Nifty has dropped 2.3 percent, while the Sensex has shed 2.5 percent. Here’s a look at the top gainers and losers in trade today.",
            "pubDate": "2024-12-18T11:39:38.832147"
        }
    ]
}