{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-19T09:41:47.118516",
    "items": [
        {
            "title": "ITI share price in focus on contract win worth Rs 95 crore in Uttarakhand",
            "link": "https://www.moneycontrol.com/news/business/stocks/iti-share-price-in-focus-on-contract-win-worth-rs-95-crore-in-uttarakhand-12869687.html",
            "description": "ITI Share Price | The Uttarakhand Government envisaged this project for effective prevention of illegal mining and mineral transportation and to increase its revenue in the state.",
            "pubDate": "2024-11-19T02:33:10.044091"
        },
        {
            "title": "PG Electroplast shares in focus as arm signs agreement with Spiro Mobility to manufacture EVs in India",
            "link": "https://www.moneycontrol.com/news/business/stocks/pg-electroplast-shares-in-focus-as-arm-signs-agreement-with-spiro-mobility-to-manufacture-evs-in-india-12869686.html",
            "description": "PG Electroplast Share Price | Spiro shall be responsible for research and development, marketing, sale, and distribution of the EV products manufactured by PG Technoplast",
            "pubDate": "2024-11-19T02:33:10.044180"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty indicates a flat start; US markets mixed, Asia gains",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-19-11-2024-liveblog-12870021.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The Nasdaq and S&P 500 closed higher on Monday, recovering some losses as investors anticipate quarterly earnings from AI leader Nvidia and Tesla jumped on the prospect of favorable policy changes from the incoming Trump administration.",
            "pubDate": "2024-11-19T02:33:10.044255"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-80-12869657.html",
            "description": "The GIFT Nifty is indicating a flat to positive start for the day.",
            "pubDate": "2024-11-19T02:33:10.044332"
        },
        {
            "title": "Stock Radar: Medplus Health, PG Electroplast, Shilpa Medicare, Themis Medicare, Waaree Energies in focus on Tuesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-medplus-health-pg-electroplast-shilpa-medicare-themis-medicare-waaree-energies-in-focus-on-tuesday-12870014.html",
            "description": "Stocks like Godavari Biorefineries, Gujarat Themis Biosyn, AstraZeneca Pharma, GVK Power and Infrastructure, GMR Airports Infrastructure, and Tilaknagar Industries will also be in focus on November 19.",
            "pubDate": "2024-11-19T02:33:10.044402"
        },
        {
            "title": "Trade Spotlight: How should you trade SBI, Cholamandalam Investment, Avalon, SRM Contractors, Axis Bank, and others on Tuesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-sbi-cholamandalam-investment-avalon-srm-contractors-axis-bank-and-others-on-tuesday-12870004.html",
            "description": "The bearish sentiment may persist, but there could be a potential rebound as the indices are in the oversold zone. Below are some trading ideas for the near term.",
            "pubDate": "2024-11-19T02:33:10.044472"
        },
        {
            "title": "Agri Picks Report November 19, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-november-19-2024-geojit-financial-services-12870072.html",
            "description": "According to Geojit, The government is considering lifting the suspension on futures trading of oil, oilseeds, and pulses, according to two senior government officials.",
            "pubDate": "2024-11-19T03:41:51.247177"
        },
        {
            "title": "Brokerage Radar: HSBC trims Glenmark Pharma's target, Morgan Stanley upgrades Suzlon Energy",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-hsbc-trims-glenmark-pharmas-target-morgan-stanley-upgrades-suzlon-energy-12870061.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Glenmark Pharma, financial stocks, and more.",
            "pubDate": "2024-11-19T03:41:51.247261"
        },
        {
            "title": "Live: Can Nifty rebound after slipping below 200-DMA? | Britannia, GMR Airports in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-rebound-after-slipping-below-200-dma-britannia-gmr-airports-in-focus-opening-bell-12870064.html",
            "description": "Indian benchmark indices Nifty and Sensex ended another session lower yesterday, with Nifty clocking its longest losing streak since February 2023. IT stocks were the top underperformers, while metal stocks bucked the trend. Experts now eye Nifty's resistance at 23,600, with support placed around 23,200. This morning global cues are mixed. Wall Street closed mixed overnight with Tesla shares gaining on reports that President-elect Donald Trump easing regulations on self-driving vehicles. Asia-Pacific markets, meanwhile, opened this morning largely higher. Among stocks in focus, watch out for Britannia, Waaree Energies, and GMR Airports. Catch Lovisha Darad in conversation with Nilesh Jain, Head AVP- Derivative and Technical Research, Centrum Broking and Sandeep Bagla, CEO, TRUST Mutual Fund.",
            "pubDate": "2024-11-19T03:41:51.247332"
        },
        {
            "title": "V-Guard Q2 FY25: Growth on track despite Sunflame's below-par show",
            "link": "https://www.moneycontrol.com/news/business/earnings/v-guard-q2-fy25-growth-on-track-despite-sunflames-below-par-show-12870066.html",
            "description": "The company is strategically making investments to enhance its manufacturing capabilities through backward integration across product categories, ensuring greater efficiency and cost optimisation",
            "pubDate": "2024-11-19T03:55:43.368783"
        },
        {
            "title": "Nifty snaps 7-day losing streak, Sensex jumps 500 points as all sectoral indices rally",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-snaps-7-day-losing-streak-sensex-jumps-500-points-as-all-sectoral-indices-rally-12870040.html",
            "description": "All sectoral indices traded in the positive territory. The top performers were Nifty Energy, Realty, IT and Auto.",
            "pubDate": "2024-11-19T04:15:26.617822"
        },
        {
            "title": "Suzlon Energy hits upper circuit as Morgan Stanley upgrades to 'overweight', flags buying opportunity",
            "link": "https://www.moneycontrol.com/news/business/markets/suzlon-energy-hits-upper-circuit-as-morgan-stanley-upgrades-to-overweight-flags-buying-opportunity-12870071.html",
            "description": "Suzlon's market share in India is expected to improve to 35-40 percent by FY27, according to Morgan Stanley, which also forecasts India’s wind additions to generate 32GW of demand worth $31 billion for wind OEMs between FY25 and FY30.",
            "pubDate": "2024-11-19T04:35:19.604868"
        },
        {
            "title": "Honasa Consumer shares extend losses, fall another 18% on weak Q2 earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/honasa-consumer-shares-extend-losses-fall-another-18-on-weak-q2-earnings-12870093.html",
            "description": "The stock had hit a 20 percent lower circuit at Rs 297.25 on November 18 after reporting its first quarterly loss in five quarters.",
            "pubDate": "2024-11-19T04:35:19.604964"
        },
        {
            "title": "Waaree Energies stock tanks 6% on weak Q2 show; snaps 4-day gaining streak",
            "link": "https://www.moneycontrol.com/news/business/markets/waaree-energies-stock-tanks-6-on-weak-q2-show-snaps-4-day-gaining-streak-12870107.html",
            "description": "The firm’s board has also approved an investment of Rs 600 crore into its wholly owned units to set up and develop infrastructure (including land and connectivity) to develop renewable power projects and bidding pipelines",
            "pubDate": "2024-11-19T04:47:04.047921"
        },
        {
            "title": "Subscribe for NTPC Green Energy Ltd IPO; Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-ntpc-green-energy-ltd-ipo-geojit-financial-services-12870122.html",
            "description": "Geojit Financial Services, has come out with its report on NTPC Green Energy Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on November 18 2024.",
            "pubDate": "2024-11-19T04:54:52.044727"
        },
        {
            "title": "Home First Finance| Consistent performance driven by solid execution| Stock Analysis",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/home-first-finance-consistent-performance-driven-by-solid-execution-stock-analysis-12870156.html",
            "description": "Home First is growing its loan book consistently, backed by buoyant demand from tier 2/3 cities and strong policy thrust. The company’s execution has been consistently better than its peers and it is well-positioned to capture the significant opportunity in the affordable housing segment. The low-cost housing sector will be a key focus area of the government, and Home First will stand to benefit, given robust loan growth and stable asset quality.",
            "pubDate": "2024-11-19T05:30:57.912535"
        },
        {
            "title": "Subscribe for NTPC Green Energy Ltd IPO; Cholamandalam Securities",
            "link": "https://www.moneycontrol.com/news/business/stocks/subscribe-for-ntpc-green-energy-ltd-ipo-cholamandalam-securities-12870131.html",
            "description": "Cholamandalam Securities, has come out with its report on NTPC Green Energy Ltd. The research firm has recommended to “ Subscribe” the ipo in its research report as on November 18 2024.",
            "pubDate": "2024-11-19T05:30:57.912621"
        },
        {
            "title": "Honasa shares pare losses but still down 11% as street turns bearish; M-cap drops below $1 billion\"",
            "link": "https://www.moneycontrol.com/news/business/markets/honasa-shares-pare-losses-but-still-down-11-as-street-turns-bearish-m-cap-drops-below-1-billion-12870093.html",
            "description": "The downturn has been attributed to the company's shift toward a direct-to-consumer (D2C) distribution model under its Project 'Neev,' which has led to inventory adjustments.",
            "pubDate": "2024-11-19T05:30:57.913056"
        },
        {
            "title": "Buy Suzlon Energy; target of Rs 68: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-suzlon-energy-target-of-rs-68-geojit-financial-services-12870194.html",
            "description": "Geojit Financial Services is bullish on Suzlon Energy has recommended buy rating on the stock with a target price of Rs 68 in its research report dated November 18, 2024.",
            "pubDate": "2024-11-19T05:58:01.795836"
        },
        {
            "title": "M&M jumps 4%, top Nifty gainer after CLSA maintains \"outperform\" call, sees 16% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/mm-jumps-4-top-nifty-gainer-after-clsa-maintains-outperform-call-sees-16-upside-12870178.html",
            "description": "Insights from CLSA's engagement with M&M’s management revealed strong confidence in the automaker’s growth trajectory",
            "pubDate": "2024-11-19T06:25:13.961321"
        },
        {
            "title": "AstraZeneca Pharma, Themis Medicare, PG Electroplast, Shilpa Medicare in Focus | Stocks On Radar",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/astrazeneca-pharma-themis-medicare-pg-electroplast-shilpa-medicare-in-focus-stocks-on-radar-12870159.html",
            "description": "Gujarat Themis Biosyn to merge with Themis Medicare. AstraZeneca Pharma to launch Breztri Aerosphere in January 2025 in India. Shilpa Medicare subsidiary receives certificate of suitability (CEP) from EDQM, for API, Octreotide. Shilpa Medicare subsidiary receives certificate of suitability (CEP) from EDQM, for API, Octreotide. PG Electroplast subsidiary signs definitive agreement with Spiro Mobility to manufacture electric vehicles of Spiro in India. Watch here for more details -",
            "pubDate": "2024-11-19T06:25:13.961413"
        },
        {
            "title": "GMR Airports shares rise nearly 6% on strong October traffic growth",
            "link": "https://www.moneycontrol.com/news/business/markets/gmr-airports-shares-rise-nearly-6-on-strong-october-traffic-growth-12870224.html",
            "description": "So far in FY25, GMR Airports reported its highest-ever passenger traffic of 7.4 crore, aircraft movements of 4.8 lakh, and cargo handling of 6.5 lakh tonnes.",
            "pubDate": "2024-11-19T07:08:24.917376"
        },
        {
            "title": "IndiGo, SpiceJet soar 3% as domestic air traffic crosses 5 lakh in a single day for the first time",
            "link": "https://www.moneycontrol.com/news/business/markets/indigo-spicejet-flies-3-as-domestic-air-traffic-crosses-5-lakh-in-a-single-day-for-the-first-time-12870237.html",
            "description": "The surge came amid festive and wedding seasons as airlines carried over 5 lakh passengers on November 17 and flight departures stood at 3,173",
            "pubDate": "2024-11-19T07:08:24.917533"
        },
        {
            "title": "Mid-day Mood | Markets see biggest single-day jump in 2 months as Sensex soars over 1,000 pts, Nifty above 23,750",
            "link": "https://www.moneycontrol.com/news/business/markets/mid-day-mood-markets-see-biggest-single-day-jump-in-2-months-as-sensex-soars-over-1000-pts-nifty-above-23750-12870191.html",
            "description": "All 13 sectoral indices rallied in the afternoon with Nifty IT and Auto being the standout performers with gains of over 2 percent each.",
            "pubDate": "2024-11-19T07:26:14.697349"
        },
        {
            "title": "Accumulate Marico; target of Rs 678: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/accumulate-marico-target-of-rs-678-geojit-financial-services-12870332.html",
            "description": "Geojit Financial Services recommended accumulate rating on Marico with a target price of Rs 678 in its research report dated November 19, 2024.",
            "pubDate": "2024-11-19T08:00:07.285263"
        },
        {
            "title": "Buy Havells India; target of Rs 1865: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-havells-india-target-of-rs-1865-geojit-financial-services-12870326.html",
            "description": "Geojit Financial Services is bullish on Havells India has recommended buy rating on the stock with a target price of Rs 1865 in its research report dated November 19, 2024.",
            "pubDate": "2024-11-19T08:00:07.285353"
        },
        {
            "title": "Medi Assist’s Q2 steady, a good proxy for health insurance",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/medi-assists-q2-steady-a-good-proxy-for-health-insurance-12870298.html",
            "description": "The TPA has demonstrated the ability to acquire companies in related businesses, successfully integrate them, and scale them up",
            "pubDate": "2024-11-19T08:28:41.213855"
        },
        {
            "title": "Shilpa Medicare shares rise 6% on CEP approvals from EDQM",
            "link": "https://www.moneycontrol.com/news/business/markets/shilpa-medicare-shares-rise-6-on-cep-approvals-from-edqm-12870312.html",
            "description": "The first CEP was, received on November 18, was for Octreotide, a synthetic peptide manufactured via solid-phase synthesis. The second CEP approval, received on November 19, was for Nifedipine, an active pharmaceutical ingredient (API) classified as a calcium-channel blocker.",
            "pubDate": "2024-11-19T08:28:41.214020"
        },
        {
            "title": "Urban growth isn’t slowing down; we’re simply looking at the wrong data, says CLSA's Aditya Sonam",
            "link": "https://www.moneycontrol.com/news/business/markets/urban-growth-isnt-slowing-down-were-simply-looking-at-the-wrong-data-says-clsas-aditya-sonam-12870346.html",
            "description": "Consumers in metro cities are opting for quick-commerce and e-commerce platforms over traditional FMCG channels. If urban consumption was truly slowing, concert ticket sales and fast fashion would not be thriving as they currently are, Sonam said.",
            "pubDate": "2024-11-19T09:12:11.692374"
        },
        {
            "title": "Sensex surges 700 pts, Nifty above 23,650 on broad-based buying; investor wealth surges Rs 5 lakh crore",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-surges-700-pts-nifty-above-23650-on-broad-based-buying-investor-wealth-surges-rs-5-lakh-crore-12870382.html",
            "description": "While the pace of foreign institutional investor (FII) selloff has reduced, Mishra believes that 'maintaining' this pace and a gradual reduction is more important for the markets.",
            "pubDate": "2024-11-19T09:41:46.427736"
        }
    ]
}