{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-05T12:56:34.032462",
    "items": [
        {
            "title": "Agri Picks Report March 05, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-05-2025-geojit-financial-services-12956603.html",
            "description": "According to Geojit Financial Services, The National Agricultural Cooperative Marketing Federation of India procured 2.89 million tonnes of oilseeds as of Sunday, slightly more than the 2.85 million tonnes purchased as of Feb. 23, according to data by the central procurement agency released Monday.",
            "pubDate": "2025-03-05T03:39:20.840639"
        },
        {
            "title": "Coforge shares in focus on two acquisitions, signing a $1.6 bn deal, 1:5 stock split",
            "link": "https://www.moneycontrol.com/news/business/stocks/coforge-shares-in-focus-on-two-acquisitions-signing-a-1-6-bn-deal-1-5-stock-split-12956577.html",
            "description": "Amid the flurry of news, global brokerage Jefferies has reiterated its 'buy' rating on Coforge, bumping its target price up to Rs 10,350 apiece.",
            "pubDate": "2025-03-05T03:39:20.840750"
        },
        {
            "title": "Live: Can Nifty be able to defend 22,000 after 10-day loss? |  Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-be-able-to-defend-22-000-after-10-day-loss-opening-bell-12956583.html",
            "description": "Nifty has extended losing streak to tenth straight day, marking longest losing run in the last 29 years. However, broader markets saw decent recovery, with smallcaps faring better than midcaps.  Going ahead, experts now watch out if Nifty can continue to defend 22,000, with resistance around 22,250. This morning, global cues were xxx. Among stocks, watch out for Grasim Industries, Biocon, and Power Grid in today's trading session. Catch Lovisha Darad in conversation with Nilesh Jain, Head AVP- Derivative and Technical Research, Centrum Broking and Amit Jain, Co-Founder, Ashika Global Family Office Services.",
            "pubDate": "2025-03-05T03:39:20.840826"
        },
        {
            "title": "GE Vernova bags 3 orders worth Rs 500 crore from Power Grid Corp",
            "link": "https://www.moneycontrol.com/news/business/stocks/ge-vernova-bags-3-orders-worth-rs-500-crore-from-power-grid-corp-12956410.html",
            "description": "GE Vernova T&D India Share Price | The share touched a 52-week high of Rs 2,215.70 and a 52-week low of Rs 801.00 on 23 December, 2024 and 20 March, 2024, respectively.",
            "pubDate": "2025-03-05T03:39:20.840899"
        },
        {
            "title": "RVNL shares in focus on winning project worth Rs 729.8 crore from HPSEBL",
            "link": "https://www.moneycontrol.com/news/business/stocks/rvnl-shares-in-focus-on-winning-project-worth-rs-729-8-crore-from-hpsebl-12956405.html",
            "description": "Rail Vikas Nigam Share Price | The company had reported a net profit of Rs 311 crore for the third quarter of the current financial year (FY25), marking a fall of nearly 13 percent from the Rs 359 crore net profit reported in Q3 of FY24.",
            "pubDate": "2025-03-05T03:39:20.840969"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty fall at pre-open; Coforge, RVNL, Adani Wilmar, Bicon in focus",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-05-03-2025-liveblog-12956541.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like Ola Electric Mobility, Grasim Industries, RHI Magnesita India, Apollo Hospitals Enterprise, Walchandnagar Industries, ABB India, Mindteck India, Ambuja Cements, Oil and Natural Gas Corporation, Force Motors, Avanti Feeds, Banswara Syntex, SpiceJet, and Manappuram Finance will be in focus on March 5.",
            "pubDate": "2025-03-05T03:39:20.841041"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-58-12955826.html",
            "description": "US stocks ended lower on Tuesday, with the tech-heavy Nasdaq veering near correction territory, as trade tensions escalated following U.S. President Donald Trump's new tariffs on Canada, Mexico and China.",
            "pubDate": "2025-03-05T03:39:20.841113"
        },
        {
            "title": "Stocks to Watch Today: Biocon, Coforge, GE Vernova, Power Grid, JSW Energy, Welspun Specialty, Rail Vikas Nigam in focus on 5 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-biocon-coforge-ge-vernova-power-grid-jsw-energy-welspun-specialty-rail-vikas-nigam-in-focus-on-5-march-12956530.html",
            "description": "Stocks To Watch, Mar 5: Stocks like Ola Electric Mobility, Grasim Industries, RHI Magnesita India, Apollo Hospitals Enterprise, Walchandnagar Industries, ABB India, Mindteck India, Ambuja Cements, Oil and Natural Gas Corporation, Force Motors, Avanti Feeds, Banswara Syntex, SpiceJet, and Manappuram Finance will be in focus on March 5.",
            "pubDate": "2025-03-05T03:39:20.841180"
        },
        {
            "title": "Trade Spotlight: How should you trade Voltas, Force Motors, Cummins India, Bharat Dynamics, Blue Star, Fortis Healthcare, and others on March 5?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-voltas-force-motors-cummins-india-bharat-dynamics-blue-star-fortis-healthcare-and-others-on-march-5-12956513.html",
            "description": "The market may remain consolidative, with the continuation of the \"sell on rally\" strategy. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-05T03:39:20.841247"
        },
        {
            "title": "US Markets: Selloff deepens as Trump tariffs stoke trade war fears",
            "link": "https://www.moneycontrol.com/news/business/markets/us-markets-selloff-deepens-as-trump-tariffs-stoke-trade-war-fears-12956491.html",
            "description": "With the latest declines, the S&P 500 has now fallen below its Election Day closing level from November, when voters returned Trump to office.",
            "pubDate": "2025-03-05T03:39:20.841317"
        },
        {
            "title": "Wall Street tumbles as trade war escalates, Nvidia and auto stocks sink",
            "link": "https://www.moneycontrol.com/news/business/markets/wall-street-tumbles-as-trade-war-escalates-nvidia-and-auto-stocks-sink-12956289.html",
            "description": "Investors, who had been holding out hope for a last-minute diplomatic breakthrough, rushed for the exits as it became clear that the tariffs were moving forward.",
            "pubDate": "2025-03-05T03:39:20.841384"
        },
        {
            "title": "Brokerage, exchange stocks see huge erosion as volumes, volatility make investors jittery",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-exchange-stocks-see-huge-erosion-as-volumes-volatility-make-investors-jittery-12956189.html",
            "description": "The average daily turnover (ADTV) in the cash segment fell 10 percent month-on-month to Rs 91,661 crore in February. In derivatives, the most popular trading segment, ADTV slipped 4 percent to Rs 287.6 trillion.",
            "pubDate": "2025-03-05T03:39:20.841451"
        },
        {
            "title": "FII net sell shares worth Rs 3,405 crore, DIIs net buyers of Rs 4,851 crore",
            "link": "https://www.moneycontrol.com/news/business/markets/fii-net-sell-shares-worth-rs-3-405-crore-diis-net-buyers-of-rs-4-851-crore-12956145.html",
            "description": "Sensex and Nifty closed lower on March 4 as fresh U.S. tariffs on China, Canada, and Mexico unsettled global markets, dragging investor sentiment.",
            "pubDate": "2025-03-05T03:39:20.841517"
        },
        {
            "title": "Cochin Shipyard: Growth prospects brighten amid capacity expansion",
            "link": "https://www.moneycontrol.com/news/business/earnings/cochin-shipyard-growth-prospects-brighten-amid-capacity-expansion-12956615.html",
            "description": "The focus is on expanding capabilities to manage larger and more technologically advanced vessels",
            "pubDate": "2025-03-05T04:37:38.692224"
        },
        {
            "title": "BSE stock crumbles 9% as NSE shifts expiry day to Monday",
            "link": "https://www.moneycontrol.com/news/business/stocks/bse-stock-crumbles-9-as-nse-shifts-expiry-day-to-monday-12956649.html",
            "description": "NSE announced that Nifty weekly contracts, which currently expire on Thursdays, will now expire on Mondays.",
            "pubDate": "2025-03-05T04:37:38.692303"
        },
        {
            "title": "Lemon Tree Hotels: A quality listed stock to play the mid-market hotel theme",
            "link": "https://www.moneycontrol.com/news/business/stocks/lemon-tree-hotels-a-quality-listed-stock-to-play-the-mid-market-hotel-theme-12956620.html",
            "description": "The hotelier plans to significantly reduce debt, which should drive valuation re-rating",
            "pubDate": "2025-03-05T04:37:38.692372"
        },
        {
            "title": "Stocks to Watch Today: Biocon, Coforge, GE Vernova, Power Grid",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/stocks-to-watch-today-biocon-coforge-ge-vernova-power-grid-12956611.html",
            "description": "Biocon Pharma has received US FDA approvals for Lenalidomide capsules and Dasatinib tablets, with tentative approval for Rivaroxaban tablets. Coforge has partnered with Sabre Corporation to accelerate product delivery and launch AI solutions. Adani Wilmar is acquiring 80% of GD Foods' 'Tops' brand in a multi-tranche deal. Ola Electric is addressing IFCI’s concerns over Milestone-1 non-achievement while engaging with authorities and progressing on its PLI ACC scheme agreement. GE Vernova T&amp;D India has secured Rs 500 crore orders from Power Grid Corporation of India for transformers and reactors.",
            "pubDate": "2025-03-05T04:37:38.692439"
        },
        {
            "title": "Should one bet on Prudent after the sharp fall?",
            "link": "https://www.moneycontrol.com/news/business/markets/should-one-bet-on-prudent-after-the-sharp-fall-12956578.html",
            "description": "The fall in equity markets and consequent MTM loss, no doubt, are key concerns. However, factors like healthy earnings visibility, an asset-light business model, and high operating leverage show that there is still promise",
            "pubDate": "2025-03-05T04:37:38.692503"
        },
        {
            "title": "Zydus Lifesciences gets USFDA nod for Dasatinib, launches affordable CMV drug in India",
            "link": "https://www.moneycontrol.com/news/business/markets/zydus-lifesciences-gets-usfda-nod-for-dasatinib-launches-affordable-cmv-drug-in-india-12957110.html",
            "description": "The drug is used to treat Philadelphia chromosome-positive chronic myeloid leukemia (CML) and acute lymphoblastic leukemia (ALL). The tablets will be manufactured at the company’s facility in Ahmedabad.",
            "pubDate": "2025-03-05T12:56:14.382494"
        },
        {
            "title": "Top gainers and losers today: Stocks that moved the most on March 5",
            "link": "https://www.moneycontrol.com/news/business/stocks/top-gainers-and-losers-today-stocks-that-moved-the-most-on-march-5-12957028.html",
            "description": "Benchmark indices saw a strong session of buying that helped sustain early gains, with Sensex and Nifty recording their best day in a month on March 5.",
            "pubDate": "2025-03-05T12:56:14.382578"
        },
        {
            "title": "Nandik Mallik of Avendus moves to Axis AMC to spearhead proposed SIF asset class",
            "link": "https://www.moneycontrol.com/news/business/markets/nandik-mallik-of-avendus-moves-to-axis-amc-to-spearhead-proposed-sif-asset-class-12957032.html",
            "description": "In a press release, Axis Mutual Fund highlighted its commitment to tapping into the vast potential of SIFs, a recently notified product category. The company stated that Mallik will lead Axis AMC’s initiatives in this evolving space.",
            "pubDate": "2025-03-05T12:56:14.382655"
        },
        {
            "title": "Taking Stock: Nifty above 22,300, Sensex gains 740 pts; all sectors in the green",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-nifty-above-22300-sensex-gains-740-pts-all-sectors-in-the-green-12956895.html",
            "description": "Adani Ports, Power Grid, M&M, Tata Steel, Adani Enterprises were among major gainers on the Nifty, while losers were Bajaj Finance, HDFC Bank, Grasim Industries, IndusInd Bank and Shriram Finance.",
            "pubDate": "2025-03-05T12:56:14.382724"
        },
        {
            "title": "Gensol Engineering falsified documents on debt servicing, says ICRA; stock tumbles 10%",
            "link": "https://www.moneycontrol.com/news/business/stocks/gensol-engineering-falsified-documents-on-debt-servicing-says-icra-stock-tumbles-10-12957004.html",
            "description": "The company's linkage with its promoter group entity BluSmart, which is a loss-making entity, also led to the rating downgrade, ICRA said.",
            "pubDate": "2025-03-05T12:56:14.382791"
        },
        {
            "title": "Live: Market rebounds after 10 days, Sensex, Nifty gain over 1% | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-market-rebounds-after-10-days-sensex-nifty-gain-over-1-closing-bell-12956946.html",
            "description": "Markets break 10-day losing streak. Sensex, Nifty edge up 1% each. PMI increases to 59 in Feb vs 56.5 in Jan. Strong global cues, easing oil prices aid rebound. All sectors in positive territory. IT, auto, metal stocks drive market recovery. idcap, smallcap indices outperform benchmarks. Catch Lovisha Darad and Yatin Mota as they discuss the stocks on their radar.",
            "pubDate": "2025-03-05T12:56:14.382860"
        },
        {
            "title": "Former Google Pay VP Ambarish Kenghe joins Angel One as Group CEO, shares higher by 4%",
            "link": "https://www.moneycontrol.com/news/business/stocks/former-google-pay-vp-ambarish-kenghe-joins-angel-one-as-group-ceo-shares-higher-by-4-12956947.html",
            "description": "Kenghe earlier served as the Vice President and general manager of Google Pay in India, Japan, Singapore, and the rest of the Asia Pacific region",
            "pubDate": "2025-03-05T12:56:14.382932"
        },
        {
            "title": "Avanti Feeds shares gain 10%, hit 52-week high as subsidiary enters pet food market",
            "link": "https://www.moneycontrol.com/news/business/markets/avanti-feeds-shares-gain-10-hit-52-week-high-as-subsidiary-enters-pet-food-market-12956958.html",
            "description": "Avanti Feeds share price: IIFL Facilities Services Limited acquired 59.77 lakh shares while Thai Union Asia Investment Holding Limited offloaded an identical stake at the same price in the previous session.",
            "pubDate": "2025-03-05T12:56:14.382999"
        },
        {
            "title": "Buy Trent; target of Rs 5800: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-trent-target-of-rs-5800-geojit-financial-services-12956962.html",
            "description": "Geojit Financial Services is bullish on Trent has recommended buy rating on the stock with a target price of Rs 5800 in its research report dated March 05, 2025.",
            "pubDate": "2025-03-05T12:56:14.383067"
        },
        {
            "title": "Polycab India shares rise over 3% as Morgan Stanley eyes 52% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/polycab-india-shares-rise-over-3-as-morgan-stanley-eyes-52-upside-12956934.html",
            "description": "Polycab India share price: The brokerage anticipates limited disruption in the industry over the next four to five years despite UltraTech Cement’s recent entry into the segment.",
            "pubDate": "2025-03-05T12:56:14.383137"
        },
        {
            "title": "Coromandel International clocks best day in five years with strong price and volume action",
            "link": "https://www.moneycontrol.com/news/business/stocks/coromandel-international-clocks-best-day-in-five-years-with-strong-price-and-volume-action-12956831.html",
            "description": "Coromandel International recorded a near 27% gain in net sales during Q3FY25, and the net profit more than doubled, showcasing a healthy order book and sectoral outlook.",
            "pubDate": "2025-03-05T12:56:14.383286"
        },
        {
            "title": "Jindal Drilling shares jump 8% after firm acquires jackup rig 'Jindal Pioneer' for $75 million",
            "link": "https://www.moneycontrol.com/news/business/stocks/jindal-drilling-shares-jump-8-after-firm-acquires-jackup-rig-jindal-pioneer-for-75-million-12956883.html",
            "description": "A jackup rig is a mobile offshore unit which is typically used to drill oil and natural gas from ocean beds.",
            "pubDate": "2025-03-05T12:56:14.383354"
        },
        {
            "title": "Deepak Nitrite shares rally after Kotak Institutional's upgrade to 'Add', target price raised",
            "link": "https://www.moneycontrol.com/news/business/stocks/deepak-nitrite-shares-rally-after-kotak-institutional-s-upgrade-to-add-target-price-raised-12956817.html",
            "description": "Kotak Institutional has cut EPS estimate for Deepak Nitrite due to margin pressures and has revised its fair value target slightly higher to Rs 2,020.",
            "pubDate": "2025-03-05T12:56:14.383418"
        },
        {
            "title": "RBZ Jewellers shares crash 6% after reporting a Rs 2 crore fraud by employee",
            "link": "https://www.moneycontrol.com/news/business/stocks/rbz-jewellers-shares-crash-6-after-reporting-a-rs-2-crore-fraud-by-employee-12956771.html",
            "description": "Its cashier Om Kumar Manoj Kumar Shukla allegedly falsified the company's records at one of its branches over a period of time.",
            "pubDate": "2025-03-05T12:56:14.383482"
        },
        {
            "title": "Tata Steel, SAIL, other steel stocks surge up to 4% after China announces plans to cut steel output",
            "link": "https://www.moneycontrol.com/news/business/markets/tata-steel-sail-other-steel-stocks-surge-up-to-4-after-china-announces-plans-to-cut-steel-output-12956710.html",
            "description": "The latest move by China is expected to reduce the dumping of cheap steel into the Indian market, which would act as a major positive to the Indian steel companies.",
            "pubDate": "2025-03-05T12:56:14.383673"
        },
        {
            "title": "Adani Wilmar shares rise 6% as firm buys 80% stake in GD Foods, to buy 'Tops' maker in next 3 years",
            "link": "https://www.moneycontrol.com/news/business/stocks/adani-wilmar-shares-rise-6-as-firm-buys-80-stake-in-gd-foods-to-buy-tops-maker-in-next-3-years-12956676.html",
            "description": "The 'Tops' brand is among the top 3 players in the tomato ketchup and pickles category.",
            "pubDate": "2025-03-05T12:56:14.383736"
        },
        {
            "title": "As SEBI cracks down on F&O, brokers eye algo-trading as new revenue stream",
            "link": "https://www.moneycontrol.com/news/business/markets/as-sebi-cracks-down-on-f-o-brokers-eye-algo-trading-as-new-revenue-stream-12956679.html",
            "description": "A retail investor can access algo-trading in two ways. One, he can go on a do-it-yourself (DIY) platform and create investment strategies. Two, he can use an existing investment strategy offered by a broker or a fintech company.",
            "pubDate": "2025-03-05T12:56:14.383803"
        },
        {
            "title": "M&M shares rally 3% after UBS upgrades to Buy but lowers price target, Tesla fears an 'overreaction' as demand will revive",
            "link": "https://www.moneycontrol.com/news/business/stocks/m-m-shares-rally-3-after-ubs-upgrades-to-buy-but-lowers-price-target-tesla-fears-an-overreaction-as-demand-will-revive-12956697.html",
            "description": "UBS said it sees 'limited impact' on M&M shares from Tesla’s potential entry, which are 'not-well suited' for Indian markets, given low ground clearance, sedan form factor, and high prices.",
            "pubDate": "2025-03-05T12:56:14.383870"
        },
        {
            "title": "Small and midcap indices recover for a second day after a five-month losing streak",
            "link": "https://www.moneycontrol.com/news/business/stocks/bse-smallcap-midcap-rise-2-on-second-day-of-continued-recovery-and-respite-12956691.html",
            "description": "The underperformance, marked by record lows since September 2024, has started to see some recovery in the mid and smallcap indices.",
            "pubDate": "2025-03-05T12:56:14.383934"
        }
    ]
}