{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-11-08T06:57:46.484734",
    "items": [
        {
            "title": "Stock Radar: Lupin, Cummins, NHPC, SAIL, ITD Cementation, Astral, Emami, RVNL, Indian Hotels, Emcure Pharma in focus on Friday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-lupin-cummins-nhpc-sail-itd-cementation-astral-emami-rvnl-indian-hotels-emcure-pharma-in-focus-on-friday-12860881.html",
            "description": "Stocks like VA Tech Wabag, Ircon International, Indian Metals & Ferro Alloys, Gujarat State Petronet, Nelcast, Cochin Shipyard, Aditya Birla Fashion & Retail, GR Infraprojects, and Teamlease Services will also be in focus on November 8.",
            "pubDate": "2024-11-08T01:40:47.563462"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty signals a flat start; US, Asian markets gain post Fed rate cut",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-08-11-2024-liveblog-12860890.html",
            "description": "Sensex Today | Stock Market LIVE Updates: US stocks closed higher on Thursday, after the Federal Reserve announced a cut of 25 basis points (bps) in interest rates, extending a sharp rally sparked by Donald Trump's return as U.S. president. The Fed cut interest rates by a quarter of a percentage point as policymakers took note of a job market that has \"generally eased\" while inflation continues to move toward the U.S. central bank's 2% target.",
            "pubDate": "2024-11-08T02:39:32.746031"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-74-12860416.html",
            "description": "The GIFT Nifty is indicating a flat to positive start for the day.",
            "pubDate": "2024-11-08T02:39:32.746122"
        },
        {
            "title": "Gland Pharma's outlook brightens, but will it shine is the key question",
            "link": "https://www.moneycontrol.com/news/opinion/gland-pharmas-outlook-brightens-but-will-it-shine-is-the-key-question-12860910.html",
            "description": "The company's performance is recovering, with an improved guidance lending confidence. Still, it's not business as usual, a crucial acquisition must deliver results soon and a new CEO is waiting in the wings",
            "pubDate": "2024-11-08T03:01:48.071249"
        },
        {
            "title": "Agri Picks Report November 08, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-november-08-2024-geojit-financial-services-12860937.html",
            "description": "According to Geojit, Farmers in Maharashtra have sown rabi crops over 621,315 hectares as of Tuesday, down 40.3% on year from 1.04 million hectares a year ago, according to a report released by the state's agriculture department.",
            "pubDate": "2024-11-08T03:27:02.150866"
        },
        {
            "title": "Live: How will markets react to US Fed's rate action? | SBI, Tata Motors in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-how-will-markets-react-to-us-feds-rate-action-sbi-tata-motors-in-focus-opening-bell-12860929.html",
            "description": "Frontline indices Sensex and Nifty snapped their two day winning streak and declined over 1 percent each. A broad-based selloff was witnessed with volatility rising in trade. Experts now eye Nifty to see a resistance at 24,500 with support placed at 24,000. This morning global cues are strong. US stocks ended higher overnight after the US Federal Reserve reduced interest rates by another 25 basis points to 4.5-4.75 percent. Asia-Pacific markets also started the day on a positive note. Among stocks in focus, watch out for SBI, Tata Motors, and M&amp;M. Catch Lovisha Darad in conversation with Raja Venkatraman, Co-Founder, NeoTrader &amp; Trading Influencer and Aishvarya Dadheech-- Founder &amp; CIO, Fident Asset Management.",
            "pubDate": "2024-11-08T03:39:49.874383"
        },
        {
            "title": "Metro Brands | This Premium Footwear Retailer Has Robust Growth Plans",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/metro-brands-this-premium-footwear-retailer-has-robust-growth-plans-12860953.html",
            "description": "MBL is a premium footwear retailer having a portfolio of brands to serve the entire family needs. MBL is rapidly enhancing network presence and growth prospects are encouraging in the long run. MBL is tying up with reputed global footwear players to bring in premium products to serve the growing affluent consumers in the country.",
            "pubDate": "2024-11-08T03:54:57.244205"
        },
        {
            "title": "India's renewable majors could face the chill as Trump reiterates anti-clean energy stance",
            "link": "https://www.moneycontrol.com/news/business/markets/indias-renewable-majors-could-face-the-chill-as-trump-reiterates-anti-clean-energy-stance-12860813.html",
            "description": "Currently, several large Indian firms export solar modules to the US, and new protectionist policies could add challenges, also because India imports a significant portion of its solar cells from China.",
            "pubDate": "2024-11-08T04:13:33.242436"
        },
        {
            "title": "Emcure Pharma share surge 6% after healthy Q2 earnings show",
            "link": "https://www.moneycontrol.com/news/business/markets/emcure-pharma-share-surge-6-after-healthy-q2-earnings-show-12860943.html",
            "description": "Emcure Pharma's profit growth in Q2 was supported by a solid double-digit spike in revenues in the quarter, led by strong gains across key markets.",
            "pubDate": "2024-11-08T04:13:33.242514"
        },
        {
            "title": "Buy CCL Products; target of Rs 881: LKP Research",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-ccl-products-target-of-rs-881-lkp-research-12860999.html",
            "description": "LKP Research is bullish on CCL Products has recommended buy rating on the stock with a target price of Rs 881 in its research report dated November 08, 2024.",
            "pubDate": "2024-11-08T04:13:33.242584"
        },
        {
            "title": "Nifty, Sensex extend losses despite positive cues after Fed rate cut; consolidation to continue",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-extend-losses-despite-positive-cues-after-fed-rate-cut-consolidation-to-continue-12860930.html",
            "description": "Shares of SBI, Tata Motors, Vedanta, Ola Electric, LIC, and Ashok Leyland among others will be buzzing in trade as the companies will release their quarterly earnings scorecard.",
            "pubDate": "2024-11-08T04:13:33.242651"
        },
        {
            "title": "Revenue slump, rising costs dent Great Eastern Shipping's Q2 profit, shares down 8%",
            "link": "https://www.moneycontrol.com/news/business/markets/revenue-slump-rising-costs-dent-great-eastern-shippings-q2-profit-shares-down-8-12860954.html",
            "description": "The company said that while the conflict in the Red Sea previously contributed to ton-mile growth for product tankers, the switching of\nVLCC and Suezmax tankers from crude to clean products negatively impacted the market share of product tankers.",
            "pubDate": "2024-11-08T04:43:19.360570"
        },
        {
            "title": "Apollo Hospitals' well rounded Q2 performance sparks optimism among brokerages",
            "link": "https://www.moneycontrol.com/news/business/markets/apollo-hospitals-well-rounded-q2-performance-sparks-optimism-among-brokerages-12861005.html",
            "description": "Apollo Hospitals’ strong Q2 earnings, bolstered by growth across its hospital, HealthCo, and lifestyle verticals, drew positive reviews from brokerages. Apollo Hospitals' share price also surged to a record high as brokerages remain bullish over the company's growth prospects across all key segments.",
            "pubDate": "2024-11-08T04:43:19.360657"
        },
        {
            "title": "Indian Hotels stock jumps 4% on stellar Q2 earnings; brokerages cautious after recent run-up",
            "link": "https://www.moneycontrol.com/news/business/markets/indian-hotels-stock-jumps-4-on-stellar-q2-earnings-brokerages-cautious-after-recent-run-up-12861018.html",
            "description": "Indian Hotels stock soared as Q2 net profit surged 232 percent on-year to Rs 554.6 crore, driven by robust revenue growth, improved occupancy rates, and strategic consolidation initiatives, bolstering investor confidence in its long-term outlook.",
            "pubDate": "2024-11-08T04:43:19.360794"
        },
        {
            "title": "SAIL reports 31% drop in Q2 net profit, stock slips 4%",
            "link": "https://www.moneycontrol.com/news/business/earnings/sail-reports-31-drop-in-q2-net-profit-stock-slips-4-12860962.html",
            "description": "In the June quarter, the steel company posted a net profit of Rs 81.78 crore, according to the filing",
            "pubDate": "2024-11-08T04:43:19.360862"
        },
        {
            "title": "IRCON stock slips 5% as Q2 results disappoint; margins narrow amid revenue, PAT decline",
            "link": "https://www.moneycontrol.com/news/business/markets/ircon-stock-slips-5-as-q2-result-disappoint-margins-narrow-amid-revenue-pat-decline-12861108.html",
            "description": "Ircon International stock fell as the company reported a 18 percent decline in net profit to Rs 206 crore, compared to Rs 250.7 crore in the corresponding period last year.",
            "pubDate": "2024-11-08T05:17:43.028228"
        },
        {
            "title": "Trent Q2 has multiple growth levers",
            "link": "https://www.moneycontrol.com/news/business/stocks/trent-has-multiple-growth-levers-12861099.html",
            "description": "Trent is among the fastest-growing consumption companies and the strong growth momentum is likely to continue. New initiatives like the Zudio Beauty store, international forays, and lab-grown diamonds will contribute to growth.",
            "pubDate": "2024-11-08T05:17:43.028314"
        },
        {
            "title": "Weekly Tactical Pick – Why the largest private sector bank cannot be ignored",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/weekly-tactical-pick-why-the-largest-private-sector-bank-cannot-be-ignored-12861093.html",
            "description": "There are a couple of triggers for the stock in the near to medium term.",
            "pubDate": "2024-11-08T05:17:43.028386"
        },
        {
            "title": "RVNL shares plunge 7% on disappointing Q2 results; multibagger stock up 150% YTD",
            "link": "https://www.moneycontrol.com/news/business/markets/rvnl-shares-plunge-7-on-disappointing-q2-results-multibagger-stock-up-150-ytd-12861092.html",
            "description": "RVNL provides financial resource mobilisation services to support its projects. The company’s clientele includes Indian Railways.",
            "pubDate": "2024-11-08T05:17:43.028454"
        },
        {
            "title": "Why the crypto market is excited about Trump's victory",
            "link": "https://www.moneycontrol.com/news/opinion/why-the-crypto-market-is-excited-about-trumps-victory-12861167.html",
            "description": "Under the Trump administration, if the U.S. were to roll out a transparent, safe, and reliable regulatory approach, it could catalyse a new era for cryptocurrencies worldwide",
            "pubDate": "2024-11-08T05:57:14.985787"
        },
        {
            "title": "India Cements September quarter loss widens on year to Rs 240 crore, shares slip",
            "link": "https://www.moneycontrol.com/news/business/markets/india-cements-september-quarter-loss-widens-revenue-lower-on-year-12861273.html",
            "description": "The company said it expects substantial amounts by way of return of loans and advances from subsidiaries and associates, which is expected to 'alleviate the stress to the operations of the company'.",
            "pubDate": "2024-11-08T06:57:45.870866"
        }
    ]
}