{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-19T16:00:31.034824",
    "items": [
        {
            "title": "Sensex quiet near 75,300, Nifty above 22,800 on support from metals and financials, IT selloff weighs",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-quiet-near-75-300-nifty-above-22-800-on-support-from-metals-and-financials-it-selloff-weighs-12968781.html",
            "description": "As for the broader market, the midcap 100 and smallcap 100 indices mirrored positive trends and outperformed the frontline indices with gains of 0.8 and 0.7 percent, respectively.",
            "pubDate": "2025-03-19T05:09:51.148455"
        },
        {
            "title": "Are bad days for markets decisively over?",
            "link": "https://www.moneycontrol.com/news/business/earnings/are-bad-days-for-markets-decisively-over-12968796.html",
            "description": "In the medium term, there is a strong possibility of FIIs looking at India with renewed interest",
            "pubDate": "2025-03-19T05:09:51.148534"
        },
        {
            "title": "Agri Picks Report March 19, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-19-2025-geojit-financial-services-12968799.html",
            "description": "According to Geojit Financial Services, The sowing of summer crops in Gujarat fell 14% on year to 567,062 hectares as of Monday from 659,770 hectares sown in the corresponding period last year, according to a report released by the state agriculture department.",
            "pubDate": "2025-03-19T05:09:51.148604"
        },
        {
            "title": "Live: Can Nifty reclaim 23,000 and extend recovery to the third day? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-can-nifty-reclaim-23-000-and-extend-recovery-to-the-third-day-opening-bell-12968784.html",
            "description": "Markets recorded their biggest single-day gain in nearly two months, with the Nifty reclaiming 22,800 and the Sensex surpassing 75,300. All sectoral indices posted gains, while broader markets saw significant upward movement, with midcap stocks rising 2 percent and smallcaps gaining 3 percent. A total of 46 Nifty stocks closed higher, with the auto and financial sectors leading the rally. This morning, global cues were xxx. Among stocks, watch out for NTPC, Zydus Life, and GR Infraprojects in today's trading session. Catch Lovisha Darad in conversation with Rajesh Palviya, Senior Vice President Research (Head Technical & Derivatives), Axis Securities and Anil Rego, Founder and Fund Manager at Right Horizons PMS.",
            "pubDate": "2025-03-19T05:09:51.148672"
        },
        {
            "title": "Sensex, Nifty eye third straight day of gains: Key levels to watch today",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-eye-third-straight-gain-key-levels-to-watch-today-12968763.html",
            "description": "With sentiment improving, there is scope for further upside, with 23,000 acting as a key resistance. A decisive move above this level could open the door for targets of 23,800 and 24,200 in the coming days.",
            "pubDate": "2025-03-19T05:09:51.148738"
        },
        {
            "title": "NACL acquisition will help Coromandel reduce dependence on regulated business",
            "link": "https://www.moneycontrol.com/news/opinion/nacl-acquisition-will-help-coromandel-reduce-dependence-on-regulated-business-12968762.html",
            "description": "Companies have greater pricing freedom in non-subsidy based businesses",
            "pubDate": "2025-03-19T05:09:51.148808"
        },
        {
            "title": "Tata Steel, JSW Steel, SAIL shares surge up to 4% after DGTR recommends 12% safeguard duty on select steel products",
            "link": "https://www.moneycontrol.com/news/business/stocks/dgtr-recommends-12-safeguard-duty-on-steel-products-shares-of-tata-steel-jsw-steel-among-others-in-focus-12968767.html",
            "description": "The recommendation came after the authority observed that there has been a sudden spike in the imports of these products into India. This could have a serious impact on the domestic companies.",
            "pubDate": "2025-03-19T05:09:51.148874"
        },
        {
            "title": "Zydus Lifesciences share price gain on final USFDA approval for cancer drug",
            "link": "https://www.moneycontrol.com/news/business/stocks/zydus-lifesciences-share-price-in-focus-on-final-usfda-approval-for-cancer-drug-12968479.html",
            "description": "Zydus Lifesciences Share Price | Apalutamide is an androgen receptor inhibitor indicated for the treatment of patients with metastatic castration-sensitive prostate cancer. The tablets will be produced at Ahmedabad facility, it added.",
            "pubDate": "2025-03-19T05:09:51.148941"
        },
        {
            "title": "G R Infraprojects shares rise 7% on LoA for Rs 4,262.78 crore project",
            "link": "https://www.moneycontrol.com/news/business/stocks/g-r-infraprojects-shares-in-focus-on-project-win-worth-rs-4-262-78-crore-12968583.html",
            "description": "G R Infraprojects Share Price | The company board of directors at its meeting held on March 7, 2025 declared the interim dividend of Rs 12.50 per equity share of face value of Rs 5 per equity share for the financial year 2024-25.",
            "pubDate": "2025-03-19T05:09:51.149011"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty at 22,900, Sensex up 170 pts; NTPC, BSE, Tata Steel, Zomato most active",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-19-03-2025-liveblog-12968743.html",
            "description": "Sensex Today | Stock Market LIVE Updates: One Mobikwik, BSE Limited, Tata Steel, Zomato, NTPC are among most active shares on the NSE. BSE Midcap and smallcap indices up 1 percent each. Except IT, FMCG, all other sectoral indices are trading in the green.",
            "pubDate": "2025-03-19T05:09:51.149080"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-67-12967955.html",
            "description": "After remaining net sellers for last 17 sessions, the Foreign institutional investors (FIIs) bought equities worth Rs 1,462.96 crore on March 18. Domestic institutional investors (DIIs) also bought equities of Rs 2,028.15 crore, on the same day.",
            "pubDate": "2025-03-19T05:09:51.149152"
        },
        {
            "title": "Trade Spotlight: How should you trade Tata Steel, Can Fin Homes, Amber Enterprises, Gabriel India, Torrent Power, Cipla, and others on March 19?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-tata-steel-can-fin-homes-amber-enterprises-gabriel-india-torrent-power-cipla-and-others-on-march-19-12968690.html",
            "description": "The market is expected to remain in positive territory amid consolidation. Below are some trading ideas for the near term.",
            "pubDate": "2025-03-19T05:09:51.149232"
        },
        {
            "title": "Stocks to Watch Today: Bajaj Auto, LIC, Dr Reddys Labs Zydus Lifesciences, GR Infraprojects, Super Iron Foundry, Uflex in focus on 19 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-bajaj-auto-lic-dr-reddys-labs-zydus-lifesciences-gr-infraprojects-super-iron-foundry-uflex-in-focus-on-19-march-12968689.html",
            "description": "Stocks to Watch, Mar 19: Stocks like ESAF Small Finance Bank, Granules India, Westlife Foodworld, Strides Pharma Science, TVS Supply Chain Solutions, Dr Reddys Laboratories, TD Power Systems, Larsen & Toubro, Zen Technologies, Brookfield India Real Estate Trust REIT, and Jyoti Structures will be in focus on March 19.",
            "pubDate": "2025-03-19T05:09:51.149306"
        },
        {
            "title": "Nifty IT sheds 2% ahead of Fed outcome; TCS, Tech Mahindra, HCL Tech worst performers",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-it-sheds-2-ahead-of-fed-outcome-tcs-tech-mahindra-hcl-tech-worst-performers-12969011.html",
            "description": "The selloff comes as worries about a US recession intensify, with the Federal Reserve’s ongoing monetary policy meeting adding to uncertainty.",
            "pubDate": "2025-03-19T07:27:12.837039"
        },
        {
            "title": "Traders on edge as SEBI’s new rules could drain market liquidity",
            "link": "https://www.moneycontrol.com/news/opinion/traders-on-edge-as-sebi-s-new-rules-could-drain-market-liquidity-12968710.html",
            "description": "The Securities and Exchange Board of India (SEBI) is tightening regulations on derivative trading to curb manipulation and reduce investor losses. However, industry experts warn these measures may significantly reduce market liquidity and increase volatility.",
            "pubDate": "2025-03-19T07:27:12.837184"
        },
        {
            "title": "Sugar stocks led by Balrampur, Shree Renuka extend gains for second day, ISMA dispels shortage scare",
            "link": "https://www.moneycontrol.com/news/business/markets/sugar-stocks-led-by-balrampur-uttam-sugar-extend-gains-for-second-day-isma-dispels-shortage-scare-12968925.html",
            "description": "Fear of a tighter supply and a sustained demand may lead to higher sugar prices, benefitting sugar mills. However, millers’ association ISMA has dispelled concerns of any sugar shortage this season.",
            "pubDate": "2025-03-19T07:27:12.837322"
        },
        {
            "title": "Markets rise for 3rd day: Sensex up 150 pts, Nifty at 22,900 as PSU bank, metal stocks rally; IT, FMCG drag",
            "link": "https://www.moneycontrol.com/news/business/markets/markets-rise-for-3rd-day-sensex-up-150-pts-nifty-at-22-900-as-psu-bank-metal-stocks-rally-it-fmcg-drag-12968939.html",
            "description": "Key factors shaping the recent trend include a softer dollar index, which has eased from 110-111 to 103, and a noticeable decline in foreign institutional investor (FII) selling, which has dropped by nearly 40-50 percent and better-than-expected inflation data",
            "pubDate": "2025-03-19T07:27:12.837387"
        },
        {
            "title": "Market rebound: Why investors are wary of its sustainability",
            "link": "https://www.moneycontrol.com/news/business/markets/market-rebound-why-investors-are-wary-of-its-sustainability-12968797.html",
            "description": "All eyes are on FOMC meeting, but investors more concerned about Trump policy than rate action, said market experts",
            "pubDate": "2025-03-19T07:27:12.837519"
        },
        {
            "title": "Buy Grasim Industries; target of Rs 3093: ICICI Direct",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-grasim-industries-target-of-rs-3093-icici-direct-12968922.html",
            "description": "ICICI Direct is bullish on Grasim Industries recommended buy rating on the stock with a target price of Rs 3093 in its research report dated March 19, 2025.",
            "pubDate": "2025-03-19T07:27:12.837604"
        },
        {
            "title": "Cera Sanitaryware: India’s leading building materials company with strong operating metrics",
            "link": "https://www.moneycontrol.com/news/videos/business/earnings/cera-sanitaryware-india-s-leading-building-materials-company-with-strong-operating-metrics-12968931.html",
            "description": "Cera Sanitaryware has an impeccable track record of over three decades, strong brand and dominant position, and extensive retail network. While the sanitaryware business remains the largest revenue contributor, the company has successful diversified into related businesses (Faucetware, Tiles, Wellness) to emerge as a complete bathroom solutions provider.",
            "pubDate": "2025-03-19T07:27:12.837671"
        },
        {
            "title": "Taking Stock: Market extends gain on third day; eyes on Fed policy outcome",
            "link": "https://www.moneycontrol.com/news/business/markets/taking-stock-market-extends-gain-on-third-day-eyes-on-fed-policy-outcome-12969200.html",
            "description": "Except IT, FMCG, all other sectoral indices ended in the green with Consumer Durables, Capital Goods, Realty, Oil & Gas, Media, Metal, Power, PSU Bank up 1-2.8 percent.",
            "pubDate": "2025-03-19T16:00:23.182615"
        },
        {
            "title": "Live: Nifty surges for third straight day, nears 23,000 | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-surges-for-third-straight-day-nears-23-000-closing-bell-12969367.html",
            "description": "Market smiles for third straight day. Nifty above 22,900; crosses 40-dma\nBroader markets outperform benchmarks. Midcap, smallcap indices surge over 2%\nCatch Lovisha Darad in conversation with Milan Vaishnav, Founder and Technical Analyst, ChartWizard FZE and Gemstone Equity Research as they discuss market movements.",
            "pubDate": "2025-03-19T16:00:23.182691"
        },
        {
            "title": "Buy CreditAccess Grameen; target of Rs 1130: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-creditaccess-grameen-target-of-rs-1130-geojit-financial-services-12969228.html",
            "description": "Geojit Financial Services is bullish on CreditAccess Grameen has recommended buy rating on the stock with a target price of Rs 1130 in its research report dated March 19, 2025.",
            "pubDate": "2025-03-19T16:00:23.182757"
        },
        {
            "title": "Nifty Midcap index soars 2.6% on bargain buying to post biggest intraday rise since June 2024",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-midcap-index-soars-2-5-on-bargain-buying-to-post-biggest-intraday-rise-since-june-2024-12969236.html",
            "description": "The shares of small cap stocks also saw significant rise on March 19, with the Nifty Smallcap index jumping over 2 percent to to close at around 15,748.",
            "pubDate": "2025-03-19T16:00:23.182820"
        },
        {
            "title": "Third day of gains take Nifty past 22,900 as broader markets surge over 2%",
            "link": "https://www.moneycontrol.com/news/business/markets/sensex-up-nearly-400-pts-from-day-s-low-nifty-above-22-900-small-midcap-indices-rise-up-to-3-12969253.html",
            "description": "Markets now turn their focus to the Federal Reserve's March FOMC meeting on Tuesday and Wednesday, where investors widely expect rates to remain unchanged at 4.25–4.5 percent. Attention will also be on the updated economic projections set to be released on Wednesday.",
            "pubDate": "2025-03-19T16:00:23.182883"
        },
        {
            "title": "REC declares fourth interim dividend of Rs 3.60, record date set as March 26",
            "link": "https://www.moneycontrol.com/news/business/markets/rec-declares-fourth-interim-dividend-of-rs-3-60-record-date-set-as-march-26-12969026.html",
            "description": "The record date to determine the eligibility of the shareholders set to receive the payment has been set on March 26. The dividend is set to be dispatched to the eligible shareholders on or before April 16.",
            "pubDate": "2025-03-19T16:00:23.183070"
        },
        {
            "title": "IndusInd, SBI, others rise up to 4% as momentum takes Bank Nifty higher for a fifth session",
            "link": "https://www.moneycontrol.com/news/business/markets/indusind-sbi-others-rise-up-to-4-as-momentum-takes-bank-nifty-higher-for-a-fifth-session-12968942.html",
            "description": "Axis Securities predicted a bullish outlook for Nifty Bank, as well as the benchmark Nifty 50 index.",
            "pubDate": "2025-03-19T16:00:23.183132"
        },
        {
            "title": "Bajaj Healthcare shares rally nearly 10% as firm gets SEC-CDSCO nod for clinical trials of anti-seizure drug",
            "link": "https://www.moneycontrol.com/news/business/markets/bajaj-healthcare-shares-rally-nearly-10-as-firm-gets-sec-cdsco-nod-for-clinical-trials-of-anti-seizure-drug-12969008.html",
            "description": "Bajaj Healthcare said that it aims to provide a safe and effective treatment option for epilepsy patients in India through the 'Cenobamate' tablets.",
            "pubDate": "2025-03-19T16:00:23.183204"
        }
    ]
}