{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-02-21T15:32:06.851454",
    "items": [
        {
            "title": "Jefferies sees hospital stocks as pockets of strong earnings visibility in uncertain market",
            "link": "https://www.moneycontrol.com/news/business/markets/jefferies-sees-hospital-stocks-as-pockets-of-strong-earnings-visibility-in-uncertain-market-12946971.html",
            "description": "Jefferies prefers hospital players that have higher brownfield bed expansion plans lined up for the coming years. Max Healthcare remains its top sectoral pick.",
            "pubDate": "2025-02-21T03:49:26.743721"
        },
        {
            "title": "Live: What can drive a rangebound Nifty ahead? | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-what-can-drive-a-rangebound-nifty-ahead-opening-bell-12946953.html",
            "description": "The market is set to wrap up a lackluster and uneventful week, with the Nifty stuck within a tight 300-point range. Bulls have battled fiercely to hold the 22,800 level, but any attempts to push beyond 23,000 have lacked conviction, making it clear that momentum remains elusive. Experts now see Nifty’s immediate target at 23,000, with a potential move toward 23,200 if momentum picks up. However, failure to hold above 23,000 could prolong the consolidation phase, with crucial support resting at 22,700. This morning, global cues were largely lower. US markets saw selloff overnight due to weak forecast from Walmart. Asian markets too opened lower as investors digested Japanese hot inflation data for January. Among stocks, watch out for NTPC Green, Tata Steel, and HG Infra in today's trading session. Catch Lovisha Darad in conversation with Osho Krishan, Sr. Analyst - Technical &amp; Derivative Research, Angel One and market veteran Ambareesh Baliga.",
            "pubDate": "2025-02-21T03:49:26.743797"
        },
        {
            "title": "Stock Market LIVE Updates| Market trades marginally lower at pre-opening; Shanghai, Hang Seng lead Asia higher",
            "link": "https://www.moneycontrol.com/news/opinion/stock-market-live-updates-gift-nifty-trades-lower-shanghai-hang-seng-lead-asia-higher-liveblog-12946933.html",
            "description": "Stock Market LIVE Updates| Sensex Today| Indian equity indices ended lower on third consecutive session on February 20 with Nifty around 22,900. At close, the Sensex was down 203.22 points or 0.27 percent at 75,735.96, and the Nifty was down 19.75 points or 0.09 percent at 22,913.15.",
            "pubDate": "2025-02-21T03:49:26.743867"
        },
        {
            "title": "Stocks to Watch Today: Quality Power, Cipla, Delta Corp, Kotak Bank, JM Financial, Berger Paints, Amara Raja Energy in focus on 21 February",
            "link": "https://www.moneycontrol.com/news/business/stocks/stocks-to-watch-today-quality-power-cipla-delta-corp-kotak-bank-jm-financial-berger-paints-amara-raja-energy-in-focus-on-21-february-12946925.html",
            "description": "Stocks To Watch, Feb 21: Stocks like CIE Automotive India, Sanofi Consumer Healthcare, Delta Corp, Mahindra and Mahindra, Grindwell Norton, Keystone Realtors, HG Infra Engineering, Tanla Platforms, Samvardhana Motherson International, ITI, NTPC Green Energy, Tata Steel, and Narayana Hrudayalaya will be in focus on February 21.",
            "pubDate": "2025-02-21T03:49:26.743933"
        },
        {
            "title": "Dow Jones down 1.27% after Wallmart projects a slower sales growth",
            "link": "https://www.moneycontrol.com/news/business/markets/dow-jones-down-1-27-after-wallmart-projects-a-slower-sales-growth-12946911.html",
            "description": "Robinhood Markets Inc, shares fell over 6 percent during the trading session amid a broader sell-off in speculative stocks, including Palantir.",
            "pubDate": "2025-02-21T03:49:26.743998"
        },
        {
            "title": "Trade Spotlight: How should you trade Shriram Finance, MOIL, SRF, Jindal Steel, NTPC, Indraprastha Gas, and others on February 21?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-shriram-finance-moil-srf-jindal-steel-ntpc-indraprastha-gas-and-others-on-february-21-12946897.html",
            "description": "The upward journey may continue if the bulls gain further strength in the upcoming sessions. Below are some trading ideas for the near term.",
            "pubDate": "2025-02-21T03:49:26.744064"
        },
        {
            "title": "Alkem Labs sees Rs 300 crore worth equity change hands in large deal",
            "link": "https://www.moneycontrol.com/news/business/markets/alkem-labs-sees-rs-300-crore-worth-equity-change-hands-in-large-deal-12946997.html",
            "description": "",
            "pubDate": "2025-02-21T03:57:05.801865"
        },
        {
            "title": "Sebi mulls review of accredited investors framework, says they don't need same protection as Rs 250 SIP investors",
            "link": "https://www.moneycontrol.com/news/business/markets/sebi-mulls-review-of-accredited-investors-framework-says-they-don-t-need-same-protection-as-rs-250-sip-investors-12947435.html",
            "description": "Sebi's Ananth Narayan added that if India has to create the next DeepSeek, a lot of money should flow into startups, particularly greenfield projects and fresh startups.",
            "pubDate": "2025-02-21T15:30:51.357146"
        },
        {
            "title": "Tata Steel, SAIL, NMDC shares gain on buzz of safeguard duty on steel imports, Nifty Metal shines for 5th day",
            "link": "https://www.moneycontrol.com/news/business/markets/tata-steel-sail-nmdc-shares-gain-on-buzz-of-safeguard-duty-on-steel-imports-nifty-metal-shines-for-5th-day-12947347.html",
            "description": "Nifty Metal was the only sectoral index that settled in green while others sectors ended in the red in Friday's trading session.",
            "pubDate": "2025-02-21T15:30:51.357243"
        },
        {
            "title": "Top gainers & losers today: Stocks that moved the most on February 21",
            "link": "https://www.moneycontrol.com/news/business/stocks/top-gainers-losers-today-stocks-that-moved-the-most-on-february-21-12947343.html",
            "description": "Bank Nifty, M&M, Religare Enterprises were among top gainers and losers;  At closing, both Sensex and Nifty stood 0.65% lower,",
            "pubDate": "2025-02-21T15:30:51.357315"
        },
        {
            "title": "Live: Nifty clocks third weekly loss, down 12 out of last 13 sessions | Closing Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-nifty-clocks-third-weekly-loss-down-12-out-of-last-13-sessions-closing-bell-12947340.html",
            "description": "Sensex, Nifty extend losses to 4th day. Sensex below 75,400; Nifty fails to hold 22,800. Barring Nifty Metal, all setcors nosedive in the red. Nifty Metal index extends gain to 5th straight day. Midcap, Smallcap indices snap 2-day winning streak. Catch Lovisha Darad and Yatin Mota as they discuss stocks on their radar.",
            "pubDate": "2025-02-21T15:30:51.357389"
        },
        {
            "title": "SUV maker M&M poised for worst week in five years as Tesla warms up for India foray",
            "link": "https://www.moneycontrol.com/news/business/stocks/suv-maker-m-m-poised-for-worst-week-in-five-years-as-tesla-warms-up-for-india-foray-12947240.html",
            "description": "There has been a slew of news flow concerning investors, including increasing competition in the EV space, possible over-valuation of the stock price, and company's recent plans of investing in the rights issue of two of its listed subsidiaries.",
            "pubDate": "2025-02-21T15:30:51.357455"
        },
        {
            "title": "F&O entrant IREDA's shares up 4%, extending gains for a third day on high volumes",
            "link": "https://www.moneycontrol.com/news/business/stocks/f-o-entrant-ireda-s-shares-up-4-extending-gains-for-a-third-day-on-high-volumes-12947194.html",
            "description": "The recent rally in IREDA share price was fuelled after NSE announced the addition of the futures and options (F&O) contracts of the stock from February 28 onwards.",
            "pubDate": "2025-02-21T15:30:51.357523"
        },
        {
            "title": "BHEL shares fall for a third day on concerns over arbitration impact",
            "link": "https://www.moneycontrol.com/news/business/stocks/bhel-shares-fall-for-a-third-day-on-concerns-over-arbitration-impact-12947136.html",
            "description": "The selloff follows a 5 percent fall seen on February 18, when the arbitration was initiated by Ducon Tech.",
            "pubDate": "2025-02-21T15:30:51.357589"
        },
        {
            "title": "Tata Motors, M&M, Hyundai Motor India shares fall up to 6% amid buzz of new EV policy",
            "link": "https://www.moneycontrol.com/news/business/markets/tata-motors-m-m-hyundai-motor-india-fall-up-to-6-on-reports-of-govt-easing-ev-import-rules-12947075.html",
            "description": "M&M shares saw their biggest single-day fall in nearly 7 months; Geojit Financial says Tesla may not be able to match M&M in terms of pricing, distribution and services",
            "pubDate": "2025-02-21T15:30:51.357853"
        },
        {
            "title": "Bank Nifty falls 1% as all constituents trade in red; Kotak, ICICI Bank down up to 1.5%",
            "link": "https://www.moneycontrol.com/news/business/stocks/bank-nifty-falls-1-as-all-constituents-trade-in-red-kotak-icici-bank-down-up-to-1-5-12947054.html",
            "description": "The markets are still reeling under the effect of concerns over potential new tariffs from US President Donald Trump and cautious signals from US Federal Reserve officials",
            "pubDate": "2025-02-21T15:30:51.357918"
        },
        {
            "title": "Bandhan Bank shares surge 5% after CLSA upgrades stock, sees 61% upside",
            "link": "https://www.moneycontrol.com/news/business/markets/bandhan-bank-shares-surge-5-after-clsa-upgrades-stock-sees-61-upside-12947024.html",
            "description": "CLSA sees Bandhan as a key beneficiary of the MFI recovery cycle, supported by its shift toward secured loans.",
            "pubDate": "2025-02-21T15:30:51.357982"
        },
        {
            "title": "Agri Picks Report February 21, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-february-21-2025-geojit-financial-services-12946998.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana increased to 6.8 million acres (1 acre = 0.4 hectares) as of Wednesday,up nearly 9.1% from 6.2 million acres a year ago, according to a report by the state agriculture department.",
            "pubDate": "2025-02-21T15:30:51.358045"
        },
        {
            "title": "Weekly Tactical Pick: Why one should consider this defence PSU",
            "link": "https://www.moneycontrol.com/news/business/moneycontrol-research/why-one-should-consider-this-defence-psu-12946985.html",
            "description": "Bharat Dynamics' strong order book, rising exports, and improving execution make it a good bet in the current market",
            "pubDate": "2025-02-21T15:30:51.358111"
        },
        {
            "title": "Religare Ent shares spring up 9% after Burman family gains controlling stake",
            "link": "https://www.moneycontrol.com/news/business/markets/religare-ent-shares-spring-up-9-after-burman-family-gains-controlling-stake-12947002.html",
            "description": "Following the open offer, the Burman's now own a 25.16 percent stake in Religare Enterprises.",
            "pubDate": "2025-02-21T15:30:51.358176"
        },
        {
            "title": "Indian Hotels share price up 2% on Morgan Stanley's 'overweight' call",
            "link": "https://www.moneycontrol.com/news/business/markets/indian-hotels-share-price-up-2-on-morgan-stanley-s-overweight-call-12946989.html",
            "description": "Indian Hotels share price: Morgan Stanley analysts suggest ICHL has strong support from Mumbai’s hospitality market. RevPAR or revenue per available room growth in Mumbai and Delhi stood at 21 percent each in January",
            "pubDate": "2025-02-21T15:30:51.358255"
        },
        {
            "title": "Suzlon Energy shares rise 2% as Investec initiates coverage with 'buy'",
            "link": "https://www.moneycontrol.com/news/business/markets/suzlon-energy-shares-rise-2-as-investec-initiates-coverage-with-buy-12946962.html",
            "description": "Suzlon Energy share price: Investec forecasts Suzlon’s revenue and PAT to grow at a CAGR of 55 percent and 66 percent, respectively, over FY24-FY27, with RoE expected to rise to 32 percent by FY27 from 28.5 percent in FY24.",
            "pubDate": "2025-02-21T15:30:51.358321"
        },
        {
            "title": "JSW Energy shares rise 7% as Morgan Stanley remains 'overweight', 16% upside seen",
            "link": "https://www.moneycontrol.com/news/business/markets/jsw-energy-shares-rise-3-as-morgan-stanley-remains-overweight-16-upside-seen-12946973.html",
            "description": "JSW Energy share price: The brokerage is bullish on its well-integrated business model and strong position in India's energy transition and security.",
            "pubDate": "2025-02-21T15:30:51.358385"
        }
    ]
}