{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-09-26T03:43:22.200380",
    "items": [
        {
            "title": "Live: After 5 days of losses, more pain ahead for Nifty? | Pharma, IT stocks in focus | Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-after-5-days-of-losses-more-pain-ahead-for-nifty-pharma-it-stocks-in-focus-opening-bell-13581292.html",
            "description": "Nifty extended its losing streak for the fifth straight session, slipping 166 points to fall below the 24,900 mark. Except for Nifty Metal, all indices ended in the red, with Realty, IT, Auto and Pharma stocks facing selling pressure, while the broader markets also witnessed profit-booking for the fourth day in a row. This morning, global cues were negative. US markets edged lower overnight for the third straight session after President Donald Trump imposed 100 percent duty on imported branded or patented pharma products unless made in US. Asia-Pacific markets also inched lower this morning following weak Wall Street cues. Catch Lovisha Darad in conversation with Raja Venkatraman, Co-Founder, NeoTrader & Trading Influencer and Radha Raman Agarwal, Managing Director and CEO, Swyom Advisors.",
            "pubDate": "2025-09-26T03:43:14.357065"
        },
        {
            "title": "Asia’s top defense stock DroneShield soars on military spending",
            "link": "https://www.moneycontrol.com/news/business/asia-s-top-defense-stock-droneshield-soars-on-military-spending-13580802.html",
            "description": "Defense stocks have rallied this year as ongoing conflicts and geopolitical tensions have spurred governments to ramp up spending.",
            "pubDate": "2025-09-26T03:43:14.357147"
        },
        {
            "title": "RITES shares in focus on locomotives supply order win",
            "link": "https://www.moneycontrol.com/news/business/markets/rites-shares-in-focus-on-locomotives-supply-order-win-13580444.html",
            "description": "RITES share price | The company received a contract to supply of locomotives to Talis Logistics, South Africa.",
            "pubDate": "2025-09-26T03:43:14.357223"
        },
        {
            "title": "Ceigall India shares in focus on project win of Rs 509 crore from GMADA",
            "link": "https://www.moneycontrol.com/news/business/stocks/ceigall-india-shares-in-focus-on-project-win-of-rs-509-crore-from-gmada-13580443.html",
            "description": "Ceigall India Share Price | Greater Mohali Area Development Authority has awarded a contract of Rs 509 crore to the company.",
            "pubDate": "2025-09-26T03:43:14.357294"
        },
        {
            "title": "First Tick: Top global cues to watch in today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-global-cues-to-watch-in-today-s-trade-9-13578281.html",
            "description": "FIIs continued their selling on their fourth consecutive session on September 25 as they sold equities worth Rs 4995 crore, while DIIs bought equities of over Rs 5000 crore on the same day.",
            "pubDate": "2025-09-26T03:43:14.357367"
        },
        {
            "title": "Stock Market LIVE Updates: Sensex, Nifty down at pre-open; RITES, pharma, IT stocks in fcous",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-26-09-2025-liveblog-13580752.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Stocks like RITES, Ceigall India, Nuvoco Vistas Corporation, Bharat Heavy Electricals, Amber Enterprises India, Ventive Hospitality, Polycab India, GRM Overseas, Awfis Space Solutions, Saatvik Green Energy, and GK Energy will be in focus on September 26. Pharma stocks will remain in focus after US imposes tariffs on branded drugs.",
            "pubDate": "2025-09-26T03:43:14.357436"
        },
        {
            "title": "Asian shares decline, Trump tariffs spook pharma",
            "link": "https://www.moneycontrol.com/news/business/asian-stocks-drop-after-wall-street-rally-stalls-13580744.html",
            "description": "After a $15 trillion rebound in global equities from April’s lows, traders now face a wall of uncertainty as tariff headlines return to weigh on markets.",
            "pubDate": "2025-09-26T03:43:14.357500"
        },
        {
            "title": "Stocks to Watch Today: Amber Enterprises, RITES, Ceigall India, Polycab, GRM Overseas, Saatvik Green Energy, Ventive Hospitality in focus on 26 September",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-amber-enterprises-rites-ceigall-india-polycab-grm-overseas-saatvik-green-energy-ventive-hospitality-in-focus-on-26-september-13580706.html",
            "description": "Stocks to watch, 26 September: Stocks like RITES, Ceigall India, Nuvoco Vistas Corporation, Bharat Heavy Electricals, Amber Enterprises India, Ventive Hospitality, Polycab India, GRM Overseas, Awfis Space Solutions, Saatvik Green Energy, and GK Energy will be in focus on September 26.",
            "pubDate": "2025-09-26T03:43:14.357566"
        },
        {
            "title": "Trade Spotlight: How should you trade Gujarat Fluorochemicals, BEML, SBI Card, AU SFB, Vedanta, Poonawalla Fincorp, and others on September 26?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-gujarat-fluorochemicals-beml-sbi-card-au-sfb-vedanta-poonawalla-fincorp-and-others-on-september-26-13580687.html",
            "description": "The bearish sentiment may sustain in the short term, given the weakening momentum. Below are some short-term trading ideas to consider.",
            "pubDate": "2025-09-26T03:43:14.357629"
        }
    ]
}