{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2025-03-10T04:26:24.270105",
    "items": [
        {
            "title": "Nazara Technologies: Strong growth from transformative acquisitions",
            "link": "https://www.moneycontrol.com/news/business/markets/nazara-technologies-strong-growth-from-transformative-acquisitions-12960291.html",
            "description": "The new sources of revenues can potentially double the company’s top line over the next 18-24 months",
            "pubDate": "2025-03-10T04:26:11.852030"
        },
        {
            "title": "Nifty above 22,600, Sensex in green in early trade; IndusInd Bank down 5%; VIX up 4%",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-above-22-600-sensex-in-green-in-early-trade-indusind-bank-down-5-vix-up-4-12960252.html",
            "description": "The upcoming trading week will be a holiday-shortened one, with market participants closely monitoring global developments in the absence of major domestic events.",
            "pubDate": "2025-03-10T04:26:11.852118"
        },
        {
            "title": "Investing in the Cash Economy: Why CMS Info Systems stands out",
            "link": "https://www.moneycontrol.com/news/business/stocks/investing-in-the-cash-economy-why-cms-info-systems-stands-out-12960259.html",
            "description": "The company’s financial profile remains strong, aided by steady revenue growth, solid margins, healthy order book, and earnings visibility",
            "pubDate": "2025-03-10T04:26:11.852197"
        },
        {
            "title": "Agri Picks Report March 10, 2025: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-march-10-2025-geojit-financial-services-12960272.html",
            "description": "According to Geojit Financial Services, Sowing of rabi crops in Telangana was at 7.3 million acres (1 acre = 0.4 hectares) as of Wednesday, up 10.3% from 6.6 million acres a year ago, according to a report released by the state agriculture department.",
            "pubDate": "2025-03-10T04:26:11.852287"
        },
        {
            "title": "Live: India Wins The Champions Trophy; Will Market Join The Celebrations?| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-india-wins-the-champions-trophy-will-market-join-the-celebrations-opening-bell-12960253.html",
            "description": "The Nifty 50 finished rangebound trading flat with a positive bias, continuing its uptrend for the third consecutive session on March 7. The index sustained above the bearish gap of February 28 for another session with above-average volumes, indicating positivity, though there was some profit-taking at higher levels. Hence, according to experts, as long as the index holds 22,500 in the upcoming sessions, an upward journey toward the 22,750-22,800 zone is possible. However, if it falls below 22,500, the support is placed at 22,300. This will be an important week for the Nifty as it would determine whether the trend would be on the upside or downside after last week’s upmove. IndusInd Bank, Sun Pharma are among the stocks to watch out for today. Catch Nandita Khemka in conversation with Sudeep Shah—Head of Technical & Derivative Research, SBI Securities and market expert Ajay Bagga.",
            "pubDate": "2025-03-10T04:26:11.852356"
        },
        {
            "title": "Merchant power producers in a sweet spot on rising demand, limited generation capacity",
            "link": "https://www.moneycontrol.com/news/opinion/merchant-power-producers-in-a-sweet-spot-on-rising-demand-limited-generation-capacity-12960230.html",
            "description": "Given the long construction timelines of new projects, companies are finding it lucrative to purchase and turn around financially troubled power plants.",
            "pubDate": "2025-03-10T04:26:11.852427"
        },
        {
            "title": "RailTel Corporation shares up 3% on order win worth Rs 28.29 crore; board meet on March 12",
            "link": "https://www.moneycontrol.com/news/business/stocks/railtel-corporation-shares-in-focus-on-order-win-worth-rs-28-29-crore-board-meet-on-march-12-12960119.html",
            "description": "RailTel Corporation of India Share Price | In the previous week, company received the work order from State Transport Authority Odisha for project business amounting to Rs 2,62,33,85,540 for upgradation of existing Command Control Centre to Unified Command Control Centre & Implementation of Intelligent Enforcement Management System (lEMS) for State Transport Authority.",
            "pubDate": "2025-03-10T04:26:11.852499"
        },
        {
            "title": "HFCL shares gain after arm bags order of Rs 44.36 crore from Indian Army",
            "link": "https://www.moneycontrol.com/news/business/stocks/hfcl-shares-in-focus-after-arm-bags-order-of-rs-44-36-crore-from-indian-army-12960120.html",
            "description": "HFCL share price | The company recorded 10.4 percent fall in its December quarter (Q3FY25) net profit at Rs 73.65 crore from Rs 82.24 crore in December 2023.",
            "pubDate": "2025-03-10T04:26:11.852566"
        },
        {
            "title": "Stock Market LIVE Updates: Nifty at 22,650, Sensex up 310 pts; media, metal, FMCG shine",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-10-03-2025-liveblog-12960215.html",
            "description": "Sensex Today | Stock Market LIVE Updates: Among sectors, except auto and consumer durables, all other sectoral indices are trading in the green with power, metal, media up 1 percent each.  Power Grid Corp, Bajaj Finance, Bajaj Finserv, Bharat Electronics, Shriram Finance are among major gainers on the Nifty, while losers are IndusInd Bank, M&M, Bajaj Auto, Trent, Titan Company. BSE Midcap and Smallcap indices are trading flat.",
            "pubDate": "2025-03-10T04:26:11.852634"
        },
        {
            "title": "First Tick: Here are the top global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-here-are-the-top-global-cues-for-today-s-trade-61-12959542.html",
            "description": "US stocks finished higher on Friday, rebounding from early declines after Federal Reserve Chair Jerome Powell said the economy was \"in a good place,\" but uncertainty about U.S. trade policy led to Wall Street's biggest weekly decline in months.",
            "pubDate": "2025-03-10T04:26:11.852702"
        },
        {
            "title": "Stocks to Watch Today: Lupin, Tata Power, Nazara Tech, Shilpa Medicare, GMR Airports, IRB Infra, Railtel, Shyam Metalics in focus on 10 March",
            "link": "https://www.moneycontrol.com/news/business/markets/stocks-to-watch-today-lupin-tata-power-nazara-tech-shilpa-medicare-gmr-airports-irb-infra-railtel-shyam-metalics-in-focus-on-10-march-12960206.html",
            "description": "Stocks to Watch, Mar 10: Stocks like India Pesticides, HFCL, NDR Auto Components, JSW Steel, GR Infraprojects, Biocon, Oil and Natural Gas Corporation, Container Corporation of India, Thangamayil Jewellery, Hinduja Global Solutions, IRB Infrastructure Developers, and AstraZeneca Pharma will be in focus on March 10.",
            "pubDate": "2025-03-10T04:26:11.852767"
        }
    ]
}