{
    "title": "RSS Feed Title",
    "link": "https://example.com",
    "description": "RSS Feed Description",
    "lastBuildDate": "2024-10-30T06:36:35.092635",
    "items": [
        {
            "title": "Brokerage Radar: Analysts turn cautious on SBI Cards; Nomura raises Bharti Airtel's target price",
            "link": "https://www.moneycontrol.com/news/business/markets/brokerage-radar-analysts-turn-cautious-on-sbi-cards-nomura-raises-bharti-airtels-target-price-12854450.html",
            "description": "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Maruti Suzuki, Marico, SBI Cards and more.",
            "pubDate": "2024-10-30T02:35:55.098593"
        },
        {
            "title": "Stock Market LIVE Updates: GIFT Nifty suggests a flat start; US, Asian markets gain",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-30-10-2024-liveblog-12854435.html",
            "description": "Sensex Today | Stock Market LIVE Updates: The Nasdaq scored a record closing high and the S&P 500 rose on Tuesday, while the Dow fell as investors digested a host of corporate earnings and awaited Google-parent Alphabet's  results that came after the market close.",
            "pubDate": "2024-10-30T02:35:55.098684"
        },
        {
            "title": "First Tick: Top 10 global cues for today’s trade",
            "link": "https://www.moneycontrol.com/news/business/markets/first-tick-top-10-global-cues-for-todays-trade-68-12853892.html",
            "description": "The GIFT Nifty is indicating a muted start for the day.",
            "pubDate": "2024-10-30T02:35:55.098763"
        },
        {
            "title": "Swiggy sets price band of Rs 371-390 a share for IPO",
            "link": "https://www.moneycontrol.com/news/business/ipo/swiggy-sets-price-band-of-rs-371-390-a-share-for-ipo-12854429.html",
            "description": "The anchor book will open on November 5, basis of allotment and initiation of refunds will be on November 11, credit of equity shares will be on November 12 and the stock will list on exchanges on November 13.",
            "pubDate": "2024-10-30T02:35:55.098832"
        },
        {
            "title": "Stock Radar: Voltas, Marico, Torrent Pharma, Godavari Biorefineries, Sar Televenture, Kaynes Tech, Hitachi Energy in focus on Wednesday",
            "link": "https://www.moneycontrol.com/news/business/markets/stock-radar-voltas-marico-torrent-pharma-godavari-biorefineries-sar-televenture-kaynes-tech-hitachi-energy-in-focus-on-wednesday-12854420.html",
            "description": "Stocks like Glaxosmithkline Pharmaceuticals, Container Corporation, Prestige Estates Projects, Capri Global Capital, Redington, Motisons Jewellers, Honeywell Automation, MTAR Technologies, and Welspun Enterprises will also be in focus on October 30.",
            "pubDate": "2024-10-30T02:35:55.098901"
        },
        {
            "title": "Trade Spotlight: How should you trade Bharti Airtel, MCX India, BSE, Bharat Electronics, LIC, Trent and others on Wednesday?",
            "link": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-how-should-you-trade-bharti-airtel-mcx-india-bse-bharat-electronics-lic-trent-and-others-on-wednesday-12854406.html",
            "description": "The market may consolidate until decisively climbing above short-term moving averages in the upcoming sessions. Below are some trading ideas for the near term.",
            "pubDate": "2024-10-30T02:35:55.098971"
        },
        {
            "title": "Marico's steady Q2 results sparks optimism, brokerages project up to 27% upside potential",
            "link": "https://www.moneycontrol.com/news/business/earnings/maricos-steady-q2-results-sparks-optimism-brokerages-project-up-to-27-upside-potential-12854498.html",
            "description": "Jefferies shared a 'buy' rating on Marico and assigned Rs 800 apiece as target price",
            "pubDate": "2024-10-30T03:31:54.848609"
        },
        {
            "title": "Marico: Better demand, steady execution a plus for valuations",
            "link": "https://www.moneycontrol.com/news/business/earnings/marico-better-demand-steady-execution-a-plus-for-valuations-12854475.html",
            "description": "Steady trends in core and the scale-up of new businesses will drive growth",
            "pubDate": "2024-10-30T03:31:54.848700"
        },
        {
            "title": "World Street | Visa plans 1,400 layoffs; EU hikes tariffs on Chinese EVs; Google parent Alphabet reports strong Q3 growth; and more",
            "link": "https://www.moneycontrol.com/news/business/markets/world-street-visa-plans-1400-layoffs-eu-hikes-tariffs-on-chinese-evs-google-parent-alphabet-reports-strong-q3-growth-and-more-12854477.html",
            "description": "From Visa's planned layoffs to the EU's increased tariffs on Chinese electric vehicles and ByteDance's surge in revenue, here’s a look at recent business developments",
            "pubDate": "2024-10-30T03:31:54.848773"
        },
        {
            "title": "Agri Picks Report October 30, 2024: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/agri-picks-report-october-30-2024-geojit-financial-services-12854529.html",
            "description": "According to Geojit, Farmers in Gujarat have sown kharif crops over 8.49 million hectares as of Oct. 14, down slightly by 1.4% on year, according to the final kharif sowing report released by the state's agriculture department.",
            "pubDate": "2024-10-30T03:53:22.434859"
        },
        {
            "title": "Live: Close Above 24,500 Crucial; Will Banks Continue To Drive Gains? L&T Q2 Today| Opening Bell",
            "link": "https://www.moneycontrol.com/news/videos/business/markets/live-close-above-24500-crucial-will-banks-continue-to-drive-gains-lt-q2-today-opening-bell-12854506.html",
            "description": "Indian equity market extended gains for another session, rising half a percent, but still traded within the previous day's range and below the 100-day EMA (Exponential Moving Average - 24,475) on a closing basis. This rally was primarily backed by banks on October 29. Experts say until the Nifty 50 decisively closes above 24,500, further upward movement will be  challenging. Stocks to watch out for include Marico, Torrent Pharma. Meanwhile, L&T and Dabur report Q2 earnings today. Catch Nandita Khemka in conversation with Osho Krishan, Sr. Analyst - Technical & Derivative Research, Angel One and Deven Choksey, Managing Director, DRChoksey FinServ.",
            "pubDate": "2024-10-30T03:53:22.434945"
        },
        {
            "title": "Multiple near-term challenges may hijack Cipla's growth trajectory",
            "link": "https://www.moneycontrol.com/news/business/markets/multiple-near-term-challenges-may-hijack-ciplas-growth-trajectory-12854508.html",
            "description": "Cipla projects a mid-FY26 launch for Advair, while the release of Abraxane is contingent on regulatory clearance of the company's Goa facility. Respiratory drug Albuterol faces intensifying competition, while similar concerns loom over the blockbuster cancer drug Revlimid, whose patent is set to expire in 2026.",
            "pubDate": "2024-10-30T04:10:13.131943"
        },
        {
            "title": "Kaynes Technology's shares surge 6% on strong Q2 earnings",
            "link": "https://www.moneycontrol.com/news/business/markets/kaynes-technologys-shares-surge-6-on-strong-q2-earnings-12854476.html",
            "description": "Kaynes Tech's orderbook stood at Rs 5,422.8 crore as of September 30, 2024, providing strong revenue visibility for FY25 and beyond.",
            "pubDate": "2024-10-30T04:10:13.132039"
        },
        {
            "title": "Voltas shares plunge 6% following Q2 results",
            "link": "https://www.moneycontrol.com/news/business/markets/voltas-shares-plunge-6-following-q2-results-12854543.html",
            "description": "Sequentially, Voltas' consolidated net profit dropped by 60 percent and revenue from operations by 47 percent.",
            "pubDate": "2024-10-30T04:32:02.980363"
        },
        {
            "title": "Torrent Pharma stock drops 4% as promoter likely pares stake in Rs 3,239 cr block deal",
            "link": "https://www.moneycontrol.com/news/business/markets/torrent-pharma-stock-drops-4-as-promoter-likely-pares-stake-in-rs-3239-cr-block-deal-12854546.html",
            "description": "As much as 1.04 crore shares, making up a 3.1 percent stake in Torrent Pharma changed hands at an over 3 percent discount from the stock's previous closing price.",
            "pubDate": "2024-10-30T04:32:02.980450"
        },
        {
            "title": "Nifty, Sensex fall, snap 2-day streak as pharma stocks decline; Auto stocks rise",
            "link": "https://www.moneycontrol.com/news/business/markets/nifty-sensex-fall-snap-2-day-streak-as-pharma-stocks-decline-auto-stocks-rise-12854504.html",
            "description": "Among sectors, Nifty Auto was the top gainer, rising almost a percent higher after Maruti Suzuki, Tata Motors, Bajaj Auto and Hyundai Motor lifted the sentiment.",
            "pubDate": "2024-10-30T04:32:02.980519"
        },
        {
            "title": "Current valuations 10-25% above 15 year average but they are justifiable: Prashant Jain of 3P",
            "link": "https://www.moneycontrol.com/news/business/markets/current-valuations-10-25-above-15-year-average-but-they-are-justifiable-prashant-jain-of-3p-12854140.html",
            "description": "In a wide-ranging interview, the founder and CIO of the investment advisory firm gives the broad contours of a sound investment strategy and highlights likely risky bets while reposing faith in India's economic story.",
            "pubDate": "2024-10-30T04:32:02.980588"
        },
        {
            "title": "SBI Cards falls 3% on weak Q2 results, brokerages downgrade stock, warn of tough FY25 ahead",
            "link": "https://www.moneycontrol.com/news/business/earnings/sbi-cards-falls-3-on-weak-q2-results-brokerages-downgrade-stock-warn-of-tough-fy25-ahead-12854547.html",
            "description": "Majority of brokerages reduced their outlook on the counter, slashing target prices, seeing difficult remainder of the year",
            "pubDate": "2024-10-30T04:44:39.091877"
        },
        {
            "title": "Shriram Properties soars 7% as firm eyes Rs 750 cr revenue from Pune land parcel",
            "link": "https://www.moneycontrol.com/news/business/markets/shriram-properties-soars-7-as-firm-eyes-rs-750-cr-revenue-from-pune-land-parcel-12854565.html",
            "description": "Shriram Properties aims to launch the project in the second half of FY25. It boasts a robust pipeline of 42 projects, including 26 ongoing projects with 24.3 million sq ft of saleable area.",
            "pubDate": "2024-10-30T04:44:39.091954"
        },
        {
            "title": "Consumption slowdown is positive as it isn't growing via debt, says Prashant Jain of 3P Investment Managers",
            "link": "https://www.moneycontrol.com/news/business/markets/consumption-slowdown-is-positive-as-it-is-not-growing-via-debt-says-prashant-jain-of-3p-investment-managers-12853679.html",
            "description": "'Whenever consumption is supported by rising leverage, it means one is preponing consumption and consumption is growing ahead of income levels which will lead to a moderation in demand,' says Jain.",
            "pubDate": "2024-10-30T04:59:37.495616"
        },
        {
            "title": "Timeless lessons from ‘The Intelligent Investor’ for today's market",
            "link": "https://www.moneycontrol.com/news/opinion/timeless-lessons-from-the-intelligent-investor-for-todays-market-12854597.html",
            "description": "Benjamin Graham's ‘The Intelligent Investor’, published in 1949, remains a vital investment guide. It introduces the concept of Mr. Market, urging investors to focus on intrinsic value and seize opportunities amid market irrationality, relevant even in today's Indian stock market context.",
            "pubDate": "2024-10-30T05:20:34.677512"
        },
        {
            "title": "RITES stock jumps 3% on MoU with SAIL-Bokaro Steel Plant for railway infrastructure",
            "link": "https://www.moneycontrol.com/news/business/markets/rites-stock-jumps-3-on-mou-with-sail-bokaro-steel-plant-for-railway-infrastructure-12854675.html",
            "description": "RITES is a Navratna PSU which provides a wide range of transportation infrastructure and related technology services, from idea to completion.",
            "pubDate": "2024-10-30T05:36:51.100468"
        },
        {
            "title": "Stocks on Radar: Torrent Pharma, Reliance, RITES, Fortis in Focus | October 30 Updates",
            "link": "https://www.moneycontrol.com/news/videos/business/stocks/stocks-on-radar-torrent-pharma-reliance-rites-fortis-in-focus-october-30-updates-12854902.html",
            "description": "Today, we’re covering the latest stock market updates and key stocks to watch. Torrent Pharmaceuticals is in the spotlight as promoter Torrent Investments plans to sell up to 2.9% of its stake at ₹3,022.71 per share, targeting up to ₹3,000 crore. Reliance Industries has acquired the remaining shares in Faradion, making it a wholly-owned subsidiary. RITES signed an MoU with SAIL-Bokaro to manage rail connectivity projects in Jharkhand. Fortis Healthcare received CCI approval to acquire all remaining stakes in Agilus Diagnostics, and Sar Televenture's board approved acquiring a 91% stake in Tikona Infinet for ₹669.04 crore through cash and share swap. For more insights on these developments, like, share, and subscribe!",
            "pubDate": "2024-10-30T06:36:27.509597"
        },
        {
            "title": "Prashant Jain uses cricket analogy to explain current market situation, says singles are preferred over boundaries",
            "link": "https://www.moneycontrol.com/news/business/markets/prashant-jain-uses-cricket-analogy-to-explain-current-market-situation-says-singles-are-preferred-over-boundaries-12853881.html",
            "description": "In short, Jain says, 'Reset your return expectations and focus on quality and valuations. This is not the market to chase high returns.'",
            "pubDate": "2024-10-30T06:36:27.509690"
        },
        {
            "title": "Garden Reach Shipbuilders sees 4% rise in shares after securing Rs 491 crore order",
            "link": "https://www.moneycontrol.com/news/business/markets/garden-reach-shipbuilders-sees-4-rise-in-shares-after-securing-rs-491-crore-order-12854698.html",
            "description": "The contract involves the design, development, construction, integration of equipment, testing, certification, commissioning, and supply of one Acoustic Research Ship (ARS).",
            "pubDate": "2024-10-30T06:36:27.509762"
        },
        {
            "title": "Honeywell Automation shares tank 8% after fall in Q2 net profit",
            "link": "https://www.moneycontrol.com/news/business/markets/honeywell-automation-shares-tank-8-after-fall-in-q2-net-profit-12854583.html",
            "description": "Honeywell Automation India's parent company- Honeywell, also projected annual sales below Wall Street expectations and missed quarterly revenue estimates last week.",
            "pubDate": "2024-10-30T06:36:27.509831"
        },
        {
            "title": "Diwali Stock Picks 2024: Zomato, REC, Coal India among top bets for Samvat 2081",
            "link": "https://www.moneycontrol.com/news/business/markets/zomato-rec-coal-india-among-top-stock-picks-for-samvat-2081-12854728.html",
            "description": "The National Stock Exchange (NSE), BSE, and even the commodity exchange MCX will conduct the Muhurat Trading session on November 1 to mark the beginning for Samvat 2081. Here are some top stocks picks for the year.",
            "pubDate": "2024-10-30T06:36:27.509969"
        },
        {
            "title": "Indian markets about 10% overvalued, limited upside for further re-rating: Prashant Jain of 3P Investment Managers",
            "link": "https://www.moneycontrol.com/news/business/markets/indian-markets-about-10-overvalued-limited-upside-for-further-re-rating-prashant-jain-of-3p-investment-managers-12853739.html",
            "description": "From a near-term perspective, growth in largecaps could be around 12 percent CAGR but it will be quite low in small- and mid-caps as they are relatively weaker companies when compared to the larger counterparts in the same sectors, Jain said.",
            "pubDate": "2024-10-30T06:36:27.510038"
        },
        {
            "title": "Force Motors hits 20% upper circuit on healthy Q2FY25 results",
            "link": "https://www.moneycontrol.com/news/business/earnings/force-motors-hits-20-upper-circuit-on-healthy-q2fy25-results-12854598.html",
            "description": "In Q2, the company's consolidated net profit jumped 43 percent YoY to Rs 134 crore",
            "pubDate": "2024-10-30T06:36:27.510105"
        },
        {
            "title": "Buy Bharat Electronics; target of Rs 323: Geojit Financial Services",
            "link": "https://www.moneycontrol.com/news/business/stocks/buy-bharat-electronics-target-of-rs-323-geojit-financial-services-12854727.html",
            "description": "Geojit Financial Services is bullish on Bharat Electronics has recommended buy rating on the stock with a target price of Rs 323 in its research report dated October 30, 2024.",
            "pubDate": "2024-10-30T06:36:27.510175"
        }
    ]
}